#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_BD_GDF_WarFactory

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ABP_BD_GDF_WarFactory_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "Tempest_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_BD_GDF_WarFactory.ABP_BD_GDF_WarFactory_C
// 0x0250 (0x0680 - 0x0430)
class UABP_BD_GDF_WarFactory_C final : public UTedAnimInstance_Structure
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0430(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct ABP_BD_GDF_WarFactory::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;        // 0x0438(0x0010)(HasGetValueTypeHash)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0448(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0450(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0458(0x0020)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x0478(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x04C0(0x0048)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive;                       // 0x0508(0x00C8)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose;                        // 0x05D0(0x0010)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x05E0(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0628(0x0048)()
	bool                                          Working;                                           // 0x0670(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_BD_GDF_WarFactory_AnimGraphNode_SequencePlayer_485C1F224788E1EBD7BC5DA983F15518();
	void ExecuteUbergraph_ABP_BD_GDF_WarFactory(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_BD_GDF_WarFactory_C">();
	}
	static class UABP_BD_GDF_WarFactory_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_BD_GDF_WarFactory_C>();
	}
};
static_assert(alignof(UABP_BD_GDF_WarFactory_C) == 0x000010, "Wrong alignment on UABP_BD_GDF_WarFactory_C");
static_assert(sizeof(UABP_BD_GDF_WarFactory_C) == 0x000680, "Wrong size on UABP_BD_GDF_WarFactory_C");
static_assert(offsetof(UABP_BD_GDF_WarFactory_C, UberGraphFrame) == 0x000430, "Member 'UABP_BD_GDF_WarFactory_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_BD_GDF_WarFactory_C, __AnimBlueprintMutables) == 0x000438, "Member 'UABP_BD_GDF_WarFactory_C::__AnimBlueprintMutables' has a wrong offset!");
static_assert(offsetof(UABP_BD_GDF_WarFactory_C, AnimBlueprintExtension_PropertyAccess) == 0x000448, "Member 'UABP_BD_GDF_WarFactory_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UABP_BD_GDF_WarFactory_C, AnimBlueprintExtension_Base) == 0x000450, "Member 'UABP_BD_GDF_WarFactory_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UABP_BD_GDF_WarFactory_C, AnimGraphNode_Root) == 0x000458, "Member 'UABP_BD_GDF_WarFactory_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_BD_GDF_WarFactory_C, AnimGraphNode_Slot) == 0x000478, "Member 'UABP_BD_GDF_WarFactory_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(UABP_BD_GDF_WarFactory_C, AnimGraphNode_SequencePlayer_1) == 0x0004C0, "Member 'UABP_BD_GDF_WarFactory_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UABP_BD_GDF_WarFactory_C, AnimGraphNode_ApplyAdditive) == 0x000508, "Member 'UABP_BD_GDF_WarFactory_C::AnimGraphNode_ApplyAdditive' has a wrong offset!");
static_assert(offsetof(UABP_BD_GDF_WarFactory_C, AnimGraphNode_LocalRefPose) == 0x0005D0, "Member 'UABP_BD_GDF_WarFactory_C::AnimGraphNode_LocalRefPose' has a wrong offset!");
static_assert(offsetof(UABP_BD_GDF_WarFactory_C, AnimGraphNode_BlendListByBool) == 0x0005E0, "Member 'UABP_BD_GDF_WarFactory_C::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(UABP_BD_GDF_WarFactory_C, AnimGraphNode_SequencePlayer) == 0x000628, "Member 'UABP_BD_GDF_WarFactory_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UABP_BD_GDF_WarFactory_C, Working) == 0x000670, "Member 'UABP_BD_GDF_WarFactory_C::Working' has a wrong offset!");

}

