#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_VH_DYN_MCV

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct ABP_VH_DYN_MCV.ABP_VH_DYN_MCV_C.AnimBlueprintGeneratedConstantData
// 0x052F (0x0530 - 0x0001)
struct ABP_VH_DYN_MCV::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_114;                                // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_115;                                // 0x000C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_116;                                 // 0x0014(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_117;                                // 0x0018(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_118;                                 // 0x0020(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_119;                                // 0x0024(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_120;                                 // 0x002C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_121;                                // 0x0030(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_122;                               // 0x0034(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_123;                              // 0x0038(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_124;                               // 0x0064(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_125;                                // 0x0068(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_126;                                // 0x0069(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_127;                                // 0x006A(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6B[0x1];                                       // 0x006B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_128;                                // 0x006C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_129;                                // 0x0074(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_130;                                // 0x007C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_131;                                 // 0x0084(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimNodeFunctionRef                   __StructProperty_132;                              // 0x0088(0x0020)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x00A8(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0128(0x0018)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root;                           // 0x0140(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_3;               // 0x0170(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_5;             // 0x01A0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_4;             // 0x01D0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_3;             // 0x0200(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_2;             // 0x0230(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_1;             // 0x0260(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult;               // 0x0290(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalRefPose_1;                 // 0x02C0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_3;                  // 0x02F0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_2;               // 0x0320(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_2;                  // 0x0350(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_1;               // 0x0380(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TwoWayBlend;                    // 0x03B0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalRefPose;                   // 0x03E0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_1;                  // 0x0410(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer;                 // 0x0440(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult;                    // 0x0470(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine;                   // 0x04A0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive;                  // 0x04D0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot;                           // 0x0500(0x0030)()
};
static_assert(alignof(ABP_VH_DYN_MCV::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on ABP_VH_DYN_MCV::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(ABP_VH_DYN_MCV::FAnimBlueprintGeneratedConstantData) == 0x000530, "Wrong size on ABP_VH_DYN_MCV::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(ABP_VH_DYN_MCV::FAnimBlueprintGeneratedConstantData, __NameProperty_114) == 0x000004, "Member 'ABP_VH_DYN_MCV::FAnimBlueprintGeneratedConstantData::__NameProperty_114' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_MCV::FAnimBlueprintGeneratedConstantData, __NameProperty_115) == 0x00000C, "Member 'ABP_VH_DYN_MCV::FAnimBlueprintGeneratedConstantData::__NameProperty_115' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_MCV::FAnimBlueprintGeneratedConstantData, __IntProperty_116) == 0x000014, "Member 'ABP_VH_DYN_MCV::FAnimBlueprintGeneratedConstantData::__IntProperty_116' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_MCV::FAnimBlueprintGeneratedConstantData, __NameProperty_117) == 0x000018, "Member 'ABP_VH_DYN_MCV::FAnimBlueprintGeneratedConstantData::__NameProperty_117' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_MCV::FAnimBlueprintGeneratedConstantData, __IntProperty_118) == 0x000020, "Member 'ABP_VH_DYN_MCV::FAnimBlueprintGeneratedConstantData::__IntProperty_118' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_MCV::FAnimBlueprintGeneratedConstantData, __NameProperty_119) == 0x000024, "Member 'ABP_VH_DYN_MCV::FAnimBlueprintGeneratedConstantData::__NameProperty_119' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_MCV::FAnimBlueprintGeneratedConstantData, __IntProperty_120) == 0x00002C, "Member 'ABP_VH_DYN_MCV::FAnimBlueprintGeneratedConstantData::__IntProperty_120' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_MCV::FAnimBlueprintGeneratedConstantData, __BoolProperty_121) == 0x000030, "Member 'ABP_VH_DYN_MCV::FAnimBlueprintGeneratedConstantData::__BoolProperty_121' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_MCV::FAnimBlueprintGeneratedConstantData, __FloatProperty_122) == 0x000034, "Member 'ABP_VH_DYN_MCV::FAnimBlueprintGeneratedConstantData::__FloatProperty_122' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_MCV::FAnimBlueprintGeneratedConstantData, __StructProperty_123) == 0x000038, "Member 'ABP_VH_DYN_MCV::FAnimBlueprintGeneratedConstantData::__StructProperty_123' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_MCV::FAnimBlueprintGeneratedConstantData, __FloatProperty_124) == 0x000064, "Member 'ABP_VH_DYN_MCV::FAnimBlueprintGeneratedConstantData::__FloatProperty_124' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_MCV::FAnimBlueprintGeneratedConstantData, __BoolProperty_125) == 0x000068, "Member 'ABP_VH_DYN_MCV::FAnimBlueprintGeneratedConstantData::__BoolProperty_125' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_MCV::FAnimBlueprintGeneratedConstantData, __EnumProperty_126) == 0x000069, "Member 'ABP_VH_DYN_MCV::FAnimBlueprintGeneratedConstantData::__EnumProperty_126' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_MCV::FAnimBlueprintGeneratedConstantData, __ByteProperty_127) == 0x00006A, "Member 'ABP_VH_DYN_MCV::FAnimBlueprintGeneratedConstantData::__ByteProperty_127' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_MCV::FAnimBlueprintGeneratedConstantData, __NameProperty_128) == 0x00006C, "Member 'ABP_VH_DYN_MCV::FAnimBlueprintGeneratedConstantData::__NameProperty_128' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_MCV::FAnimBlueprintGeneratedConstantData, __NameProperty_129) == 0x000074, "Member 'ABP_VH_DYN_MCV::FAnimBlueprintGeneratedConstantData::__NameProperty_129' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_MCV::FAnimBlueprintGeneratedConstantData, __NameProperty_130) == 0x00007C, "Member 'ABP_VH_DYN_MCV::FAnimBlueprintGeneratedConstantData::__NameProperty_130' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_MCV::FAnimBlueprintGeneratedConstantData, __IntProperty_131) == 0x000084, "Member 'ABP_VH_DYN_MCV::FAnimBlueprintGeneratedConstantData::__IntProperty_131' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_MCV::FAnimBlueprintGeneratedConstantData, __StructProperty_132) == 0x000088, "Member 'ABP_VH_DYN_MCV::FAnimBlueprintGeneratedConstantData::__StructProperty_132' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_MCV::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x0000A8, "Member 'ABP_VH_DYN_MCV::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_MCV::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000128, "Member 'ABP_VH_DYN_MCV::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_MCV::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root) == 0x000140, "Member 'ABP_VH_DYN_MCV::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_MCV::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_3) == 0x000170, "Member 'ABP_VH_DYN_MCV::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_3' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_MCV::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_5) == 0x0001A0, "Member 'ABP_VH_DYN_MCV::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_5' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_MCV::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_4) == 0x0001D0, "Member 'ABP_VH_DYN_MCV::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_4' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_MCV::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_3) == 0x000200, "Member 'ABP_VH_DYN_MCV::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_3' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_MCV::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_2) == 0x000230, "Member 'ABP_VH_DYN_MCV::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_2' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_MCV::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_1) == 0x000260, "Member 'ABP_VH_DYN_MCV::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_MCV::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult) == 0x000290, "Member 'ABP_VH_DYN_MCV::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_MCV::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LocalRefPose_1) == 0x0002C0, "Member 'ABP_VH_DYN_MCV::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LocalRefPose_1' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_MCV::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult_3) == 0x0002F0, "Member 'ABP_VH_DYN_MCV::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult_3' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_MCV::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_2) == 0x000320, "Member 'ABP_VH_DYN_MCV::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_MCV::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult_2) == 0x000350, "Member 'ABP_VH_DYN_MCV::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult_2' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_MCV::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_1) == 0x000380, "Member 'ABP_VH_DYN_MCV::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_MCV::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TwoWayBlend) == 0x0003B0, "Member 'ABP_VH_DYN_MCV::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TwoWayBlend' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_MCV::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LocalRefPose) == 0x0003E0, "Member 'ABP_VH_DYN_MCV::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LocalRefPose' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_MCV::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult_1) == 0x000410, "Member 'ABP_VH_DYN_MCV::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_MCV::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer) == 0x000440, "Member 'ABP_VH_DYN_MCV::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_MCV::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult) == 0x000470, "Member 'ABP_VH_DYN_MCV::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_MCV::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateMachine) == 0x0004A0, "Member 'ABP_VH_DYN_MCV::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_MCV::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ApplyAdditive) == 0x0004D0, "Member 'ABP_VH_DYN_MCV::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ApplyAdditive' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_MCV::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Slot) == 0x000500, "Member 'ABP_VH_DYN_MCV::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Slot' has a wrong offset!");

// ScriptStruct ABP_VH_DYN_MCV.ABP_VH_DYN_MCV_C.AnimBlueprintGeneratedMutableData
// 0x0007 (0x0008 - 0x0001)
struct ABP_VH_DYN_MCV::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty;                                   // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_VH_DYN_MCV::FAnimBlueprintGeneratedMutableData) == 0x000004, "Wrong alignment on ABP_VH_DYN_MCV::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(ABP_VH_DYN_MCV::FAnimBlueprintGeneratedMutableData) == 0x000008, "Wrong size on ABP_VH_DYN_MCV::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(ABP_VH_DYN_MCV::FAnimBlueprintGeneratedMutableData, __FloatProperty) == 0x000004, "Member 'ABP_VH_DYN_MCV::FAnimBlueprintGeneratedMutableData::__FloatProperty' has a wrong offset!");

}

