#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_BD_DYN_Turret_Flame

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "Tempest_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_BD_DYN_Turret_Flame.ABP_BD_DYN_Turret_Flame_C
// 0x0320 (0x0750 - 0x0430)
class UABP_BD_DYN_Turret_Flame_C final : public UTedAnimInstance_Structure
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0430(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0438(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0440(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0448(0x0020)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose;                        // 0x0468(0x0010)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x0478(0x0020)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x0498(0x0048)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x04E0(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x0500(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x0628(0x0128)()

public:
	void ExecuteUbergraph_ABP_BD_DYN_Turret_Flame(int32 EntryPoint);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_BD_DYN_Turret_Flame_AnimGraphNode_ModifyBone_D1DC6599468335FD121E97A6079E404F();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_BD_DYN_Turret_Flame_AnimGraphNode_ModifyBone_6F77C2C84F52A8C8A8249382C759EF24();
	void AnimGraph(struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_BD_DYN_Turret_Flame_C">();
	}
	static class UABP_BD_DYN_Turret_Flame_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_BD_DYN_Turret_Flame_C>();
	}
};
static_assert(alignof(UABP_BD_DYN_Turret_Flame_C) == 0x000010, "Wrong alignment on UABP_BD_DYN_Turret_Flame_C");
static_assert(sizeof(UABP_BD_DYN_Turret_Flame_C) == 0x000750, "Wrong size on UABP_BD_DYN_Turret_Flame_C");
static_assert(offsetof(UABP_BD_DYN_Turret_Flame_C, UberGraphFrame) == 0x000430, "Member 'UABP_BD_DYN_Turret_Flame_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_BD_DYN_Turret_Flame_C, AnimBlueprintExtension_PropertyAccess) == 0x000438, "Member 'UABP_BD_DYN_Turret_Flame_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UABP_BD_DYN_Turret_Flame_C, AnimBlueprintExtension_Base) == 0x000440, "Member 'UABP_BD_DYN_Turret_Flame_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UABP_BD_DYN_Turret_Flame_C, AnimGraphNode_Root) == 0x000448, "Member 'UABP_BD_DYN_Turret_Flame_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_BD_DYN_Turret_Flame_C, AnimGraphNode_LocalRefPose) == 0x000468, "Member 'UABP_BD_DYN_Turret_Flame_C::AnimGraphNode_LocalRefPose' has a wrong offset!");
static_assert(offsetof(UABP_BD_DYN_Turret_Flame_C, AnimGraphNode_LocalToComponentSpace) == 0x000478, "Member 'UABP_BD_DYN_Turret_Flame_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UABP_BD_DYN_Turret_Flame_C, AnimGraphNode_Slot) == 0x000498, "Member 'UABP_BD_DYN_Turret_Flame_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(UABP_BD_DYN_Turret_Flame_C, AnimGraphNode_ComponentToLocalSpace) == 0x0004E0, "Member 'UABP_BD_DYN_Turret_Flame_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UABP_BD_DYN_Turret_Flame_C, AnimGraphNode_ModifyBone_1) == 0x000500, "Member 'UABP_BD_DYN_Turret_Flame_C::AnimGraphNode_ModifyBone_1' has a wrong offset!");
static_assert(offsetof(UABP_BD_DYN_Turret_Flame_C, AnimGraphNode_ModifyBone) == 0x000628, "Member 'UABP_BD_DYN_Turret_Flame_C::AnimGraphNode_ModifyBone' has a wrong offset!");

}

