#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_VH_GDF_Skycrane

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct ABP_VH_GDF_Skycrane.ABP_VH_GDF_Skycrane_C.AnimBlueprintGeneratedConstantData
// 0x01FF (0x0200 - 0x0001)
struct ABP_VH_GDF_Skycrane::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_35;                                 // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_36;                               // 0x0010(0x0020)(BlueprintVisible, NoDestructor)
	bool                                          __BoolProperty_37;                                 // 0x0030(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_38;                                // 0x0034(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_39;                                // 0x0038(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_40;                                 // 0x003C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_41;                                 // 0x003D(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_42;                                 // 0x003E(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F[0x1];                                       // 0x003F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_43;                                 // 0x0040(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0048(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x00C8(0x0018)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root;                           // 0x00E0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_1;             // 0x0110(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive;                  // 0x0140(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot;                           // 0x0170(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer;               // 0x01A0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_RotationOffsetBlendSpace;       // 0x01D0(0x0030)()
};
static_assert(alignof(ABP_VH_GDF_Skycrane::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on ABP_VH_GDF_Skycrane::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(ABP_VH_GDF_Skycrane::FAnimBlueprintGeneratedConstantData) == 0x000200, "Wrong size on ABP_VH_GDF_Skycrane::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(ABP_VH_GDF_Skycrane::FAnimBlueprintGeneratedConstantData, __NameProperty_35) == 0x000004, "Member 'ABP_VH_GDF_Skycrane::FAnimBlueprintGeneratedConstantData::__NameProperty_35' has a wrong offset!");
static_assert(offsetof(ABP_VH_GDF_Skycrane::FAnimBlueprintGeneratedConstantData, __StructProperty_36) == 0x000010, "Member 'ABP_VH_GDF_Skycrane::FAnimBlueprintGeneratedConstantData::__StructProperty_36' has a wrong offset!");
static_assert(offsetof(ABP_VH_GDF_Skycrane::FAnimBlueprintGeneratedConstantData, __BoolProperty_37) == 0x000030, "Member 'ABP_VH_GDF_Skycrane::FAnimBlueprintGeneratedConstantData::__BoolProperty_37' has a wrong offset!");
static_assert(offsetof(ABP_VH_GDF_Skycrane::FAnimBlueprintGeneratedConstantData, __FloatProperty_38) == 0x000034, "Member 'ABP_VH_GDF_Skycrane::FAnimBlueprintGeneratedConstantData::__FloatProperty_38' has a wrong offset!");
static_assert(offsetof(ABP_VH_GDF_Skycrane::FAnimBlueprintGeneratedConstantData, __FloatProperty_39) == 0x000038, "Member 'ABP_VH_GDF_Skycrane::FAnimBlueprintGeneratedConstantData::__FloatProperty_39' has a wrong offset!");
static_assert(offsetof(ABP_VH_GDF_Skycrane::FAnimBlueprintGeneratedConstantData, __BoolProperty_40) == 0x00003C, "Member 'ABP_VH_GDF_Skycrane::FAnimBlueprintGeneratedConstantData::__BoolProperty_40' has a wrong offset!");
static_assert(offsetof(ABP_VH_GDF_Skycrane::FAnimBlueprintGeneratedConstantData, __EnumProperty_41) == 0x00003D, "Member 'ABP_VH_GDF_Skycrane::FAnimBlueprintGeneratedConstantData::__EnumProperty_41' has a wrong offset!");
static_assert(offsetof(ABP_VH_GDF_Skycrane::FAnimBlueprintGeneratedConstantData, __ByteProperty_42) == 0x00003E, "Member 'ABP_VH_GDF_Skycrane::FAnimBlueprintGeneratedConstantData::__ByteProperty_42' has a wrong offset!");
static_assert(offsetof(ABP_VH_GDF_Skycrane::FAnimBlueprintGeneratedConstantData, __NameProperty_43) == 0x000040, "Member 'ABP_VH_GDF_Skycrane::FAnimBlueprintGeneratedConstantData::__NameProperty_43' has a wrong offset!");
static_assert(offsetof(ABP_VH_GDF_Skycrane::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000048, "Member 'ABP_VH_GDF_Skycrane::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(ABP_VH_GDF_Skycrane::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x0000C8, "Member 'ABP_VH_GDF_Skycrane::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(ABP_VH_GDF_Skycrane::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root) == 0x0000E0, "Member 'ABP_VH_GDF_Skycrane::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(ABP_VH_GDF_Skycrane::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendSpacePlayer_1) == 0x000110, "Member 'ABP_VH_GDF_Skycrane::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendSpacePlayer_1' has a wrong offset!");
static_assert(offsetof(ABP_VH_GDF_Skycrane::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ApplyAdditive) == 0x000140, "Member 'ABP_VH_GDF_Skycrane::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ApplyAdditive' has a wrong offset!");
static_assert(offsetof(ABP_VH_GDF_Skycrane::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Slot) == 0x000170, "Member 'ABP_VH_GDF_Skycrane::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(ABP_VH_GDF_Skycrane::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendSpacePlayer) == 0x0001A0, "Member 'ABP_VH_GDF_Skycrane::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendSpacePlayer' has a wrong offset!");
static_assert(offsetof(ABP_VH_GDF_Skycrane::FAnimBlueprintGeneratedConstantData, AnimGraphNode_RotationOffsetBlendSpace) == 0x0001D0, "Member 'ABP_VH_GDF_Skycrane::FAnimBlueprintGeneratedConstantData::AnimGraphNode_RotationOffsetBlendSpace' has a wrong offset!");

// ScriptStruct ABP_VH_GDF_Skycrane.ABP_VH_GDF_Skycrane_C.AnimBlueprintGeneratedMutableData
// 0x0017 (0x0018 - 0x0001)
struct ABP_VH_GDF_Skycrane::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty;                                   // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_0;                                 // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_1;                                 // 0x000C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_2;                                 // 0x0010(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_3;                                 // 0x0014(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_VH_GDF_Skycrane::FAnimBlueprintGeneratedMutableData) == 0x000004, "Wrong alignment on ABP_VH_GDF_Skycrane::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(ABP_VH_GDF_Skycrane::FAnimBlueprintGeneratedMutableData) == 0x000018, "Wrong size on ABP_VH_GDF_Skycrane::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(ABP_VH_GDF_Skycrane::FAnimBlueprintGeneratedMutableData, __FloatProperty) == 0x000004, "Member 'ABP_VH_GDF_Skycrane::FAnimBlueprintGeneratedMutableData::__FloatProperty' has a wrong offset!");
static_assert(offsetof(ABP_VH_GDF_Skycrane::FAnimBlueprintGeneratedMutableData, __FloatProperty_0) == 0x000008, "Member 'ABP_VH_GDF_Skycrane::FAnimBlueprintGeneratedMutableData::__FloatProperty_0' has a wrong offset!");
static_assert(offsetof(ABP_VH_GDF_Skycrane::FAnimBlueprintGeneratedMutableData, __FloatProperty_1) == 0x00000C, "Member 'ABP_VH_GDF_Skycrane::FAnimBlueprintGeneratedMutableData::__FloatProperty_1' has a wrong offset!");
static_assert(offsetof(ABP_VH_GDF_Skycrane::FAnimBlueprintGeneratedMutableData, __FloatProperty_2) == 0x000010, "Member 'ABP_VH_GDF_Skycrane::FAnimBlueprintGeneratedMutableData::__FloatProperty_2' has a wrong offset!");
static_assert(offsetof(ABP_VH_GDF_Skycrane::FAnimBlueprintGeneratedMutableData, __FloatProperty_3) == 0x000014, "Member 'ABP_VH_GDF_Skycrane::FAnimBlueprintGeneratedMutableData::__FloatProperty_3' has a wrong offset!");

}

