#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_VH_DYN_CombatDropship

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function ABP_VH_DYN_CombatDropship.ABP_VH_DYN_CombatDropship_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct ABP_VH_DYN_CombatDropship_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_VH_DYN_CombatDropship_C_AnimGraph) == 0x000008, "Wrong alignment on ABP_VH_DYN_CombatDropship_C_AnimGraph");
static_assert(sizeof(ABP_VH_DYN_CombatDropship_C_AnimGraph) == 0x000010, "Wrong size on ABP_VH_DYN_CombatDropship_C_AnimGraph");
static_assert(offsetof(ABP_VH_DYN_CombatDropship_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'ABP_VH_DYN_CombatDropship_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function ABP_VH_DYN_CombatDropship.ABP_VH_DYN_CombatDropship_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct ABP_VH_DYN_CombatDropship_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_VH_DYN_CombatDropship_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on ABP_VH_DYN_CombatDropship_C_BlueprintUpdateAnimation");
static_assert(sizeof(ABP_VH_DYN_CombatDropship_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on ABP_VH_DYN_CombatDropship_C_BlueprintUpdateAnimation");
static_assert(offsetof(ABP_VH_DYN_CombatDropship_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'ABP_VH_DYN_CombatDropship_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function ABP_VH_DYN_CombatDropship.ABP_VH_DYN_CombatDropship_C.ExecuteUbergraph_ABP_VH_DYN_CombatDropship
// 0x0150 (0x0150 - 0x0000)
struct ABP_VH_DYN_CombatDropship_C_ExecuteUbergraph_ABP_VH_DYN_CombatDropship final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X;                          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue_1;                     // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_1;                // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        CallFunc_BreakVector2D_X_1;                        // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y_1;                        // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue_2;                     // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue_3;                     // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_3;      // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_2;                // 0x00A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_3;                // 0x00C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        CallFunc_BreakVector2D_X_2;                        // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y_2;                        // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue_4;                     // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue_5;                     // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_4;      // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_5;      // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_4;                // 0x0108(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_5;                // 0x0120(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_MakeRotator_Yaw_ImplicitCast;             // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Pitch_ImplicitCast;           // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Yaw_ImplicitCast_1;           // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Pitch_ImplicitCast_1;         // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Yaw_ImplicitCast_2;           // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Pitch_ImplicitCast_2;         // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_VH_DYN_CombatDropship_C_ExecuteUbergraph_ABP_VH_DYN_CombatDropship) == 0x000008, "Wrong alignment on ABP_VH_DYN_CombatDropship_C_ExecuteUbergraph_ABP_VH_DYN_CombatDropship");
static_assert(sizeof(ABP_VH_DYN_CombatDropship_C_ExecuteUbergraph_ABP_VH_DYN_CombatDropship) == 0x000150, "Wrong size on ABP_VH_DYN_CombatDropship_C_ExecuteUbergraph_ABP_VH_DYN_CombatDropship");
static_assert(offsetof(ABP_VH_DYN_CombatDropship_C_ExecuteUbergraph_ABP_VH_DYN_CombatDropship, EntryPoint) == 0x000000, "Member 'ABP_VH_DYN_CombatDropship_C_ExecuteUbergraph_ABP_VH_DYN_CombatDropship::EntryPoint' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_CombatDropship_C_ExecuteUbergraph_ABP_VH_DYN_CombatDropship, K2Node_Event_DeltaTimeX) == 0x000004, "Member 'ABP_VH_DYN_CombatDropship_C_ExecuteUbergraph_ABP_VH_DYN_CombatDropship::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_CombatDropship_C_ExecuteUbergraph_ABP_VH_DYN_CombatDropship, CallFunc_BreakVector2D_X) == 0x000008, "Member 'ABP_VH_DYN_CombatDropship_C_ExecuteUbergraph_ABP_VH_DYN_CombatDropship::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_CombatDropship_C_ExecuteUbergraph_ABP_VH_DYN_CombatDropship, CallFunc_BreakVector2D_Y) == 0x000010, "Member 'ABP_VH_DYN_CombatDropship_C_ExecuteUbergraph_ABP_VH_DYN_CombatDropship::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_CombatDropship_C_ExecuteUbergraph_ABP_VH_DYN_CombatDropship, CallFunc_FClamp_ReturnValue) == 0x000018, "Member 'ABP_VH_DYN_CombatDropship_C_ExecuteUbergraph_ABP_VH_DYN_CombatDropship::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_CombatDropship_C_ExecuteUbergraph_ABP_VH_DYN_CombatDropship, CallFunc_FClamp_ReturnValue_1) == 0x000020, "Member 'ABP_VH_DYN_CombatDropship_C_ExecuteUbergraph_ABP_VH_DYN_CombatDropship::CallFunc_FClamp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_CombatDropship_C_ExecuteUbergraph_ABP_VH_DYN_CombatDropship, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000028, "Member 'ABP_VH_DYN_CombatDropship_C_ExecuteUbergraph_ABP_VH_DYN_CombatDropship::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_CombatDropship_C_ExecuteUbergraph_ABP_VH_DYN_CombatDropship, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000030, "Member 'ABP_VH_DYN_CombatDropship_C_ExecuteUbergraph_ABP_VH_DYN_CombatDropship::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_CombatDropship_C_ExecuteUbergraph_ABP_VH_DYN_CombatDropship, CallFunc_MakeRotator_ReturnValue) == 0x000038, "Member 'ABP_VH_DYN_CombatDropship_C_ExecuteUbergraph_ABP_VH_DYN_CombatDropship::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_CombatDropship_C_ExecuteUbergraph_ABP_VH_DYN_CombatDropship, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000050, "Member 'ABP_VH_DYN_CombatDropship_C_ExecuteUbergraph_ABP_VH_DYN_CombatDropship::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_CombatDropship_C_ExecuteUbergraph_ABP_VH_DYN_CombatDropship, CallFunc_MakeRotator_ReturnValue_1) == 0x000058, "Member 'ABP_VH_DYN_CombatDropship_C_ExecuteUbergraph_ABP_VH_DYN_CombatDropship::CallFunc_MakeRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_CombatDropship_C_ExecuteUbergraph_ABP_VH_DYN_CombatDropship, CallFunc_BreakVector2D_X_1) == 0x000070, "Member 'ABP_VH_DYN_CombatDropship_C_ExecuteUbergraph_ABP_VH_DYN_CombatDropship::CallFunc_BreakVector2D_X_1' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_CombatDropship_C_ExecuteUbergraph_ABP_VH_DYN_CombatDropship, CallFunc_BreakVector2D_Y_1) == 0x000078, "Member 'ABP_VH_DYN_CombatDropship_C_ExecuteUbergraph_ABP_VH_DYN_CombatDropship::CallFunc_BreakVector2D_Y_1' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_CombatDropship_C_ExecuteUbergraph_ABP_VH_DYN_CombatDropship, CallFunc_FClamp_ReturnValue_2) == 0x000080, "Member 'ABP_VH_DYN_CombatDropship_C_ExecuteUbergraph_ABP_VH_DYN_CombatDropship::CallFunc_FClamp_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_CombatDropship_C_ExecuteUbergraph_ABP_VH_DYN_CombatDropship, CallFunc_FClamp_ReturnValue_3) == 0x000088, "Member 'ABP_VH_DYN_CombatDropship_C_ExecuteUbergraph_ABP_VH_DYN_CombatDropship::CallFunc_FClamp_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_CombatDropship_C_ExecuteUbergraph_ABP_VH_DYN_CombatDropship, CallFunc_Multiply_DoubleDouble_ReturnValue_2) == 0x000090, "Member 'ABP_VH_DYN_CombatDropship_C_ExecuteUbergraph_ABP_VH_DYN_CombatDropship::CallFunc_Multiply_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_CombatDropship_C_ExecuteUbergraph_ABP_VH_DYN_CombatDropship, CallFunc_Multiply_DoubleDouble_ReturnValue_3) == 0x000098, "Member 'ABP_VH_DYN_CombatDropship_C_ExecuteUbergraph_ABP_VH_DYN_CombatDropship::CallFunc_Multiply_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_CombatDropship_C_ExecuteUbergraph_ABP_VH_DYN_CombatDropship, CallFunc_MakeRotator_ReturnValue_2) == 0x0000A0, "Member 'ABP_VH_DYN_CombatDropship_C_ExecuteUbergraph_ABP_VH_DYN_CombatDropship::CallFunc_MakeRotator_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_CombatDropship_C_ExecuteUbergraph_ABP_VH_DYN_CombatDropship, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x0000B8, "Member 'ABP_VH_DYN_CombatDropship_C_ExecuteUbergraph_ABP_VH_DYN_CombatDropship::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_CombatDropship_C_ExecuteUbergraph_ABP_VH_DYN_CombatDropship, CallFunc_MakeRotator_ReturnValue_3) == 0x0000C0, "Member 'ABP_VH_DYN_CombatDropship_C_ExecuteUbergraph_ABP_VH_DYN_CombatDropship::CallFunc_MakeRotator_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_CombatDropship_C_ExecuteUbergraph_ABP_VH_DYN_CombatDropship, CallFunc_BreakVector2D_X_2) == 0x0000D8, "Member 'ABP_VH_DYN_CombatDropship_C_ExecuteUbergraph_ABP_VH_DYN_CombatDropship::CallFunc_BreakVector2D_X_2' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_CombatDropship_C_ExecuteUbergraph_ABP_VH_DYN_CombatDropship, CallFunc_BreakVector2D_Y_2) == 0x0000E0, "Member 'ABP_VH_DYN_CombatDropship_C_ExecuteUbergraph_ABP_VH_DYN_CombatDropship::CallFunc_BreakVector2D_Y_2' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_CombatDropship_C_ExecuteUbergraph_ABP_VH_DYN_CombatDropship, CallFunc_FClamp_ReturnValue_4) == 0x0000E8, "Member 'ABP_VH_DYN_CombatDropship_C_ExecuteUbergraph_ABP_VH_DYN_CombatDropship::CallFunc_FClamp_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_CombatDropship_C_ExecuteUbergraph_ABP_VH_DYN_CombatDropship, CallFunc_FClamp_ReturnValue_5) == 0x0000F0, "Member 'ABP_VH_DYN_CombatDropship_C_ExecuteUbergraph_ABP_VH_DYN_CombatDropship::CallFunc_FClamp_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_CombatDropship_C_ExecuteUbergraph_ABP_VH_DYN_CombatDropship, CallFunc_Multiply_DoubleDouble_ReturnValue_4) == 0x0000F8, "Member 'ABP_VH_DYN_CombatDropship_C_ExecuteUbergraph_ABP_VH_DYN_CombatDropship::CallFunc_Multiply_DoubleDouble_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_CombatDropship_C_ExecuteUbergraph_ABP_VH_DYN_CombatDropship, CallFunc_Multiply_DoubleDouble_ReturnValue_5) == 0x000100, "Member 'ABP_VH_DYN_CombatDropship_C_ExecuteUbergraph_ABP_VH_DYN_CombatDropship::CallFunc_Multiply_DoubleDouble_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_CombatDropship_C_ExecuteUbergraph_ABP_VH_DYN_CombatDropship, CallFunc_MakeRotator_ReturnValue_4) == 0x000108, "Member 'ABP_VH_DYN_CombatDropship_C_ExecuteUbergraph_ABP_VH_DYN_CombatDropship::CallFunc_MakeRotator_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_CombatDropship_C_ExecuteUbergraph_ABP_VH_DYN_CombatDropship, CallFunc_MakeRotator_ReturnValue_5) == 0x000120, "Member 'ABP_VH_DYN_CombatDropship_C_ExecuteUbergraph_ABP_VH_DYN_CombatDropship::CallFunc_MakeRotator_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_CombatDropship_C_ExecuteUbergraph_ABP_VH_DYN_CombatDropship, CallFunc_MakeRotator_Yaw_ImplicitCast) == 0x000138, "Member 'ABP_VH_DYN_CombatDropship_C_ExecuteUbergraph_ABP_VH_DYN_CombatDropship::CallFunc_MakeRotator_Yaw_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_CombatDropship_C_ExecuteUbergraph_ABP_VH_DYN_CombatDropship, CallFunc_MakeRotator_Pitch_ImplicitCast) == 0x00013C, "Member 'ABP_VH_DYN_CombatDropship_C_ExecuteUbergraph_ABP_VH_DYN_CombatDropship::CallFunc_MakeRotator_Pitch_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_CombatDropship_C_ExecuteUbergraph_ABP_VH_DYN_CombatDropship, CallFunc_MakeRotator_Yaw_ImplicitCast_1) == 0x000140, "Member 'ABP_VH_DYN_CombatDropship_C_ExecuteUbergraph_ABP_VH_DYN_CombatDropship::CallFunc_MakeRotator_Yaw_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_CombatDropship_C_ExecuteUbergraph_ABP_VH_DYN_CombatDropship, CallFunc_MakeRotator_Pitch_ImplicitCast_1) == 0x000144, "Member 'ABP_VH_DYN_CombatDropship_C_ExecuteUbergraph_ABP_VH_DYN_CombatDropship::CallFunc_MakeRotator_Pitch_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_CombatDropship_C_ExecuteUbergraph_ABP_VH_DYN_CombatDropship, CallFunc_MakeRotator_Yaw_ImplicitCast_2) == 0x000148, "Member 'ABP_VH_DYN_CombatDropship_C_ExecuteUbergraph_ABP_VH_DYN_CombatDropship::CallFunc_MakeRotator_Yaw_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_CombatDropship_C_ExecuteUbergraph_ABP_VH_DYN_CombatDropship, CallFunc_MakeRotator_Pitch_ImplicitCast_2) == 0x00014C, "Member 'ABP_VH_DYN_CombatDropship_C_ExecuteUbergraph_ABP_VH_DYN_CombatDropship::CallFunc_MakeRotator_Pitch_ImplicitCast_2' has a wrong offset!");

}

