#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_VH_GDF_DroneMauler_Drone

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct ABP_VH_GDF_DroneMauler_Drone.ABP_VH_GDF_DroneMauler_Drone_C.AnimBlueprintGeneratedConstantData
// 0x03CF (0x03D0 - 0x0001)
struct ABP_VH_GDF_DroneMauler_Drone::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_55;                                 // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_56;                                // 0x000C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_57;                                 // 0x0010(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_58;                                  // 0x0018(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_59;                                 // 0x001C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputScaleBiasClampConstants          __StructProperty_60;                               // 0x0020(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_61;                                // 0x004C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_62;                                 // 0x0050(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_63;                                 // 0x0051(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_64;                                 // 0x0052(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_53[0x1];                                       // 0x0053(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_65;                                 // 0x0054(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_66;                                 // 0x005C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_67;                                 // 0x0064(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_68;                                  // 0x006C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERefPoseType                                  __ByteProperty_69;                                 // 0x0070(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_70;                               // 0x0078(0x0020)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_Tag                     AnimBlueprintExtension_Tag;                        // 0x0098(0x0060)()
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x00F8(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0178(0x0018)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root;                           // 0x0190(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot_1;                         // 0x01C0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_1;             // 0x01F0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult;               // 0x0220(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_1;               // 0x0250(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_1;                  // 0x0280(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer;                 // 0x02B0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult;                    // 0x02E0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine;                   // 0x0310(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot;                           // 0x0340(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_IdentityPose;                   // 0x0370(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive;                  // 0x03A0(0x0030)()
};
static_assert(alignof(ABP_VH_GDF_DroneMauler_Drone::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on ABP_VH_GDF_DroneMauler_Drone::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(ABP_VH_GDF_DroneMauler_Drone::FAnimBlueprintGeneratedConstantData) == 0x0003D0, "Wrong size on ABP_VH_GDF_DroneMauler_Drone::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(ABP_VH_GDF_DroneMauler_Drone::FAnimBlueprintGeneratedConstantData, __NameProperty_55) == 0x000004, "Member 'ABP_VH_GDF_DroneMauler_Drone::FAnimBlueprintGeneratedConstantData::__NameProperty_55' has a wrong offset!");
static_assert(offsetof(ABP_VH_GDF_DroneMauler_Drone::FAnimBlueprintGeneratedConstantData, __FloatProperty_56) == 0x00000C, "Member 'ABP_VH_GDF_DroneMauler_Drone::FAnimBlueprintGeneratedConstantData::__FloatProperty_56' has a wrong offset!");
static_assert(offsetof(ABP_VH_GDF_DroneMauler_Drone::FAnimBlueprintGeneratedConstantData, __NameProperty_57) == 0x000010, "Member 'ABP_VH_GDF_DroneMauler_Drone::FAnimBlueprintGeneratedConstantData::__NameProperty_57' has a wrong offset!");
static_assert(offsetof(ABP_VH_GDF_DroneMauler_Drone::FAnimBlueprintGeneratedConstantData, __IntProperty_58) == 0x000018, "Member 'ABP_VH_GDF_DroneMauler_Drone::FAnimBlueprintGeneratedConstantData::__IntProperty_58' has a wrong offset!");
static_assert(offsetof(ABP_VH_GDF_DroneMauler_Drone::FAnimBlueprintGeneratedConstantData, __BoolProperty_59) == 0x00001C, "Member 'ABP_VH_GDF_DroneMauler_Drone::FAnimBlueprintGeneratedConstantData::__BoolProperty_59' has a wrong offset!");
static_assert(offsetof(ABP_VH_GDF_DroneMauler_Drone::FAnimBlueprintGeneratedConstantData, __StructProperty_60) == 0x000020, "Member 'ABP_VH_GDF_DroneMauler_Drone::FAnimBlueprintGeneratedConstantData::__StructProperty_60' has a wrong offset!");
static_assert(offsetof(ABP_VH_GDF_DroneMauler_Drone::FAnimBlueprintGeneratedConstantData, __FloatProperty_61) == 0x00004C, "Member 'ABP_VH_GDF_DroneMauler_Drone::FAnimBlueprintGeneratedConstantData::__FloatProperty_61' has a wrong offset!");
static_assert(offsetof(ABP_VH_GDF_DroneMauler_Drone::FAnimBlueprintGeneratedConstantData, __BoolProperty_62) == 0x000050, "Member 'ABP_VH_GDF_DroneMauler_Drone::FAnimBlueprintGeneratedConstantData::__BoolProperty_62' has a wrong offset!");
static_assert(offsetof(ABP_VH_GDF_DroneMauler_Drone::FAnimBlueprintGeneratedConstantData, __EnumProperty_63) == 0x000051, "Member 'ABP_VH_GDF_DroneMauler_Drone::FAnimBlueprintGeneratedConstantData::__EnumProperty_63' has a wrong offset!");
static_assert(offsetof(ABP_VH_GDF_DroneMauler_Drone::FAnimBlueprintGeneratedConstantData, __ByteProperty_64) == 0x000052, "Member 'ABP_VH_GDF_DroneMauler_Drone::FAnimBlueprintGeneratedConstantData::__ByteProperty_64' has a wrong offset!");
static_assert(offsetof(ABP_VH_GDF_DroneMauler_Drone::FAnimBlueprintGeneratedConstantData, __NameProperty_65) == 0x000054, "Member 'ABP_VH_GDF_DroneMauler_Drone::FAnimBlueprintGeneratedConstantData::__NameProperty_65' has a wrong offset!");
static_assert(offsetof(ABP_VH_GDF_DroneMauler_Drone::FAnimBlueprintGeneratedConstantData, __NameProperty_66) == 0x00005C, "Member 'ABP_VH_GDF_DroneMauler_Drone::FAnimBlueprintGeneratedConstantData::__NameProperty_66' has a wrong offset!");
static_assert(offsetof(ABP_VH_GDF_DroneMauler_Drone::FAnimBlueprintGeneratedConstantData, __NameProperty_67) == 0x000064, "Member 'ABP_VH_GDF_DroneMauler_Drone::FAnimBlueprintGeneratedConstantData::__NameProperty_67' has a wrong offset!");
static_assert(offsetof(ABP_VH_GDF_DroneMauler_Drone::FAnimBlueprintGeneratedConstantData, __IntProperty_68) == 0x00006C, "Member 'ABP_VH_GDF_DroneMauler_Drone::FAnimBlueprintGeneratedConstantData::__IntProperty_68' has a wrong offset!");
static_assert(offsetof(ABP_VH_GDF_DroneMauler_Drone::FAnimBlueprintGeneratedConstantData, __ByteProperty_69) == 0x000070, "Member 'ABP_VH_GDF_DroneMauler_Drone::FAnimBlueprintGeneratedConstantData::__ByteProperty_69' has a wrong offset!");
static_assert(offsetof(ABP_VH_GDF_DroneMauler_Drone::FAnimBlueprintGeneratedConstantData, __StructProperty_70) == 0x000078, "Member 'ABP_VH_GDF_DroneMauler_Drone::FAnimBlueprintGeneratedConstantData::__StructProperty_70' has a wrong offset!");
static_assert(offsetof(ABP_VH_GDF_DroneMauler_Drone::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Tag) == 0x000098, "Member 'ABP_VH_GDF_DroneMauler_Drone::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Tag' has a wrong offset!");
static_assert(offsetof(ABP_VH_GDF_DroneMauler_Drone::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x0000F8, "Member 'ABP_VH_GDF_DroneMauler_Drone::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(ABP_VH_GDF_DroneMauler_Drone::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000178, "Member 'ABP_VH_GDF_DroneMauler_Drone::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(ABP_VH_GDF_DroneMauler_Drone::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root) == 0x000190, "Member 'ABP_VH_GDF_DroneMauler_Drone::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(ABP_VH_GDF_DroneMauler_Drone::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Slot_1) == 0x0001C0, "Member 'ABP_VH_GDF_DroneMauler_Drone::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Slot_1' has a wrong offset!");
static_assert(offsetof(ABP_VH_GDF_DroneMauler_Drone::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_1) == 0x0001F0, "Member 'ABP_VH_GDF_DroneMauler_Drone::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(ABP_VH_GDF_DroneMauler_Drone::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult) == 0x000220, "Member 'ABP_VH_GDF_DroneMauler_Drone::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(ABP_VH_GDF_DroneMauler_Drone::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_1) == 0x000250, "Member 'ABP_VH_GDF_DroneMauler_Drone::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(ABP_VH_GDF_DroneMauler_Drone::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult_1) == 0x000280, "Member 'ABP_VH_GDF_DroneMauler_Drone::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(ABP_VH_GDF_DroneMauler_Drone::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer) == 0x0002B0, "Member 'ABP_VH_GDF_DroneMauler_Drone::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(ABP_VH_GDF_DroneMauler_Drone::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult) == 0x0002E0, "Member 'ABP_VH_GDF_DroneMauler_Drone::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(ABP_VH_GDF_DroneMauler_Drone::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateMachine) == 0x000310, "Member 'ABP_VH_GDF_DroneMauler_Drone::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(ABP_VH_GDF_DroneMauler_Drone::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Slot) == 0x000340, "Member 'ABP_VH_GDF_DroneMauler_Drone::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(ABP_VH_GDF_DroneMauler_Drone::FAnimBlueprintGeneratedConstantData, AnimGraphNode_IdentityPose) == 0x000370, "Member 'ABP_VH_GDF_DroneMauler_Drone::FAnimBlueprintGeneratedConstantData::AnimGraphNode_IdentityPose' has a wrong offset!");
static_assert(offsetof(ABP_VH_GDF_DroneMauler_Drone::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ApplyAdditive) == 0x0003A0, "Member 'ABP_VH_GDF_DroneMauler_Drone::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ApplyAdditive' has a wrong offset!");

// ScriptStruct ABP_VH_GDF_DroneMauler_Drone.ABP_VH_GDF_DroneMauler_Drone_C.AnimBlueprintGeneratedMutableData
// 0x0007 (0x0008 - 0x0001)
struct ABP_VH_GDF_DroneMauler_Drone::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty;                                   // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_VH_GDF_DroneMauler_Drone::FAnimBlueprintGeneratedMutableData) == 0x000004, "Wrong alignment on ABP_VH_GDF_DroneMauler_Drone::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(ABP_VH_GDF_DroneMauler_Drone::FAnimBlueprintGeneratedMutableData) == 0x000008, "Wrong size on ABP_VH_GDF_DroneMauler_Drone::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(ABP_VH_GDF_DroneMauler_Drone::FAnimBlueprintGeneratedMutableData, __FloatProperty) == 0x000004, "Member 'ABP_VH_GDF_DroneMauler_Drone::FAnimBlueprintGeneratedMutableData::__FloatProperty' has a wrong offset!");

}

