#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_VH_GDF_Scrambler_V02

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function ABP_VH_GDF_Scrambler_V02.ABP_VH_GDF_Scrambler_V02_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct ABP_VH_GDF_Scrambler_V02_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_VH_GDF_Scrambler_V02_C_AnimGraph) == 0x000008, "Wrong alignment on ABP_VH_GDF_Scrambler_V02_C_AnimGraph");
static_assert(sizeof(ABP_VH_GDF_Scrambler_V02_C_AnimGraph) == 0x000010, "Wrong size on ABP_VH_GDF_Scrambler_V02_C_AnimGraph");
static_assert(offsetof(ABP_VH_GDF_Scrambler_V02_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'ABP_VH_GDF_Scrambler_V02_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function ABP_VH_GDF_Scrambler_V02.ABP_VH_GDF_Scrambler_V02_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct ABP_VH_GDF_Scrambler_V02_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_VH_GDF_Scrambler_V02_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on ABP_VH_GDF_Scrambler_V02_C_BlueprintUpdateAnimation");
static_assert(sizeof(ABP_VH_GDF_Scrambler_V02_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on ABP_VH_GDF_Scrambler_V02_C_BlueprintUpdateAnimation");
static_assert(offsetof(ABP_VH_GDF_Scrambler_V02_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'ABP_VH_GDF_Scrambler_V02_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function ABP_VH_GDF_Scrambler_V02.ABP_VH_GDF_Scrambler_V02_C.ExecuteUbergraph_ABP_VH_GDF_Scrambler_V02
// 0x0068 (0x0068 - 0x0000)
struct ABP_VH_GDF_Scrambler_V02_C_ExecuteUbergraph_ABP_VH_GDF_Scrambler_V02 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X;                          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_1;                // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_MakeRotator_Roll_ImplicitCast;            // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Pitch_ImplicitCast;           // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_VH_GDF_Scrambler_V02_C_ExecuteUbergraph_ABP_VH_GDF_Scrambler_V02) == 0x000008, "Wrong alignment on ABP_VH_GDF_Scrambler_V02_C_ExecuteUbergraph_ABP_VH_GDF_Scrambler_V02");
static_assert(sizeof(ABP_VH_GDF_Scrambler_V02_C_ExecuteUbergraph_ABP_VH_GDF_Scrambler_V02) == 0x000068, "Wrong size on ABP_VH_GDF_Scrambler_V02_C_ExecuteUbergraph_ABP_VH_GDF_Scrambler_V02");
static_assert(offsetof(ABP_VH_GDF_Scrambler_V02_C_ExecuteUbergraph_ABP_VH_GDF_Scrambler_V02, EntryPoint) == 0x000000, "Member 'ABP_VH_GDF_Scrambler_V02_C_ExecuteUbergraph_ABP_VH_GDF_Scrambler_V02::EntryPoint' has a wrong offset!");
static_assert(offsetof(ABP_VH_GDF_Scrambler_V02_C_ExecuteUbergraph_ABP_VH_GDF_Scrambler_V02, K2Node_Event_DeltaTimeX) == 0x000004, "Member 'ABP_VH_GDF_Scrambler_V02_C_ExecuteUbergraph_ABP_VH_GDF_Scrambler_V02::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(ABP_VH_GDF_Scrambler_V02_C_ExecuteUbergraph_ABP_VH_GDF_Scrambler_V02, CallFunc_BreakVector2D_X) == 0x000008, "Member 'ABP_VH_GDF_Scrambler_V02_C_ExecuteUbergraph_ABP_VH_GDF_Scrambler_V02::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(ABP_VH_GDF_Scrambler_V02_C_ExecuteUbergraph_ABP_VH_GDF_Scrambler_V02, CallFunc_BreakVector2D_Y) == 0x000010, "Member 'ABP_VH_GDF_Scrambler_V02_C_ExecuteUbergraph_ABP_VH_GDF_Scrambler_V02::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(ABP_VH_GDF_Scrambler_V02_C_ExecuteUbergraph_ABP_VH_GDF_Scrambler_V02, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000018, "Member 'ABP_VH_GDF_Scrambler_V02_C_ExecuteUbergraph_ABP_VH_GDF_Scrambler_V02::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_VH_GDF_Scrambler_V02_C_ExecuteUbergraph_ABP_VH_GDF_Scrambler_V02, CallFunc_FClamp_ReturnValue) == 0x000020, "Member 'ABP_VH_GDF_Scrambler_V02_C_ExecuteUbergraph_ABP_VH_GDF_Scrambler_V02::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_VH_GDF_Scrambler_V02_C_ExecuteUbergraph_ABP_VH_GDF_Scrambler_V02, CallFunc_MakeRotator_ReturnValue) == 0x000028, "Member 'ABP_VH_GDF_Scrambler_V02_C_ExecuteUbergraph_ABP_VH_GDF_Scrambler_V02::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_VH_GDF_Scrambler_V02_C_ExecuteUbergraph_ABP_VH_GDF_Scrambler_V02, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000040, "Member 'ABP_VH_GDF_Scrambler_V02_C_ExecuteUbergraph_ABP_VH_GDF_Scrambler_V02::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_VH_GDF_Scrambler_V02_C_ExecuteUbergraph_ABP_VH_GDF_Scrambler_V02, CallFunc_MakeRotator_ReturnValue_1) == 0x000048, "Member 'ABP_VH_GDF_Scrambler_V02_C_ExecuteUbergraph_ABP_VH_GDF_Scrambler_V02::CallFunc_MakeRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_VH_GDF_Scrambler_V02_C_ExecuteUbergraph_ABP_VH_GDF_Scrambler_V02, CallFunc_MakeRotator_Roll_ImplicitCast) == 0x000060, "Member 'ABP_VH_GDF_Scrambler_V02_C_ExecuteUbergraph_ABP_VH_GDF_Scrambler_V02::CallFunc_MakeRotator_Roll_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ABP_VH_GDF_Scrambler_V02_C_ExecuteUbergraph_ABP_VH_GDF_Scrambler_V02, CallFunc_MakeRotator_Pitch_ImplicitCast) == 0x000064, "Member 'ABP_VH_GDF_Scrambler_V02_C_ExecuteUbergraph_ABP_VH_GDF_Scrambler_V02::CallFunc_MakeRotator_Pitch_ImplicitCast' has a wrong offset!");

}

