#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_VH_VETI_ServitorRepair

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_VH_VETI_ServitorRepair.ABP_VH_VETI_ServitorRepair_C
// 0x00D0 (0x0440 - 0x0370)
class UABP_VH_VETI_ServitorRepair_C final : public UAnimInstance
{
public:
	uint8                                         Pad_368[0x8];                                      // 0x0368(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0370(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0378(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0380(0x0008)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x0388(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x03D0(0x0048)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0418(0x0020)()

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void ExecuteUbergraph_ABP_VH_VETI_ServitorRepair(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_VH_VETI_ServitorRepair_C">();
	}
	static class UABP_VH_VETI_ServitorRepair_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_VH_VETI_ServitorRepair_C>();
	}
};
static_assert(alignof(UABP_VH_VETI_ServitorRepair_C) == 0x000010, "Wrong alignment on UABP_VH_VETI_ServitorRepair_C");
static_assert(sizeof(UABP_VH_VETI_ServitorRepair_C) == 0x000440, "Wrong size on UABP_VH_VETI_ServitorRepair_C");
static_assert(offsetof(UABP_VH_VETI_ServitorRepair_C, UberGraphFrame) == 0x000370, "Member 'UABP_VH_VETI_ServitorRepair_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_VH_VETI_ServitorRepair_C, AnimBlueprintExtension_PropertyAccess) == 0x000378, "Member 'UABP_VH_VETI_ServitorRepair_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UABP_VH_VETI_ServitorRepair_C, AnimBlueprintExtension_Base) == 0x000380, "Member 'UABP_VH_VETI_ServitorRepair_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UABP_VH_VETI_ServitorRepair_C, AnimGraphNode_Slot) == 0x000388, "Member 'UABP_VH_VETI_ServitorRepair_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(UABP_VH_VETI_ServitorRepair_C, AnimGraphNode_SequencePlayer) == 0x0003D0, "Member 'UABP_VH_VETI_ServitorRepair_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UABP_VH_VETI_ServitorRepair_C, AnimGraphNode_Root) == 0x000418, "Member 'UABP_VH_VETI_ServitorRepair_C::AnimGraphNode_Root' has a wrong offset!");

}

