#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_BD_GDF_ConstructionYard

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct ABP_BD_GDF_ConstructionYard.ABP_BD_GDF_ConstructionYard_C.AnimBlueprintGeneratedConstantData
// 0x028F (0x0290 - 0x0001)
struct ABP_BD_GDF_ConstructionYard::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_33;                                 // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlendProfile*                          __BlendProfile_34;                                 // 0x0010(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_35;                                   // 0x0018(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_36;                                 // 0x0020(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_37;                                 // 0x0021(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_38;                                // 0x0028(0x0010)(BlueprintVisible, EditFixedSize)
	bool                                          __BoolProperty_39;                                 // 0x0038(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_40;                                // 0x003C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_41;                               // 0x0040(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_42;                                // 0x006C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_43;                                 // 0x0070(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_44;                                 // 0x0071(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_72[0x2];                                       // 0x0072(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_45;                                 // 0x0074(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_46;                               // 0x0080(0x0020)(BlueprintVisible, NoDestructor)
	ERefPoseType                                  __ByteProperty_47;                                 // 0x00A0(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x00A8(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0128(0x0018)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root;                           // 0x0140(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot;                           // 0x0170(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_1;               // 0x01A0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool;                // 0x01D0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer;                 // 0x0200(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive;                  // 0x0230(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalRefPose;                   // 0x0260(0x0030)()
};
static_assert(alignof(ABP_BD_GDF_ConstructionYard::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on ABP_BD_GDF_ConstructionYard::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(ABP_BD_GDF_ConstructionYard::FAnimBlueprintGeneratedConstantData) == 0x000290, "Wrong size on ABP_BD_GDF_ConstructionYard::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(ABP_BD_GDF_ConstructionYard::FAnimBlueprintGeneratedConstantData, __NameProperty_33) == 0x000004, "Member 'ABP_BD_GDF_ConstructionYard::FAnimBlueprintGeneratedConstantData::__NameProperty_33' has a wrong offset!");
static_assert(offsetof(ABP_BD_GDF_ConstructionYard::FAnimBlueprintGeneratedConstantData, __BlendProfile_34) == 0x000010, "Member 'ABP_BD_GDF_ConstructionYard::FAnimBlueprintGeneratedConstantData::__BlendProfile_34' has a wrong offset!");
static_assert(offsetof(ABP_BD_GDF_ConstructionYard::FAnimBlueprintGeneratedConstantData, __CurveFloat_35) == 0x000018, "Member 'ABP_BD_GDF_ConstructionYard::FAnimBlueprintGeneratedConstantData::__CurveFloat_35' has a wrong offset!");
static_assert(offsetof(ABP_BD_GDF_ConstructionYard::FAnimBlueprintGeneratedConstantData, __EnumProperty_36) == 0x000020, "Member 'ABP_BD_GDF_ConstructionYard::FAnimBlueprintGeneratedConstantData::__EnumProperty_36' has a wrong offset!");
static_assert(offsetof(ABP_BD_GDF_ConstructionYard::FAnimBlueprintGeneratedConstantData, __EnumProperty_37) == 0x000021, "Member 'ABP_BD_GDF_ConstructionYard::FAnimBlueprintGeneratedConstantData::__EnumProperty_37' has a wrong offset!");
static_assert(offsetof(ABP_BD_GDF_ConstructionYard::FAnimBlueprintGeneratedConstantData, __ArrayProperty_38) == 0x000028, "Member 'ABP_BD_GDF_ConstructionYard::FAnimBlueprintGeneratedConstantData::__ArrayProperty_38' has a wrong offset!");
static_assert(offsetof(ABP_BD_GDF_ConstructionYard::FAnimBlueprintGeneratedConstantData, __BoolProperty_39) == 0x000038, "Member 'ABP_BD_GDF_ConstructionYard::FAnimBlueprintGeneratedConstantData::__BoolProperty_39' has a wrong offset!");
static_assert(offsetof(ABP_BD_GDF_ConstructionYard::FAnimBlueprintGeneratedConstantData, __FloatProperty_40) == 0x00003C, "Member 'ABP_BD_GDF_ConstructionYard::FAnimBlueprintGeneratedConstantData::__FloatProperty_40' has a wrong offset!");
static_assert(offsetof(ABP_BD_GDF_ConstructionYard::FAnimBlueprintGeneratedConstantData, __StructProperty_41) == 0x000040, "Member 'ABP_BD_GDF_ConstructionYard::FAnimBlueprintGeneratedConstantData::__StructProperty_41' has a wrong offset!");
static_assert(offsetof(ABP_BD_GDF_ConstructionYard::FAnimBlueprintGeneratedConstantData, __FloatProperty_42) == 0x00006C, "Member 'ABP_BD_GDF_ConstructionYard::FAnimBlueprintGeneratedConstantData::__FloatProperty_42' has a wrong offset!");
static_assert(offsetof(ABP_BD_GDF_ConstructionYard::FAnimBlueprintGeneratedConstantData, __BoolProperty_43) == 0x000070, "Member 'ABP_BD_GDF_ConstructionYard::FAnimBlueprintGeneratedConstantData::__BoolProperty_43' has a wrong offset!");
static_assert(offsetof(ABP_BD_GDF_ConstructionYard::FAnimBlueprintGeneratedConstantData, __EnumProperty_44) == 0x000071, "Member 'ABP_BD_GDF_ConstructionYard::FAnimBlueprintGeneratedConstantData::__EnumProperty_44' has a wrong offset!");
static_assert(offsetof(ABP_BD_GDF_ConstructionYard::FAnimBlueprintGeneratedConstantData, __NameProperty_45) == 0x000074, "Member 'ABP_BD_GDF_ConstructionYard::FAnimBlueprintGeneratedConstantData::__NameProperty_45' has a wrong offset!");
static_assert(offsetof(ABP_BD_GDF_ConstructionYard::FAnimBlueprintGeneratedConstantData, __StructProperty_46) == 0x000080, "Member 'ABP_BD_GDF_ConstructionYard::FAnimBlueprintGeneratedConstantData::__StructProperty_46' has a wrong offset!");
static_assert(offsetof(ABP_BD_GDF_ConstructionYard::FAnimBlueprintGeneratedConstantData, __ByteProperty_47) == 0x0000A0, "Member 'ABP_BD_GDF_ConstructionYard::FAnimBlueprintGeneratedConstantData::__ByteProperty_47' has a wrong offset!");
static_assert(offsetof(ABP_BD_GDF_ConstructionYard::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x0000A8, "Member 'ABP_BD_GDF_ConstructionYard::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(ABP_BD_GDF_ConstructionYard::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000128, "Member 'ABP_BD_GDF_ConstructionYard::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(ABP_BD_GDF_ConstructionYard::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root) == 0x000140, "Member 'ABP_BD_GDF_ConstructionYard::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(ABP_BD_GDF_ConstructionYard::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Slot) == 0x000170, "Member 'ABP_BD_GDF_ConstructionYard::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(ABP_BD_GDF_ConstructionYard::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_1) == 0x0001A0, "Member 'ABP_BD_GDF_ConstructionYard::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(ABP_BD_GDF_ConstructionYard::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendListByBool) == 0x0001D0, "Member 'ABP_BD_GDF_ConstructionYard::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(ABP_BD_GDF_ConstructionYard::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer) == 0x000200, "Member 'ABP_BD_GDF_ConstructionYard::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(ABP_BD_GDF_ConstructionYard::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ApplyAdditive) == 0x000230, "Member 'ABP_BD_GDF_ConstructionYard::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ApplyAdditive' has a wrong offset!");
static_assert(offsetof(ABP_BD_GDF_ConstructionYard::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LocalRefPose) == 0x000260, "Member 'ABP_BD_GDF_ConstructionYard::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LocalRefPose' has a wrong offset!");

// ScriptStruct ABP_BD_GDF_ConstructionYard.ABP_BD_GDF_ConstructionYard_C.AnimBlueprintGeneratedMutableData
// 0x000B (0x000C - 0x0001)
struct ABP_BD_GDF_ConstructionYard::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty;                                   // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_0;                                  // 0x0008(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_BD_GDF_ConstructionYard::FAnimBlueprintGeneratedMutableData) == 0x000004, "Wrong alignment on ABP_BD_GDF_ConstructionYard::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(ABP_BD_GDF_ConstructionYard::FAnimBlueprintGeneratedMutableData) == 0x00000C, "Wrong size on ABP_BD_GDF_ConstructionYard::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(ABP_BD_GDF_ConstructionYard::FAnimBlueprintGeneratedMutableData, __FloatProperty) == 0x000004, "Member 'ABP_BD_GDF_ConstructionYard::FAnimBlueprintGeneratedMutableData::__FloatProperty' has a wrong offset!");
static_assert(offsetof(ABP_BD_GDF_ConstructionYard::FAnimBlueprintGeneratedMutableData, __BoolProperty_0) == 0x000008, "Member 'ABP_BD_GDF_ConstructionYard::FAnimBlueprintGeneratedMutableData::__BoolProperty_0' has a wrong offset!");

}

