#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_VH_DYN_Hornet

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct ABP_VH_DYN_Hornet.ABP_VH_DYN_Hornet_C.AnimBlueprintGeneratedConstantData
// 0x0517 (0x0518 - 0x0001)
struct ABP_VH_DYN_Hornet::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_94;                                 // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlendProfile*                          __BlendProfile_95;                                 // 0x0010(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_96;                                   // 0x0018(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_97;                                 // 0x0020(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_98;                                 // 0x0021(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_99;                                // 0x0028(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_100;                                // 0x0038(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_101;                                 // 0x0040(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_102;                                // 0x0044(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_103;                               // 0x0048(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_104;                               // 0x004C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_105;                                // 0x0050(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_106;                                // 0x0051(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_107;                                // 0x0052(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_53[0x1];                                       // 0x0053(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_108;                                // 0x0054(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_109;                                // 0x005C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_110;                                // 0x0064(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_111;                                 // 0x006C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimNodeFunctionRef                   __StructProperty_112;                              // 0x0070(0x0020)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0090(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0110(0x0018)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root;                           // 0x0128(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_RotationOffsetBlendSpace;       // 0x0158(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_1;             // 0x0188(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalRefPose_2;                 // 0x01B8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive_1;                // 0x01E8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone;                     // 0x0218(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ComponentToLocalSpace;          // 0x0248(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalRefPose_1;                 // 0x0278(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalToComponentSpace;          // 0x02A8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool;                // 0x02D8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_1;             // 0x0308(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult;               // 0x0338(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalRefPose;                   // 0x0368(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_1;                  // 0x0398(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer;               // 0x03C8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult;                    // 0x03F8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine;                   // 0x0428(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose;                 // 0x0458(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive;                  // 0x0488(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose;                  // 0x04B8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot;                           // 0x04E8(0x0030)()
};
static_assert(alignof(ABP_VH_DYN_Hornet::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on ABP_VH_DYN_Hornet::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(ABP_VH_DYN_Hornet::FAnimBlueprintGeneratedConstantData) == 0x000518, "Wrong size on ABP_VH_DYN_Hornet::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(ABP_VH_DYN_Hornet::FAnimBlueprintGeneratedConstantData, __NameProperty_94) == 0x000004, "Member 'ABP_VH_DYN_Hornet::FAnimBlueprintGeneratedConstantData::__NameProperty_94' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_Hornet::FAnimBlueprintGeneratedConstantData, __BlendProfile_95) == 0x000010, "Member 'ABP_VH_DYN_Hornet::FAnimBlueprintGeneratedConstantData::__BlendProfile_95' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_Hornet::FAnimBlueprintGeneratedConstantData, __CurveFloat_96) == 0x000018, "Member 'ABP_VH_DYN_Hornet::FAnimBlueprintGeneratedConstantData::__CurveFloat_96' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_Hornet::FAnimBlueprintGeneratedConstantData, __EnumProperty_97) == 0x000020, "Member 'ABP_VH_DYN_Hornet::FAnimBlueprintGeneratedConstantData::__EnumProperty_97' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_Hornet::FAnimBlueprintGeneratedConstantData, __EnumProperty_98) == 0x000021, "Member 'ABP_VH_DYN_Hornet::FAnimBlueprintGeneratedConstantData::__EnumProperty_98' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_Hornet::FAnimBlueprintGeneratedConstantData, __ArrayProperty_99) == 0x000028, "Member 'ABP_VH_DYN_Hornet::FAnimBlueprintGeneratedConstantData::__ArrayProperty_99' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_Hornet::FAnimBlueprintGeneratedConstantData, __NameProperty_100) == 0x000038, "Member 'ABP_VH_DYN_Hornet::FAnimBlueprintGeneratedConstantData::__NameProperty_100' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_Hornet::FAnimBlueprintGeneratedConstantData, __IntProperty_101) == 0x000040, "Member 'ABP_VH_DYN_Hornet::FAnimBlueprintGeneratedConstantData::__IntProperty_101' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_Hornet::FAnimBlueprintGeneratedConstantData, __BoolProperty_102) == 0x000044, "Member 'ABP_VH_DYN_Hornet::FAnimBlueprintGeneratedConstantData::__BoolProperty_102' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_Hornet::FAnimBlueprintGeneratedConstantData, __FloatProperty_103) == 0x000048, "Member 'ABP_VH_DYN_Hornet::FAnimBlueprintGeneratedConstantData::__FloatProperty_103' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_Hornet::FAnimBlueprintGeneratedConstantData, __FloatProperty_104) == 0x00004C, "Member 'ABP_VH_DYN_Hornet::FAnimBlueprintGeneratedConstantData::__FloatProperty_104' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_Hornet::FAnimBlueprintGeneratedConstantData, __BoolProperty_105) == 0x000050, "Member 'ABP_VH_DYN_Hornet::FAnimBlueprintGeneratedConstantData::__BoolProperty_105' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_Hornet::FAnimBlueprintGeneratedConstantData, __EnumProperty_106) == 0x000051, "Member 'ABP_VH_DYN_Hornet::FAnimBlueprintGeneratedConstantData::__EnumProperty_106' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_Hornet::FAnimBlueprintGeneratedConstantData, __ByteProperty_107) == 0x000052, "Member 'ABP_VH_DYN_Hornet::FAnimBlueprintGeneratedConstantData::__ByteProperty_107' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_Hornet::FAnimBlueprintGeneratedConstantData, __NameProperty_108) == 0x000054, "Member 'ABP_VH_DYN_Hornet::FAnimBlueprintGeneratedConstantData::__NameProperty_108' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_Hornet::FAnimBlueprintGeneratedConstantData, __NameProperty_109) == 0x00005C, "Member 'ABP_VH_DYN_Hornet::FAnimBlueprintGeneratedConstantData::__NameProperty_109' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_Hornet::FAnimBlueprintGeneratedConstantData, __NameProperty_110) == 0x000064, "Member 'ABP_VH_DYN_Hornet::FAnimBlueprintGeneratedConstantData::__NameProperty_110' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_Hornet::FAnimBlueprintGeneratedConstantData, __IntProperty_111) == 0x00006C, "Member 'ABP_VH_DYN_Hornet::FAnimBlueprintGeneratedConstantData::__IntProperty_111' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_Hornet::FAnimBlueprintGeneratedConstantData, __StructProperty_112) == 0x000070, "Member 'ABP_VH_DYN_Hornet::FAnimBlueprintGeneratedConstantData::__StructProperty_112' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_Hornet::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000090, "Member 'ABP_VH_DYN_Hornet::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_Hornet::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000110, "Member 'ABP_VH_DYN_Hornet::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_Hornet::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root) == 0x000128, "Member 'ABP_VH_DYN_Hornet::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_Hornet::FAnimBlueprintGeneratedConstantData, AnimGraphNode_RotationOffsetBlendSpace) == 0x000158, "Member 'ABP_VH_DYN_Hornet::FAnimBlueprintGeneratedConstantData::AnimGraphNode_RotationOffsetBlendSpace' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_Hornet::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendSpacePlayer_1) == 0x000188, "Member 'ABP_VH_DYN_Hornet::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendSpacePlayer_1' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_Hornet::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LocalRefPose_2) == 0x0001B8, "Member 'ABP_VH_DYN_Hornet::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LocalRefPose_2' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_Hornet::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ApplyAdditive_1) == 0x0001E8, "Member 'ABP_VH_DYN_Hornet::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ApplyAdditive_1' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_Hornet::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ModifyBone) == 0x000218, "Member 'ABP_VH_DYN_Hornet::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_Hornet::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ComponentToLocalSpace) == 0x000248, "Member 'ABP_VH_DYN_Hornet::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_Hornet::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LocalRefPose_1) == 0x000278, "Member 'ABP_VH_DYN_Hornet::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LocalRefPose_1' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_Hornet::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LocalToComponentSpace) == 0x0002A8, "Member 'ABP_VH_DYN_Hornet::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_Hornet::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendListByBool) == 0x0002D8, "Member 'ABP_VH_DYN_Hornet::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_Hornet::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_1) == 0x000308, "Member 'ABP_VH_DYN_Hornet::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_Hornet::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult) == 0x000338, "Member 'ABP_VH_DYN_Hornet::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_Hornet::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LocalRefPose) == 0x000368, "Member 'ABP_VH_DYN_Hornet::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LocalRefPose' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_Hornet::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult_1) == 0x000398, "Member 'ABP_VH_DYN_Hornet::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_Hornet::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendSpacePlayer) == 0x0003C8, "Member 'ABP_VH_DYN_Hornet::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendSpacePlayer' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_Hornet::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult) == 0x0003F8, "Member 'ABP_VH_DYN_Hornet::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_Hornet::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateMachine) == 0x000428, "Member 'ABP_VH_DYN_Hornet::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_Hornet::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SaveCachedPose) == 0x000458, "Member 'ABP_VH_DYN_Hornet::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_Hornet::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ApplyAdditive) == 0x000488, "Member 'ABP_VH_DYN_Hornet::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ApplyAdditive' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_Hornet::FAnimBlueprintGeneratedConstantData, AnimGraphNode_UseCachedPose) == 0x0004B8, "Member 'ABP_VH_DYN_Hornet::FAnimBlueprintGeneratedConstantData::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_Hornet::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Slot) == 0x0004E8, "Member 'ABP_VH_DYN_Hornet::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Slot' has a wrong offset!");

// ScriptStruct ABP_VH_DYN_Hornet.ABP_VH_DYN_Hornet_C.AnimBlueprintGeneratedMutableData
// 0x0017 (0x0018 - 0x0001)
struct ABP_VH_DYN_Hornet::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty;                                   // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_0;                                 // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_1;                                 // 0x000C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_2;                                  // 0x0010(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_3;                                 // 0x0014(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_VH_DYN_Hornet::FAnimBlueprintGeneratedMutableData) == 0x000004, "Wrong alignment on ABP_VH_DYN_Hornet::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(ABP_VH_DYN_Hornet::FAnimBlueprintGeneratedMutableData) == 0x000018, "Wrong size on ABP_VH_DYN_Hornet::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(ABP_VH_DYN_Hornet::FAnimBlueprintGeneratedMutableData, __FloatProperty) == 0x000004, "Member 'ABP_VH_DYN_Hornet::FAnimBlueprintGeneratedMutableData::__FloatProperty' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_Hornet::FAnimBlueprintGeneratedMutableData, __FloatProperty_0) == 0x000008, "Member 'ABP_VH_DYN_Hornet::FAnimBlueprintGeneratedMutableData::__FloatProperty_0' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_Hornet::FAnimBlueprintGeneratedMutableData, __FloatProperty_1) == 0x00000C, "Member 'ABP_VH_DYN_Hornet::FAnimBlueprintGeneratedMutableData::__FloatProperty_1' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_Hornet::FAnimBlueprintGeneratedMutableData, __BoolProperty_2) == 0x000010, "Member 'ABP_VH_DYN_Hornet::FAnimBlueprintGeneratedMutableData::__BoolProperty_2' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_Hornet::FAnimBlueprintGeneratedMutableData, __FloatProperty_3) == 0x000014, "Member 'ABP_VH_DYN_Hornet::FAnimBlueprintGeneratedMutableData::__FloatProperty_3' has a wrong offset!");

}

