#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_BD_DYN_Barracks

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct ABP_BD_DYN_Barracks.ABP_BD_DYN_Barracks_C.AnimBlueprintGeneratedConstantData
// 0x0287 (0x0288 - 0x0001)
struct ABP_BD_DYN_Barracks::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_42;                                 // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_43;                                 // 0x000C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlendProfile*                          __BlendProfile_44;                                 // 0x0010(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_45;                                   // 0x0018(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_46;                                 // 0x0020(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_47;                                 // 0x0021(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_48;                                // 0x0028(0x0010)(BlueprintVisible, EditFixedSize)
	struct FAnimNodeFunctionRef                   __StructProperty_49;                               // 0x0038(0x0020)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_50;                                // 0x0058(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_51;                               // 0x005C(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_52;                                // 0x0088(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_53;                                // 0x008C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_54;                                 // 0x0090(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_55;                                 // 0x0091(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_56;                                 // 0x0092(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_93[0x1];                                       // 0x0093(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_57;                                 // 0x0094(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x00A0(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0120(0x0018)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root;                           // 0x0138(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot;                           // 0x0168(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_2;               // 0x0198(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool;                // 0x01C8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive;                  // 0x01F8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_1;               // 0x0228(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer;                 // 0x0258(0x0030)()
};
static_assert(alignof(ABP_BD_DYN_Barracks::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on ABP_BD_DYN_Barracks::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(ABP_BD_DYN_Barracks::FAnimBlueprintGeneratedConstantData) == 0x000288, "Wrong size on ABP_BD_DYN_Barracks::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(ABP_BD_DYN_Barracks::FAnimBlueprintGeneratedConstantData, __NameProperty_42) == 0x000004, "Member 'ABP_BD_DYN_Barracks::FAnimBlueprintGeneratedConstantData::__NameProperty_42' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_Barracks::FAnimBlueprintGeneratedConstantData, __BoolProperty_43) == 0x00000C, "Member 'ABP_BD_DYN_Barracks::FAnimBlueprintGeneratedConstantData::__BoolProperty_43' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_Barracks::FAnimBlueprintGeneratedConstantData, __BlendProfile_44) == 0x000010, "Member 'ABP_BD_DYN_Barracks::FAnimBlueprintGeneratedConstantData::__BlendProfile_44' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_Barracks::FAnimBlueprintGeneratedConstantData, __CurveFloat_45) == 0x000018, "Member 'ABP_BD_DYN_Barracks::FAnimBlueprintGeneratedConstantData::__CurveFloat_45' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_Barracks::FAnimBlueprintGeneratedConstantData, __EnumProperty_46) == 0x000020, "Member 'ABP_BD_DYN_Barracks::FAnimBlueprintGeneratedConstantData::__EnumProperty_46' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_Barracks::FAnimBlueprintGeneratedConstantData, __EnumProperty_47) == 0x000021, "Member 'ABP_BD_DYN_Barracks::FAnimBlueprintGeneratedConstantData::__EnumProperty_47' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_Barracks::FAnimBlueprintGeneratedConstantData, __ArrayProperty_48) == 0x000028, "Member 'ABP_BD_DYN_Barracks::FAnimBlueprintGeneratedConstantData::__ArrayProperty_48' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_Barracks::FAnimBlueprintGeneratedConstantData, __StructProperty_49) == 0x000038, "Member 'ABP_BD_DYN_Barracks::FAnimBlueprintGeneratedConstantData::__StructProperty_49' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_Barracks::FAnimBlueprintGeneratedConstantData, __FloatProperty_50) == 0x000058, "Member 'ABP_BD_DYN_Barracks::FAnimBlueprintGeneratedConstantData::__FloatProperty_50' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_Barracks::FAnimBlueprintGeneratedConstantData, __StructProperty_51) == 0x00005C, "Member 'ABP_BD_DYN_Barracks::FAnimBlueprintGeneratedConstantData::__StructProperty_51' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_Barracks::FAnimBlueprintGeneratedConstantData, __FloatProperty_52) == 0x000088, "Member 'ABP_BD_DYN_Barracks::FAnimBlueprintGeneratedConstantData::__FloatProperty_52' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_Barracks::FAnimBlueprintGeneratedConstantData, __FloatProperty_53) == 0x00008C, "Member 'ABP_BD_DYN_Barracks::FAnimBlueprintGeneratedConstantData::__FloatProperty_53' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_Barracks::FAnimBlueprintGeneratedConstantData, __BoolProperty_54) == 0x000090, "Member 'ABP_BD_DYN_Barracks::FAnimBlueprintGeneratedConstantData::__BoolProperty_54' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_Barracks::FAnimBlueprintGeneratedConstantData, __EnumProperty_55) == 0x000091, "Member 'ABP_BD_DYN_Barracks::FAnimBlueprintGeneratedConstantData::__EnumProperty_55' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_Barracks::FAnimBlueprintGeneratedConstantData, __ByteProperty_56) == 0x000092, "Member 'ABP_BD_DYN_Barracks::FAnimBlueprintGeneratedConstantData::__ByteProperty_56' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_Barracks::FAnimBlueprintGeneratedConstantData, __NameProperty_57) == 0x000094, "Member 'ABP_BD_DYN_Barracks::FAnimBlueprintGeneratedConstantData::__NameProperty_57' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_Barracks::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x0000A0, "Member 'ABP_BD_DYN_Barracks::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_Barracks::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000120, "Member 'ABP_BD_DYN_Barracks::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_Barracks::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root) == 0x000138, "Member 'ABP_BD_DYN_Barracks::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_Barracks::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Slot) == 0x000168, "Member 'ABP_BD_DYN_Barracks::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_Barracks::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_2) == 0x000198, "Member 'ABP_BD_DYN_Barracks::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_Barracks::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendListByBool) == 0x0001C8, "Member 'ABP_BD_DYN_Barracks::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_Barracks::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ApplyAdditive) == 0x0001F8, "Member 'ABP_BD_DYN_Barracks::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ApplyAdditive' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_Barracks::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_1) == 0x000228, "Member 'ABP_BD_DYN_Barracks::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_Barracks::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer) == 0x000258, "Member 'ABP_BD_DYN_Barracks::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer' has a wrong offset!");

// ScriptStruct ABP_BD_DYN_Barracks.ABP_BD_DYN_Barracks_C.AnimBlueprintGeneratedMutableData
// 0x0001 (0x0002 - 0x0001)
struct ABP_BD_DYN_Barracks::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	bool                                          __BoolProperty;                                    // 0x0001(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_BD_DYN_Barracks::FAnimBlueprintGeneratedMutableData) == 0x000001, "Wrong alignment on ABP_BD_DYN_Barracks::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(ABP_BD_DYN_Barracks::FAnimBlueprintGeneratedMutableData) == 0x000002, "Wrong size on ABP_BD_DYN_Barracks::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(ABP_BD_DYN_Barracks::FAnimBlueprintGeneratedMutableData, __BoolProperty) == 0x000001, "Member 'ABP_BD_DYN_Barracks::FAnimBlueprintGeneratedMutableData::__BoolProperty' has a wrong offset!");

}

