#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_InfantryBase

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct ABP_InfantryBase.ABP_InfantryBase_C.AnimBlueprintGeneratedConstantData
// 0x0F7F (0x0F80 - 0x0001)
struct ABP_InfantryBase::FAnimBlueprintGeneratedConstantData : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_473;                                // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_474;                                // 0x000C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_475;                                 // 0x0014(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_476;                                // 0x0018(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_477;                                 // 0x0020(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_478;                                // 0x0024(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_479;                                 // 0x002C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 __ArrayProperty_480;                               // 0x0030(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_481;                                // 0x0040(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_482;                                // 0x0048(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_483;                                // 0x0050(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 __ArrayProperty_484;                               // 0x0058(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_485;                                // 0x0068(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_486;                                 // 0x0070(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_487;                                // 0x0074(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_488;                                 // 0x007C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_489;                                // 0x0080(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_490;                                 // 0x0088(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_491;                                // 0x008C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_492;                                // 0x0094(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_493;                               // 0x00A0(0x0010)(BlueprintVisible, EditFixedSize)
	struct FAnimNodeFunctionRef                   __StructProperty_494;                              // 0x00B0(0x0020)(BlueprintVisible, NoDestructor)
	struct FAnimNodeFunctionRef                   __StructProperty_495;                              // 0x00D0(0x0020)(BlueprintVisible, NoDestructor)
	class UBlendProfile*                          __BlendProfile_496;                                // 0x00F0(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_497;                                  // 0x00F8(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_498;                                // 0x0100(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_499;                                // 0x0101(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_102[0x6];                                      // 0x0102(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_500;                               // 0x0108(0x0010)(BlueprintVisible, EditFixedSize)
	struct FInputScaleBiasClampConstants          __StructProperty_501;                              // 0x0118(0x002C)(BlueprintVisible, NoDestructor)
	bool                                          __BoolProperty_502;                                // 0x0144(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_145[0x3];                                      // 0x0145(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_503;                               // 0x0148(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_504;                               // 0x014C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_505;                                // 0x0150(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_506;                                // 0x0151(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_507;                                // 0x0152(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_153[0x1];                                      // 0x0153(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_508;                                // 0x0154(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_509;                                // 0x015C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_510;                                // 0x0164(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_511;                                 // 0x016C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimNodeFunctionRef                   __StructProperty_512;                              // 0x0170(0x0020)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0190(0x0080)()
	struct FAnimSubsystem                         AnimBlueprintExtension_NodeRelevancy;              // 0x0210(0x0008)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0218(0x0018)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root;                           // 0x0230(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_15;            // 0x0260(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_14;            // 0x0290(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_13;            // 0x02C0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_12;            // 0x02F0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_11;            // 0x0320(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_10;            // 0x0350(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_9;             // 0x0380(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_8;             // 0x03B0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_7;             // 0x03E0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_6;             // 0x0410(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_5;             // 0x0440(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_4;             // 0x0470(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_13;              // 0x04A0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_11;                 // 0x04D0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_12;              // 0x0500(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_10;                 // 0x0530(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_11;              // 0x0560(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_9;                  // 0x0590(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_7;              // 0x05C0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_10;              // 0x05F0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_3;             // 0x0620(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_8;                  // 0x0650(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_9;               // 0x0680(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_7;                  // 0x06B0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_8;               // 0x06E0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_6;                  // 0x0710(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ComponentToLocalSpace;          // 0x0740(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalToComponentSpace;          // 0x0770(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_2;             // 0x07A0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_6;              // 0x07D0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_3;             // 0x0800(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_2;             // 0x0830(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_1;             // 0x0860(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult;               // 0x0890(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_7;               // 0x08C0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_5;                  // 0x08F0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_6;               // 0x0920(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_4;                  // 0x0950(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_5;               // 0x0980(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_5;              // 0x09B0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_4;               // 0x09E0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_3;                  // 0x0A10(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_3;               // 0x0A40(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_4;              // 0x0A70(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_1;             // 0x0AA0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_2;                  // 0x0AD0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine_2;                 // 0x0B00(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_1;                  // 0x0B30(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine_1;                 // 0x0B60(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_3;              // 0x0B90(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_2;               // 0x0BC0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_1;               // 0x0BF0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_2;              // 0x0C20(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_1;              // 0x0C50(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone_2;                   // 0x0C80(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone_1;                   // 0x0CB0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot_2;                         // 0x0CE0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone;                     // 0x0D10(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool;                // 0x0D40(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer;                 // 0x0D70(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer;               // 0x0DA0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult;                    // 0x0DD0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine;                   // 0x0E00(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot_1;                         // 0x0E30(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose;                 // 0x0E60(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_1;                // 0x0E90(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LayeredBoneBlend;               // 0x0EC0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose;                  // 0x0EF0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot;                           // 0x0F20(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_DeadBlending;                   // 0x0F50(0x0030)()
};
static_assert(alignof(ABP_InfantryBase::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on ABP_InfantryBase::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(ABP_InfantryBase::FAnimBlueprintGeneratedConstantData) == 0x000F80, "Wrong size on ABP_InfantryBase::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(ABP_InfantryBase::FAnimBlueprintGeneratedConstantData, __NameProperty_473) == 0x000004, "Member 'ABP_InfantryBase::FAnimBlueprintGeneratedConstantData::__NameProperty_473' has a wrong offset!");
static_assert(offsetof(ABP_InfantryBase::FAnimBlueprintGeneratedConstantData, __NameProperty_474) == 0x00000C, "Member 'ABP_InfantryBase::FAnimBlueprintGeneratedConstantData::__NameProperty_474' has a wrong offset!");
static_assert(offsetof(ABP_InfantryBase::FAnimBlueprintGeneratedConstantData, __IntProperty_475) == 0x000014, "Member 'ABP_InfantryBase::FAnimBlueprintGeneratedConstantData::__IntProperty_475' has a wrong offset!");
static_assert(offsetof(ABP_InfantryBase::FAnimBlueprintGeneratedConstantData, __NameProperty_476) == 0x000018, "Member 'ABP_InfantryBase::FAnimBlueprintGeneratedConstantData::__NameProperty_476' has a wrong offset!");
static_assert(offsetof(ABP_InfantryBase::FAnimBlueprintGeneratedConstantData, __IntProperty_477) == 0x000020, "Member 'ABP_InfantryBase::FAnimBlueprintGeneratedConstantData::__IntProperty_477' has a wrong offset!");
static_assert(offsetof(ABP_InfantryBase::FAnimBlueprintGeneratedConstantData, __NameProperty_478) == 0x000024, "Member 'ABP_InfantryBase::FAnimBlueprintGeneratedConstantData::__NameProperty_478' has a wrong offset!");
static_assert(offsetof(ABP_InfantryBase::FAnimBlueprintGeneratedConstantData, __IntProperty_479) == 0x00002C, "Member 'ABP_InfantryBase::FAnimBlueprintGeneratedConstantData::__IntProperty_479' has a wrong offset!");
static_assert(offsetof(ABP_InfantryBase::FAnimBlueprintGeneratedConstantData, __ArrayProperty_480) == 0x000030, "Member 'ABP_InfantryBase::FAnimBlueprintGeneratedConstantData::__ArrayProperty_480' has a wrong offset!");
static_assert(offsetof(ABP_InfantryBase::FAnimBlueprintGeneratedConstantData, __NameProperty_481) == 0x000040, "Member 'ABP_InfantryBase::FAnimBlueprintGeneratedConstantData::__NameProperty_481' has a wrong offset!");
static_assert(offsetof(ABP_InfantryBase::FAnimBlueprintGeneratedConstantData, __NameProperty_482) == 0x000048, "Member 'ABP_InfantryBase::FAnimBlueprintGeneratedConstantData::__NameProperty_482' has a wrong offset!");
static_assert(offsetof(ABP_InfantryBase::FAnimBlueprintGeneratedConstantData, __NameProperty_483) == 0x000050, "Member 'ABP_InfantryBase::FAnimBlueprintGeneratedConstantData::__NameProperty_483' has a wrong offset!");
static_assert(offsetof(ABP_InfantryBase::FAnimBlueprintGeneratedConstantData, __ArrayProperty_484) == 0x000058, "Member 'ABP_InfantryBase::FAnimBlueprintGeneratedConstantData::__ArrayProperty_484' has a wrong offset!");
static_assert(offsetof(ABP_InfantryBase::FAnimBlueprintGeneratedConstantData, __NameProperty_485) == 0x000068, "Member 'ABP_InfantryBase::FAnimBlueprintGeneratedConstantData::__NameProperty_485' has a wrong offset!");
static_assert(offsetof(ABP_InfantryBase::FAnimBlueprintGeneratedConstantData, __IntProperty_486) == 0x000070, "Member 'ABP_InfantryBase::FAnimBlueprintGeneratedConstantData::__IntProperty_486' has a wrong offset!");
static_assert(offsetof(ABP_InfantryBase::FAnimBlueprintGeneratedConstantData, __NameProperty_487) == 0x000074, "Member 'ABP_InfantryBase::FAnimBlueprintGeneratedConstantData::__NameProperty_487' has a wrong offset!");
static_assert(offsetof(ABP_InfantryBase::FAnimBlueprintGeneratedConstantData, __IntProperty_488) == 0x00007C, "Member 'ABP_InfantryBase::FAnimBlueprintGeneratedConstantData::__IntProperty_488' has a wrong offset!");
static_assert(offsetof(ABP_InfantryBase::FAnimBlueprintGeneratedConstantData, __NameProperty_489) == 0x000080, "Member 'ABP_InfantryBase::FAnimBlueprintGeneratedConstantData::__NameProperty_489' has a wrong offset!");
static_assert(offsetof(ABP_InfantryBase::FAnimBlueprintGeneratedConstantData, __IntProperty_490) == 0x000088, "Member 'ABP_InfantryBase::FAnimBlueprintGeneratedConstantData::__IntProperty_490' has a wrong offset!");
static_assert(offsetof(ABP_InfantryBase::FAnimBlueprintGeneratedConstantData, __NameProperty_491) == 0x00008C, "Member 'ABP_InfantryBase::FAnimBlueprintGeneratedConstantData::__NameProperty_491' has a wrong offset!");
static_assert(offsetof(ABP_InfantryBase::FAnimBlueprintGeneratedConstantData, __NameProperty_492) == 0x000094, "Member 'ABP_InfantryBase::FAnimBlueprintGeneratedConstantData::__NameProperty_492' has a wrong offset!");
static_assert(offsetof(ABP_InfantryBase::FAnimBlueprintGeneratedConstantData, __ArrayProperty_493) == 0x0000A0, "Member 'ABP_InfantryBase::FAnimBlueprintGeneratedConstantData::__ArrayProperty_493' has a wrong offset!");
static_assert(offsetof(ABP_InfantryBase::FAnimBlueprintGeneratedConstantData, __StructProperty_494) == 0x0000B0, "Member 'ABP_InfantryBase::FAnimBlueprintGeneratedConstantData::__StructProperty_494' has a wrong offset!");
static_assert(offsetof(ABP_InfantryBase::FAnimBlueprintGeneratedConstantData, __StructProperty_495) == 0x0000D0, "Member 'ABP_InfantryBase::FAnimBlueprintGeneratedConstantData::__StructProperty_495' has a wrong offset!");
static_assert(offsetof(ABP_InfantryBase::FAnimBlueprintGeneratedConstantData, __BlendProfile_496) == 0x0000F0, "Member 'ABP_InfantryBase::FAnimBlueprintGeneratedConstantData::__BlendProfile_496' has a wrong offset!");
static_assert(offsetof(ABP_InfantryBase::FAnimBlueprintGeneratedConstantData, __CurveFloat_497) == 0x0000F8, "Member 'ABP_InfantryBase::FAnimBlueprintGeneratedConstantData::__CurveFloat_497' has a wrong offset!");
static_assert(offsetof(ABP_InfantryBase::FAnimBlueprintGeneratedConstantData, __EnumProperty_498) == 0x000100, "Member 'ABP_InfantryBase::FAnimBlueprintGeneratedConstantData::__EnumProperty_498' has a wrong offset!");
static_assert(offsetof(ABP_InfantryBase::FAnimBlueprintGeneratedConstantData, __EnumProperty_499) == 0x000101, "Member 'ABP_InfantryBase::FAnimBlueprintGeneratedConstantData::__EnumProperty_499' has a wrong offset!");
static_assert(offsetof(ABP_InfantryBase::FAnimBlueprintGeneratedConstantData, __ArrayProperty_500) == 0x000108, "Member 'ABP_InfantryBase::FAnimBlueprintGeneratedConstantData::__ArrayProperty_500' has a wrong offset!");
static_assert(offsetof(ABP_InfantryBase::FAnimBlueprintGeneratedConstantData, __StructProperty_501) == 0x000118, "Member 'ABP_InfantryBase::FAnimBlueprintGeneratedConstantData::__StructProperty_501' has a wrong offset!");
static_assert(offsetof(ABP_InfantryBase::FAnimBlueprintGeneratedConstantData, __BoolProperty_502) == 0x000144, "Member 'ABP_InfantryBase::FAnimBlueprintGeneratedConstantData::__BoolProperty_502' has a wrong offset!");
static_assert(offsetof(ABP_InfantryBase::FAnimBlueprintGeneratedConstantData, __FloatProperty_503) == 0x000148, "Member 'ABP_InfantryBase::FAnimBlueprintGeneratedConstantData::__FloatProperty_503' has a wrong offset!");
static_assert(offsetof(ABP_InfantryBase::FAnimBlueprintGeneratedConstantData, __FloatProperty_504) == 0x00014C, "Member 'ABP_InfantryBase::FAnimBlueprintGeneratedConstantData::__FloatProperty_504' has a wrong offset!");
static_assert(offsetof(ABP_InfantryBase::FAnimBlueprintGeneratedConstantData, __BoolProperty_505) == 0x000150, "Member 'ABP_InfantryBase::FAnimBlueprintGeneratedConstantData::__BoolProperty_505' has a wrong offset!");
static_assert(offsetof(ABP_InfantryBase::FAnimBlueprintGeneratedConstantData, __EnumProperty_506) == 0x000151, "Member 'ABP_InfantryBase::FAnimBlueprintGeneratedConstantData::__EnumProperty_506' has a wrong offset!");
static_assert(offsetof(ABP_InfantryBase::FAnimBlueprintGeneratedConstantData, __ByteProperty_507) == 0x000152, "Member 'ABP_InfantryBase::FAnimBlueprintGeneratedConstantData::__ByteProperty_507' has a wrong offset!");
static_assert(offsetof(ABP_InfantryBase::FAnimBlueprintGeneratedConstantData, __NameProperty_508) == 0x000154, "Member 'ABP_InfantryBase::FAnimBlueprintGeneratedConstantData::__NameProperty_508' has a wrong offset!");
static_assert(offsetof(ABP_InfantryBase::FAnimBlueprintGeneratedConstantData, __NameProperty_509) == 0x00015C, "Member 'ABP_InfantryBase::FAnimBlueprintGeneratedConstantData::__NameProperty_509' has a wrong offset!");
static_assert(offsetof(ABP_InfantryBase::FAnimBlueprintGeneratedConstantData, __NameProperty_510) == 0x000164, "Member 'ABP_InfantryBase::FAnimBlueprintGeneratedConstantData::__NameProperty_510' has a wrong offset!");
static_assert(offsetof(ABP_InfantryBase::FAnimBlueprintGeneratedConstantData, __IntProperty_511) == 0x00016C, "Member 'ABP_InfantryBase::FAnimBlueprintGeneratedConstantData::__IntProperty_511' has a wrong offset!");
static_assert(offsetof(ABP_InfantryBase::FAnimBlueprintGeneratedConstantData, __StructProperty_512) == 0x000170, "Member 'ABP_InfantryBase::FAnimBlueprintGeneratedConstantData::__StructProperty_512' has a wrong offset!");
static_assert(offsetof(ABP_InfantryBase::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000190, "Member 'ABP_InfantryBase::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(ABP_InfantryBase::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_NodeRelevancy) == 0x000210, "Member 'ABP_InfantryBase::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_NodeRelevancy' has a wrong offset!");
static_assert(offsetof(ABP_InfantryBase::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000218, "Member 'ABP_InfantryBase::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(ABP_InfantryBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root) == 0x000230, "Member 'ABP_InfantryBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(ABP_InfantryBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_15) == 0x000260, "Member 'ABP_InfantryBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_15' has a wrong offset!");
static_assert(offsetof(ABP_InfantryBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_14) == 0x000290, "Member 'ABP_InfantryBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_14' has a wrong offset!");
static_assert(offsetof(ABP_InfantryBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_13) == 0x0002C0, "Member 'ABP_InfantryBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_13' has a wrong offset!");
static_assert(offsetof(ABP_InfantryBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_12) == 0x0002F0, "Member 'ABP_InfantryBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_12' has a wrong offset!");
static_assert(offsetof(ABP_InfantryBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_11) == 0x000320, "Member 'ABP_InfantryBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_11' has a wrong offset!");
static_assert(offsetof(ABP_InfantryBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_10) == 0x000350, "Member 'ABP_InfantryBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_10' has a wrong offset!");
static_assert(offsetof(ABP_InfantryBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_9) == 0x000380, "Member 'ABP_InfantryBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_9' has a wrong offset!");
static_assert(offsetof(ABP_InfantryBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_8) == 0x0003B0, "Member 'ABP_InfantryBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_8' has a wrong offset!");
static_assert(offsetof(ABP_InfantryBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_7) == 0x0003E0, "Member 'ABP_InfantryBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_7' has a wrong offset!");
static_assert(offsetof(ABP_InfantryBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_6) == 0x000410, "Member 'ABP_InfantryBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_6' has a wrong offset!");
static_assert(offsetof(ABP_InfantryBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_5) == 0x000440, "Member 'ABP_InfantryBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_5' has a wrong offset!");
static_assert(offsetof(ABP_InfantryBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_4) == 0x000470, "Member 'ABP_InfantryBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_4' has a wrong offset!");
static_assert(offsetof(ABP_InfantryBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_13) == 0x0004A0, "Member 'ABP_InfantryBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_13' has a wrong offset!");
static_assert(offsetof(ABP_InfantryBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult_11) == 0x0004D0, "Member 'ABP_InfantryBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult_11' has a wrong offset!");
static_assert(offsetof(ABP_InfantryBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_12) == 0x000500, "Member 'ABP_InfantryBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_12' has a wrong offset!");
static_assert(offsetof(ABP_InfantryBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult_10) == 0x000530, "Member 'ABP_InfantryBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult_10' has a wrong offset!");
static_assert(offsetof(ABP_InfantryBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_11) == 0x000560, "Member 'ABP_InfantryBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_11' has a wrong offset!");
static_assert(offsetof(ABP_InfantryBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult_9) == 0x000590, "Member 'ABP_InfantryBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult_9' has a wrong offset!");
static_assert(offsetof(ABP_InfantryBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendListByBool_7) == 0x0005C0, "Member 'ABP_InfantryBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendListByBool_7' has a wrong offset!");
static_assert(offsetof(ABP_InfantryBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_10) == 0x0005F0, "Member 'ABP_InfantryBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_10' has a wrong offset!");
static_assert(offsetof(ABP_InfantryBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendSpacePlayer_3) == 0x000620, "Member 'ABP_InfantryBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendSpacePlayer_3' has a wrong offset!");
static_assert(offsetof(ABP_InfantryBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult_8) == 0x000650, "Member 'ABP_InfantryBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult_8' has a wrong offset!");
static_assert(offsetof(ABP_InfantryBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_9) == 0x000680, "Member 'ABP_InfantryBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_9' has a wrong offset!");
static_assert(offsetof(ABP_InfantryBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult_7) == 0x0006B0, "Member 'ABP_InfantryBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult_7' has a wrong offset!");
static_assert(offsetof(ABP_InfantryBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_8) == 0x0006E0, "Member 'ABP_InfantryBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_8' has a wrong offset!");
static_assert(offsetof(ABP_InfantryBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult_6) == 0x000710, "Member 'ABP_InfantryBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult_6' has a wrong offset!");
static_assert(offsetof(ABP_InfantryBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ComponentToLocalSpace) == 0x000740, "Member 'ABP_InfantryBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(ABP_InfantryBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LocalToComponentSpace) == 0x000770, "Member 'ABP_InfantryBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(ABP_InfantryBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendSpacePlayer_2) == 0x0007A0, "Member 'ABP_InfantryBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendSpacePlayer_2' has a wrong offset!");
static_assert(offsetof(ABP_InfantryBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendListByBool_6) == 0x0007D0, "Member 'ABP_InfantryBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendListByBool_6' has a wrong offset!");
static_assert(offsetof(ABP_InfantryBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_3) == 0x000800, "Member 'ABP_InfantryBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_3' has a wrong offset!");
static_assert(offsetof(ABP_InfantryBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_2) == 0x000830, "Member 'ABP_InfantryBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_2' has a wrong offset!");
static_assert(offsetof(ABP_InfantryBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_1) == 0x000860, "Member 'ABP_InfantryBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(ABP_InfantryBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult) == 0x000890, "Member 'ABP_InfantryBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(ABP_InfantryBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_7) == 0x0008C0, "Member 'ABP_InfantryBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_7' has a wrong offset!");
static_assert(offsetof(ABP_InfantryBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult_5) == 0x0008F0, "Member 'ABP_InfantryBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult_5' has a wrong offset!");
static_assert(offsetof(ABP_InfantryBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_6) == 0x000920, "Member 'ABP_InfantryBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_6' has a wrong offset!");
static_assert(offsetof(ABP_InfantryBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult_4) == 0x000950, "Member 'ABP_InfantryBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult_4' has a wrong offset!");
static_assert(offsetof(ABP_InfantryBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_5) == 0x000980, "Member 'ABP_InfantryBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_5' has a wrong offset!");
static_assert(offsetof(ABP_InfantryBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendListByBool_5) == 0x0009B0, "Member 'ABP_InfantryBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendListByBool_5' has a wrong offset!");
static_assert(offsetof(ABP_InfantryBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_4) == 0x0009E0, "Member 'ABP_InfantryBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_4' has a wrong offset!");
static_assert(offsetof(ABP_InfantryBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult_3) == 0x000A10, "Member 'ABP_InfantryBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult_3' has a wrong offset!");
static_assert(offsetof(ABP_InfantryBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_3) == 0x000A40, "Member 'ABP_InfantryBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_3' has a wrong offset!");
static_assert(offsetof(ABP_InfantryBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendListByBool_4) == 0x000A70, "Member 'ABP_InfantryBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendListByBool_4' has a wrong offset!");
static_assert(offsetof(ABP_InfantryBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendSpacePlayer_1) == 0x000AA0, "Member 'ABP_InfantryBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendSpacePlayer_1' has a wrong offset!");
static_assert(offsetof(ABP_InfantryBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult_2) == 0x000AD0, "Member 'ABP_InfantryBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult_2' has a wrong offset!");
static_assert(offsetof(ABP_InfantryBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateMachine_2) == 0x000B00, "Member 'ABP_InfantryBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateMachine_2' has a wrong offset!");
static_assert(offsetof(ABP_InfantryBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult_1) == 0x000B30, "Member 'ABP_InfantryBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(ABP_InfantryBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateMachine_1) == 0x000B60, "Member 'ABP_InfantryBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateMachine_1' has a wrong offset!");
static_assert(offsetof(ABP_InfantryBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendListByBool_3) == 0x000B90, "Member 'ABP_InfantryBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendListByBool_3' has a wrong offset!");
static_assert(offsetof(ABP_InfantryBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_2) == 0x000BC0, "Member 'ABP_InfantryBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(ABP_InfantryBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_1) == 0x000BF0, "Member 'ABP_InfantryBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(ABP_InfantryBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendListByBool_2) == 0x000C20, "Member 'ABP_InfantryBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendListByBool_2' has a wrong offset!");
static_assert(offsetof(ABP_InfantryBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendListByBool_1) == 0x000C50, "Member 'ABP_InfantryBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendListByBool_1' has a wrong offset!");
static_assert(offsetof(ABP_InfantryBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ModifyBone_2) == 0x000C80, "Member 'ABP_InfantryBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ModifyBone_2' has a wrong offset!");
static_assert(offsetof(ABP_InfantryBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ModifyBone_1) == 0x000CB0, "Member 'ABP_InfantryBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ModifyBone_1' has a wrong offset!");
static_assert(offsetof(ABP_InfantryBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Slot_2) == 0x000CE0, "Member 'ABP_InfantryBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Slot_2' has a wrong offset!");
static_assert(offsetof(ABP_InfantryBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ModifyBone) == 0x000D10, "Member 'ABP_InfantryBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(ABP_InfantryBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendListByBool) == 0x000D40, "Member 'ABP_InfantryBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(ABP_InfantryBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer) == 0x000D70, "Member 'ABP_InfantryBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(ABP_InfantryBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendSpacePlayer) == 0x000DA0, "Member 'ABP_InfantryBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendSpacePlayer' has a wrong offset!");
static_assert(offsetof(ABP_InfantryBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult) == 0x000DD0, "Member 'ABP_InfantryBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(ABP_InfantryBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateMachine) == 0x000E00, "Member 'ABP_InfantryBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(ABP_InfantryBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Slot_1) == 0x000E30, "Member 'ABP_InfantryBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Slot_1' has a wrong offset!");
static_assert(offsetof(ABP_InfantryBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SaveCachedPose) == 0x000E60, "Member 'ABP_InfantryBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(ABP_InfantryBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_UseCachedPose_1) == 0x000E90, "Member 'ABP_InfantryBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_UseCachedPose_1' has a wrong offset!");
static_assert(offsetof(ABP_InfantryBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LayeredBoneBlend) == 0x000EC0, "Member 'ABP_InfantryBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LayeredBoneBlend' has a wrong offset!");
static_assert(offsetof(ABP_InfantryBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_UseCachedPose) == 0x000EF0, "Member 'ABP_InfantryBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(ABP_InfantryBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Slot) == 0x000F20, "Member 'ABP_InfantryBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(ABP_InfantryBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_DeadBlending) == 0x000F50, "Member 'ABP_InfantryBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_DeadBlending' has a wrong offset!");

// ScriptStruct ABP_InfantryBase.ABP_InfantryBase_C.AnimBlueprintGeneratedMutableData
// 0x0087 (0x0088 - 0x0001)
struct ABP_InfantryBase::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	bool                                          __BoolProperty;                                    // 0x0001(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_0;                                 // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_1;                                 // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_2;                                 // 0x000C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_3;                                 // 0x0010(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_4;                                  // 0x0014(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_5;                                 // 0x0018(0x0010)(BlueprintVisible, EditFixedSize)
	bool                                          __BoolProperty_6;                                  // 0x0028(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_7;                                 // 0x002C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 __ArrayProperty_8;                                 // 0x0030(0x0010)(BlueprintVisible, EditFixedSize)
	bool                                          __BoolProperty_9;                                  // 0x0040(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_10;                                // 0x0044(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_11;                                 // 0x0048(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_12;                                // 0x004C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 __ArrayProperty_13;                                // 0x0050(0x0010)(BlueprintVisible, EditFixedSize)
	bool                                          __BoolProperty_14;                                 // 0x0060(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_15;                                // 0x0068(0x0010)(BlueprintVisible, EditFixedSize)
	bool                                          __BoolProperty_16;                                 // 0x0078(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_17;                                 // 0x0079(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7A[0x2];                                       // 0x007A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_18;                                // 0x007C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_19;                                // 0x0080(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_InfantryBase::FAnimBlueprintGeneratedMutableData) == 0x000008, "Wrong alignment on ABP_InfantryBase::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(ABP_InfantryBase::FAnimBlueprintGeneratedMutableData) == 0x000088, "Wrong size on ABP_InfantryBase::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(ABP_InfantryBase::FAnimBlueprintGeneratedMutableData, __BoolProperty) == 0x000001, "Member 'ABP_InfantryBase::FAnimBlueprintGeneratedMutableData::__BoolProperty' has a wrong offset!");
static_assert(offsetof(ABP_InfantryBase::FAnimBlueprintGeneratedMutableData, __FloatProperty_0) == 0x000004, "Member 'ABP_InfantryBase::FAnimBlueprintGeneratedMutableData::__FloatProperty_0' has a wrong offset!");
