#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_BD_GDF_Turret_Haywire

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function ABP_BD_GDF_Turret_Haywire.ABP_BD_GDF_Turret_Haywire_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct ABP_BD_GDF_Turret_Haywire_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_BD_GDF_Turret_Haywire_C_AnimGraph) == 0x000008, "Wrong alignment on ABP_BD_GDF_Turret_Haywire_C_AnimGraph");
static_assert(sizeof(ABP_BD_GDF_Turret_Haywire_C_AnimGraph) == 0x000010, "Wrong size on ABP_BD_GDF_Turret_Haywire_C_AnimGraph");
static_assert(offsetof(ABP_BD_GDF_Turret_Haywire_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'ABP_BD_GDF_Turret_Haywire_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function ABP_BD_GDF_Turret_Haywire.ABP_BD_GDF_Turret_Haywire_C.ExecuteUbergraph_ABP_BD_GDF_Turret_Haywire
// 0x00B8 (0x00B8 - 0x0000)
struct ABP_BD_GDF_Turret_Haywire_C_ExecuteUbergraph_ABP_BD_GDF_Turret_Haywire final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector2D_X;                          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_1;                // 0x0070(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_2;                // 0x0088(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_MakeRotator_Roll_ImplicitCast;            // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_B_ImplicitCast;          // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Roll_ImplicitCast_1;          // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Yaw_ImplicitCast;             // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_BD_GDF_Turret_Haywire_C_ExecuteUbergraph_ABP_BD_GDF_Turret_Haywire) == 0x000008, "Wrong alignment on ABP_BD_GDF_Turret_Haywire_C_ExecuteUbergraph_ABP_BD_GDF_Turret_Haywire");
static_assert(sizeof(ABP_BD_GDF_Turret_Haywire_C_ExecuteUbergraph_ABP_BD_GDF_Turret_Haywire) == 0x0000B8, "Wrong size on ABP_BD_GDF_Turret_Haywire_C_ExecuteUbergraph_ABP_BD_GDF_Turret_Haywire");
static_assert(offsetof(ABP_BD_GDF_Turret_Haywire_C_ExecuteUbergraph_ABP_BD_GDF_Turret_Haywire, EntryPoint) == 0x000000, "Member 'ABP_BD_GDF_Turret_Haywire_C_ExecuteUbergraph_ABP_BD_GDF_Turret_Haywire::EntryPoint' has a wrong offset!");
static_assert(offsetof(ABP_BD_GDF_Turret_Haywire_C_ExecuteUbergraph_ABP_BD_GDF_Turret_Haywire, CallFunc_BreakVector2D_X) == 0x000008, "Member 'ABP_BD_GDF_Turret_Haywire_C_ExecuteUbergraph_ABP_BD_GDF_Turret_Haywire::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(ABP_BD_GDF_Turret_Haywire_C_ExecuteUbergraph_ABP_BD_GDF_Turret_Haywire, CallFunc_BreakVector2D_Y) == 0x000010, "Member 'ABP_BD_GDF_Turret_Haywire_C_ExecuteUbergraph_ABP_BD_GDF_Turret_Haywire::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(ABP_BD_GDF_Turret_Haywire_C_ExecuteUbergraph_ABP_BD_GDF_Turret_Haywire, CallFunc_FClamp_ReturnValue) == 0x000018, "Member 'ABP_BD_GDF_Turret_Haywire_C_ExecuteUbergraph_ABP_BD_GDF_Turret_Haywire::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_BD_GDF_Turret_Haywire_C_ExecuteUbergraph_ABP_BD_GDF_Turret_Haywire, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000020, "Member 'ABP_BD_GDF_Turret_Haywire_C_ExecuteUbergraph_ABP_BD_GDF_Turret_Haywire::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_BD_GDF_Turret_Haywire_C_ExecuteUbergraph_ABP_BD_GDF_Turret_Haywire, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000028, "Member 'ABP_BD_GDF_Turret_Haywire_C_ExecuteUbergraph_ABP_BD_GDF_Turret_Haywire::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_BD_GDF_Turret_Haywire_C_ExecuteUbergraph_ABP_BD_GDF_Turret_Haywire, CallFunc_MakeRotator_ReturnValue) == 0x000030, "Member 'ABP_BD_GDF_Turret_Haywire_C_ExecuteUbergraph_ABP_BD_GDF_Turret_Haywire::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_BD_GDF_Turret_Haywire_C_ExecuteUbergraph_ABP_BD_GDF_Turret_Haywire, CallFunc_BreakRotator_Roll) == 0x000048, "Member 'ABP_BD_GDF_Turret_Haywire_C_ExecuteUbergraph_ABP_BD_GDF_Turret_Haywire::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(ABP_BD_GDF_Turret_Haywire_C_ExecuteUbergraph_ABP_BD_GDF_Turret_Haywire, CallFunc_BreakRotator_Pitch) == 0x00004C, "Member 'ABP_BD_GDF_Turret_Haywire_C_ExecuteUbergraph_ABP_BD_GDF_Turret_Haywire::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(ABP_BD_GDF_Turret_Haywire_C_ExecuteUbergraph_ABP_BD_GDF_Turret_Haywire, CallFunc_BreakRotator_Yaw) == 0x000050, "Member 'ABP_BD_GDF_Turret_Haywire_C_ExecuteUbergraph_ABP_BD_GDF_Turret_Haywire::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(ABP_BD_GDF_Turret_Haywire_C_ExecuteUbergraph_ABP_BD_GDF_Turret_Haywire, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000058, "Member 'ABP_BD_GDF_Turret_Haywire_C_ExecuteUbergraph_ABP_BD_GDF_Turret_Haywire::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_BD_GDF_Turret_Haywire_C_ExecuteUbergraph_ABP_BD_GDF_Turret_Haywire, CallFunc_Multiply_DoubleDouble_ReturnValue_2) == 0x000060, "Member 'ABP_BD_GDF_Turret_Haywire_C_ExecuteUbergraph_ABP_BD_GDF_Turret_Haywire::CallFunc_Multiply_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABP_BD_GDF_Turret_Haywire_C_ExecuteUbergraph_ABP_BD_GDF_Turret_Haywire, CallFunc_Add_DoubleDouble_ReturnValue_1) == 0x000068, "Member 'ABP_BD_GDF_Turret_Haywire_C_ExecuteUbergraph_ABP_BD_GDF_Turret_Haywire::CallFunc_Add_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_BD_GDF_Turret_Haywire_C_ExecuteUbergraph_ABP_BD_GDF_Turret_Haywire, CallFunc_MakeRotator_ReturnValue_1) == 0x000070, "Member 'ABP_BD_GDF_Turret_Haywire_C_ExecuteUbergraph_ABP_BD_GDF_Turret_Haywire::CallFunc_MakeRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_BD_GDF_Turret_Haywire_C_ExecuteUbergraph_ABP_BD_GDF_Turret_Haywire, CallFunc_MakeRotator_ReturnValue_2) == 0x000088, "Member 'ABP_BD_GDF_Turret_Haywire_C_ExecuteUbergraph_ABP_BD_GDF_Turret_Haywire::CallFunc_MakeRotator_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABP_BD_GDF_Turret_Haywire_C_ExecuteUbergraph_ABP_BD_GDF_Turret_Haywire, CallFunc_MakeRotator_Roll_ImplicitCast) == 0x0000A0, "Member 'ABP_BD_GDF_Turret_Haywire_C_ExecuteUbergraph_ABP_BD_GDF_Turret_Haywire::CallFunc_MakeRotator_Roll_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ABP_BD_GDF_Turret_Haywire_C_ExecuteUbergraph_ABP_BD_GDF_Turret_Haywire, CallFunc_Add_DoubleDouble_B_ImplicitCast) == 0x0000A8, "Member 'ABP_BD_GDF_Turret_Haywire_C_ExecuteUbergraph_ABP_BD_GDF_Turret_Haywire::CallFunc_Add_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ABP_BD_GDF_Turret_Haywire_C_ExecuteUbergraph_ABP_BD_GDF_Turret_Haywire, CallFunc_MakeRotator_Roll_ImplicitCast_1) == 0x0000B0, "Member 'ABP_BD_GDF_Turret_Haywire_C_ExecuteUbergraph_ABP_BD_GDF_Turret_Haywire::CallFunc_MakeRotator_Roll_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(ABP_BD_GDF_Turret_Haywire_C_ExecuteUbergraph_ABP_BD_GDF_Turret_Haywire, CallFunc_MakeRotator_Yaw_ImplicitCast) == 0x0000B4, "Member 'ABP_BD_GDF_Turret_Haywire_C_ExecuteUbergraph_ABP_BD_GDF_Turret_Haywire::CallFunc_MakeRotator_Yaw_ImplicitCast' has a wrong offset!");

}

