#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_VH_VETI_ThunderHead

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct ABP_VH_VETI_ThunderHead.ABP_VH_VETI_ThunderHead_C.AnimBlueprintGeneratedConstantData
// 0x01F7 (0x01F8 - 0x0001)
struct ABP_VH_VETI_ThunderHead::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_25;                                // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_26;                                 // 0x0008(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_27;                                 // 0x0010(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputScaleBiasClampConstants          __StructProperty_28;                               // 0x0014(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_29;                                // 0x0040(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_30;                                 // 0x0044(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_31;                                 // 0x0045(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_32;                                 // 0x0046(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47[0x1];                                       // 0x0047(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_33;                                 // 0x0048(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimNodeFunctionRef                   __StructProperty_34;                               // 0x0050(0x0020)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0070(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x00F0(0x0018)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_1;               // 0x0108(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot;                           // 0x0138(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root;                           // 0x0168(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer;                 // 0x0198(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive;                  // 0x01C8(0x0030)()
};
static_assert(alignof(ABP_VH_VETI_ThunderHead::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on ABP_VH_VETI_ThunderHead::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(ABP_VH_VETI_ThunderHead::FAnimBlueprintGeneratedConstantData) == 0x0001F8, "Wrong size on ABP_VH_VETI_ThunderHead::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(ABP_VH_VETI_ThunderHead::FAnimBlueprintGeneratedConstantData, __FloatProperty_25) == 0x000004, "Member 'ABP_VH_VETI_ThunderHead::FAnimBlueprintGeneratedConstantData::__FloatProperty_25' has a wrong offset!");
static_assert(offsetof(ABP_VH_VETI_ThunderHead::FAnimBlueprintGeneratedConstantData, __NameProperty_26) == 0x000008, "Member 'ABP_VH_VETI_ThunderHead::FAnimBlueprintGeneratedConstantData::__NameProperty_26' has a wrong offset!");
static_assert(offsetof(ABP_VH_VETI_ThunderHead::FAnimBlueprintGeneratedConstantData, __BoolProperty_27) == 0x000010, "Member 'ABP_VH_VETI_ThunderHead::FAnimBlueprintGeneratedConstantData::__BoolProperty_27' has a wrong offset!");
static_assert(offsetof(ABP_VH_VETI_ThunderHead::FAnimBlueprintGeneratedConstantData, __StructProperty_28) == 0x000014, "Member 'ABP_VH_VETI_ThunderHead::FAnimBlueprintGeneratedConstantData::__StructProperty_28' has a wrong offset!");
static_assert(offsetof(ABP_VH_VETI_ThunderHead::FAnimBlueprintGeneratedConstantData, __FloatProperty_29) == 0x000040, "Member 'ABP_VH_VETI_ThunderHead::FAnimBlueprintGeneratedConstantData::__FloatProperty_29' has a wrong offset!");
static_assert(offsetof(ABP_VH_VETI_ThunderHead::FAnimBlueprintGeneratedConstantData, __BoolProperty_30) == 0x000044, "Member 'ABP_VH_VETI_ThunderHead::FAnimBlueprintGeneratedConstantData::__BoolProperty_30' has a wrong offset!");
static_assert(offsetof(ABP_VH_VETI_ThunderHead::FAnimBlueprintGeneratedConstantData, __EnumProperty_31) == 0x000045, "Member 'ABP_VH_VETI_ThunderHead::FAnimBlueprintGeneratedConstantData::__EnumProperty_31' has a wrong offset!");
static_assert(offsetof(ABP_VH_VETI_ThunderHead::FAnimBlueprintGeneratedConstantData, __ByteProperty_32) == 0x000046, "Member 'ABP_VH_VETI_ThunderHead::FAnimBlueprintGeneratedConstantData::__ByteProperty_32' has a wrong offset!");
static_assert(offsetof(ABP_VH_VETI_ThunderHead::FAnimBlueprintGeneratedConstantData, __NameProperty_33) == 0x000048, "Member 'ABP_VH_VETI_ThunderHead::FAnimBlueprintGeneratedConstantData::__NameProperty_33' has a wrong offset!");
static_assert(offsetof(ABP_VH_VETI_ThunderHead::FAnimBlueprintGeneratedConstantData, __StructProperty_34) == 0x000050, "Member 'ABP_VH_VETI_ThunderHead::FAnimBlueprintGeneratedConstantData::__StructProperty_34' has a wrong offset!");
static_assert(offsetof(ABP_VH_VETI_ThunderHead::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000070, "Member 'ABP_VH_VETI_ThunderHead::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(ABP_VH_VETI_ThunderHead::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x0000F0, "Member 'ABP_VH_VETI_ThunderHead::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(ABP_VH_VETI_ThunderHead::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_1) == 0x000108, "Member 'ABP_VH_VETI_ThunderHead::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(ABP_VH_VETI_ThunderHead::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Slot) == 0x000138, "Member 'ABP_VH_VETI_ThunderHead::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(ABP_VH_VETI_ThunderHead::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root) == 0x000168, "Member 'ABP_VH_VETI_ThunderHead::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(ABP_VH_VETI_ThunderHead::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer) == 0x000198, "Member 'ABP_VH_VETI_ThunderHead::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(ABP_VH_VETI_ThunderHead::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ApplyAdditive) == 0x0001C8, "Member 'ABP_VH_VETI_ThunderHead::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ApplyAdditive' has a wrong offset!");

// ScriptStruct ABP_VH_VETI_ThunderHead.ABP_VH_VETI_ThunderHead_C.AnimBlueprintGeneratedMutableData
// 0x0007 (0x0008 - 0x0001)
struct ABP_VH_VETI_ThunderHead::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty;                                   // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_VH_VETI_ThunderHead::FAnimBlueprintGeneratedMutableData) == 0x000004, "Wrong alignment on ABP_VH_VETI_ThunderHead::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(ABP_VH_VETI_ThunderHead::FAnimBlueprintGeneratedMutableData) == 0x000008, "Wrong size on ABP_VH_VETI_ThunderHead::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(ABP_VH_VETI_ThunderHead::FAnimBlueprintGeneratedMutableData, __FloatProperty) == 0x000004, "Member 'ABP_VH_VETI_ThunderHead::FAnimBlueprintGeneratedMutableData::__FloatProperty' has a wrong offset!");

}

