#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_BD_DYN_MissileTurret_01

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function ABP_BD_DYN_MissileTurret_01.ABP_BD_DYN_MissileTurret_01_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct ABP_BD_DYN_MissileTurret_01_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_BD_DYN_MissileTurret_01_C_AnimGraph) == 0x000008, "Wrong alignment on ABP_BD_DYN_MissileTurret_01_C_AnimGraph");
static_assert(sizeof(ABP_BD_DYN_MissileTurret_01_C_AnimGraph) == 0x000010, "Wrong size on ABP_BD_DYN_MissileTurret_01_C_AnimGraph");
static_assert(offsetof(ABP_BD_DYN_MissileTurret_01_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'ABP_BD_DYN_MissileTurret_01_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function ABP_BD_DYN_MissileTurret_01.ABP_BD_DYN_MissileTurret_01_C.ExecuteUbergraph_ABP_BD_DYN_MissileTurret_01
// 0x0088 (0x0088 - 0x0000)
struct ABP_BD_DYN_MissileTurret_01_C_ExecuteUbergraph_ABP_BD_DYN_MissileTurret_01 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X;                          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_1;                // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        CallFunc_Add_DoubleDouble_B_ImplicitCast;          // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Roll_ImplicitCast;            // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Yaw_ImplicitCast;             // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_BD_DYN_MissileTurret_01_C_ExecuteUbergraph_ABP_BD_DYN_MissileTurret_01) == 0x000008, "Wrong alignment on ABP_BD_DYN_MissileTurret_01_C_ExecuteUbergraph_ABP_BD_DYN_MissileTurret_01");
static_assert(sizeof(ABP_BD_DYN_MissileTurret_01_C_ExecuteUbergraph_ABP_BD_DYN_MissileTurret_01) == 0x000088, "Wrong size on ABP_BD_DYN_MissileTurret_01_C_ExecuteUbergraph_ABP_BD_DYN_MissileTurret_01");
static_assert(offsetof(ABP_BD_DYN_MissileTurret_01_C_ExecuteUbergraph_ABP_BD_DYN_MissileTurret_01, EntryPoint) == 0x000000, "Member 'ABP_BD_DYN_MissileTurret_01_C_ExecuteUbergraph_ABP_BD_DYN_MissileTurret_01::EntryPoint' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_MissileTurret_01_C_ExecuteUbergraph_ABP_BD_DYN_MissileTurret_01, CallFunc_BreakRotator_Roll) == 0x000004, "Member 'ABP_BD_DYN_MissileTurret_01_C_ExecuteUbergraph_ABP_BD_DYN_MissileTurret_01::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_MissileTurret_01_C_ExecuteUbergraph_ABP_BD_DYN_MissileTurret_01, CallFunc_BreakRotator_Pitch) == 0x000008, "Member 'ABP_BD_DYN_MissileTurret_01_C_ExecuteUbergraph_ABP_BD_DYN_MissileTurret_01::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_MissileTurret_01_C_ExecuteUbergraph_ABP_BD_DYN_MissileTurret_01, CallFunc_BreakRotator_Yaw) == 0x00000C, "Member 'ABP_BD_DYN_MissileTurret_01_C_ExecuteUbergraph_ABP_BD_DYN_MissileTurret_01::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_MissileTurret_01_C_ExecuteUbergraph_ABP_BD_DYN_MissileTurret_01, CallFunc_BreakVector2D_X) == 0x000010, "Member 'ABP_BD_DYN_MissileTurret_01_C_ExecuteUbergraph_ABP_BD_DYN_MissileTurret_01::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_MissileTurret_01_C_ExecuteUbergraph_ABP_BD_DYN_MissileTurret_01, CallFunc_BreakVector2D_Y) == 0x000018, "Member 'ABP_BD_DYN_MissileTurret_01_C_ExecuteUbergraph_ABP_BD_DYN_MissileTurret_01::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_MissileTurret_01_C_ExecuteUbergraph_ABP_BD_DYN_MissileTurret_01, CallFunc_FClamp_ReturnValue) == 0x000020, "Member 'ABP_BD_DYN_MissileTurret_01_C_ExecuteUbergraph_ABP_BD_DYN_MissileTurret_01::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_MissileTurret_01_C_ExecuteUbergraph_ABP_BD_DYN_MissileTurret_01, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000028, "Member 'ABP_BD_DYN_MissileTurret_01_C_ExecuteUbergraph_ABP_BD_DYN_MissileTurret_01::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_MissileTurret_01_C_ExecuteUbergraph_ABP_BD_DYN_MissileTurret_01, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000030, "Member 'ABP_BD_DYN_MissileTurret_01_C_ExecuteUbergraph_ABP_BD_DYN_MissileTurret_01::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_MissileTurret_01_C_ExecuteUbergraph_ABP_BD_DYN_MissileTurret_01, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000038, "Member 'ABP_BD_DYN_MissileTurret_01_C_ExecuteUbergraph_ABP_BD_DYN_MissileTurret_01::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_MissileTurret_01_C_ExecuteUbergraph_ABP_BD_DYN_MissileTurret_01, CallFunc_MakeRotator_ReturnValue) == 0x000040, "Member 'ABP_BD_DYN_MissileTurret_01_C_ExecuteUbergraph_ABP_BD_DYN_MissileTurret_01::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_MissileTurret_01_C_ExecuteUbergraph_ABP_BD_DYN_MissileTurret_01, CallFunc_Add_DoubleDouble_ReturnValue_1) == 0x000058, "Member 'ABP_BD_DYN_MissileTurret_01_C_ExecuteUbergraph_ABP_BD_DYN_MissileTurret_01::CallFunc_Add_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_MissileTurret_01_C_ExecuteUbergraph_ABP_BD_DYN_MissileTurret_01, CallFunc_MakeRotator_ReturnValue_1) == 0x000060, "Member 'ABP_BD_DYN_MissileTurret_01_C_ExecuteUbergraph_ABP_BD_DYN_MissileTurret_01::CallFunc_MakeRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_MissileTurret_01_C_ExecuteUbergraph_ABP_BD_DYN_MissileTurret_01, CallFunc_Add_DoubleDouble_B_ImplicitCast) == 0x000078, "Member 'ABP_BD_DYN_MissileTurret_01_C_ExecuteUbergraph_ABP_BD_DYN_MissileTurret_01::CallFunc_Add_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_MissileTurret_01_C_ExecuteUbergraph_ABP_BD_DYN_MissileTurret_01, CallFunc_MakeRotator_Roll_ImplicitCast) == 0x000080, "Member 'ABP_BD_DYN_MissileTurret_01_C_ExecuteUbergraph_ABP_BD_DYN_MissileTurret_01::CallFunc_MakeRotator_Roll_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_MissileTurret_01_C_ExecuteUbergraph_ABP_BD_DYN_MissileTurret_01, CallFunc_MakeRotator_Yaw_ImplicitCast) == 0x000084, "Member 'ABP_BD_DYN_MissileTurret_01_C_ExecuteUbergraph_ABP_BD_DYN_MissileTurret_01::CallFunc_MakeRotator_Yaw_ImplicitCast' has a wrong offset!");

}

