#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_VH_VETI_ThunderHead

#include "Basic.hpp"

#include "ABP_VH_VETI_ThunderHead_structs.hpp"
#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "Tempest_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_VH_VETI_ThunderHead.ABP_VH_VETI_ThunderHead_C
// 0x01F0 (0x0610 - 0x0420)
class UABP_VH_VETI_ThunderHead_C final : public UTedAnimInstance_Aircraft
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0420(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct ABP_VH_VETI_ThunderHead::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;      // 0x0428(0x0008)(HasGetValueTypeHash)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0430(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0438(0x0008)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x0440(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x0488(0x0048)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x04D0(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x04F0(0x0048)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive;                       // 0x0538(0x00C8)()
	bool                                          HasFireTarget;                                     // 0x0600(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void ExecuteUbergraph_ABP_VH_VETI_ThunderHead(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_VH_VETI_ThunderHead_C">();
	}
	static class UABP_VH_VETI_ThunderHead_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_VH_VETI_ThunderHead_C>();
	}
};
static_assert(alignof(UABP_VH_VETI_ThunderHead_C) == 0x000010, "Wrong alignment on UABP_VH_VETI_ThunderHead_C");
static_assert(sizeof(UABP_VH_VETI_ThunderHead_C) == 0x000610, "Wrong size on UABP_VH_VETI_ThunderHead_C");
static_assert(offsetof(UABP_VH_VETI_ThunderHead_C, UberGraphFrame) == 0x000420, "Member 'UABP_VH_VETI_ThunderHead_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_VH_VETI_ThunderHead_C, __AnimBlueprintMutables) == 0x000428, "Member 'UABP_VH_VETI_ThunderHead_C::__AnimBlueprintMutables' has a wrong offset!");
static_assert(offsetof(UABP_VH_VETI_ThunderHead_C, AnimBlueprintExtension_PropertyAccess) == 0x000430, "Member 'UABP_VH_VETI_ThunderHead_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UABP_VH_VETI_ThunderHead_C, AnimBlueprintExtension_Base) == 0x000438, "Member 'UABP_VH_VETI_ThunderHead_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UABP_VH_VETI_ThunderHead_C, AnimGraphNode_SequencePlayer_1) == 0x000440, "Member 'UABP_VH_VETI_ThunderHead_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UABP_VH_VETI_ThunderHead_C, AnimGraphNode_Slot) == 0x000488, "Member 'UABP_VH_VETI_ThunderHead_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(UABP_VH_VETI_ThunderHead_C, AnimGraphNode_Root) == 0x0004D0, "Member 'UABP_VH_VETI_ThunderHead_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_VH_VETI_ThunderHead_C, AnimGraphNode_SequencePlayer) == 0x0004F0, "Member 'UABP_VH_VETI_ThunderHead_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UABP_VH_VETI_ThunderHead_C, AnimGraphNode_ApplyAdditive) == 0x000538, "Member 'UABP_VH_VETI_ThunderHead_C::AnimGraphNode_ApplyAdditive' has a wrong offset!");
static_assert(offsetof(UABP_VH_VETI_ThunderHead_C, HasFireTarget) == 0x000600, "Member 'UABP_VH_VETI_ThunderHead_C::HasFireTarget' has a wrong offset!");

}

