#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_VH_DYN_VoltaicTank

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct ABP_VH_DYN_VoltaicTank.ABP_VH_DYN_VoltaicTank_C.AnimBlueprintGeneratedConstantData
// 0x05F7 (0x05F8 - 0x0001)
struct ABP_VH_DYN_VoltaicTank::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_126;                                // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_127;                                // 0x000C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_128;                                 // 0x0014(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_129;                                // 0x0018(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_130;                                 // 0x0020(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_131;                                // 0x0024(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_132;                                 // 0x002C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_133;                                // 0x0030(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_134;                                // 0x0038(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_135;                                 // 0x0040(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_136;                              // 0x0048(0x0020)(BlueprintVisible, NoDestructor)
	bool                                          __BoolProperty_137;                                // 0x0068(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_138;                               // 0x006C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_139;                              // 0x0070(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_140;                               // 0x009C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_141;                                // 0x00A0(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_142;                                // 0x00A1(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_143;                                // 0x00A2(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A3[0x1];                                       // 0x00A3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_144;                                // 0x00A4(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x00B0(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0130(0x0018)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root;                           // 0x0148(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot;                           // 0x0178(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_5;             // 0x01A8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_4;             // 0x01D8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_3;             // 0x0208(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_2;             // 0x0238(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_1;             // 0x0268(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult;               // 0x0298(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalRefPose_1;                 // 0x02C8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_3;                  // 0x02F8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_3;               // 0x0328(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_2;                  // 0x0358(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_2;               // 0x0388(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TwoWayBlend;                    // 0x03B8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalRefPose;                   // 0x03E8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_1;                  // 0x0418(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_1;               // 0x0448(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult;                    // 0x0478(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine;                   // 0x04A8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive;                  // 0x04D8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone_1;                   // 0x0508(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone;                     // 0x0538(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ComponentToLocalSpace;          // 0x0568(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalToComponentSpace;          // 0x0598(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer;                 // 0x05C8(0x0030)()
};
static_assert(alignof(ABP_VH_DYN_VoltaicTank::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on ABP_VH_DYN_VoltaicTank::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(ABP_VH_DYN_VoltaicTank::FAnimBlueprintGeneratedConstantData) == 0x0005F8, "Wrong size on ABP_VH_DYN_VoltaicTank::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(ABP_VH_DYN_VoltaicTank::FAnimBlueprintGeneratedConstantData, __NameProperty_126) == 0x000004, "Member 'ABP_VH_DYN_VoltaicTank::FAnimBlueprintGeneratedConstantData::__NameProperty_126' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_VoltaicTank::FAnimBlueprintGeneratedConstantData, __NameProperty_127) == 0x00000C, "Member 'ABP_VH_DYN_VoltaicTank::FAnimBlueprintGeneratedConstantData::__NameProperty_127' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_VoltaicTank::FAnimBlueprintGeneratedConstantData, __IntProperty_128) == 0x000014, "Member 'ABP_VH_DYN_VoltaicTank::FAnimBlueprintGeneratedConstantData::__IntProperty_128' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_VoltaicTank::FAnimBlueprintGeneratedConstantData, __NameProperty_129) == 0x000018, "Member 'ABP_VH_DYN_VoltaicTank::FAnimBlueprintGeneratedConstantData::__NameProperty_129' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_VoltaicTank::FAnimBlueprintGeneratedConstantData, __IntProperty_130) == 0x000020, "Member 'ABP_VH_DYN_VoltaicTank::FAnimBlueprintGeneratedConstantData::__IntProperty_130' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_VoltaicTank::FAnimBlueprintGeneratedConstantData, __NameProperty_131) == 0x000024, "Member 'ABP_VH_DYN_VoltaicTank::FAnimBlueprintGeneratedConstantData::__NameProperty_131' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_VoltaicTank::FAnimBlueprintGeneratedConstantData, __IntProperty_132) == 0x00002C, "Member 'ABP_VH_DYN_VoltaicTank::FAnimBlueprintGeneratedConstantData::__IntProperty_132' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_VoltaicTank::FAnimBlueprintGeneratedConstantData, __NameProperty_133) == 0x000030, "Member 'ABP_VH_DYN_VoltaicTank::FAnimBlueprintGeneratedConstantData::__NameProperty_133' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_VoltaicTank::FAnimBlueprintGeneratedConstantData, __NameProperty_134) == 0x000038, "Member 'ABP_VH_DYN_VoltaicTank::FAnimBlueprintGeneratedConstantData::__NameProperty_134' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_VoltaicTank::FAnimBlueprintGeneratedConstantData, __IntProperty_135) == 0x000040, "Member 'ABP_VH_DYN_VoltaicTank::FAnimBlueprintGeneratedConstantData::__IntProperty_135' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_VoltaicTank::FAnimBlueprintGeneratedConstantData, __StructProperty_136) == 0x000048, "Member 'ABP_VH_DYN_VoltaicTank::FAnimBlueprintGeneratedConstantData::__StructProperty_136' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_VoltaicTank::FAnimBlueprintGeneratedConstantData, __BoolProperty_137) == 0x000068, "Member 'ABP_VH_DYN_VoltaicTank::FAnimBlueprintGeneratedConstantData::__BoolProperty_137' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_VoltaicTank::FAnimBlueprintGeneratedConstantData, __FloatProperty_138) == 0x00006C, "Member 'ABP_VH_DYN_VoltaicTank::FAnimBlueprintGeneratedConstantData::__FloatProperty_138' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_VoltaicTank::FAnimBlueprintGeneratedConstantData, __StructProperty_139) == 0x000070, "Member 'ABP_VH_DYN_VoltaicTank::FAnimBlueprintGeneratedConstantData::__StructProperty_139' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_VoltaicTank::FAnimBlueprintGeneratedConstantData, __FloatProperty_140) == 0x00009C, "Member 'ABP_VH_DYN_VoltaicTank::FAnimBlueprintGeneratedConstantData::__FloatProperty_140' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_VoltaicTank::FAnimBlueprintGeneratedConstantData, __BoolProperty_141) == 0x0000A0, "Member 'ABP_VH_DYN_VoltaicTank::FAnimBlueprintGeneratedConstantData::__BoolProperty_141' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_VoltaicTank::FAnimBlueprintGeneratedConstantData, __EnumProperty_142) == 0x0000A1, "Member 'ABP_VH_DYN_VoltaicTank::FAnimBlueprintGeneratedConstantData::__EnumProperty_142' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_VoltaicTank::FAnimBlueprintGeneratedConstantData, __ByteProperty_143) == 0x0000A2, "Member 'ABP_VH_DYN_VoltaicTank::FAnimBlueprintGeneratedConstantData::__ByteProperty_143' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_VoltaicTank::FAnimBlueprintGeneratedConstantData, __NameProperty_144) == 0x0000A4, "Member 'ABP_VH_DYN_VoltaicTank::FAnimBlueprintGeneratedConstantData::__NameProperty_144' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_VoltaicTank::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x0000B0, "Member 'ABP_VH_DYN_VoltaicTank::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_VoltaicTank::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000130, "Member 'ABP_VH_DYN_VoltaicTank::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_VoltaicTank::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root) == 0x000148, "Member 'ABP_VH_DYN_VoltaicTank::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_VoltaicTank::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Slot) == 0x000178, "Member 'ABP_VH_DYN_VoltaicTank::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_VoltaicTank::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_5) == 0x0001A8, "Member 'ABP_VH_DYN_VoltaicTank::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_5' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_VoltaicTank::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_4) == 0x0001D8, "Member 'ABP_VH_DYN_VoltaicTank::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_4' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_VoltaicTank::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_3) == 0x000208, "Member 'ABP_VH_DYN_VoltaicTank::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_3' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_VoltaicTank::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_2) == 0x000238, "Member 'ABP_VH_DYN_VoltaicTank::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_2' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_VoltaicTank::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_1) == 0x000268, "Member 'ABP_VH_DYN_VoltaicTank::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_VoltaicTank::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult) == 0x000298, "Member 'ABP_VH_DYN_VoltaicTank::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_VoltaicTank::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LocalRefPose_1) == 0x0002C8, "Member 'ABP_VH_DYN_VoltaicTank::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LocalRefPose_1' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_VoltaicTank::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult_3) == 0x0002F8, "Member 'ABP_VH_DYN_VoltaicTank::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult_3' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_VoltaicTank::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_3) == 0x000328, "Member 'ABP_VH_DYN_VoltaicTank::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_3' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_VoltaicTank::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult_2) == 0x000358, "Member 'ABP_VH_DYN_VoltaicTank::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult_2' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_VoltaicTank::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_2) == 0x000388, "Member 'ABP_VH_DYN_VoltaicTank::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_VoltaicTank::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TwoWayBlend) == 0x0003B8, "Member 'ABP_VH_DYN_VoltaicTank::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TwoWayBlend' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_VoltaicTank::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LocalRefPose) == 0x0003E8, "Member 'ABP_VH_DYN_VoltaicTank::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LocalRefPose' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_VoltaicTank::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult_1) == 0x000418, "Member 'ABP_VH_DYN_VoltaicTank::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_VoltaicTank::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_1) == 0x000448, "Member 'ABP_VH_DYN_VoltaicTank::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_VoltaicTank::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult) == 0x000478, "Member 'ABP_VH_DYN_VoltaicTank::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_VoltaicTank::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateMachine) == 0x0004A8, "Member 'ABP_VH_DYN_VoltaicTank::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_VoltaicTank::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ApplyAdditive) == 0x0004D8, "Member 'ABP_VH_DYN_VoltaicTank::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ApplyAdditive' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_VoltaicTank::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ModifyBone_1) == 0x000508, "Member 'ABP_VH_DYN_VoltaicTank::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ModifyBone_1' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_VoltaicTank::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ModifyBone) == 0x000538, "Member 'ABP_VH_DYN_VoltaicTank::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_VoltaicTank::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ComponentToLocalSpace) == 0x000568, "Member 'ABP_VH_DYN_VoltaicTank::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_VoltaicTank::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LocalToComponentSpace) == 0x000598, "Member 'ABP_VH_DYN_VoltaicTank::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_VoltaicTank::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer) == 0x0005C8, "Member 'ABP_VH_DYN_VoltaicTank::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer' has a wrong offset!");

// ScriptStruct ABP_VH_DYN_VoltaicTank.ABP_VH_DYN_VoltaicTank_C.AnimBlueprintGeneratedMutableData
// 0x0007 (0x0008 - 0x0001)
struct ABP_VH_DYN_VoltaicTank::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty;                                   // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_VH_DYN_VoltaicTank::FAnimBlueprintGeneratedMutableData) == 0x000004, "Wrong alignment on ABP_VH_DYN_VoltaicTank::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(ABP_VH_DYN_VoltaicTank::FAnimBlueprintGeneratedMutableData) == 0x000008, "Wrong size on ABP_VH_DYN_VoltaicTank::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(ABP_VH_DYN_VoltaicTank::FAnimBlueprintGeneratedMutableData, __FloatProperty) == 0x000004, "Member 'ABP_VH_DYN_VoltaicTank::FAnimBlueprintGeneratedMutableData::__FloatProperty' has a wrong offset!");

}

