#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_GDF_Aircraft

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function ABP_GDF_Aircraft.ABP_GDF_Aircraft_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct ABP_GDF_Aircraft_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_GDF_Aircraft_C_AnimGraph) == 0x000008, "Wrong alignment on ABP_GDF_Aircraft_C_AnimGraph");
static_assert(sizeof(ABP_GDF_Aircraft_C_AnimGraph) == 0x000010, "Wrong size on ABP_GDF_Aircraft_C_AnimGraph");
static_assert(offsetof(ABP_GDF_Aircraft_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'ABP_GDF_Aircraft_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function ABP_GDF_Aircraft.ABP_GDF_Aircraft_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct ABP_GDF_Aircraft_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_GDF_Aircraft_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on ABP_GDF_Aircraft_C_BlueprintUpdateAnimation");
static_assert(sizeof(ABP_GDF_Aircraft_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on ABP_GDF_Aircraft_C_BlueprintUpdateAnimation");
static_assert(offsetof(ABP_GDF_Aircraft_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'ABP_GDF_Aircraft_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function ABP_GDF_Aircraft.ABP_GDF_Aircraft_C.ExecuteUbergraph_ABP_GDF_Aircraft
// 0x0220 (0x0220 - 0x0000)
struct ABP_GDF_Aircraft_C_ExecuteUbergraph_ABP_GDF_Aircraft final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue;              // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0078(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class ATedUnitBase*                           K2Node_DynamicCast_AsTed_Unit_Base;                // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x00A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTedAircraftMovementComponent*          K2Node_DynamicCast_AsTed_Aircraft_Movement_Component; // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnyMontagePlaying_ReturnValue;          // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C2[0xE];                                       // 0x00C2(0x000E)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetBodyTransform_OutTransform;            // 0x00D0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location_1;                // 0x0130(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation_1;                // 0x0148(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale_1;                   // 0x0160(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_VectorVector_ReturnValue;      // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_179[0x7];                                      // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_SelectVector_ReturnValue;                 // 0x0180(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_198[0x8];                                      // 0x0198(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x01A0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast;          // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast_1;        // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Yaw_ImplicitCast;             // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Roll_ImplicitCast;            // 0x0214(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_GDF_Aircraft_C_ExecuteUbergraph_ABP_GDF_Aircraft) == 0x000010, "Wrong alignment on ABP_GDF_Aircraft_C_ExecuteUbergraph_ABP_GDF_Aircraft");
static_assert(sizeof(ABP_GDF_Aircraft_C_ExecuteUbergraph_ABP_GDF_Aircraft) == 0x000220, "Wrong size on ABP_GDF_Aircraft_C_ExecuteUbergraph_ABP_GDF_Aircraft");
static_assert(offsetof(ABP_GDF_Aircraft_C_ExecuteUbergraph_ABP_GDF_Aircraft, EntryPoint) == 0x000000, "Member 'ABP_GDF_Aircraft_C_ExecuteUbergraph_ABP_GDF_Aircraft::EntryPoint' has a wrong offset!");
static_assert(offsetof(ABP_GDF_Aircraft_C_ExecuteUbergraph_ABP_GDF_Aircraft, CallFunc_BreakTransform_Location) == 0x000008, "Member 'ABP_GDF_Aircraft_C_ExecuteUbergraph_ABP_GDF_Aircraft::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(ABP_GDF_Aircraft_C_ExecuteUbergraph_ABP_GDF_Aircraft, CallFunc_BreakTransform_Rotation) == 0x000020, "Member 'ABP_GDF_Aircraft_C_ExecuteUbergraph_ABP_GDF_Aircraft::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(ABP_GDF_Aircraft_C_ExecuteUbergraph_ABP_GDF_Aircraft, CallFunc_BreakTransform_Scale) == 0x000038, "Member 'ABP_GDF_Aircraft_C_ExecuteUbergraph_ABP_GDF_Aircraft::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(ABP_GDF_Aircraft_C_ExecuteUbergraph_ABP_GDF_Aircraft, K2Node_Event_DeltaTimeX) == 0x000050, "Member 'ABP_GDF_Aircraft_C_ExecuteUbergraph_ABP_GDF_Aircraft::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(ABP_GDF_Aircraft_C_ExecuteUbergraph_ABP_GDF_Aircraft, CallFunc_BreakRotator_Roll) == 0x000054, "Member 'ABP_GDF_Aircraft_C_ExecuteUbergraph_ABP_GDF_Aircraft::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(ABP_GDF_Aircraft_C_ExecuteUbergraph_ABP_GDF_Aircraft, CallFunc_BreakRotator_Pitch) == 0x000058, "Member 'ABP_GDF_Aircraft_C_ExecuteUbergraph_ABP_GDF_Aircraft::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(ABP_GDF_Aircraft_C_ExecuteUbergraph_ABP_GDF_Aircraft, CallFunc_BreakRotator_Yaw) == 0x00005C, "Member 'ABP_GDF_Aircraft_C_ExecuteUbergraph_ABP_GDF_Aircraft::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(ABP_GDF_Aircraft_C_ExecuteUbergraph_ABP_GDF_Aircraft, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000060, "Member 'ABP_GDF_Aircraft_C_ExecuteUbergraph_ABP_GDF_Aircraft::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_GDF_Aircraft_C_ExecuteUbergraph_ABP_GDF_Aircraft, CallFunc_Add_DoubleDouble_ReturnValue_1) == 0x000068, "Member 'ABP_GDF_Aircraft_C_ExecuteUbergraph_ABP_GDF_Aircraft::CallFunc_Add_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_GDF_Aircraft_C_ExecuteUbergraph_ABP_GDF_Aircraft, CallFunc_TryGetPawnOwner_ReturnValue) == 0x000070, "Member 'ABP_GDF_Aircraft_C_ExecuteUbergraph_ABP_GDF_Aircraft::CallFunc_TryGetPawnOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_GDF_Aircraft_C_ExecuteUbergraph_ABP_GDF_Aircraft, CallFunc_MakeRotator_ReturnValue) == 0x000078, "Member 'ABP_GDF_Aircraft_C_ExecuteUbergraph_ABP_GDF_Aircraft::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_GDF_Aircraft_C_ExecuteUbergraph_ABP_GDF_Aircraft, K2Node_DynamicCast_AsTed_Unit_Base) == 0x000090, "Member 'ABP_GDF_Aircraft_C_ExecuteUbergraph_ABP_GDF_Aircraft::K2Node_DynamicCast_AsTed_Unit_Base' has a wrong offset!");
static_assert(offsetof(ABP_GDF_Aircraft_C_ExecuteUbergraph_ABP_GDF_Aircraft, K2Node_DynamicCast_bSuccess) == 0x000098, "Member 'ABP_GDF_Aircraft_C_ExecuteUbergraph_ABP_GDF_Aircraft::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ABP_GDF_Aircraft_C_ExecuteUbergraph_ABP_GDF_Aircraft, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x0000A0, "Member 'ABP_GDF_Aircraft_C_ExecuteUbergraph_ABP_GDF_Aircraft::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_GDF_Aircraft_C_ExecuteUbergraph_ABP_GDF_Aircraft, K2Node_DynamicCast_AsTed_Aircraft_Movement_Component) == 0x0000B8, "Member 'ABP_GDF_Aircraft_C_ExecuteUbergraph_ABP_GDF_Aircraft::K2Node_DynamicCast_AsTed_Aircraft_Movement_Component' has a wrong offset!");
static_assert(offsetof(ABP_GDF_Aircraft_C_ExecuteUbergraph_ABP_GDF_Aircraft, K2Node_DynamicCast_bSuccess_1) == 0x0000C0, "Member 'ABP_GDF_Aircraft_C_ExecuteUbergraph_ABP_GDF_Aircraft::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(ABP_GDF_Aircraft_C_ExecuteUbergraph_ABP_GDF_Aircraft, CallFunc_IsAnyMontagePlaying_ReturnValue) == 0x0000C1, "Member 'ABP_GDF_Aircraft_C_ExecuteUbergraph_ABP_GDF_Aircraft::CallFunc_IsAnyMontagePlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_GDF_Aircraft_C_ExecuteUbergraph_ABP_GDF_Aircraft, CallFunc_GetBodyTransform_OutTransform) == 0x0000D0, "Member 'ABP_GDF_Aircraft_C_ExecuteUbergraph_ABP_GDF_Aircraft::CallFunc_GetBodyTransform_OutTransform' has a wrong offset!");
static_assert(offsetof(ABP_GDF_Aircraft_C_ExecuteUbergraph_ABP_GDF_Aircraft, CallFunc_BreakTransform_Location_1) == 0x000130, "Member 'ABP_GDF_Aircraft_C_ExecuteUbergraph_ABP_GDF_Aircraft::CallFunc_BreakTransform_Location_1' has a wrong offset!");
static_assert(offsetof(ABP_GDF_Aircraft_C_ExecuteUbergraph_ABP_GDF_Aircraft, CallFunc_BreakTransform_Rotation_1) == 0x000148, "Member 'ABP_GDF_Aircraft_C_ExecuteUbergraph_ABP_GDF_Aircraft::CallFunc_BreakTransform_Rotation_1' has a wrong offset!");
static_assert(offsetof(ABP_GDF_Aircraft_C_ExecuteUbergraph_ABP_GDF_Aircraft, CallFunc_BreakTransform_Scale_1) == 0x000160, "Member 'ABP_GDF_Aircraft_C_ExecuteUbergraph_ABP_GDF_Aircraft::CallFunc_BreakTransform_Scale_1' has a wrong offset!");
static_assert(offsetof(ABP_GDF_Aircraft_C_ExecuteUbergraph_ABP_GDF_Aircraft, CallFunc_EqualEqual_VectorVector_ReturnValue) == 0x000178, "Member 'ABP_GDF_Aircraft_C_ExecuteUbergraph_ABP_GDF_Aircraft::CallFunc_EqualEqual_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_GDF_Aircraft_C_ExecuteUbergraph_ABP_GDF_Aircraft, CallFunc_SelectVector_ReturnValue) == 0x000180, "Member 'ABP_GDF_Aircraft_C_ExecuteUbergraph_ABP_GDF_Aircraft::CallFunc_SelectVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_GDF_Aircraft_C_ExecuteUbergraph_ABP_GDF_Aircraft, CallFunc_MakeTransform_ReturnValue) == 0x0001A0, "Member 'ABP_GDF_Aircraft_C_ExecuteUbergraph_ABP_GDF_Aircraft::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_GDF_Aircraft_C_ExecuteUbergraph_ABP_GDF_Aircraft, CallFunc_Add_DoubleDouble_A_ImplicitCast) == 0x000200, "Member 'ABP_GDF_Aircraft_C_ExecuteUbergraph_ABP_GDF_Aircraft::CallFunc_Add_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ABP_GDF_Aircraft_C_ExecuteUbergraph_ABP_GDF_Aircraft, CallFunc_Add_DoubleDouble_A_ImplicitCast_1) == 0x000208, "Member 'ABP_GDF_Aircraft_C_ExecuteUbergraph_ABP_GDF_Aircraft::CallFunc_Add_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(ABP_GDF_Aircraft_C_ExecuteUbergraph_ABP_GDF_Aircraft, CallFunc_MakeRotator_Yaw_ImplicitCast) == 0x000210, "Member 'ABP_GDF_Aircraft_C_ExecuteUbergraph_ABP_GDF_Aircraft::CallFunc_MakeRotator_Yaw_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ABP_GDF_Aircraft_C_ExecuteUbergraph_ABP_GDF_Aircraft, CallFunc_MakeRotator_Roll_ImplicitCast) == 0x000214, "Member 'ABP_GDF_Aircraft_C_ExecuteUbergraph_ABP_GDF_Aircraft::CallFunc_MakeRotator_Roll_ImplicitCast' has a wrong offset!");

}

