#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_VH_DYN_Hornet

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function ABP_VH_DYN_Hornet.ABP_VH_DYN_Hornet_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct ABP_VH_DYN_Hornet_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_VH_DYN_Hornet_C_AnimGraph) == 0x000008, "Wrong alignment on ABP_VH_DYN_Hornet_C_AnimGraph");
static_assert(sizeof(ABP_VH_DYN_Hornet_C_AnimGraph) == 0x000010, "Wrong size on ABP_VH_DYN_Hornet_C_AnimGraph");
static_assert(offsetof(ABP_VH_DYN_Hornet_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'ABP_VH_DYN_Hornet_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function ABP_VH_DYN_Hornet.ABP_VH_DYN_Hornet_C.ExecuteUbergraph_ABP_VH_DYN_Hornet
// 0x00C0 (0x00C0 - 0x0000)
struct ABP_VH_DYN_Hornet_C_ExecuteUbergraph_ABP_VH_DYN_Hornet final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0088(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_StructMemberSet_Alpha_ImplicitCast;         // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast;          // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast_1;        // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Yaw_ImplicitCast;             // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Roll_ImplicitCast;            // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_VH_DYN_Hornet_C_ExecuteUbergraph_ABP_VH_DYN_Hornet) == 0x000008, "Wrong alignment on ABP_VH_DYN_Hornet_C_ExecuteUbergraph_ABP_VH_DYN_Hornet");
static_assert(sizeof(ABP_VH_DYN_Hornet_C_ExecuteUbergraph_ABP_VH_DYN_Hornet) == 0x0000C0, "Wrong size on ABP_VH_DYN_Hornet_C_ExecuteUbergraph_ABP_VH_DYN_Hornet");
static_assert(offsetof(ABP_VH_DYN_Hornet_C_ExecuteUbergraph_ABP_VH_DYN_Hornet, EntryPoint) == 0x000000, "Member 'ABP_VH_DYN_Hornet_C_ExecuteUbergraph_ABP_VH_DYN_Hornet::EntryPoint' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_Hornet_C_ExecuteUbergraph_ABP_VH_DYN_Hornet, CallFunc_Not_PreBool_ReturnValue) == 0x000004, "Member 'ABP_VH_DYN_Hornet_C_ExecuteUbergraph_ABP_VH_DYN_Hornet::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_Hornet_C_ExecuteUbergraph_ABP_VH_DYN_Hornet, CallFunc_SelectFloat_ReturnValue) == 0x000008, "Member 'ABP_VH_DYN_Hornet_C_ExecuteUbergraph_ABP_VH_DYN_Hornet::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_Hornet_C_ExecuteUbergraph_ABP_VH_DYN_Hornet, CallFunc_Not_PreBool_ReturnValue_1) == 0x000010, "Member 'ABP_VH_DYN_Hornet_C_ExecuteUbergraph_ABP_VH_DYN_Hornet::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_Hornet_C_ExecuteUbergraph_ABP_VH_DYN_Hornet, CallFunc_BooleanAND_ReturnValue) == 0x000011, "Member 'ABP_VH_DYN_Hornet_C_ExecuteUbergraph_ABP_VH_DYN_Hornet::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_Hornet_C_ExecuteUbergraph_ABP_VH_DYN_Hornet, CallFunc_BreakTransform_Location) == 0x000018, "Member 'ABP_VH_DYN_Hornet_C_ExecuteUbergraph_ABP_VH_DYN_Hornet::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_Hornet_C_ExecuteUbergraph_ABP_VH_DYN_Hornet, CallFunc_BreakTransform_Rotation) == 0x000030, "Member 'ABP_VH_DYN_Hornet_C_ExecuteUbergraph_ABP_VH_DYN_Hornet::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_Hornet_C_ExecuteUbergraph_ABP_VH_DYN_Hornet, CallFunc_BreakTransform_Scale) == 0x000048, "Member 'ABP_VH_DYN_Hornet_C_ExecuteUbergraph_ABP_VH_DYN_Hornet::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_Hornet_C_ExecuteUbergraph_ABP_VH_DYN_Hornet, CallFunc_BreakRotator_Roll) == 0x000060, "Member 'ABP_VH_DYN_Hornet_C_ExecuteUbergraph_ABP_VH_DYN_Hornet::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_Hornet_C_ExecuteUbergraph_ABP_VH_DYN_Hornet, CallFunc_BreakRotator_Pitch) == 0x000064, "Member 'ABP_VH_DYN_Hornet_C_ExecuteUbergraph_ABP_VH_DYN_Hornet::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_Hornet_C_ExecuteUbergraph_ABP_VH_DYN_Hornet, CallFunc_BreakRotator_Yaw) == 0x000068, "Member 'ABP_VH_DYN_Hornet_C_ExecuteUbergraph_ABP_VH_DYN_Hornet::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_Hornet_C_ExecuteUbergraph_ABP_VH_DYN_Hornet, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000070, "Member 'ABP_VH_DYN_Hornet_C_ExecuteUbergraph_ABP_VH_DYN_Hornet::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_Hornet_C_ExecuteUbergraph_ABP_VH_DYN_Hornet, CallFunc_Not_PreBool_ReturnValue_2) == 0x000078, "Member 'ABP_VH_DYN_Hornet_C_ExecuteUbergraph_ABP_VH_DYN_Hornet::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_Hornet_C_ExecuteUbergraph_ABP_VH_DYN_Hornet, CallFunc_Add_DoubleDouble_ReturnValue_1) == 0x000080, "Member 'ABP_VH_DYN_Hornet_C_ExecuteUbergraph_ABP_VH_DYN_Hornet::CallFunc_Add_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_Hornet_C_ExecuteUbergraph_ABP_VH_DYN_Hornet, CallFunc_MakeRotator_ReturnValue) == 0x000088, "Member 'ABP_VH_DYN_Hornet_C_ExecuteUbergraph_ABP_VH_DYN_Hornet::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_Hornet_C_ExecuteUbergraph_ABP_VH_DYN_Hornet, CallFunc_BooleanAND_ReturnValue_1) == 0x0000A0, "Member 'ABP_VH_DYN_Hornet_C_ExecuteUbergraph_ABP_VH_DYN_Hornet::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_Hornet_C_ExecuteUbergraph_ABP_VH_DYN_Hornet, K2Node_StructMemberSet_Alpha_ImplicitCast) == 0x0000A4, "Member 'ABP_VH_DYN_Hornet_C_ExecuteUbergraph_ABP_VH_DYN_Hornet::K2Node_StructMemberSet_Alpha_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_Hornet_C_ExecuteUbergraph_ABP_VH_DYN_Hornet, CallFunc_Add_DoubleDouble_A_ImplicitCast) == 0x0000A8, "Member 'ABP_VH_DYN_Hornet_C_ExecuteUbergraph_ABP_VH_DYN_Hornet::CallFunc_Add_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_Hornet_C_ExecuteUbergraph_ABP_VH_DYN_Hornet, CallFunc_Add_DoubleDouble_A_ImplicitCast_1) == 0x0000B0, "Member 'ABP_VH_DYN_Hornet_C_ExecuteUbergraph_ABP_VH_DYN_Hornet::CallFunc_Add_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_Hornet_C_ExecuteUbergraph_ABP_VH_DYN_Hornet, CallFunc_MakeRotator_Yaw_ImplicitCast) == 0x0000B8, "Member 'ABP_VH_DYN_Hornet_C_ExecuteUbergraph_ABP_VH_DYN_Hornet::CallFunc_MakeRotator_Yaw_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_Hornet_C_ExecuteUbergraph_ABP_VH_DYN_Hornet, CallFunc_MakeRotator_Roll_ImplicitCast) == 0x0000BC, "Member 'ABP_VH_DYN_Hornet_C_ExecuteUbergraph_ABP_VH_DYN_Hornet::CallFunc_MakeRotator_Roll_ImplicitCast' has a wrong offset!");

}

