#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_VH_DYN_Porcupine

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function ABP_VH_DYN_Porcupine.ABP_VH_DYN_Porcupine_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct ABP_VH_DYN_Porcupine_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_VH_DYN_Porcupine_C_AnimGraph) == 0x000008, "Wrong alignment on ABP_VH_DYN_Porcupine_C_AnimGraph");
static_assert(sizeof(ABP_VH_DYN_Porcupine_C_AnimGraph) == 0x000010, "Wrong size on ABP_VH_DYN_Porcupine_C_AnimGraph");
static_assert(offsetof(ABP_VH_DYN_Porcupine_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'ABP_VH_DYN_Porcupine_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function ABP_VH_DYN_Porcupine.ABP_VH_DYN_Porcupine_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct ABP_VH_DYN_Porcupine_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_VH_DYN_Porcupine_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on ABP_VH_DYN_Porcupine_C_BlueprintUpdateAnimation");
static_assert(sizeof(ABP_VH_DYN_Porcupine_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on ABP_VH_DYN_Porcupine_C_BlueprintUpdateAnimation");
static_assert(offsetof(ABP_VH_DYN_Porcupine_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'ABP_VH_DYN_Porcupine_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function ABP_VH_DYN_Porcupine.ABP_VH_DYN_Porcupine_C.ExecuteUbergraph_ABP_VH_DYN_Porcupine
// 0x00A0 (0x00A0 - 0x0000)
struct ABP_VH_DYN_Porcupine_C_ExecuteUbergraph_ABP_VH_DYN_Porcupine final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_VSize2D_ReturnValue;                      // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRelevantAnimTimeRemainingFraction_ReturnValue; // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector2D_X;                          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_1;                // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetRelevantAnimTimeRemainingFraction_ReturnValue_1; // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTimeX;                           // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue_1;          // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_82[0x6];                                       // 0x0082(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast;         // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Pitch_ImplicitCast;           // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Yaw_ImplicitCast;             // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast_1;       // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_VH_DYN_Porcupine_C_ExecuteUbergraph_ABP_VH_DYN_Porcupine) == 0x000008, "Wrong alignment on ABP_VH_DYN_Porcupine_C_ExecuteUbergraph_ABP_VH_DYN_Porcupine");
static_assert(sizeof(ABP_VH_DYN_Porcupine_C_ExecuteUbergraph_ABP_VH_DYN_Porcupine) == 0x0000A0, "Wrong size on ABP_VH_DYN_Porcupine_C_ExecuteUbergraph_ABP_VH_DYN_Porcupine");
static_assert(offsetof(ABP_VH_DYN_Porcupine_C_ExecuteUbergraph_ABP_VH_DYN_Porcupine, EntryPoint) == 0x000000, "Member 'ABP_VH_DYN_Porcupine_C_ExecuteUbergraph_ABP_VH_DYN_Porcupine::EntryPoint' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_Porcupine_C_ExecuteUbergraph_ABP_VH_DYN_Porcupine, CallFunc_VSize2D_ReturnValue) == 0x000008, "Member 'ABP_VH_DYN_Porcupine_C_ExecuteUbergraph_ABP_VH_DYN_Porcupine::CallFunc_VSize2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_Porcupine_C_ExecuteUbergraph_ABP_VH_DYN_Porcupine, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000010, "Member 'ABP_VH_DYN_Porcupine_C_ExecuteUbergraph_ABP_VH_DYN_Porcupine::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_Porcupine_C_ExecuteUbergraph_ABP_VH_DYN_Porcupine, CallFunc_GetRelevantAnimTimeRemainingFraction_ReturnValue) == 0x000014, "Member 'ABP_VH_DYN_Porcupine_C_ExecuteUbergraph_ABP_VH_DYN_Porcupine::CallFunc_GetRelevantAnimTimeRemainingFraction_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_Porcupine_C_ExecuteUbergraph_ABP_VH_DYN_Porcupine, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000018, "Member 'ABP_VH_DYN_Porcupine_C_ExecuteUbergraph_ABP_VH_DYN_Porcupine::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_Porcupine_C_ExecuteUbergraph_ABP_VH_DYN_Porcupine, CallFunc_BreakVector2D_X) == 0x000020, "Member 'ABP_VH_DYN_Porcupine_C_ExecuteUbergraph_ABP_VH_DYN_Porcupine::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_Porcupine_C_ExecuteUbergraph_ABP_VH_DYN_Porcupine, CallFunc_BreakVector2D_Y) == 0x000028, "Member 'ABP_VH_DYN_Porcupine_C_ExecuteUbergraph_ABP_VH_DYN_Porcupine::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_Porcupine_C_ExecuteUbergraph_ABP_VH_DYN_Porcupine, CallFunc_FClamp_ReturnValue) == 0x000030, "Member 'ABP_VH_DYN_Porcupine_C_ExecuteUbergraph_ABP_VH_DYN_Porcupine::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_Porcupine_C_ExecuteUbergraph_ABP_VH_DYN_Porcupine, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000038, "Member 'ABP_VH_DYN_Porcupine_C_ExecuteUbergraph_ABP_VH_DYN_Porcupine::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_Porcupine_C_ExecuteUbergraph_ABP_VH_DYN_Porcupine, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000040, "Member 'ABP_VH_DYN_Porcupine_C_ExecuteUbergraph_ABP_VH_DYN_Porcupine::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_Porcupine_C_ExecuteUbergraph_ABP_VH_DYN_Porcupine, CallFunc_MakeRotator_ReturnValue) == 0x000048, "Member 'ABP_VH_DYN_Porcupine_C_ExecuteUbergraph_ABP_VH_DYN_Porcupine::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_Porcupine_C_ExecuteUbergraph_ABP_VH_DYN_Porcupine, CallFunc_MakeRotator_ReturnValue_1) == 0x000060, "Member 'ABP_VH_DYN_Porcupine_C_ExecuteUbergraph_ABP_VH_DYN_Porcupine::CallFunc_MakeRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_Porcupine_C_ExecuteUbergraph_ABP_VH_DYN_Porcupine, CallFunc_GetRelevantAnimTimeRemainingFraction_ReturnValue_1) == 0x000078, "Member 'ABP_VH_DYN_Porcupine_C_ExecuteUbergraph_ABP_VH_DYN_Porcupine::CallFunc_GetRelevantAnimTimeRemainingFraction_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_Porcupine_C_ExecuteUbergraph_ABP_VH_DYN_Porcupine, K2Node_Event_DeltaTimeX) == 0x00007C, "Member 'ABP_VH_DYN_Porcupine_C_ExecuteUbergraph_ABP_VH_DYN_Porcupine::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_Porcupine_C_ExecuteUbergraph_ABP_VH_DYN_Porcupine, CallFunc_Less_DoubleDouble_ReturnValue_1) == 0x000080, "Member 'ABP_VH_DYN_Porcupine_C_ExecuteUbergraph_ABP_VH_DYN_Porcupine::CallFunc_Less_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_Porcupine_C_ExecuteUbergraph_ABP_VH_DYN_Porcupine, CallFunc_IsValid_ReturnValue) == 0x000081, "Member 'ABP_VH_DYN_Porcupine_C_ExecuteUbergraph_ABP_VH_DYN_Porcupine::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_Porcupine_C_ExecuteUbergraph_ABP_VH_DYN_Porcupine, CallFunc_Less_DoubleDouble_A_ImplicitCast) == 0x000088, "Member 'ABP_VH_DYN_Porcupine_C_ExecuteUbergraph_ABP_VH_DYN_Porcupine::CallFunc_Less_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_Porcupine_C_ExecuteUbergraph_ABP_VH_DYN_Porcupine, CallFunc_MakeRotator_Pitch_ImplicitCast) == 0x000090, "Member 'ABP_VH_DYN_Porcupine_C_ExecuteUbergraph_ABP_VH_DYN_Porcupine::CallFunc_MakeRotator_Pitch_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_Porcupine_C_ExecuteUbergraph_ABP_VH_DYN_Porcupine, CallFunc_MakeRotator_Yaw_ImplicitCast) == 0x000094, "Member 'ABP_VH_DYN_Porcupine_C_ExecuteUbergraph_ABP_VH_DYN_Porcupine::CallFunc_MakeRotator_Yaw_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ABP_VH_DYN_Porcupine_C_ExecuteUbergraph_ABP_VH_DYN_Porcupine, CallFunc_Less_DoubleDouble_A_ImplicitCast_1) == 0x000098, "Member 'ABP_VH_DYN_Porcupine_C_ExecuteUbergraph_ABP_VH_DYN_Porcupine::CallFunc_Less_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");

}

