#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_BD_VETI_WarAssembly

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "ABP_BD_VETI_WarAssembly_structs.hpp"
#include "Tempest_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_BD_VETI_WarAssembly.ABP_BD_VETI_WarAssembly_C
// 0x0250 (0x0680 - 0x0430)
class UABP_BD_VETI_WarAssembly_C final : public UTedAnimInstance_Structure
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0430(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct ABP_BD_VETI_WarAssembly::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;      // 0x0438(0x000C)(HasGetValueTypeHash)
	uint8                                         Pad_444[0x4];                                      // 0x0444(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0448(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0450(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0458(0x0020)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x0478(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x04C0(0x0048)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose;                        // 0x0508(0x0010)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x0518(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0560(0x0048)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive;                       // 0x05A8(0x00C8)()
	bool                                          Started_Working;                                   // 0x0670(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Powered;                                           // 0x0671(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_672[0x6];                                      // 0x0672(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Playrate_Idle;                                     // 0x0678(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_BD_VETI_WarAssembly_AnimGraphNode_BlendListByBool_E26338B44C11570AFED843AE5AEBAABA();
	void ExecuteUbergraph_ABP_BD_VETI_WarAssembly(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_BD_VETI_WarAssembly_C">();
	}
	static class UABP_BD_VETI_WarAssembly_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_BD_VETI_WarAssembly_C>();
	}
};
static_assert(alignof(UABP_BD_VETI_WarAssembly_C) == 0x000010, "Wrong alignment on UABP_BD_VETI_WarAssembly_C");
static_assert(sizeof(UABP_BD_VETI_WarAssembly_C) == 0x000680, "Wrong size on UABP_BD_VETI_WarAssembly_C");
static_assert(offsetof(UABP_BD_VETI_WarAssembly_C, UberGraphFrame) == 0x000430, "Member 'UABP_BD_VETI_WarAssembly_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_BD_VETI_WarAssembly_C, __AnimBlueprintMutables) == 0x000438, "Member 'UABP_BD_VETI_WarAssembly_C::__AnimBlueprintMutables' has a wrong offset!");
static_assert(offsetof(UABP_BD_VETI_WarAssembly_C, AnimBlueprintExtension_PropertyAccess) == 0x000448, "Member 'UABP_BD_VETI_WarAssembly_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UABP_BD_VETI_WarAssembly_C, AnimBlueprintExtension_Base) == 0x000450, "Member 'UABP_BD_VETI_WarAssembly_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UABP_BD_VETI_WarAssembly_C, AnimGraphNode_Root) == 0x000458, "Member 'UABP_BD_VETI_WarAssembly_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_BD_VETI_WarAssembly_C, AnimGraphNode_Slot) == 0x000478, "Member 'UABP_BD_VETI_WarAssembly_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(UABP_BD_VETI_WarAssembly_C, AnimGraphNode_SequencePlayer_1) == 0x0004C0, "Member 'UABP_BD_VETI_WarAssembly_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UABP_BD_VETI_WarAssembly_C, AnimGraphNode_LocalRefPose) == 0x000508, "Member 'UABP_BD_VETI_WarAssembly_C::AnimGraphNode_LocalRefPose' has a wrong offset!");
static_assert(offsetof(UABP_BD_VETI_WarAssembly_C, AnimGraphNode_BlendListByBool) == 0x000518, "Member 'UABP_BD_VETI_WarAssembly_C::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(UABP_BD_VETI_WarAssembly_C, AnimGraphNode_SequencePlayer) == 0x000560, "Member 'UABP_BD_VETI_WarAssembly_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UABP_BD_VETI_WarAssembly_C, AnimGraphNode_ApplyAdditive) == 0x0005A8, "Member 'UABP_BD_VETI_WarAssembly_C::AnimGraphNode_ApplyAdditive' has a wrong offset!");
static_assert(offsetof(UABP_BD_VETI_WarAssembly_C, Started_Working) == 0x000670, "Member 'UABP_BD_VETI_WarAssembly_C::Started_Working' has a wrong offset!");
static_assert(offsetof(UABP_BD_VETI_WarAssembly_C, Powered) == 0x000671, "Member 'UABP_BD_VETI_WarAssembly_C::Powered' has a wrong offset!");
static_assert(offsetof(UABP_BD_VETI_WarAssembly_C, Playrate_Idle) == 0x000678, "Member 'UABP_BD_VETI_WarAssembly_C::Playrate_Idle' has a wrong offset!");

}

