#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_VH_VETI_Messenger

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct ABP_VH_VETI_Messenger.ABP_VH_VETI_Messenger_C.AnimBlueprintGeneratedConstantData
// 0x025F (0x0260 - 0x0001)
struct ABP_VH_VETI_Messenger::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_34;                                 // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_35;                                 // 0x000C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_36;                                // 0x0010(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_37;                                // 0x0014(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_38;                                 // 0x0018(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_39;                                 // 0x0019(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_40;                                 // 0x001A(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B[0x1];                                       // 0x001B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_41;                                 // 0x001C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_42;                               // 0x0028(0x0020)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0048(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x00C8(0x0018)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root;                           // 0x00E0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer;               // 0x0110(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot;                           // 0x0140(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_RotationOffsetBlendSpace;       // 0x0170(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone_1;                   // 0x01A0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalToComponentSpace;          // 0x01D0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ComponentToLocalSpace;          // 0x0200(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone;                     // 0x0230(0x0030)()
};
static_assert(alignof(ABP_VH_VETI_Messenger::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on ABP_VH_VETI_Messenger::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(ABP_VH_VETI_Messenger::FAnimBlueprintGeneratedConstantData) == 0x000260, "Wrong size on ABP_VH_VETI_Messenger::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(ABP_VH_VETI_Messenger::FAnimBlueprintGeneratedConstantData, __NameProperty_34) == 0x000004, "Member 'ABP_VH_VETI_Messenger::FAnimBlueprintGeneratedConstantData::__NameProperty_34' has a wrong offset!");
static_assert(offsetof(ABP_VH_VETI_Messenger::FAnimBlueprintGeneratedConstantData, __BoolProperty_35) == 0x00000C, "Member 'ABP_VH_VETI_Messenger::FAnimBlueprintGeneratedConstantData::__BoolProperty_35' has a wrong offset!");
static_assert(offsetof(ABP_VH_VETI_Messenger::FAnimBlueprintGeneratedConstantData, __FloatProperty_36) == 0x000010, "Member 'ABP_VH_VETI_Messenger::FAnimBlueprintGeneratedConstantData::__FloatProperty_36' has a wrong offset!");
static_assert(offsetof(ABP_VH_VETI_Messenger::FAnimBlueprintGeneratedConstantData, __FloatProperty_37) == 0x000014, "Member 'ABP_VH_VETI_Messenger::FAnimBlueprintGeneratedConstantData::__FloatProperty_37' has a wrong offset!");
static_assert(offsetof(ABP_VH_VETI_Messenger::FAnimBlueprintGeneratedConstantData, __BoolProperty_38) == 0x000018, "Member 'ABP_VH_VETI_Messenger::FAnimBlueprintGeneratedConstantData::__BoolProperty_38' has a wrong offset!");
static_assert(offsetof(ABP_VH_VETI_Messenger::FAnimBlueprintGeneratedConstantData, __EnumProperty_39) == 0x000019, "Member 'ABP_VH_VETI_Messenger::FAnimBlueprintGeneratedConstantData::__EnumProperty_39' has a wrong offset!");
static_assert(offsetof(ABP_VH_VETI_Messenger::FAnimBlueprintGeneratedConstantData, __ByteProperty_40) == 0x00001A, "Member 'ABP_VH_VETI_Messenger::FAnimBlueprintGeneratedConstantData::__ByteProperty_40' has a wrong offset!");
static_assert(offsetof(ABP_VH_VETI_Messenger::FAnimBlueprintGeneratedConstantData, __NameProperty_41) == 0x00001C, "Member 'ABP_VH_VETI_Messenger::FAnimBlueprintGeneratedConstantData::__NameProperty_41' has a wrong offset!");
static_assert(offsetof(ABP_VH_VETI_Messenger::FAnimBlueprintGeneratedConstantData, __StructProperty_42) == 0x000028, "Member 'ABP_VH_VETI_Messenger::FAnimBlueprintGeneratedConstantData::__StructProperty_42' has a wrong offset!");
static_assert(offsetof(ABP_VH_VETI_Messenger::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000048, "Member 'ABP_VH_VETI_Messenger::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(ABP_VH_VETI_Messenger::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x0000C8, "Member 'ABP_VH_VETI_Messenger::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(ABP_VH_VETI_Messenger::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root) == 0x0000E0, "Member 'ABP_VH_VETI_Messenger::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(ABP_VH_VETI_Messenger::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendSpacePlayer) == 0x000110, "Member 'ABP_VH_VETI_Messenger::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendSpacePlayer' has a wrong offset!");
static_assert(offsetof(ABP_VH_VETI_Messenger::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Slot) == 0x000140, "Member 'ABP_VH_VETI_Messenger::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(ABP_VH_VETI_Messenger::FAnimBlueprintGeneratedConstantData, AnimGraphNode_RotationOffsetBlendSpace) == 0x000170, "Member 'ABP_VH_VETI_Messenger::FAnimBlueprintGeneratedConstantData::AnimGraphNode_RotationOffsetBlendSpace' has a wrong offset!");
static_assert(offsetof(ABP_VH_VETI_Messenger::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ModifyBone_1) == 0x0001A0, "Member 'ABP_VH_VETI_Messenger::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ModifyBone_1' has a wrong offset!");
static_assert(offsetof(ABP_VH_VETI_Messenger::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LocalToComponentSpace) == 0x0001D0, "Member 'ABP_VH_VETI_Messenger::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(ABP_VH_VETI_Messenger::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ComponentToLocalSpace) == 0x000200, "Member 'ABP_VH_VETI_Messenger::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(ABP_VH_VETI_Messenger::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ModifyBone) == 0x000230, "Member 'ABP_VH_VETI_Messenger::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ModifyBone' has a wrong offset!");

// ScriptStruct ABP_VH_VETI_Messenger.ABP_VH_VETI_Messenger_C.AnimBlueprintGeneratedMutableData
// 0x000B (0x000C - 0x0001)
struct ABP_VH_VETI_Messenger::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty;                                   // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_0;                                 // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_VH_VETI_Messenger::FAnimBlueprintGeneratedMutableData) == 0x000004, "Wrong alignment on ABP_VH_VETI_Messenger::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(ABP_VH_VETI_Messenger::FAnimBlueprintGeneratedMutableData) == 0x00000C, "Wrong size on ABP_VH_VETI_Messenger::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(ABP_VH_VETI_Messenger::FAnimBlueprintGeneratedMutableData, __FloatProperty) == 0x000004, "Member 'ABP_VH_VETI_Messenger::FAnimBlueprintGeneratedMutableData::__FloatProperty' has a wrong offset!");
static_assert(offsetof(ABP_VH_VETI_Messenger::FAnimBlueprintGeneratedMutableData, __FloatProperty_0) == 0x000008, "Member 'ABP_VH_VETI_Messenger::FAnimBlueprintGeneratedMutableData::__FloatProperty_0' has a wrong offset!");

}

