#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_BD_DYN_ConstructionYard

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ABP_BD_DYN_ConstructionYard_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "Tempest_structs.hpp"
#include "Tempest_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_BD_DYN_ConstructionYard.ABP_BD_DYN_ConstructionYard_C
// 0x0690 (0x0AC0 - 0x0430)
class UABP_BD_DYN_ConstructionYard_C final : public UTedAnimInstance_Structure
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0430(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct ABP_BD_DYN_ConstructionYard::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;  // 0x0438(0x0003)(HasGetValueTypeHash)
	uint8                                         Pad_43B[0x5];                                      // 0x043B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0440(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0448(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0450(0x0020)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend;                    // 0x0470(0x00F0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_1;                   // 0x0560(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_1;                    // 0x05A8(0x0080)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_1;                              // 0x0628(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x0670(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_4;                     // 0x06B8(0x0028)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_1;                     // 0x06E0(0x00C8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x07A8(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_3;                     // 0x07F0(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x0818(0x0048)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive;                       // 0x0860(0x00C8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0928(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2;                     // 0x0970(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x0998(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x09C0(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x0A08(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x0A88(0x0028)()
	bool                                          Powered;                                           // 0x0AB0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Working;                                           // 0x0AB1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void ExecuteUbergraph_ABP_BD_DYN_ConstructionYard(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_BD_DYN_ConstructionYard_C">();
	}
	static class UABP_BD_DYN_ConstructionYard_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_BD_DYN_ConstructionYard_C>();
	}
};
static_assert(alignof(UABP_BD_DYN_ConstructionYard_C) == 0x000010, "Wrong alignment on UABP_BD_DYN_ConstructionYard_C");
static_assert(sizeof(UABP_BD_DYN_ConstructionYard_C) == 0x000AC0, "Wrong size on UABP_BD_DYN_ConstructionYard_C");
static_assert(offsetof(UABP_BD_DYN_ConstructionYard_C, UberGraphFrame) == 0x000430, "Member 'UABP_BD_DYN_ConstructionYard_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_BD_DYN_ConstructionYard_C, __AnimBlueprintMutables) == 0x000438, "Member 'UABP_BD_DYN_ConstructionYard_C::__AnimBlueprintMutables' has a wrong offset!");
static_assert(offsetof(UABP_BD_DYN_ConstructionYard_C, AnimBlueprintExtension_PropertyAccess) == 0x000440, "Member 'UABP_BD_DYN_ConstructionYard_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UABP_BD_DYN_ConstructionYard_C, AnimBlueprintExtension_Base) == 0x000448, "Member 'UABP_BD_DYN_ConstructionYard_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UABP_BD_DYN_ConstructionYard_C, AnimGraphNode_Root) == 0x000450, "Member 'UABP_BD_DYN_ConstructionYard_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_BD_DYN_ConstructionYard_C, AnimGraphNode_LayeredBoneBlend) == 0x000470, "Member 'UABP_BD_DYN_ConstructionYard_C::AnimGraphNode_LayeredBoneBlend' has a wrong offset!");
static_assert(offsetof(UABP_BD_DYN_ConstructionYard_C, AnimGraphNode_BlendListByBool_1) == 0x000560, "Member 'UABP_BD_DYN_ConstructionYard_C::AnimGraphNode_BlendListByBool_1' has a wrong offset!");
static_assert(offsetof(UABP_BD_DYN_ConstructionYard_C, AnimGraphNode_SaveCachedPose_1) == 0x0005A8, "Member 'UABP_BD_DYN_ConstructionYard_C::AnimGraphNode_SaveCachedPose_1' has a wrong offset!");
static_assert(offsetof(UABP_BD_DYN_ConstructionYard_C, AnimGraphNode_Slot_1) == 0x000628, "Member 'UABP_BD_DYN_ConstructionYard_C::AnimGraphNode_Slot_1' has a wrong offset!");
static_assert(offsetof(UABP_BD_DYN_ConstructionYard_C, AnimGraphNode_Slot) == 0x000670, "Member 'UABP_BD_DYN_ConstructionYard_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(UABP_BD_DYN_ConstructionYard_C, AnimGraphNode_UseCachedPose_4) == 0x0006B8, "Member 'UABP_BD_DYN_ConstructionYard_C::AnimGraphNode_UseCachedPose_4' has a wrong offset!");
static_assert(offsetof(UABP_BD_DYN_ConstructionYard_C, AnimGraphNode_ApplyAdditive_1) == 0x0006E0, "Member 'UABP_BD_DYN_ConstructionYard_C::AnimGraphNode_ApplyAdditive_1' has a wrong offset!");
static_assert(offsetof(UABP_BD_DYN_ConstructionYard_C, AnimGraphNode_SequencePlayer_2) == 0x0007A8, "Member 'UABP_BD_DYN_ConstructionYard_C::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(UABP_BD_DYN_ConstructionYard_C, AnimGraphNode_UseCachedPose_3) == 0x0007F0, "Member 'UABP_BD_DYN_ConstructionYard_C::AnimGraphNode_UseCachedPose_3' has a wrong offset!");
static_assert(offsetof(UABP_BD_DYN_ConstructionYard_C, AnimGraphNode_SequencePlayer_1) == 0x000818, "Member 'UABP_BD_DYN_ConstructionYard_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UABP_BD_DYN_ConstructionYard_C, AnimGraphNode_ApplyAdditive) == 0x000860, "Member 'UABP_BD_DYN_ConstructionYard_C::AnimGraphNode_ApplyAdditive' has a wrong offset!");
static_assert(offsetof(UABP_BD_DYN_ConstructionYard_C, AnimGraphNode_SequencePlayer) == 0x000928, "Member 'UABP_BD_DYN_ConstructionYard_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UABP_BD_DYN_ConstructionYard_C, AnimGraphNode_UseCachedPose_2) == 0x000970, "Member 'UABP_BD_DYN_ConstructionYard_C::AnimGraphNode_UseCachedPose_2' has a wrong offset!");
static_assert(offsetof(UABP_BD_DYN_ConstructionYard_C, AnimGraphNode_UseCachedPose_1) == 0x000998, "Member 'UABP_BD_DYN_ConstructionYard_C::AnimGraphNode_UseCachedPose_1' has a wrong offset!");
static_assert(offsetof(UABP_BD_DYN_ConstructionYard_C, AnimGraphNode_BlendListByBool) == 0x0009C0, "Member 'UABP_BD_DYN_ConstructionYard_C::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(UABP_BD_DYN_ConstructionYard_C, AnimGraphNode_SaveCachedPose) == 0x000A08, "Member 'UABP_BD_DYN_ConstructionYard_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(UABP_BD_DYN_ConstructionYard_C, AnimGraphNode_UseCachedPose) == 0x000A88, "Member 'UABP_BD_DYN_ConstructionYard_C::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(UABP_BD_DYN_ConstructionYard_C, Powered) == 0x000AB0, "Member 'UABP_BD_DYN_ConstructionYard_C::Powered' has a wrong offset!");
static_assert(offsetof(UABP_BD_DYN_ConstructionYard_C, Working) == 0x000AB1, "Member 'UABP_BD_DYN_ConstructionYard_C::Working' has a wrong offset!");

}

