#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_VH_VETI_Moment

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct ABP_VH_VETI_Moment.ABP_VH_VETI_Moment_C.AnimBlueprintGeneratedConstantData
// 0x05BF (0x05C0 - 0x0001)
struct ABP_VH_VETI_Moment::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_132;                                // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_133;                                // 0x000C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_134;                                 // 0x0014(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_135;                                // 0x0018(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_136;                                 // 0x0020(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_137;                                // 0x0024(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_138;                                 // 0x002C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_139;                                // 0x0030(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_140;                                // 0x0038(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_141;                                 // 0x0040(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_142;                              // 0x0044(0x002C)(BlueprintVisible, NoDestructor)
	bool                                          __BoolProperty_143;                                // 0x0070(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_144;                               // 0x0074(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_145;                               // 0x0078(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_146;                                // 0x007C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_147;                                // 0x007D(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_148;                                // 0x007E(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7F[0x1];                                       // 0x007F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_149;                                // 0x0080(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimNodeFunctionRef                   __StructProperty_150;                              // 0x0088(0x0020)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x00A8(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0128(0x0018)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root;                           // 0x0140(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive;                  // 0x0170(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_5;             // 0x01A0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_4;             // 0x01D0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_3;             // 0x0200(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_2;             // 0x0230(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_1;             // 0x0260(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult;               // 0x0290(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_3;               // 0x02C0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_3;                  // 0x02F0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_2;               // 0x0320(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_2;                  // 0x0350(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_1;               // 0x0380(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_1;                  // 0x03B0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalRefPose;                   // 0x03E0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult;                    // 0x0410(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine;                   // 0x0440(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer;                 // 0x0470(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_RotationOffsetBlendSpace;       // 0x04A0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot;                           // 0x04D0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalToComponentSpace;          // 0x0500(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ComponentToLocalSpace;          // 0x0530(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone_1;                   // 0x0560(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone;                     // 0x0590(0x0030)()
};
static_assert(alignof(ABP_VH_VETI_Moment::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on ABP_VH_VETI_Moment::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(ABP_VH_VETI_Moment::FAnimBlueprintGeneratedConstantData) == 0x0005C0, "Wrong size on ABP_VH_VETI_Moment::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(ABP_VH_VETI_Moment::FAnimBlueprintGeneratedConstantData, __NameProperty_132) == 0x000004, "Member 'ABP_VH_VETI_Moment::FAnimBlueprintGeneratedConstantData::__NameProperty_132' has a wrong offset!");
static_assert(offsetof(ABP_VH_VETI_Moment::FAnimBlueprintGeneratedConstantData, __NameProperty_133) == 0x00000C, "Member 'ABP_VH_VETI_Moment::FAnimBlueprintGeneratedConstantData::__NameProperty_133' has a wrong offset!");
static_assert(offsetof(ABP_VH_VETI_Moment::FAnimBlueprintGeneratedConstantData, __IntProperty_134) == 0x000014, "Member 'ABP_VH_VETI_Moment::FAnimBlueprintGeneratedConstantData::__IntProperty_134' has a wrong offset!");
static_assert(offsetof(ABP_VH_VETI_Moment::FAnimBlueprintGeneratedConstantData, __NameProperty_135) == 0x000018, "Member 'ABP_VH_VETI_Moment::FAnimBlueprintGeneratedConstantData::__NameProperty_135' has a wrong offset!");
static_assert(offsetof(ABP_VH_VETI_Moment::FAnimBlueprintGeneratedConstantData, __IntProperty_136) == 0x000020, "Member 'ABP_VH_VETI_Moment::FAnimBlueprintGeneratedConstantData::__IntProperty_136' has a wrong offset!");
static_assert(offsetof(ABP_VH_VETI_Moment::FAnimBlueprintGeneratedConstantData, __NameProperty_137) == 0x000024, "Member 'ABP_VH_VETI_Moment::FAnimBlueprintGeneratedConstantData::__NameProperty_137' has a wrong offset!");
static_assert(offsetof(ABP_VH_VETI_Moment::FAnimBlueprintGeneratedConstantData, __IntProperty_138) == 0x00002C, "Member 'ABP_VH_VETI_Moment::FAnimBlueprintGeneratedConstantData::__IntProperty_138' has a wrong offset!");
static_assert(offsetof(ABP_VH_VETI_Moment::FAnimBlueprintGeneratedConstantData, __NameProperty_139) == 0x000030, "Member 'ABP_VH_VETI_Moment::FAnimBlueprintGeneratedConstantData::__NameProperty_139' has a wrong offset!");
static_assert(offsetof(ABP_VH_VETI_Moment::FAnimBlueprintGeneratedConstantData, __NameProperty_140) == 0x000038, "Member 'ABP_VH_VETI_Moment::FAnimBlueprintGeneratedConstantData::__NameProperty_140' has a wrong offset!");
static_assert(offsetof(ABP_VH_VETI_Moment::FAnimBlueprintGeneratedConstantData, __IntProperty_141) == 0x000040, "Member 'ABP_VH_VETI_Moment::FAnimBlueprintGeneratedConstantData::__IntProperty_141' has a wrong offset!");
static_assert(offsetof(ABP_VH_VETI_Moment::FAnimBlueprintGeneratedConstantData, __StructProperty_142) == 0x000044, "Member 'ABP_VH_VETI_Moment::FAnimBlueprintGeneratedConstantData::__StructProperty_142' has a wrong offset!");
static_assert(offsetof(ABP_VH_VETI_Moment::FAnimBlueprintGeneratedConstantData, __BoolProperty_143) == 0x000070, "Member 'ABP_VH_VETI_Moment::FAnimBlueprintGeneratedConstantData::__BoolProperty_143' has a wrong offset!");
static_assert(offsetof(ABP_VH_VETI_Moment::FAnimBlueprintGeneratedConstantData, __FloatProperty_144) == 0x000074, "Member 'ABP_VH_VETI_Moment::FAnimBlueprintGeneratedConstantData::__FloatProperty_144' has a wrong offset!");
static_assert(offsetof(ABP_VH_VETI_Moment::FAnimBlueprintGeneratedConstantData, __FloatProperty_145) == 0x000078, "Member 'ABP_VH_VETI_Moment::FAnimBlueprintGeneratedConstantData::__FloatProperty_145' has a wrong offset!");
static_assert(offsetof(ABP_VH_VETI_Moment::FAnimBlueprintGeneratedConstantData, __BoolProperty_146) == 0x00007C, "Member 'ABP_VH_VETI_Moment::FAnimBlueprintGeneratedConstantData::__BoolProperty_146' has a wrong offset!");
static_assert(offsetof(ABP_VH_VETI_Moment::FAnimBlueprintGeneratedConstantData, __EnumProperty_147) == 0x00007D, "Member 'ABP_VH_VETI_Moment::FAnimBlueprintGeneratedConstantData::__EnumProperty_147' has a wrong offset!");
static_assert(offsetof(ABP_VH_VETI_Moment::FAnimBlueprintGeneratedConstantData, __ByteProperty_148) == 0x00007E, "Member 'ABP_VH_VETI_Moment::FAnimBlueprintGeneratedConstantData::__ByteProperty_148' has a wrong offset!");
static_assert(offsetof(ABP_VH_VETI_Moment::FAnimBlueprintGeneratedConstantData, __NameProperty_149) == 0x000080, "Member 'ABP_VH_VETI_Moment::FAnimBlueprintGeneratedConstantData::__NameProperty_149' has a wrong offset!");
static_assert(offsetof(ABP_VH_VETI_Moment::FAnimBlueprintGeneratedConstantData, __StructProperty_150) == 0x000088, "Member 'ABP_VH_VETI_Moment::FAnimBlueprintGeneratedConstantData::__StructProperty_150' has a wrong offset!");
static_assert(offsetof(ABP_VH_VETI_Moment::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x0000A8, "Member 'ABP_VH_VETI_Moment::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(ABP_VH_VETI_Moment::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000128, "Member 'ABP_VH_VETI_Moment::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(ABP_VH_VETI_Moment::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root) == 0x000140, "Member 'ABP_VH_VETI_Moment::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(ABP_VH_VETI_Moment::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ApplyAdditive) == 0x000170, "Member 'ABP_VH_VETI_Moment::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ApplyAdditive' has a wrong offset!");
static_assert(offsetof(ABP_VH_VETI_Moment::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_5) == 0x0001A0, "Member 'ABP_VH_VETI_Moment::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_5' has a wrong offset!");
static_assert(offsetof(ABP_VH_VETI_Moment::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_4) == 0x0001D0, "Member 'ABP_VH_VETI_Moment::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_4' has a wrong offset!");
static_assert(offsetof(ABP_VH_VETI_Moment::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_3) == 0x000200, "Member 'ABP_VH_VETI_Moment::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_3' has a wrong offset!");
static_assert(offsetof(ABP_VH_VETI_Moment::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_2) == 0x000230, "Member 'ABP_VH_VETI_Moment::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_2' has a wrong offset!");
static_assert(offsetof(ABP_VH_VETI_Moment::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_1) == 0x000260, "Member 'ABP_VH_VETI_Moment::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(ABP_VH_VETI_Moment::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult) == 0x000290, "Member 'ABP_VH_VETI_Moment::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(ABP_VH_VETI_Moment::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_3) == 0x0002C0, "Member 'ABP_VH_VETI_Moment::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_3' has a wrong offset!");
static_assert(offsetof(ABP_VH_VETI_Moment::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult_3) == 0x0002F0, "Member 'ABP_VH_VETI_Moment::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult_3' has a wrong offset!");
static_assert(offsetof(ABP_VH_VETI_Moment::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_2) == 0x000320, "Member 'ABP_VH_VETI_Moment::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(ABP_VH_VETI_Moment::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult_2) == 0x000350, "Member 'ABP_VH_VETI_Moment::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult_2' has a wrong offset!");
static_assert(offsetof(ABP_VH_VETI_Moment::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_1) == 0x000380, "Member 'ABP_VH_VETI_Moment::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(ABP_VH_VETI_Moment::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult_1) == 0x0003B0, "Member 'ABP_VH_VETI_Moment::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(ABP_VH_VETI_Moment::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LocalRefPose) == 0x0003E0, "Member 'ABP_VH_VETI_Moment::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LocalRefPose' has a wrong offset!");
static_assert(offsetof(ABP_VH_VETI_Moment::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult) == 0x000410, "Member 'ABP_VH_VETI_Moment::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(ABP_VH_VETI_Moment::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateMachine) == 0x000440, "Member 'ABP_VH_VETI_Moment::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(ABP_VH_VETI_Moment::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer) == 0x000470, "Member 'ABP_VH_VETI_Moment::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(ABP_VH_VETI_Moment::FAnimBlueprintGeneratedConstantData, AnimGraphNode_RotationOffsetBlendSpace) == 0x0004A0, "Member 'ABP_VH_VETI_Moment::FAnimBlueprintGeneratedConstantData::AnimGraphNode_RotationOffsetBlendSpace' has a wrong offset!");
static_assert(offsetof(ABP_VH_VETI_Moment::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Slot) == 0x0004D0, "Member 'ABP_VH_VETI_Moment::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(ABP_VH_VETI_Moment::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LocalToComponentSpace) == 0x000500, "Member 'ABP_VH_VETI_Moment::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(ABP_VH_VETI_Moment::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ComponentToLocalSpace) == 0x000530, "Member 'ABP_VH_VETI_Moment::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(ABP_VH_VETI_Moment::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ModifyBone_1) == 0x000560, "Member 'ABP_VH_VETI_Moment::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ModifyBone_1' has a wrong offset!");
static_assert(offsetof(ABP_VH_VETI_Moment::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ModifyBone) == 0x000590, "Member 'ABP_VH_VETI_Moment::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ModifyBone' has a wrong offset!");

// ScriptStruct ABP_VH_VETI_Moment.ABP_VH_VETI_Moment_C.AnimBlueprintGeneratedMutableData
// 0x0007 (0x0008 - 0x0001)
struct ABP_VH_VETI_Moment::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty;                                   // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_VH_VETI_Moment::FAnimBlueprintGeneratedMutableData) == 0x000004, "Wrong alignment on ABP_VH_VETI_Moment::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(ABP_VH_VETI_Moment::FAnimBlueprintGeneratedMutableData) == 0x000008, "Wrong size on ABP_VH_VETI_Moment::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(ABP_VH_VETI_Moment::FAnimBlueprintGeneratedMutableData, __FloatProperty) == 0x000004, "Member 'ABP_VH_VETI_Moment::FAnimBlueprintGeneratedMutableData::__FloatProperty' has a wrong offset!");

}

