#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_VH_VETI_Moment

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ABP_VH_VETI_Moment_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "Tempest_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_VH_VETI_Moment.ABP_VH_VETI_Moment_C
// 0x0860 (0x0C30 - 0x03D0)
class UABP_VH_VETI_Moment_C final : public UTedAnimInstance_Vehicle
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct ABP_VH_VETI_Moment::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;           // 0x03D8(0x0008)(HasGetValueTypeHash)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x03E0(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x03E8(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x03F0(0x0020)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive;                       // 0x0410(0x00C8)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_5;                  // 0x04D8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4;                  // 0x0500(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3;                  // 0x0528(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x0550(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x0578(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x05A0(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0x05C8(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3;                       // 0x0610(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x0630(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x0678(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x0698(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x06E0(0x0020)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose;                        // 0x0700(0x0010)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x0710(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x0730(0x00C8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x07F8(0x0048)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace;            // 0x0840(0x0118)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x0958(0x0048)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x09A0(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x09C0(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x09E0(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x0B08(0x0128)()

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_VH_VETI_Moment_AnimGraphNode_ModifyBone_16D467CC44EF8B02AABB6680EE2611D9();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_VH_VETI_Moment_AnimGraphNode_ModifyBone_7ECD52E14C0C86C74F92D6A50091E359();
	void ExecuteUbergraph_ABP_VH_VETI_Moment(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_VH_VETI_Moment_C">();
	}
	static class UABP_VH_VETI_Moment_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_VH_VETI_Moment_C>();
	}
};
static_assert(alignof(UABP_VH_VETI_Moment_C) == 0x000010, "Wrong alignment on UABP_VH_VETI_Moment_C");
static_assert(sizeof(UABP_VH_VETI_Moment_C) == 0x000C30, "Wrong size on UABP_VH_VETI_Moment_C");
static_assert(offsetof(UABP_VH_VETI_Moment_C, UberGraphFrame) == 0x0003D0, "Member 'UABP_VH_VETI_Moment_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_VH_VETI_Moment_C, __AnimBlueprintMutables) == 0x0003D8, "Member 'UABP_VH_VETI_Moment_C::__AnimBlueprintMutables' has a wrong offset!");
static_assert(offsetof(UABP_VH_VETI_Moment_C, AnimBlueprintExtension_PropertyAccess) == 0x0003E0, "Member 'UABP_VH_VETI_Moment_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UABP_VH_VETI_Moment_C, AnimBlueprintExtension_Base) == 0x0003E8, "Member 'UABP_VH_VETI_Moment_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UABP_VH_VETI_Moment_C, AnimGraphNode_Root) == 0x0003F0, "Member 'UABP_VH_VETI_Moment_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_VH_VETI_Moment_C, AnimGraphNode_ApplyAdditive) == 0x000410, "Member 'UABP_VH_VETI_Moment_C::AnimGraphNode_ApplyAdditive' has a wrong offset!");
static_assert(offsetof(UABP_VH_VETI_Moment_C, AnimGraphNode_TransitionResult_5) == 0x0004D8, "Member 'UABP_VH_VETI_Moment_C::AnimGraphNode_TransitionResult_5' has a wrong offset!");
static_assert(offsetof(UABP_VH_VETI_Moment_C, AnimGraphNode_TransitionResult_4) == 0x000500, "Member 'UABP_VH_VETI_Moment_C::AnimGraphNode_TransitionResult_4' has a wrong offset!");
static_assert(offsetof(UABP_VH_VETI_Moment_C, AnimGraphNode_TransitionResult_3) == 0x000528, "Member 'UABP_VH_VETI_Moment_C::AnimGraphNode_TransitionResult_3' has a wrong offset!");
static_assert(offsetof(UABP_VH_VETI_Moment_C, AnimGraphNode_TransitionResult_2) == 0x000550, "Member 'UABP_VH_VETI_Moment_C::AnimGraphNode_TransitionResult_2' has a wrong offset!");
static_assert(offsetof(UABP_VH_VETI_Moment_C, AnimGraphNode_TransitionResult_1) == 0x000578, "Member 'UABP_VH_VETI_Moment_C::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(UABP_VH_VETI_Moment_C, AnimGraphNode_TransitionResult) == 0x0005A0, "Member 'UABP_VH_VETI_Moment_C::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(UABP_VH_VETI_Moment_C, AnimGraphNode_SequencePlayer_3) == 0x0005C8, "Member 'UABP_VH_VETI_Moment_C::AnimGraphNode_SequencePlayer_3' has a wrong offset!");
static_assert(offsetof(UABP_VH_VETI_Moment_C, AnimGraphNode_StateResult_3) == 0x000610, "Member 'UABP_VH_VETI_Moment_C::AnimGraphNode_StateResult_3' has a wrong offset!");
static_assert(offsetof(UABP_VH_VETI_Moment_C, AnimGraphNode_SequencePlayer_2) == 0x000630, "Member 'UABP_VH_VETI_Moment_C::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(UABP_VH_VETI_Moment_C, AnimGraphNode_StateResult_2) == 0x000678, "Member 'UABP_VH_VETI_Moment_C::AnimGraphNode_StateResult_2' has a wrong offset!");
static_assert(offsetof(UABP_VH_VETI_Moment_C, AnimGraphNode_SequencePlayer_1) == 0x000698, "Member 'UABP_VH_VETI_Moment_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UABP_VH_VETI_Moment_C, AnimGraphNode_StateResult_1) == 0x0006E0, "Member 'UABP_VH_VETI_Moment_C::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(UABP_VH_VETI_Moment_C, AnimGraphNode_LocalRefPose) == 0x000700, "Member 'UABP_VH_VETI_Moment_C::AnimGraphNode_LocalRefPose' has a wrong offset!");
static_assert(offsetof(UABP_VH_VETI_Moment_C, AnimGraphNode_StateResult) == 0x000710, "Member 'UABP_VH_VETI_Moment_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(UABP_VH_VETI_Moment_C, AnimGraphNode_StateMachine) == 0x000730, "Member 'UABP_VH_VETI_Moment_C::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(UABP_VH_VETI_Moment_C, AnimGraphNode_SequencePlayer) == 0x0007F8, "Member 'UABP_VH_VETI_Moment_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UABP_VH_VETI_Moment_C, AnimGraphNode_RotationOffsetBlendSpace) == 0x000840, "Member 'UABP_VH_VETI_Moment_C::AnimGraphNode_RotationOffsetBlendSpace' has a wrong offset!");
static_assert(offsetof(UABP_VH_VETI_Moment_C, AnimGraphNode_Slot) == 0x000958, "Member 'UABP_VH_VETI_Moment_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(UABP_VH_VETI_Moment_C, AnimGraphNode_LocalToComponentSpace) == 0x0009A0, "Member 'UABP_VH_VETI_Moment_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UABP_VH_VETI_Moment_C, AnimGraphNode_ComponentToLocalSpace) == 0x0009C0, "Member 'UABP_VH_VETI_Moment_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UABP_VH_VETI_Moment_C, AnimGraphNode_ModifyBone_1) == 0x0009E0, "Member 'UABP_VH_VETI_Moment_C::AnimGraphNode_ModifyBone_1' has a wrong offset!");
static_assert(offsetof(UABP_VH_VETI_Moment_C, AnimGraphNode_ModifyBone) == 0x000B08, "Member 'UABP_VH_VETI_Moment_C::AnimGraphNode_ModifyBone' has a wrong offset!");

}

