#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_GDF_DroneCombat

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function ABP_GDF_DroneCombat.ABP_GDF_DroneCombat_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct ABP_GDF_DroneCombat_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_GDF_DroneCombat_C_AnimGraph) == 0x000008, "Wrong alignment on ABP_GDF_DroneCombat_C_AnimGraph");
static_assert(sizeof(ABP_GDF_DroneCombat_C_AnimGraph) == 0x000010, "Wrong size on ABP_GDF_DroneCombat_C_AnimGraph");
static_assert(offsetof(ABP_GDF_DroneCombat_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'ABP_GDF_DroneCombat_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function ABP_GDF_DroneCombat.ABP_GDF_DroneCombat_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct ABP_GDF_DroneCombat_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_GDF_DroneCombat_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on ABP_GDF_DroneCombat_C_BlueprintUpdateAnimation");
static_assert(sizeof(ABP_GDF_DroneCombat_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on ABP_GDF_DroneCombat_C_BlueprintUpdateAnimation");
static_assert(offsetof(ABP_GDF_DroneCombat_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'ABP_GDF_DroneCombat_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function ABP_GDF_DroneCombat.ABP_GDF_DroneCombat_C.ExecuteUbergraph_ABP_GDF_DroneCombat
// 0x00D0 (0x00D0 - 0x0000)
struct ABP_GDF_DroneCombat_C_ExecuteUbergraph_ABP_GDF_DroneCombat final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnyMontagePlaying_ReturnValue;          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0010(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue;              // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATedUnitBase*                           K2Node_DynamicCast_AsTed_Unit_Base;                // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0090(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UTedAircraftMovementComponent*          K2Node_DynamicCast_AsTed_Aircraft_Movement_Component; // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast;          // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast_1;        // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Yaw_ImplicitCast;             // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Roll_ImplicitCast;            // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_GDF_DroneCombat_C_ExecuteUbergraph_ABP_GDF_DroneCombat) == 0x000008, "Wrong alignment on ABP_GDF_DroneCombat_C_ExecuteUbergraph_ABP_GDF_DroneCombat");
static_assert(sizeof(ABP_GDF_DroneCombat_C_ExecuteUbergraph_ABP_GDF_DroneCombat) == 0x0000D0, "Wrong size on ABP_GDF_DroneCombat_C_ExecuteUbergraph_ABP_GDF_DroneCombat");
static_assert(offsetof(ABP_GDF_DroneCombat_C_ExecuteUbergraph_ABP_GDF_DroneCombat, EntryPoint) == 0x000000, "Member 'ABP_GDF_DroneCombat_C_ExecuteUbergraph_ABP_GDF_DroneCombat::EntryPoint' has a wrong offset!");
static_assert(offsetof(ABP_GDF_DroneCombat_C_ExecuteUbergraph_ABP_GDF_DroneCombat, CallFunc_IsAnyMontagePlaying_ReturnValue) == 0x000004, "Member 'ABP_GDF_DroneCombat_C_ExecuteUbergraph_ABP_GDF_DroneCombat::CallFunc_IsAnyMontagePlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_GDF_DroneCombat_C_ExecuteUbergraph_ABP_GDF_DroneCombat, K2Node_Event_DeltaTimeX) == 0x000008, "Member 'ABP_GDF_DroneCombat_C_ExecuteUbergraph_ABP_GDF_DroneCombat::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(ABP_GDF_DroneCombat_C_ExecuteUbergraph_ABP_GDF_DroneCombat, CallFunc_BreakTransform_Location) == 0x000010, "Member 'ABP_GDF_DroneCombat_C_ExecuteUbergraph_ABP_GDF_DroneCombat::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(ABP_GDF_DroneCombat_C_ExecuteUbergraph_ABP_GDF_DroneCombat, CallFunc_BreakTransform_Rotation) == 0x000028, "Member 'ABP_GDF_DroneCombat_C_ExecuteUbergraph_ABP_GDF_DroneCombat::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(ABP_GDF_DroneCombat_C_ExecuteUbergraph_ABP_GDF_DroneCombat, CallFunc_BreakTransform_Scale) == 0x000040, "Member 'ABP_GDF_DroneCombat_C_ExecuteUbergraph_ABP_GDF_DroneCombat::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(ABP_GDF_DroneCombat_C_ExecuteUbergraph_ABP_GDF_DroneCombat, CallFunc_BreakRotator_Roll) == 0x000058, "Member 'ABP_GDF_DroneCombat_C_ExecuteUbergraph_ABP_GDF_DroneCombat::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(ABP_GDF_DroneCombat_C_ExecuteUbergraph_ABP_GDF_DroneCombat, CallFunc_BreakRotator_Pitch) == 0x00005C, "Member 'ABP_GDF_DroneCombat_C_ExecuteUbergraph_ABP_GDF_DroneCombat::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(ABP_GDF_DroneCombat_C_ExecuteUbergraph_ABP_GDF_DroneCombat, CallFunc_BreakRotator_Yaw) == 0x000060, "Member 'ABP_GDF_DroneCombat_C_ExecuteUbergraph_ABP_GDF_DroneCombat::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(ABP_GDF_DroneCombat_C_ExecuteUbergraph_ABP_GDF_DroneCombat, CallFunc_TryGetPawnOwner_ReturnValue) == 0x000068, "Member 'ABP_GDF_DroneCombat_C_ExecuteUbergraph_ABP_GDF_DroneCombat::CallFunc_TryGetPawnOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_GDF_DroneCombat_C_ExecuteUbergraph_ABP_GDF_DroneCombat, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000070, "Member 'ABP_GDF_DroneCombat_C_ExecuteUbergraph_ABP_GDF_DroneCombat::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_GDF_DroneCombat_C_ExecuteUbergraph_ABP_GDF_DroneCombat, K2Node_DynamicCast_AsTed_Unit_Base) == 0x000078, "Member 'ABP_GDF_DroneCombat_C_ExecuteUbergraph_ABP_GDF_DroneCombat::K2Node_DynamicCast_AsTed_Unit_Base' has a wrong offset!");
static_assert(offsetof(ABP_GDF_DroneCombat_C_ExecuteUbergraph_ABP_GDF_DroneCombat, K2Node_DynamicCast_bSuccess) == 0x000080, "Member 'ABP_GDF_DroneCombat_C_ExecuteUbergraph_ABP_GDF_DroneCombat::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ABP_GDF_DroneCombat_C_ExecuteUbergraph_ABP_GDF_DroneCombat, CallFunc_Add_DoubleDouble_ReturnValue_1) == 0x000088, "Member 'ABP_GDF_DroneCombat_C_ExecuteUbergraph_ABP_GDF_DroneCombat::CallFunc_Add_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_GDF_DroneCombat_C_ExecuteUbergraph_ABP_GDF_DroneCombat, CallFunc_MakeRotator_ReturnValue) == 0x000090, "Member 'ABP_GDF_DroneCombat_C_ExecuteUbergraph_ABP_GDF_DroneCombat::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_GDF_DroneCombat_C_ExecuteUbergraph_ABP_GDF_DroneCombat, K2Node_DynamicCast_AsTed_Aircraft_Movement_Component) == 0x0000A8, "Member 'ABP_GDF_DroneCombat_C_ExecuteUbergraph_ABP_GDF_DroneCombat::K2Node_DynamicCast_AsTed_Aircraft_Movement_Component' has a wrong offset!");
static_assert(offsetof(ABP_GDF_DroneCombat_C_ExecuteUbergraph_ABP_GDF_DroneCombat, K2Node_DynamicCast_bSuccess_1) == 0x0000B0, "Member 'ABP_GDF_DroneCombat_C_ExecuteUbergraph_ABP_GDF_DroneCombat::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(ABP_GDF_DroneCombat_C_ExecuteUbergraph_ABP_GDF_DroneCombat, CallFunc_Add_DoubleDouble_A_ImplicitCast) == 0x0000B8, "Member 'ABP_GDF_DroneCombat_C_ExecuteUbergraph_ABP_GDF_DroneCombat::CallFunc_Add_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ABP_GDF_DroneCombat_C_ExecuteUbergraph_ABP_GDF_DroneCombat, CallFunc_Add_DoubleDouble_A_ImplicitCast_1) == 0x0000C0, "Member 'ABP_GDF_DroneCombat_C_ExecuteUbergraph_ABP_GDF_DroneCombat::CallFunc_Add_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(ABP_GDF_DroneCombat_C_ExecuteUbergraph_ABP_GDF_DroneCombat, CallFunc_MakeRotator_Yaw_ImplicitCast) == 0x0000C8, "Member 'ABP_GDF_DroneCombat_C_ExecuteUbergraph_ABP_GDF_DroneCombat::CallFunc_MakeRotator_Yaw_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ABP_GDF_DroneCombat_C_ExecuteUbergraph_ABP_GDF_DroneCombat, CallFunc_MakeRotator_Roll_ImplicitCast) == 0x0000CC, "Member 'ABP_GDF_DroneCombat_C_ExecuteUbergraph_ABP_GDF_DroneCombat::CallFunc_MakeRotator_Roll_ImplicitCast' has a wrong offset!");

}

