#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_BD_VETI_DominanceAnchor

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "Tempest_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_BD_VETI_DominanceAnchor.ABP_BD_VETI_DominanceAnchor_C
// 0x0360 (0x0790 - 0x0430)
class UABP_BD_VETI_DominanceAnchor_C final : public UTedAnimInstance_Structure
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0430(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0438(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0440(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0448(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x0468(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x0488(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x05B0(0x0128)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x06D8(0x0020)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x06F8(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0740(0x0048)()

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_BD_VETI_DominanceAnchor_AnimGraphNode_ModifyBone_D210AC5D43803036E41E11AEDF7C5887();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_BD_VETI_DominanceAnchor_AnimGraphNode_ModifyBone_E4B1503249854BEEEF51A2A8749D7490();
	void ExecuteUbergraph_ABP_BD_VETI_DominanceAnchor(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_BD_VETI_DominanceAnchor_C">();
	}
	static class UABP_BD_VETI_DominanceAnchor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_BD_VETI_DominanceAnchor_C>();
	}
};
static_assert(alignof(UABP_BD_VETI_DominanceAnchor_C) == 0x000010, "Wrong alignment on UABP_BD_VETI_DominanceAnchor_C");
static_assert(sizeof(UABP_BD_VETI_DominanceAnchor_C) == 0x000790, "Wrong size on UABP_BD_VETI_DominanceAnchor_C");
static_assert(offsetof(UABP_BD_VETI_DominanceAnchor_C, UberGraphFrame) == 0x000430, "Member 'UABP_BD_VETI_DominanceAnchor_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_BD_VETI_DominanceAnchor_C, AnimBlueprintExtension_PropertyAccess) == 0x000438, "Member 'UABP_BD_VETI_DominanceAnchor_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UABP_BD_VETI_DominanceAnchor_C, AnimBlueprintExtension_Base) == 0x000440, "Member 'UABP_BD_VETI_DominanceAnchor_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UABP_BD_VETI_DominanceAnchor_C, AnimGraphNode_Root) == 0x000448, "Member 'UABP_BD_VETI_DominanceAnchor_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_BD_VETI_DominanceAnchor_C, AnimGraphNode_LocalToComponentSpace) == 0x000468, "Member 'UABP_BD_VETI_DominanceAnchor_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UABP_BD_VETI_DominanceAnchor_C, AnimGraphNode_ModifyBone_1) == 0x000488, "Member 'UABP_BD_VETI_DominanceAnchor_C::AnimGraphNode_ModifyBone_1' has a wrong offset!");
static_assert(offsetof(UABP_BD_VETI_DominanceAnchor_C, AnimGraphNode_ModifyBone) == 0x0005B0, "Member 'UABP_BD_VETI_DominanceAnchor_C::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(UABP_BD_VETI_DominanceAnchor_C, AnimGraphNode_ComponentToLocalSpace) == 0x0006D8, "Member 'UABP_BD_VETI_DominanceAnchor_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UABP_BD_VETI_DominanceAnchor_C, AnimGraphNode_Slot) == 0x0006F8, "Member 'UABP_BD_VETI_DominanceAnchor_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(UABP_BD_VETI_DominanceAnchor_C, AnimGraphNode_SequencePlayer) == 0x000740, "Member 'UABP_BD_VETI_DominanceAnchor_C::AnimGraphNode_SequencePlayer' has a wrong offset!");

}

