#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_VH_VETI_Vimana

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Tempest_classes.hpp"
#include "ABP_VH_VETI_Vimana_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_VH_VETI_Vimana.ABP_VH_VETI_Vimana_C
// 0x0280 (0x06A0 - 0x0420)
class UABP_VH_VETI_Vimana_C final : public UTedAnimInstance_Aircraft
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0420(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct ABP_VH_VETI_Vimana::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;           // 0x0428(0x000C)(HasGetValueTypeHash)
	uint8                                         Pad_434[0x4];                                      // 0x0434(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0438(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0440(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0448(0x0020)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x0468(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x04B0(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x04F8(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0540(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x0588(0x0048)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive;                       // 0x05D0(0x00C8)()
	bool                                          HasFireTarget;                                     // 0x0698(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void ExecuteUbergraph_ABP_VH_VETI_Vimana(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_VH_VETI_Vimana_C">();
	}
	static class UABP_VH_VETI_Vimana_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_VH_VETI_Vimana_C>();
	}
};
static_assert(alignof(UABP_VH_VETI_Vimana_C) == 0x000010, "Wrong alignment on UABP_VH_VETI_Vimana_C");
static_assert(sizeof(UABP_VH_VETI_Vimana_C) == 0x0006A0, "Wrong size on UABP_VH_VETI_Vimana_C");
static_assert(offsetof(UABP_VH_VETI_Vimana_C, UberGraphFrame) == 0x000420, "Member 'UABP_VH_VETI_Vimana_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_VH_VETI_Vimana_C, __AnimBlueprintMutables) == 0x000428, "Member 'UABP_VH_VETI_Vimana_C::__AnimBlueprintMutables' has a wrong offset!");
static_assert(offsetof(UABP_VH_VETI_Vimana_C, AnimBlueprintExtension_PropertyAccess) == 0x000438, "Member 'UABP_VH_VETI_Vimana_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UABP_VH_VETI_Vimana_C, AnimBlueprintExtension_Base) == 0x000440, "Member 'UABP_VH_VETI_Vimana_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UABP_VH_VETI_Vimana_C, AnimGraphNode_Root) == 0x000448, "Member 'UABP_VH_VETI_Vimana_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_VH_VETI_Vimana_C, AnimGraphNode_Slot) == 0x000468, "Member 'UABP_VH_VETI_Vimana_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(UABP_VH_VETI_Vimana_C, AnimGraphNode_SequencePlayer_2) == 0x0004B0, "Member 'UABP_VH_VETI_Vimana_C::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(UABP_VH_VETI_Vimana_C, AnimGraphNode_SequencePlayer_1) == 0x0004F8, "Member 'UABP_VH_VETI_Vimana_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UABP_VH_VETI_Vimana_C, AnimGraphNode_SequencePlayer) == 0x000540, "Member 'UABP_VH_VETI_Vimana_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UABP_VH_VETI_Vimana_C, AnimGraphNode_BlendListByBool) == 0x000588, "Member 'UABP_VH_VETI_Vimana_C::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(UABP_VH_VETI_Vimana_C, AnimGraphNode_ApplyAdditive) == 0x0005D0, "Member 'UABP_VH_VETI_Vimana_C::AnimGraphNode_ApplyAdditive' has a wrong offset!");
static_assert(offsetof(UABP_VH_VETI_Vimana_C, HasFireTarget) == 0x000698, "Member 'UABP_VH_VETI_Vimana_C::HasFireTarget' has a wrong offset!");

}

