#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_VH_DYN_MatchstickGunship

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ABP_VH_DYN_MatchstickGunship_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "Tempest_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_VH_DYN_MatchstickGunship.ABP_VH_DYN_MatchstickGunship_C
// 0x0810 (0x0C30 - 0x0420)
class UABP_VH_DYN_MatchstickGunship_C final : public UTedAnimInstance_Aircraft
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0420(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct ABP_VH_DYN_MatchstickGunship::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables; // 0x0428(0x001C)(HasGetValueTypeHash)
	uint8                                         Pad_444[0x4];                                      // 0x0444(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0448(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0450(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0458(0x0020)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_1;                     // 0x0478(0x00C8)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace;            // 0x0540(0x0118)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_1;                  // 0x0658(0x0070)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose_2;                      // 0x06C8(0x0010)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive;                       // 0x06D8(0x00C8)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x07A0(0x0128)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x08C8(0x0020)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose_1;                      // 0x08E8(0x0010)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x08F8(0x0020)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x0918(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x0960(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x0988(0x0028)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose;                        // 0x09B0(0x0010)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x09C0(0x0020)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer;                    // 0x09E0(0x0070)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x0A50(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x0A70(0x00C8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x0B38(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x0BB8(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x0BE0(0x0048)()

public:
	void ExecuteUbergraph_ABP_VH_DYN_MatchstickGunship(int32 EntryPoint);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_VH_DYN_MatchstickGunship_AnimGraphNode_TransitionResult_111B49684A7C1F5CE3667E87A70D53F1();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_VH_DYN_MatchstickGunship_AnimGraphNode_RotationOffsetBlendSpace_E986D87F402777265D6E8CA9A0CEB3C1();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_VH_DYN_MatchstickGunship_AnimGraphNode_ModifyBone_293D43374DDCC683401855975568BA06();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_VH_DYN_MatchstickGunship_AnimGraphNode_BlendListByBool_17C565AA44C8BEBB809837AF511ECBCB();
	void AnimGraph(struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_VH_DYN_MatchstickGunship_C">();
	}
	static class UABP_VH_DYN_MatchstickGunship_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_VH_DYN_MatchstickGunship_C>();
	}
};
static_assert(alignof(UABP_VH_DYN_MatchstickGunship_C) == 0x000010, "Wrong alignment on UABP_VH_DYN_MatchstickGunship_C");
static_assert(sizeof(UABP_VH_DYN_MatchstickGunship_C) == 0x000C30, "Wrong size on UABP_VH_DYN_MatchstickGunship_C");
static_assert(offsetof(UABP_VH_DYN_MatchstickGunship_C, UberGraphFrame) == 0x000420, "Member 'UABP_VH_DYN_MatchstickGunship_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_VH_DYN_MatchstickGunship_C, __AnimBlueprintMutables) == 0x000428, "Member 'UABP_VH_DYN_MatchstickGunship_C::__AnimBlueprintMutables' has a wrong offset!");
static_assert(offsetof(UABP_VH_DYN_MatchstickGunship_C, AnimBlueprintExtension_PropertyAccess) == 0x000448, "Member 'UABP_VH_DYN_MatchstickGunship_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UABP_VH_DYN_MatchstickGunship_C, AnimBlueprintExtension_Base) == 0x000450, "Member 'UABP_VH_DYN_MatchstickGunship_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UABP_VH_DYN_MatchstickGunship_C, AnimGraphNode_Root) == 0x000458, "Member 'UABP_VH_DYN_MatchstickGunship_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_VH_DYN_MatchstickGunship_C, AnimGraphNode_ApplyAdditive_1) == 0x000478, "Member 'UABP_VH_DYN_MatchstickGunship_C::AnimGraphNode_ApplyAdditive_1' has a wrong offset!");
static_assert(offsetof(UABP_VH_DYN_MatchstickGunship_C, AnimGraphNode_RotationOffsetBlendSpace) == 0x000540, "Member 'UABP_VH_DYN_MatchstickGunship_C::AnimGraphNode_RotationOffsetBlendSpace' has a wrong offset!");
static_assert(offsetof(UABP_VH_DYN_MatchstickGunship_C, AnimGraphNode_BlendSpacePlayer_1) == 0x000658, "Member 'UABP_VH_DYN_MatchstickGunship_C::AnimGraphNode_BlendSpacePlayer_1' has a wrong offset!");
static_assert(offsetof(UABP_VH_DYN_MatchstickGunship_C, AnimGraphNode_LocalRefPose_2) == 0x0006C8, "Member 'UABP_VH_DYN_MatchstickGunship_C::AnimGraphNode_LocalRefPose_2' has a wrong offset!");
static_assert(offsetof(UABP_VH_DYN_MatchstickGunship_C, AnimGraphNode_ApplyAdditive) == 0x0006D8, "Member 'UABP_VH_DYN_MatchstickGunship_C::AnimGraphNode_ApplyAdditive' has a wrong offset!");
static_assert(offsetof(UABP_VH_DYN_MatchstickGunship_C, AnimGraphNode_ModifyBone) == 0x0007A0, "Member 'UABP_VH_DYN_MatchstickGunship_C::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(UABP_VH_DYN_MatchstickGunship_C, AnimGraphNode_ComponentToLocalSpace) == 0x0008C8, "Member 'UABP_VH_DYN_MatchstickGunship_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UABP_VH_DYN_MatchstickGunship_C, AnimGraphNode_LocalRefPose_1) == 0x0008E8, "Member 'UABP_VH_DYN_MatchstickGunship_C::AnimGraphNode_LocalRefPose_1' has a wrong offset!");
static_assert(offsetof(UABP_VH_DYN_MatchstickGunship_C, AnimGraphNode_LocalToComponentSpace) == 0x0008F8, "Member 'UABP_VH_DYN_MatchstickGunship_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UABP_VH_DYN_MatchstickGunship_C, AnimGraphNode_BlendListByBool) == 0x000918, "Member 'UABP_VH_DYN_MatchstickGunship_C::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(UABP_VH_DYN_MatchstickGunship_C, AnimGraphNode_TransitionResult_1) == 0x000960, "Member 'UABP_VH_DYN_MatchstickGunship_C::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(UABP_VH_DYN_MatchstickGunship_C, AnimGraphNode_TransitionResult) == 0x000988, "Member 'UABP_VH_DYN_MatchstickGunship_C::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(UABP_VH_DYN_MatchstickGunship_C, AnimGraphNode_LocalRefPose) == 0x0009B0, "Member 'UABP_VH_DYN_MatchstickGunship_C::AnimGraphNode_LocalRefPose' has a wrong offset!");
static_assert(offsetof(UABP_VH_DYN_MatchstickGunship_C, AnimGraphNode_StateResult_1) == 0x0009C0, "Member 'UABP_VH_DYN_MatchstickGunship_C::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(UABP_VH_DYN_MatchstickGunship_C, AnimGraphNode_BlendSpacePlayer) == 0x0009E0, "Member 'UABP_VH_DYN_MatchstickGunship_C::AnimGraphNode_BlendSpacePlayer' has a wrong offset!");
static_assert(offsetof(UABP_VH_DYN_MatchstickGunship_C, AnimGraphNode_StateResult) == 0x000A50, "Member 'UABP_VH_DYN_MatchstickGunship_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(UABP_VH_DYN_MatchstickGunship_C, AnimGraphNode_StateMachine) == 0x000A70, "Member 'UABP_VH_DYN_MatchstickGunship_C::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(UABP_VH_DYN_MatchstickGunship_C, AnimGraphNode_SaveCachedPose) == 0x000B38, "Member 'UABP_VH_DYN_MatchstickGunship_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(UABP_VH_DYN_MatchstickGunship_C, AnimGraphNode_UseCachedPose) == 0x000BB8, "Member 'UABP_VH_DYN_MatchstickGunship_C::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(UABP_VH_DYN_MatchstickGunship_C, AnimGraphNode_Slot) == 0x000BE0, "Member 'UABP_VH_DYN_MatchstickGunship_C::AnimGraphNode_Slot' has a wrong offset!");

}

