#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_BD_GDF_Barracks

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Tempest_structs.hpp"


namespace SDK::Params
{

// Function ABP_BD_GDF_Barracks.ABP_BD_GDF_Barracks_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct ABP_BD_GDF_Barracks_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_BD_GDF_Barracks_C_AnimGraph) == 0x000008, "Wrong alignment on ABP_BD_GDF_Barracks_C_AnimGraph");
static_assert(sizeof(ABP_BD_GDF_Barracks_C_AnimGraph) == 0x000010, "Wrong size on ABP_BD_GDF_Barracks_C_AnimGraph");
static_assert(offsetof(ABP_BD_GDF_Barracks_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'ABP_BD_GDF_Barracks_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function ABP_BD_GDF_Barracks.ABP_BD_GDF_Barracks_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct ABP_BD_GDF_Barracks_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_BD_GDF_Barracks_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on ABP_BD_GDF_Barracks_C_BlueprintUpdateAnimation");
static_assert(sizeof(ABP_BD_GDF_Barracks_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on ABP_BD_GDF_Barracks_C_BlueprintUpdateAnimation");
static_assert(offsetof(ABP_BD_GDF_Barracks_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'ABP_BD_GDF_Barracks_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function ABP_BD_GDF_Barracks.ABP_BD_GDF_Barracks_C.ExecuteUbergraph_ABP_BD_GDF_Barracks
// 0x0028 (0x0028 - 0x0000)
struct ABP_BD_GDF_Barracks_C_ExecuteUbergraph_ABP_BD_GDF_Barracks final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_BD_GDF_Barracks_C*                  K2Node_DynamicCast_AsBP_BD_GDF_Barracks;           // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETedPowerStatus                               CallFunc_GetPowerStatus_ReturnValue;               // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23[0x1];                                       // 0x0023(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_StructMemberSet___FloatProperty_ImplicitCast; // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_BD_GDF_Barracks_C_ExecuteUbergraph_ABP_BD_GDF_Barracks) == 0x000008, "Wrong alignment on ABP_BD_GDF_Barracks_C_ExecuteUbergraph_ABP_BD_GDF_Barracks");
static_assert(sizeof(ABP_BD_GDF_Barracks_C_ExecuteUbergraph_ABP_BD_GDF_Barracks) == 0x000028, "Wrong size on ABP_BD_GDF_Barracks_C_ExecuteUbergraph_ABP_BD_GDF_Barracks");
static_assert(offsetof(ABP_BD_GDF_Barracks_C_ExecuteUbergraph_ABP_BD_GDF_Barracks, EntryPoint) == 0x000000, "Member 'ABP_BD_GDF_Barracks_C_ExecuteUbergraph_ABP_BD_GDF_Barracks::EntryPoint' has a wrong offset!");
static_assert(offsetof(ABP_BD_GDF_Barracks_C_ExecuteUbergraph_ABP_BD_GDF_Barracks, K2Node_Event_DeltaTimeX) == 0x000004, "Member 'ABP_BD_GDF_Barracks_C_ExecuteUbergraph_ABP_BD_GDF_Barracks::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(ABP_BD_GDF_Barracks_C_ExecuteUbergraph_ABP_BD_GDF_Barracks, CallFunc_SelectFloat_ReturnValue) == 0x000008, "Member 'ABP_BD_GDF_Barracks_C_ExecuteUbergraph_ABP_BD_GDF_Barracks::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_BD_GDF_Barracks_C_ExecuteUbergraph_ABP_BD_GDF_Barracks, CallFunc_TryGetPawnOwner_ReturnValue) == 0x000010, "Member 'ABP_BD_GDF_Barracks_C_ExecuteUbergraph_ABP_BD_GDF_Barracks::CallFunc_TryGetPawnOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_BD_GDF_Barracks_C_ExecuteUbergraph_ABP_BD_GDF_Barracks, K2Node_DynamicCast_AsBP_BD_GDF_Barracks) == 0x000018, "Member 'ABP_BD_GDF_Barracks_C_ExecuteUbergraph_ABP_BD_GDF_Barracks::K2Node_DynamicCast_AsBP_BD_GDF_Barracks' has a wrong offset!");
static_assert(offsetof(ABP_BD_GDF_Barracks_C_ExecuteUbergraph_ABP_BD_GDF_Barracks, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'ABP_BD_GDF_Barracks_C_ExecuteUbergraph_ABP_BD_GDF_Barracks::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ABP_BD_GDF_Barracks_C_ExecuteUbergraph_ABP_BD_GDF_Barracks, CallFunc_GetPowerStatus_ReturnValue) == 0x000021, "Member 'ABP_BD_GDF_Barracks_C_ExecuteUbergraph_ABP_BD_GDF_Barracks::CallFunc_GetPowerStatus_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_BD_GDF_Barracks_C_ExecuteUbergraph_ABP_BD_GDF_Barracks, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000022, "Member 'ABP_BD_GDF_Barracks_C_ExecuteUbergraph_ABP_BD_GDF_Barracks::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_BD_GDF_Barracks_C_ExecuteUbergraph_ABP_BD_GDF_Barracks, K2Node_StructMemberSet___FloatProperty_ImplicitCast) == 0x000024, "Member 'ABP_BD_GDF_Barracks_C_ExecuteUbergraph_ABP_BD_GDF_Barracks::K2Node_StructMemberSet___FloatProperty_ImplicitCast' has a wrong offset!");

}

