#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_BD_DYN_TempestRig_V02

#include "Basic.hpp"

#include "ABP_BD_DYN_TempestRig_V02_structs.hpp"
#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "Tempest_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_BD_DYN_TempestRig_V02.ABP_BD_DYN_TempestRig_V02_C
// 0x00D0 (0x0500 - 0x0430)
class UABP_BD_DYN_TempestRig_V02_C final : public UTedAnimInstance_Structure
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0430(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct ABP_BD_DYN_TempestRig_V02::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;    // 0x0438(0x0008)(HasGetValueTypeHash)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0440(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0448(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0450(0x0020)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x0470(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x04B8(0x0048)()

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_BD_DYN_TempestRig_V02_AnimGraphNode_SequencePlayer_05B514C1411E68E605627BB6DE566DF4();
	void ExecuteUbergraph_ABP_BD_DYN_TempestRig_V02(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_BD_DYN_TempestRig_V02_C">();
	}
	static class UABP_BD_DYN_TempestRig_V02_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_BD_DYN_TempestRig_V02_C>();
	}
};
static_assert(alignof(UABP_BD_DYN_TempestRig_V02_C) == 0x000010, "Wrong alignment on UABP_BD_DYN_TempestRig_V02_C");
static_assert(sizeof(UABP_BD_DYN_TempestRig_V02_C) == 0x000500, "Wrong size on UABP_BD_DYN_TempestRig_V02_C");
static_assert(offsetof(UABP_BD_DYN_TempestRig_V02_C, UberGraphFrame) == 0x000430, "Member 'UABP_BD_DYN_TempestRig_V02_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_BD_DYN_TempestRig_V02_C, __AnimBlueprintMutables) == 0x000438, "Member 'UABP_BD_DYN_TempestRig_V02_C::__AnimBlueprintMutables' has a wrong offset!");
static_assert(offsetof(UABP_BD_DYN_TempestRig_V02_C, AnimBlueprintExtension_PropertyAccess) == 0x000440, "Member 'UABP_BD_DYN_TempestRig_V02_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UABP_BD_DYN_TempestRig_V02_C, AnimBlueprintExtension_Base) == 0x000448, "Member 'UABP_BD_DYN_TempestRig_V02_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UABP_BD_DYN_TempestRig_V02_C, AnimGraphNode_Root) == 0x000450, "Member 'UABP_BD_DYN_TempestRig_V02_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_BD_DYN_TempestRig_V02_C, AnimGraphNode_Slot) == 0x000470, "Member 'UABP_BD_DYN_TempestRig_V02_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(UABP_BD_DYN_TempestRig_V02_C, AnimGraphNode_SequencePlayer) == 0x0004B8, "Member 'UABP_BD_DYN_TempestRig_V02_C::AnimGraphNode_SequencePlayer' has a wrong offset!");

}

