#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_BD_DYN_ConstructionYard

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct ABP_BD_DYN_ConstructionYard.ABP_BD_DYN_ConstructionYard_C.AnimBlueprintGeneratedConstantData
// 0x04A7 (0x04A8 - 0x0001)
struct ABP_BD_DYN_ConstructionYard::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_81;                                 // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_82;                                // 0x0010(0x0010)(BlueprintVisible, EditFixedSize)
	bool                                          __BoolProperty_83;                                 // 0x0020(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_84;                                // 0x0024(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_85;                               // 0x0028(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_86;                                // 0x0054(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_87;                                 // 0x0058(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_88;                                 // 0x0059(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A[0x2];                                       // 0x005A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_89;                                 // 0x005C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlendProfile*                          __BlendProfile_90;                                 // 0x0068(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_91;                                   // 0x0070(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          __BoolProperty_92;                                 // 0x0078(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_93;                                 // 0x0079(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_94;                                 // 0x007A(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7B[0x5];                                       // 0x007B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_95;                                // 0x0080(0x0010)(BlueprintVisible, EditFixedSize)
	struct FAnimNodeFunctionRef                   __StructProperty_96;                               // 0x0090(0x0020)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x00B0(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0130(0x0018)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root;                           // 0x0148(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LayeredBoneBlend;               // 0x0178(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_1;              // 0x01A8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose_1;               // 0x01D8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot_1;                         // 0x0208(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot;                           // 0x0238(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_4;                // 0x0268(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive_1;                // 0x0298(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_2;               // 0x02C8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_3;                // 0x02F8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_1;               // 0x0328(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive;                  // 0x0358(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer;                 // 0x0388(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_2;                // 0x03B8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_1;                // 0x03E8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool;                // 0x0418(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose;                 // 0x0448(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose;                  // 0x0478(0x0030)()
};
static_assert(alignof(ABP_BD_DYN_ConstructionYard::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on ABP_BD_DYN_ConstructionYard::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(ABP_BD_DYN_ConstructionYard::FAnimBlueprintGeneratedConstantData) == 0x0004A8, "Wrong size on ABP_BD_DYN_ConstructionYard::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(ABP_BD_DYN_ConstructionYard::FAnimBlueprintGeneratedConstantData, __NameProperty_81) == 0x000004, "Member 'ABP_BD_DYN_ConstructionYard::FAnimBlueprintGeneratedConstantData::__NameProperty_81' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_ConstructionYard::FAnimBlueprintGeneratedConstantData, __ArrayProperty_82) == 0x000010, "Member 'ABP_BD_DYN_ConstructionYard::FAnimBlueprintGeneratedConstantData::__ArrayProperty_82' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_ConstructionYard::FAnimBlueprintGeneratedConstantData, __BoolProperty_83) == 0x000020, "Member 'ABP_BD_DYN_ConstructionYard::FAnimBlueprintGeneratedConstantData::__BoolProperty_83' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_ConstructionYard::FAnimBlueprintGeneratedConstantData, __FloatProperty_84) == 0x000024, "Member 'ABP_BD_DYN_ConstructionYard::FAnimBlueprintGeneratedConstantData::__FloatProperty_84' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_ConstructionYard::FAnimBlueprintGeneratedConstantData, __StructProperty_85) == 0x000028, "Member 'ABP_BD_DYN_ConstructionYard::FAnimBlueprintGeneratedConstantData::__StructProperty_85' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_ConstructionYard::FAnimBlueprintGeneratedConstantData, __FloatProperty_86) == 0x000054, "Member 'ABP_BD_DYN_ConstructionYard::FAnimBlueprintGeneratedConstantData::__FloatProperty_86' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_ConstructionYard::FAnimBlueprintGeneratedConstantData, __EnumProperty_87) == 0x000058, "Member 'ABP_BD_DYN_ConstructionYard::FAnimBlueprintGeneratedConstantData::__EnumProperty_87' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_ConstructionYard::FAnimBlueprintGeneratedConstantData, __ByteProperty_88) == 0x000059, "Member 'ABP_BD_DYN_ConstructionYard::FAnimBlueprintGeneratedConstantData::__ByteProperty_88' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_ConstructionYard::FAnimBlueprintGeneratedConstantData, __NameProperty_89) == 0x00005C, "Member 'ABP_BD_DYN_ConstructionYard::FAnimBlueprintGeneratedConstantData::__NameProperty_89' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_ConstructionYard::FAnimBlueprintGeneratedConstantData, __BlendProfile_90) == 0x000068, "Member 'ABP_BD_DYN_ConstructionYard::FAnimBlueprintGeneratedConstantData::__BlendProfile_90' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_ConstructionYard::FAnimBlueprintGeneratedConstantData, __CurveFloat_91) == 0x000070, "Member 'ABP_BD_DYN_ConstructionYard::FAnimBlueprintGeneratedConstantData::__CurveFloat_91' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_ConstructionYard::FAnimBlueprintGeneratedConstantData, __BoolProperty_92) == 0x000078, "Member 'ABP_BD_DYN_ConstructionYard::FAnimBlueprintGeneratedConstantData::__BoolProperty_92' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_ConstructionYard::FAnimBlueprintGeneratedConstantData, __EnumProperty_93) == 0x000079, "Member 'ABP_BD_DYN_ConstructionYard::FAnimBlueprintGeneratedConstantData::__EnumProperty_93' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_ConstructionYard::FAnimBlueprintGeneratedConstantData, __EnumProperty_94) == 0x00007A, "Member 'ABP_BD_DYN_ConstructionYard::FAnimBlueprintGeneratedConstantData::__EnumProperty_94' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_ConstructionYard::FAnimBlueprintGeneratedConstantData, __ArrayProperty_95) == 0x000080, "Member 'ABP_BD_DYN_ConstructionYard::FAnimBlueprintGeneratedConstantData::__ArrayProperty_95' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_ConstructionYard::FAnimBlueprintGeneratedConstantData, __StructProperty_96) == 0x000090, "Member 'ABP_BD_DYN_ConstructionYard::FAnimBlueprintGeneratedConstantData::__StructProperty_96' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_ConstructionYard::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x0000B0, "Member 'ABP_BD_DYN_ConstructionYard::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_ConstructionYard::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000130, "Member 'ABP_BD_DYN_ConstructionYard::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_ConstructionYard::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root) == 0x000148, "Member 'ABP_BD_DYN_ConstructionYard::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_ConstructionYard::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LayeredBoneBlend) == 0x000178, "Member 'ABP_BD_DYN_ConstructionYard::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LayeredBoneBlend' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_ConstructionYard::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendListByBool_1) == 0x0001A8, "Member 'ABP_BD_DYN_ConstructionYard::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendListByBool_1' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_ConstructionYard::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SaveCachedPose_1) == 0x0001D8, "Member 'ABP_BD_DYN_ConstructionYard::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SaveCachedPose_1' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_ConstructionYard::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Slot_1) == 0x000208, "Member 'ABP_BD_DYN_ConstructionYard::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Slot_1' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_ConstructionYard::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Slot) == 0x000238, "Member 'ABP_BD_DYN_ConstructionYard::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_ConstructionYard::FAnimBlueprintGeneratedConstantData, AnimGraphNode_UseCachedPose_4) == 0x000268, "Member 'ABP_BD_DYN_ConstructionYard::FAnimBlueprintGeneratedConstantData::AnimGraphNode_UseCachedPose_4' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_ConstructionYard::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ApplyAdditive_1) == 0x000298, "Member 'ABP_BD_DYN_ConstructionYard::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ApplyAdditive_1' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_ConstructionYard::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_2) == 0x0002C8, "Member 'ABP_BD_DYN_ConstructionYard::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_ConstructionYard::FAnimBlueprintGeneratedConstantData, AnimGraphNode_UseCachedPose_3) == 0x0002F8, "Member 'ABP_BD_DYN_ConstructionYard::FAnimBlueprintGeneratedConstantData::AnimGraphNode_UseCachedPose_3' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_ConstructionYard::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_1) == 0x000328, "Member 'ABP_BD_DYN_ConstructionYard::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_ConstructionYard::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ApplyAdditive) == 0x000358, "Member 'ABP_BD_DYN_ConstructionYard::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ApplyAdditive' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_ConstructionYard::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer) == 0x000388, "Member 'ABP_BD_DYN_ConstructionYard::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_ConstructionYard::FAnimBlueprintGeneratedConstantData, AnimGraphNode_UseCachedPose_2) == 0x0003B8, "Member 'ABP_BD_DYN_ConstructionYard::FAnimBlueprintGeneratedConstantData::AnimGraphNode_UseCachedPose_2' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_ConstructionYard::FAnimBlueprintGeneratedConstantData, AnimGraphNode_UseCachedPose_1) == 0x0003E8, "Member 'ABP_BD_DYN_ConstructionYard::FAnimBlueprintGeneratedConstantData::AnimGraphNode_UseCachedPose_1' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_ConstructionYard::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendListByBool) == 0x000418, "Member 'ABP_BD_DYN_ConstructionYard::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_ConstructionYard::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SaveCachedPose) == 0x000448, "Member 'ABP_BD_DYN_ConstructionYard::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_ConstructionYard::FAnimBlueprintGeneratedConstantData, AnimGraphNode_UseCachedPose) == 0x000478, "Member 'ABP_BD_DYN_ConstructionYard::FAnimBlueprintGeneratedConstantData::AnimGraphNode_UseCachedPose' has a wrong offset!");

// ScriptStruct ABP_BD_DYN_ConstructionYard.ABP_BD_DYN_ConstructionYard_C.AnimBlueprintGeneratedMutableData
// 0x0002 (0x0003 - 0x0001)
struct ABP_BD_DYN_ConstructionYard::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	bool                                          __BoolProperty;                                    // 0x0001(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_0;                                  // 0x0002(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_BD_DYN_ConstructionYard::FAnimBlueprintGeneratedMutableData) == 0x000001, "Wrong alignment on ABP_BD_DYN_ConstructionYard::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(ABP_BD_DYN_ConstructionYard::FAnimBlueprintGeneratedMutableData) == 0x000003, "Wrong size on ABP_BD_DYN_ConstructionYard::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(ABP_BD_DYN_ConstructionYard::FAnimBlueprintGeneratedMutableData, __BoolProperty) == 0x000001, "Member 'ABP_BD_DYN_ConstructionYard::FAnimBlueprintGeneratedMutableData::__BoolProperty' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_ConstructionYard::FAnimBlueprintGeneratedMutableData, __BoolProperty_0) == 0x000002, "Member 'ABP_BD_DYN_ConstructionYard::FAnimBlueprintGeneratedMutableData::__BoolProperty_0' has a wrong offset!");

}

