#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_BD_GDF_WarFactory

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct ABP_BD_GDF_WarFactory.ABP_BD_GDF_WarFactory_C.AnimBlueprintGeneratedConstantData
// 0x0287 (0x0288 - 0x0001)
struct ABP_BD_GDF_WarFactory::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_32;                                 // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlendProfile*                          __BlendProfile_33;                                 // 0x0010(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_34;                                   // 0x0018(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_35;                                 // 0x0020(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_36;                                 // 0x0021(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_37;                                // 0x0028(0x0010)(BlueprintVisible, EditFixedSize)
	struct FAnimNodeFunctionRef                   __StructProperty_38;                               // 0x0038(0x0020)(BlueprintVisible, NoDestructor)
	bool                                          __BoolProperty_39;                                 // 0x0058(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_40;                                // 0x005C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_41;                               // 0x0060(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_42;                                // 0x008C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_43;                                 // 0x0090(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_44;                                 // 0x0091(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_45;                                 // 0x0092(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_93[0x1];                                       // 0x0093(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_46;                                 // 0x0094(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x00A0(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0120(0x0018)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root;                           // 0x0138(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot;                           // 0x0168(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_1;               // 0x0198(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive;                  // 0x01C8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalRefPose;                   // 0x01F8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool;                // 0x0228(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer;                 // 0x0258(0x0030)()
};
static_assert(alignof(ABP_BD_GDF_WarFactory::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on ABP_BD_GDF_WarFactory::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(ABP_BD_GDF_WarFactory::FAnimBlueprintGeneratedConstantData) == 0x000288, "Wrong size on ABP_BD_GDF_WarFactory::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(ABP_BD_GDF_WarFactory::FAnimBlueprintGeneratedConstantData, __NameProperty_32) == 0x000004, "Member 'ABP_BD_GDF_WarFactory::FAnimBlueprintGeneratedConstantData::__NameProperty_32' has a wrong offset!");
static_assert(offsetof(ABP_BD_GDF_WarFactory::FAnimBlueprintGeneratedConstantData, __BlendProfile_33) == 0x000010, "Member 'ABP_BD_GDF_WarFactory::FAnimBlueprintGeneratedConstantData::__BlendProfile_33' has a wrong offset!");
static_assert(offsetof(ABP_BD_GDF_WarFactory::FAnimBlueprintGeneratedConstantData, __CurveFloat_34) == 0x000018, "Member 'ABP_BD_GDF_WarFactory::FAnimBlueprintGeneratedConstantData::__CurveFloat_34' has a wrong offset!");
static_assert(offsetof(ABP_BD_GDF_WarFactory::FAnimBlueprintGeneratedConstantData, __EnumProperty_35) == 0x000020, "Member 'ABP_BD_GDF_WarFactory::FAnimBlueprintGeneratedConstantData::__EnumProperty_35' has a wrong offset!");
static_assert(offsetof(ABP_BD_GDF_WarFactory::FAnimBlueprintGeneratedConstantData, __EnumProperty_36) == 0x000021, "Member 'ABP_BD_GDF_WarFactory::FAnimBlueprintGeneratedConstantData::__EnumProperty_36' has a wrong offset!");
static_assert(offsetof(ABP_BD_GDF_WarFactory::FAnimBlueprintGeneratedConstantData, __ArrayProperty_37) == 0x000028, "Member 'ABP_BD_GDF_WarFactory::FAnimBlueprintGeneratedConstantData::__ArrayProperty_37' has a wrong offset!");
static_assert(offsetof(ABP_BD_GDF_WarFactory::FAnimBlueprintGeneratedConstantData, __StructProperty_38) == 0x000038, "Member 'ABP_BD_GDF_WarFactory::FAnimBlueprintGeneratedConstantData::__StructProperty_38' has a wrong offset!");
static_assert(offsetof(ABP_BD_GDF_WarFactory::FAnimBlueprintGeneratedConstantData, __BoolProperty_39) == 0x000058, "Member 'ABP_BD_GDF_WarFactory::FAnimBlueprintGeneratedConstantData::__BoolProperty_39' has a wrong offset!");
static_assert(offsetof(ABP_BD_GDF_WarFactory::FAnimBlueprintGeneratedConstantData, __FloatProperty_40) == 0x00005C, "Member 'ABP_BD_GDF_WarFactory::FAnimBlueprintGeneratedConstantData::__FloatProperty_40' has a wrong offset!");
static_assert(offsetof(ABP_BD_GDF_WarFactory::FAnimBlueprintGeneratedConstantData, __StructProperty_41) == 0x000060, "Member 'ABP_BD_GDF_WarFactory::FAnimBlueprintGeneratedConstantData::__StructProperty_41' has a wrong offset!");
static_assert(offsetof(ABP_BD_GDF_WarFactory::FAnimBlueprintGeneratedConstantData, __FloatProperty_42) == 0x00008C, "Member 'ABP_BD_GDF_WarFactory::FAnimBlueprintGeneratedConstantData::__FloatProperty_42' has a wrong offset!");
static_assert(offsetof(ABP_BD_GDF_WarFactory::FAnimBlueprintGeneratedConstantData, __BoolProperty_43) == 0x000090, "Member 'ABP_BD_GDF_WarFactory::FAnimBlueprintGeneratedConstantData::__BoolProperty_43' has a wrong offset!");
static_assert(offsetof(ABP_BD_GDF_WarFactory::FAnimBlueprintGeneratedConstantData, __EnumProperty_44) == 0x000091, "Member 'ABP_BD_GDF_WarFactory::FAnimBlueprintGeneratedConstantData::__EnumProperty_44' has a wrong offset!");
static_assert(offsetof(ABP_BD_GDF_WarFactory::FAnimBlueprintGeneratedConstantData, __ByteProperty_45) == 0x000092, "Member 'ABP_BD_GDF_WarFactory::FAnimBlueprintGeneratedConstantData::__ByteProperty_45' has a wrong offset!");
static_assert(offsetof(ABP_BD_GDF_WarFactory::FAnimBlueprintGeneratedConstantData, __NameProperty_46) == 0x000094, "Member 'ABP_BD_GDF_WarFactory::FAnimBlueprintGeneratedConstantData::__NameProperty_46' has a wrong offset!");
static_assert(offsetof(ABP_BD_GDF_WarFactory::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x0000A0, "Member 'ABP_BD_GDF_WarFactory::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(ABP_BD_GDF_WarFactory::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000120, "Member 'ABP_BD_GDF_WarFactory::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(ABP_BD_GDF_WarFactory::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root) == 0x000138, "Member 'ABP_BD_GDF_WarFactory::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(ABP_BD_GDF_WarFactory::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Slot) == 0x000168, "Member 'ABP_BD_GDF_WarFactory::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(ABP_BD_GDF_WarFactory::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_1) == 0x000198, "Member 'ABP_BD_GDF_WarFactory::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(ABP_BD_GDF_WarFactory::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ApplyAdditive) == 0x0001C8, "Member 'ABP_BD_GDF_WarFactory::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ApplyAdditive' has a wrong offset!");
static_assert(offsetof(ABP_BD_GDF_WarFactory::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LocalRefPose) == 0x0001F8, "Member 'ABP_BD_GDF_WarFactory::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LocalRefPose' has a wrong offset!");
static_assert(offsetof(ABP_BD_GDF_WarFactory::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendListByBool) == 0x000228, "Member 'ABP_BD_GDF_WarFactory::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(ABP_BD_GDF_WarFactory::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer) == 0x000258, "Member 'ABP_BD_GDF_WarFactory::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer' has a wrong offset!");

// ScriptStruct ABP_BD_GDF_WarFactory.ABP_BD_GDF_WarFactory_C.AnimBlueprintGeneratedMutableData
// 0x000F (0x0010 - 0x0001)
struct ABP_BD_GDF_WarFactory::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty;                                   // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_0;                                  // 0x0008(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_1;                                 // 0x000C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_BD_GDF_WarFactory::FAnimBlueprintGeneratedMutableData) == 0x000004, "Wrong alignment on ABP_BD_GDF_WarFactory::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(ABP_BD_GDF_WarFactory::FAnimBlueprintGeneratedMutableData) == 0x000010, "Wrong size on ABP_BD_GDF_WarFactory::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(ABP_BD_GDF_WarFactory::FAnimBlueprintGeneratedMutableData, __FloatProperty) == 0x000004, "Member 'ABP_BD_GDF_WarFactory::FAnimBlueprintGeneratedMutableData::__FloatProperty' has a wrong offset!");
static_assert(offsetof(ABP_BD_GDF_WarFactory::FAnimBlueprintGeneratedMutableData, __BoolProperty_0) == 0x000008, "Member 'ABP_BD_GDF_WarFactory::FAnimBlueprintGeneratedMutableData::__BoolProperty_0' has a wrong offset!");
static_assert(offsetof(ABP_BD_GDF_WarFactory::FAnimBlueprintGeneratedMutableData, __FloatProperty_1) == 0x00000C, "Member 'ABP_BD_GDF_WarFactory::FAnimBlueprintGeneratedMutableData::__FloatProperty_1' has a wrong offset!");

}

