#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_VH_VETI_Vimana

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct ABP_VH_VETI_Vimana.ABP_VH_VETI_Vimana_C.AnimBlueprintGeneratedConstantData
// 0x0287 (0x0288 - 0x0001)
struct ABP_VH_VETI_Vimana::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_41;                                 // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_42;                                // 0x000C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_43;                                 // 0x0010(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_44;                                // 0x0014(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_45;                               // 0x0018(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_46;                                // 0x0044(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_47;                                 // 0x0048(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_48;                                 // 0x0049(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A[0x2];                                       // 0x004A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_49;                                 // 0x004C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlendProfile*                          __BlendProfile_50;                                 // 0x0058(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_51;                                   // 0x0060(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          __BoolProperty_52;                                 // 0x0068(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_53;                                 // 0x0069(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_54;                                 // 0x006A(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6B[0x5];                                       // 0x006B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_55;                                // 0x0070(0x0010)(BlueprintVisible, EditFixedSize)
	struct FAnimNodeFunctionRef                   __StructProperty_56;                               // 0x0080(0x0020)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x00A0(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0120(0x0018)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root;                           // 0x0138(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot;                           // 0x0168(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_2;               // 0x0198(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_1;               // 0x01C8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer;                 // 0x01F8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool;                // 0x0228(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive;                  // 0x0258(0x0030)()
};
static_assert(alignof(ABP_VH_VETI_Vimana::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on ABP_VH_VETI_Vimana::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(ABP_VH_VETI_Vimana::FAnimBlueprintGeneratedConstantData) == 0x000288, "Wrong size on ABP_VH_VETI_Vimana::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(ABP_VH_VETI_Vimana::FAnimBlueprintGeneratedConstantData, __NameProperty_41) == 0x000004, "Member 'ABP_VH_VETI_Vimana::FAnimBlueprintGeneratedConstantData::__NameProperty_41' has a wrong offset!");
static_assert(offsetof(ABP_VH_VETI_Vimana::FAnimBlueprintGeneratedConstantData, __FloatProperty_42) == 0x00000C, "Member 'ABP_VH_VETI_Vimana::FAnimBlueprintGeneratedConstantData::__FloatProperty_42' has a wrong offset!");
static_assert(offsetof(ABP_VH_VETI_Vimana::FAnimBlueprintGeneratedConstantData, __BoolProperty_43) == 0x000010, "Member 'ABP_VH_VETI_Vimana::FAnimBlueprintGeneratedConstantData::__BoolProperty_43' has a wrong offset!");
static_assert(offsetof(ABP_VH_VETI_Vimana::FAnimBlueprintGeneratedConstantData, __FloatProperty_44) == 0x000014, "Member 'ABP_VH_VETI_Vimana::FAnimBlueprintGeneratedConstantData::__FloatProperty_44' has a wrong offset!");
static_assert(offsetof(ABP_VH_VETI_Vimana::FAnimBlueprintGeneratedConstantData, __StructProperty_45) == 0x000018, "Member 'ABP_VH_VETI_Vimana::FAnimBlueprintGeneratedConstantData::__StructProperty_45' has a wrong offset!");
static_assert(offsetof(ABP_VH_VETI_Vimana::FAnimBlueprintGeneratedConstantData, __FloatProperty_46) == 0x000044, "Member 'ABP_VH_VETI_Vimana::FAnimBlueprintGeneratedConstantData::__FloatProperty_46' has a wrong offset!");
static_assert(offsetof(ABP_VH_VETI_Vimana::FAnimBlueprintGeneratedConstantData, __EnumProperty_47) == 0x000048, "Member 'ABP_VH_VETI_Vimana::FAnimBlueprintGeneratedConstantData::__EnumProperty_47' has a wrong offset!");
static_assert(offsetof(ABP_VH_VETI_Vimana::FAnimBlueprintGeneratedConstantData, __ByteProperty_48) == 0x000049, "Member 'ABP_VH_VETI_Vimana::FAnimBlueprintGeneratedConstantData::__ByteProperty_48' has a wrong offset!");
static_assert(offsetof(ABP_VH_VETI_Vimana::FAnimBlueprintGeneratedConstantData, __NameProperty_49) == 0x00004C, "Member 'ABP_VH_VETI_Vimana::FAnimBlueprintGeneratedConstantData::__NameProperty_49' has a wrong offset!");
static_assert(offsetof(ABP_VH_VETI_Vimana::FAnimBlueprintGeneratedConstantData, __BlendProfile_50) == 0x000058, "Member 'ABP_VH_VETI_Vimana::FAnimBlueprintGeneratedConstantData::__BlendProfile_50' has a wrong offset!");
static_assert(offsetof(ABP_VH_VETI_Vimana::FAnimBlueprintGeneratedConstantData, __CurveFloat_51) == 0x000060, "Member 'ABP_VH_VETI_Vimana::FAnimBlueprintGeneratedConstantData::__CurveFloat_51' has a wrong offset!");
static_assert(offsetof(ABP_VH_VETI_Vimana::FAnimBlueprintGeneratedConstantData, __BoolProperty_52) == 0x000068, "Member 'ABP_VH_VETI_Vimana::FAnimBlueprintGeneratedConstantData::__BoolProperty_52' has a wrong offset!");
static_assert(offsetof(ABP_VH_VETI_Vimana::FAnimBlueprintGeneratedConstantData, __EnumProperty_53) == 0x000069, "Member 'ABP_VH_VETI_Vimana::FAnimBlueprintGeneratedConstantData::__EnumProperty_53' has a wrong offset!");
static_assert(offsetof(ABP_VH_VETI_Vimana::FAnimBlueprintGeneratedConstantData, __EnumProperty_54) == 0x00006A, "Member 'ABP_VH_VETI_Vimana::FAnimBlueprintGeneratedConstantData::__EnumProperty_54' has a wrong offset!");
static_assert(offsetof(ABP_VH_VETI_Vimana::FAnimBlueprintGeneratedConstantData, __ArrayProperty_55) == 0x000070, "Member 'ABP_VH_VETI_Vimana::FAnimBlueprintGeneratedConstantData::__ArrayProperty_55' has a wrong offset!");
static_assert(offsetof(ABP_VH_VETI_Vimana::FAnimBlueprintGeneratedConstantData, __StructProperty_56) == 0x000080, "Member 'ABP_VH_VETI_Vimana::FAnimBlueprintGeneratedConstantData::__StructProperty_56' has a wrong offset!");
static_assert(offsetof(ABP_VH_VETI_Vimana::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x0000A0, "Member 'ABP_VH_VETI_Vimana::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(ABP_VH_VETI_Vimana::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000120, "Member 'ABP_VH_VETI_Vimana::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(ABP_VH_VETI_Vimana::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root) == 0x000138, "Member 'ABP_VH_VETI_Vimana::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(ABP_VH_VETI_Vimana::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Slot) == 0x000168, "Member 'ABP_VH_VETI_Vimana::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(ABP_VH_VETI_Vimana::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_2) == 0x000198, "Member 'ABP_VH_VETI_Vimana::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(ABP_VH_VETI_Vimana::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_1) == 0x0001C8, "Member 'ABP_VH_VETI_Vimana::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(ABP_VH_VETI_Vimana::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer) == 0x0001F8, "Member 'ABP_VH_VETI_Vimana::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(ABP_VH_VETI_Vimana::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendListByBool) == 0x000228, "Member 'ABP_VH_VETI_Vimana::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(ABP_VH_VETI_Vimana::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ApplyAdditive) == 0x000258, "Member 'ABP_VH_VETI_Vimana::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ApplyAdditive' has a wrong offset!");

// ScriptStruct ABP_VH_VETI_Vimana.ABP_VH_VETI_Vimana_C.AnimBlueprintGeneratedMutableData
// 0x000B (0x000C - 0x0001)
struct ABP_VH_VETI_Vimana::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty;                                   // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_0;                                  // 0x0008(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_VH_VETI_Vimana::FAnimBlueprintGeneratedMutableData) == 0x000004, "Wrong alignment on ABP_VH_VETI_Vimana::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(ABP_VH_VETI_Vimana::FAnimBlueprintGeneratedMutableData) == 0x00000C, "Wrong size on ABP_VH_VETI_Vimana::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(ABP_VH_VETI_Vimana::FAnimBlueprintGeneratedMutableData, __FloatProperty) == 0x000004, "Member 'ABP_VH_VETI_Vimana::FAnimBlueprintGeneratedMutableData::__FloatProperty' has a wrong offset!");
static_assert(offsetof(ABP_VH_VETI_Vimana::FAnimBlueprintGeneratedMutableData, __BoolProperty_0) == 0x000008, "Member 'ABP_VH_VETI_Vimana::FAnimBlueprintGeneratedMutableData::__BoolProperty_0' has a wrong offset!");

}

