#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_VH_GDF_PeaceKeeper

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function ABP_VH_GDF_PeaceKeeper.ABP_VH_GDF_PeaceKeeper_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct ABP_VH_GDF_PeaceKeeper_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_VH_GDF_PeaceKeeper_C_AnimGraph) == 0x000008, "Wrong alignment on ABP_VH_GDF_PeaceKeeper_C_AnimGraph");
static_assert(sizeof(ABP_VH_GDF_PeaceKeeper_C_AnimGraph) == 0x000010, "Wrong size on ABP_VH_GDF_PeaceKeeper_C_AnimGraph");
static_assert(offsetof(ABP_VH_GDF_PeaceKeeper_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'ABP_VH_GDF_PeaceKeeper_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function ABP_VH_GDF_PeaceKeeper.ABP_VH_GDF_PeaceKeeper_C.ExecuteUbergraph_ABP_VH_GDF_PeaceKeeper
// 0x00B8 (0x00B8 - 0x0000)
struct ABP_VH_GDF_PeaceKeeper_C_ExecuteUbergraph_ABP_VH_GDF_PeaceKeeper final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0070(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_92[0x6];                                       // 0x0092(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast;          // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast_1;        // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Yaw_ImplicitCast;             // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Roll_ImplicitCast;            // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_StructMemberSet_Alpha_ImplicitCast;         // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_VH_GDF_PeaceKeeper_C_ExecuteUbergraph_ABP_VH_GDF_PeaceKeeper) == 0x000008, "Wrong alignment on ABP_VH_GDF_PeaceKeeper_C_ExecuteUbergraph_ABP_VH_GDF_PeaceKeeper");
static_assert(sizeof(ABP_VH_GDF_PeaceKeeper_C_ExecuteUbergraph_ABP_VH_GDF_PeaceKeeper) == 0x0000B8, "Wrong size on ABP_VH_GDF_PeaceKeeper_C_ExecuteUbergraph_ABP_VH_GDF_PeaceKeeper");
static_assert(offsetof(ABP_VH_GDF_PeaceKeeper_C_ExecuteUbergraph_ABP_VH_GDF_PeaceKeeper, EntryPoint) == 0x000000, "Member 'ABP_VH_GDF_PeaceKeeper_C_ExecuteUbergraph_ABP_VH_GDF_PeaceKeeper::EntryPoint' has a wrong offset!");
static_assert(offsetof(ABP_VH_GDF_PeaceKeeper_C_ExecuteUbergraph_ABP_VH_GDF_PeaceKeeper, CallFunc_Not_PreBool_ReturnValue) == 0x000004, "Member 'ABP_VH_GDF_PeaceKeeper_C_ExecuteUbergraph_ABP_VH_GDF_PeaceKeeper::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_VH_GDF_PeaceKeeper_C_ExecuteUbergraph_ABP_VH_GDF_PeaceKeeper, CallFunc_Not_PreBool_ReturnValue_1) == 0x000005, "Member 'ABP_VH_GDF_PeaceKeeper_C_ExecuteUbergraph_ABP_VH_GDF_PeaceKeeper::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_VH_GDF_PeaceKeeper_C_ExecuteUbergraph_ABP_VH_GDF_PeaceKeeper, CallFunc_BreakTransform_Location) == 0x000008, "Member 'ABP_VH_GDF_PeaceKeeper_C_ExecuteUbergraph_ABP_VH_GDF_PeaceKeeper::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(ABP_VH_GDF_PeaceKeeper_C_ExecuteUbergraph_ABP_VH_GDF_PeaceKeeper, CallFunc_BreakTransform_Rotation) == 0x000020, "Member 'ABP_VH_GDF_PeaceKeeper_C_ExecuteUbergraph_ABP_VH_GDF_PeaceKeeper::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(ABP_VH_GDF_PeaceKeeper_C_ExecuteUbergraph_ABP_VH_GDF_PeaceKeeper, CallFunc_BreakTransform_Scale) == 0x000038, "Member 'ABP_VH_GDF_PeaceKeeper_C_ExecuteUbergraph_ABP_VH_GDF_PeaceKeeper::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(ABP_VH_GDF_PeaceKeeper_C_ExecuteUbergraph_ABP_VH_GDF_PeaceKeeper, CallFunc_BooleanAND_ReturnValue) == 0x000050, "Member 'ABP_VH_GDF_PeaceKeeper_C_ExecuteUbergraph_ABP_VH_GDF_PeaceKeeper::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_VH_GDF_PeaceKeeper_C_ExecuteUbergraph_ABP_VH_GDF_PeaceKeeper, CallFunc_BreakRotator_Roll) == 0x000054, "Member 'ABP_VH_GDF_PeaceKeeper_C_ExecuteUbergraph_ABP_VH_GDF_PeaceKeeper::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(ABP_VH_GDF_PeaceKeeper_C_ExecuteUbergraph_ABP_VH_GDF_PeaceKeeper, CallFunc_BreakRotator_Pitch) == 0x000058, "Member 'ABP_VH_GDF_PeaceKeeper_C_ExecuteUbergraph_ABP_VH_GDF_PeaceKeeper::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(ABP_VH_GDF_PeaceKeeper_C_ExecuteUbergraph_ABP_VH_GDF_PeaceKeeper, CallFunc_BreakRotator_Yaw) == 0x00005C, "Member 'ABP_VH_GDF_PeaceKeeper_C_ExecuteUbergraph_ABP_VH_GDF_PeaceKeeper::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(ABP_VH_GDF_PeaceKeeper_C_ExecuteUbergraph_ABP_VH_GDF_PeaceKeeper, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000060, "Member 'ABP_VH_GDF_PeaceKeeper_C_ExecuteUbergraph_ABP_VH_GDF_PeaceKeeper::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_VH_GDF_PeaceKeeper_C_ExecuteUbergraph_ABP_VH_GDF_PeaceKeeper, CallFunc_Add_DoubleDouble_ReturnValue_1) == 0x000068, "Member 'ABP_VH_GDF_PeaceKeeper_C_ExecuteUbergraph_ABP_VH_GDF_PeaceKeeper::CallFunc_Add_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_VH_GDF_PeaceKeeper_C_ExecuteUbergraph_ABP_VH_GDF_PeaceKeeper, CallFunc_MakeRotator_ReturnValue) == 0x000070, "Member 'ABP_VH_GDF_PeaceKeeper_C_ExecuteUbergraph_ABP_VH_GDF_PeaceKeeper::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_VH_GDF_PeaceKeeper_C_ExecuteUbergraph_ABP_VH_GDF_PeaceKeeper, CallFunc_SelectFloat_ReturnValue) == 0x000088, "Member 'ABP_VH_GDF_PeaceKeeper_C_ExecuteUbergraph_ABP_VH_GDF_PeaceKeeper::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_VH_GDF_PeaceKeeper_C_ExecuteUbergraph_ABP_VH_GDF_PeaceKeeper, CallFunc_Not_PreBool_ReturnValue_2) == 0x000090, "Member 'ABP_VH_GDF_PeaceKeeper_C_ExecuteUbergraph_ABP_VH_GDF_PeaceKeeper::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABP_VH_GDF_PeaceKeeper_C_ExecuteUbergraph_ABP_VH_GDF_PeaceKeeper, CallFunc_BooleanAND_ReturnValue_1) == 0x000091, "Member 'ABP_VH_GDF_PeaceKeeper_C_ExecuteUbergraph_ABP_VH_GDF_PeaceKeeper::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_VH_GDF_PeaceKeeper_C_ExecuteUbergraph_ABP_VH_GDF_PeaceKeeper, CallFunc_Add_DoubleDouble_A_ImplicitCast) == 0x000098, "Member 'ABP_VH_GDF_PeaceKeeper_C_ExecuteUbergraph_ABP_VH_GDF_PeaceKeeper::CallFunc_Add_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ABP_VH_GDF_PeaceKeeper_C_ExecuteUbergraph_ABP_VH_GDF_PeaceKeeper, CallFunc_Add_DoubleDouble_A_ImplicitCast_1) == 0x0000A0, "Member 'ABP_VH_GDF_PeaceKeeper_C_ExecuteUbergraph_ABP_VH_GDF_PeaceKeeper::CallFunc_Add_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(ABP_VH_GDF_PeaceKeeper_C_ExecuteUbergraph_ABP_VH_GDF_PeaceKeeper, CallFunc_MakeRotator_Yaw_ImplicitCast) == 0x0000A8, "Member 'ABP_VH_GDF_PeaceKeeper_C_ExecuteUbergraph_ABP_VH_GDF_PeaceKeeper::CallFunc_MakeRotator_Yaw_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ABP_VH_GDF_PeaceKeeper_C_ExecuteUbergraph_ABP_VH_GDF_PeaceKeeper, CallFunc_MakeRotator_Roll_ImplicitCast) == 0x0000AC, "Member 'ABP_VH_GDF_PeaceKeeper_C_ExecuteUbergraph_ABP_VH_GDF_PeaceKeeper::CallFunc_MakeRotator_Roll_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ABP_VH_GDF_PeaceKeeper_C_ExecuteUbergraph_ABP_VH_GDF_PeaceKeeper, K2Node_StructMemberSet_Alpha_ImplicitCast) == 0x0000B0, "Member 'ABP_VH_GDF_PeaceKeeper_C_ExecuteUbergraph_ABP_VH_GDF_PeaceKeeper::K2Node_StructMemberSet_Alpha_ImplicitCast' has a wrong offset!");

}

