#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_BD_GDF_Turret_Haywire

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "Tempest_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_BD_GDF_Turret_Haywire.ABP_BD_GDF_Turret_Haywire_C
// 0x0450 (0x0880 - 0x0430)
class UABP_BD_GDF_Turret_Haywire_C final : public UTedAnimInstance_Structure
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0430(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0438(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0440(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0448(0x0020)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose;                        // 0x0468(0x0010)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x0478(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0498(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_2;                        // 0x04B8(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x05E0(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x0708(0x0128)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x0830(0x0048)()

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_BD_GDF_Turret_Haywire_AnimGraphNode_ModifyBone_AA91B84241B5B90181BE91A979CC785A();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_BD_GDF_Turret_Haywire_AnimGraphNode_ModifyBone_B547D537480F5E0CDD51ADBA9B05CD81();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_BD_GDF_Turret_Haywire_AnimGraphNode_ModifyBone_F4C4A34F471B08B978198C9D3EB4EA7C();
	void ExecuteUbergraph_ABP_BD_GDF_Turret_Haywire(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_BD_GDF_Turret_Haywire_C">();
	}
	static class UABP_BD_GDF_Turret_Haywire_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_BD_GDF_Turret_Haywire_C>();
	}
};
static_assert(alignof(UABP_BD_GDF_Turret_Haywire_C) == 0x000010, "Wrong alignment on UABP_BD_GDF_Turret_Haywire_C");
static_assert(sizeof(UABP_BD_GDF_Turret_Haywire_C) == 0x000880, "Wrong size on UABP_BD_GDF_Turret_Haywire_C");
static_assert(offsetof(UABP_BD_GDF_Turret_Haywire_C, UberGraphFrame) == 0x000430, "Member 'UABP_BD_GDF_Turret_Haywire_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_BD_GDF_Turret_Haywire_C, AnimBlueprintExtension_PropertyAccess) == 0x000438, "Member 'UABP_BD_GDF_Turret_Haywire_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UABP_BD_GDF_Turret_Haywire_C, AnimBlueprintExtension_Base) == 0x000440, "Member 'UABP_BD_GDF_Turret_Haywire_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UABP_BD_GDF_Turret_Haywire_C, AnimGraphNode_Root) == 0x000448, "Member 'UABP_BD_GDF_Turret_Haywire_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_BD_GDF_Turret_Haywire_C, AnimGraphNode_LocalRefPose) == 0x000468, "Member 'UABP_BD_GDF_Turret_Haywire_C::AnimGraphNode_LocalRefPose' has a wrong offset!");
static_assert(offsetof(UABP_BD_GDF_Turret_Haywire_C, AnimGraphNode_LocalToComponentSpace) == 0x000478, "Member 'UABP_BD_GDF_Turret_Haywire_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UABP_BD_GDF_Turret_Haywire_C, AnimGraphNode_ComponentToLocalSpace) == 0x000498, "Member 'UABP_BD_GDF_Turret_Haywire_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UABP_BD_GDF_Turret_Haywire_C, AnimGraphNode_ModifyBone_2) == 0x0004B8, "Member 'UABP_BD_GDF_Turret_Haywire_C::AnimGraphNode_ModifyBone_2' has a wrong offset!");
static_assert(offsetof(UABP_BD_GDF_Turret_Haywire_C, AnimGraphNode_ModifyBone_1) == 0x0005E0, "Member 'UABP_BD_GDF_Turret_Haywire_C::AnimGraphNode_ModifyBone_1' has a wrong offset!");
static_assert(offsetof(UABP_BD_GDF_Turret_Haywire_C, AnimGraphNode_ModifyBone) == 0x000708, "Member 'UABP_BD_GDF_Turret_Haywire_C::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(UABP_BD_GDF_Turret_Haywire_C, AnimGraphNode_Slot) == 0x000830, "Member 'UABP_BD_GDF_Turret_Haywire_C::AnimGraphNode_Slot' has a wrong offset!");

}

