#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_BD_GDF_Barracks

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "ABP_BD_GDF_Barracks_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "Tempest_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_BD_GDF_Barracks.ABP_BD_GDF_Barracks_C
// 0x00E0 (0x0450 - 0x0370)
class UABP_BD_GDF_Barracks_C final : public UAnimInstance
{
public:
	uint8                                         Pad_368[0x8];                                      // 0x0368(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0370(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct ABP_BD_GDF_Barracks::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;          // 0x0378(0x0008)(HasGetValueTypeHash)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0380(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0388(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0390(0x0020)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x03B0(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x03F8(0x0048)()
	bool                                          Powered;                                           // 0x0440(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_BD_GDF_Barracks_AnimGraphNode_SequencePlayer_0237D55D4973D8E77EEE639139DD843E();
	void ExecuteUbergraph_ABP_BD_GDF_Barracks(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_BD_GDF_Barracks_C">();
	}
	static class UABP_BD_GDF_Barracks_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_BD_GDF_Barracks_C>();
	}
};
static_assert(alignof(UABP_BD_GDF_Barracks_C) == 0x000010, "Wrong alignment on UABP_BD_GDF_Barracks_C");
static_assert(sizeof(UABP_BD_GDF_Barracks_C) == 0x000450, "Wrong size on UABP_BD_GDF_Barracks_C");
static_assert(offsetof(UABP_BD_GDF_Barracks_C, UberGraphFrame) == 0x000370, "Member 'UABP_BD_GDF_Barracks_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_BD_GDF_Barracks_C, __AnimBlueprintMutables) == 0x000378, "Member 'UABP_BD_GDF_Barracks_C::__AnimBlueprintMutables' has a wrong offset!");
static_assert(offsetof(UABP_BD_GDF_Barracks_C, AnimBlueprintExtension_PropertyAccess) == 0x000380, "Member 'UABP_BD_GDF_Barracks_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UABP_BD_GDF_Barracks_C, AnimBlueprintExtension_Base) == 0x000388, "Member 'UABP_BD_GDF_Barracks_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UABP_BD_GDF_Barracks_C, AnimGraphNode_Root) == 0x000390, "Member 'UABP_BD_GDF_Barracks_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_BD_GDF_Barracks_C, AnimGraphNode_Slot) == 0x0003B0, "Member 'UABP_BD_GDF_Barracks_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(UABP_BD_GDF_Barracks_C, AnimGraphNode_SequencePlayer) == 0x0003F8, "Member 'UABP_BD_GDF_Barracks_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UABP_BD_GDF_Barracks_C, Powered) == 0x000440, "Member 'UABP_BD_GDF_Barracks_C::Powered' has a wrong offset!");

}

