#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_VH_DYN_VoltaicTank

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "ABP_VH_DYN_VoltaicTank_structs.hpp"
#include "Tempest_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_VH_DYN_VoltaicTank.ABP_VH_DYN_VoltaicTank_C
// 0x0820 (0x0BF0 - 0x03D0)
class UABP_VH_DYN_VoltaicTank_C final : public UTedAnimInstance_Vehicle
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct ABP_VH_DYN_VoltaicTank::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;       // 0x03D8(0x0008)(HasGetValueTypeHash)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x03E0(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x03E8(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x03F0(0x0020)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x0410(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_5;                  // 0x0458(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4;                  // 0x0480(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3;                  // 0x04A8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x04D0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x04F8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x0520(0x0028)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose_1;                      // 0x0548(0x0010)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3;                       // 0x0558(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0x0578(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x05C0(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x05E0(0x0048)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend;                         // 0x0628(0x00C8)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose;                        // 0x06F0(0x0010)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x0700(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x0720(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x0768(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x0788(0x00C8)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive;                       // 0x0850(0x00C8)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x0918(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x0A40(0x0128)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0B68(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x0B88(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0BA8(0x0048)()

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_VH_DYN_VoltaicTank_AnimGraphNode_ModifyBone_7C5912B1456169B61750B8A70F7900F2();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_VH_DYN_VoltaicTank_AnimGraphNode_ModifyBone_DCFCD19E401D1A7E0709BBB68112A584();
	void ExecuteUbergraph_ABP_VH_DYN_VoltaicTank(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_VH_DYN_VoltaicTank_C">();
	}
	static class UABP_VH_DYN_VoltaicTank_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_VH_DYN_VoltaicTank_C>();
	}
};
static_assert(alignof(UABP_VH_DYN_VoltaicTank_C) == 0x000010, "Wrong alignment on UABP_VH_DYN_VoltaicTank_C");
static_assert(sizeof(UABP_VH_DYN_VoltaicTank_C) == 0x000BF0, "Wrong size on UABP_VH_DYN_VoltaicTank_C");
static_assert(offsetof(UABP_VH_DYN_VoltaicTank_C, UberGraphFrame) == 0x0003D0, "Member 'UABP_VH_DYN_VoltaicTank_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_VH_DYN_VoltaicTank_C, __AnimBlueprintMutables) == 0x0003D8, "Member 'UABP_VH_DYN_VoltaicTank_C::__AnimBlueprintMutables' has a wrong offset!");
static_assert(offsetof(UABP_VH_DYN_VoltaicTank_C, AnimBlueprintExtension_PropertyAccess) == 0x0003E0, "Member 'UABP_VH_DYN_VoltaicTank_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UABP_VH_DYN_VoltaicTank_C, AnimBlueprintExtension_Base) == 0x0003E8, "Member 'UABP_VH_DYN_VoltaicTank_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UABP_VH_DYN_VoltaicTank_C, AnimGraphNode_Root) == 0x0003F0, "Member 'UABP_VH_DYN_VoltaicTank_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_VH_DYN_VoltaicTank_C, AnimGraphNode_Slot) == 0x000410, "Member 'UABP_VH_DYN_VoltaicTank_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(UABP_VH_DYN_VoltaicTank_C, AnimGraphNode_TransitionResult_5) == 0x000458, "Member 'UABP_VH_DYN_VoltaicTank_C::AnimGraphNode_TransitionResult_5' has a wrong offset!");
static_assert(offsetof(UABP_VH_DYN_VoltaicTank_C, AnimGraphNode_TransitionResult_4) == 0x000480, "Member 'UABP_VH_DYN_VoltaicTank_C::AnimGraphNode_TransitionResult_4' has a wrong offset!");
static_assert(offsetof(UABP_VH_DYN_VoltaicTank_C, AnimGraphNode_TransitionResult_3) == 0x0004A8, "Member 'UABP_VH_DYN_VoltaicTank_C::AnimGraphNode_TransitionResult_3' has a wrong offset!");
static_assert(offsetof(UABP_VH_DYN_VoltaicTank_C, AnimGraphNode_TransitionResult_2) == 0x0004D0, "Member 'UABP_VH_DYN_VoltaicTank_C::AnimGraphNode_TransitionResult_2' has a wrong offset!");
static_assert(offsetof(UABP_VH_DYN_VoltaicTank_C, AnimGraphNode_TransitionResult_1) == 0x0004F8, "Member 'UABP_VH_DYN_VoltaicTank_C::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(UABP_VH_DYN_VoltaicTank_C, AnimGraphNode_TransitionResult) == 0x000520, "Member 'UABP_VH_DYN_VoltaicTank_C::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(UABP_VH_DYN_VoltaicTank_C, AnimGraphNode_LocalRefPose_1) == 0x000548, "Member 'UABP_VH_DYN_VoltaicTank_C::AnimGraphNode_LocalRefPose_1' has a wrong offset!");
static_assert(offsetof(UABP_VH_DYN_VoltaicTank_C, AnimGraphNode_StateResult_3) == 0x000558, "Member 'UABP_VH_DYN_VoltaicTank_C::AnimGraphNode_StateResult_3' has a wrong offset!");
static_assert(offsetof(UABP_VH_DYN_VoltaicTank_C, AnimGraphNode_SequencePlayer_3) == 0x000578, "Member 'UABP_VH_DYN_VoltaicTank_C::AnimGraphNode_SequencePlayer_3' has a wrong offset!");
static_assert(offsetof(UABP_VH_DYN_VoltaicTank_C, AnimGraphNode_StateResult_2) == 0x0005C0, "Member 'UABP_VH_DYN_VoltaicTank_C::AnimGraphNode_StateResult_2' has a wrong offset!");
static_assert(offsetof(UABP_VH_DYN_VoltaicTank_C, AnimGraphNode_SequencePlayer_2) == 0x0005E0, "Member 'UABP_VH_DYN_VoltaicTank_C::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(UABP_VH_DYN_VoltaicTank_C, AnimGraphNode_TwoWayBlend) == 0x000628, "Member 'UABP_VH_DYN_VoltaicTank_C::AnimGraphNode_TwoWayBlend' has a wrong offset!");
static_assert(offsetof(UABP_VH_DYN_VoltaicTank_C, AnimGraphNode_LocalRefPose) == 0x0006F0, "Member 'UABP_VH_DYN_VoltaicTank_C::AnimGraphNode_LocalRefPose' has a wrong offset!");
static_assert(offsetof(UABP_VH_DYN_VoltaicTank_C, AnimGraphNode_StateResult_1) == 0x000700, "Member 'UABP_VH_DYN_VoltaicTank_C::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(UABP_VH_DYN_VoltaicTank_C, AnimGraphNode_SequencePlayer_1) == 0x000720, "Member 'UABP_VH_DYN_VoltaicTank_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UABP_VH_DYN_VoltaicTank_C, AnimGraphNode_StateResult) == 0x000768, "Member 'UABP_VH_DYN_VoltaicTank_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(UABP_VH_DYN_VoltaicTank_C, AnimGraphNode_StateMachine) == 0x000788, "Member 'UABP_VH_DYN_VoltaicTank_C::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(UABP_VH_DYN_VoltaicTank_C, AnimGraphNode_ApplyAdditive) == 0x000850, "Member 'UABP_VH_DYN_VoltaicTank_C::AnimGraphNode_ApplyAdditive' has a wrong offset!");
static_assert(offsetof(UABP_VH_DYN_VoltaicTank_C, AnimGraphNode_ModifyBone_1) == 0x000918, "Member 'UABP_VH_DYN_VoltaicTank_C::AnimGraphNode_ModifyBone_1' has a wrong offset!");
static_assert(offsetof(UABP_VH_DYN_VoltaicTank_C, AnimGraphNode_ModifyBone) == 0x000A40, "Member 'UABP_VH_DYN_VoltaicTank_C::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(UABP_VH_DYN_VoltaicTank_C, AnimGraphNode_ComponentToLocalSpace) == 0x000B68, "Member 'UABP_VH_DYN_VoltaicTank_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UABP_VH_DYN_VoltaicTank_C, AnimGraphNode_LocalToComponentSpace) == 0x000B88, "Member 'UABP_VH_DYN_VoltaicTank_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UABP_VH_DYN_VoltaicTank_C, AnimGraphNode_SequencePlayer) == 0x000BA8, "Member 'UABP_VH_DYN_VoltaicTank_C::AnimGraphNode_SequencePlayer' has a wrong offset!");

}

