#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimMontageSet

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"


namespace SDK
{

// ScriptStruct AnimMontageSet.AnimMontages
// 0x0010 (0x0010 - 0x0000)
struct FAnimMontages final
{
public:
	TArray<class UAnimMontage*>                   AnimMontages;                                      // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FAnimMontages) == 0x000008, "Wrong alignment on FAnimMontages");
static_assert(sizeof(FAnimMontages) == 0x000010, "Wrong size on FAnimMontages");
static_assert(offsetof(FAnimMontages, AnimMontages) == 0x000000, "Member 'FAnimMontages::AnimMontages' has a wrong offset!");

// ScriptStruct AnimMontageSet.AnimMontageSetData
// 0x0050 (0x0050 - 0x0000)
struct FAnimMontageSetData final
{
public:
	TMap<struct FGameplayTag, struct FAnimMontages> Data;                                            // 0x0000(0x0050)(NativeAccessSpecifierPublic)
};
static_assert(alignof(FAnimMontageSetData) == 0x000008, "Wrong alignment on FAnimMontageSetData");
static_assert(sizeof(FAnimMontageSetData) == 0x000050, "Wrong size on FAnimMontageSetData");
static_assert(offsetof(FAnimMontageSetData, Data) == 0x000000, "Member 'FAnimMontageSetData::Data' has a wrong offset!");

// ScriptStruct AnimMontageSet.AnimMontageSetDataEntry
// 0x0018 (0x0018 - 0x0000)
struct FAnimMontageSetDataEntry final
{
public:
	struct FGameplayTag                           ID;                                                // 0x0000(0x0008)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UAnimMontage*>                   AnimMontages;                                      // 0x0008(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
};
static_assert(alignof(FAnimMontageSetDataEntry) == 0x000008, "Wrong alignment on FAnimMontageSetDataEntry");
static_assert(sizeof(FAnimMontageSetDataEntry) == 0x000018, "Wrong size on FAnimMontageSetDataEntry");
static_assert(offsetof(FAnimMontageSetDataEntry, ID) == 0x000000, "Member 'FAnimMontageSetDataEntry::ID' has a wrong offset!");
static_assert(offsetof(FAnimMontageSetDataEntry, AnimMontages) == 0x000008, "Member 'FAnimMontageSetDataEntry::AnimMontages' has a wrong offset!");

}

