#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AmbientAudioManager

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_AmbientAudioManager.BP_AmbientAudioManager_C.ExecuteUbergraph_BP_AmbientAudioManager
// 0x0010 (0x0010 - 0x0000)
struct BP_AmbientAudioManager_C_ExecuteUbergraph_BP_AmbientAudioManager final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable;                                // 0x0004(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTime;                            // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AmbientAudioManager_C_ExecuteUbergraph_BP_AmbientAudioManager) == 0x000004, "Wrong alignment on BP_AmbientAudioManager_C_ExecuteUbergraph_BP_AmbientAudioManager");
static_assert(sizeof(BP_AmbientAudioManager_C_ExecuteUbergraph_BP_AmbientAudioManager) == 0x000010, "Wrong size on BP_AmbientAudioManager_C_ExecuteUbergraph_BP_AmbientAudioManager");
static_assert(offsetof(BP_AmbientAudioManager_C_ExecuteUbergraph_BP_AmbientAudioManager, EntryPoint) == 0x000000, "Member 'BP_AmbientAudioManager_C_ExecuteUbergraph_BP_AmbientAudioManager::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AmbientAudioManager_C_ExecuteUbergraph_BP_AmbientAudioManager, Temp_name_Variable) == 0x000004, "Member 'BP_AmbientAudioManager_C_ExecuteUbergraph_BP_AmbientAudioManager::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(BP_AmbientAudioManager_C_ExecuteUbergraph_BP_AmbientAudioManager, K2Node_Event_DeltaTime) == 0x00000C, "Member 'BP_AmbientAudioManager_C_ExecuteUbergraph_BP_AmbientAudioManager::K2Node_Event_DeltaTime' has a wrong offset!");

// Function BP_AmbientAudioManager.BP_AmbientAudioManager_C.K2_Tick
// 0x0004 (0x0004 - 0x0000)
struct BP_AmbientAudioManager_C_K2_Tick final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AmbientAudioManager_C_K2_Tick) == 0x000004, "Wrong alignment on BP_AmbientAudioManager_C_K2_Tick");
static_assert(sizeof(BP_AmbientAudioManager_C_K2_Tick) == 0x000004, "Wrong size on BP_AmbientAudioManager_C_K2_Tick");
static_assert(offsetof(BP_AmbientAudioManager_C_K2_Tick, DeltaTime) == 0x000000, "Member 'BP_AmbientAudioManager_C_K2_Tick::DeltaTime' has a wrong offset!");

}

