#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BD_DYN_SalvageCentre

#include "Basic.hpp"

#include "PhysicsCore_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Tempest_structs.hpp"
#include "Tempest_classes.hpp"
#include "SavedGame_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_BD_DYN_SalvageCentre.BP_BD_DYN_SalvageCentre_C
// 0x0130 (0x1B30 - 0x1A00)
class ABP_BD_DYN_SalvageCentre_C final : public ATedStructureBase
{
public:
	uint8                                         Pad_19F8[0x8];                                     // 0x19F8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1A00(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      PS_Salvage_01_RepairTurret_Converted;              // 0x1A08(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      PS_Repair_01_RepairTurret_Converted;               // 0x1A10(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTedRangeDecalComponent*                WeaponRangeDecal;                                  // 0x1A18(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      PS_DustStructurePlacement_01_ParamSize;            // 0x1A20(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_BuildingAmbience_C*                 BP_BuildingAmbience;                               // 0x1A28(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        Decal_SalvageRadius;                               // 0x1A30(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        FireSFX;                                           // 0x1A38(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               PS_OverheatingSmoke2;                              // 0x1A40(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               PS_OverheatingSmoke1;                              // 0x1A48(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_Fire3;                                          // 0x1A50(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_Fire2;                                          // 0x1A58(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_Fire1;                                          // 0x1A60(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   PointLight_2;                                      // 0x1A68(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   PointLight_1;                                      // 0x1A70(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        Decal_RepairRadius;                                // 0x1A78(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          HitBox3;                                           // 0x1A80(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          HitBox2;                                           // 0x1A88(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          HitBox1;                                           // 0x1A90(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         TL_DeactivateAndDestroy_Dissolve_4384CCE24D3C220291F9FEA95E71647F; // 0x1A98(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            TL_DeactivateAndDestroy__Direction_4384CCE24D3C220291F9FEA95E71647F; // 0x1A9C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A9D[0x3];                                     // 0x1A9D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     TL_DeactivateAndDestroy;                           // 0x1AA0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         TL_OnDeath_Dissolve_CB190AB046B398C9CC6BB0B61B8D5636; // 0x1AA8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            TL_OnDeath__Direction_CB190AB046B398C9CC6BB0B61B8D5636; // 0x1AAC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1AAD[0x3];                                     // 0x1AAD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     TL_OnDeath;                                        // 0x1AB0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         TL_Explosion_Dissolve_E4364D114DEB55CD4C0290BE5657B883; // 0x1AB8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TL_Explosion_Explosion_E4364D114DEB55CD4C0290BE5657B883; // 0x1ABC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            TL_Explosion__Direction_E4364D114DEB55CD4C0290BE5657B883; // 0x1AC0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1AC1[0x7];                                     // 0x1AC1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     TL_Explosion;                                      // 0x1AC8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CachedActorLocation;                               // 0x1AD0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FString>                         Explosion_Slot_Array;                              // 0x1AE8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FString                                 Explosion_Slot_Current;                            // 0x1AF8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          Explosion_Slot_Found;                              // 0x1B08(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B09[0x7];                                     // 0x1B09(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Explosion_Strength;                                // 0x1B10(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Explosion_Radius;                                  // 0x1B18(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Explosion_Falloff_Exp;                             // 0x1B20(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bPlacedFromSalvageVan;                             // 0x1B28(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Added_F21874FE4ED330C9BC9ED5BF9860B578();
	void BndEvt__BP_BD_DYN_SalvageCentre_WeaponRangeDecal_K2Node_ComponentBoundEvent_1_RangeDecalDelegate__DelegateSignature();
	void Destructible(TArray<class UStaticMesh*>& DestMeshes, TArray<struct FVector>& DestMeshes_Locations, TArray<struct FRotator>& DestMeshes_Rotators, const struct FVector& MeshScale, TArray<class UFXSystemAsset*>& DestMeshes_exploFX, TArray<double>& DestMeshes_exploFX_Scale, TArray<class UFXSystemAsset*>& DestMeshes_attachedFX, TArray<double>& DestMeshes_attachedFX_Scale, TArray<struct FVector>& DestMeshes_LinearImpulse, TArray<struct FVector>& DestMeshes_AngularImpulse, TArray<class AStaticMeshActor*>* SpawnedMeshesArray, TArray<class UFXSystemComponent*>* SpawnedAttachedFXArray);
	void Destructible_Salvage_Custom_Setup(class USkeletalMeshComponent* Skeletal_Mesh, TArray<class UStaticMesh*>* DestMeshes, TArray<struct FVector>* DestMeshes_Locations, TArray<struct FRotator>* DestMeshes_Rotators, struct FVector* MeshScale, TArray<class UFXSystemAsset*>* DestMeshes_FX, TArray<double>* DestMeshes_FX_Scale, TArray<class UFXSystemAsset*>* DestMeshes_FXattached, TArray<double>* DestMeshes_FXattached_Scale, TArray<struct FVector>* DestMeshes_LinearImpulse, TArray<struct FVector>* DestMeshes_AngularImpulse);
	void ExecuteUbergraph_BP_BD_DYN_SalvageCentre(int32 EntryPoint);
	void Found_Free_Explosion_Slot();
	void K2_OnEndSellingStructure();
	void OnSelectionChanged_Blueprint(const bool bIsSelected, const bool bIsHovered);
	void ReceiveBeginPlay();
	void ReceiveHandlePowerStateVisuals(const bool bBlackedOut, const bool bUserPowered, const bool bSufficientPower);
	void ReceiveOnDeath();
	void ReceiveUpdateHealthEffects(float HealthPct);
	void Removed_3F3E02EE4BC96A8EE8E02691C14A0D21();
	void SetEnabled_RepairVfx(bool bEnabled);
	void SetEnabled_SalvageVfx(bool bEnabled);
	void TL_DeactivateAndDestroy__Deactivate_FX__EventFunc();
	void TL_DeactivateAndDestroy__FinishedFunc();
	void TL_DeactivateAndDestroy__UpdateFunc();
	void TL_Explosion__FinishedFunc();
	void TL_Explosion__UpdateFunc();
	void TL_OnDeath__Explosion__EventFunc();
	void TL_OnDeath__ExplosionAudio__EventFunc();
	void TL_OnDeath__FinishedFunc();
	void TL_OnDeath__SpawnChunks__EventFunc();
	void TL_OnDeath__SpawnDecal__EventFunc();
	void TL_OnDeath__UpdateFunc();
	void UpdateRangeDecal();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_BD_DYN_SalvageCentre_C">();
	}
	static class ABP_BD_DYN_SalvageCentre_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_BD_DYN_SalvageCentre_C>();
	}
};
static_assert(alignof(ABP_BD_DYN_SalvageCentre_C) == 0x000010, "Wrong alignment on ABP_BD_DYN_SalvageCentre_C");
static_assert(sizeof(ABP_BD_DYN_SalvageCentre_C) == 0x001B30, "Wrong size on ABP_BD_DYN_SalvageCentre_C");
static_assert(offsetof(ABP_BD_DYN_SalvageCentre_C, UberGraphFrame) == 0x001A00, "Member 'ABP_BD_DYN_SalvageCentre_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_SalvageCentre_C, PS_Salvage_01_RepairTurret_Converted) == 0x001A08, "Member 'ABP_BD_DYN_SalvageCentre_C::PS_Salvage_01_RepairTurret_Converted' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_SalvageCentre_C, PS_Repair_01_RepairTurret_Converted) == 0x001A10, "Member 'ABP_BD_DYN_SalvageCentre_C::PS_Repair_01_RepairTurret_Converted' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_SalvageCentre_C, WeaponRangeDecal) == 0x001A18, "Member 'ABP_BD_DYN_SalvageCentre_C::WeaponRangeDecal' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_SalvageCentre_C, PS_DustStructurePlacement_01_ParamSize) == 0x001A20, "Member 'ABP_BD_DYN_SalvageCentre_C::PS_DustStructurePlacement_01_ParamSize' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_SalvageCentre_C, BP_BuildingAmbience) == 0x001A28, "Member 'ABP_BD_DYN_SalvageCentre_C::BP_BuildingAmbience' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_SalvageCentre_C, Decal_SalvageRadius) == 0x001A30, "Member 'ABP_BD_DYN_SalvageCentre_C::Decal_SalvageRadius' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_SalvageCentre_C, FireSFX) == 0x001A38, "Member 'ABP_BD_DYN_SalvageCentre_C::FireSFX' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_SalvageCentre_C, PS_OverheatingSmoke2) == 0x001A40, "Member 'ABP_BD_DYN_SalvageCentre_C::PS_OverheatingSmoke2' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_SalvageCentre_C, PS_OverheatingSmoke1) == 0x001A48, "Member 'ABP_BD_DYN_SalvageCentre_C::PS_OverheatingSmoke1' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_SalvageCentre_C, NS_Fire3) == 0x001A50, "Member 'ABP_BD_DYN_SalvageCentre_C::NS_Fire3' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_SalvageCentre_C, NS_Fire2) == 0x001A58, "Member 'ABP_BD_DYN_SalvageCentre_C::NS_Fire2' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_SalvageCentre_C, NS_Fire1) == 0x001A60, "Member 'ABP_BD_DYN_SalvageCentre_C::NS_Fire1' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_SalvageCentre_C, PointLight_2) == 0x001A68, "Member 'ABP_BD_DYN_SalvageCentre_C::PointLight_2' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_SalvageCentre_C, PointLight_1) == 0x001A70, "Member 'ABP_BD_DYN_SalvageCentre_C::PointLight_1' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_SalvageCentre_C, Decal_RepairRadius) == 0x001A78, "Member 'ABP_BD_DYN_SalvageCentre_C::Decal_RepairRadius' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_SalvageCentre_C, HitBox3) == 0x001A80, "Member 'ABP_BD_DYN_SalvageCentre_C::HitBox3' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_SalvageCentre_C, HitBox2) == 0x001A88, "Member 'ABP_BD_DYN_SalvageCentre_C::HitBox2' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_SalvageCentre_C, HitBox1) == 0x001A90, "Member 'ABP_BD_DYN_SalvageCentre_C::HitBox1' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_SalvageCentre_C, TL_DeactivateAndDestroy_Dissolve_4384CCE24D3C220291F9FEA95E71647F) == 0x001A98, "Member 'ABP_BD_DYN_SalvageCentre_C::TL_DeactivateAndDestroy_Dissolve_4384CCE24D3C220291F9FEA95E71647F' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_SalvageCentre_C, TL_DeactivateAndDestroy__Direction_4384CCE24D3C220291F9FEA95E71647F) == 0x001A9C, "Member 'ABP_BD_DYN_SalvageCentre_C::TL_DeactivateAndDestroy__Direction_4384CCE24D3C220291F9FEA95E71647F' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_SalvageCentre_C, TL_DeactivateAndDestroy) == 0x001AA0, "Member 'ABP_BD_DYN_SalvageCentre_C::TL_DeactivateAndDestroy' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_SalvageCentre_C, TL_OnDeath_Dissolve_CB190AB046B398C9CC6BB0B61B8D5636) == 0x001AA8, "Member 'ABP_BD_DYN_SalvageCentre_C::TL_OnDeath_Dissolve_CB190AB046B398C9CC6BB0B61B8D5636' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_SalvageCentre_C, TL_OnDeath__Direction_CB190AB046B398C9CC6BB0B61B8D5636) == 0x001AAC, "Member 'ABP_BD_DYN_SalvageCentre_C::TL_OnDeath__Direction_CB190AB046B398C9CC6BB0B61B8D5636' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_SalvageCentre_C, TL_OnDeath) == 0x001AB0, "Member 'ABP_BD_DYN_SalvageCentre_C::TL_OnDeath' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_SalvageCentre_C, TL_Explosion_Dissolve_E4364D114DEB55CD4C0290BE5657B883) == 0x001AB8, "Member 'ABP_BD_DYN_SalvageCentre_C::TL_Explosion_Dissolve_E4364D114DEB55CD4C0290BE5657B883' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_SalvageCentre_C, TL_Explosion_Explosion_E4364D114DEB55CD4C0290BE5657B883) == 0x001ABC, "Member 'ABP_BD_DYN_SalvageCentre_C::TL_Explosion_Explosion_E4364D114DEB55CD4C0290BE5657B883' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_SalvageCentre_C, TL_Explosion__Direction_E4364D114DEB55CD4C0290BE5657B883) == 0x001AC0, "Member 'ABP_BD_DYN_SalvageCentre_C::TL_Explosion__Direction_E4364D114DEB55CD4C0290BE5657B883' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_SalvageCentre_C, TL_Explosion) == 0x001AC8, "Member 'ABP_BD_DYN_SalvageCentre_C::TL_Explosion' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_SalvageCentre_C, CachedActorLocation) == 0x001AD0, "Member 'ABP_BD_DYN_SalvageCentre_C::CachedActorLocation' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_SalvageCentre_C, Explosion_Slot_Array) == 0x001AE8, "Member 'ABP_BD_DYN_SalvageCentre_C::Explosion_Slot_Array' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_SalvageCentre_C, Explosion_Slot_Current) == 0x001AF8, "Member 'ABP_BD_DYN_SalvageCentre_C::Explosion_Slot_Current' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_SalvageCentre_C, Explosion_Slot_Found) == 0x001B08, "Member 'ABP_BD_DYN_SalvageCentre_C::Explosion_Slot_Found' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_SalvageCentre_C, Explosion_Strength) == 0x001B10, "Member 'ABP_BD_DYN_SalvageCentre_C::Explosion_Strength' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_SalvageCentre_C, Explosion_Radius) == 0x001B18, "Member 'ABP_BD_DYN_SalvageCentre_C::Explosion_Radius' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_SalvageCentre_C, Explosion_Falloff_Exp) == 0x001B20, "Member 'ABP_BD_DYN_SalvageCentre_C::Explosion_Falloff_Exp' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_SalvageCentre_C, bPlacedFromSalvageVan) == 0x001B28, "Member 'ABP_BD_DYN_SalvageCentre_C::bPlacedFromSalvageVan' has a wrong offset!");

}

