#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BD_VETI_DominanceAnchor

#include "Basic.hpp"

#include "PhysicsCore_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SavedGame_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function BP_BD_VETI_DominanceAnchor.BP_BD_VETI_DominanceAnchor_C.ExecuteUbergraph_BP_BD_VETI_DominanceAnchor
// 0x08F8 (0x08F8 - 0x0000)
struct BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_5;                 // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_4;                  // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_6;                 // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_4;                   // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EObjectTypeQuery>                      K2Node_MakeArray_Array;                            // 0x0058(0x0010)(ConstParm, ReferenceParm)
	class UAnimMontage*                           CallFunc_GetCurrentMontage_ReturnValue;            // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_72[0x6];                                       // 0x0072(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0078(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0090(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x00A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_1;          // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x3];                                       // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue;     // 0x00C4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x00E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x00F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_1;          // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0110(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_2;          // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x0128(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_3;          // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_4;              // 0x0140(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_5;              // 0x0150(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_4;          // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_5;          // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESavedGameYesNo                               CallFunc_IsLoadingGame_Output;                     // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0171(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0172(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_173[0x5];                                      // 0x0173(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0178(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_HealthPct;                            // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x0194(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0195(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue_1;          // 0x0196(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue_2;          // 0x0197(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_Array_Get_Item;                           // 0x0198(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue;           // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_7;                 // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B4[0x4];                                      // 0x01B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x01C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector2D                              CallFunc_Conv_VectorToVector2D_ReturnValue;        // 0x01D8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetGroundLocation_ReturnValue;            // 0x01E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Conv_VectorToVector2D_ReturnValue_1;      // 0x0200(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        CallFunc_SpawnDecalAtLocation_ReturnValue;         // 0x0210(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetGroundLocation_ReturnValue_1;          // 0x0218(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFXSystemComponent*                     CallFunc_SpawnEffectAtLocation_ReturnValue;        // 0x0248(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_1;                          // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_1;                          // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_1;                          // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x0270(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item_1;                         // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CallFunc_Array_Get_Item_2;                         // 0x0290(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0298(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x02B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x02B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x02B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2BA[0x2];                                      // 0x02BA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_5;                  // 0x02BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x02C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x02C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C5[0x3];                                      // 0x02C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_8;                 // 0x02C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2CC[0x4];                                      // 0x02CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UNiagaraComponent*>              K2Node_MakeArray_Array_1;                          // 0x02D0(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UNiagaraComponent*                      CallFunc_Array_Get_Item_3;                         // 0x02E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_4;               // 0x02E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_4;                // 0x02EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2ED[0x3];                                      // 0x02ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x02F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CallFunc_Array_Get_Item_4;                         // 0x0308(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_VSize_ReturnValue;                        // 0x0310(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x0318(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x0330(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_5;               // 0x0348(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_5;                // 0x034C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34D[0x3];                                      // 0x034D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0350(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CallFunc_Array_Get_Item_5;                         // 0x0358(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_2;         // 0x0360(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_3;         // 0x0368(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_4;         // 0x0370(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_6;               // 0x0378(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_37C[0x4];                                      // 0x037C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_1;                // 0x0380(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_6;                // 0x0398(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_399[0x7];                                      // 0x0399(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x03A0(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class UStaticMeshComponent*                   CallFunc_Array_Get_Item_6;                         // 0x0498(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_7;               // 0x04A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A4[0x4];                                      // 0x04A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   CallFunc_Array_Get_Item_7;                         // 0x04A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_7;                // 0x04B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B1[0x3];                                      // 0x04B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_8;               // 0x04B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_8;                // 0x04B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B9[0x7];                                      // 0x04B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x04C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_5;                   // 0x04C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4CC[0x4];                                      // 0x04CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_VEase_ReturnValue;                        // 0x04D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Array_Get_Item_8;                         // 0x04E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x04F8(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x05F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable;                              // 0x05F8(0x0008)(ConstParm, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MakeLiteralDouble_ReturnValue;            // 0x0600(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0608(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IssueCommandByType_ReturnValue;           // 0x0610(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_611[0x7];                                      // 0x0611(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_1;      // 0x0618(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0620(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0628(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_5;         // 0x0640(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_2;           // 0x0648(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue_1;        // 0x0660(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0678(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_1;      // 0x0690(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_2;      // 0x06A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_3;           // 0x06C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x06D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6DC[0x4];                                      // 0x06DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UStaticMeshComponent*>           K2Node_MakeArray_Array_2;                          // 0x06E0(0x0010)(ReferenceParm, ContainsInstancedReference)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_6;              // 0x06F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_6;          // 0x0700(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScalarParameterValue_ReturnValue;      // 0x0708(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DoubleDouble_ReturnValue;      // 0x070C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_70D[0x3];                                      // 0x070D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_3;      // 0x0710(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsFogOfWarVisibleForLocalPlayer_ReturnValue; // 0x0718(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0719(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71A[0x6];                                      // 0x071A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSoundAtLocation_ReturnValue;         // 0x0720(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0728(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0729(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x072A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_72B[0x5];                                      // 0x072B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0730(0x0010)(ConstParm, ReferenceParm)
	struct FHitResult                             CallFunc_LineTraceSingleForObjects_OutHit;         // 0x0740(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingleForObjects_ReturnValue;    // 0x0838(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_839[0x7];                                      // 0x0839(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x0840(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPhysicalSurface                              CallFunc_GetSurfaceType_ReturnValue;               // 0x0858(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_859[0x3];                                      // 0x0859(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x085C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue_2;        // 0x0860(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        CallFunc_SpawnDecalAtLocation_ReturnValue_1;       // 0x0878(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast; // 0x0880(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast_1; // 0x0884(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast;         // 0x0888(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast_1;       // 0x0890(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast_2;       // 0x0898(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_LessEqual_DoubleDouble_A_ImplicitCast;    // 0x08A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Roll_ImplicitCast;            // 0x08A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetFloatParameter_Param_ImplicitCast;     // 0x08AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Yaw_ImplicitCast;             // 0x08B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Pitch_ImplicitCast;           // 0x08B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Roll_ImplicitCast_1;          // 0x08B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8BC[0x4];                                      // 0x08BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x08C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VEase_Alpha_ImplicitCast;                 // 0x08C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8CC[0x4];                                      // 0x08CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_B_ImplicitCast;     // 0x08D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValueOnMaterials_ParameterValue_ImplicitCast; // 0x08D8(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValueOnMaterials_ParameterValue_ImplicitCast_1; // 0x08DC(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_EqualEqual_DoubleDouble_A_ImplicitCast;   // 0x08E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast_1;   // 0x08E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast_2; // 0x08F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor) == 0x000008, "Wrong alignment on BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor");
static_assert(sizeof(BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor) == 0x0008F8, "Wrong size on BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor");
static_assert(offsetof(BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor, EntryPoint) == 0x000000, "Member 'BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor, Temp_int_Variable) == 0x000004, "Member 'BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor, Temp_int_Variable_1) == 0x000008, "Member 'BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor, CallFunc_Add_IntInt_ReturnValue_1) == 0x000010, "Member 'BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor, CallFunc_IsValid_ReturnValue) == 0x000014, "Member 'BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor, CallFunc_IsValid_ReturnValue_1) == 0x000015, "Member 'BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor, Temp_int_Array_Index_Variable) == 0x000018, "Member 'BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor, Temp_int_Loop_Counter_Variable) == 0x00001C, "Member 'BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor, CallFunc_Add_IntInt_ReturnValue_2) == 0x000020, "Member 'BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor, Temp_int_Array_Index_Variable_1) == 0x000024, "Member 'BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor, Temp_int_Loop_Counter_Variable_1) == 0x000028, "Member 'BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor, Temp_int_Loop_Counter_Variable_2) == 0x00002C, "Member 'BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor, CallFunc_Add_IntInt_ReturnValue_3) == 0x000030, "Member 'BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor, CallFunc_Add_IntInt_ReturnValue_4) == 0x000034, "Member 'BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor::CallFunc_Add_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor, Temp_int_Array_Index_Variable_2) == 0x000038, "Member 'BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor, Temp_int_Loop_Counter_Variable_3) == 0x00003C, "Member 'BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor::Temp_int_Loop_Counter_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor, Temp_int_Array_Index_Variable_3) == 0x000040, "Member 'BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor::Temp_int_Array_Index_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor, CallFunc_Add_IntInt_ReturnValue_5) == 0x000044, "Member 'BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor::CallFunc_Add_IntInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor, Temp_int_Loop_Counter_Variable_4) == 0x000048, "Member 'BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor::Temp_int_Loop_Counter_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor, CallFunc_Add_IntInt_ReturnValue_6) == 0x00004C, "Member 'BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor::CallFunc_Add_IntInt_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor, Temp_int_Array_Index_Variable_4) == 0x000050, "Member 'BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor::Temp_int_Array_Index_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor, K2Node_MakeArray_Array) == 0x000058, "Member 'BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor, CallFunc_GetCurrentMontage_ReturnValue) == 0x000068, "Member 'BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor::CallFunc_GetCurrentMontage_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor, CallFunc_IsDedicatedServer_ReturnValue) == 0x000070, "Member 'BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000071, "Member 'BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000078, "Member 'BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor, CallFunc_Add_VectorVector_ReturnValue) == 0x000090, "Member 'BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor, CallFunc_Add_VectorVector_ReturnValue_1) == 0x0000A8, "Member 'BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor, CallFunc_IsDedicatedServer_ReturnValue_1) == 0x0000C0, "Member 'BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor::CallFunc_IsDedicatedServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor, CallFunc_Conv_VectorToLinearColor_ReturnValue) == 0x0000C4, "Member 'BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor::CallFunc_Conv_VectorToLinearColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor, CallFunc_Array_Length_ReturnValue) == 0x0000D4, "Member 'BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor, CallFunc_Less_IntInt_ReturnValue) == 0x0000D8, "Member 'BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor, CallFunc_Concat_StrStr_ReturnValue) == 0x0000E0, "Member 'BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor, CallFunc_Conv_StringToName_ReturnValue) == 0x0000F0, "Member 'BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor, CallFunc_Concat_StrStr_ReturnValue_1) == 0x0000F8, "Member 'BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor, CallFunc_Conv_StringToName_ReturnValue_1) == 0x000108, "Member 'BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor::CallFunc_Conv_StringToName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000110, "Member 'BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor, CallFunc_Conv_StringToName_ReturnValue_2) == 0x000120, "Member 'BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor::CallFunc_Conv_StringToName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor, CallFunc_Concat_StrStr_ReturnValue_3) == 0x000128, "Member 'BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor, CallFunc_Conv_StringToName_ReturnValue_3) == 0x000138, "Member 'BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor::CallFunc_Conv_StringToName_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor, CallFunc_Concat_StrStr_ReturnValue_4) == 0x000140, "Member 'BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor::CallFunc_Concat_StrStr_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor, CallFunc_Concat_StrStr_ReturnValue_5) == 0x000150, "Member 'BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor::CallFunc_Concat_StrStr_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor, CallFunc_Conv_StringToName_ReturnValue_4) == 0x000160, "Member 'BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor::CallFunc_Conv_StringToName_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor, CallFunc_Conv_StringToName_ReturnValue_5) == 0x000168, "Member 'BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor::CallFunc_Conv_StringToName_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor, CallFunc_IsLoadingGame_Output) == 0x000170, "Member 'BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor::CallFunc_IsLoadingGame_Output' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor, K2Node_SwitchEnum_CmpSuccess) == 0x000171, "Member 'BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor, CallFunc_HasAuthority_ReturnValue) == 0x000172, "Member 'BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000178, "Member 'BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor, K2Node_Event_HealthPct) == 0x000190, "Member 'BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor::K2Node_Event_HealthPct' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x000194, "Member 'BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000195, "Member 'BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor, CallFunc_Less_DoubleDouble_ReturnValue_1) == 0x000196, "Member 'BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor::CallFunc_Less_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor, CallFunc_Less_DoubleDouble_ReturnValue_2) == 0x000197, "Member 'BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor::CallFunc_Less_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor, CallFunc_Array_Get_Item) == 0x000198, "Member 'BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor, CallFunc_Array_Length_ReturnValue_1) == 0x0001A0, "Member 'BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor, Temp_int_Variable_2) == 0x0001A4, "Member 'BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor, CallFunc_RandomFloatInRange_ReturnValue) == 0x0001A8, "Member 'BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor, CallFunc_Add_IntInt_ReturnValue_7) == 0x0001B0, "Member 'BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor::CallFunc_Add_IntInt_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x0001B8, "Member 'BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor, CallFunc_MakeRotator_ReturnValue) == 0x0001C0, "Member 'BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor, CallFunc_Conv_VectorToVector2D_ReturnValue) == 0x0001D8, "Member 'BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor::CallFunc_Conv_VectorToVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor, CallFunc_GetGroundLocation_ReturnValue) == 0x0001E8, "Member 'BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor::CallFunc_GetGroundLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor, CallFunc_Conv_VectorToVector2D_ReturnValue_1) == 0x000200, "Member 'BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor::CallFunc_Conv_VectorToVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor, CallFunc_SpawnDecalAtLocation_ReturnValue) == 0x000210, "Member 'BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor::CallFunc_SpawnDecalAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor, CallFunc_GetGroundLocation_ReturnValue_1) == 0x000218, "Member 'BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor::CallFunc_GetGroundLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor, CallFunc_BreakVector_X) == 0x000230, "Member 'BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor, CallFunc_BreakVector_Y) == 0x000238, "Member 'BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor, CallFunc_BreakVector_Z) == 0x000240, "Member 'BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor, CallFunc_SpawnEffectAtLocation_ReturnValue) == 0x000248, "Member 'BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor::CallFunc_SpawnEffectAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor, CallFunc_BreakVector_X_1) == 0x000250, "Member 'BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor, CallFunc_BreakVector_Y_1) == 0x000258, "Member 'BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor, CallFunc_BreakVector_Z_1) == 0x000260, "Member 'BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000268, "Member 'BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor, CallFunc_GetSocketLocation_ReturnValue) == 0x000270, "Member 'BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor, CallFunc_Array_Get_Item_1) == 0x000288, "Member 'BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor, CallFunc_Array_Get_Item_2) == 0x000290, "Member 'BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000298, "Member 'BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor, CallFunc_Array_Length_ReturnValue_2) == 0x0002B0, "Member 'BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor, CallFunc_Array_Length_ReturnValue_3) == 0x0002B4, "Member 'BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor, CallFunc_Less_IntInt_ReturnValue_1) == 0x0002B8, "Member 'BP_BD_VETI_DominanceAnchor_C_ExecuteUbergraph_BP_BD_VETI_DominanceAnchor::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
