#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BD_DYN_ConcreteWall

#include "Basic.hpp"

#include "PhysicsCore_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Tempest_structs.hpp"
#include "Tempest_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_BD_DYN_ConcreteWall.BP_BD_DYN_ConcreteWall_C
// 0x0040 (0x1B50 - 0x1B10)
class ABP_BD_DYN_ConcreteWall_C final : public ATedStructureWall
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1B10(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      PS_DustStructurePlacement_01_Tiny;                 // 0x1B18(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         TL_OnDeath_Dissolve_8B33E80D4C425184A94FA2BCCAFBC02B; // 0x1B20(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TL_OnDeath_Dest_Anim_8B33E80D4C425184A94FA2BCCAFBC02B; // 0x1B24(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            TL_OnDeath__Direction_8B33E80D4C425184A94FA2BCCAFBC02B; // 0x1B28(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B29[0x7];                                     // 0x1B29(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     TL_OnDeath;                                        // 0x1B30(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CachedActorLocation;                               // 0x1B38(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_BD_DYN_ConcreteWall(int32 EntryPoint);
	void K2_OnStartProceduralAnim(const ETedNeighborAnim Anim);
	void ReceiveBeginPlay();
	void ReceiveOnDeath();
	void TL_OnDeath__FinishedFunc();
	void TL_OnDeath__UpdateFunc();
	void TL_OnDeath__VFX__EventFunc();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_BD_DYN_ConcreteWall_C">();
	}
	static class ABP_BD_DYN_ConcreteWall_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_BD_DYN_ConcreteWall_C>();
	}
};
static_assert(alignof(ABP_BD_DYN_ConcreteWall_C) == 0x000010, "Wrong alignment on ABP_BD_DYN_ConcreteWall_C");
static_assert(sizeof(ABP_BD_DYN_ConcreteWall_C) == 0x001B50, "Wrong size on ABP_BD_DYN_ConcreteWall_C");
static_assert(offsetof(ABP_BD_DYN_ConcreteWall_C, UberGraphFrame) == 0x001B10, "Member 'ABP_BD_DYN_ConcreteWall_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_ConcreteWall_C, PS_DustStructurePlacement_01_Tiny) == 0x001B18, "Member 'ABP_BD_DYN_ConcreteWall_C::PS_DustStructurePlacement_01_Tiny' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_ConcreteWall_C, TL_OnDeath_Dissolve_8B33E80D4C425184A94FA2BCCAFBC02B) == 0x001B20, "Member 'ABP_BD_DYN_ConcreteWall_C::TL_OnDeath_Dissolve_8B33E80D4C425184A94FA2BCCAFBC02B' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_ConcreteWall_C, TL_OnDeath_Dest_Anim_8B33E80D4C425184A94FA2BCCAFBC02B) == 0x001B24, "Member 'ABP_BD_DYN_ConcreteWall_C::TL_OnDeath_Dest_Anim_8B33E80D4C425184A94FA2BCCAFBC02B' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_ConcreteWall_C, TL_OnDeath__Direction_8B33E80D4C425184A94FA2BCCAFBC02B) == 0x001B28, "Member 'ABP_BD_DYN_ConcreteWall_C::TL_OnDeath__Direction_8B33E80D4C425184A94FA2BCCAFBC02B' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_ConcreteWall_C, TL_OnDeath) == 0x001B30, "Member 'ABP_BD_DYN_ConcreteWall_C::TL_OnDeath' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_ConcreteWall_C, CachedActorLocation) == 0x001B38, "Member 'ABP_BD_DYN_ConcreteWall_C::CachedActorLocation' has a wrong offset!");

}

