#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BD_DYN_Sandbags

#include "Basic.hpp"

#include "PhysicsCore_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Tempest_structs.hpp"
#include "Tempest_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_BD_DYN_Sandbags.BP_BD_DYN_Sandbags_C
// 0x0060 (0x1B70 - 0x1B10)
class ABP_BD_DYN_Sandbags_C final : public ATedStructureWall
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1B10(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   Variations;                                        // 0x1B18(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_Dissolve_A687D8E940C6424A8F798C8104903D9C; // 0x1B20(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_Dest_Anim_A687D8E940C6424A8F798C8104903D9C; // 0x1B24(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_A687D8E940C6424A8F798C8104903D9C; // 0x1B28(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B29[0x7];                                     // 0x1B29(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x1B30(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UStaticMesh*>                    VariationMeshes;                                   // 0x1B38(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          HasBegunPlaying;                                   // 0x1B48(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B49[0x7];                                     // 0x1B49(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Cached_Actor_Location;                             // 0x1B50(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_BD_DYN_Sandbags(int32 EntryPoint);
	void K2_OnRefreshConnections(const struct FTedStructureConnection& InPreset);
	void K2_OnStartProceduralAnim(const ETedNeighborAnim Anim);
	void ReceiveBeginPlay();
	void ReceiveOnDeath();
	void Timeline_0__FinishedFunc();
	void Timeline_0__UpdateFunc();
	void Timeline_0__VFX__EventFunc();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_BD_DYN_Sandbags_C">();
	}
	static class ABP_BD_DYN_Sandbags_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_BD_DYN_Sandbags_C>();
	}
};
static_assert(alignof(ABP_BD_DYN_Sandbags_C) == 0x000010, "Wrong alignment on ABP_BD_DYN_Sandbags_C");
static_assert(sizeof(ABP_BD_DYN_Sandbags_C) == 0x001B70, "Wrong size on ABP_BD_DYN_Sandbags_C");
static_assert(offsetof(ABP_BD_DYN_Sandbags_C, UberGraphFrame) == 0x001B10, "Member 'ABP_BD_DYN_Sandbags_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_Sandbags_C, Variations) == 0x001B18, "Member 'ABP_BD_DYN_Sandbags_C::Variations' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_Sandbags_C, Timeline_0_Dissolve_A687D8E940C6424A8F798C8104903D9C) == 0x001B20, "Member 'ABP_BD_DYN_Sandbags_C::Timeline_0_Dissolve_A687D8E940C6424A8F798C8104903D9C' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_Sandbags_C, Timeline_0_Dest_Anim_A687D8E940C6424A8F798C8104903D9C) == 0x001B24, "Member 'ABP_BD_DYN_Sandbags_C::Timeline_0_Dest_Anim_A687D8E940C6424A8F798C8104903D9C' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_Sandbags_C, Timeline_0__Direction_A687D8E940C6424A8F798C8104903D9C) == 0x001B28, "Member 'ABP_BD_DYN_Sandbags_C::Timeline_0__Direction_A687D8E940C6424A8F798C8104903D9C' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_Sandbags_C, Timeline_0) == 0x001B30, "Member 'ABP_BD_DYN_Sandbags_C::Timeline_0' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_Sandbags_C, VariationMeshes) == 0x001B38, "Member 'ABP_BD_DYN_Sandbags_C::VariationMeshes' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_Sandbags_C, HasBegunPlaying) == 0x001B48, "Member 'ABP_BD_DYN_Sandbags_C::HasBegunPlaying' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_Sandbags_C, Cached_Actor_Location) == 0x001B50, "Member 'ABP_BD_DYN_Sandbags_C::Cached_Actor_Location' has a wrong offset!");

}

