#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BuildingAmbienceActor

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_BuildingAmbienceActor.BP_BuildingAmbienceActor_C
// 0x0028 (0x02B8 - 0x0290)
class ABP_BuildingAmbienceActor_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAudioComponent*                        Building_Ambience;                                 // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Ambience_Sound;                                    // 0x02A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         Current_Count;                                     // 0x02B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Last_Count;                                        // 0x02B4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_BuildingAmbienceActor(int32 EntryPoint);
	void SetCueParameters();
	void Update_Cue_Parameters(int32 Building_Count);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_BuildingAmbienceActor_C">();
	}
	static class ABP_BuildingAmbienceActor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_BuildingAmbienceActor_C>();
	}
};
static_assert(alignof(ABP_BuildingAmbienceActor_C) == 0x000008, "Wrong alignment on ABP_BuildingAmbienceActor_C");
static_assert(sizeof(ABP_BuildingAmbienceActor_C) == 0x0002B8, "Wrong size on ABP_BuildingAmbienceActor_C");
static_assert(offsetof(ABP_BuildingAmbienceActor_C, UberGraphFrame) == 0x000290, "Member 'ABP_BuildingAmbienceActor_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_BuildingAmbienceActor_C, Building_Ambience) == 0x000298, "Member 'ABP_BuildingAmbienceActor_C::Building_Ambience' has a wrong offset!");
static_assert(offsetof(ABP_BuildingAmbienceActor_C, DefaultSceneRoot) == 0x0002A0, "Member 'ABP_BuildingAmbienceActor_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_BuildingAmbienceActor_C, Ambience_Sound) == 0x0002A8, "Member 'ABP_BuildingAmbienceActor_C::Ambience_Sound' has a wrong offset!");
static_assert(offsetof(ABP_BuildingAmbienceActor_C, Current_Count) == 0x0002B0, "Member 'ABP_BuildingAmbienceActor_C::Current_Count' has a wrong offset!");
static_assert(offsetof(ABP_BuildingAmbienceActor_C, Last_Count) == 0x0002B4, "Member 'ABP_BuildingAmbienceActor_C::Last_Count' has a wrong offset!");

}

