#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BD_VETI_WarAssembly

#include "Basic.hpp"

#include "PhysicsCore_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Tempest_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_BD_VETI_WarAssembly.BP_BD_VETI_WarAssembly_C
// 0x0260 (0x1C60 - 0x1A00)
class ABP_BD_VETI_WarAssembly_C final : public ATedStructureUnitFactory
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1A00(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      PS_VETILifebloodBattery;                           // 0x1A08(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      PS_VetiBuildSystemAppearance;                      // 0x1A10(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      PS_VetiBuildSystem_Hole;                           // 0x1A18(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        DamageSFX;                                         // 0x1A20(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      PS_DestPartEffect_3;                               // 0x1A28(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      PS_DestPartEffect_5;                               // 0x1A30(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      PS_DestPartEffect_4;                               // 0x1A38(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      PS_DestPartEffect_2;                               // 0x1A40(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      PS_DestPartEffect_1;                               // 0x1A48(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_VET_WarAssemblyDest_PillarR2;                   // 0x1A50(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_VET_WarAssemblyDest_PillarR1;                   // 0x1A58(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_VET_WarAssemblyDest_PillarL2;                   // 0x1A60(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_VET_WarAssemblyDest_PillarL1;                   // 0x1A68(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_VET_WarAssemblyDest_Crystal;                    // 0x1A70(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               PS_Damage_1;                                       // 0x1A78(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               PS_Damage_3;                                       // 0x1A80(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               PS_Damage_2;                                       // 0x1A88(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               PS_Damage_4;                                       // 0x1A90(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        Decal_RepairRadius;                                // 0x1A98(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      PS_PortalWarAssembly_01_ServitorSpawn;             // 0x1AA0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               PS_GlowBeamVETWarAssembly_01;                      // 0x1AA8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTedUnitSpawnerComponent*               TedUnitSpawner;                                    // 0x1AB0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          HitBox15;                                          // 0x1AB8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          HitBox14;                                          // 0x1AC0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          HitBox13;                                          // 0x1AC8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          HitBox12;                                          // 0x1AD0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          HitBox11;                                          // 0x1AD8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      PS_PortalWarAssembly_01_WorkCompleted;             // 0x1AE0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      PS_PortalWarAssembly_01_Working;                   // 0x1AE8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               PS_SmokeVETWarAssembly_4;                          // 0x1AF0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               PS_SmokeVETWarAssembly_3;                          // 0x1AF8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               PS_SmokeVETWarAssembly_2;                          // 0x1B00(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               PS_SmokeVETWarAssembly_1;                          // 0x1B08(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      PS_PortalWarAssembly_01_Idle;                      // 0x1B10(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          HitBox10;                                          // 0x1B18(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          HitBox8;                                           // 0x1B20(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          HitBox7;                                           // 0x1B28(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          HitBox5;                                           // 0x1B30(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_Pod_Death_2FB6BD014430080DB0A8C18FFF311D98; // 0x1B38(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_Dissolve_Parts_2FB6BD014430080DB0A8C18FFF311D98; // 0x1B3C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_Parts_MoveAway_2FB6BD014430080DB0A8C18FFF311D98; // 0x1B40(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_Vines_Rotting_2FB6BD014430080DB0A8C18FFF311D98; // 0x1B44(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_Dissolve_Main_2FB6BD014430080DB0A8C18FFF311D98; // 0x1B48(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline__Direction_2FB6BD014430080DB0A8C18FFF311D98; // 0x1B4C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B4D[0x3];                                     // 0x1B4D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline;                                          // 0x1B50(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_1_Dissolve_D15494374325812AA6C6408E06EEF924; // 0x1B58(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_1_Explosion_D15494374325812AA6C6408E06EEF924; // 0x1B5C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_1__Direction_D15494374325812AA6C6408E06EEF924; // 0x1B60(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B61[0x7];                                     // 0x1B61(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_1;                                        // 0x1B68(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CachedActorLocation;                               // 0x1B70(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FString>                         Explosion_Slot_Array;                              // 0x1B88(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FString                                 Explosion_Slot_Current;                            // 0x1B98(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          Explosion_Slot_Found;                              // 0x1BA8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1BA9[0x7];                                     // 0x1BA9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Explosion_Strength;                                // 0x1BB0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Explosion_Radius;                                  // 0x1BB8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Explosion_Falloff_Exp;                             // 0x1BC0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          StartedWorking;                                    // 0x1BC8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsEnabled;                                         // 0x1BC9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1BCA[0x6];                                     // 0x1BCA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           BonesToHideNamesArray;                             // 0x1BD0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UStaticMeshComponent*>           DestMeshes;                                        // 0x1BE0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<class UNiagaraComponent*>              DestMeshesVFX;                                     // 0x1BF0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	struct FVector                                DestructionLocation;                               // 0x1C00(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FVector>                        DestMeshesLocationArray;                           // 0x1C18(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FVector>                        DestMeshesLocationTargetArray;                     // 0x1C28(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	double                                        DestMeshesRandomRotationShake;                     // 0x1C38(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CachedSurfaceType;                                 // 0x1C40(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C44[0x4];                                     // 0x1C44(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        DecalVinesSize;                                    // 0x1C48(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        DecalVines;                                        // 0x1C50(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void CustomEvent();
	void ExecuteUbergraph_BP_BD_VETI_WarAssembly(int32 EntryPoint);
	void Found_Free_Explosion_Slot();
	class ATedUnitBase* K2_OnUnitSpawned(class ATedUnitBase* SpawnedUnit);
	void OnReceiveGravityManipulators();
	void OnReceiveLifebloodBattery();
	void OnReceiveRegrowthProtocols();
	void OnReceiveShield();
	void OnReceiveSpecificDeathEnlightened();
	void ReceiveBeginPlay();
	void ReceiveHandleConstructionVisuals(const bool bInConstructing);
	void ReceiveHandlePowerStateVisuals(const bool bBlackedOut, const bool bUserPowered, const bool bSufficientPower);
	void ReceiveOnDeath();
	void ReceiveUpdateHealthEffects(float HealthPct);
	void ServitorDead();
	void Timeline_1__FinishedFunc();
	void Timeline_1__UpdateFunc();
	void Timeline__Explosion_Decal__EventFunc();
	void Timeline__Explosion_TreesShockwave__EventFunc();
	void Timeline__FinishedFunc();
	void Timeline__UpdateFunc();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_BD_VETI_WarAssembly_C">();
	}
	static class ABP_BD_VETI_WarAssembly_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_BD_VETI_WarAssembly_C>();
	}
};
static_assert(alignof(ABP_BD_VETI_WarAssembly_C) == 0x000010, "Wrong alignment on ABP_BD_VETI_WarAssembly_C");
static_assert(sizeof(ABP_BD_VETI_WarAssembly_C) == 0x001C60, "Wrong size on ABP_BD_VETI_WarAssembly_C");
static_assert(offsetof(ABP_BD_VETI_WarAssembly_C, UberGraphFrame) == 0x001A00, "Member 'ABP_BD_VETI_WarAssembly_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_BD_VETI_WarAssembly_C, PS_VETILifebloodBattery) == 0x001A08, "Member 'ABP_BD_VETI_WarAssembly_C::PS_VETILifebloodBattery' has a wrong offset!");
static_assert(offsetof(ABP_BD_VETI_WarAssembly_C, PS_VetiBuildSystemAppearance) == 0x001A10, "Member 'ABP_BD_VETI_WarAssembly_C::PS_VetiBuildSystemAppearance' has a wrong offset!");
static_assert(offsetof(ABP_BD_VETI_WarAssembly_C, PS_VetiBuildSystem_Hole) == 0x001A18, "Member 'ABP_BD_VETI_WarAssembly_C::PS_VetiBuildSystem_Hole' has a wrong offset!");
static_assert(offsetof(ABP_BD_VETI_WarAssembly_C, DamageSFX) == 0x001A20, "Member 'ABP_BD_VETI_WarAssembly_C::DamageSFX' has a wrong offset!");
static_assert(offsetof(ABP_BD_VETI_WarAssembly_C, PS_DestPartEffect_3) == 0x001A28, "Member 'ABP_BD_VETI_WarAssembly_C::PS_DestPartEffect_3' has a wrong offset!");
static_assert(offsetof(ABP_BD_VETI_WarAssembly_C, PS_DestPartEffect_5) == 0x001A30, "Member 'ABP_BD_VETI_WarAssembly_C::PS_DestPartEffect_5' has a wrong offset!");
static_assert(offsetof(ABP_BD_VETI_WarAssembly_C, PS_DestPartEffect_4) == 0x001A38, "Member 'ABP_BD_VETI_WarAssembly_C::PS_DestPartEffect_4' has a wrong offset!");
static_assert(offsetof(ABP_BD_VETI_WarAssembly_C, PS_DestPartEffect_2) == 0x001A40, "Member 'ABP_BD_VETI_WarAssembly_C::PS_DestPartEffect_2' has a wrong offset!");
static_assert(offsetof(ABP_BD_VETI_WarAssembly_C, PS_DestPartEffect_1) == 0x001A48, "Member 'ABP_BD_VETI_WarAssembly_C::PS_DestPartEffect_1' has a wrong offset!");
static_assert(offsetof(ABP_BD_VETI_WarAssembly_C, SM_VET_WarAssemblyDest_PillarR2) == 0x001A50, "Member 'ABP_BD_VETI_WarAssembly_C::SM_VET_WarAssemblyDest_PillarR2' has a wrong offset!");
static_assert(offsetof(ABP_BD_VETI_WarAssembly_C, SM_VET_WarAssemblyDest_PillarR1) == 0x001A58, "Member 'ABP_BD_VETI_WarAssembly_C::SM_VET_WarAssemblyDest_PillarR1' has a wrong offset!");
static_assert(offsetof(ABP_BD_VETI_WarAssembly_C, SM_VET_WarAssemblyDest_PillarL2) == 0x001A60, "Member 'ABP_BD_VETI_WarAssembly_C::SM_VET_WarAssemblyDest_PillarL2' has a wrong offset!");
static_assert(offsetof(ABP_BD_VETI_WarAssembly_C, SM_VET_WarAssemblyDest_PillarL1) == 0x001A68, "Member 'ABP_BD_VETI_WarAssembly_C::SM_VET_WarAssemblyDest_PillarL1' has a wrong offset!");
static_assert(offsetof(ABP_BD_VETI_WarAssembly_C, SM_VET_WarAssemblyDest_Crystal) == 0x001A70, "Member 'ABP_BD_VETI_WarAssembly_C::SM_VET_WarAssemblyDest_Crystal' has a wrong offset!");
static_assert(offsetof(ABP_BD_VETI_WarAssembly_C, PS_Damage_1) == 0x001A78, "Member 'ABP_BD_VETI_WarAssembly_C::PS_Damage_1' has a wrong offset!");
static_assert(offsetof(ABP_BD_VETI_WarAssembly_C, PS_Damage_3) == 0x001A80, "Member 'ABP_BD_VETI_WarAssembly_C::PS_Damage_3' has a wrong offset!");
static_assert(offsetof(ABP_BD_VETI_WarAssembly_C, PS_Damage_2) == 0x001A88, "Member 'ABP_BD_VETI_WarAssembly_C::PS_Damage_2' has a wrong offset!");
static_assert(offsetof(ABP_BD_VETI_WarAssembly_C, PS_Damage_4) == 0x001A90, "Member 'ABP_BD_VETI_WarAssembly_C::PS_Damage_4' has a wrong offset!");
static_assert(offsetof(ABP_BD_VETI_WarAssembly_C, Decal_RepairRadius) == 0x001A98, "Member 'ABP_BD_VETI_WarAssembly_C::Decal_RepairRadius' has a wrong offset!");
static_assert(offsetof(ABP_BD_VETI_WarAssembly_C, PS_PortalWarAssembly_01_ServitorSpawn) == 0x001AA0, "Member 'ABP_BD_VETI_WarAssembly_C::PS_PortalWarAssembly_01_ServitorSpawn' has a wrong offset!");
static_assert(offsetof(ABP_BD_VETI_WarAssembly_C, PS_GlowBeamVETWarAssembly_01) == 0x001AA8, "Member 'ABP_BD_VETI_WarAssembly_C::PS_GlowBeamVETWarAssembly_01' has a wrong offset!");
static_assert(offsetof(ABP_BD_VETI_WarAssembly_C, TedUnitSpawner) == 0x001AB0, "Member 'ABP_BD_VETI_WarAssembly_C::TedUnitSpawner' has a wrong offset!");
static_assert(offsetof(ABP_BD_VETI_WarAssembly_C, HitBox15) == 0x001AB8, "Member 'ABP_BD_VETI_WarAssembly_C::HitBox15' has a wrong offset!");
static_assert(offsetof(ABP_BD_VETI_WarAssembly_C, HitBox14) == 0x001AC0, "Member 'ABP_BD_VETI_WarAssembly_C::HitBox14' has a wrong offset!");
static_assert(offsetof(ABP_BD_VETI_WarAssembly_C, HitBox13) == 0x001AC8, "Member 'ABP_BD_VETI_WarAssembly_C::HitBox13' has a wrong offset!");
static_assert(offsetof(ABP_BD_VETI_WarAssembly_C, HitBox12) == 0x001AD0, "Member 'ABP_BD_VETI_WarAssembly_C::HitBox12' has a wrong offset!");
static_assert(offsetof(ABP_BD_VETI_WarAssembly_C, HitBox11) == 0x001AD8, "Member 'ABP_BD_VETI_WarAssembly_C::HitBox11' has a wrong offset!");
static_assert(offsetof(ABP_BD_VETI_WarAssembly_C, PS_PortalWarAssembly_01_WorkCompleted) == 0x001AE0, "Member 'ABP_BD_VETI_WarAssembly_C::PS_PortalWarAssembly_01_WorkCompleted' has a wrong offset!");
static_assert(offsetof(ABP_BD_VETI_WarAssembly_C, PS_PortalWarAssembly_01_Working) == 0x001AE8, "Member 'ABP_BD_VETI_WarAssembly_C::PS_PortalWarAssembly_01_Working' has a wrong offset!");
static_assert(offsetof(ABP_BD_VETI_WarAssembly_C, PS_SmokeVETWarAssembly_4) == 0x001AF0, "Member 'ABP_BD_VETI_WarAssembly_C::PS_SmokeVETWarAssembly_4' has a wrong offset!");
static_assert(offsetof(ABP_BD_VETI_WarAssembly_C, PS_SmokeVETWarAssembly_3) == 0x001AF8, "Member 'ABP_BD_VETI_WarAssembly_C::PS_SmokeVETWarAssembly_3' has a wrong offset!");
static_assert(offsetof(ABP_BD_VETI_WarAssembly_C, PS_SmokeVETWarAssembly_2) == 0x001B00, "Member 'ABP_BD_VETI_WarAssembly_C::PS_SmokeVETWarAssembly_2' has a wrong offset!");
static_assert(offsetof(ABP_BD_VETI_WarAssembly_C, PS_SmokeVETWarAssembly_1) == 0x001B08, "Member 'ABP_BD_VETI_WarAssembly_C::PS_SmokeVETWarAssembly_1' has a wrong offset!");
static_assert(offsetof(ABP_BD_VETI_WarAssembly_C, PS_PortalWarAssembly_01_Idle) == 0x001B10, "Member 'ABP_BD_VETI_WarAssembly_C::PS_PortalWarAssembly_01_Idle' has a wrong offset!");
static_assert(offsetof(ABP_BD_VETI_WarAssembly_C, HitBox10) == 0x001B18, "Member 'ABP_BD_VETI_WarAssembly_C::HitBox10' has a wrong offset!");
static_assert(offsetof(ABP_BD_VETI_WarAssembly_C, HitBox8) == 0x001B20, "Member 'ABP_BD_VETI_WarAssembly_C::HitBox8' has a wrong offset!");
static_assert(offsetof(ABP_BD_VETI_WarAssembly_C, HitBox7) == 0x001B28, "Member 'ABP_BD_VETI_WarAssembly_C::HitBox7' has a wrong offset!");
static_assert(offsetof(ABP_BD_VETI_WarAssembly_C, HitBox5) == 0x001B30, "Member 'ABP_BD_VETI_WarAssembly_C::HitBox5' has a wrong offset!");
static_assert(offsetof(ABP_BD_VETI_WarAssembly_C, Timeline_Pod_Death_2FB6BD014430080DB0A8C18FFF311D98) == 0x001B38, "Member 'ABP_BD_VETI_WarAssembly_C::Timeline_Pod_Death_2FB6BD014430080DB0A8C18FFF311D98' has a wrong offset!");
static_assert(offsetof(ABP_BD_VETI_WarAssembly_C, Timeline_Dissolve_Parts_2FB6BD014430080DB0A8C18FFF311D98) == 0x001B3C, "Member 'ABP_BD_VETI_WarAssembly_C::Timeline_Dissolve_Parts_2FB6BD014430080DB0A8C18FFF311D98' has a wrong offset!");
static_assert(offsetof(ABP_BD_VETI_WarAssembly_C, Timeline_Parts_MoveAway_2FB6BD014430080DB0A8C18FFF311D98) == 0x001B40, "Member 'ABP_BD_VETI_WarAssembly_C::Timeline_Parts_MoveAway_2FB6BD014430080DB0A8C18FFF311D98' has a wrong offset!");
static_assert(offsetof(ABP_BD_VETI_WarAssembly_C, Timeline_Vines_Rotting_2FB6BD014430080DB0A8C18FFF311D98) == 0x001B44, "Member 'ABP_BD_VETI_WarAssembly_C::Timeline_Vines_Rotting_2FB6BD014430080DB0A8C18FFF311D98' has a wrong offset!");
static_assert(offsetof(ABP_BD_VETI_WarAssembly_C, Timeline_Dissolve_Main_2FB6BD014430080DB0A8C18FFF311D98) == 0x001B48, "Member 'ABP_BD_VETI_WarAssembly_C::Timeline_Dissolve_Main_2FB6BD014430080DB0A8C18FFF311D98' has a wrong offset!");
static_assert(offsetof(ABP_BD_VETI_WarAssembly_C, Timeline__Direction_2FB6BD014430080DB0A8C18FFF311D98) == 0x001B4C, "Member 'ABP_BD_VETI_WarAssembly_C::Timeline__Direction_2FB6BD014430080DB0A8C18FFF311D98' has a wrong offset!");
static_assert(offsetof(ABP_BD_VETI_WarAssembly_C, Timeline) == 0x001B50, "Member 'ABP_BD_VETI_WarAssembly_C::Timeline' has a wrong offset!");
static_assert(offsetof(ABP_BD_VETI_WarAssembly_C, Timeline_1_Dissolve_D15494374325812AA6C6408E06EEF924) == 0x001B58, "Member 'ABP_BD_VETI_WarAssembly_C::Timeline_1_Dissolve_D15494374325812AA6C6408E06EEF924' has a wrong offset!");
static_assert(offsetof(ABP_BD_VETI_WarAssembly_C, Timeline_1_Explosion_D15494374325812AA6C6408E06EEF924) == 0x001B5C, "Member 'ABP_BD_VETI_WarAssembly_C::Timeline_1_Explosion_D15494374325812AA6C6408E06EEF924' has a wrong offset!");
static_assert(offsetof(ABP_BD_VETI_WarAssembly_C, Timeline_1__Direction_D15494374325812AA6C6408E06EEF924) == 0x001B60, "Member 'ABP_BD_VETI_WarAssembly_C::Timeline_1__Direction_D15494374325812AA6C6408E06EEF924' has a wrong offset!");
static_assert(offsetof(ABP_BD_VETI_WarAssembly_C, Timeline_1) == 0x001B68, "Member 'ABP_BD_VETI_WarAssembly_C::Timeline_1' has a wrong offset!");
static_assert(offsetof(ABP_BD_VETI_WarAssembly_C, CachedActorLocation) == 0x001B70, "Member 'ABP_BD_VETI_WarAssembly_C::CachedActorLocation' has a wrong offset!");
static_assert(offsetof(ABP_BD_VETI_WarAssembly_C, Explosion_Slot_Array) == 0x001B88, "Member 'ABP_BD_VETI_WarAssembly_C::Explosion_Slot_Array' has a wrong offset!");
static_assert(offsetof(ABP_BD_VETI_WarAssembly_C, Explosion_Slot_Current) == 0x001B98, "Member 'ABP_BD_VETI_WarAssembly_C::Explosion_Slot_Current' has a wrong offset!");
static_assert(offsetof(ABP_BD_VETI_WarAssembly_C, Explosion_Slot_Found) == 0x001BA8, "Member 'ABP_BD_VETI_WarAssembly_C::Explosion_Slot_Found' has a wrong offset!");
static_assert(offsetof(ABP_BD_VETI_WarAssembly_C, Explosion_Strength) == 0x001BB0, "Member 'ABP_BD_VETI_WarAssembly_C::Explosion_Strength' has a wrong offset!");
static_assert(offsetof(ABP_BD_VETI_WarAssembly_C, Explosion_Radius) == 0x001BB8, "Member 'ABP_BD_VETI_WarAssembly_C::Explosion_Radius' has a wrong offset!");
static_assert(offsetof(ABP_BD_VETI_WarAssembly_C, Explosion_Falloff_Exp) == 0x001BC0, "Member 'ABP_BD_VETI_WarAssembly_C::Explosion_Falloff_Exp' has a wrong offset!");
static_assert(offsetof(ABP_BD_VETI_WarAssembly_C, StartedWorking) == 0x001BC8, "Member 'ABP_BD_VETI_WarAssembly_C::StartedWorking' has a wrong offset!");
static_assert(offsetof(ABP_BD_VETI_WarAssembly_C, IsEnabled) == 0x001BC9, "Member 'ABP_BD_VETI_WarAssembly_C::IsEnabled' has a wrong offset!");
static_assert(offsetof(ABP_BD_VETI_WarAssembly_C, BonesToHideNamesArray) == 0x001BD0, "Member 'ABP_BD_VETI_WarAssembly_C::BonesToHideNamesArray' has a wrong offset!");
static_assert(offsetof(ABP_BD_VETI_WarAssembly_C, DestMeshes) == 0x001BE0, "Member 'ABP_BD_VETI_WarAssembly_C::DestMeshes' has a wrong offset!");
static_assert(offsetof(ABP_BD_VETI_WarAssembly_C, DestMeshesVFX) == 0x001BF0, "Member 'ABP_BD_VETI_WarAssembly_C::DestMeshesVFX' has a wrong offset!");
static_assert(offsetof(ABP_BD_VETI_WarAssembly_C, DestructionLocation) == 0x001C00, "Member 'ABP_BD_VETI_WarAssembly_C::DestructionLocation' has a wrong offset!");
static_assert(offsetof(ABP_BD_VETI_WarAssembly_C, DestMeshesLocationArray) == 0x001C18, "Member 'ABP_BD_VETI_WarAssembly_C::DestMeshesLocationArray' has a wrong offset!");
static_assert(offsetof(ABP_BD_VETI_WarAssembly_C, DestMeshesLocationTargetArray) == 0x001C28, "Member 'ABP_BD_VETI_WarAssembly_C::DestMeshesLocationTargetArray' has a wrong offset!");
static_assert(offsetof(ABP_BD_VETI_WarAssembly_C, DestMeshesRandomRotationShake) == 0x001C38, "Member 'ABP_BD_VETI_WarAssembly_C::DestMeshesRandomRotationShake' has a wrong offset!");
static_assert(offsetof(ABP_BD_VETI_WarAssembly_C, CachedSurfaceType) == 0x001C40, "Member 'ABP_BD_VETI_WarAssembly_C::CachedSurfaceType' has a wrong offset!");
static_assert(offsetof(ABP_BD_VETI_WarAssembly_C, DecalVinesSize) == 0x001C48, "Member 'ABP_BD_VETI_WarAssembly_C::DecalVinesSize' has a wrong offset!");
static_assert(offsetof(ABP_BD_VETI_WarAssembly_C, DecalVines) == 0x001C50, "Member 'ABP_BD_VETI_WarAssembly_C::DecalVines' has a wrong offset!");

}

