#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BuildingAmbienceManager

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_BuildingAmbienceManager.BP_BuildingAmbienceManager_C.ExecuteUbergraph_BP_BuildingAmbienceManager
// 0x0004 (0x0004 - 0x0000)
struct BP_BuildingAmbienceManager_C_ExecuteUbergraph_BP_BuildingAmbienceManager final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BuildingAmbienceManager_C_ExecuteUbergraph_BP_BuildingAmbienceManager) == 0x000004, "Wrong alignment on BP_BuildingAmbienceManager_C_ExecuteUbergraph_BP_BuildingAmbienceManager");
static_assert(sizeof(BP_BuildingAmbienceManager_C_ExecuteUbergraph_BP_BuildingAmbienceManager) == 0x000004, "Wrong size on BP_BuildingAmbienceManager_C_ExecuteUbergraph_BP_BuildingAmbienceManager");
static_assert(offsetof(BP_BuildingAmbienceManager_C_ExecuteUbergraph_BP_BuildingAmbienceManager, EntryPoint) == 0x000000, "Member 'BP_BuildingAmbienceManager_C_ExecuteUbergraph_BP_BuildingAmbienceManager::EntryPoint' has a wrong offset!");

// Function BP_BuildingAmbienceManager.BP_BuildingAmbienceManager_C.FindNearestBuildingAmbienceActor
// 0x0070 (0x0070 - 0x0000)
struct BP_BuildingAmbienceManager_C_FindNearestBuildingAmbienceActor final
{
public:
	class AActor*                                 Building_Caller_0;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_BuildingAmbienceActor_C*            Closest_Actor_0;                                   // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDistanceTo_ReturnValue;                // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_BuildingAmbienceActor_C*>    CallFunc_GetAllActorsOfClass_OutActors;            // 0x0028(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_BuildingAmbienceActor_C*            CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetDistanceTo_ReturnValue_1;              // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_BuildingAmbienceActor_C*            CallFunc_Array_Get_Item_1;                         // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Less_DoubleDouble_B_ImplicitCast;         // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast;         // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BuildingAmbienceManager_C_FindNearestBuildingAmbienceActor) == 0x000008, "Wrong alignment on BP_BuildingAmbienceManager_C_FindNearestBuildingAmbienceActor");
static_assert(sizeof(BP_BuildingAmbienceManager_C_FindNearestBuildingAmbienceActor) == 0x000070, "Wrong size on BP_BuildingAmbienceManager_C_FindNearestBuildingAmbienceActor");
static_assert(offsetof(BP_BuildingAmbienceManager_C_FindNearestBuildingAmbienceActor, Building_Caller_0) == 0x000000, "Member 'BP_BuildingAmbienceManager_C_FindNearestBuildingAmbienceActor::Building_Caller_0' has a wrong offset!");
static_assert(offsetof(BP_BuildingAmbienceManager_C_FindNearestBuildingAmbienceActor, Closest_Actor_0) == 0x000008, "Member 'BP_BuildingAmbienceManager_C_FindNearestBuildingAmbienceActor::Closest_Actor_0' has a wrong offset!");
static_assert(offsetof(BP_BuildingAmbienceManager_C_FindNearestBuildingAmbienceActor, Temp_int_Loop_Counter_Variable) == 0x000010, "Member 'BP_BuildingAmbienceManager_C_FindNearestBuildingAmbienceActor::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_BuildingAmbienceManager_C_FindNearestBuildingAmbienceActor, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'BP_BuildingAmbienceManager_C_FindNearestBuildingAmbienceActor::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BuildingAmbienceManager_C_FindNearestBuildingAmbienceActor, Temp_int_Array_Index_Variable) == 0x000018, "Member 'BP_BuildingAmbienceManager_C_FindNearestBuildingAmbienceActor::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_BuildingAmbienceManager_C_FindNearestBuildingAmbienceActor, CallFunc_GetDistanceTo_ReturnValue) == 0x00001C, "Member 'BP_BuildingAmbienceManager_C_FindNearestBuildingAmbienceActor::CallFunc_GetDistanceTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BuildingAmbienceManager_C_FindNearestBuildingAmbienceActor, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000020, "Member 'BP_BuildingAmbienceManager_C_FindNearestBuildingAmbienceActor::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BuildingAmbienceManager_C_FindNearestBuildingAmbienceActor, CallFunc_GetAllActorsOfClass_OutActors) == 0x000028, "Member 'BP_BuildingAmbienceManager_C_FindNearestBuildingAmbienceActor::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(BP_BuildingAmbienceManager_C_FindNearestBuildingAmbienceActor, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'BP_BuildingAmbienceManager_C_FindNearestBuildingAmbienceActor::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BuildingAmbienceManager_C_FindNearestBuildingAmbienceActor, CallFunc_Array_Get_Item) == 0x000040, "Member 'BP_BuildingAmbienceManager_C_FindNearestBuildingAmbienceActor::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_BuildingAmbienceManager_C_FindNearestBuildingAmbienceActor, CallFunc_Less_IntInt_ReturnValue) == 0x000048, "Member 'BP_BuildingAmbienceManager_C_FindNearestBuildingAmbienceActor::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BuildingAmbienceManager_C_FindNearestBuildingAmbienceActor, CallFunc_GetDistanceTo_ReturnValue_1) == 0x00004C, "Member 'BP_BuildingAmbienceManager_C_FindNearestBuildingAmbienceActor::CallFunc_GetDistanceTo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BuildingAmbienceManager_C_FindNearestBuildingAmbienceActor, CallFunc_Array_Get_Item_1) == 0x000050, "Member 'BP_BuildingAmbienceManager_C_FindNearestBuildingAmbienceActor::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_BuildingAmbienceManager_C_FindNearestBuildingAmbienceActor, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000058, "Member 'BP_BuildingAmbienceManager_C_FindNearestBuildingAmbienceActor::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BuildingAmbienceManager_C_FindNearestBuildingAmbienceActor, CallFunc_Less_DoubleDouble_B_ImplicitCast) == 0x000060, "Member 'BP_BuildingAmbienceManager_C_FindNearestBuildingAmbienceActor::CallFunc_Less_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_BuildingAmbienceManager_C_FindNearestBuildingAmbienceActor, CallFunc_Less_DoubleDouble_A_ImplicitCast) == 0x000068, "Member 'BP_BuildingAmbienceManager_C_FindNearestBuildingAmbienceActor::CallFunc_Less_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function BP_BuildingAmbienceManager.BP_BuildingAmbienceManager_C.FindStructuresWithinRange
// 0x00B8 (0x00B8 - 0x0000)
struct BP_BuildingAmbienceManager_C_FindStructuresWithinRange final
{
public:
	class ABP_BuildingAmbienceActor_C*            Actor_Location;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FVector>                        Structures_In_Range;                               // 0x0008(0x0010)(Parm, OutParm)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<class ATedPawn*>                       CallFunc_GetPawnsInRange_OutPawns;                 // 0x0040(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATedPawn*                               CallFunc_Array_Get_Item;                           // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_BuildingAmbience_C*                 CallFunc_GetComponentByClass_ReturnValue;          // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0080(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x3];                                       // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsEmpty_ReturnValue;                // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetPawnsInRange_Radius_ImplicitCast;      // 0x00B0(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BuildingAmbienceManager_C_FindStructuresWithinRange) == 0x000008, "Wrong alignment on BP_BuildingAmbienceManager_C_FindStructuresWithinRange");
static_assert(sizeof(BP_BuildingAmbienceManager_C_FindStructuresWithinRange) == 0x0000B8, "Wrong size on BP_BuildingAmbienceManager_C_FindStructuresWithinRange");
static_assert(offsetof(BP_BuildingAmbienceManager_C_FindStructuresWithinRange, Actor_Location) == 0x000000, "Member 'BP_BuildingAmbienceManager_C_FindStructuresWithinRange::Actor_Location' has a wrong offset!");
static_assert(offsetof(BP_BuildingAmbienceManager_C_FindStructuresWithinRange, Structures_In_Range) == 0x000008, "Member 'BP_BuildingAmbienceManager_C_FindStructuresWithinRange::Structures_In_Range' has a wrong offset!");
static_assert(offsetof(BP_BuildingAmbienceManager_C_FindStructuresWithinRange, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000018, "Member 'BP_BuildingAmbienceManager_C_FindStructuresWithinRange::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BuildingAmbienceManager_C_FindStructuresWithinRange, CallFunc_GetDisplayName_ReturnValue) == 0x000030, "Member 'BP_BuildingAmbienceManager_C_FindStructuresWithinRange::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BuildingAmbienceManager_C_FindStructuresWithinRange, CallFunc_GetPawnsInRange_OutPawns) == 0x000040, "Member 'BP_BuildingAmbienceManager_C_FindStructuresWithinRange::CallFunc_GetPawnsInRange_OutPawns' has a wrong offset!");
static_assert(offsetof(BP_BuildingAmbienceManager_C_FindStructuresWithinRange, CallFunc_Array_Length_ReturnValue) == 0x000050, "Member 'BP_BuildingAmbienceManager_C_FindStructuresWithinRange::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BuildingAmbienceManager_C_FindStructuresWithinRange, CallFunc_IsDedicatedServer_ReturnValue) == 0x000054, "Member 'BP_BuildingAmbienceManager_C_FindStructuresWithinRange::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BuildingAmbienceManager_C_FindStructuresWithinRange, Temp_int_Array_Index_Variable) == 0x000058, "Member 'BP_BuildingAmbienceManager_C_FindStructuresWithinRange::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_BuildingAmbienceManager_C_FindStructuresWithinRange, CallFunc_Array_Get_Item) == 0x000060, "Member 'BP_BuildingAmbienceManager_C_FindStructuresWithinRange::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_BuildingAmbienceManager_C_FindStructuresWithinRange, CallFunc_GetComponentByClass_ReturnValue) == 0x000068, "Member 'BP_BuildingAmbienceManager_C_FindStructuresWithinRange::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BuildingAmbienceManager_C_FindStructuresWithinRange, CallFunc_IsValid_ReturnValue) == 0x000070, "Member 'BP_BuildingAmbienceManager_C_FindStructuresWithinRange::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BuildingAmbienceManager_C_FindStructuresWithinRange, CallFunc_GetOwner_ReturnValue) == 0x000078, "Member 'BP_BuildingAmbienceManager_C_FindStructuresWithinRange::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BuildingAmbienceManager_C_FindStructuresWithinRange, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000080, "Member 'BP_BuildingAmbienceManager_C_FindStructuresWithinRange::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BuildingAmbienceManager_C_FindStructuresWithinRange, CallFunc_Not_PreBool_ReturnValue) == 0x000098, "Member 'BP_BuildingAmbienceManager_C_FindStructuresWithinRange::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BuildingAmbienceManager_C_FindStructuresWithinRange, Temp_int_Loop_Counter_Variable) == 0x00009C, "Member 'BP_BuildingAmbienceManager_C_FindStructuresWithinRange::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_BuildingAmbienceManager_C_FindStructuresWithinRange, CallFunc_Less_IntInt_ReturnValue) == 0x0000A0, "Member 'BP_BuildingAmbienceManager_C_FindStructuresWithinRange::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BuildingAmbienceManager_C_FindStructuresWithinRange, CallFunc_Add_IntInt_ReturnValue) == 0x0000A4, "Member 'BP_BuildingAmbienceManager_C_FindStructuresWithinRange::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BuildingAmbienceManager_C_FindStructuresWithinRange, CallFunc_Array_IsEmpty_ReturnValue) == 0x0000A8, "Member 'BP_BuildingAmbienceManager_C_FindStructuresWithinRange::CallFunc_Array_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BuildingAmbienceManager_C_FindStructuresWithinRange, CallFunc_Array_Add_ReturnValue) == 0x0000AC, "Member 'BP_BuildingAmbienceManager_C_FindStructuresWithinRange::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BuildingAmbienceManager_C_FindStructuresWithinRange, CallFunc_GetPawnsInRange_Radius_ImplicitCast) == 0x0000B0, "Member 'BP_BuildingAmbienceManager_C_FindStructuresWithinRange::CallFunc_GetPawnsInRange_Radius_ImplicitCast' has a wrong offset!");

// Function BP_BuildingAmbienceManager.BP_BuildingAmbienceManager_C.PopulateBuildingAmbience
// 0x0310 (0x0310 - 0x0000)
struct BP_BuildingAmbienceManager_C_PopulateBuildingAmbience final
{
public:
	class AActor*                                 Building_Actor_Input;                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Debug_Ambience_Population_0;                       // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Debug_Print_Data_0;                                // 0x0009(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_BuildingAmbienceActor_C*            Building_Ambience_Actor;                           // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Building_Count;                                    // 0x0018(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVector>                        Detected_Actor_Position;                           // 0x0020(0x0010)(Edit, BlueprintVisible)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_BuildingAmbienceActor_C*>    CallFunc_GetAllActorsOfClass_OutActors;            // 0x0040(0x0010)(ReferenceParm)
	class ABP_BuildingAmbienceActor_C*            CallFunc_FindNearestBuildingAmbienceActor_Closest_Actor; // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsEmpty_ReturnValue;                // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVector>                        CallFunc_FindStructuresWithinRange_Structures_In_Range; // 0x0060(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetVectorArrayAverage_ReturnValue;        // 0x0078(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDistanceTo_ReturnValue;                // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x0098(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x0191(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_192[0xE];                                      // 0x0192(0x000E)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x01A0(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Array_Get_Item;                           // 0x0200(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0218(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_BuildingAmbienceActor_C*            CallFunc_FinishSpawningActor_ReturnValue;          // 0x0220(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0228(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x022C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22D[0x3];                                      // 0x022D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0230(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_VectorToString_ReturnValue;          // 0x0248(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	uint8                                         Pad_258[0x8];                                      // 0x0258(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue_1;               // 0x0260(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1; // 0x02C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_BuildingAmbienceActor_C*            CallFunc_FinishSpawningActor_ReturnValue_1;        // 0x02C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x02D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_VectorToString_ReturnValue_1;        // 0x02E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	double                                        CallFunc_LessEqual_DoubleDouble_A_ImplicitCast;    // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_DrawDebugSphere_Radius_ImplicitCast;      // 0x0300(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_DrawDebugSphere_Radius_ImplicitCast_1;    // 0x0304(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BuildingAmbienceManager_C_PopulateBuildingAmbience) == 0x000010, "Wrong alignment on BP_BuildingAmbienceManager_C_PopulateBuildingAmbience");
static_assert(sizeof(BP_BuildingAmbienceManager_C_PopulateBuildingAmbience) == 0x000310, "Wrong size on BP_BuildingAmbienceManager_C_PopulateBuildingAmbience");
static_assert(offsetof(BP_BuildingAmbienceManager_C_PopulateBuildingAmbience, Building_Actor_Input) == 0x000000, "Member 'BP_BuildingAmbienceManager_C_PopulateBuildingAmbience::Building_Actor_Input' has a wrong offset!");
static_assert(offsetof(BP_BuildingAmbienceManager_C_PopulateBuildingAmbience, Debug_Ambience_Population_0) == 0x000008, "Member 'BP_BuildingAmbienceManager_C_PopulateBuildingAmbience::Debug_Ambience_Population_0' has a wrong offset!");
static_assert(offsetof(BP_BuildingAmbienceManager_C_PopulateBuildingAmbience, Debug_Print_Data_0) == 0x000009, "Member 'BP_BuildingAmbienceManager_C_PopulateBuildingAmbience::Debug_Print_Data_0' has a wrong offset!");
static_assert(offsetof(BP_BuildingAmbienceManager_C_PopulateBuildingAmbience, Building_Ambience_Actor) == 0x000010, "Member 'BP_BuildingAmbienceManager_C_PopulateBuildingAmbience::Building_Ambience_Actor' has a wrong offset!");
static_assert(offsetof(BP_BuildingAmbienceManager_C_PopulateBuildingAmbience, Building_Count) == 0x000018, "Member 'BP_BuildingAmbienceManager_C_PopulateBuildingAmbience::Building_Count' has a wrong offset!");
static_assert(offsetof(BP_BuildingAmbienceManager_C_PopulateBuildingAmbience, Detected_Actor_Position) == 0x000020, "Member 'BP_BuildingAmbienceManager_C_PopulateBuildingAmbience::Detected_Actor_Position' has a wrong offset!");
static_assert(offsetof(BP_BuildingAmbienceManager_C_PopulateBuildingAmbience, Temp_int_Array_Index_Variable) == 0x000030, "Member 'BP_BuildingAmbienceManager_C_PopulateBuildingAmbience::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_BuildingAmbienceManager_C_PopulateBuildingAmbience, Temp_int_Loop_Counter_Variable) == 0x000034, "Member 'BP_BuildingAmbienceManager_C_PopulateBuildingAmbience::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_BuildingAmbienceManager_C_PopulateBuildingAmbience, CallFunc_Add_IntInt_ReturnValue) == 0x000038, "Member 'BP_BuildingAmbienceManager_C_PopulateBuildingAmbience::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BuildingAmbienceManager_C_PopulateBuildingAmbience, CallFunc_GetAllActorsOfClass_OutActors) == 0x000040, "Member 'BP_BuildingAmbienceManager_C_PopulateBuildingAmbience::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(BP_BuildingAmbienceManager_C_PopulateBuildingAmbience, CallFunc_FindNearestBuildingAmbienceActor_Closest_Actor) == 0x000050, "Member 'BP_BuildingAmbienceManager_C_PopulateBuildingAmbience::CallFunc_FindNearestBuildingAmbienceActor_Closest_Actor' has a wrong offset!");
static_assert(offsetof(BP_BuildingAmbienceManager_C_PopulateBuildingAmbience, CallFunc_Array_IsEmpty_ReturnValue) == 0x000058, "Member 'BP_BuildingAmbienceManager_C_PopulateBuildingAmbience::CallFunc_Array_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BuildingAmbienceManager_C_PopulateBuildingAmbience, CallFunc_FindStructuresWithinRange_Structures_In_Range) == 0x000060, "Member 'BP_BuildingAmbienceManager_C_PopulateBuildingAmbience::CallFunc_FindStructuresWithinRange_Structures_In_Range' has a wrong offset!");
static_assert(offsetof(BP_BuildingAmbienceManager_C_PopulateBuildingAmbience, CallFunc_Array_Length_ReturnValue) == 0x000070, "Member 'BP_BuildingAmbienceManager_C_PopulateBuildingAmbience::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BuildingAmbienceManager_C_PopulateBuildingAmbience, CallFunc_Array_Length_ReturnValue_1) == 0x000074, "Member 'BP_BuildingAmbienceManager_C_PopulateBuildingAmbience::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BuildingAmbienceManager_C_PopulateBuildingAmbience, CallFunc_GetVectorArrayAverage_ReturnValue) == 0x000078, "Member 'BP_BuildingAmbienceManager_C_PopulateBuildingAmbience::CallFunc_GetVectorArrayAverage_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BuildingAmbienceManager_C_PopulateBuildingAmbience, CallFunc_GetDistanceTo_ReturnValue) == 0x000090, "Member 'BP_BuildingAmbienceManager_C_PopulateBuildingAmbience::CallFunc_GetDistanceTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BuildingAmbienceManager_C_PopulateBuildingAmbience, CallFunc_K2_SetActorLocation_SweepHitResult) == 0x000098, "Member 'BP_BuildingAmbienceManager_C_PopulateBuildingAmbience::CallFunc_K2_SetActorLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_BuildingAmbienceManager_C_PopulateBuildingAmbience, CallFunc_K2_SetActorLocation_ReturnValue) == 0x000190, "Member 'BP_BuildingAmbienceManager_C_PopulateBuildingAmbience::CallFunc_K2_SetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BuildingAmbienceManager_C_PopulateBuildingAmbience, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x000191, "Member 'BP_BuildingAmbienceManager_C_PopulateBuildingAmbience::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BuildingAmbienceManager_C_PopulateBuildingAmbience, CallFunc_GetTransform_ReturnValue) == 0x0001A0, "Member 'BP_BuildingAmbienceManager_C_PopulateBuildingAmbience::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BuildingAmbienceManager_C_PopulateBuildingAmbience, CallFunc_Array_Get_Item) == 0x000200, "Member 'BP_BuildingAmbienceManager_C_PopulateBuildingAmbience::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_BuildingAmbienceManager_C_PopulateBuildingAmbience, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000218, "Member 'BP_BuildingAmbienceManager_C_PopulateBuildingAmbience::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BuildingAmbienceManager_C_PopulateBuildingAmbience, CallFunc_FinishSpawningActor_ReturnValue) == 0x000220, "Member 'BP_BuildingAmbienceManager_C_PopulateBuildingAmbience::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BuildingAmbienceManager_C_PopulateBuildingAmbience, CallFunc_Array_Length_ReturnValue_2) == 0x000228, "Member 'BP_BuildingAmbienceManager_C_PopulateBuildingAmbience::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BuildingAmbienceManager_C_PopulateBuildingAmbience, CallFunc_Less_IntInt_ReturnValue) == 0x00022C, "Member 'BP_BuildingAmbienceManager_C_PopulateBuildingAmbience::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BuildingAmbienceManager_C_PopulateBuildingAmbience, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000230, "Member 'BP_BuildingAmbienceManager_C_PopulateBuildingAmbience::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BuildingAmbienceManager_C_PopulateBuildingAmbience, CallFunc_Conv_VectorToString_ReturnValue) == 0x000248, "Member 'BP_BuildingAmbienceManager_C_PopulateBuildingAmbience::CallFunc_Conv_VectorToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BuildingAmbienceManager_C_PopulateBuildingAmbience, CallFunc_GetTransform_ReturnValue_1) == 0x000260, "Member 'BP_BuildingAmbienceManager_C_PopulateBuildingAmbience::CallFunc_GetTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BuildingAmbienceManager_C_PopulateBuildingAmbience, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1) == 0x0002C0, "Member 'BP_BuildingAmbienceManager_C_PopulateBuildingAmbience::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BuildingAmbienceManager_C_PopulateBuildingAmbience, CallFunc_FinishSpawningActor_ReturnValue_1) == 0x0002C8, "Member 'BP_BuildingAmbienceManager_C_PopulateBuildingAmbience::CallFunc_FinishSpawningActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BuildingAmbienceManager_C_PopulateBuildingAmbience, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x0002D0, "Member 'BP_BuildingAmbienceManager_C_PopulateBuildingAmbience::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BuildingAmbienceManager_C_PopulateBuildingAmbience, CallFunc_Conv_VectorToString_ReturnValue_1) == 0x0002E8, "Member 'BP_BuildingAmbienceManager_C_PopulateBuildingAmbience::CallFunc_Conv_VectorToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BuildingAmbienceManager_C_PopulateBuildingAmbience, CallFunc_LessEqual_DoubleDouble_A_ImplicitCast) == 0x0002F8, "Member 'BP_BuildingAmbienceManager_C_PopulateBuildingAmbience::CallFunc_LessEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_BuildingAmbienceManager_C_PopulateBuildingAmbience, CallFunc_DrawDebugSphere_Radius_ImplicitCast) == 0x000300, "Member 'BP_BuildingAmbienceManager_C_PopulateBuildingAmbience::CallFunc_DrawDebugSphere_Radius_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_BuildingAmbienceManager_C_PopulateBuildingAmbience, CallFunc_DrawDebugSphere_Radius_ImplicitCast_1) == 0x000304, "Member 'BP_BuildingAmbienceManager_C_PopulateBuildingAmbience::CallFunc_DrawDebugSphere_Radius_ImplicitCast_1' has a wrong offset!");

// Function BP_BuildingAmbienceManager.BP_BuildingAmbienceManager_C.RecalculateBuildingAmbience
// 0x02A8 (0x02A8 - 0x0000)
struct BP_BuildingAmbienceManager_C_RecalculateBuildingAmbience final
{
public:
	class AActor*                                 Building_Caller_0;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Debug_on_Destroyed;                                // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_BuildingAmbienceActor_C*            Building_Ambience_Actor;                           // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Building_Count;                                    // 0x0018(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Debug;                                             // 0x001C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_BuildingAmbienceActor_C*            CallFunc_FindNearestBuildingAmbienceActor_Closest_Actor; // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x0058(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x0158(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FVector>                        CallFunc_FindStructuresWithinRange_Structures_In_Range; // 0x0170(0x0010)(ReferenceParm)
	bool                                          CallFunc_SoundActorDistanceCheck_Actor_Too_Close;  // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_181[0x3];                                      // 0x0181(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetVectorArrayAverage_ReturnValue;        // 0x0188(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_VectorVector_ReturnValue;      // 0x01A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A2[0x6];                                      // 0x01A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult_1;     // 0x01A8(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue_1;        // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BuildingAmbienceManager_C_RecalculateBuildingAmbience) == 0x000008, "Wrong alignment on BP_BuildingAmbienceManager_C_RecalculateBuildingAmbience");
static_assert(sizeof(BP_BuildingAmbienceManager_C_RecalculateBuildingAmbience) == 0x0002A8, "Wrong size on BP_BuildingAmbienceManager_C_RecalculateBuildingAmbience");
static_assert(offsetof(BP_BuildingAmbienceManager_C_RecalculateBuildingAmbience, Building_Caller_0) == 0x000000, "Member 'BP_BuildingAmbienceManager_C_RecalculateBuildingAmbience::Building_Caller_0' has a wrong offset!");
static_assert(offsetof(BP_BuildingAmbienceManager_C_RecalculateBuildingAmbience, Debug_on_Destroyed) == 0x000008, "Member 'BP_BuildingAmbienceManager_C_RecalculateBuildingAmbience::Debug_on_Destroyed' has a wrong offset!");
static_assert(offsetof(BP_BuildingAmbienceManager_C_RecalculateBuildingAmbience, Building_Ambience_Actor) == 0x000010, "Member 'BP_BuildingAmbienceManager_C_RecalculateBuildingAmbience::Building_Ambience_Actor' has a wrong offset!");
static_assert(offsetof(BP_BuildingAmbienceManager_C_RecalculateBuildingAmbience, Building_Count) == 0x000018, "Member 'BP_BuildingAmbienceManager_C_RecalculateBuildingAmbience::Building_Count' has a wrong offset!");
static_assert(offsetof(BP_BuildingAmbienceManager_C_RecalculateBuildingAmbience, Debug) == 0x00001C, "Member 'BP_BuildingAmbienceManager_C_RecalculateBuildingAmbience::Debug' has a wrong offset!");
static_assert(offsetof(BP_BuildingAmbienceManager_C_RecalculateBuildingAmbience, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000020, "Member 'BP_BuildingAmbienceManager_C_RecalculateBuildingAmbience::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BuildingAmbienceManager_C_RecalculateBuildingAmbience, CallFunc_FindNearestBuildingAmbienceActor_Closest_Actor) == 0x000038, "Member 'BP_BuildingAmbienceManager_C_RecalculateBuildingAmbience::CallFunc_FindNearestBuildingAmbienceActor_Closest_Actor' has a wrong offset!");
static_assert(offsetof(BP_BuildingAmbienceManager_C_RecalculateBuildingAmbience, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000040, "Member 'BP_BuildingAmbienceManager_C_RecalculateBuildingAmbience::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BuildingAmbienceManager_C_RecalculateBuildingAmbience, CallFunc_K2_SetActorLocation_SweepHitResult) == 0x000058, "Member 'BP_BuildingAmbienceManager_C_RecalculateBuildingAmbience::CallFunc_K2_SetActorLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_BuildingAmbienceManager_C_RecalculateBuildingAmbience, CallFunc_K2_SetActorLocation_ReturnValue) == 0x000150, "Member 'BP_BuildingAmbienceManager_C_RecalculateBuildingAmbience::CallFunc_K2_SetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BuildingAmbienceManager_C_RecalculateBuildingAmbience, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x000158, "Member 'BP_BuildingAmbienceManager_C_RecalculateBuildingAmbience::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BuildingAmbienceManager_C_RecalculateBuildingAmbience, CallFunc_FindStructuresWithinRange_Structures_In_Range) == 0x000170, "Member 'BP_BuildingAmbienceManager_C_RecalculateBuildingAmbience::CallFunc_FindStructuresWithinRange_Structures_In_Range' has a wrong offset!");
static_assert(offsetof(BP_BuildingAmbienceManager_C_RecalculateBuildingAmbience, CallFunc_SoundActorDistanceCheck_Actor_Too_Close) == 0x000180, "Member 'BP_BuildingAmbienceManager_C_RecalculateBuildingAmbience::CallFunc_SoundActorDistanceCheck_Actor_Too_Close' has a wrong offset!");
static_assert(offsetof(BP_BuildingAmbienceManager_C_RecalculateBuildingAmbience, CallFunc_Array_Length_ReturnValue) == 0x000184, "Member 'BP_BuildingAmbienceManager_C_RecalculateBuildingAmbience::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BuildingAmbienceManager_C_RecalculateBuildingAmbience, CallFunc_GetVectorArrayAverage_ReturnValue) == 0x000188, "Member 'BP_BuildingAmbienceManager_C_RecalculateBuildingAmbience::CallFunc_GetVectorArrayAverage_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BuildingAmbienceManager_C_RecalculateBuildingAmbience, CallFunc_Array_RemoveItem_ReturnValue) == 0x0001A0, "Member 'BP_BuildingAmbienceManager_C_RecalculateBuildingAmbience::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BuildingAmbienceManager_C_RecalculateBuildingAmbience, CallFunc_EqualEqual_VectorVector_ReturnValue) == 0x0001A1, "Member 'BP_BuildingAmbienceManager_C_RecalculateBuildingAmbience::CallFunc_EqualEqual_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BuildingAmbienceManager_C_RecalculateBuildingAmbience, CallFunc_K2_SetActorLocation_SweepHitResult_1) == 0x0001A8, "Member 'BP_BuildingAmbienceManager_C_RecalculateBuildingAmbience::CallFunc_K2_SetActorLocation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(BP_BuildingAmbienceManager_C_RecalculateBuildingAmbience, CallFunc_K2_SetActorLocation_ReturnValue_1) == 0x0002A0, "Member 'BP_BuildingAmbienceManager_C_RecalculateBuildingAmbience::CallFunc_K2_SetActorLocation_ReturnValue_1' has a wrong offset!");

// Function BP_BuildingAmbienceManager.BP_BuildingAmbienceManager_C.SoundActorDistanceCheck
// 0x00C8 (0x00C8 - 0x0000)
struct BP_BuildingAmbienceManager_C_SoundActorDistanceCheck final
{
public:
	struct FVector                                Actor_Caller;                                      // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Actor_Too_Close_0;                                 // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVector>                        Actor_Vector_Array;                                // 0x0020(0x0010)(Edit, BlueprintVisible)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Array_Get_Item;                           // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Vector_Distance_ReturnValue;              // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_BuildingAmbienceActor_C*>    CallFunc_GetAllActorsOfClass_OutActors;            // 0x0080(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_BuildingAmbienceActor_C*            CallFunc_Array_Get_Item_1;                         // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BuildingAmbienceManager_C_SoundActorDistanceCheck) == 0x000008, "Wrong alignment on BP_BuildingAmbienceManager_C_SoundActorDistanceCheck");
static_assert(sizeof(BP_BuildingAmbienceManager_C_SoundActorDistanceCheck) == 0x0000C8, "Wrong size on BP_BuildingAmbienceManager_C_SoundActorDistanceCheck");
static_assert(offsetof(BP_BuildingAmbienceManager_C_SoundActorDistanceCheck, Actor_Caller) == 0x000000, "Member 'BP_BuildingAmbienceManager_C_SoundActorDistanceCheck::Actor_Caller' has a wrong offset!");
static_assert(offsetof(BP_BuildingAmbienceManager_C_SoundActorDistanceCheck, Actor_Too_Close_0) == 0x000018, "Member 'BP_BuildingAmbienceManager_C_SoundActorDistanceCheck::Actor_Too_Close_0' has a wrong offset!");
