#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BD_DYN_ConcreteGate

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "PhysicsCore_structs.hpp"
#include "Engine_structs.hpp"
#include "Tempest_structs.hpp"
#include "Tempest_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_BD_DYN_ConcreteGate.BP_BD_DYN_ConcreteGate_C
// 0x0090 (0x1B70 - 0x1AE0)
class ABP_BD_DYN_ConcreteGate_C final : public ATedStructureGate
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1AE0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      PS_DustStructurePlacement_01_Long;                 // 0x1AE8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          HitBox1;                                           // 0x1AF0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         TL_OnDeath_Dissolve_943D08074F83342E72E7648C7E969F35; // 0x1AF8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TL_OnDeath_Dest_Anim_943D08074F83342E72E7648C7E969F35; // 0x1AFC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            TL_OnDeath__Direction_943D08074F83342E72E7648C7E969F35; // 0x1B00(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B01[0x7];                                     // 0x1B01(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     TL_OnDeath;                                        // 0x1B08(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        OpenStateTarget;                                   // 0x1B10(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        SpenAnimDuration;                                  // 0x1B18(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        OpenStateCurrent;                                  // 0x1B20(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             GateOpenCue;                                       // 0x1B28(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             GateCloseCue;                                      // 0x1B30(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CachedActorLocation;                               // 0x1B38(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CachedActorRotation;                               // 0x1B50(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_BD_DYN_ConcreteGate(int32 EntryPoint);
	void K2_OnStartProceduralAnim(const ETedNeighborAnim Anim);
	void OnSetOpenedCosmetic(const bool bInOpened);
	void ReceiveBeginPlay();
	void ReceiveOnDeath();
	void ReceiveTick(float DeltaSeconds);
	void TL_OnDeath__FinishedFunc();
	void TL_OnDeath__UpdateFunc();
	void TL_OnDeath__VFX__EventFunc();
	void UpdateGateCosmetic(double InDeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_BD_DYN_ConcreteGate_C">();
	}
	static class ABP_BD_DYN_ConcreteGate_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_BD_DYN_ConcreteGate_C>();
	}
};
static_assert(alignof(ABP_BD_DYN_ConcreteGate_C) == 0x000010, "Wrong alignment on ABP_BD_DYN_ConcreteGate_C");
static_assert(sizeof(ABP_BD_DYN_ConcreteGate_C) == 0x001B70, "Wrong size on ABP_BD_DYN_ConcreteGate_C");
static_assert(offsetof(ABP_BD_DYN_ConcreteGate_C, UberGraphFrame) == 0x001AE0, "Member 'ABP_BD_DYN_ConcreteGate_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_ConcreteGate_C, PS_DustStructurePlacement_01_Long) == 0x001AE8, "Member 'ABP_BD_DYN_ConcreteGate_C::PS_DustStructurePlacement_01_Long' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_ConcreteGate_C, HitBox1) == 0x001AF0, "Member 'ABP_BD_DYN_ConcreteGate_C::HitBox1' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_ConcreteGate_C, TL_OnDeath_Dissolve_943D08074F83342E72E7648C7E969F35) == 0x001AF8, "Member 'ABP_BD_DYN_ConcreteGate_C::TL_OnDeath_Dissolve_943D08074F83342E72E7648C7E969F35' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_ConcreteGate_C, TL_OnDeath_Dest_Anim_943D08074F83342E72E7648C7E969F35) == 0x001AFC, "Member 'ABP_BD_DYN_ConcreteGate_C::TL_OnDeath_Dest_Anim_943D08074F83342E72E7648C7E969F35' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_ConcreteGate_C, TL_OnDeath__Direction_943D08074F83342E72E7648C7E969F35) == 0x001B00, "Member 'ABP_BD_DYN_ConcreteGate_C::TL_OnDeath__Direction_943D08074F83342E72E7648C7E969F35' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_ConcreteGate_C, TL_OnDeath) == 0x001B08, "Member 'ABP_BD_DYN_ConcreteGate_C::TL_OnDeath' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_ConcreteGate_C, OpenStateTarget) == 0x001B10, "Member 'ABP_BD_DYN_ConcreteGate_C::OpenStateTarget' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_ConcreteGate_C, SpenAnimDuration) == 0x001B18, "Member 'ABP_BD_DYN_ConcreteGate_C::SpenAnimDuration' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_ConcreteGate_C, OpenStateCurrent) == 0x001B20, "Member 'ABP_BD_DYN_ConcreteGate_C::OpenStateCurrent' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_ConcreteGate_C, GateOpenCue) == 0x001B28, "Member 'ABP_BD_DYN_ConcreteGate_C::GateOpenCue' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_ConcreteGate_C, GateCloseCue) == 0x001B30, "Member 'ABP_BD_DYN_ConcreteGate_C::GateCloseCue' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_ConcreteGate_C, CachedActorLocation) == 0x001B38, "Member 'ABP_BD_DYN_ConcreteGate_C::CachedActorLocation' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_ConcreteGate_C, CachedActorRotation) == 0x001B50, "Member 'ABP_BD_DYN_ConcreteGate_C::CachedActorRotation' has a wrong offset!");

}

