#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BuildingAmbienceManager

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "Tempest_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_BuildingAmbienceManager.BP_BuildingAmbienceManager_C
// 0x0120 (0x03B0 - 0x0290)
class ABP_BuildingAmbienceManager_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Building_Caller;                                   // 0x02A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        Max_Pool_Distance;                                 // 0x02A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Debug_Print_Data;                                  // 0x02B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B1[0x7];                                      // 0x02B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_BuildingAmbienceActor_C*            Closest_Actor;                                     // 0x02B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          Debug_Ambience_Population;                         // 0x02C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C1[0x7];                                      // 0x02C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVector>                        Structure_Vector_Array;                            // 0x02C8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          Actor_Too_Close;                                   // 0x02D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D9[0x7];                                      // 0x02D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTedUtilsPawnFilter                    StructuresFilter;                                  // 0x02E0(0x00D0)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_BP_BuildingAmbienceManager(int32 EntryPoint);
	void FindNearestBuildingAmbienceActor(class AActor* Building_Caller_0, class ABP_BuildingAmbienceActor_C** Closest_Actor_0);
	void FindStructuresWithinRange(class ABP_BuildingAmbienceActor_C* Actor_Location, TArray<struct FVector>* Structures_In_Range);
	void PopulateBuildingAmbience(class AActor* Building_Actor_Input, bool Debug_Ambience_Population_0, bool Debug_Print_Data_0, class ABP_BuildingAmbienceActor_C** Building_Ambience_Actor, int32* Building_Count);
	void RecalculateBuildingAmbience(class AActor* Building_Caller_0, bool Debug_on_Destroyed, class ABP_BuildingAmbienceActor_C** Building_Ambience_Actor, int32* Building_Count);
	void ReceiveBeginPlay();
	void SoundActorDistanceCheck(const struct FVector& Actor_Caller, bool* Actor_Too_Close_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_BuildingAmbienceManager_C">();
	}
	static class ABP_BuildingAmbienceManager_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_BuildingAmbienceManager_C>();
	}
};
static_assert(alignof(ABP_BuildingAmbienceManager_C) == 0x000008, "Wrong alignment on ABP_BuildingAmbienceManager_C");
static_assert(sizeof(ABP_BuildingAmbienceManager_C) == 0x0003B0, "Wrong size on ABP_BuildingAmbienceManager_C");
static_assert(offsetof(ABP_BuildingAmbienceManager_C, UberGraphFrame) == 0x000290, "Member 'ABP_BuildingAmbienceManager_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_BuildingAmbienceManager_C, DefaultSceneRoot) == 0x000298, "Member 'ABP_BuildingAmbienceManager_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_BuildingAmbienceManager_C, Building_Caller) == 0x0002A0, "Member 'ABP_BuildingAmbienceManager_C::Building_Caller' has a wrong offset!");
static_assert(offsetof(ABP_BuildingAmbienceManager_C, Max_Pool_Distance) == 0x0002A8, "Member 'ABP_BuildingAmbienceManager_C::Max_Pool_Distance' has a wrong offset!");
static_assert(offsetof(ABP_BuildingAmbienceManager_C, Debug_Print_Data) == 0x0002B0, "Member 'ABP_BuildingAmbienceManager_C::Debug_Print_Data' has a wrong offset!");
static_assert(offsetof(ABP_BuildingAmbienceManager_C, Closest_Actor) == 0x0002B8, "Member 'ABP_BuildingAmbienceManager_C::Closest_Actor' has a wrong offset!");
static_assert(offsetof(ABP_BuildingAmbienceManager_C, Debug_Ambience_Population) == 0x0002C0, "Member 'ABP_BuildingAmbienceManager_C::Debug_Ambience_Population' has a wrong offset!");
static_assert(offsetof(ABP_BuildingAmbienceManager_C, Structure_Vector_Array) == 0x0002C8, "Member 'ABP_BuildingAmbienceManager_C::Structure_Vector_Array' has a wrong offset!");
static_assert(offsetof(ABP_BuildingAmbienceManager_C, Actor_Too_Close) == 0x0002D8, "Member 'ABP_BuildingAmbienceManager_C::Actor_Too_Close' has a wrong offset!");
static_assert(offsetof(ABP_BuildingAmbienceManager_C, StructuresFilter) == 0x0002E0, "Member 'ABP_BuildingAmbienceManager_C::StructuresFilter' has a wrong offset!");

}

