#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BD_DYN_Silo

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "PhysicsCore_structs.hpp"


namespace SDK::Params
{

// Function BP_BD_DYN_Silo.BP_BD_DYN_Silo_C.Destructible
// 0x0330 (0x0330 - 0x0000)
struct BP_BD_DYN_Silo_C_Destructible final
{
public:
	TArray<class UStaticMesh*>                    DestMeshes;                                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<struct FVector>                        DestMeshes_Locations;                              // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<struct FRotator>                       DestMeshes_Rotators;                               // 0x0020(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FVector                                MeshScale;                                         // 0x0030(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UFXSystemAsset*>                 DestMeshes_exploFX;                                // 0x0048(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<double>                                DestMeshes_exploFX_Scale;                          // 0x0058(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<class UFXSystemAsset*>                 DestMeshes_attachedFX;                             // 0x0068(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<double>                                DestMeshes_attachedFX_Scale;                       // 0x0078(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<struct FVector>                        DestMeshes_LinearImpulse;                          // 0x0088(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<struct FVector>                        DestMeshes_AngularImpulse;                         // 0x0098(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<class AStaticMeshActor*>               SpawnedMeshesArray;                                // 0x00A8(0x0010)(Parm, OutParm)
	TArray<class UFXSystemComponent*>             SpawnedAttachedFXArray;                            // 0x00B8(0x0010)(Parm, OutParm, ContainsInstancedReference)
	int32                                         currentIndex;                                      // 0x00C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UFXSystemComponent*>             SpawnedAttachedFX;                                 // 0x00D0(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	TArray<class AStaticMeshActor*>               SpawnedMeshes;                                     // 0x00E0(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F4[0x4];                                       // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Array_Get_Item;                           // 0x00F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_SelectVector_ReturnValue;                 // 0x0118(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Array_Get_Item_1;                         // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue_1;         // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFXSystemAsset*                         CallFunc_Array_Get_Item_2;                         // 0x0148(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x0150(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue_2;         // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Array_Get_Item_3;                         // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue_3;         // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_179[0x7];                                      // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue_1;                // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFXSystemAsset*                         CallFunc_Array_Get_Item_4;                         // 0x0188(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue_1;        // 0x0190(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue_4;         // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A9[0x7];                                      // 0x01A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_Array_Get_Item_5;                         // 0x01B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue_5;         // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C9[0x7];                                      // 0x01C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_SelectRotator_ReturnValue;                // 0x01D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Array_Get_Item_6;                         // 0x01E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue_6;         // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_201[0x7];                                      // 0x0201(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_SelectVector_ReturnValue_1;               // 0x0208(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Array_Get_Item_7;                         // 0x0220(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_238[0x8];                                      // 0x0238(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0240(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue_7;         // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A1[0x7];                                      // 0x02A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x02A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_SelectVector_ReturnValue_2;               // 0x02B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AStaticMeshActor*                       CallFunc_FinishSpawningActor_ReturnValue;          // 0x02C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x02D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D4[0x4];                                      // 0x02D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            CallFunc_Array_Get_Item_8;                         // 0x02D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x02E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x02E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E2[0x6];                                      // 0x02E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x02E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFXSystemComponent*                     CallFunc_SpawnEffectAttached_ReturnValue;          // 0x0300(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UFXSystemComponent*                     CallFunc_SpawnEffectAtLocation_ReturnValue;        // 0x0308(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0310(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0314(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_315[0x3];                                      // 0x0315(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0318(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x031C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0320(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BD_DYN_Silo_C_Destructible) == 0x000010, "Wrong alignment on BP_BD_DYN_Silo_C_Destructible");
static_assert(sizeof(BP_BD_DYN_Silo_C_Destructible) == 0x000330, "Wrong size on BP_BD_DYN_Silo_C_Destructible");
static_assert(offsetof(BP_BD_DYN_Silo_C_Destructible, DestMeshes) == 0x000000, "Member 'BP_BD_DYN_Silo_C_Destructible::DestMeshes' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_Silo_C_Destructible, DestMeshes_Locations) == 0x000010, "Member 'BP_BD_DYN_Silo_C_Destructible::DestMeshes_Locations' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_Silo_C_Destructible, DestMeshes_Rotators) == 0x000020, "Member 'BP_BD_DYN_Silo_C_Destructible::DestMeshes_Rotators' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_Silo_C_Destructible, MeshScale) == 0x000030, "Member 'BP_BD_DYN_Silo_C_Destructible::MeshScale' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_Silo_C_Destructible, DestMeshes_exploFX) == 0x000048, "Member 'BP_BD_DYN_Silo_C_Destructible::DestMeshes_exploFX' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_Silo_C_Destructible, DestMeshes_exploFX_Scale) == 0x000058, "Member 'BP_BD_DYN_Silo_C_Destructible::DestMeshes_exploFX_Scale' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_Silo_C_Destructible, DestMeshes_attachedFX) == 0x000068, "Member 'BP_BD_DYN_Silo_C_Destructible::DestMeshes_attachedFX' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_Silo_C_Destructible, DestMeshes_attachedFX_Scale) == 0x000078, "Member 'BP_BD_DYN_Silo_C_Destructible::DestMeshes_attachedFX_Scale' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_Silo_C_Destructible, DestMeshes_LinearImpulse) == 0x000088, "Member 'BP_BD_DYN_Silo_C_Destructible::DestMeshes_LinearImpulse' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_Silo_C_Destructible, DestMeshes_AngularImpulse) == 0x000098, "Member 'BP_BD_DYN_Silo_C_Destructible::DestMeshes_AngularImpulse' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_Silo_C_Destructible, SpawnedMeshesArray) == 0x0000A8, "Member 'BP_BD_DYN_Silo_C_Destructible::SpawnedMeshesArray' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_Silo_C_Destructible, SpawnedAttachedFXArray) == 0x0000B8, "Member 'BP_BD_DYN_Silo_C_Destructible::SpawnedAttachedFXArray' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_Silo_C_Destructible, currentIndex) == 0x0000C8, "Member 'BP_BD_DYN_Silo_C_Destructible::currentIndex' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_Silo_C_Destructible, SpawnedAttachedFX) == 0x0000D0, "Member 'BP_BD_DYN_Silo_C_Destructible::SpawnedAttachedFX' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_Silo_C_Destructible, SpawnedMeshes) == 0x0000E0, "Member 'BP_BD_DYN_Silo_C_Destructible::SpawnedMeshes' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_Silo_C_Destructible, CallFunc_Array_Length_ReturnValue) == 0x0000F0, "Member 'BP_BD_DYN_Silo_C_Destructible::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_Silo_C_Destructible, CallFunc_Array_Get_Item) == 0x0000F8, "Member 'BP_BD_DYN_Silo_C_Destructible::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_Silo_C_Destructible, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000110, "Member 'BP_BD_DYN_Silo_C_Destructible::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_Silo_C_Destructible, CallFunc_SelectVector_ReturnValue) == 0x000118, "Member 'BP_BD_DYN_Silo_C_Destructible::CallFunc_SelectVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_Silo_C_Destructible, CallFunc_Array_Get_Item_1) == 0x000130, "Member 'BP_BD_DYN_Silo_C_Destructible::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_Silo_C_Destructible, CallFunc_Array_IsValidIndex_ReturnValue_1) == 0x000138, "Member 'BP_BD_DYN_Silo_C_Destructible::CallFunc_Array_IsValidIndex_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_Silo_C_Destructible, CallFunc_SelectFloat_ReturnValue) == 0x000140, "Member 'BP_BD_DYN_Silo_C_Destructible::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_Silo_C_Destructible, CallFunc_Array_Get_Item_2) == 0x000148, "Member 'BP_BD_DYN_Silo_C_Destructible::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_Silo_C_Destructible, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x000150, "Member 'BP_BD_DYN_Silo_C_Destructible::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_Silo_C_Destructible, CallFunc_Array_IsValidIndex_ReturnValue_2) == 0x000168, "Member 'BP_BD_DYN_Silo_C_Destructible::CallFunc_Array_IsValidIndex_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_Silo_C_Destructible, CallFunc_Array_Get_Item_3) == 0x000170, "Member 'BP_BD_DYN_Silo_C_Destructible::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_Silo_C_Destructible, CallFunc_Array_IsValidIndex_ReturnValue_3) == 0x000178, "Member 'BP_BD_DYN_Silo_C_Destructible::CallFunc_Array_IsValidIndex_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_Silo_C_Destructible, CallFunc_SelectFloat_ReturnValue_1) == 0x000180, "Member 'BP_BD_DYN_Silo_C_Destructible::CallFunc_SelectFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_Silo_C_Destructible, CallFunc_Array_Get_Item_4) == 0x000188, "Member 'BP_BD_DYN_Silo_C_Destructible::CallFunc_Array_Get_Item_4' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_Silo_C_Destructible, CallFunc_Conv_DoubleToVector_ReturnValue_1) == 0x000190, "Member 'BP_BD_DYN_Silo_C_Destructible::CallFunc_Conv_DoubleToVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_Silo_C_Destructible, CallFunc_Array_IsValidIndex_ReturnValue_4) == 0x0001A8, "Member 'BP_BD_DYN_Silo_C_Destructible::CallFunc_Array_IsValidIndex_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_Silo_C_Destructible, CallFunc_Array_Get_Item_5) == 0x0001B0, "Member 'BP_BD_DYN_Silo_C_Destructible::CallFunc_Array_Get_Item_5' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_Silo_C_Destructible, CallFunc_Array_IsValidIndex_ReturnValue_5) == 0x0001C8, "Member 'BP_BD_DYN_Silo_C_Destructible::CallFunc_Array_IsValidIndex_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_Silo_C_Destructible, CallFunc_SelectRotator_ReturnValue) == 0x0001D0, "Member 'BP_BD_DYN_Silo_C_Destructible::CallFunc_SelectRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_Silo_C_Destructible, CallFunc_Array_Get_Item_6) == 0x0001E8, "Member 'BP_BD_DYN_Silo_C_Destructible::CallFunc_Array_Get_Item_6' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_Silo_C_Destructible, CallFunc_Array_IsValidIndex_ReturnValue_6) == 0x000200, "Member 'BP_BD_DYN_Silo_C_Destructible::CallFunc_Array_IsValidIndex_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_Silo_C_Destructible, CallFunc_SelectVector_ReturnValue_1) == 0x000208, "Member 'BP_BD_DYN_Silo_C_Destructible::CallFunc_SelectVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_Silo_C_Destructible, CallFunc_Array_Get_Item_7) == 0x000220, "Member 'BP_BD_DYN_Silo_C_Destructible::CallFunc_Array_Get_Item_7' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_Silo_C_Destructible, CallFunc_MakeTransform_ReturnValue) == 0x000240, "Member 'BP_BD_DYN_Silo_C_Destructible::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_Silo_C_Destructible, CallFunc_Array_IsValidIndex_ReturnValue_7) == 0x0002A0, "Member 'BP_BD_DYN_Silo_C_Destructible::CallFunc_Array_IsValidIndex_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_Silo_C_Destructible, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0002A8, "Member 'BP_BD_DYN_Silo_C_Destructible::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_Silo_C_Destructible, CallFunc_SelectVector_ReturnValue_2) == 0x0002B0, "Member 'BP_BD_DYN_Silo_C_Destructible::CallFunc_SelectVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_Silo_C_Destructible, CallFunc_FinishSpawningActor_ReturnValue) == 0x0002C8, "Member 'BP_BD_DYN_Silo_C_Destructible::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_Silo_C_Destructible, Temp_int_Array_Index_Variable) == 0x0002D0, "Member 'BP_BD_DYN_Silo_C_Destructible::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_Silo_C_Destructible, CallFunc_Array_Get_Item_8) == 0x0002D8, "Member 'BP_BD_DYN_Silo_C_Destructible::CallFunc_Array_Get_Item_8' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_Silo_C_Destructible, CallFunc_SetStaticMesh_ReturnValue) == 0x0002E0, "Member 'BP_BD_DYN_Silo_C_Destructible::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_Silo_C_Destructible, CallFunc_IsValid_ReturnValue) == 0x0002E1, "Member 'BP_BD_DYN_Silo_C_Destructible::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_Silo_C_Destructible, CallFunc_GetSocketLocation_ReturnValue) == 0x0002E8, "Member 'BP_BD_DYN_Silo_C_Destructible::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_Silo_C_Destructible, CallFunc_SpawnEffectAttached_ReturnValue) == 0x000300, "Member 'BP_BD_DYN_Silo_C_Destructible::CallFunc_SpawnEffectAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_Silo_C_Destructible, CallFunc_SpawnEffectAtLocation_ReturnValue) == 0x000308, "Member 'BP_BD_DYN_Silo_C_Destructible::CallFunc_SpawnEffectAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_Silo_C_Destructible, Temp_int_Loop_Counter_Variable) == 0x000310, "Member 'BP_BD_DYN_Silo_C_Destructible::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_Silo_C_Destructible, CallFunc_Less_IntInt_ReturnValue) == 0x000314, "Member 'BP_BD_DYN_Silo_C_Destructible::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_Silo_C_Destructible, CallFunc_Add_IntInt_ReturnValue) == 0x000318, "Member 'BP_BD_DYN_Silo_C_Destructible::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_Silo_C_Destructible, CallFunc_Array_Add_ReturnValue) == 0x00031C, "Member 'BP_BD_DYN_Silo_C_Destructible::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_Silo_C_Destructible, CallFunc_Array_Add_ReturnValue_1) == 0x000320, "Member 'BP_BD_DYN_Silo_C_Destructible::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");

// Function BP_BD_DYN_Silo.BP_BD_DYN_Silo_C.Destructible Silo Custom Setup
// 0x03D0 (0x03D0 - 0x0000)
struct BP_BD_DYN_Silo_C_Destructible_Silo_Custom_Setup final
{
public:
	class USkeletalMeshComponent*                 Skeletal_Mesh;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UStaticMesh*>                    DestMeshes;                                        // 0x0008(0x0010)(Parm, OutParm)
	TArray<struct FVector>                        DestMeshes_Locations;                              // 0x0018(0x0010)(Parm, OutParm)
	TArray<struct FRotator>                       DestMeshes_Rotators;                               // 0x0028(0x0010)(Parm, OutParm)
	struct FVector                                MeshScale;                                         // 0x0038(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UFXSystemAsset*>                 DestMeshes_FX;                                     // 0x0050(0x0010)(Parm, OutParm)
	TArray<double>                                DestMeshes_FX_Scale;                               // 0x0060(0x0010)(Parm, OutParm)
	TArray<class UFXSystemAsset*>                 DestMeshes_FXattached;                             // 0x0070(0x0010)(Parm, OutParm)
	TArray<double>                                DestMeshes_FXattached_Scale;                       // 0x0080(0x0010)(Parm, OutParm)
	TArray<struct FVector>                        DestMeshes_LinearImpulse;                          // 0x0090(0x0010)(Parm, OutParm)
	TArray<struct FVector>                        DestMeshes_AngularImpulse;                         // 0x00A0(0x0010)(Parm, OutParm)
	double                                        CallFunc_RandomFloatInRange_ReturnValue;           // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B8[0x8];                                       // 0x00B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetSocketTransform_ReturnValue;           // 0x00C0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_GetSocketTransform_ReturnValue_1;         // 0x0120(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0180(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0198(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x01B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location_1;                // 0x01C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation_1;                // 0x01E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale_1;                   // 0x01F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentScale_ReturnValue;         // 0x0210(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FRotator>                       K2Node_MakeArray_Array;                            // 0x0228(0x0010)(ReferenceParm)
	TArray<struct FVector>                        K2Node_MakeArray_Array_1;                          // 0x0238(0x0010)(ReferenceParm)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_2;         // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_3;         // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_4;         // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0268(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_5;         // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_TransformDirection_ReturnValue;           // 0x0288(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x02A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_6;         // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_TransformDirection_ReturnValue_1;         // 0x02C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_7;         // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_8;         // 0x02E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_9;         // 0x02E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_10;        // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_2;                 // 0x02F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_11;        // 0x0310(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_TransformDirection_ReturnValue_2;         // 0x0318(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_3;                 // 0x0330(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FVector>                        K2Node_MakeArray_Array_2;                          // 0x0348(0x0010)(ReferenceParm)
	struct FVector                                CallFunc_TransformDirection_ReturnValue_3;         // 0x0358(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<double>                                K2Node_MakeArray_Array_3;                          // 0x0370(0x0010)(ReferenceParm)
	TArray<struct FVector>                        K2Node_MakeArray_Array_4;                          // 0x0380(0x0010)(ReferenceParm)
	TArray<double>                                K2Node_MakeArray_Array_5;                          // 0x0390(0x0010)(ReferenceParm)
	TArray<class UFXSystemAsset*>                 K2Node_MakeArray_Array_6;                          // 0x03A0(0x0010)(ReferenceParm)
	TArray<class UFXSystemAsset*>                 K2Node_MakeArray_Array_7;                          // 0x03B0(0x0010)(ReferenceParm)
	TArray<class UStaticMesh*>                    K2Node_MakeArray_Array_8;                          // 0x03C0(0x0010)(ReferenceParm)
};
static_assert(alignof(BP_BD_DYN_Silo_C_Destructible_Silo_Custom_Setup) == 0x000010, "Wrong alignment on BP_BD_DYN_Silo_C_Destructible_Silo_Custom_Setup");
static_assert(sizeof(BP_BD_DYN_Silo_C_Destructible_Silo_Custom_Setup) == 0x0003D0, "Wrong size on BP_BD_DYN_Silo_C_Destructible_Silo_Custom_Setup");
static_assert(offsetof(BP_BD_DYN_Silo_C_Destructible_Silo_Custom_Setup, Skeletal_Mesh) == 0x000000, "Member 'BP_BD_DYN_Silo_C_Destructible_Silo_Custom_Setup::Skeletal_Mesh' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_Silo_C_Destructible_Silo_Custom_Setup, DestMeshes) == 0x000008, "Member 'BP_BD_DYN_Silo_C_Destructible_Silo_Custom_Setup::DestMeshes' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_Silo_C_Destructible_Silo_Custom_Setup, DestMeshes_Locations) == 0x000018, "Member 'BP_BD_DYN_Silo_C_Destructible_Silo_Custom_Setup::DestMeshes_Locations' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_Silo_C_Destructible_Silo_Custom_Setup, DestMeshes_Rotators) == 0x000028, "Member 'BP_BD_DYN_Silo_C_Destructible_Silo_Custom_Setup::DestMeshes_Rotators' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_Silo_C_Destructible_Silo_Custom_Setup, MeshScale) == 0x000038, "Member 'BP_BD_DYN_Silo_C_Destructible_Silo_Custom_Setup::MeshScale' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_Silo_C_Destructible_Silo_Custom_Setup, DestMeshes_FX) == 0x000050, "Member 'BP_BD_DYN_Silo_C_Destructible_Silo_Custom_Setup::DestMeshes_FX' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_Silo_C_Destructible_Silo_Custom_Setup, DestMeshes_FX_Scale) == 0x000060, "Member 'BP_BD_DYN_Silo_C_Destructible_Silo_Custom_Setup::DestMeshes_FX_Scale' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_Silo_C_Destructible_Silo_Custom_Setup, DestMeshes_FXattached) == 0x000070, "Member 'BP_BD_DYN_Silo_C_Destructible_Silo_Custom_Setup::DestMeshes_FXattached' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_Silo_C_Destructible_Silo_Custom_Setup, DestMeshes_FXattached_Scale) == 0x000080, "Member 'BP_BD_DYN_Silo_C_Destructible_Silo_Custom_Setup::DestMeshes_FXattached_Scale' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_Silo_C_Destructible_Silo_Custom_Setup, DestMeshes_LinearImpulse) == 0x000090, "Member 'BP_BD_DYN_Silo_C_Destructible_Silo_Custom_Setup::DestMeshes_LinearImpulse' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_Silo_C_Destructible_Silo_Custom_Setup, DestMeshes_AngularImpulse) == 0x0000A0, "Member 'BP_BD_DYN_Silo_C_Destructible_Silo_Custom_Setup::DestMeshes_AngularImpulse' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_Silo_C_Destructible_Silo_Custom_Setup, CallFunc_RandomFloatInRange_ReturnValue) == 0x0000B0, "Member 'BP_BD_DYN_Silo_C_Destructible_Silo_Custom_Setup::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_Silo_C_Destructible_Silo_Custom_Setup, CallFunc_GetSocketTransform_ReturnValue) == 0x0000C0, "Member 'BP_BD_DYN_Silo_C_Destructible_Silo_Custom_Setup::CallFunc_GetSocketTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_Silo_C_Destructible_Silo_Custom_Setup, CallFunc_GetSocketTransform_ReturnValue_1) == 0x000120, "Member 'BP_BD_DYN_Silo_C_Destructible_Silo_Custom_Setup::CallFunc_GetSocketTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_Silo_C_Destructible_Silo_Custom_Setup, CallFunc_BreakTransform_Location) == 0x000180, "Member 'BP_BD_DYN_Silo_C_Destructible_Silo_Custom_Setup::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_Silo_C_Destructible_Silo_Custom_Setup, CallFunc_BreakTransform_Rotation) == 0x000198, "Member 'BP_BD_DYN_Silo_C_Destructible_Silo_Custom_Setup::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_Silo_C_Destructible_Silo_Custom_Setup, CallFunc_BreakTransform_Scale) == 0x0001B0, "Member 'BP_BD_DYN_Silo_C_Destructible_Silo_Custom_Setup::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_Silo_C_Destructible_Silo_Custom_Setup, CallFunc_BreakTransform_Location_1) == 0x0001C8, "Member 'BP_BD_DYN_Silo_C_Destructible_Silo_Custom_Setup::CallFunc_BreakTransform_Location_1' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_Silo_C_Destructible_Silo_Custom_Setup, CallFunc_BreakTransform_Rotation_1) == 0x0001E0, "Member 'BP_BD_DYN_Silo_C_Destructible_Silo_Custom_Setup::CallFunc_BreakTransform_Rotation_1' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_Silo_C_Destructible_Silo_Custom_Setup, CallFunc_BreakTransform_Scale_1) == 0x0001F8, "Member 'BP_BD_DYN_Silo_C_Destructible_Silo_Custom_Setup::CallFunc_BreakTransform_Scale_1' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_Silo_C_Destructible_Silo_Custom_Setup, CallFunc_K2_GetComponentScale_ReturnValue) == 0x000210, "Member 'BP_BD_DYN_Silo_C_Destructible_Silo_Custom_Setup::CallFunc_K2_GetComponentScale_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_Silo_C_Destructible_Silo_Custom_Setup, K2Node_MakeArray_Array) == 0x000228, "Member 'BP_BD_DYN_Silo_C_Destructible_Silo_Custom_Setup::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_Silo_C_Destructible_Silo_Custom_Setup, K2Node_MakeArray_Array_1) == 0x000238, "Member 'BP_BD_DYN_Silo_C_Destructible_Silo_Custom_Setup::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_Silo_C_Destructible_Silo_Custom_Setup, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x000248, "Member 'BP_BD_DYN_Silo_C_Destructible_Silo_Custom_Setup::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_Silo_C_Destructible_Silo_Custom_Setup, CallFunc_RandomFloatInRange_ReturnValue_2) == 0x000250, "Member 'BP_BD_DYN_Silo_C_Destructible_Silo_Custom_Setup::CallFunc_RandomFloatInRange_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_Silo_C_Destructible_Silo_Custom_Setup, CallFunc_RandomFloatInRange_ReturnValue_3) == 0x000258, "Member 'BP_BD_DYN_Silo_C_Destructible_Silo_Custom_Setup::CallFunc_RandomFloatInRange_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_Silo_C_Destructible_Silo_Custom_Setup, CallFunc_RandomFloatInRange_ReturnValue_4) == 0x000260, "Member 'BP_BD_DYN_Silo_C_Destructible_Silo_Custom_Setup::CallFunc_RandomFloatInRange_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_Silo_C_Destructible_Silo_Custom_Setup, CallFunc_MakeVector_ReturnValue) == 0x000268, "Member 'BP_BD_DYN_Silo_C_Destructible_Silo_Custom_Setup::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_Silo_C_Destructible_Silo_Custom_Setup, CallFunc_RandomFloatInRange_ReturnValue_5) == 0x000280, "Member 'BP_BD_DYN_Silo_C_Destructible_Silo_Custom_Setup::CallFunc_RandomFloatInRange_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_Silo_C_Destructible_Silo_Custom_Setup, CallFunc_TransformDirection_ReturnValue) == 0x000288, "Member 'BP_BD_DYN_Silo_C_Destructible_Silo_Custom_Setup::CallFunc_TransformDirection_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_Silo_C_Destructible_Silo_Custom_Setup, CallFunc_MakeVector_ReturnValue_1) == 0x0002A0, "Member 'BP_BD_DYN_Silo_C_Destructible_Silo_Custom_Setup::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_Silo_C_Destructible_Silo_Custom_Setup, CallFunc_RandomFloatInRange_ReturnValue_6) == 0x0002B8, "Member 'BP_BD_DYN_Silo_C_Destructible_Silo_Custom_Setup::CallFunc_RandomFloatInRange_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_Silo_C_Destructible_Silo_Custom_Setup, CallFunc_TransformDirection_ReturnValue_1) == 0x0002C0, "Member 'BP_BD_DYN_Silo_C_Destructible_Silo_Custom_Setup::CallFunc_TransformDirection_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_Silo_C_Destructible_Silo_Custom_Setup, CallFunc_RandomFloatInRange_ReturnValue_7) == 0x0002D8, "Member 'BP_BD_DYN_Silo_C_Destructible_Silo_Custom_Setup::CallFunc_RandomFloatInRange_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_Silo_C_Destructible_Silo_Custom_Setup, CallFunc_RandomFloatInRange_ReturnValue_8) == 0x0002E0, "Member 'BP_BD_DYN_Silo_C_Destructible_Silo_Custom_Setup::CallFunc_RandomFloatInRange_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_Silo_C_Destructible_Silo_Custom_Setup, CallFunc_RandomFloatInRange_ReturnValue_9) == 0x0002E8, "Member 'BP_BD_DYN_Silo_C_Destructible_Silo_Custom_Setup::CallFunc_RandomFloatInRange_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_Silo_C_Destructible_Silo_Custom_Setup, CallFunc_RandomFloatInRange_ReturnValue_10) == 0x0002F0, "Member 'BP_BD_DYN_Silo_C_Destructible_Silo_Custom_Setup::CallFunc_RandomFloatInRange_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_Silo_C_Destructible_Silo_Custom_Setup, CallFunc_MakeVector_ReturnValue_2) == 0x0002F8, "Member 'BP_BD_DYN_Silo_C_Destructible_Silo_Custom_Setup::CallFunc_MakeVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_Silo_C_Destructible_Silo_Custom_Setup, CallFunc_RandomFloatInRange_ReturnValue_11) == 0x000310, "Member 'BP_BD_DYN_Silo_C_Destructible_Silo_Custom_Setup::CallFunc_RandomFloatInRange_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_Silo_C_Destructible_Silo_Custom_Setup, CallFunc_TransformDirection_ReturnValue_2) == 0x000318, "Member 'BP_BD_DYN_Silo_C_Destructible_Silo_Custom_Setup::CallFunc_TransformDirection_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_Silo_C_Destructible_Silo_Custom_Setup, CallFunc_MakeVector_ReturnValue_3) == 0x000330, "Member 'BP_BD_DYN_Silo_C_Destructible_Silo_Custom_Setup::CallFunc_MakeVector_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_Silo_C_Destructible_Silo_Custom_Setup, K2Node_MakeArray_Array_2) == 0x000348, "Member 'BP_BD_DYN_Silo_C_Destructible_Silo_Custom_Setup::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_Silo_C_Destructible_Silo_Custom_Setup, CallFunc_TransformDirection_ReturnValue_3) == 0x000358, "Member 'BP_BD_DYN_Silo_C_Destructible_Silo_Custom_Setup::CallFunc_TransformDirection_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_Silo_C_Destructible_Silo_Custom_Setup, K2Node_MakeArray_Array_3) == 0x000370, "Member 'BP_BD_DYN_Silo_C_Destructible_Silo_Custom_Setup::K2Node_MakeArray_Array_3' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_Silo_C_Destructible_Silo_Custom_Setup, K2Node_MakeArray_Array_4) == 0x000380, "Member 'BP_BD_DYN_Silo_C_Destructible_Silo_Custom_Setup::K2Node_MakeArray_Array_4' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_Silo_C_Destructible_Silo_Custom_Setup, K2Node_MakeArray_Array_5) == 0x000390, "Member 'BP_BD_DYN_Silo_C_Destructible_Silo_Custom_Setup::K2Node_MakeArray_Array_5' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_Silo_C_Destructible_Silo_Custom_Setup, K2Node_MakeArray_Array_6) == 0x0003A0, "Member 'BP_BD_DYN_Silo_C_Destructible_Silo_Custom_Setup::K2Node_MakeArray_Array_6' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_Silo_C_Destructible_Silo_Custom_Setup, K2Node_MakeArray_Array_7) == 0x0003B0, "Member 'BP_BD_DYN_Silo_C_Destructible_Silo_Custom_Setup::K2Node_MakeArray_Array_7' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_Silo_C_Destructible_Silo_Custom_Setup, K2Node_MakeArray_Array_8) == 0x0003C0, "Member 'BP_BD_DYN_Silo_C_Destructible_Silo_Custom_Setup::K2Node_MakeArray_Array_8' has a wrong offset!");

// Function BP_BD_DYN_Silo.BP_BD_DYN_Silo_C.ExecuteUbergraph_BP_BD_DYN_Silo
// 0x0618 (0x0618 - 0x0000)
struct BP_BD_DYN_Silo_C_ExecuteUbergraph_BP_BD_DYN_Silo final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26[0x2];                                       // 0x0026(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_4;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_HealthPct;                            // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue_1;          // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_RandomFloatInRange_ReturnValue;           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UAnimMontage*                           CallFunc_GetCurrentMontage_ReturnValue;            // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A[0x6];                                       // 0x006A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0070(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0088(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFXSystemComponent*                     CallFunc_SpawnEffectAtLocation_ReturnValue;        // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UFXSystemComponent*                     CallFunc_SpawnEffectAtLocation_ReturnValue_1;      // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        CallFunc_SpawnDecalAtLocation_ReturnValue;         // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_Array_Get_Item;                           // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue;     // 0x00C4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Array_Get_Item_1;                         // 0x00D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x00F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0108(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_1;          // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0120(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_2;          // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x0138(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_3;          // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_4;              // 0x0150(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_5;              // 0x0160(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_4;          // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_5;          // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_1;          // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_181[0x7];                                      // 0x0181(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EObjectTypeQuery>                      K2Node_MakeArray_Array;                            // 0x0188(0x0010)(ConstParm, ReferenceParm)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0198(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_2;           // 0x01B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1CD[0x3];                                      // 0x01CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_4;                  // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D9[0x3];                                      // 0x01D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x01DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E1[0x7];                                      // 0x01E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UStaticMesh*>                    CallFunc_Destructible_Silo_Custom_Setup_DestMeshes; // 0x01E8(0x0010)(ReferenceParm)
	TArray<struct FVector>                        CallFunc_Destructible_Silo_Custom_Setup_DestMeshes_Locations; // 0x01F8(0x0010)(ReferenceParm)
	TArray<struct FRotator>                       CallFunc_Destructible_Silo_Custom_Setup_DestMeshes_Rotators; // 0x0208(0x0010)(ReferenceParm)
	struct FVector                                CallFunc_Destructible_Silo_Custom_Setup_MeshScale; // 0x0218(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UFXSystemAsset*>                 CallFunc_Destructible_Silo_Custom_Setup_DestMeshes_FX; // 0x0230(0x0010)(ReferenceParm)
	TArray<double>                                CallFunc_Destructible_Silo_Custom_Setup_DestMeshes_FX_Scale; // 0x0240(0x0010)(ReferenceParm)
	TArray<class UFXSystemAsset*>                 CallFunc_Destructible_Silo_Custom_Setup_DestMeshes_FXattached; // 0x0250(0x0010)(ReferenceParm)
	TArray<double>                                CallFunc_Destructible_Silo_Custom_Setup_DestMeshes_FXattached_Scale; // 0x0260(0x0010)(ReferenceParm)
	TArray<struct FVector>                        CallFunc_Destructible_Silo_Custom_Setup_DestMeshes_LinearImpulse; // 0x0270(0x0010)(ReferenceParm)
	TArray<struct FVector>                        CallFunc_Destructible_Silo_Custom_Setup_DestMeshes_AngularImpulse; // 0x0280(0x0010)(ReferenceParm)
	TArray<class AStaticMeshActor*>               CallFunc_Destructible_SpawnedMeshesArray;          // 0x0290(0x0010)(ReferenceParm)
	TArray<class UFXSystemComponent*>             CallFunc_Destructible_SpawnedAttachedFXArray;      // 0x02A0(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UFXSystemComponent*                     CallFunc_Array_Get_Item_2;                         // 0x02B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x02B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x02BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x02BD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2BE[0x2];                                      // 0x02BE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AStaticMeshActor*                       CallFunc_Array_Get_Item_3;                         // 0x02C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AStaticMeshActor*                       CallFunc_Array_Get_Item_4;                         // 0x02C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x02D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x02D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D2[0x2];                                      // 0x02D2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x02D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_4;               // 0x02D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x02DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_4;                // 0x02DD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_2;          // 0x02DE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2DF[0x1];                                      // 0x02DF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UTedPlayerData*                         CallFunc_GetOwningPlayerData_ReturnValue;          // 0x02E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
