#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BD_DYN_SalvageCentre

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "PhysicsCore_structs.hpp"
#include "SavedGame_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Tempest_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function BP_BD_DYN_SalvageCentre.BP_BD_DYN_SalvageCentre_C.Destructible
// 0x0330 (0x0330 - 0x0000)
struct BP_BD_DYN_SalvageCentre_C_Destructible final
{
public:
	TArray<class UStaticMesh*>                    DestMeshes;                                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<struct FVector>                        DestMeshes_Locations;                              // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<struct FRotator>                       DestMeshes_Rotators;                               // 0x0020(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FVector                                MeshScale;                                         // 0x0030(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UFXSystemAsset*>                 DestMeshes_exploFX;                                // 0x0048(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<double>                                DestMeshes_exploFX_Scale;                          // 0x0058(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<class UFXSystemAsset*>                 DestMeshes_attachedFX;                             // 0x0068(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<double>                                DestMeshes_attachedFX_Scale;                       // 0x0078(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<struct FVector>                        DestMeshes_LinearImpulse;                          // 0x0088(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<struct FVector>                        DestMeshes_AngularImpulse;                         // 0x0098(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<class AStaticMeshActor*>               SpawnedMeshesArray;                                // 0x00A8(0x0010)(Parm, OutParm)
	TArray<class UFXSystemComponent*>             SpawnedAttachedFXArray;                            // 0x00B8(0x0010)(Parm, OutParm, ContainsInstancedReference)
	int32                                         currentIndex;                                      // 0x00C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UFXSystemComponent*>             SpawnedAttachedFX;                                 // 0x00D0(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	TArray<class AStaticMeshActor*>               SpawnedMeshes;                                     // 0x00E0(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F4[0x4];                                       // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Array_Get_Item;                           // 0x00F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_SelectVector_ReturnValue;                 // 0x0118(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Array_Get_Item_1;                         // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue_1;         // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFXSystemAsset*                         CallFunc_Array_Get_Item_2;                         // 0x0148(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x0150(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue_2;         // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Array_Get_Item_3;                         // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue_3;         // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_179[0x7];                                      // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue_1;                // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFXSystemAsset*                         CallFunc_Array_Get_Item_4;                         // 0x0188(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue_1;        // 0x0190(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue_4;         // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A9[0x7];                                      // 0x01A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_Array_Get_Item_5;                         // 0x01B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue_5;         // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C9[0x7];                                      // 0x01C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_SelectRotator_ReturnValue;                // 0x01D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Array_Get_Item_6;                         // 0x01E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue_6;         // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_201[0x7];                                      // 0x0201(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_SelectVector_ReturnValue_1;               // 0x0208(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Array_Get_Item_7;                         // 0x0220(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_238[0x8];                                      // 0x0238(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0240(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue_7;         // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A1[0x7];                                      // 0x02A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x02A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_SelectVector_ReturnValue_2;               // 0x02B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AStaticMeshActor*                       CallFunc_FinishSpawningActor_ReturnValue;          // 0x02C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x02D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D4[0x4];                                      // 0x02D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            CallFunc_Array_Get_Item_8;                         // 0x02D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x02E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x02E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E2[0x6];                                      // 0x02E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x02E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFXSystemComponent*                     CallFunc_SpawnEffectAttached_ReturnValue;          // 0x0300(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UFXSystemComponent*                     CallFunc_SpawnEffectAtLocation_ReturnValue;        // 0x0308(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0310(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0314(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_315[0x3];                                      // 0x0315(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0318(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x031C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0320(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BD_DYN_SalvageCentre_C_Destructible) == 0x000010, "Wrong alignment on BP_BD_DYN_SalvageCentre_C_Destructible");
static_assert(sizeof(BP_BD_DYN_SalvageCentre_C_Destructible) == 0x000330, "Wrong size on BP_BD_DYN_SalvageCentre_C_Destructible");
static_assert(offsetof(BP_BD_DYN_SalvageCentre_C_Destructible, DestMeshes) == 0x000000, "Member 'BP_BD_DYN_SalvageCentre_C_Destructible::DestMeshes' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_SalvageCentre_C_Destructible, DestMeshes_Locations) == 0x000010, "Member 'BP_BD_DYN_SalvageCentre_C_Destructible::DestMeshes_Locations' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_SalvageCentre_C_Destructible, DestMeshes_Rotators) == 0x000020, "Member 'BP_BD_DYN_SalvageCentre_C_Destructible::DestMeshes_Rotators' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_SalvageCentre_C_Destructible, MeshScale) == 0x000030, "Member 'BP_BD_DYN_SalvageCentre_C_Destructible::MeshScale' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_SalvageCentre_C_Destructible, DestMeshes_exploFX) == 0x000048, "Member 'BP_BD_DYN_SalvageCentre_C_Destructible::DestMeshes_exploFX' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_SalvageCentre_C_Destructible, DestMeshes_exploFX_Scale) == 0x000058, "Member 'BP_BD_DYN_SalvageCentre_C_Destructible::DestMeshes_exploFX_Scale' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_SalvageCentre_C_Destructible, DestMeshes_attachedFX) == 0x000068, "Member 'BP_BD_DYN_SalvageCentre_C_Destructible::DestMeshes_attachedFX' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_SalvageCentre_C_Destructible, DestMeshes_attachedFX_Scale) == 0x000078, "Member 'BP_BD_DYN_SalvageCentre_C_Destructible::DestMeshes_attachedFX_Scale' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_SalvageCentre_C_Destructible, DestMeshes_LinearImpulse) == 0x000088, "Member 'BP_BD_DYN_SalvageCentre_C_Destructible::DestMeshes_LinearImpulse' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_SalvageCentre_C_Destructible, DestMeshes_AngularImpulse) == 0x000098, "Member 'BP_BD_DYN_SalvageCentre_C_Destructible::DestMeshes_AngularImpulse' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_SalvageCentre_C_Destructible, SpawnedMeshesArray) == 0x0000A8, "Member 'BP_BD_DYN_SalvageCentre_C_Destructible::SpawnedMeshesArray' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_SalvageCentre_C_Destructible, SpawnedAttachedFXArray) == 0x0000B8, "Member 'BP_BD_DYN_SalvageCentre_C_Destructible::SpawnedAttachedFXArray' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_SalvageCentre_C_Destructible, currentIndex) == 0x0000C8, "Member 'BP_BD_DYN_SalvageCentre_C_Destructible::currentIndex' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_SalvageCentre_C_Destructible, SpawnedAttachedFX) == 0x0000D0, "Member 'BP_BD_DYN_SalvageCentre_C_Destructible::SpawnedAttachedFX' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_SalvageCentre_C_Destructible, SpawnedMeshes) == 0x0000E0, "Member 'BP_BD_DYN_SalvageCentre_C_Destructible::SpawnedMeshes' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_SalvageCentre_C_Destructible, CallFunc_Array_Length_ReturnValue) == 0x0000F0, "Member 'BP_BD_DYN_SalvageCentre_C_Destructible::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_SalvageCentre_C_Destructible, CallFunc_Array_Get_Item) == 0x0000F8, "Member 'BP_BD_DYN_SalvageCentre_C_Destructible::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_SalvageCentre_C_Destructible, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000110, "Member 'BP_BD_DYN_SalvageCentre_C_Destructible::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_SalvageCentre_C_Destructible, CallFunc_SelectVector_ReturnValue) == 0x000118, "Member 'BP_BD_DYN_SalvageCentre_C_Destructible::CallFunc_SelectVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_SalvageCentre_C_Destructible, CallFunc_Array_Get_Item_1) == 0x000130, "Member 'BP_BD_DYN_SalvageCentre_C_Destructible::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_SalvageCentre_C_Destructible, CallFunc_Array_IsValidIndex_ReturnValue_1) == 0x000138, "Member 'BP_BD_DYN_SalvageCentre_C_Destructible::CallFunc_Array_IsValidIndex_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_SalvageCentre_C_Destructible, CallFunc_SelectFloat_ReturnValue) == 0x000140, "Member 'BP_BD_DYN_SalvageCentre_C_Destructible::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_SalvageCentre_C_Destructible, CallFunc_Array_Get_Item_2) == 0x000148, "Member 'BP_BD_DYN_SalvageCentre_C_Destructible::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_SalvageCentre_C_Destructible, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x000150, "Member 'BP_BD_DYN_SalvageCentre_C_Destructible::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_SalvageCentre_C_Destructible, CallFunc_Array_IsValidIndex_ReturnValue_2) == 0x000168, "Member 'BP_BD_DYN_SalvageCentre_C_Destructible::CallFunc_Array_IsValidIndex_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_SalvageCentre_C_Destructible, CallFunc_Array_Get_Item_3) == 0x000170, "Member 'BP_BD_DYN_SalvageCentre_C_Destructible::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_SalvageCentre_C_Destructible, CallFunc_Array_IsValidIndex_ReturnValue_3) == 0x000178, "Member 'BP_BD_DYN_SalvageCentre_C_Destructible::CallFunc_Array_IsValidIndex_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_SalvageCentre_C_Destructible, CallFunc_SelectFloat_ReturnValue_1) == 0x000180, "Member 'BP_BD_DYN_SalvageCentre_C_Destructible::CallFunc_SelectFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_SalvageCentre_C_Destructible, CallFunc_Array_Get_Item_4) == 0x000188, "Member 'BP_BD_DYN_SalvageCentre_C_Destructible::CallFunc_Array_Get_Item_4' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_SalvageCentre_C_Destructible, CallFunc_Conv_DoubleToVector_ReturnValue_1) == 0x000190, "Member 'BP_BD_DYN_SalvageCentre_C_Destructible::CallFunc_Conv_DoubleToVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_SalvageCentre_C_Destructible, CallFunc_Array_IsValidIndex_ReturnValue_4) == 0x0001A8, "Member 'BP_BD_DYN_SalvageCentre_C_Destructible::CallFunc_Array_IsValidIndex_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_SalvageCentre_C_Destructible, CallFunc_Array_Get_Item_5) == 0x0001B0, "Member 'BP_BD_DYN_SalvageCentre_C_Destructible::CallFunc_Array_Get_Item_5' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_SalvageCentre_C_Destructible, CallFunc_Array_IsValidIndex_ReturnValue_5) == 0x0001C8, "Member 'BP_BD_DYN_SalvageCentre_C_Destructible::CallFunc_Array_IsValidIndex_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_SalvageCentre_C_Destructible, CallFunc_SelectRotator_ReturnValue) == 0x0001D0, "Member 'BP_BD_DYN_SalvageCentre_C_Destructible::CallFunc_SelectRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_SalvageCentre_C_Destructible, CallFunc_Array_Get_Item_6) == 0x0001E8, "Member 'BP_BD_DYN_SalvageCentre_C_Destructible::CallFunc_Array_Get_Item_6' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_SalvageCentre_C_Destructible, CallFunc_Array_IsValidIndex_ReturnValue_6) == 0x000200, "Member 'BP_BD_DYN_SalvageCentre_C_Destructible::CallFunc_Array_IsValidIndex_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_SalvageCentre_C_Destructible, CallFunc_SelectVector_ReturnValue_1) == 0x000208, "Member 'BP_BD_DYN_SalvageCentre_C_Destructible::CallFunc_SelectVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_SalvageCentre_C_Destructible, CallFunc_Array_Get_Item_7) == 0x000220, "Member 'BP_BD_DYN_SalvageCentre_C_Destructible::CallFunc_Array_Get_Item_7' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_SalvageCentre_C_Destructible, CallFunc_MakeTransform_ReturnValue) == 0x000240, "Member 'BP_BD_DYN_SalvageCentre_C_Destructible::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_SalvageCentre_C_Destructible, CallFunc_Array_IsValidIndex_ReturnValue_7) == 0x0002A0, "Member 'BP_BD_DYN_SalvageCentre_C_Destructible::CallFunc_Array_IsValidIndex_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_SalvageCentre_C_Destructible, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0002A8, "Member 'BP_BD_DYN_SalvageCentre_C_Destructible::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_SalvageCentre_C_Destructible, CallFunc_SelectVector_ReturnValue_2) == 0x0002B0, "Member 'BP_BD_DYN_SalvageCentre_C_Destructible::CallFunc_SelectVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_SalvageCentre_C_Destructible, CallFunc_FinishSpawningActor_ReturnValue) == 0x0002C8, "Member 'BP_BD_DYN_SalvageCentre_C_Destructible::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_SalvageCentre_C_Destructible, Temp_int_Array_Index_Variable) == 0x0002D0, "Member 'BP_BD_DYN_SalvageCentre_C_Destructible::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_SalvageCentre_C_Destructible, CallFunc_Array_Get_Item_8) == 0x0002D8, "Member 'BP_BD_DYN_SalvageCentre_C_Destructible::CallFunc_Array_Get_Item_8' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_SalvageCentre_C_Destructible, CallFunc_SetStaticMesh_ReturnValue) == 0x0002E0, "Member 'BP_BD_DYN_SalvageCentre_C_Destructible::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_SalvageCentre_C_Destructible, CallFunc_IsValid_ReturnValue) == 0x0002E1, "Member 'BP_BD_DYN_SalvageCentre_C_Destructible::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_SalvageCentre_C_Destructible, CallFunc_GetSocketLocation_ReturnValue) == 0x0002E8, "Member 'BP_BD_DYN_SalvageCentre_C_Destructible::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_SalvageCentre_C_Destructible, CallFunc_SpawnEffectAttached_ReturnValue) == 0x000300, "Member 'BP_BD_DYN_SalvageCentre_C_Destructible::CallFunc_SpawnEffectAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_SalvageCentre_C_Destructible, CallFunc_SpawnEffectAtLocation_ReturnValue) == 0x000308, "Member 'BP_BD_DYN_SalvageCentre_C_Destructible::CallFunc_SpawnEffectAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_SalvageCentre_C_Destructible, Temp_int_Loop_Counter_Variable) == 0x000310, "Member 'BP_BD_DYN_SalvageCentre_C_Destructible::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_SalvageCentre_C_Destructible, CallFunc_Less_IntInt_ReturnValue) == 0x000314, "Member 'BP_BD_DYN_SalvageCentre_C_Destructible::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_SalvageCentre_C_Destructible, CallFunc_Add_IntInt_ReturnValue) == 0x000318, "Member 'BP_BD_DYN_SalvageCentre_C_Destructible::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_SalvageCentre_C_Destructible, CallFunc_Array_Add_ReturnValue) == 0x00031C, "Member 'BP_BD_DYN_SalvageCentre_C_Destructible::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_SalvageCentre_C_Destructible, CallFunc_Array_Add_ReturnValue_1) == 0x000320, "Member 'BP_BD_DYN_SalvageCentre_C_Destructible::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");

// Function BP_BD_DYN_SalvageCentre.BP_BD_DYN_SalvageCentre_C.Destructible Salvage Custom Setup
// 0x0640 (0x0640 - 0x0000)
struct BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup final
{
public:
	class USkeletalMeshComponent*                 Skeletal_Mesh;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UStaticMesh*>                    DestMeshes;                                        // 0x0008(0x0010)(Parm, OutParm)
	TArray<struct FVector>                        DestMeshes_Locations;                              // 0x0018(0x0010)(Parm, OutParm)
	TArray<struct FRotator>                       DestMeshes_Rotators;                               // 0x0028(0x0010)(Parm, OutParm)
	struct FVector                                MeshScale;                                         // 0x0038(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UFXSystemAsset*>                 DestMeshes_FX;                                     // 0x0050(0x0010)(Parm, OutParm)
	TArray<double>                                DestMeshes_FX_Scale;                               // 0x0060(0x0010)(Parm, OutParm)
	TArray<class UFXSystemAsset*>                 DestMeshes_FXattached;                             // 0x0070(0x0010)(Parm, OutParm)
	TArray<double>                                DestMeshes_FXattached_Scale;                       // 0x0080(0x0010)(Parm, OutParm)
	TArray<struct FVector>                        DestMeshes_LinearImpulse;                          // 0x0090(0x0010)(Parm, OutParm)
	TArray<struct FVector>                        DestMeshes_AngularImpulse;                         // 0x00A0(0x0010)(Parm, OutParm)
	double                                        CallFunc_RandomFloatInRange_ReturnValue;           // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B8[0x8];                                       // 0x00B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetSocketTransform_ReturnValue;           // 0x00C0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_GetSocketTransform_ReturnValue_1;         // 0x0120(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0180(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0198(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x01B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location_1;                // 0x01C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation_1;                // 0x01E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale_1;                   // 0x01F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_GetSocketTransform_ReturnValue_2;         // 0x0210(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_GetSocketTransform_ReturnValue_3;         // 0x0270(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location_2;                // 0x02D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation_2;                // 0x02E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale_2;                   // 0x0300(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location_3;                // 0x0318(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation_3;                // 0x0330(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale_3;                   // 0x0348(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentScale_ReturnValue;         // 0x0360(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FRotator>                       K2Node_MakeArray_Array;                            // 0x0378(0x0010)(ReferenceParm)
	TArray<struct FVector>                        K2Node_MakeArray_Array_1;                          // 0x0388(0x0010)(ReferenceParm)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x0398(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_2;         // 0x03A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_3;         // 0x03A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x03B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_4;         // 0x03C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_TransformDirection_ReturnValue;           // 0x03D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_5;         // 0x03E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_6;         // 0x03F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x03F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_7;         // 0x0410(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_TransformDirection_ReturnValue_1;         // 0x0418(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_8;         // 0x0430(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_9;         // 0x0438(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_2;                 // 0x0440(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_10;        // 0x0458(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_TransformDirection_ReturnValue_2;         // 0x0460(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_11;        // 0x0478(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_12;        // 0x0480(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_3;                 // 0x0488(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_13;        // 0x04A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_TransformDirection_ReturnValue_3;         // 0x04A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_14;        // 0x04C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_15;        // 0x04C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_4;                 // 0x04D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_16;        // 0x04E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_TransformDirection_ReturnValue_4;         // 0x04F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_17;        // 0x0508(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_18;        // 0x0510(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_5;                 // 0x0518(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_19;        // 0x0530(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_TransformDirection_ReturnValue_5;         // 0x0538(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_20;        // 0x0550(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_21;        // 0x0558(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_22;        // 0x0560(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_23;        // 0x0568(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_6;                 // 0x0570(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_7;                 // 0x0588(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_TransformDirection_ReturnValue_6;         // 0x05A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_TransformDirection_ReturnValue_7;         // 0x05B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FVector>                        K2Node_MakeArray_Array_2;                          // 0x05D0(0x0010)(ReferenceParm)
	TArray<struct FVector>                        K2Node_MakeArray_Array_3;                          // 0x05E0(0x0010)(ReferenceParm)
	TArray<double>                                K2Node_MakeArray_Array_4;                          // 0x05F0(0x0010)(ReferenceParm)
	TArray<double>                                K2Node_MakeArray_Array_5;                          // 0x0600(0x0010)(ReferenceParm)
	TArray<class UFXSystemAsset*>                 K2Node_MakeArray_Array_6;                          // 0x0610(0x0010)(ReferenceParm)
	TArray<class UFXSystemAsset*>                 K2Node_MakeArray_Array_7;                          // 0x0620(0x0010)(ReferenceParm)
	TArray<class UStaticMesh*>                    K2Node_MakeArray_Array_8;                          // 0x0630(0x0010)(ReferenceParm)
};
static_assert(alignof(BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup) == 0x000010, "Wrong alignment on BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup");
static_assert(sizeof(BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup) == 0x000640, "Wrong size on BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup");
static_assert(offsetof(BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup, Skeletal_Mesh) == 0x000000, "Member 'BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup::Skeletal_Mesh' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup, DestMeshes) == 0x000008, "Member 'BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup::DestMeshes' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup, DestMeshes_Locations) == 0x000018, "Member 'BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup::DestMeshes_Locations' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup, DestMeshes_Rotators) == 0x000028, "Member 'BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup::DestMeshes_Rotators' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup, MeshScale) == 0x000038, "Member 'BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup::MeshScale' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup, DestMeshes_FX) == 0x000050, "Member 'BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup::DestMeshes_FX' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup, DestMeshes_FX_Scale) == 0x000060, "Member 'BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup::DestMeshes_FX_Scale' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup, DestMeshes_FXattached) == 0x000070, "Member 'BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup::DestMeshes_FXattached' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup, DestMeshes_FXattached_Scale) == 0x000080, "Member 'BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup::DestMeshes_FXattached_Scale' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup, DestMeshes_LinearImpulse) == 0x000090, "Member 'BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup::DestMeshes_LinearImpulse' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup, DestMeshes_AngularImpulse) == 0x0000A0, "Member 'BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup::DestMeshes_AngularImpulse' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup, CallFunc_RandomFloatInRange_ReturnValue) == 0x0000B0, "Member 'BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup, CallFunc_GetSocketTransform_ReturnValue) == 0x0000C0, "Member 'BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup::CallFunc_GetSocketTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup, CallFunc_GetSocketTransform_ReturnValue_1) == 0x000120, "Member 'BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup::CallFunc_GetSocketTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup, CallFunc_BreakTransform_Location) == 0x000180, "Member 'BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup, CallFunc_BreakTransform_Rotation) == 0x000198, "Member 'BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup, CallFunc_BreakTransform_Scale) == 0x0001B0, "Member 'BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup, CallFunc_BreakTransform_Location_1) == 0x0001C8, "Member 'BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup::CallFunc_BreakTransform_Location_1' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup, CallFunc_BreakTransform_Rotation_1) == 0x0001E0, "Member 'BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup::CallFunc_BreakTransform_Rotation_1' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup, CallFunc_BreakTransform_Scale_1) == 0x0001F8, "Member 'BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup::CallFunc_BreakTransform_Scale_1' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup, CallFunc_GetSocketTransform_ReturnValue_2) == 0x000210, "Member 'BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup::CallFunc_GetSocketTransform_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup, CallFunc_GetSocketTransform_ReturnValue_3) == 0x000270, "Member 'BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup::CallFunc_GetSocketTransform_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup, CallFunc_BreakTransform_Location_2) == 0x0002D0, "Member 'BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup::CallFunc_BreakTransform_Location_2' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup, CallFunc_BreakTransform_Rotation_2) == 0x0002E8, "Member 'BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup::CallFunc_BreakTransform_Rotation_2' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup, CallFunc_BreakTransform_Scale_2) == 0x000300, "Member 'BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup::CallFunc_BreakTransform_Scale_2' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup, CallFunc_BreakTransform_Location_3) == 0x000318, "Member 'BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup::CallFunc_BreakTransform_Location_3' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup, CallFunc_BreakTransform_Rotation_3) == 0x000330, "Member 'BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup::CallFunc_BreakTransform_Rotation_3' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup, CallFunc_BreakTransform_Scale_3) == 0x000348, "Member 'BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup::CallFunc_BreakTransform_Scale_3' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup, CallFunc_K2_GetComponentScale_ReturnValue) == 0x000360, "Member 'BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup::CallFunc_K2_GetComponentScale_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup, K2Node_MakeArray_Array) == 0x000378, "Member 'BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup, K2Node_MakeArray_Array_1) == 0x000388, "Member 'BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x000398, "Member 'BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup, CallFunc_RandomFloatInRange_ReturnValue_2) == 0x0003A0, "Member 'BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup::CallFunc_RandomFloatInRange_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup, CallFunc_RandomFloatInRange_ReturnValue_3) == 0x0003A8, "Member 'BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup::CallFunc_RandomFloatInRange_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup, CallFunc_MakeVector_ReturnValue) == 0x0003B0, "Member 'BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup, CallFunc_RandomFloatInRange_ReturnValue_4) == 0x0003C8, "Member 'BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup::CallFunc_RandomFloatInRange_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup, CallFunc_TransformDirection_ReturnValue) == 0x0003D0, "Member 'BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup::CallFunc_TransformDirection_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup, CallFunc_RandomFloatInRange_ReturnValue_5) == 0x0003E8, "Member 'BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup::CallFunc_RandomFloatInRange_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup, CallFunc_RandomFloatInRange_ReturnValue_6) == 0x0003F0, "Member 'BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup::CallFunc_RandomFloatInRange_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup, CallFunc_MakeVector_ReturnValue_1) == 0x0003F8, "Member 'BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup, CallFunc_RandomFloatInRange_ReturnValue_7) == 0x000410, "Member 'BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup::CallFunc_RandomFloatInRange_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup, CallFunc_TransformDirection_ReturnValue_1) == 0x000418, "Member 'BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup::CallFunc_TransformDirection_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup, CallFunc_RandomFloatInRange_ReturnValue_8) == 0x000430, "Member 'BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup::CallFunc_RandomFloatInRange_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup, CallFunc_RandomFloatInRange_ReturnValue_9) == 0x000438, "Member 'BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup::CallFunc_RandomFloatInRange_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup, CallFunc_MakeVector_ReturnValue_2) == 0x000440, "Member 'BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup::CallFunc_MakeVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup, CallFunc_RandomFloatInRange_ReturnValue_10) == 0x000458, "Member 'BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup::CallFunc_RandomFloatInRange_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup, CallFunc_TransformDirection_ReturnValue_2) == 0x000460, "Member 'BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup::CallFunc_TransformDirection_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup, CallFunc_RandomFloatInRange_ReturnValue_11) == 0x000478, "Member 'BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup::CallFunc_RandomFloatInRange_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup, CallFunc_RandomFloatInRange_ReturnValue_12) == 0x000480, "Member 'BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup::CallFunc_RandomFloatInRange_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup, CallFunc_MakeVector_ReturnValue_3) == 0x000488, "Member 'BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup::CallFunc_MakeVector_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup, CallFunc_RandomFloatInRange_ReturnValue_13) == 0x0004A0, "Member 'BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup::CallFunc_RandomFloatInRange_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup, CallFunc_TransformDirection_ReturnValue_3) == 0x0004A8, "Member 'BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup::CallFunc_TransformDirection_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup, CallFunc_RandomFloatInRange_ReturnValue_14) == 0x0004C0, "Member 'BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup::CallFunc_RandomFloatInRange_ReturnValue_14' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup, CallFunc_RandomFloatInRange_ReturnValue_15) == 0x0004C8, "Member 'BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup::CallFunc_RandomFloatInRange_ReturnValue_15' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup, CallFunc_MakeVector_ReturnValue_4) == 0x0004D0, "Member 'BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup::CallFunc_MakeVector_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup, CallFunc_RandomFloatInRange_ReturnValue_16) == 0x0004E8, "Member 'BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup::CallFunc_RandomFloatInRange_ReturnValue_16' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup, CallFunc_TransformDirection_ReturnValue_4) == 0x0004F0, "Member 'BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup::CallFunc_TransformDirection_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup, CallFunc_RandomFloatInRange_ReturnValue_17) == 0x000508, "Member 'BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup::CallFunc_RandomFloatInRange_ReturnValue_17' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup, CallFunc_RandomFloatInRange_ReturnValue_18) == 0x000510, "Member 'BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup::CallFunc_RandomFloatInRange_ReturnValue_18' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup, CallFunc_MakeVector_ReturnValue_5) == 0x000518, "Member 'BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup::CallFunc_MakeVector_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup, CallFunc_RandomFloatInRange_ReturnValue_19) == 0x000530, "Member 'BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup::CallFunc_RandomFloatInRange_ReturnValue_19' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup, CallFunc_TransformDirection_ReturnValue_5) == 0x000538, "Member 'BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup::CallFunc_TransformDirection_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup, CallFunc_RandomFloatInRange_ReturnValue_20) == 0x000550, "Member 'BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup::CallFunc_RandomFloatInRange_ReturnValue_20' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup, CallFunc_RandomFloatInRange_ReturnValue_21) == 0x000558, "Member 'BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup::CallFunc_RandomFloatInRange_ReturnValue_21' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup, CallFunc_RandomFloatInRange_ReturnValue_22) == 0x000560, "Member 'BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup::CallFunc_RandomFloatInRange_ReturnValue_22' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup, CallFunc_RandomFloatInRange_ReturnValue_23) == 0x000568, "Member 'BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup::CallFunc_RandomFloatInRange_ReturnValue_23' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup, CallFunc_MakeVector_ReturnValue_6) == 0x000570, "Member 'BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup::CallFunc_MakeVector_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup, CallFunc_MakeVector_ReturnValue_7) == 0x000588, "Member 'BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup::CallFunc_MakeVector_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup, CallFunc_TransformDirection_ReturnValue_6) == 0x0005A0, "Member 'BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup::CallFunc_TransformDirection_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup, CallFunc_TransformDirection_ReturnValue_7) == 0x0005B8, "Member 'BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup::CallFunc_TransformDirection_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup, K2Node_MakeArray_Array_2) == 0x0005D0, "Member 'BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup, K2Node_MakeArray_Array_3) == 0x0005E0, "Member 'BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup::K2Node_MakeArray_Array_3' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup, K2Node_MakeArray_Array_4) == 0x0005F0, "Member 'BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup::K2Node_MakeArray_Array_4' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup, K2Node_MakeArray_Array_5) == 0x000600, "Member 'BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup::K2Node_MakeArray_Array_5' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup, K2Node_MakeArray_Array_6) == 0x000610, "Member 'BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup::K2Node_MakeArray_Array_6' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup, K2Node_MakeArray_Array_7) == 0x000620, "Member 'BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup::K2Node_MakeArray_Array_7' has a wrong offset!");
static_assert(offsetof(BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup, K2Node_MakeArray_Array_8) == 0x000630, "Member 'BP_BD_DYN_SalvageCentre_C_Destructible_Salvage_Custom_Setup::K2Node_MakeArray_Array_8' has a wrong offset!");

// Function BP_BD_DYN_SalvageCentre.BP_BD_DYN_SalvageCentre_C.ExecuteUbergraph_BP_BD_DYN_SalvageCentre
// 0x0628 (0x0628 - 0x0000)
struct BP_BD_DYN_SalvageCentre_C_ExecuteUbergraph_BP_BD_DYN_SalvageCentre final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0008(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
