#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BD_VETI_TempestHeart

#include "Basic.hpp"

#include "PhysicsCore_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_BD_VETI_TempestHeart.BP_BD_VETI_TempestHeart_C.ExecuteUbergraph_BP_BD_VETI_TempestHeart
// 0x07B0 (0x07B0 - 0x0000)
struct BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_5;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_4;                  // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_6;                 // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_4;                   // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_HealthPct;                            // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_7;                 // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue_1;          // 0x0062(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue_2;          // 0x0063(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EObjectTypeQuery>                      K2Node_MakeArray_Array;                            // 0x0068(0x0010)(ConstParm, ReferenceParm)
	class UAnimMontage*                           CallFunc_GetCurrentMontage_ReturnValue;            // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_82[0x6];                                       // 0x0082(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0088(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_1;          // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x00C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue;     // 0x00D8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_ED[0x3];                                       // 0x00ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x00F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0108(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_1;          // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0120(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_2;          // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x0138(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_3;          // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_4;              // 0x0150(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_5;              // 0x0160(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_4;          // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_5;          // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_Array_Get_Item;                           // 0x0180(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18C[0x4];                                      // 0x018C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_RandomFloatInRange_ReturnValue;           // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Conv_VectorToVector2D_ReturnValue;        // 0x0198(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFXSystemComponent*                     CallFunc_SpawnEffectAtLocation_ReturnValue;        // 0x01A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetGroundLocation_ReturnValue;            // 0x01B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_1;                          // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_1;                          // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_1;                          // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x0200(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item_1;                         // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CallFunc_Array_Get_Item_2;                         // 0x0220(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0228(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0240(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x0244(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0249(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24A[0x2];                                      // 0x024A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x024C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_Array_Get_Item_3;                         // 0x0250(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_4;               // 0x0258(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x025C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25D[0x3];                                      // 0x025D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_5;                  // 0x0260(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_4;                // 0x0264(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_265[0x3];                                      // 0x0265(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_8;                 // 0x0268(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26C[0x4];                                      // 0x026C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   CallFunc_Array_Get_Item_4;                         // 0x0270(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_2;           // 0x0278(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_5;               // 0x0290(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0294(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_5;                // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_299[0x7];                                      // 0x0299(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CallFunc_Array_Get_Item_5;                         // 0x02B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_6;               // 0x02B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2BC[0x4];                                      // 0x02BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_RandomFloatInRange_ReturnValue_2;         // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_6;                // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C9[0x7];                                      // 0x02C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_RandomFloatInRange_ReturnValue_3;         // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x02D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x02F0(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_4;         // 0x03E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_1;                // 0x03F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector2D                              CallFunc_Conv_VectorToVector2D_ReturnValue_1;      // 0x0408(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetGroundLocation_ReturnValue_1;          // 0x0418(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0430(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        CallFunc_SpawnDecalAtLocation_ReturnValue;         // 0x0438(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VEase_ReturnValue;                        // 0x0440(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x0458(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         Temp_int_Array_Index_Variable_5;                   // 0x0550(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_554[0x4];                                      // 0x0554(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x0558(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Array_Get_Item_6;                         // 0x0560(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_6;              // 0x0570(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_6;          // 0x0580(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScalarParameterValue_ReturnValue;      // 0x0588(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DoubleDouble_ReturnValue;      // 0x058C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_58D[0x3];                                      // 0x058D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UStaticMeshComponent*>           K2Node_MakeArray_Array_1;                          // 0x0590(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UStaticMeshComponent*                   CallFunc_Array_Get_Item_7;                         // 0x05A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CallFunc_Array_Get_Item_8;                         // 0x05A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_7;               // 0x05B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_8;               // 0x05B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_7;                // 0x05B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_8;                // 0x05B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5BA[0x6];                                      // 0x05BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_3;      // 0x05C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x05C8(0x0010)(ConstParm, ReferenceParm)
	struct FHitResult                             CallFunc_LineTraceSingleForObjects_OutHit;         // 0x05D8(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingleForObjects_ReturnValue;    // 0x06D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPhysicalSurface                              CallFunc_GetSurfaceType_ReturnValue;               // 0x06D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6D2[0x2];                                      // 0x06D2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x06D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UNiagaraComponent*>              K2Node_MakeArray_Array_2;                          // 0x06D8(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_IsFogOfWarVisibleForLocalPlayer_ReturnValue; // 0x06E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x06E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6EA[0x6];                                      // 0x06EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSoundAtLocation_ReturnValue;         // 0x06F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x06F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x06F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x06FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6FB[0x5];                                      // 0x06FB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x0700(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x0718(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        CallFunc_SpawnDecalAtLocation_ReturnValue_1;       // 0x0730(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast;         // 0x0738(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast_1;       // 0x0740(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast_2;       // 0x0748(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_LessEqual_DoubleDouble_A_ImplicitCast;    // 0x0750(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast; // 0x0758(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast_1; // 0x075C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetFloatParameter_Param_ImplicitCast;     // 0x0760(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Yaw_ImplicitCast;             // 0x0764(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Pitch_ImplicitCast;           // 0x0768(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Roll_ImplicitCast;            // 0x076C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Roll_ImplicitCast_1;          // 0x0770(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_774[0x4];                                      // 0x0774(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x0778(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VEase_Alpha_ImplicitCast;                 // 0x0780(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_784[0x4];                                      // 0x0784(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_B_ImplicitCast;     // 0x0788(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValueOnMaterials_ParameterValue_ImplicitCast; // 0x0790(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValueOnMaterials_ParameterValue_ImplicitCast_1; // 0x0794(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_EqualEqual_DoubleDouble_A_ImplicitCast;   // 0x0798(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast_1;   // 0x07A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast_2; // 0x07A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart) == 0x000008, "Wrong alignment on BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart");
static_assert(sizeof(BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart) == 0x0007B0, "Wrong size on BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart");
static_assert(offsetof(BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart, EntryPoint) == 0x000000, "Member 'BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart, Temp_int_Variable) == 0x000004, "Member 'BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart, Temp_int_Variable_1) == 0x000008, "Member 'BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart, CallFunc_Add_IntInt_ReturnValue_1) == 0x000010, "Member 'BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart, CallFunc_IsValid_ReturnValue) == 0x000014, "Member 'BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart, Temp_int_Array_Index_Variable) == 0x000018, "Member 'BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart, Temp_int_Loop_Counter_Variable) == 0x00001C, "Member 'BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart, CallFunc_Add_IntInt_ReturnValue_2) == 0x000020, "Member 'BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart, Temp_int_Array_Index_Variable_1) == 0x000024, "Member 'BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart, Temp_int_Loop_Counter_Variable_1) == 0x000028, "Member 'BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart, Temp_int_Loop_Counter_Variable_2) == 0x00002C, "Member 'BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart, CallFunc_Add_IntInt_ReturnValue_3) == 0x000030, "Member 'BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart, CallFunc_Add_IntInt_ReturnValue_4) == 0x000034, "Member 'BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart::CallFunc_Add_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart, Temp_int_Array_Index_Variable_2) == 0x000038, "Member 'BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart, Temp_int_Loop_Counter_Variable_3) == 0x00003C, "Member 'BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart::Temp_int_Loop_Counter_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart, CallFunc_Add_IntInt_ReturnValue_5) == 0x000040, "Member 'BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart::CallFunc_Add_IntInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart, Temp_int_Array_Index_Variable_3) == 0x000044, "Member 'BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart::Temp_int_Array_Index_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart, Temp_int_Loop_Counter_Variable_4) == 0x000048, "Member 'BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart::Temp_int_Loop_Counter_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart, CallFunc_Add_IntInt_ReturnValue_6) == 0x00004C, "Member 'BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart::CallFunc_Add_IntInt_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart, Temp_int_Array_Index_Variable_4) == 0x000050, "Member 'BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart::Temp_int_Array_Index_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart, Temp_int_Variable_2) == 0x000054, "Member 'BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart, K2Node_Event_HealthPct) == 0x000058, "Member 'BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart::K2Node_Event_HealthPct' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart, CallFunc_Add_IntInt_ReturnValue_7) == 0x00005C, "Member 'BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart::CallFunc_Add_IntInt_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x000060, "Member 'BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000061, "Member 'BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart, CallFunc_Less_DoubleDouble_ReturnValue_1) == 0x000062, "Member 'BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart::CallFunc_Less_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart, CallFunc_Less_DoubleDouble_ReturnValue_2) == 0x000063, "Member 'BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart::CallFunc_Less_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart, K2Node_MakeArray_Array) == 0x000068, "Member 'BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart, CallFunc_GetCurrentMontage_ReturnValue) == 0x000078, "Member 'BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart::CallFunc_GetCurrentMontage_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart, CallFunc_IsDedicatedServer_ReturnValue) == 0x000080, "Member 'BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000081, "Member 'BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000088, "Member 'BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart, CallFunc_IsDedicatedServer_ReturnValue_1) == 0x0000A0, "Member 'BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart::CallFunc_IsDedicatedServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart, CallFunc_Add_VectorVector_ReturnValue) == 0x0000A8, "Member 'BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart, CallFunc_Add_VectorVector_ReturnValue_1) == 0x0000C0, "Member 'BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart, CallFunc_Conv_VectorToLinearColor_ReturnValue) == 0x0000D8, "Member 'BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart::CallFunc_Conv_VectorToLinearColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart, CallFunc_Array_Length_ReturnValue) == 0x0000E8, "Member 'BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart, CallFunc_Less_IntInt_ReturnValue) == 0x0000EC, "Member 'BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart, CallFunc_Concat_StrStr_ReturnValue) == 0x0000F0, "Member 'BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart, CallFunc_Conv_StringToName_ReturnValue) == 0x000100, "Member 'BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000108, "Member 'BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart, CallFunc_Conv_StringToName_ReturnValue_1) == 0x000118, "Member 'BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart::CallFunc_Conv_StringToName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000120, "Member 'BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart, CallFunc_Conv_StringToName_ReturnValue_2) == 0x000130, "Member 'BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart::CallFunc_Conv_StringToName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart, CallFunc_Concat_StrStr_ReturnValue_3) == 0x000138, "Member 'BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart, CallFunc_Conv_StringToName_ReturnValue_3) == 0x000148, "Member 'BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart::CallFunc_Conv_StringToName_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart, CallFunc_Concat_StrStr_ReturnValue_4) == 0x000150, "Member 'BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart::CallFunc_Concat_StrStr_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart, CallFunc_Concat_StrStr_ReturnValue_5) == 0x000160, "Member 'BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart::CallFunc_Concat_StrStr_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart, CallFunc_Conv_StringToName_ReturnValue_4) == 0x000170, "Member 'BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart::CallFunc_Conv_StringToName_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart, CallFunc_Conv_StringToName_ReturnValue_5) == 0x000178, "Member 'BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart::CallFunc_Conv_StringToName_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart, CallFunc_Array_Get_Item) == 0x000180, "Member 'BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart, CallFunc_Array_Length_ReturnValue_1) == 0x000188, "Member 'BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart, CallFunc_RandomFloatInRange_ReturnValue) == 0x000190, "Member 'BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart, CallFunc_Conv_VectorToVector2D_ReturnValue) == 0x000198, "Member 'BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart::CallFunc_Conv_VectorToVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart, CallFunc_SpawnEffectAtLocation_ReturnValue) == 0x0001A8, "Member 'BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart::CallFunc_SpawnEffectAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart, CallFunc_GetGroundLocation_ReturnValue) == 0x0001B0, "Member 'BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart::CallFunc_GetGroundLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart, CallFunc_BreakVector_X) == 0x0001C8, "Member 'BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart, CallFunc_BreakVector_Y) == 0x0001D0, "Member 'BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart, CallFunc_BreakVector_Z) == 0x0001D8, "Member 'BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart, CallFunc_BreakVector_X_1) == 0x0001E0, "Member 'BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart, CallFunc_BreakVector_Y_1) == 0x0001E8, "Member 'BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart, CallFunc_BreakVector_Z_1) == 0x0001F0, "Member 'BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x0001F8, "Member 'BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart, CallFunc_GetSocketLocation_ReturnValue) == 0x000200, "Member 'BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart, CallFunc_Array_Get_Item_1) == 0x000218, "Member 'BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart, CallFunc_Array_Get_Item_2) == 0x000220, "Member 'BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000228, "Member 'BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart, CallFunc_Array_Length_ReturnValue_2) == 0x000240, "Member 'BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart, CallFunc_Array_Length_ReturnValue_3) == 0x000244, "Member 'BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart, CallFunc_Less_IntInt_ReturnValue_1) == 0x000248, "Member 'BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart, CallFunc_Less_IntInt_ReturnValue_2) == 0x000249, "Member 'BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart, CallFunc_Array_Add_ReturnValue) == 0x00024C, "Member 'BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart, CallFunc_Array_Get_Item_3) == 0x000250, "Member 'BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart, CallFunc_Array_Length_ReturnValue_4) == 0x000258, "Member 'BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart::CallFunc_Array_Length_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart, CallFunc_Less_IntInt_ReturnValue_3) == 0x00025C, "Member 'BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart::CallFunc_Less_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart, Temp_int_Loop_Counter_Variable_5) == 0x000260, "Member 'BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart::Temp_int_Loop_Counter_Variable_5' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart, CallFunc_Less_IntInt_ReturnValue_4) == 0x000264, "Member 'BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart::CallFunc_Less_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart, CallFunc_Add_IntInt_ReturnValue_8) == 0x000268, "Member 'BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart::CallFunc_Add_IntInt_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart, CallFunc_Array_Get_Item_4) == 0x000270, "Member 'BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart::CallFunc_Array_Get_Item_4' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart, CallFunc_Add_VectorVector_ReturnValue_2) == 0x000278, "Member 'BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart::CallFunc_Add_VectorVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart, CallFunc_Array_Length_ReturnValue_5) == 0x000290, "Member 'BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart::CallFunc_Array_Length_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart, CallFunc_Array_Add_ReturnValue_1) == 0x000294, "Member 'BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart, CallFunc_Less_IntInt_ReturnValue_5) == 0x000298, "Member 'BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart::CallFunc_Less_IntInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x0002A0, "Member 'BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x0002A8, "Member 'BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart, CallFunc_Array_Get_Item_5) == 0x0002B0, "Member 'BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart::CallFunc_Array_Get_Item_5' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart, CallFunc_Array_Length_ReturnValue_6) == 0x0002B8, "Member 'BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart::CallFunc_Array_Length_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart, CallFunc_RandomFloatInRange_ReturnValue_2) == 0x0002C0, "Member 'BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart::CallFunc_RandomFloatInRange_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart, CallFunc_Less_IntInt_ReturnValue_6) == 0x0002C8, "Member 'BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart::CallFunc_Less_IntInt_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart, CallFunc_RandomFloatInRange_ReturnValue_3) == 0x0002D0, "Member 'BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart::CallFunc_RandomFloatInRange_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart, CallFunc_MakeRotator_ReturnValue) == 0x0002D8, "Member 'BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x0002F0, "Member 'BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart, CallFunc_RandomFloatInRange_ReturnValue_4) == 0x0003E8, "Member 'BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart::CallFunc_RandomFloatInRange_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart, CallFunc_MakeRotator_ReturnValue_1) == 0x0003F0, "Member 'BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart::CallFunc_MakeRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart, CallFunc_Conv_VectorToVector2D_ReturnValue_1) == 0x000408, "Member 'BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart::CallFunc_Conv_VectorToVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart, CallFunc_GetGroundLocation_ReturnValue_1) == 0x000418, "Member 'BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart::CallFunc_GetGroundLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000430, "Member 'BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart, CallFunc_SpawnDecalAtLocation_ReturnValue) == 0x000438, "Member 'BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart::CallFunc_SpawnDecalAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart, CallFunc_VEase_ReturnValue) == 0x000440, "Member 'BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart::CallFunc_VEase_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x000458, "Member 'BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart, Temp_int_Array_Index_Variable_5) == 0x000550, "Member 'BP_BD_VETI_TempestHeart_C_ExecuteUbergraph_BP_BD_VETI_TempestHeart::Temp_int_Array_Index_Variable_5' has a wrong offset!");
