#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BD_GDF_Guardtower

#include "Basic.hpp"

#include "PhysicsCore_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Tempest_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_BD_GDF_Guardtower.BP_BD_GDF_Guardtower_C
// 0x0080 (0x1A80 - 0x1A00)
class ABP_BD_GDF_Guardtower_C final : public ATedStructureBase
{
public:
	uint8                                         Pad_19F8[0x8];                                     // 0x19F8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1A00(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      PS_DustStructurePlacement_01_ParamSize;            // 0x1A08(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        FireSFX;                                           // 0x1A10(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_Fire1;                                          // 0x1A18(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 ConDrone;                                          // 0x1A20(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          HitBox2;                                           // 0x1A28(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTedPawnContainerComponent*             TedPawnContainer;                                  // 0x1A30(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          HitBox1;                                           // 0x1A38(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         TL_DeactivateAndDestroy_Dissolve_A959B4E24AFB681D9F2029A854ADBAA0; // 0x1A40(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            TL_DeactivateAndDestroy__Direction_A959B4E24AFB681D9F2029A854ADBAA0; // 0x1A44(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A45[0x3];                                     // 0x1A45(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     TL_DeactivateAndDestroy;                           // 0x1A48(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         TL_OnDeath_NewTrack_1_E74E2B9B427C1D1748EE579C10A6D839; // 0x1A50(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            TL_OnDeath__Direction_E74E2B9B427C1D1748EE579C10A6D839; // 0x1A54(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A55[0x3];                                     // 0x1A55(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     TL_OnDeath;                                        // 0x1A58(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CachedActorLocation;                               // 0x1A60(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CachedSurfaceType;                                 // 0x1A78(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AnimMontageLength;                                 // 0x1A7C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Destructible(TArray<class UStaticMesh*>& DestMeshes, TArray<struct FVector>& DestMeshes_Locations, TArray<struct FRotator>& DestMeshes_Rotators, const struct FVector& MeshScale, TArray<class UFXSystemAsset*>& DestMeshes_exploFX, TArray<double>& DestMeshes_exploFX_Scale, TArray<class UFXSystemAsset*>& DestMeshes_attachedFX, TArray<double>& DestMeshes_attachedFX_Scale, TArray<struct FVector>& DestMeshes_LinearImpulse, TArray<struct FVector>& DestMeshes_AngularImpulse, TArray<class AStaticMeshActor*>* SpawnedMeshesArray, TArray<class UFXSystemComponent*>* SpawnedAttachedFXArray);
	void Destructible_GuardTower_Custom_Setup(class USkeletalMeshComponent* Skeletal_Mesh, TArray<class UStaticMesh*>* DestMeshes, TArray<struct FVector>* DestMeshes_Locations, TArray<struct FRotator>* DestMeshes_Rotators, struct FVector* MeshScale, TArray<class UFXSystemAsset*>* DestMeshes_FX, TArray<double>* DestMeshes_FX_Scale, TArray<class UFXSystemAsset*>* DestMeshes_FXattached, TArray<double>* DestMeshes_FXattached_Scale, TArray<struct FVector>* DestMeshes_LinearImpulse, TArray<struct FVector>* DestMeshes_AngularImpulse);
	void ExecuteUbergraph_BP_BD_GDF_Guardtower(int32 EntryPoint);
	void K2_OnEndSellingStructure();
	void OnBlendOut_3DD05A7C4A4932A2B11113BBEA46D641(class FName NotifyName);
	void OnCompleted_3DD05A7C4A4932A2B11113BBEA46D641(class FName NotifyName);
	void OnInterrupted_3DD05A7C4A4932A2B11113BBEA46D641(class FName NotifyName);
	void OnNotifyBegin_3DD05A7C4A4932A2B11113BBEA46D641(class FName NotifyName);
	void OnNotifyEnd_3DD05A7C4A4932A2B11113BBEA46D641(class FName NotifyName);
	void OnPlaySpawnEffectsCosmetic();
	void ReceiveBeginPlay();
	void ReceiveOnDeath();
	void ReceiveUpdateHealthEffects(float HealthPct);
	void TL_DeactivateAndDestroy__Deactivate_FX__EventFunc();
	void TL_DeactivateAndDestroy__FinishedFunc();
	void TL_DeactivateAndDestroy__UpdateFunc();
	void TL_OnDeath__Explosion__EventFunc();
	void TL_OnDeath__ExplosionAudio__EventFunc();
	void TL_OnDeath__FinishedFunc();
	void TL_OnDeath__SpawnChunks__EventFunc();
	void TL_OnDeath__SpawnDecal__EventFunc();
	void TL_OnDeath__UpdateFunc();
	void TurnLightsOnOff(class ATedPawn* Pawn);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_BD_GDF_Guardtower_C">();
	}
	static class ABP_BD_GDF_Guardtower_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_BD_GDF_Guardtower_C>();
	}
};
static_assert(alignof(ABP_BD_GDF_Guardtower_C) == 0x000010, "Wrong alignment on ABP_BD_GDF_Guardtower_C");
static_assert(sizeof(ABP_BD_GDF_Guardtower_C) == 0x001A80, "Wrong size on ABP_BD_GDF_Guardtower_C");
static_assert(offsetof(ABP_BD_GDF_Guardtower_C, UberGraphFrame) == 0x001A00, "Member 'ABP_BD_GDF_Guardtower_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_BD_GDF_Guardtower_C, PS_DustStructurePlacement_01_ParamSize) == 0x001A08, "Member 'ABP_BD_GDF_Guardtower_C::PS_DustStructurePlacement_01_ParamSize' has a wrong offset!");
static_assert(offsetof(ABP_BD_GDF_Guardtower_C, FireSFX) == 0x001A10, "Member 'ABP_BD_GDF_Guardtower_C::FireSFX' has a wrong offset!");
static_assert(offsetof(ABP_BD_GDF_Guardtower_C, NS_Fire1) == 0x001A18, "Member 'ABP_BD_GDF_Guardtower_C::NS_Fire1' has a wrong offset!");
static_assert(offsetof(ABP_BD_GDF_Guardtower_C, ConDrone) == 0x001A20, "Member 'ABP_BD_GDF_Guardtower_C::ConDrone' has a wrong offset!");
static_assert(offsetof(ABP_BD_GDF_Guardtower_C, HitBox2) == 0x001A28, "Member 'ABP_BD_GDF_Guardtower_C::HitBox2' has a wrong offset!");
static_assert(offsetof(ABP_BD_GDF_Guardtower_C, TedPawnContainer) == 0x001A30, "Member 'ABP_BD_GDF_Guardtower_C::TedPawnContainer' has a wrong offset!");
static_assert(offsetof(ABP_BD_GDF_Guardtower_C, HitBox1) == 0x001A38, "Member 'ABP_BD_GDF_Guardtower_C::HitBox1' has a wrong offset!");
static_assert(offsetof(ABP_BD_GDF_Guardtower_C, TL_DeactivateAndDestroy_Dissolve_A959B4E24AFB681D9F2029A854ADBAA0) == 0x001A40, "Member 'ABP_BD_GDF_Guardtower_C::TL_DeactivateAndDestroy_Dissolve_A959B4E24AFB681D9F2029A854ADBAA0' has a wrong offset!");
static_assert(offsetof(ABP_BD_GDF_Guardtower_C, TL_DeactivateAndDestroy__Direction_A959B4E24AFB681D9F2029A854ADBAA0) == 0x001A44, "Member 'ABP_BD_GDF_Guardtower_C::TL_DeactivateAndDestroy__Direction_A959B4E24AFB681D9F2029A854ADBAA0' has a wrong offset!");
static_assert(offsetof(ABP_BD_GDF_Guardtower_C, TL_DeactivateAndDestroy) == 0x001A48, "Member 'ABP_BD_GDF_Guardtower_C::TL_DeactivateAndDestroy' has a wrong offset!");
static_assert(offsetof(ABP_BD_GDF_Guardtower_C, TL_OnDeath_NewTrack_1_E74E2B9B427C1D1748EE579C10A6D839) == 0x001A50, "Member 'ABP_BD_GDF_Guardtower_C::TL_OnDeath_NewTrack_1_E74E2B9B427C1D1748EE579C10A6D839' has a wrong offset!");
static_assert(offsetof(ABP_BD_GDF_Guardtower_C, TL_OnDeath__Direction_E74E2B9B427C1D1748EE579C10A6D839) == 0x001A54, "Member 'ABP_BD_GDF_Guardtower_C::TL_OnDeath__Direction_E74E2B9B427C1D1748EE579C10A6D839' has a wrong offset!");
static_assert(offsetof(ABP_BD_GDF_Guardtower_C, TL_OnDeath) == 0x001A58, "Member 'ABP_BD_GDF_Guardtower_C::TL_OnDeath' has a wrong offset!");
static_assert(offsetof(ABP_BD_GDF_Guardtower_C, CachedActorLocation) == 0x001A60, "Member 'ABP_BD_GDF_Guardtower_C::CachedActorLocation' has a wrong offset!");
static_assert(offsetof(ABP_BD_GDF_Guardtower_C, CachedSurfaceType) == 0x001A78, "Member 'ABP_BD_GDF_Guardtower_C::CachedSurfaceType' has a wrong offset!");
static_assert(offsetof(ABP_BD_GDF_Guardtower_C, AnimMontageLength) == 0x001A7C, "Member 'ABP_BD_GDF_Guardtower_C::AnimMontageLength' has a wrong offset!");

}

