#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BuildingAmbienceActor

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_BuildingAmbienceActor.BP_BuildingAmbienceActor_C.ExecuteUbergraph_BP_BuildingAmbienceActor
// 0x0010 (0x0010 - 0x0000)
struct BP_BuildingAmbienceActor_C_ExecuteUbergraph_BP_BuildingAmbienceActor final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Building_Count;                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_1;        // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_2;        // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BuildingAmbienceActor_C_ExecuteUbergraph_BP_BuildingAmbienceActor) == 0x000004, "Wrong alignment on BP_BuildingAmbienceActor_C_ExecuteUbergraph_BP_BuildingAmbienceActor");
static_assert(sizeof(BP_BuildingAmbienceActor_C_ExecuteUbergraph_BP_BuildingAmbienceActor) == 0x000010, "Wrong size on BP_BuildingAmbienceActor_C_ExecuteUbergraph_BP_BuildingAmbienceActor");
static_assert(offsetof(BP_BuildingAmbienceActor_C_ExecuteUbergraph_BP_BuildingAmbienceActor, EntryPoint) == 0x000000, "Member 'BP_BuildingAmbienceActor_C_ExecuteUbergraph_BP_BuildingAmbienceActor::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_BuildingAmbienceActor_C_ExecuteUbergraph_BP_BuildingAmbienceActor, K2Node_CustomEvent_Building_Count) == 0x000004, "Member 'BP_BuildingAmbienceActor_C_ExecuteUbergraph_BP_BuildingAmbienceActor::K2Node_CustomEvent_Building_Count' has a wrong offset!");
static_assert(offsetof(BP_BuildingAmbienceActor_C_ExecuteUbergraph_BP_BuildingAmbienceActor, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000008, "Member 'BP_BuildingAmbienceActor_C_ExecuteUbergraph_BP_BuildingAmbienceActor::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BuildingAmbienceActor_C_ExecuteUbergraph_BP_BuildingAmbienceActor, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000009, "Member 'BP_BuildingAmbienceActor_C_ExecuteUbergraph_BP_BuildingAmbienceActor::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BuildingAmbienceActor_C_ExecuteUbergraph_BP_BuildingAmbienceActor, CallFunc_Less_IntInt_ReturnValue) == 0x00000A, "Member 'BP_BuildingAmbienceActor_C_ExecuteUbergraph_BP_BuildingAmbienceActor::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BuildingAmbienceActor_C_ExecuteUbergraph_BP_BuildingAmbienceActor, CallFunc_GreaterEqual_IntInt_ReturnValue_1) == 0x00000B, "Member 'BP_BuildingAmbienceActor_C_ExecuteUbergraph_BP_BuildingAmbienceActor::CallFunc_GreaterEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BuildingAmbienceActor_C_ExecuteUbergraph_BP_BuildingAmbienceActor, CallFunc_BooleanAND_ReturnValue) == 0x00000C, "Member 'BP_BuildingAmbienceActor_C_ExecuteUbergraph_BP_BuildingAmbienceActor::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BuildingAmbienceActor_C_ExecuteUbergraph_BP_BuildingAmbienceActor, CallFunc_Less_IntInt_ReturnValue_1) == 0x00000D, "Member 'BP_BuildingAmbienceActor_C_ExecuteUbergraph_BP_BuildingAmbienceActor::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BuildingAmbienceActor_C_ExecuteUbergraph_BP_BuildingAmbienceActor, CallFunc_BooleanAND_ReturnValue_1) == 0x00000E, "Member 'BP_BuildingAmbienceActor_C_ExecuteUbergraph_BP_BuildingAmbienceActor::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BuildingAmbienceActor_C_ExecuteUbergraph_BP_BuildingAmbienceActor, CallFunc_GreaterEqual_IntInt_ReturnValue_2) == 0x00000F, "Member 'BP_BuildingAmbienceActor_C_ExecuteUbergraph_BP_BuildingAmbienceActor::CallFunc_GreaterEqual_IntInt_ReturnValue_2' has a wrong offset!");

// Function BP_BuildingAmbienceActor.BP_BuildingAmbienceActor_C.Update Cue Parameters
// 0x0004 (0x0004 - 0x0000)
struct BP_BuildingAmbienceActor_C_Update_Cue_Parameters final
{
public:
	int32                                         Building_Count;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BuildingAmbienceActor_C_Update_Cue_Parameters) == 0x000004, "Wrong alignment on BP_BuildingAmbienceActor_C_Update_Cue_Parameters");
static_assert(sizeof(BP_BuildingAmbienceActor_C_Update_Cue_Parameters) == 0x000004, "Wrong size on BP_BuildingAmbienceActor_C_Update_Cue_Parameters");
static_assert(offsetof(BP_BuildingAmbienceActor_C_Update_Cue_Parameters, Building_Count) == 0x000000, "Member 'BP_BuildingAmbienceActor_C_Update_Cue_Parameters::Building_Count' has a wrong offset!");

}

