#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BD_DYN_RefineryV2

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Tempest_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_BD_DYN_RefineryV2.BP_BD_DYN_RefineryV2_C
// 0x0110 (0x1D20 - 0x1C10)
class ABP_BD_DYN_RefineryV2_C final : public ATedStructureRefinery_DYN_V2
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1C10(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBP_BuildingAmbience_C*                 BP_BuildingAmbience;                               // 0x1C18(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               PS_SmokeDYNTemperstRigDmgHeavy_3;                  // 0x1C20(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               PS_SmokeDYNTemperstRigDmgHeavy_2;                  // 0x1C28(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               PS_SmokeDYNTemperstRigDmgHeavy_1;                  // 0x1C30(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               PS_SmokeDYNTemperstRigDmgMedium_2;                 // 0x1C38(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               PS_SmokeDYNTemperstRigDmgMedium_1;                 // 0x1C40(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               PS_SmokeDYNTemperstRigDmgLight_2;                  // 0x1C48(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               PS_SmokeDYNTemperstRigDmgLight_1;                  // 0x1C50(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               PS_SmokeDYNTempestRigV2_01;                        // 0x1C58(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      PS_SmokeRefineryV2DYN_01_Wind;                     // 0x1C60(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          HitBox2;                                           // 0x1C68(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   PointLight_3;                                      // 0x1C70(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   PointLight_2;                                      // 0x1C78(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   PointLight_1;                                      // 0x1C80(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          HitBox;                                            // 0x1C88(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         TL_OnDeath_NewTrack_1_B79C543C48A85098C0DB97AC328261A2; // 0x1C90(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            TL_OnDeath__Direction_B79C543C48A85098C0DB97AC328261A2; // 0x1C94(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C95[0x3];                                     // 0x1C95(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     TL_OnDeath;                                        // 0x1C98(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         TL_DeactivateAndDestroy_Dissolve_F1DDDE5B421132F08D6580A32D4E9464; // 0x1CA0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            TL_DeactivateAndDestroy__Direction_F1DDDE5B421132F08D6580A32D4E9464; // 0x1CA4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1CA5[0x3];                                     // 0x1CA5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     TL_DeactivateAndDestroy;                           // 0x1CA8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         TL_Explosion_Dissolve_999EC7D444FC545D7EF5518A296631E2; // 0x1CB0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TL_Explosion_Explosion_999EC7D444FC545D7EF5518A296631E2; // 0x1CB4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            TL_Explosion__Direction_999EC7D444FC545D7EF5518A296631E2; // 0x1CB8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1CB9[0x7];                                     // 0x1CB9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     TL_Explosion;                                      // 0x1CC0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CachedActorLocation;                               // 0x1CC8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Explosion_Strength;                                // 0x1CE0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Explosion_Radius;                                  // 0x1CE8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Explosion_Falloff_Exp;                             // 0x1CF0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FString>                         Explosion_Slot_Array;                              // 0x1CF8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FString                                 Explosion_Slot_Current;                            // 0x1D08(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          Explosion_Slot_Found;                              // 0x1D18(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Destructible(TArray<class UStaticMesh*>& DestMeshes, TArray<struct FVector>& DestMeshes_Locations, TArray<struct FRotator>& DestMeshes_Rotators, const struct FVector& MeshScale, TArray<class UFXSystemAsset*>& DestMeshes_exploFX, TArray<double>& DestMeshes_exploFX_Scale, TArray<class UFXSystemAsset*>& DestMeshes_attachedFX, TArray<double>& DestMeshes_attachedFX_Scale, TArray<struct FVector>& DestMeshes_LinearImpulse, TArray<struct FVector>& DestMeshes_AngularImpulse, TArray<class AStaticMeshActor*>* SpawnedMeshesArray, TArray<class UFXSystemComponent*>* SpawnedAttachedFXArray);
	void Destructible_Refinery_Custom_Setup(class USkeletalMeshComponent* Skeletal_Mesh, TArray<class UStaticMesh*>* DestMeshes, TArray<struct FVector>* DestMeshes_Locations, TArray<struct FRotator>* DestMeshes_Rotators, struct FVector* MeshScale, TArray<class UFXSystemAsset*>* DestMeshes_FX, TArray<double>* DestMeshes_FX_Scale, TArray<class UFXSystemAsset*>* DestMeshes_FXattached, TArray<double>* DestMeshes_FXattached_Scale, TArray<struct FVector>* DestMeshes_LinearImpulse, TArray<struct FVector>* DestMeshes_AngularImpulse);
	void ExecuteUbergraph_BP_BD_DYN_RefineryV2(int32 EntryPoint);
	void Found_Free_Explosion_Slot();
	void GetIdleEffectComponents(TArray<class USceneComponent*>* Components);
	void ReceiveBeginPlay();
	void ReceiveOnDeath();
	void ReceiveUpdateHealthEffects(float HealthPct);
	void TL_DeactivateAndDestroy__Deactivate_FX__EventFunc();
	void TL_DeactivateAndDestroy__FinishedFunc();
	void TL_DeactivateAndDestroy__UpdateFunc();
	void TL_Explosion__FinishedFunc();
	void TL_Explosion__UpdateFunc();
	void TL_OnDeath__Explosion__EventFunc();
	void TL_OnDeath__ExplosionAudio__EventFunc();
	void TL_OnDeath__FinishedFunc();
	void TL_OnDeath__SpawnChunks__EventFunc();
	void TL_OnDeath__SpawnDecal__EventFunc();
	void TL_OnDeath__UpdateFunc();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_BD_DYN_RefineryV2_C">();
	}
	static class ABP_BD_DYN_RefineryV2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_BD_DYN_RefineryV2_C>();
	}
};
static_assert(alignof(ABP_BD_DYN_RefineryV2_C) == 0x000010, "Wrong alignment on ABP_BD_DYN_RefineryV2_C");
static_assert(sizeof(ABP_BD_DYN_RefineryV2_C) == 0x001D20, "Wrong size on ABP_BD_DYN_RefineryV2_C");
static_assert(offsetof(ABP_BD_DYN_RefineryV2_C, UberGraphFrame) == 0x001C10, "Member 'ABP_BD_DYN_RefineryV2_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_RefineryV2_C, BP_BuildingAmbience) == 0x001C18, "Member 'ABP_BD_DYN_RefineryV2_C::BP_BuildingAmbience' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_RefineryV2_C, PS_SmokeDYNTemperstRigDmgHeavy_3) == 0x001C20, "Member 'ABP_BD_DYN_RefineryV2_C::PS_SmokeDYNTemperstRigDmgHeavy_3' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_RefineryV2_C, PS_SmokeDYNTemperstRigDmgHeavy_2) == 0x001C28, "Member 'ABP_BD_DYN_RefineryV2_C::PS_SmokeDYNTemperstRigDmgHeavy_2' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_RefineryV2_C, PS_SmokeDYNTemperstRigDmgHeavy_1) == 0x001C30, "Member 'ABP_BD_DYN_RefineryV2_C::PS_SmokeDYNTemperstRigDmgHeavy_1' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_RefineryV2_C, PS_SmokeDYNTemperstRigDmgMedium_2) == 0x001C38, "Member 'ABP_BD_DYN_RefineryV2_C::PS_SmokeDYNTemperstRigDmgMedium_2' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_RefineryV2_C, PS_SmokeDYNTemperstRigDmgMedium_1) == 0x001C40, "Member 'ABP_BD_DYN_RefineryV2_C::PS_SmokeDYNTemperstRigDmgMedium_1' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_RefineryV2_C, PS_SmokeDYNTemperstRigDmgLight_2) == 0x001C48, "Member 'ABP_BD_DYN_RefineryV2_C::PS_SmokeDYNTemperstRigDmgLight_2' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_RefineryV2_C, PS_SmokeDYNTemperstRigDmgLight_1) == 0x001C50, "Member 'ABP_BD_DYN_RefineryV2_C::PS_SmokeDYNTemperstRigDmgLight_1' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_RefineryV2_C, PS_SmokeDYNTempestRigV2_01) == 0x001C58, "Member 'ABP_BD_DYN_RefineryV2_C::PS_SmokeDYNTempestRigV2_01' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_RefineryV2_C, PS_SmokeRefineryV2DYN_01_Wind) == 0x001C60, "Member 'ABP_BD_DYN_RefineryV2_C::PS_SmokeRefineryV2DYN_01_Wind' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_RefineryV2_C, HitBox2) == 0x001C68, "Member 'ABP_BD_DYN_RefineryV2_C::HitBox2' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_RefineryV2_C, PointLight_3) == 0x001C70, "Member 'ABP_BD_DYN_RefineryV2_C::PointLight_3' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_RefineryV2_C, PointLight_2) == 0x001C78, "Member 'ABP_BD_DYN_RefineryV2_C::PointLight_2' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_RefineryV2_C, PointLight_1) == 0x001C80, "Member 'ABP_BD_DYN_RefineryV2_C::PointLight_1' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_RefineryV2_C, HitBox) == 0x001C88, "Member 'ABP_BD_DYN_RefineryV2_C::HitBox' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_RefineryV2_C, TL_OnDeath_NewTrack_1_B79C543C48A85098C0DB97AC328261A2) == 0x001C90, "Member 'ABP_BD_DYN_RefineryV2_C::TL_OnDeath_NewTrack_1_B79C543C48A85098C0DB97AC328261A2' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_RefineryV2_C, TL_OnDeath__Direction_B79C543C48A85098C0DB97AC328261A2) == 0x001C94, "Member 'ABP_BD_DYN_RefineryV2_C::TL_OnDeath__Direction_B79C543C48A85098C0DB97AC328261A2' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_RefineryV2_C, TL_OnDeath) == 0x001C98, "Member 'ABP_BD_DYN_RefineryV2_C::TL_OnDeath' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_RefineryV2_C, TL_DeactivateAndDestroy_Dissolve_F1DDDE5B421132F08D6580A32D4E9464) == 0x001CA0, "Member 'ABP_BD_DYN_RefineryV2_C::TL_DeactivateAndDestroy_Dissolve_F1DDDE5B421132F08D6580A32D4E9464' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_RefineryV2_C, TL_DeactivateAndDestroy__Direction_F1DDDE5B421132F08D6580A32D4E9464) == 0x001CA4, "Member 'ABP_BD_DYN_RefineryV2_C::TL_DeactivateAndDestroy__Direction_F1DDDE5B421132F08D6580A32D4E9464' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_RefineryV2_C, TL_DeactivateAndDestroy) == 0x001CA8, "Member 'ABP_BD_DYN_RefineryV2_C::TL_DeactivateAndDestroy' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_RefineryV2_C, TL_Explosion_Dissolve_999EC7D444FC545D7EF5518A296631E2) == 0x001CB0, "Member 'ABP_BD_DYN_RefineryV2_C::TL_Explosion_Dissolve_999EC7D444FC545D7EF5518A296631E2' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_RefineryV2_C, TL_Explosion_Explosion_999EC7D444FC545D7EF5518A296631E2) == 0x001CB4, "Member 'ABP_BD_DYN_RefineryV2_C::TL_Explosion_Explosion_999EC7D444FC545D7EF5518A296631E2' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_RefineryV2_C, TL_Explosion__Direction_999EC7D444FC545D7EF5518A296631E2) == 0x001CB8, "Member 'ABP_BD_DYN_RefineryV2_C::TL_Explosion__Direction_999EC7D444FC545D7EF5518A296631E2' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_RefineryV2_C, TL_Explosion) == 0x001CC0, "Member 'ABP_BD_DYN_RefineryV2_C::TL_Explosion' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_RefineryV2_C, CachedActorLocation) == 0x001CC8, "Member 'ABP_BD_DYN_RefineryV2_C::CachedActorLocation' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_RefineryV2_C, Explosion_Strength) == 0x001CE0, "Member 'ABP_BD_DYN_RefineryV2_C::Explosion_Strength' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_RefineryV2_C, Explosion_Radius) == 0x001CE8, "Member 'ABP_BD_DYN_RefineryV2_C::Explosion_Radius' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_RefineryV2_C, Explosion_Falloff_Exp) == 0x001CF0, "Member 'ABP_BD_DYN_RefineryV2_C::Explosion_Falloff_Exp' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_RefineryV2_C, Explosion_Slot_Array) == 0x001CF8, "Member 'ABP_BD_DYN_RefineryV2_C::Explosion_Slot_Array' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_RefineryV2_C, Explosion_Slot_Current) == 0x001D08, "Member 'ABP_BD_DYN_RefineryV2_C::Explosion_Slot_Current' has a wrong offset!");
static_assert(offsetof(ABP_BD_DYN_RefineryV2_C, Explosion_Slot_Found) == 0x001D18, "Member 'ABP_BD_DYN_RefineryV2_C::Explosion_Slot_Found' has a wrong offset!");

}

