#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Conformation_Bridge

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function BP_Conformation_Bridge.BP_Conformation_Bridge_C.ExecuteUbergraph_BP_Conformation_Bridge
// 0x00A8 (0x00A8 - 0x0000)
struct BP_Conformation_Bridge_C_ExecuteUbergraph_BP_Conformation_Bridge final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasBegunPlay_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_InInstigator_1;                       // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_Event_InState_2;                            // 0x0010(0x0008)(ConstParm, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_InValue_2;                            // 0x0018(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class AActor*                           K2Node_Event_InInstigator;                         // 0x0020(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_Event_InState_1;                            // 0x0028(0x0008)(ConstParm, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_InValue_1;                            // 0x0030(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATedVehicle*                            K2Node_DynamicCast_AsTed_Vehicle;                  // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_K2_GetStateValue_ReturnValue;             // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DoubleDouble_ReturnValue;      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            K2Node_Select_Default;                             // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     CallFunc_GetMaterial_ReturnValue;                  // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_Event_InState;                              // 0x0068(0x0008)(ConstParm, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_InValue;                              // 0x0070(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DoubleDouble_ReturnValue_1;    // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DoubleDouble_ReturnValue_2;    // 0x0075(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0076(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_77[0x1];                                       // 0x0077(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            K2Node_Select_Default_1;                           // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_ChangeState_InDelay_ImplicitCast;         // 0x0084(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_EqualEqual_DoubleDouble_A_ImplicitCast;   // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_EqualEqual_DoubleDouble_A_ImplicitCast_1; // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_UpdateBuildProgress_InStateValue_ImplicitCast; // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_EqualEqual_DoubleDouble_A_ImplicitCast_2; // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Conformation_Bridge_C_ExecuteUbergraph_BP_Conformation_Bridge) == 0x000008, "Wrong alignment on BP_Conformation_Bridge_C_ExecuteUbergraph_BP_Conformation_Bridge");
static_assert(sizeof(BP_Conformation_Bridge_C_ExecuteUbergraph_BP_Conformation_Bridge) == 0x0000A8, "Wrong size on BP_Conformation_Bridge_C_ExecuteUbergraph_BP_Conformation_Bridge");
static_assert(offsetof(BP_Conformation_Bridge_C_ExecuteUbergraph_BP_Conformation_Bridge, EntryPoint) == 0x000000, "Member 'BP_Conformation_Bridge_C_ExecuteUbergraph_BP_Conformation_Bridge::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Conformation_Bridge_C_ExecuteUbergraph_BP_Conformation_Bridge, CallFunc_HasBegunPlay_ReturnValue) == 0x000004, "Member 'BP_Conformation_Bridge_C_ExecuteUbergraph_BP_Conformation_Bridge::CallFunc_HasBegunPlay_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Conformation_Bridge_C_ExecuteUbergraph_BP_Conformation_Bridge, Temp_bool_Variable) == 0x000005, "Member 'BP_Conformation_Bridge_C_ExecuteUbergraph_BP_Conformation_Bridge::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_Conformation_Bridge_C_ExecuteUbergraph_BP_Conformation_Bridge, K2Node_Event_InInstigator_1) == 0x000008, "Member 'BP_Conformation_Bridge_C_ExecuteUbergraph_BP_Conformation_Bridge::K2Node_Event_InInstigator_1' has a wrong offset!");
static_assert(offsetof(BP_Conformation_Bridge_C_ExecuteUbergraph_BP_Conformation_Bridge, K2Node_Event_InState_2) == 0x000010, "Member 'BP_Conformation_Bridge_C_ExecuteUbergraph_BP_Conformation_Bridge::K2Node_Event_InState_2' has a wrong offset!");
static_assert(offsetof(BP_Conformation_Bridge_C_ExecuteUbergraph_BP_Conformation_Bridge, K2Node_Event_InValue_2) == 0x000018, "Member 'BP_Conformation_Bridge_C_ExecuteUbergraph_BP_Conformation_Bridge::K2Node_Event_InValue_2' has a wrong offset!");
static_assert(offsetof(BP_Conformation_Bridge_C_ExecuteUbergraph_BP_Conformation_Bridge, K2Node_Event_InInstigator) == 0x000020, "Member 'BP_Conformation_Bridge_C_ExecuteUbergraph_BP_Conformation_Bridge::K2Node_Event_InInstigator' has a wrong offset!");
static_assert(offsetof(BP_Conformation_Bridge_C_ExecuteUbergraph_BP_Conformation_Bridge, K2Node_Event_InState_1) == 0x000028, "Member 'BP_Conformation_Bridge_C_ExecuteUbergraph_BP_Conformation_Bridge::K2Node_Event_InState_1' has a wrong offset!");
static_assert(offsetof(BP_Conformation_Bridge_C_ExecuteUbergraph_BP_Conformation_Bridge, K2Node_Event_InValue_1) == 0x000030, "Member 'BP_Conformation_Bridge_C_ExecuteUbergraph_BP_Conformation_Bridge::K2Node_Event_InValue_1' has a wrong offset!");
static_assert(offsetof(BP_Conformation_Bridge_C_ExecuteUbergraph_BP_Conformation_Bridge, K2Node_DynamicCast_AsTed_Vehicle) == 0x000038, "Member 'BP_Conformation_Bridge_C_ExecuteUbergraph_BP_Conformation_Bridge::K2Node_DynamicCast_AsTed_Vehicle' has a wrong offset!");
static_assert(offsetof(BP_Conformation_Bridge_C_ExecuteUbergraph_BP_Conformation_Bridge, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'BP_Conformation_Bridge_C_ExecuteUbergraph_BP_Conformation_Bridge::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Conformation_Bridge_C_ExecuteUbergraph_BP_Conformation_Bridge, CallFunc_K2_GetStateValue_ReturnValue) == 0x000044, "Member 'BP_Conformation_Bridge_C_ExecuteUbergraph_BP_Conformation_Bridge::CallFunc_K2_GetStateValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Conformation_Bridge_C_ExecuteUbergraph_BP_Conformation_Bridge, CallFunc_EqualEqual_DoubleDouble_ReturnValue) == 0x000048, "Member 'BP_Conformation_Bridge_C_ExecuteUbergraph_BP_Conformation_Bridge::CallFunc_EqualEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Conformation_Bridge_C_ExecuteUbergraph_BP_Conformation_Bridge, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000050, "Member 'BP_Conformation_Bridge_C_ExecuteUbergraph_BP_Conformation_Bridge::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Conformation_Bridge_C_ExecuteUbergraph_BP_Conformation_Bridge, K2Node_Select_Default) == 0x000058, "Member 'BP_Conformation_Bridge_C_ExecuteUbergraph_BP_Conformation_Bridge::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_Conformation_Bridge_C_ExecuteUbergraph_BP_Conformation_Bridge, CallFunc_GetMaterial_ReturnValue) == 0x000060, "Member 'BP_Conformation_Bridge_C_ExecuteUbergraph_BP_Conformation_Bridge::CallFunc_GetMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Conformation_Bridge_C_ExecuteUbergraph_BP_Conformation_Bridge, K2Node_Event_InState) == 0x000068, "Member 'BP_Conformation_Bridge_C_ExecuteUbergraph_BP_Conformation_Bridge::K2Node_Event_InState' has a wrong offset!");
static_assert(offsetof(BP_Conformation_Bridge_C_ExecuteUbergraph_BP_Conformation_Bridge, K2Node_Event_InValue) == 0x000070, "Member 'BP_Conformation_Bridge_C_ExecuteUbergraph_BP_Conformation_Bridge::K2Node_Event_InValue' has a wrong offset!");
static_assert(offsetof(BP_Conformation_Bridge_C_ExecuteUbergraph_BP_Conformation_Bridge, CallFunc_EqualEqual_DoubleDouble_ReturnValue_1) == 0x000074, "Member 'BP_Conformation_Bridge_C_ExecuteUbergraph_BP_Conformation_Bridge::CallFunc_EqualEqual_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Conformation_Bridge_C_ExecuteUbergraph_BP_Conformation_Bridge, CallFunc_EqualEqual_DoubleDouble_ReturnValue_2) == 0x000075, "Member 'BP_Conformation_Bridge_C_ExecuteUbergraph_BP_Conformation_Bridge::CallFunc_EqualEqual_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Conformation_Bridge_C_ExecuteUbergraph_BP_Conformation_Bridge, Temp_bool_Variable_1) == 0x000076, "Member 'BP_Conformation_Bridge_C_ExecuteUbergraph_BP_Conformation_Bridge::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Conformation_Bridge_C_ExecuteUbergraph_BP_Conformation_Bridge, K2Node_Select_Default_1) == 0x000078, "Member 'BP_Conformation_Bridge_C_ExecuteUbergraph_BP_Conformation_Bridge::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(BP_Conformation_Bridge_C_ExecuteUbergraph_BP_Conformation_Bridge, CallFunc_SetStaticMesh_ReturnValue) == 0x000080, "Member 'BP_Conformation_Bridge_C_ExecuteUbergraph_BP_Conformation_Bridge::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Conformation_Bridge_C_ExecuteUbergraph_BP_Conformation_Bridge, CallFunc_ChangeState_InDelay_ImplicitCast) == 0x000084, "Member 'BP_Conformation_Bridge_C_ExecuteUbergraph_BP_Conformation_Bridge::CallFunc_ChangeState_InDelay_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Conformation_Bridge_C_ExecuteUbergraph_BP_Conformation_Bridge, CallFunc_EqualEqual_DoubleDouble_A_ImplicitCast) == 0x000088, "Member 'BP_Conformation_Bridge_C_ExecuteUbergraph_BP_Conformation_Bridge::CallFunc_EqualEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Conformation_Bridge_C_ExecuteUbergraph_BP_Conformation_Bridge, CallFunc_EqualEqual_DoubleDouble_A_ImplicitCast_1) == 0x000090, "Member 'BP_Conformation_Bridge_C_ExecuteUbergraph_BP_Conformation_Bridge::CallFunc_EqualEqual_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_Conformation_Bridge_C_ExecuteUbergraph_BP_Conformation_Bridge, CallFunc_UpdateBuildProgress_InStateValue_ImplicitCast) == 0x000098, "Member 'BP_Conformation_Bridge_C_ExecuteUbergraph_BP_Conformation_Bridge::CallFunc_UpdateBuildProgress_InStateValue_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Conformation_Bridge_C_ExecuteUbergraph_BP_Conformation_Bridge, CallFunc_EqualEqual_DoubleDouble_A_ImplicitCast_2) == 0x0000A0, "Member 'BP_Conformation_Bridge_C_ExecuteUbergraph_BP_Conformation_Bridge::CallFunc_EqualEqual_DoubleDouble_A_ImplicitCast_2' has a wrong offset!");

// Function BP_Conformation_Bridge.BP_Conformation_Bridge_C.OnRequestChangeState
// 0x0018 (0x0018 - 0x0000)
struct BP_Conformation_Bridge_C_OnRequestChangeState final
{
public:
	class AActor*                                 InInstigator;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           InState;                                           // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	float                                         InValue;                                           // 0x0010(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Conformation_Bridge_C_OnRequestChangeState) == 0x000008, "Wrong alignment on BP_Conformation_Bridge_C_OnRequestChangeState");
static_assert(sizeof(BP_Conformation_Bridge_C_OnRequestChangeState) == 0x000018, "Wrong size on BP_Conformation_Bridge_C_OnRequestChangeState");
static_assert(offsetof(BP_Conformation_Bridge_C_OnRequestChangeState, InInstigator) == 0x000000, "Member 'BP_Conformation_Bridge_C_OnRequestChangeState::InInstigator' has a wrong offset!");
static_assert(offsetof(BP_Conformation_Bridge_C_OnRequestChangeState, InState) == 0x000008, "Member 'BP_Conformation_Bridge_C_OnRequestChangeState::InState' has a wrong offset!");
static_assert(offsetof(BP_Conformation_Bridge_C_OnRequestChangeState, InValue) == 0x000010, "Member 'BP_Conformation_Bridge_C_OnRequestChangeState::InValue' has a wrong offset!");

// Function BP_Conformation_Bridge.BP_Conformation_Bridge_C.OnStateChangeCosmetic
// 0x000C (0x000C - 0x0000)
struct BP_Conformation_Bridge_C_OnStateChangeCosmetic final
{
public:
	struct FGameplayTag                           InState;                                           // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	float                                         InValue;                                           // 0x0008(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Conformation_Bridge_C_OnStateChangeCosmetic) == 0x000004, "Wrong alignment on BP_Conformation_Bridge_C_OnStateChangeCosmetic");
static_assert(sizeof(BP_Conformation_Bridge_C_OnStateChangeCosmetic) == 0x00000C, "Wrong size on BP_Conformation_Bridge_C_OnStateChangeCosmetic");
static_assert(offsetof(BP_Conformation_Bridge_C_OnStateChangeCosmetic, InState) == 0x000000, "Member 'BP_Conformation_Bridge_C_OnStateChangeCosmetic::InState' has a wrong offset!");
static_assert(offsetof(BP_Conformation_Bridge_C_OnStateChangeCosmetic, InValue) == 0x000008, "Member 'BP_Conformation_Bridge_C_OnStateChangeCosmetic::InValue' has a wrong offset!");

// Function BP_Conformation_Bridge.BP_Conformation_Bridge_C.ShowPreview
// 0x0018 (0x0018 - 0x0000)
struct BP_Conformation_Bridge_C_ShowPreview final
{
public:
	const class AActor*                           InInstigator;                                      // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           InState;                                           // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	float                                         InValue;                                           // 0x0010(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Conformation_Bridge_C_ShowPreview) == 0x000008, "Wrong alignment on BP_Conformation_Bridge_C_ShowPreview");
static_assert(sizeof(BP_Conformation_Bridge_C_ShowPreview) == 0x000018, "Wrong size on BP_Conformation_Bridge_C_ShowPreview");
static_assert(offsetof(BP_Conformation_Bridge_C_ShowPreview, InInstigator) == 0x000000, "Member 'BP_Conformation_Bridge_C_ShowPreview::InInstigator' has a wrong offset!");
static_assert(offsetof(BP_Conformation_Bridge_C_ShowPreview, InState) == 0x000008, "Member 'BP_Conformation_Bridge_C_ShowPreview::InState' has a wrong offset!");
static_assert(offsetof(BP_Conformation_Bridge_C_ShowPreview, InValue) == 0x000010, "Member 'BP_Conformation_Bridge_C_ShowPreview::InValue' has a wrong offset!");

// Function BP_Conformation_Bridge.BP_Conformation_Bridge_C.UpdateBuildProgress
// 0x0008 (0x0008 - 0x0000)
struct BP_Conformation_Bridge_C_UpdateBuildProgress final
{
public:
	double                                        InStateValue;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Conformation_Bridge_C_UpdateBuildProgress) == 0x000008, "Wrong alignment on BP_Conformation_Bridge_C_UpdateBuildProgress");
static_assert(sizeof(BP_Conformation_Bridge_C_UpdateBuildProgress) == 0x000008, "Wrong size on BP_Conformation_Bridge_C_UpdateBuildProgress");
static_assert(offsetof(BP_Conformation_Bridge_C_UpdateBuildProgress, InStateValue) == 0x000000, "Member 'BP_Conformation_Bridge_C_UpdateBuildProgress::InStateValue' has a wrong offset!");

// Function BP_Conformation_Bridge.BP_Conformation_Bridge_C.CanChangeState
// 0x0048 (0x0048 - 0x0000)
struct BP_Conformation_Bridge_C_CanChangeState final
{
public:
	const class AActor*                           InInstigator;                                      // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           InState;                                           // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	float                                         InValue;                                           // 0x0010(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0014(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DoubleDouble_ReturnValue;      // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DoubleDouble_ReturnValue_1;    // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanChangeState_ReturnValue;               // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetStateValue_ReturnValue;                // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DoubleDouble_ReturnValue_2;    // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DoubleDouble_ReturnValue_3;    // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x001F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_EqualEqual_DoubleDouble_A_ImplicitCast;   // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_EqualEqual_DoubleDouble_A_ImplicitCast_1; // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_EqualEqual_DoubleDouble_A_ImplicitCast_2; // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_EqualEqual_DoubleDouble_A_ImplicitCast_3; // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Conformation_Bridge_C_CanChangeState) == 0x000008, "Wrong alignment on BP_Conformation_Bridge_C_CanChangeState");
static_assert(sizeof(BP_Conformation_Bridge_C_CanChangeState) == 0x000048, "Wrong size on BP_Conformation_Bridge_C_CanChangeState");
static_assert(offsetof(BP_Conformation_Bridge_C_CanChangeState, InInstigator) == 0x000000, "Member 'BP_Conformation_Bridge_C_CanChangeState::InInstigator' has a wrong offset!");
static_assert(offsetof(BP_Conformation_Bridge_C_CanChangeState, InState) == 0x000008, "Member 'BP_Conformation_Bridge_C_CanChangeState::InState' has a wrong offset!");
static_assert(offsetof(BP_Conformation_Bridge_C_CanChangeState, InValue) == 0x000010, "Member 'BP_Conformation_Bridge_C_CanChangeState::InValue' has a wrong offset!");
static_assert(offsetof(BP_Conformation_Bridge_C_CanChangeState, ReturnValue) == 0x000014, "Member 'BP_Conformation_Bridge_C_CanChangeState::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Conformation_Bridge_C_CanChangeState, CallFunc_EqualEqual_DoubleDouble_ReturnValue) == 0x000015, "Member 'BP_Conformation_Bridge_C_CanChangeState::CallFunc_EqualEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Conformation_Bridge_C_CanChangeState, CallFunc_EqualEqual_DoubleDouble_ReturnValue_1) == 0x000016, "Member 'BP_Conformation_Bridge_C_CanChangeState::CallFunc_EqualEqual_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Conformation_Bridge_C_CanChangeState, CallFunc_CanChangeState_ReturnValue) == 0x000017, "Member 'BP_Conformation_Bridge_C_CanChangeState::CallFunc_CanChangeState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Conformation_Bridge_C_CanChangeState, CallFunc_GetStateValue_ReturnValue) == 0x000018, "Member 'BP_Conformation_Bridge_C_CanChangeState::CallFunc_GetStateValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Conformation_Bridge_C_CanChangeState, CallFunc_EqualEqual_DoubleDouble_ReturnValue_2) == 0x00001C, "Member 'BP_Conformation_Bridge_C_CanChangeState::CallFunc_EqualEqual_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Conformation_Bridge_C_CanChangeState, CallFunc_EqualEqual_DoubleDouble_ReturnValue_3) == 0x00001D, "Member 'BP_Conformation_Bridge_C_CanChangeState::CallFunc_EqualEqual_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Conformation_Bridge_C_CanChangeState, CallFunc_BooleanAND_ReturnValue) == 0x00001E, "Member 'BP_Conformation_Bridge_C_CanChangeState::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Conformation_Bridge_C_CanChangeState, CallFunc_BooleanAND_ReturnValue_1) == 0x00001F, "Member 'BP_Conformation_Bridge_C_CanChangeState::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Conformation_Bridge_C_CanChangeState, CallFunc_BooleanOR_ReturnValue) == 0x000020, "Member 'BP_Conformation_Bridge_C_CanChangeState::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Conformation_Bridge_C_CanChangeState, CallFunc_EqualEqual_DoubleDouble_A_ImplicitCast) == 0x000028, "Member 'BP_Conformation_Bridge_C_CanChangeState::CallFunc_EqualEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Conformation_Bridge_C_CanChangeState, CallFunc_EqualEqual_DoubleDouble_A_ImplicitCast_1) == 0x000030, "Member 'BP_Conformation_Bridge_C_CanChangeState::CallFunc_EqualEqual_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_Conformation_Bridge_C_CanChangeState, CallFunc_EqualEqual_DoubleDouble_A_ImplicitCast_2) == 0x000038, "Member 'BP_Conformation_Bridge_C_CanChangeState::CallFunc_EqualEqual_DoubleDouble_A_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(BP_Conformation_Bridge_C_CanChangeState, CallFunc_EqualEqual_DoubleDouble_A_ImplicitCast_3) == 0x000040, "Member 'BP_Conformation_Bridge_C_CanChangeState::CallFunc_EqualEqual_DoubleDouble_A_ImplicitCast_3' has a wrong offset!");

// Function BP_Conformation_Bridge.BP_Conformation_Bridge_C.GetConformationPreviewMesh
// 0x00D0 (0x00D0 - 0x0000)
struct BP_Conformation_Bridge_C_GetConformationPreviewMesh final
{
public:
	struct FTransform                             Offset;                                            // 0x0000(0x0060)(Parm, OutParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStreamableRenderAsset*                 ReturnValue;                                       // 0x0060(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_68[0x8];                                       // 0x0068(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetRelativeTransform_ReturnValue;         // 0x0070(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Conformation_Bridge_C_GetConformationPreviewMesh) == 0x000010, "Wrong alignment on BP_Conformation_Bridge_C_GetConformationPreviewMesh");
static_assert(sizeof(BP_Conformation_Bridge_C_GetConformationPreviewMesh) == 0x0000D0, "Wrong size on BP_Conformation_Bridge_C_GetConformationPreviewMesh");
static_assert(offsetof(BP_Conformation_Bridge_C_GetConformationPreviewMesh, Offset) == 0x000000, "Member 'BP_Conformation_Bridge_C_GetConformationPreviewMesh::Offset' has a wrong offset!");
static_assert(offsetof(BP_Conformation_Bridge_C_GetConformationPreviewMesh, ReturnValue) == 0x000060, "Member 'BP_Conformation_Bridge_C_GetConformationPreviewMesh::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Conformation_Bridge_C_GetConformationPreviewMesh, CallFunc_GetRelativeTransform_ReturnValue) == 0x000070, "Member 'BP_Conformation_Bridge_C_GetConformationPreviewMesh::CallFunc_GetRelativeTransform_ReturnValue' has a wrong offset!");

// Function BP_Conformation_Bridge.BP_Conformation_Bridge_C.GetLocationsForActivator
// 0x00D0 (0x00D0 - 0x0000)
struct BP_Conformation_Bridge_C_GetLocationsForActivator final
{
public:
	TArray<struct FVector>                        OutLocations;                                      // 0x0000(0x0010)(Parm, OutParm)
	TArray<struct FVector>                        OutLoc;                                            // 0x0010(0x0010)(Edit, BlueprintVisible)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FVector>                        K2Node_MakeArray_Array;                            // 0x0060(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Array_Get_Item;                           // 0x0078(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GreaterGreater_VectorRotator_ReturnValue; // 0x0098(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Conformation_Bridge_C_GetLocationsForActivator) == 0x000008, "Wrong alignment on BP_Conformation_Bridge_C_GetLocationsForActivator");
static_assert(sizeof(BP_Conformation_Bridge_C_GetLocationsForActivator) == 0x0000D0, "Wrong size on BP_Conformation_Bridge_C_GetLocationsForActivator");
static_assert(offsetof(BP_Conformation_Bridge_C_GetLocationsForActivator, OutLocations) == 0x000000, "Member 'BP_Conformation_Bridge_C_GetLocationsForActivator::OutLocations' has a wrong offset!");
static_assert(offsetof(BP_Conformation_Bridge_C_GetLocationsForActivator, OutLoc) == 0x000010, "Member 'BP_Conformation_Bridge_C_GetLocationsForActivator::OutLoc' has a wrong offset!");
