#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CIV_Vehicle_Globetrotter_Fade

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_CIV_Vehicle_Globetrotter_Fade.BP_CIV_Vehicle_Globetrotter_Fade_C.ExecuteUbergraph_BP_CIV_Vehicle_Globetrotter_Fade
// 0x0210 (0x0210 - 0x0000)
struct BP_CIV_Vehicle_Globetrotter_Fade_C_ExecuteUbergraph_BP_CIV_Vehicle_Globetrotter_Fade final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue_1;          // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFXSystemComponent*                     CallFunc_SpawnEffectAtLocation_ReturnValue;        // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UFXSystemComponent*                     CallFunc_SpawnEffectAtLocation_ReturnValue_1;      // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue_2;          // 0x0050(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFXSystemComponent*                     CallFunc_SpawnEffectAtLocation_ReturnValue_2;      // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	const class UTedUnitDefinitionAsset*          CallFunc_GetDefinitionAsset_ReturnValue;           // 0x0070(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x0078(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue_1;        // 0x0098(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x00B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x00C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_1;      // 0x00E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_AddActorWorldOffset_SweepHitResult;    // 0x00F8(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class UMaterialInstanceDynamic*               CallFunc_Array_Get_Item;                           // 0x01F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_Array_Get_Item_1;                         // 0x01F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_DoubleToVector_InDouble_ImplicitCast; // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_DoubleToVector_InDouble_ImplicitCast_1; // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CIV_Vehicle_Globetrotter_Fade_C_ExecuteUbergraph_BP_CIV_Vehicle_Globetrotter_Fade) == 0x000008, "Wrong alignment on BP_CIV_Vehicle_Globetrotter_Fade_C_ExecuteUbergraph_BP_CIV_Vehicle_Globetrotter_Fade");
static_assert(sizeof(BP_CIV_Vehicle_Globetrotter_Fade_C_ExecuteUbergraph_BP_CIV_Vehicle_Globetrotter_Fade) == 0x000210, "Wrong size on BP_CIV_Vehicle_Globetrotter_Fade_C_ExecuteUbergraph_BP_CIV_Vehicle_Globetrotter_Fade");
static_assert(offsetof(BP_CIV_Vehicle_Globetrotter_Fade_C_ExecuteUbergraph_BP_CIV_Vehicle_Globetrotter_Fade, EntryPoint) == 0x000000, "Member 'BP_CIV_Vehicle_Globetrotter_Fade_C_ExecuteUbergraph_BP_CIV_Vehicle_Globetrotter_Fade::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_CIV_Vehicle_Globetrotter_Fade_C_ExecuteUbergraph_BP_CIV_Vehicle_Globetrotter_Fade, CallFunc_GetSocketLocation_ReturnValue) == 0x000008, "Member 'BP_CIV_Vehicle_Globetrotter_Fade_C_ExecuteUbergraph_BP_CIV_Vehicle_Globetrotter_Fade::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CIV_Vehicle_Globetrotter_Fade_C_ExecuteUbergraph_BP_CIV_Vehicle_Globetrotter_Fade, CallFunc_GetSocketLocation_ReturnValue_1) == 0x000020, "Member 'BP_CIV_Vehicle_Globetrotter_Fade_C_ExecuteUbergraph_BP_CIV_Vehicle_Globetrotter_Fade::CallFunc_GetSocketLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CIV_Vehicle_Globetrotter_Fade_C_ExecuteUbergraph_BP_CIV_Vehicle_Globetrotter_Fade, CallFunc_SpawnEffectAtLocation_ReturnValue) == 0x000038, "Member 'BP_CIV_Vehicle_Globetrotter_Fade_C_ExecuteUbergraph_BP_CIV_Vehicle_Globetrotter_Fade::CallFunc_SpawnEffectAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CIV_Vehicle_Globetrotter_Fade_C_ExecuteUbergraph_BP_CIV_Vehicle_Globetrotter_Fade, CallFunc_SpawnEffectAtLocation_ReturnValue_1) == 0x000040, "Member 'BP_CIV_Vehicle_Globetrotter_Fade_C_ExecuteUbergraph_BP_CIV_Vehicle_Globetrotter_Fade::CallFunc_SpawnEffectAtLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CIV_Vehicle_Globetrotter_Fade_C_ExecuteUbergraph_BP_CIV_Vehicle_Globetrotter_Fade, CallFunc_IsDedicatedServer_ReturnValue) == 0x000048, "Member 'BP_CIV_Vehicle_Globetrotter_Fade_C_ExecuteUbergraph_BP_CIV_Vehicle_Globetrotter_Fade::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CIV_Vehicle_Globetrotter_Fade_C_ExecuteUbergraph_BP_CIV_Vehicle_Globetrotter_Fade, CallFunc_GetSocketLocation_ReturnValue_2) == 0x000050, "Member 'BP_CIV_Vehicle_Globetrotter_Fade_C_ExecuteUbergraph_BP_CIV_Vehicle_Globetrotter_Fade::CallFunc_GetSocketLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CIV_Vehicle_Globetrotter_Fade_C_ExecuteUbergraph_BP_CIV_Vehicle_Globetrotter_Fade, CallFunc_SpawnEffectAtLocation_ReturnValue_2) == 0x000068, "Member 'BP_CIV_Vehicle_Globetrotter_Fade_C_ExecuteUbergraph_BP_CIV_Vehicle_Globetrotter_Fade::CallFunc_SpawnEffectAtLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CIV_Vehicle_Globetrotter_Fade_C_ExecuteUbergraph_BP_CIV_Vehicle_Globetrotter_Fade, CallFunc_GetDefinitionAsset_ReturnValue) == 0x000070, "Member 'BP_CIV_Vehicle_Globetrotter_Fade_C_ExecuteUbergraph_BP_CIV_Vehicle_Globetrotter_Fade::CallFunc_GetDefinitionAsset_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CIV_Vehicle_Globetrotter_Fade_C_ExecuteUbergraph_BP_CIV_Vehicle_Globetrotter_Fade, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x000078, "Member 'BP_CIV_Vehicle_Globetrotter_Fade_C_ExecuteUbergraph_BP_CIV_Vehicle_Globetrotter_Fade::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CIV_Vehicle_Globetrotter_Fade_C_ExecuteUbergraph_BP_CIV_Vehicle_Globetrotter_Fade, K2Node_Event_DeltaSeconds) == 0x000090, "Member 'BP_CIV_Vehicle_Globetrotter_Fade_C_ExecuteUbergraph_BP_CIV_Vehicle_Globetrotter_Fade::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_CIV_Vehicle_Globetrotter_Fade_C_ExecuteUbergraph_BP_CIV_Vehicle_Globetrotter_Fade, CallFunc_Conv_DoubleToVector_ReturnValue_1) == 0x000098, "Member 'BP_CIV_Vehicle_Globetrotter_Fade_C_ExecuteUbergraph_BP_CIV_Vehicle_Globetrotter_Fade::CallFunc_Conv_DoubleToVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CIV_Vehicle_Globetrotter_Fade_C_ExecuteUbergraph_BP_CIV_Vehicle_Globetrotter_Fade, CallFunc_GetActorForwardVector_ReturnValue) == 0x0000B0, "Member 'BP_CIV_Vehicle_Globetrotter_Fade_C_ExecuteUbergraph_BP_CIV_Vehicle_Globetrotter_Fade::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CIV_Vehicle_Globetrotter_Fade_C_ExecuteUbergraph_BP_CIV_Vehicle_Globetrotter_Fade, CallFunc_Multiply_VectorVector_ReturnValue) == 0x0000C8, "Member 'BP_CIV_Vehicle_Globetrotter_Fade_C_ExecuteUbergraph_BP_CIV_Vehicle_Globetrotter_Fade::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CIV_Vehicle_Globetrotter_Fade_C_ExecuteUbergraph_BP_CIV_Vehicle_Globetrotter_Fade, CallFunc_Multiply_VectorVector_ReturnValue_1) == 0x0000E0, "Member 'BP_CIV_Vehicle_Globetrotter_Fade_C_ExecuteUbergraph_BP_CIV_Vehicle_Globetrotter_Fade::CallFunc_Multiply_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CIV_Vehicle_Globetrotter_Fade_C_ExecuteUbergraph_BP_CIV_Vehicle_Globetrotter_Fade, CallFunc_K2_AddActorWorldOffset_SweepHitResult) == 0x0000F8, "Member 'BP_CIV_Vehicle_Globetrotter_Fade_C_ExecuteUbergraph_BP_CIV_Vehicle_Globetrotter_Fade::CallFunc_K2_AddActorWorldOffset_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_CIV_Vehicle_Globetrotter_Fade_C_ExecuteUbergraph_BP_CIV_Vehicle_Globetrotter_Fade, CallFunc_Array_Get_Item) == 0x0001F0, "Member 'BP_CIV_Vehicle_Globetrotter_Fade_C_ExecuteUbergraph_BP_CIV_Vehicle_Globetrotter_Fade::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_CIV_Vehicle_Globetrotter_Fade_C_ExecuteUbergraph_BP_CIV_Vehicle_Globetrotter_Fade, CallFunc_Array_Get_Item_1) == 0x0001F8, "Member 'BP_CIV_Vehicle_Globetrotter_Fade_C_ExecuteUbergraph_BP_CIV_Vehicle_Globetrotter_Fade::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_CIV_Vehicle_Globetrotter_Fade_C_ExecuteUbergraph_BP_CIV_Vehicle_Globetrotter_Fade, CallFunc_Conv_DoubleToVector_InDouble_ImplicitCast) == 0x000200, "Member 'BP_CIV_Vehicle_Globetrotter_Fade_C_ExecuteUbergraph_BP_CIV_Vehicle_Globetrotter_Fade::CallFunc_Conv_DoubleToVector_InDouble_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_CIV_Vehicle_Globetrotter_Fade_C_ExecuteUbergraph_BP_CIV_Vehicle_Globetrotter_Fade, CallFunc_Conv_DoubleToVector_InDouble_ImplicitCast_1) == 0x000208, "Member 'BP_CIV_Vehicle_Globetrotter_Fade_C_ExecuteUbergraph_BP_CIV_Vehicle_Globetrotter_Fade::CallFunc_Conv_DoubleToVector_InDouble_ImplicitCast_1' has a wrong offset!");

// Function BP_CIV_Vehicle_Globetrotter_Fade.BP_CIV_Vehicle_Globetrotter_Fade_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_CIV_Vehicle_Globetrotter_Fade_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CIV_Vehicle_Globetrotter_Fade_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_CIV_Vehicle_Globetrotter_Fade_C_ReceiveTick");
static_assert(sizeof(BP_CIV_Vehicle_Globetrotter_Fade_C_ReceiveTick) == 0x000004, "Wrong size on BP_CIV_Vehicle_Globetrotter_Fade_C_ReceiveTick");
static_assert(offsetof(BP_CIV_Vehicle_Globetrotter_Fade_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_CIV_Vehicle_Globetrotter_Fade_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

