#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CmdPreview_AttackMove

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_CmdPreview_AttackMove.BP_CmdPreview_AttackMove_C.ExecuteUbergraph_BP_CmdPreview_AttackMove
// 0x0008 (0x0008 - 0x0000)
struct BP_CmdPreview_AttackMove_C_ExecuteUbergraph_BP_CmdPreview_AttackMove final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CmdPreview_AttackMove_C_ExecuteUbergraph_BP_CmdPreview_AttackMove) == 0x000004, "Wrong alignment on BP_CmdPreview_AttackMove_C_ExecuteUbergraph_BP_CmdPreview_AttackMove");
static_assert(sizeof(BP_CmdPreview_AttackMove_C_ExecuteUbergraph_BP_CmdPreview_AttackMove) == 0x000008, "Wrong size on BP_CmdPreview_AttackMove_C_ExecuteUbergraph_BP_CmdPreview_AttackMove");
static_assert(offsetof(BP_CmdPreview_AttackMove_C_ExecuteUbergraph_BP_CmdPreview_AttackMove, EntryPoint) == 0x000000, "Member 'BP_CmdPreview_AttackMove_C_ExecuteUbergraph_BP_CmdPreview_AttackMove::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_CmdPreview_AttackMove_C_ExecuteUbergraph_BP_CmdPreview_AttackMove, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'BP_CmdPreview_AttackMove_C_ExecuteUbergraph_BP_CmdPreview_AttackMove::K2Node_Event_DeltaSeconds' has a wrong offset!");

// Function BP_CmdPreview_AttackMove.BP_CmdPreview_AttackMove_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_CmdPreview_AttackMove_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CmdPreview_AttackMove_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_CmdPreview_AttackMove_C_ReceiveTick");
static_assert(sizeof(BP_CmdPreview_AttackMove_C_ReceiveTick) == 0x000004, "Wrong size on BP_CmdPreview_AttackMove_C_ReceiveTick");
static_assert(offsetof(BP_CmdPreview_AttackMove_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_CmdPreview_AttackMove_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

