#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DYN_Infantry_Machinist

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_DYN_Infantry_Machinist.BP_DYN_Infantry_Machinist_C.ExecuteUbergraph_BP_DYN_Infantry_Machinist
// 0x0150 (0x0150 - 0x0000)
struct BP_DYN_Infantry_Machinist_C_ExecuteUbergraph_BP_DYN_Infantry_Machinist final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityAsync_WaitGameplayTagAdded*     CallFunc_WaitGameplayTagAddToActor_ReturnValue;    // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0020(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityAsync_WaitGameplayTagRemoved*   CallFunc_WaitGameplayTagRemoveFromActor_ReturnValue; // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetFireTarget_ReturnValue;                // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_1;          // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanFire_ReturnValue;                      // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasFireTarget_ReturnValue;                // 0x007B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_HasTarget;                      // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_ShutOff;                        // 0x007D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7E[0x2];                                       // 0x007E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_Array_Get_Item;                           // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTedWeapon*                             K2Node_Event_NewWeapon;                            // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTedWeapon*                             K2Node_Event_PreviousWeapon;                       // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue;        // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_2;          // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B2[0x6];                                       // 0x00B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_Array_Get_Item_1;                         // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C5[0x3];                                       // 0x00C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable;                                // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_Array_Get_Item_2;                         // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DD[0x3];                                       // 0x00DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x00F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_3;          // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_1;                              // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_Select_Default;                             // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_LinearColorLerp_ReturnValue;              // 0x0130(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsSelected;                          // 0x0140(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsHovered;                           // 0x0141(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0142(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetShouldDisplayPerkRange_ReturnValue;    // 0x0143(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0144(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_145[0x3];                                      // 0x0145(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetPlayRate_NewRate_ImplicitCast;         // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DYN_Infantry_Machinist_C_ExecuteUbergraph_BP_DYN_Infantry_Machinist) == 0x000008, "Wrong alignment on BP_DYN_Infantry_Machinist_C_ExecuteUbergraph_BP_DYN_Infantry_Machinist");
static_assert(sizeof(BP_DYN_Infantry_Machinist_C_ExecuteUbergraph_BP_DYN_Infantry_Machinist) == 0x000150, "Wrong size on BP_DYN_Infantry_Machinist_C_ExecuteUbergraph_BP_DYN_Infantry_Machinist");
static_assert(offsetof(BP_DYN_Infantry_Machinist_C_ExecuteUbergraph_BP_DYN_Infantry_Machinist, EntryPoint) == 0x000000, "Member 'BP_DYN_Infantry_Machinist_C_ExecuteUbergraph_BP_DYN_Infantry_Machinist::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_DYN_Infantry_Machinist_C_ExecuteUbergraph_BP_DYN_Infantry_Machinist, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BP_DYN_Infantry_Machinist_C_ExecuteUbergraph_BP_DYN_Infantry_Machinist::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_DYN_Infantry_Machinist_C_ExecuteUbergraph_BP_DYN_Infantry_Machinist, CallFunc_WaitGameplayTagAddToActor_ReturnValue) == 0x000018, "Member 'BP_DYN_Infantry_Machinist_C_ExecuteUbergraph_BP_DYN_Infantry_Machinist::CallFunc_WaitGameplayTagAddToActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DYN_Infantry_Machinist_C_ExecuteUbergraph_BP_DYN_Infantry_Machinist, K2Node_CreateDelegate_OutputDelegate_1) == 0x000020, "Member 'BP_DYN_Infantry_Machinist_C_ExecuteUbergraph_BP_DYN_Infantry_Machinist::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_DYN_Infantry_Machinist_C_ExecuteUbergraph_BP_DYN_Infantry_Machinist, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'BP_DYN_Infantry_Machinist_C_ExecuteUbergraph_BP_DYN_Infantry_Machinist::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DYN_Infantry_Machinist_C_ExecuteUbergraph_BP_DYN_Infantry_Machinist, CallFunc_WaitGameplayTagRemoveFromActor_ReturnValue) == 0x000038, "Member 'BP_DYN_Infantry_Machinist_C_ExecuteUbergraph_BP_DYN_Infantry_Machinist::CallFunc_WaitGameplayTagRemoveFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DYN_Infantry_Machinist_C_ExecuteUbergraph_BP_DYN_Infantry_Machinist, CallFunc_IsValid_ReturnValue_1) == 0x000040, "Member 'BP_DYN_Infantry_Machinist_C_ExecuteUbergraph_BP_DYN_Infantry_Machinist::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DYN_Infantry_Machinist_C_ExecuteUbergraph_BP_DYN_Infantry_Machinist, Temp_int_Array_Index_Variable) == 0x000044, "Member 'BP_DYN_Infantry_Machinist_C_ExecuteUbergraph_BP_DYN_Infantry_Machinist::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_DYN_Infantry_Machinist_C_ExecuteUbergraph_BP_DYN_Infantry_Machinist, Temp_int_Loop_Counter_Variable) == 0x000048, "Member 'BP_DYN_Infantry_Machinist_C_ExecuteUbergraph_BP_DYN_Infantry_Machinist::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_DYN_Infantry_Machinist_C_ExecuteUbergraph_BP_DYN_Infantry_Machinist, CallFunc_Add_IntInt_ReturnValue) == 0x00004C, "Member 'BP_DYN_Infantry_Machinist_C_ExecuteUbergraph_BP_DYN_Infantry_Machinist::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DYN_Infantry_Machinist_C_ExecuteUbergraph_BP_DYN_Infantry_Machinist, Temp_int_Loop_Counter_Variable_1) == 0x000050, "Member 'BP_DYN_Infantry_Machinist_C_ExecuteUbergraph_BP_DYN_Infantry_Machinist::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_DYN_Infantry_Machinist_C_ExecuteUbergraph_BP_DYN_Infantry_Machinist, Temp_int_Loop_Counter_Variable_2) == 0x000054, "Member 'BP_DYN_Infantry_Machinist_C_ExecuteUbergraph_BP_DYN_Infantry_Machinist::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_DYN_Infantry_Machinist_C_ExecuteUbergraph_BP_DYN_Infantry_Machinist, CallFunc_Add_IntInt_ReturnValue_1) == 0x000058, "Member 'BP_DYN_Infantry_Machinist_C_ExecuteUbergraph_BP_DYN_Infantry_Machinist::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DYN_Infantry_Machinist_C_ExecuteUbergraph_BP_DYN_Infantry_Machinist, CallFunc_Add_IntInt_ReturnValue_2) == 0x00005C, "Member 'BP_DYN_Infantry_Machinist_C_ExecuteUbergraph_BP_DYN_Infantry_Machinist::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_DYN_Infantry_Machinist_C_ExecuteUbergraph_BP_DYN_Infantry_Machinist, Temp_int_Array_Index_Variable_1) == 0x000060, "Member 'BP_DYN_Infantry_Machinist_C_ExecuteUbergraph_BP_DYN_Infantry_Machinist::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_DYN_Infantry_Machinist_C_ExecuteUbergraph_BP_DYN_Infantry_Machinist, Temp_int_Array_Index_Variable_2) == 0x000064, "Member 'BP_DYN_Infantry_Machinist_C_ExecuteUbergraph_BP_DYN_Infantry_Machinist::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_DYN_Infantry_Machinist_C_ExecuteUbergraph_BP_DYN_Infantry_Machinist, CallFunc_IsDedicatedServer_ReturnValue) == 0x000068, "Member 'BP_DYN_Infantry_Machinist_C_ExecuteUbergraph_BP_DYN_Infantry_Machinist::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DYN_Infantry_Machinist_C_ExecuteUbergraph_BP_DYN_Infantry_Machinist, K2Node_Event_DeltaSeconds) == 0x00006C, "Member 'BP_DYN_Infantry_Machinist_C_ExecuteUbergraph_BP_DYN_Infantry_Machinist::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_DYN_Infantry_Machinist_C_ExecuteUbergraph_BP_DYN_Infantry_Machinist, CallFunc_GetFireTarget_ReturnValue) == 0x000070, "Member 'BP_DYN_Infantry_Machinist_C_ExecuteUbergraph_BP_DYN_Infantry_Machinist::CallFunc_GetFireTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DYN_Infantry_Machinist_C_ExecuteUbergraph_BP_DYN_Infantry_Machinist, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000078, "Member 'BP_DYN_Infantry_Machinist_C_ExecuteUbergraph_BP_DYN_Infantry_Machinist::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DYN_Infantry_Machinist_C_ExecuteUbergraph_BP_DYN_Infantry_Machinist, CallFunc_IsDedicatedServer_ReturnValue_1) == 0x000079, "Member 'BP_DYN_Infantry_Machinist_C_ExecuteUbergraph_BP_DYN_Infantry_Machinist::CallFunc_IsDedicatedServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DYN_Infantry_Machinist_C_ExecuteUbergraph_BP_DYN_Infantry_Machinist, CallFunc_CanFire_ReturnValue) == 0x00007A, "Member 'BP_DYN_Infantry_Machinist_C_ExecuteUbergraph_BP_DYN_Infantry_Machinist::CallFunc_CanFire_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DYN_Infantry_Machinist_C_ExecuteUbergraph_BP_DYN_Infantry_Machinist, CallFunc_HasFireTarget_ReturnValue) == 0x00007B, "Member 'BP_DYN_Infantry_Machinist_C_ExecuteUbergraph_BP_DYN_Infantry_Machinist::CallFunc_HasFireTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DYN_Infantry_Machinist_C_ExecuteUbergraph_BP_DYN_Infantry_Machinist, K2Node_CustomEvent_HasTarget) == 0x00007C, "Member 'BP_DYN_Infantry_Machinist_C_ExecuteUbergraph_BP_DYN_Infantry_Machinist::K2Node_CustomEvent_HasTarget' has a wrong offset!");
static_assert(offsetof(BP_DYN_Infantry_Machinist_C_ExecuteUbergraph_BP_DYN_Infantry_Machinist, K2Node_CustomEvent_ShutOff) == 0x00007D, "Member 'BP_DYN_Infantry_Machinist_C_ExecuteUbergraph_BP_DYN_Infantry_Machinist::K2Node_CustomEvent_ShutOff' has a wrong offset!");
static_assert(offsetof(BP_DYN_Infantry_Machinist_C_ExecuteUbergraph_BP_DYN_Infantry_Machinist, CallFunc_Array_Get_Item) == 0x000080, "Member 'BP_DYN_Infantry_Machinist_C_ExecuteUbergraph_BP_DYN_Infantry_Machinist::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_DYN_Infantry_Machinist_C_ExecuteUbergraph_BP_DYN_Infantry_Machinist, CallFunc_Array_Length_ReturnValue) == 0x000088, "Member 'BP_DYN_Infantry_Machinist_C_ExecuteUbergraph_BP_DYN_Infantry_Machinist::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DYN_Infantry_Machinist_C_ExecuteUbergraph_BP_DYN_Infantry_Machinist, K2Node_Event_NewWeapon) == 0x000090, "Member 'BP_DYN_Infantry_Machinist_C_ExecuteUbergraph_BP_DYN_Infantry_Machinist::K2Node_Event_NewWeapon' has a wrong offset!");
static_assert(offsetof(BP_DYN_Infantry_Machinist_C_ExecuteUbergraph_BP_DYN_Infantry_Machinist, K2Node_Event_PreviousWeapon) == 0x000098, "Member 'BP_DYN_Infantry_Machinist_C_ExecuteUbergraph_BP_DYN_Infantry_Machinist::K2Node_Event_PreviousWeapon' has a wrong offset!");
static_assert(offsetof(BP_DYN_Infantry_Machinist_C_ExecuteUbergraph_BP_DYN_Infantry_Machinist, CallFunc_Less_IntInt_ReturnValue) == 0x0000A0, "Member 'BP_DYN_Infantry_Machinist_C_ExecuteUbergraph_BP_DYN_Infantry_Machinist::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DYN_Infantry_Machinist_C_ExecuteUbergraph_BP_DYN_Infantry_Machinist, CallFunc_GetObjectClass_ReturnValue) == 0x0000A8, "Member 'BP_DYN_Infantry_Machinist_C_ExecuteUbergraph_BP_DYN_Infantry_Machinist::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DYN_Infantry_Machinist_C_ExecuteUbergraph_BP_DYN_Infantry_Machinist, CallFunc_EqualEqual_ClassClass_ReturnValue) == 0x0000B0, "Member 'BP_DYN_Infantry_Machinist_C_ExecuteUbergraph_BP_DYN_Infantry_Machinist::CallFunc_EqualEqual_ClassClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DYN_Infantry_Machinist_C_ExecuteUbergraph_BP_DYN_Infantry_Machinist, CallFunc_IsDedicatedServer_ReturnValue_2) == 0x0000B1, "Member 'BP_DYN_Infantry_Machinist_C_ExecuteUbergraph_BP_DYN_Infantry_Machinist::CallFunc_IsDedicatedServer_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_DYN_Infantry_Machinist_C_ExecuteUbergraph_BP_DYN_Infantry_Machinist, CallFunc_Array_Get_Item_1) == 0x0000B8, "Member 'BP_DYN_Infantry_Machinist_C_ExecuteUbergraph_BP_DYN_Infantry_Machinist::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_DYN_Infantry_Machinist_C_ExecuteUbergraph_BP_DYN_Infantry_Machinist, CallFunc_Array_Length_ReturnValue_1) == 0x0000C0, "Member 'BP_DYN_Infantry_Machinist_C_ExecuteUbergraph_BP_DYN_Infantry_Machinist::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DYN_Infantry_Machinist_C_ExecuteUbergraph_BP_DYN_Infantry_Machinist, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000C4, "Member 'BP_DYN_Infantry_Machinist_C_ExecuteUbergraph_BP_DYN_Infantry_Machinist::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DYN_Infantry_Machinist_C_ExecuteUbergraph_BP_DYN_Infantry_Machinist, Temp_real_Variable) == 0x0000C8, "Member 'BP_DYN_Infantry_Machinist_C_ExecuteUbergraph_BP_DYN_Infantry_Machinist::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(BP_DYN_Infantry_Machinist_C_ExecuteUbergraph_BP_DYN_Infantry_Machinist, CallFunc_Array_Get_Item_2) == 0x0000D0, "Member 'BP_DYN_Infantry_Machinist_C_ExecuteUbergraph_BP_DYN_Infantry_Machinist::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(BP_DYN_Infantry_Machinist_C_ExecuteUbergraph_BP_DYN_Infantry_Machinist, CallFunc_Array_Length_ReturnValue_2) == 0x0000D8, "Member 'BP_DYN_Infantry_Machinist_C_ExecuteUbergraph_BP_DYN_Infantry_Machinist::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_DYN_Infantry_Machinist_C_ExecuteUbergraph_BP_DYN_Infantry_Machinist, CallFunc_Less_IntInt_ReturnValue_2) == 0x0000DC, "Member 'BP_DYN_Infantry_Machinist_C_ExecuteUbergraph_BP_DYN_Infantry_Machinist::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_DYN_Infantry_Machinist_C_ExecuteUbergraph_BP_DYN_Infantry_Machinist, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0000E0, "Member 'BP_DYN_Infantry_Machinist_C_ExecuteUbergraph_BP_DYN_Infantry_Machinist::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DYN_Infantry_Machinist_C_ExecuteUbergraph_BP_DYN_Infantry_Machinist, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x0000F8, "Member 'BP_DYN_Infantry_Machinist_C_ExecuteUbergraph_BP_DYN_Infantry_Machinist::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DYN_Infantry_Machinist_C_ExecuteUbergraph_BP_DYN_Infantry_Machinist, CallFunc_IsDedicatedServer_ReturnValue_3) == 0x000110, "Member 'BP_DYN_Infantry_Machinist_C_ExecuteUbergraph_BP_DYN_Infantry_Machinist::CallFunc_IsDedicatedServer_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_DYN_Infantry_Machinist_C_ExecuteUbergraph_BP_DYN_Infantry_Machinist, Temp_real_Variable_1) == 0x000118, "Member 'BP_DYN_Infantry_Machinist_C_ExecuteUbergraph_BP_DYN_Infantry_Machinist::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_DYN_Infantry_Machinist_C_ExecuteUbergraph_BP_DYN_Infantry_Machinist, Temp_bool_Variable) == 0x000120, "Member 'BP_DYN_Infantry_Machinist_C_ExecuteUbergraph_BP_DYN_Infantry_Machinist::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_DYN_Infantry_Machinist_C_ExecuteUbergraph_BP_DYN_Infantry_Machinist, K2Node_Select_Default) == 0x000128, "Member 'BP_DYN_Infantry_Machinist_C_ExecuteUbergraph_BP_DYN_Infantry_Machinist::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_DYN_Infantry_Machinist_C_ExecuteUbergraph_BP_DYN_Infantry_Machinist, CallFunc_LinearColorLerp_ReturnValue) == 0x000130, "Member 'BP_DYN_Infantry_Machinist_C_ExecuteUbergraph_BP_DYN_Infantry_Machinist::CallFunc_LinearColorLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DYN_Infantry_Machinist_C_ExecuteUbergraph_BP_DYN_Infantry_Machinist, K2Node_Event_bIsSelected) == 0x000140, "Member 'BP_DYN_Infantry_Machinist_C_ExecuteUbergraph_BP_DYN_Infantry_Machinist::K2Node_Event_bIsSelected' has a wrong offset!");
static_assert(offsetof(BP_DYN_Infantry_Machinist_C_ExecuteUbergraph_BP_DYN_Infantry_Machinist, K2Node_Event_bIsHovered) == 0x000141, "Member 'BP_DYN_Infantry_Machinist_C_ExecuteUbergraph_BP_DYN_Infantry_Machinist::K2Node_Event_bIsHovered' has a wrong offset!");
static_assert(offsetof(BP_DYN_Infantry_Machinist_C_ExecuteUbergraph_BP_DYN_Infantry_Machinist, CallFunc_IsValid_ReturnValue_2) == 0x000142, "Member 'BP_DYN_Infantry_Machinist_C_ExecuteUbergraph_BP_DYN_Infantry_Machinist::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_DYN_Infantry_Machinist_C_ExecuteUbergraph_BP_DYN_Infantry_Machinist, CallFunc_GetShouldDisplayPerkRange_ReturnValue) == 0x000143, "Member 'BP_DYN_Infantry_Machinist_C_ExecuteUbergraph_BP_DYN_Infantry_Machinist::CallFunc_GetShouldDisplayPerkRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DYN_Infantry_Machinist_C_ExecuteUbergraph_BP_DYN_Infantry_Machinist, CallFunc_BooleanOR_ReturnValue) == 0x000144, "Member 'BP_DYN_Infantry_Machinist_C_ExecuteUbergraph_BP_DYN_Infantry_Machinist::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DYN_Infantry_Machinist_C_ExecuteUbergraph_BP_DYN_Infantry_Machinist, CallFunc_SetPlayRate_NewRate_ImplicitCast) == 0x000148, "Member 'BP_DYN_Infantry_Machinist_C_ExecuteUbergraph_BP_DYN_Infantry_Machinist::CallFunc_SetPlayRate_NewRate_ImplicitCast' has a wrong offset!");

// Function BP_DYN_Infantry_Machinist.BP_DYN_Infantry_Machinist_C.K2_OnWeaponSwitched
// 0x0010 (0x0010 - 0x0000)
struct BP_DYN_Infantry_Machinist_C_K2_OnWeaponSwitched final
{
public:
	class UTedWeapon*                             NewWeapon;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTedWeapon*                             PreviousWeapon;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DYN_Infantry_Machinist_C_K2_OnWeaponSwitched) == 0x000008, "Wrong alignment on BP_DYN_Infantry_Machinist_C_K2_OnWeaponSwitched");
static_assert(sizeof(BP_DYN_Infantry_Machinist_C_K2_OnWeaponSwitched) == 0x000010, "Wrong size on BP_DYN_Infantry_Machinist_C_K2_OnWeaponSwitched");
static_assert(offsetof(BP_DYN_Infantry_Machinist_C_K2_OnWeaponSwitched, NewWeapon) == 0x000000, "Member 'BP_DYN_Infantry_Machinist_C_K2_OnWeaponSwitched::NewWeapon' has a wrong offset!");
static_assert(offsetof(BP_DYN_Infantry_Machinist_C_K2_OnWeaponSwitched, PreviousWeapon) == 0x000008, "Member 'BP_DYN_Infantry_Machinist_C_K2_OnWeaponSwitched::PreviousWeapon' has a wrong offset!");

// Function BP_DYN_Infantry_Machinist.BP_DYN_Infantry_Machinist_C.OnSelectionChanged_Blueprint
// 0x0002 (0x0002 - 0x0000)
struct BP_DYN_Infantry_Machinist_C_OnSelectionChanged_Blueprint final
{
public:
	bool                                          bIsSelected;                                       // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsHovered;                                        // 0x0001(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DYN_Infantry_Machinist_C_OnSelectionChanged_Blueprint) == 0x000001, "Wrong alignment on BP_DYN_Infantry_Machinist_C_OnSelectionChanged_Blueprint");
static_assert(sizeof(BP_DYN_Infantry_Machinist_C_OnSelectionChanged_Blueprint) == 0x000002, "Wrong size on BP_DYN_Infantry_Machinist_C_OnSelectionChanged_Blueprint");
static_assert(offsetof(BP_DYN_Infantry_Machinist_C_OnSelectionChanged_Blueprint, bIsSelected) == 0x000000, "Member 'BP_DYN_Infantry_Machinist_C_OnSelectionChanged_Blueprint::bIsSelected' has a wrong offset!");
static_assert(offsetof(BP_DYN_Infantry_Machinist_C_OnSelectionChanged_Blueprint, bIsHovered) == 0x000001, "Member 'BP_DYN_Infantry_Machinist_C_OnSelectionChanged_Blueprint::bIsHovered' has a wrong offset!");

// Function BP_DYN_Infantry_Machinist.BP_DYN_Infantry_Machinist_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_DYN_Infantry_Machinist_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DYN_Infantry_Machinist_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_DYN_Infantry_Machinist_C_ReceiveTick");
static_assert(sizeof(BP_DYN_Infantry_Machinist_C_ReceiveTick) == 0x000004, "Wrong size on BP_DYN_Infantry_Machinist_C_ReceiveTick");
static_assert(offsetof(BP_DYN_Infantry_Machinist_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_DYN_Infantry_Machinist_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_DYN_Infantry_Machinist.BP_DYN_Infantry_Machinist_C.Update Sauron's Eye
// 0x0002 (0x0002 - 0x0000)
struct BP_DYN_Infantry_Machinist_C_Update_Sauron_s_Eye final
{
public:
	bool                                          HasTarget;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShutOff;                                           // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DYN_Infantry_Machinist_C_Update_Sauron_s_Eye) == 0x000001, "Wrong alignment on BP_DYN_Infantry_Machinist_C_Update_Sauron_s_Eye");
static_assert(sizeof(BP_DYN_Infantry_Machinist_C_Update_Sauron_s_Eye) == 0x000002, "Wrong size on BP_DYN_Infantry_Machinist_C_Update_Sauron_s_Eye");
static_assert(offsetof(BP_DYN_Infantry_Machinist_C_Update_Sauron_s_Eye, HasTarget) == 0x000000, "Member 'BP_DYN_Infantry_Machinist_C_Update_Sauron_s_Eye::HasTarget' has a wrong offset!");
static_assert(offsetof(BP_DYN_Infantry_Machinist_C_Update_Sauron_s_Eye, ShutOff) == 0x000001, "Member 'BP_DYN_Infantry_Machinist_C_Update_Sauron_s_Eye::ShutOff' has a wrong offset!");

// Function BP_DYN_Infantry_Machinist.BP_DYN_Infantry_Machinist_C.UpdateDetectionRangeDecal
// 0x0010 (0x0010 - 0x0000)
struct BP_DYN_Infantry_Machinist_C_UpdateDetectionRangeDecal final
{
public:
	double                                        CallFunc_MakeLiteralDouble_ReturnValue;            // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetRadius_Radius_ImplicitCast;            // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DYN_Infantry_Machinist_C_UpdateDetectionRangeDecal) == 0x000008, "Wrong alignment on BP_DYN_Infantry_Machinist_C_UpdateDetectionRangeDecal");
static_assert(sizeof(BP_DYN_Infantry_Machinist_C_UpdateDetectionRangeDecal) == 0x000010, "Wrong size on BP_DYN_Infantry_Machinist_C_UpdateDetectionRangeDecal");
static_assert(offsetof(BP_DYN_Infantry_Machinist_C_UpdateDetectionRangeDecal, CallFunc_MakeLiteralDouble_ReturnValue) == 0x000000, "Member 'BP_DYN_Infantry_Machinist_C_UpdateDetectionRangeDecal::CallFunc_MakeLiteralDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DYN_Infantry_Machinist_C_UpdateDetectionRangeDecal, CallFunc_SetRadius_Radius_ImplicitCast) == 0x000008, "Member 'BP_DYN_Infantry_Machinist_C_UpdateDetectionRangeDecal::CallFunc_SetRadius_Radius_ImplicitCast' has a wrong offset!");

}

