#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DYN_Vehicle_VoltaicTank

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function BP_DYN_Vehicle_VoltaicTank.BP_DYN_Vehicle_VoltaicTank_C.ExecuteUbergraph_BP_DYN_Vehicle_VoltaicTank
// 0x0108 (0x0108 - 0x0000)
struct BP_DYN_Vehicle_VoltaicTank_C_ExecuteUbergraph_BP_DYN_Vehicle_VoltaicTank final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_HealthPct;                            // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue_1;          // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue_2;          // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F[0x1];                                        // 0x000F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 Temp_struct_Variable;                              // 0x0010(0x00D8)(ConstParm, ContainsInstancedReference)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_1;          // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_2;          // 0x00EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_3;          // 0x00EB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_4;          // 0x00EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_ED[0x3];                                       // 0x00ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast;         // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast_1;       // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast_2;       // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DYN_Vehicle_VoltaicTank_C_ExecuteUbergraph_BP_DYN_Vehicle_VoltaicTank) == 0x000008, "Wrong alignment on BP_DYN_Vehicle_VoltaicTank_C_ExecuteUbergraph_BP_DYN_Vehicle_VoltaicTank");
static_assert(sizeof(BP_DYN_Vehicle_VoltaicTank_C_ExecuteUbergraph_BP_DYN_Vehicle_VoltaicTank) == 0x000108, "Wrong size on BP_DYN_Vehicle_VoltaicTank_C_ExecuteUbergraph_BP_DYN_Vehicle_VoltaicTank");
static_assert(offsetof(BP_DYN_Vehicle_VoltaicTank_C_ExecuteUbergraph_BP_DYN_Vehicle_VoltaicTank, EntryPoint) == 0x000000, "Member 'BP_DYN_Vehicle_VoltaicTank_C_ExecuteUbergraph_BP_DYN_Vehicle_VoltaicTank::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_DYN_Vehicle_VoltaicTank_C_ExecuteUbergraph_BP_DYN_Vehicle_VoltaicTank, K2Node_Event_HealthPct) == 0x000004, "Member 'BP_DYN_Vehicle_VoltaicTank_C_ExecuteUbergraph_BP_DYN_Vehicle_VoltaicTank::K2Node_Event_HealthPct' has a wrong offset!");
static_assert(offsetof(BP_DYN_Vehicle_VoltaicTank_C_ExecuteUbergraph_BP_DYN_Vehicle_VoltaicTank, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000008, "Member 'BP_DYN_Vehicle_VoltaicTank_C_ExecuteUbergraph_BP_DYN_Vehicle_VoltaicTank::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DYN_Vehicle_VoltaicTank_C_ExecuteUbergraph_BP_DYN_Vehicle_VoltaicTank, CallFunc_Less_DoubleDouble_ReturnValue_1) == 0x000009, "Member 'BP_DYN_Vehicle_VoltaicTank_C_ExecuteUbergraph_BP_DYN_Vehicle_VoltaicTank::CallFunc_Less_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DYN_Vehicle_VoltaicTank_C_ExecuteUbergraph_BP_DYN_Vehicle_VoltaicTank, CallFunc_Less_DoubleDouble_ReturnValue_2) == 0x00000A, "Member 'BP_DYN_Vehicle_VoltaicTank_C_ExecuteUbergraph_BP_DYN_Vehicle_VoltaicTank::CallFunc_Less_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_DYN_Vehicle_VoltaicTank_C_ExecuteUbergraph_BP_DYN_Vehicle_VoltaicTank, CallFunc_Not_PreBool_ReturnValue) == 0x00000B, "Member 'BP_DYN_Vehicle_VoltaicTank_C_ExecuteUbergraph_BP_DYN_Vehicle_VoltaicTank::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DYN_Vehicle_VoltaicTank_C_ExecuteUbergraph_BP_DYN_Vehicle_VoltaicTank, CallFunc_Not_PreBool_ReturnValue_1) == 0x00000C, "Member 'BP_DYN_Vehicle_VoltaicTank_C_ExecuteUbergraph_BP_DYN_Vehicle_VoltaicTank::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DYN_Vehicle_VoltaicTank_C_ExecuteUbergraph_BP_DYN_Vehicle_VoltaicTank, CallFunc_BooleanAND_ReturnValue) == 0x00000D, "Member 'BP_DYN_Vehicle_VoltaicTank_C_ExecuteUbergraph_BP_DYN_Vehicle_VoltaicTank::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DYN_Vehicle_VoltaicTank_C_ExecuteUbergraph_BP_DYN_Vehicle_VoltaicTank, CallFunc_BooleanAND_ReturnValue_1) == 0x00000E, "Member 'BP_DYN_Vehicle_VoltaicTank_C_ExecuteUbergraph_BP_DYN_Vehicle_VoltaicTank::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DYN_Vehicle_VoltaicTank_C_ExecuteUbergraph_BP_DYN_Vehicle_VoltaicTank, Temp_struct_Variable) == 0x000010, "Member 'BP_DYN_Vehicle_VoltaicTank_C_ExecuteUbergraph_BP_DYN_Vehicle_VoltaicTank::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_DYN_Vehicle_VoltaicTank_C_ExecuteUbergraph_BP_DYN_Vehicle_VoltaicTank, CallFunc_IsDedicatedServer_ReturnValue) == 0x0000E8, "Member 'BP_DYN_Vehicle_VoltaicTank_C_ExecuteUbergraph_BP_DYN_Vehicle_VoltaicTank::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DYN_Vehicle_VoltaicTank_C_ExecuteUbergraph_BP_DYN_Vehicle_VoltaicTank, CallFunc_IsDedicatedServer_ReturnValue_1) == 0x0000E9, "Member 'BP_DYN_Vehicle_VoltaicTank_C_ExecuteUbergraph_BP_DYN_Vehicle_VoltaicTank::CallFunc_IsDedicatedServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DYN_Vehicle_VoltaicTank_C_ExecuteUbergraph_BP_DYN_Vehicle_VoltaicTank, CallFunc_IsDedicatedServer_ReturnValue_2) == 0x0000EA, "Member 'BP_DYN_Vehicle_VoltaicTank_C_ExecuteUbergraph_BP_DYN_Vehicle_VoltaicTank::CallFunc_IsDedicatedServer_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_DYN_Vehicle_VoltaicTank_C_ExecuteUbergraph_BP_DYN_Vehicle_VoltaicTank, CallFunc_IsDedicatedServer_ReturnValue_3) == 0x0000EB, "Member 'BP_DYN_Vehicle_VoltaicTank_C_ExecuteUbergraph_BP_DYN_Vehicle_VoltaicTank::CallFunc_IsDedicatedServer_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_DYN_Vehicle_VoltaicTank_C_ExecuteUbergraph_BP_DYN_Vehicle_VoltaicTank, CallFunc_IsDedicatedServer_ReturnValue_4) == 0x0000EC, "Member 'BP_DYN_Vehicle_VoltaicTank_C_ExecuteUbergraph_BP_DYN_Vehicle_VoltaicTank::CallFunc_IsDedicatedServer_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_DYN_Vehicle_VoltaicTank_C_ExecuteUbergraph_BP_DYN_Vehicle_VoltaicTank, CallFunc_Less_DoubleDouble_A_ImplicitCast) == 0x0000F0, "Member 'BP_DYN_Vehicle_VoltaicTank_C_ExecuteUbergraph_BP_DYN_Vehicle_VoltaicTank::CallFunc_Less_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_DYN_Vehicle_VoltaicTank_C_ExecuteUbergraph_BP_DYN_Vehicle_VoltaicTank, CallFunc_Less_DoubleDouble_A_ImplicitCast_1) == 0x0000F8, "Member 'BP_DYN_Vehicle_VoltaicTank_C_ExecuteUbergraph_BP_DYN_Vehicle_VoltaicTank::CallFunc_Less_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_DYN_Vehicle_VoltaicTank_C_ExecuteUbergraph_BP_DYN_Vehicle_VoltaicTank, CallFunc_Less_DoubleDouble_A_ImplicitCast_2) == 0x000100, "Member 'BP_DYN_Vehicle_VoltaicTank_C_ExecuteUbergraph_BP_DYN_Vehicle_VoltaicTank::CallFunc_Less_DoubleDouble_A_ImplicitCast_2' has a wrong offset!");

// Function BP_DYN_Vehicle_VoltaicTank.BP_DYN_Vehicle_VoltaicTank_C.ReceiveUpdateHealthEffects
// 0x0004 (0x0004 - 0x0000)
struct BP_DYN_Vehicle_VoltaicTank_C_ReceiveUpdateHealthEffects final
{
public:
	float                                         HealthPct;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DYN_Vehicle_VoltaicTank_C_ReceiveUpdateHealthEffects) == 0x000004, "Wrong alignment on BP_DYN_Vehicle_VoltaicTank_C_ReceiveUpdateHealthEffects");
static_assert(sizeof(BP_DYN_Vehicle_VoltaicTank_C_ReceiveUpdateHealthEffects) == 0x000004, "Wrong size on BP_DYN_Vehicle_VoltaicTank_C_ReceiveUpdateHealthEffects");
static_assert(offsetof(BP_DYN_Vehicle_VoltaicTank_C_ReceiveUpdateHealthEffects, HealthPct) == 0x000000, "Member 'BP_DYN_Vehicle_VoltaicTank_C_ReceiveUpdateHealthEffects::HealthPct' has a wrong offset!");

}

