#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DYN_Vehicle_MCV

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function BP_DYN_Vehicle_MCV.BP_DYN_Vehicle_MCV_C.ExecuteUbergraph_BP_DYN_Vehicle_MCV
// 0x0108 (0x0108 - 0x0000)
struct BP_DYN_Vehicle_MCV_C_ExecuteUbergraph_BP_DYN_Vehicle_MCV final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_1;          // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_2;          // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_HealthPct;                            // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue_1;          // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue_2;          // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_3;          // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 Temp_struct_Variable;                              // 0x0018(0x00D8)(ConstParm, ContainsInstancedReference)
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast;         // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast_1;       // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast_2;       // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DYN_Vehicle_MCV_C_ExecuteUbergraph_BP_DYN_Vehicle_MCV) == 0x000008, "Wrong alignment on BP_DYN_Vehicle_MCV_C_ExecuteUbergraph_BP_DYN_Vehicle_MCV");
static_assert(sizeof(BP_DYN_Vehicle_MCV_C_ExecuteUbergraph_BP_DYN_Vehicle_MCV) == 0x000108, "Wrong size on BP_DYN_Vehicle_MCV_C_ExecuteUbergraph_BP_DYN_Vehicle_MCV");
static_assert(offsetof(BP_DYN_Vehicle_MCV_C_ExecuteUbergraph_BP_DYN_Vehicle_MCV, EntryPoint) == 0x000000, "Member 'BP_DYN_Vehicle_MCV_C_ExecuteUbergraph_BP_DYN_Vehicle_MCV::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_DYN_Vehicle_MCV_C_ExecuteUbergraph_BP_DYN_Vehicle_MCV, CallFunc_IsDedicatedServer_ReturnValue) == 0x000004, "Member 'BP_DYN_Vehicle_MCV_C_ExecuteUbergraph_BP_DYN_Vehicle_MCV::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DYN_Vehicle_MCV_C_ExecuteUbergraph_BP_DYN_Vehicle_MCV, CallFunc_IsDedicatedServer_ReturnValue_1) == 0x000005, "Member 'BP_DYN_Vehicle_MCV_C_ExecuteUbergraph_BP_DYN_Vehicle_MCV::CallFunc_IsDedicatedServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DYN_Vehicle_MCV_C_ExecuteUbergraph_BP_DYN_Vehicle_MCV, CallFunc_IsDedicatedServer_ReturnValue_2) == 0x000006, "Member 'BP_DYN_Vehicle_MCV_C_ExecuteUbergraph_BP_DYN_Vehicle_MCV::CallFunc_IsDedicatedServer_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_DYN_Vehicle_MCV_C_ExecuteUbergraph_BP_DYN_Vehicle_MCV, K2Node_Event_HealthPct) == 0x000008, "Member 'BP_DYN_Vehicle_MCV_C_ExecuteUbergraph_BP_DYN_Vehicle_MCV::K2Node_Event_HealthPct' has a wrong offset!");
static_assert(offsetof(BP_DYN_Vehicle_MCV_C_ExecuteUbergraph_BP_DYN_Vehicle_MCV, CallFunc_Less_DoubleDouble_ReturnValue) == 0x00000C, "Member 'BP_DYN_Vehicle_MCV_C_ExecuteUbergraph_BP_DYN_Vehicle_MCV::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DYN_Vehicle_MCV_C_ExecuteUbergraph_BP_DYN_Vehicle_MCV, CallFunc_Less_DoubleDouble_ReturnValue_1) == 0x00000D, "Member 'BP_DYN_Vehicle_MCV_C_ExecuteUbergraph_BP_DYN_Vehicle_MCV::CallFunc_Less_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DYN_Vehicle_MCV_C_ExecuteUbergraph_BP_DYN_Vehicle_MCV, CallFunc_Not_PreBool_ReturnValue) == 0x00000E, "Member 'BP_DYN_Vehicle_MCV_C_ExecuteUbergraph_BP_DYN_Vehicle_MCV::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DYN_Vehicle_MCV_C_ExecuteUbergraph_BP_DYN_Vehicle_MCV, CallFunc_Less_DoubleDouble_ReturnValue_2) == 0x00000F, "Member 'BP_DYN_Vehicle_MCV_C_ExecuteUbergraph_BP_DYN_Vehicle_MCV::CallFunc_Less_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_DYN_Vehicle_MCV_C_ExecuteUbergraph_BP_DYN_Vehicle_MCV, CallFunc_BooleanAND_ReturnValue) == 0x000010, "Member 'BP_DYN_Vehicle_MCV_C_ExecuteUbergraph_BP_DYN_Vehicle_MCV::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DYN_Vehicle_MCV_C_ExecuteUbergraph_BP_DYN_Vehicle_MCV, CallFunc_Not_PreBool_ReturnValue_1) == 0x000011, "Member 'BP_DYN_Vehicle_MCV_C_ExecuteUbergraph_BP_DYN_Vehicle_MCV::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DYN_Vehicle_MCV_C_ExecuteUbergraph_BP_DYN_Vehicle_MCV, CallFunc_IsDedicatedServer_ReturnValue_3) == 0x000012, "Member 'BP_DYN_Vehicle_MCV_C_ExecuteUbergraph_BP_DYN_Vehicle_MCV::CallFunc_IsDedicatedServer_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_DYN_Vehicle_MCV_C_ExecuteUbergraph_BP_DYN_Vehicle_MCV, CallFunc_BooleanAND_ReturnValue_1) == 0x000013, "Member 'BP_DYN_Vehicle_MCV_C_ExecuteUbergraph_BP_DYN_Vehicle_MCV::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DYN_Vehicle_MCV_C_ExecuteUbergraph_BP_DYN_Vehicle_MCV, Temp_struct_Variable) == 0x000018, "Member 'BP_DYN_Vehicle_MCV_C_ExecuteUbergraph_BP_DYN_Vehicle_MCV::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_DYN_Vehicle_MCV_C_ExecuteUbergraph_BP_DYN_Vehicle_MCV, CallFunc_Less_DoubleDouble_A_ImplicitCast) == 0x0000F0, "Member 'BP_DYN_Vehicle_MCV_C_ExecuteUbergraph_BP_DYN_Vehicle_MCV::CallFunc_Less_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_DYN_Vehicle_MCV_C_ExecuteUbergraph_BP_DYN_Vehicle_MCV, CallFunc_Less_DoubleDouble_A_ImplicitCast_1) == 0x0000F8, "Member 'BP_DYN_Vehicle_MCV_C_ExecuteUbergraph_BP_DYN_Vehicle_MCV::CallFunc_Less_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_DYN_Vehicle_MCV_C_ExecuteUbergraph_BP_DYN_Vehicle_MCV, CallFunc_Less_DoubleDouble_A_ImplicitCast_2) == 0x000100, "Member 'BP_DYN_Vehicle_MCV_C_ExecuteUbergraph_BP_DYN_Vehicle_MCV::CallFunc_Less_DoubleDouble_A_ImplicitCast_2' has a wrong offset!");

// Function BP_DYN_Vehicle_MCV.BP_DYN_Vehicle_MCV_C.ReceiveUpdateHealthEffects
// 0x0004 (0x0004 - 0x0000)
struct BP_DYN_Vehicle_MCV_C_ReceiveUpdateHealthEffects final
{
public:
	float                                         HealthPct;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DYN_Vehicle_MCV_C_ReceiveUpdateHealthEffects) == 0x000004, "Wrong alignment on BP_DYN_Vehicle_MCV_C_ReceiveUpdateHealthEffects");
static_assert(sizeof(BP_DYN_Vehicle_MCV_C_ReceiveUpdateHealthEffects) == 0x000004, "Wrong size on BP_DYN_Vehicle_MCV_C_ReceiveUpdateHealthEffects");
static_assert(offsetof(BP_DYN_Vehicle_MCV_C_ReceiveUpdateHealthEffects, HealthPct) == 0x000000, "Member 'BP_DYN_Vehicle_MCV_C_ReceiveUpdateHealthEffects::HealthPct' has a wrong offset!");

}

