#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DYN_Vehicle_Matchstick

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_DYN_Vehicle_Matchstick.BP_DYN_Vehicle_Matchstick_C.ExecuteUbergraph_BP_DYN_Vehicle_Matchstick
// 0x0128 (0x0128 - 0x0000)
struct BP_DYN_Vehicle_Matchstick_C_ExecuteUbergraph_BP_DYN_Vehicle_Matchstick final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_1;          // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_2;          // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_3;          // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_HealthPct;                            // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x0010(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 CallFunc_MakeGameplayCueParameters_ReturnValue;    // 0x0030(0x00D8)(ContainsInstancedReference)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue_1;          // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue_2;          // 0x010A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x010B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x010C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x010D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_4;          // 0x010E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x010F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast;         // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast_1;       // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast_2;       // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DYN_Vehicle_Matchstick_C_ExecuteUbergraph_BP_DYN_Vehicle_Matchstick) == 0x000008, "Wrong alignment on BP_DYN_Vehicle_Matchstick_C_ExecuteUbergraph_BP_DYN_Vehicle_Matchstick");
static_assert(sizeof(BP_DYN_Vehicle_Matchstick_C_ExecuteUbergraph_BP_DYN_Vehicle_Matchstick) == 0x000128, "Wrong size on BP_DYN_Vehicle_Matchstick_C_ExecuteUbergraph_BP_DYN_Vehicle_Matchstick");
static_assert(offsetof(BP_DYN_Vehicle_Matchstick_C_ExecuteUbergraph_BP_DYN_Vehicle_Matchstick, EntryPoint) == 0x000000, "Member 'BP_DYN_Vehicle_Matchstick_C_ExecuteUbergraph_BP_DYN_Vehicle_Matchstick::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_DYN_Vehicle_Matchstick_C_ExecuteUbergraph_BP_DYN_Vehicle_Matchstick, CallFunc_IsDedicatedServer_ReturnValue) == 0x000004, "Member 'BP_DYN_Vehicle_Matchstick_C_ExecuteUbergraph_BP_DYN_Vehicle_Matchstick::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DYN_Vehicle_Matchstick_C_ExecuteUbergraph_BP_DYN_Vehicle_Matchstick, CallFunc_IsDedicatedServer_ReturnValue_1) == 0x000005, "Member 'BP_DYN_Vehicle_Matchstick_C_ExecuteUbergraph_BP_DYN_Vehicle_Matchstick::CallFunc_IsDedicatedServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DYN_Vehicle_Matchstick_C_ExecuteUbergraph_BP_DYN_Vehicle_Matchstick, CallFunc_IsDedicatedServer_ReturnValue_2) == 0x000006, "Member 'BP_DYN_Vehicle_Matchstick_C_ExecuteUbergraph_BP_DYN_Vehicle_Matchstick::CallFunc_IsDedicatedServer_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_DYN_Vehicle_Matchstick_C_ExecuteUbergraph_BP_DYN_Vehicle_Matchstick, CallFunc_IsDedicatedServer_ReturnValue_3) == 0x000007, "Member 'BP_DYN_Vehicle_Matchstick_C_ExecuteUbergraph_BP_DYN_Vehicle_Matchstick::CallFunc_IsDedicatedServer_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_DYN_Vehicle_Matchstick_C_ExecuteUbergraph_BP_DYN_Vehicle_Matchstick, K2Node_Event_HealthPct) == 0x000008, "Member 'BP_DYN_Vehicle_Matchstick_C_ExecuteUbergraph_BP_DYN_Vehicle_Matchstick::K2Node_Event_HealthPct' has a wrong offset!");
static_assert(offsetof(BP_DYN_Vehicle_Matchstick_C_ExecuteUbergraph_BP_DYN_Vehicle_Matchstick, CallFunc_GetSocketLocation_ReturnValue) == 0x000010, "Member 'BP_DYN_Vehicle_Matchstick_C_ExecuteUbergraph_BP_DYN_Vehicle_Matchstick::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DYN_Vehicle_Matchstick_C_ExecuteUbergraph_BP_DYN_Vehicle_Matchstick, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000028, "Member 'BP_DYN_Vehicle_Matchstick_C_ExecuteUbergraph_BP_DYN_Vehicle_Matchstick::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DYN_Vehicle_Matchstick_C_ExecuteUbergraph_BP_DYN_Vehicle_Matchstick, CallFunc_MakeGameplayCueParameters_ReturnValue) == 0x000030, "Member 'BP_DYN_Vehicle_Matchstick_C_ExecuteUbergraph_BP_DYN_Vehicle_Matchstick::CallFunc_MakeGameplayCueParameters_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DYN_Vehicle_Matchstick_C_ExecuteUbergraph_BP_DYN_Vehicle_Matchstick, CallFunc_Less_DoubleDouble_ReturnValue_1) == 0x000108, "Member 'BP_DYN_Vehicle_Matchstick_C_ExecuteUbergraph_BP_DYN_Vehicle_Matchstick::CallFunc_Less_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DYN_Vehicle_Matchstick_C_ExecuteUbergraph_BP_DYN_Vehicle_Matchstick, CallFunc_Not_PreBool_ReturnValue) == 0x000109, "Member 'BP_DYN_Vehicle_Matchstick_C_ExecuteUbergraph_BP_DYN_Vehicle_Matchstick::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DYN_Vehicle_Matchstick_C_ExecuteUbergraph_BP_DYN_Vehicle_Matchstick, CallFunc_Less_DoubleDouble_ReturnValue_2) == 0x00010A, "Member 'BP_DYN_Vehicle_Matchstick_C_ExecuteUbergraph_BP_DYN_Vehicle_Matchstick::CallFunc_Less_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_DYN_Vehicle_Matchstick_C_ExecuteUbergraph_BP_DYN_Vehicle_Matchstick, CallFunc_BooleanAND_ReturnValue) == 0x00010B, "Member 'BP_DYN_Vehicle_Matchstick_C_ExecuteUbergraph_BP_DYN_Vehicle_Matchstick::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DYN_Vehicle_Matchstick_C_ExecuteUbergraph_BP_DYN_Vehicle_Matchstick, CallFunc_Not_PreBool_ReturnValue_1) == 0x00010C, "Member 'BP_DYN_Vehicle_Matchstick_C_ExecuteUbergraph_BP_DYN_Vehicle_Matchstick::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DYN_Vehicle_Matchstick_C_ExecuteUbergraph_BP_DYN_Vehicle_Matchstick, CallFunc_BooleanAND_ReturnValue_1) == 0x00010D, "Member 'BP_DYN_Vehicle_Matchstick_C_ExecuteUbergraph_BP_DYN_Vehicle_Matchstick::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DYN_Vehicle_Matchstick_C_ExecuteUbergraph_BP_DYN_Vehicle_Matchstick, CallFunc_IsDedicatedServer_ReturnValue_4) == 0x00010E, "Member 'BP_DYN_Vehicle_Matchstick_C_ExecuteUbergraph_BP_DYN_Vehicle_Matchstick::CallFunc_IsDedicatedServer_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_DYN_Vehicle_Matchstick_C_ExecuteUbergraph_BP_DYN_Vehicle_Matchstick, CallFunc_HasAuthority_ReturnValue) == 0x00010F, "Member 'BP_DYN_Vehicle_Matchstick_C_ExecuteUbergraph_BP_DYN_Vehicle_Matchstick::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DYN_Vehicle_Matchstick_C_ExecuteUbergraph_BP_DYN_Vehicle_Matchstick, CallFunc_Less_DoubleDouble_A_ImplicitCast) == 0x000110, "Member 'BP_DYN_Vehicle_Matchstick_C_ExecuteUbergraph_BP_DYN_Vehicle_Matchstick::CallFunc_Less_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_DYN_Vehicle_Matchstick_C_ExecuteUbergraph_BP_DYN_Vehicle_Matchstick, CallFunc_Less_DoubleDouble_A_ImplicitCast_1) == 0x000118, "Member 'BP_DYN_Vehicle_Matchstick_C_ExecuteUbergraph_BP_DYN_Vehicle_Matchstick::CallFunc_Less_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_DYN_Vehicle_Matchstick_C_ExecuteUbergraph_BP_DYN_Vehicle_Matchstick, CallFunc_Less_DoubleDouble_A_ImplicitCast_2) == 0x000120, "Member 'BP_DYN_Vehicle_Matchstick_C_ExecuteUbergraph_BP_DYN_Vehicle_Matchstick::CallFunc_Less_DoubleDouble_A_ImplicitCast_2' has a wrong offset!");

// Function BP_DYN_Vehicle_Matchstick.BP_DYN_Vehicle_Matchstick_C.ReceiveUpdateHealthEffects
// 0x0004 (0x0004 - 0x0000)
struct BP_DYN_Vehicle_Matchstick_C_ReceiveUpdateHealthEffects final
{
public:
	float                                         HealthPct;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DYN_Vehicle_Matchstick_C_ReceiveUpdateHealthEffects) == 0x000004, "Wrong alignment on BP_DYN_Vehicle_Matchstick_C_ReceiveUpdateHealthEffects");
static_assert(sizeof(BP_DYN_Vehicle_Matchstick_C_ReceiveUpdateHealthEffects) == 0x000004, "Wrong size on BP_DYN_Vehicle_Matchstick_C_ReceiveUpdateHealthEffects");
static_assert(offsetof(BP_DYN_Vehicle_Matchstick_C_ReceiveUpdateHealthEffects, HealthPct) == 0x000000, "Member 'BP_DYN_Vehicle_Matchstick_C_ReceiveUpdateHealthEffects::HealthPct' has a wrong offset!");

}

