#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Destructible_FlameTrooperGrenade

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Tempest_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Destructible_FlameTrooperGrenade.BP_Destructible_FlameTrooperGrenade_C
// 0x0030 (0x1720 - 0x16F0)
class ABP_Destructible_FlameTrooperGrenade_C final : public ATedDestructible
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x16F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      PS_ExplosionFuelGrenade_01_Fire;                   // 0x16F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ActorLocation;                                     // 0x1700(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Destructible_FlameTrooperGrenade(int32 EntryPoint);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Destructible_FlameTrooperGrenade_C">();
	}
	static class ABP_Destructible_FlameTrooperGrenade_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Destructible_FlameTrooperGrenade_C>();
	}
};
static_assert(alignof(ABP_Destructible_FlameTrooperGrenade_C) == 0x000010, "Wrong alignment on ABP_Destructible_FlameTrooperGrenade_C");
static_assert(sizeof(ABP_Destructible_FlameTrooperGrenade_C) == 0x001720, "Wrong size on ABP_Destructible_FlameTrooperGrenade_C");
static_assert(offsetof(ABP_Destructible_FlameTrooperGrenade_C, UberGraphFrame) == 0x0016F0, "Member 'ABP_Destructible_FlameTrooperGrenade_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Destructible_FlameTrooperGrenade_C, PS_ExplosionFuelGrenade_01_Fire) == 0x0016F8, "Member 'ABP_Destructible_FlameTrooperGrenade_C::PS_ExplosionFuelGrenade_01_Fire' has a wrong offset!");
static_assert(offsetof(ABP_Destructible_FlameTrooperGrenade_C, ActorLocation) == 0x001700, "Member 'ABP_Destructible_FlameTrooperGrenade_C::ActorLocation' has a wrong offset!");

}

