#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DYN_Infantry_DynastyGuard

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_DYN_Infantry_DynastyGuard.BP_DYN_Infantry_DynastyGuard_C.ExecuteUbergraph_BP_DYN_Infantry_DynastyGuard
// 0x0048 (0x0048 - 0x0000)
struct BP_DYN_Infantry_DynastyGuard_C_ExecuteUbergraph_BP_DYN_Infantry_DynastyGuard final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityAsync_WaitGameplayTagAdded*     CallFunc_WaitGameplayTagAddToActor_ReturnValue;    // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0020(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityAsync_WaitGameplayTagRemoved*   CallFunc_WaitGameplayTagRemoveFromActor_ReturnValue; // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_1;          // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DYN_Infantry_DynastyGuard_C_ExecuteUbergraph_BP_DYN_Infantry_DynastyGuard) == 0x000008, "Wrong alignment on BP_DYN_Infantry_DynastyGuard_C_ExecuteUbergraph_BP_DYN_Infantry_DynastyGuard");
static_assert(sizeof(BP_DYN_Infantry_DynastyGuard_C_ExecuteUbergraph_BP_DYN_Infantry_DynastyGuard) == 0x000048, "Wrong size on BP_DYN_Infantry_DynastyGuard_C_ExecuteUbergraph_BP_DYN_Infantry_DynastyGuard");
static_assert(offsetof(BP_DYN_Infantry_DynastyGuard_C_ExecuteUbergraph_BP_DYN_Infantry_DynastyGuard, EntryPoint) == 0x000000, "Member 'BP_DYN_Infantry_DynastyGuard_C_ExecuteUbergraph_BP_DYN_Infantry_DynastyGuard::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_DYN_Infantry_DynastyGuard_C_ExecuteUbergraph_BP_DYN_Infantry_DynastyGuard, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BP_DYN_Infantry_DynastyGuard_C_ExecuteUbergraph_BP_DYN_Infantry_DynastyGuard::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_DYN_Infantry_DynastyGuard_C_ExecuteUbergraph_BP_DYN_Infantry_DynastyGuard, CallFunc_WaitGameplayTagAddToActor_ReturnValue) == 0x000018, "Member 'BP_DYN_Infantry_DynastyGuard_C_ExecuteUbergraph_BP_DYN_Infantry_DynastyGuard::CallFunc_WaitGameplayTagAddToActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DYN_Infantry_DynastyGuard_C_ExecuteUbergraph_BP_DYN_Infantry_DynastyGuard, K2Node_CreateDelegate_OutputDelegate_1) == 0x000020, "Member 'BP_DYN_Infantry_DynastyGuard_C_ExecuteUbergraph_BP_DYN_Infantry_DynastyGuard::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_DYN_Infantry_DynastyGuard_C_ExecuteUbergraph_BP_DYN_Infantry_DynastyGuard, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'BP_DYN_Infantry_DynastyGuard_C_ExecuteUbergraph_BP_DYN_Infantry_DynastyGuard::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DYN_Infantry_DynastyGuard_C_ExecuteUbergraph_BP_DYN_Infantry_DynastyGuard, CallFunc_WaitGameplayTagRemoveFromActor_ReturnValue) == 0x000038, "Member 'BP_DYN_Infantry_DynastyGuard_C_ExecuteUbergraph_BP_DYN_Infantry_DynastyGuard::CallFunc_WaitGameplayTagRemoveFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DYN_Infantry_DynastyGuard_C_ExecuteUbergraph_BP_DYN_Infantry_DynastyGuard, CallFunc_IsValid_ReturnValue_1) == 0x000040, "Member 'BP_DYN_Infantry_DynastyGuard_C_ExecuteUbergraph_BP_DYN_Infantry_DynastyGuard::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DYN_Infantry_DynastyGuard_C_ExecuteUbergraph_BP_DYN_Infantry_DynastyGuard, CallFunc_IsDedicatedServer_ReturnValue) == 0x000041, "Member 'BP_DYN_Infantry_DynastyGuard_C_ExecuteUbergraph_BP_DYN_Infantry_DynastyGuard::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DYN_Infantry_DynastyGuard_C_ExecuteUbergraph_BP_DYN_Infantry_DynastyGuard, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x000042, "Member 'BP_DYN_Infantry_DynastyGuard_C_ExecuteUbergraph_BP_DYN_Infantry_DynastyGuard::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DYN_Infantry_DynastyGuard_C_ExecuteUbergraph_BP_DYN_Infantry_DynastyGuard, CallFunc_IsDedicatedServer_ReturnValue_1) == 0x000043, "Member 'BP_DYN_Infantry_DynastyGuard_C_ExecuteUbergraph_BP_DYN_Infantry_DynastyGuard::CallFunc_IsDedicatedServer_ReturnValue_1' has a wrong offset!");

}

