#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DYN_Vehicle_TempestRigV2

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "PhysicsCore_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_DYN_Vehicle_TempestRigV2.BP_DYN_Vehicle_TempestRigV2_C.ExecuteUbergraph_BP_DYN_Vehicle_TempestRigV2
// 0x0428 (0x0428 - 0x0000)
struct BP_DYN_Vehicle_TempestRigV2_C_ExecuteUbergraph_BP_DYN_Vehicle_TempestRigV2 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 Temp_struct_Variable;                              // 0x0008(0x00D8)(ConstParm, ContainsInstancedReference)
	float                                         K2Node_Event_HealthPct;                            // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x00E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue_1;          // 0x00E5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue_2;          // 0x00E6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00E7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x00EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EB[0x1];                                       // 0x00EB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_Speed;                                // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_MaxSpeed;                             // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F4[0x4];                                       // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Square_ReturnValue;                       // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_1;          // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_2;          // 0x010A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_3;          // 0x010B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10C[0x4];                                      // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATedPawn*                               K2Node_Event_ReplacedBy;                           // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_4;          // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_BD_DYN_RefineryV2_C*                K2Node_DynamicCast_AsBP_BD_DYN_Refinery_V2;        // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_129[0x3];                                      // 0x0129(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FIntPoint                              CallFunc_GetStructureGridSize_ReturnValue;         // 0x012C(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_134[0x4];                                      // 0x0134(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EObjectTypeQuery>                      K2Node_MakeArray_Array;                            // 0x0138(0x0010)(ConstParm, ReferenceParm)
	struct FVector2D                              CallFunc_Conv_IntPointToVector2D_ReturnValue;      // 0x0148(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_Vector2DToVector_ReturnValue;        // 0x0158(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0170(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0188(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x01A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x01B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Conv_VectorToVector2D_ReturnValue;        // 0x01D0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetGroundLocation_ReturnValue;            // 0x01E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult;       // 0x01F8(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x02F0(0x0010)(ConstParm, ReferenceParm)
	struct FHitResult                             CallFunc_LineTraceSingleForObjects_OutHit;         // 0x0300(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingleForObjects_ReturnValue;    // 0x03F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPhysicalSurface                              CallFunc_GetSurfaceType_ReturnValue;               // 0x03F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3FA[0x2];                                      // 0x03FA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x03FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast;         // 0x0400(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast_1;       // 0x0408(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast_2;       // 0x0410(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Square_A_ImplicitCast;                    // 0x0418(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetFloatParameter_Param_ImplicitCast;     // 0x0420(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DYN_Vehicle_TempestRigV2_C_ExecuteUbergraph_BP_DYN_Vehicle_TempestRigV2) == 0x000008, "Wrong alignment on BP_DYN_Vehicle_TempestRigV2_C_ExecuteUbergraph_BP_DYN_Vehicle_TempestRigV2");
static_assert(sizeof(BP_DYN_Vehicle_TempestRigV2_C_ExecuteUbergraph_BP_DYN_Vehicle_TempestRigV2) == 0x000428, "Wrong size on BP_DYN_Vehicle_TempestRigV2_C_ExecuteUbergraph_BP_DYN_Vehicle_TempestRigV2");
static_assert(offsetof(BP_DYN_Vehicle_TempestRigV2_C_ExecuteUbergraph_BP_DYN_Vehicle_TempestRigV2, EntryPoint) == 0x000000, "Member 'BP_DYN_Vehicle_TempestRigV2_C_ExecuteUbergraph_BP_DYN_Vehicle_TempestRigV2::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_DYN_Vehicle_TempestRigV2_C_ExecuteUbergraph_BP_DYN_Vehicle_TempestRigV2, Temp_struct_Variable) == 0x000008, "Member 'BP_DYN_Vehicle_TempestRigV2_C_ExecuteUbergraph_BP_DYN_Vehicle_TempestRigV2::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_DYN_Vehicle_TempestRigV2_C_ExecuteUbergraph_BP_DYN_Vehicle_TempestRigV2, K2Node_Event_HealthPct) == 0x0000E0, "Member 'BP_DYN_Vehicle_TempestRigV2_C_ExecuteUbergraph_BP_DYN_Vehicle_TempestRigV2::K2Node_Event_HealthPct' has a wrong offset!");
static_assert(offsetof(BP_DYN_Vehicle_TempestRigV2_C_ExecuteUbergraph_BP_DYN_Vehicle_TempestRigV2, CallFunc_Less_DoubleDouble_ReturnValue) == 0x0000E4, "Member 'BP_DYN_Vehicle_TempestRigV2_C_ExecuteUbergraph_BP_DYN_Vehicle_TempestRigV2::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DYN_Vehicle_TempestRigV2_C_ExecuteUbergraph_BP_DYN_Vehicle_TempestRigV2, CallFunc_Less_DoubleDouble_ReturnValue_1) == 0x0000E5, "Member 'BP_DYN_Vehicle_TempestRigV2_C_ExecuteUbergraph_BP_DYN_Vehicle_TempestRigV2::CallFunc_Less_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DYN_Vehicle_TempestRigV2_C_ExecuteUbergraph_BP_DYN_Vehicle_TempestRigV2, CallFunc_Less_DoubleDouble_ReturnValue_2) == 0x0000E6, "Member 'BP_DYN_Vehicle_TempestRigV2_C_ExecuteUbergraph_BP_DYN_Vehicle_TempestRigV2::CallFunc_Less_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_DYN_Vehicle_TempestRigV2_C_ExecuteUbergraph_BP_DYN_Vehicle_TempestRigV2, CallFunc_Not_PreBool_ReturnValue) == 0x0000E7, "Member 'BP_DYN_Vehicle_TempestRigV2_C_ExecuteUbergraph_BP_DYN_Vehicle_TempestRigV2::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DYN_Vehicle_TempestRigV2_C_ExecuteUbergraph_BP_DYN_Vehicle_TempestRigV2, CallFunc_Not_PreBool_ReturnValue_1) == 0x0000E8, "Member 'BP_DYN_Vehicle_TempestRigV2_C_ExecuteUbergraph_BP_DYN_Vehicle_TempestRigV2::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DYN_Vehicle_TempestRigV2_C_ExecuteUbergraph_BP_DYN_Vehicle_TempestRigV2, CallFunc_BooleanAND_ReturnValue) == 0x0000E9, "Member 'BP_DYN_Vehicle_TempestRigV2_C_ExecuteUbergraph_BP_DYN_Vehicle_TempestRigV2::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DYN_Vehicle_TempestRigV2_C_ExecuteUbergraph_BP_DYN_Vehicle_TempestRigV2, CallFunc_BooleanAND_ReturnValue_1) == 0x0000EA, "Member 'BP_DYN_Vehicle_TempestRigV2_C_ExecuteUbergraph_BP_DYN_Vehicle_TempestRigV2::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DYN_Vehicle_TempestRigV2_C_ExecuteUbergraph_BP_DYN_Vehicle_TempestRigV2, K2Node_Event_Speed) == 0x0000EC, "Member 'BP_DYN_Vehicle_TempestRigV2_C_ExecuteUbergraph_BP_DYN_Vehicle_TempestRigV2::K2Node_Event_Speed' has a wrong offset!");
static_assert(offsetof(BP_DYN_Vehicle_TempestRigV2_C_ExecuteUbergraph_BP_DYN_Vehicle_TempestRigV2, K2Node_Event_MaxSpeed) == 0x0000F0, "Member 'BP_DYN_Vehicle_TempestRigV2_C_ExecuteUbergraph_BP_DYN_Vehicle_TempestRigV2::K2Node_Event_MaxSpeed' has a wrong offset!");
static_assert(offsetof(BP_DYN_Vehicle_TempestRigV2_C_ExecuteUbergraph_BP_DYN_Vehicle_TempestRigV2, CallFunc_Square_ReturnValue) == 0x0000F8, "Member 'BP_DYN_Vehicle_TempestRigV2_C_ExecuteUbergraph_BP_DYN_Vehicle_TempestRigV2::CallFunc_Square_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DYN_Vehicle_TempestRigV2_C_ExecuteUbergraph_BP_DYN_Vehicle_TempestRigV2, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000100, "Member 'BP_DYN_Vehicle_TempestRigV2_C_ExecuteUbergraph_BP_DYN_Vehicle_TempestRigV2::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DYN_Vehicle_TempestRigV2_C_ExecuteUbergraph_BP_DYN_Vehicle_TempestRigV2, CallFunc_IsDedicatedServer_ReturnValue) == 0x000108, "Member 'BP_DYN_Vehicle_TempestRigV2_C_ExecuteUbergraph_BP_DYN_Vehicle_TempestRigV2::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DYN_Vehicle_TempestRigV2_C_ExecuteUbergraph_BP_DYN_Vehicle_TempestRigV2, CallFunc_IsDedicatedServer_ReturnValue_1) == 0x000109, "Member 'BP_DYN_Vehicle_TempestRigV2_C_ExecuteUbergraph_BP_DYN_Vehicle_TempestRigV2::CallFunc_IsDedicatedServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DYN_Vehicle_TempestRigV2_C_ExecuteUbergraph_BP_DYN_Vehicle_TempestRigV2, CallFunc_IsDedicatedServer_ReturnValue_2) == 0x00010A, "Member 'BP_DYN_Vehicle_TempestRigV2_C_ExecuteUbergraph_BP_DYN_Vehicle_TempestRigV2::CallFunc_IsDedicatedServer_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_DYN_Vehicle_TempestRigV2_C_ExecuteUbergraph_BP_DYN_Vehicle_TempestRigV2, CallFunc_IsDedicatedServer_ReturnValue_3) == 0x00010B, "Member 'BP_DYN_Vehicle_TempestRigV2_C_ExecuteUbergraph_BP_DYN_Vehicle_TempestRigV2::CallFunc_IsDedicatedServer_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_DYN_Vehicle_TempestRigV2_C_ExecuteUbergraph_BP_DYN_Vehicle_TempestRigV2, K2Node_Event_ReplacedBy) == 0x000110, "Member 'BP_DYN_Vehicle_TempestRigV2_C_ExecuteUbergraph_BP_DYN_Vehicle_TempestRigV2::K2Node_Event_ReplacedBy' has a wrong offset!");
static_assert(offsetof(BP_DYN_Vehicle_TempestRigV2_C_ExecuteUbergraph_BP_DYN_Vehicle_TempestRigV2, CallFunc_IsDedicatedServer_ReturnValue_4) == 0x000118, "Member 'BP_DYN_Vehicle_TempestRigV2_C_ExecuteUbergraph_BP_DYN_Vehicle_TempestRigV2::CallFunc_IsDedicatedServer_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_DYN_Vehicle_TempestRigV2_C_ExecuteUbergraph_BP_DYN_Vehicle_TempestRigV2, K2Node_DynamicCast_AsBP_BD_DYN_Refinery_V2) == 0x000120, "Member 'BP_DYN_Vehicle_TempestRigV2_C_ExecuteUbergraph_BP_DYN_Vehicle_TempestRigV2::K2Node_DynamicCast_AsBP_BD_DYN_Refinery_V2' has a wrong offset!");
static_assert(offsetof(BP_DYN_Vehicle_TempestRigV2_C_ExecuteUbergraph_BP_DYN_Vehicle_TempestRigV2, K2Node_DynamicCast_bSuccess) == 0x000128, "Member 'BP_DYN_Vehicle_TempestRigV2_C_ExecuteUbergraph_BP_DYN_Vehicle_TempestRigV2::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_DYN_Vehicle_TempestRigV2_C_ExecuteUbergraph_BP_DYN_Vehicle_TempestRigV2, CallFunc_GetStructureGridSize_ReturnValue) == 0x00012C, "Member 'BP_DYN_Vehicle_TempestRigV2_C_ExecuteUbergraph_BP_DYN_Vehicle_TempestRigV2::CallFunc_GetStructureGridSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DYN_Vehicle_TempestRigV2_C_ExecuteUbergraph_BP_DYN_Vehicle_TempestRigV2, K2Node_MakeArray_Array) == 0x000138, "Member 'BP_DYN_Vehicle_TempestRigV2_C_ExecuteUbergraph_BP_DYN_Vehicle_TempestRigV2::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_DYN_Vehicle_TempestRigV2_C_ExecuteUbergraph_BP_DYN_Vehicle_TempestRigV2, CallFunc_Conv_IntPointToVector2D_ReturnValue) == 0x000148, "Member 'BP_DYN_Vehicle_TempestRigV2_C_ExecuteUbergraph_BP_DYN_Vehicle_TempestRigV2::CallFunc_Conv_IntPointToVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DYN_Vehicle_TempestRigV2_C_ExecuteUbergraph_BP_DYN_Vehicle_TempestRigV2, CallFunc_Conv_Vector2DToVector_ReturnValue) == 0x000158, "Member 'BP_DYN_Vehicle_TempestRigV2_C_ExecuteUbergraph_BP_DYN_Vehicle_TempestRigV2::CallFunc_Conv_Vector2DToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DYN_Vehicle_TempestRigV2_C_ExecuteUbergraph_BP_DYN_Vehicle_TempestRigV2, CallFunc_Add_VectorVector_ReturnValue) == 0x000170, "Member 'BP_DYN_Vehicle_TempestRigV2_C_ExecuteUbergraph_BP_DYN_Vehicle_TempestRigV2::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DYN_Vehicle_TempestRigV2_C_ExecuteUbergraph_BP_DYN_Vehicle_TempestRigV2, CallFunc_Add_VectorVector_ReturnValue_1) == 0x000188, "Member 'BP_DYN_Vehicle_TempestRigV2_C_ExecuteUbergraph_BP_DYN_Vehicle_TempestRigV2::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DYN_Vehicle_TempestRigV2_C_ExecuteUbergraph_BP_DYN_Vehicle_TempestRigV2, CallFunc_K2_GetActorRotation_ReturnValue) == 0x0001A0, "Member 'BP_DYN_Vehicle_TempestRigV2_C_ExecuteUbergraph_BP_DYN_Vehicle_TempestRigV2::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DYN_Vehicle_TempestRigV2_C_ExecuteUbergraph_BP_DYN_Vehicle_TempestRigV2, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0001B8, "Member 'BP_DYN_Vehicle_TempestRigV2_C_ExecuteUbergraph_BP_DYN_Vehicle_TempestRigV2::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DYN_Vehicle_TempestRigV2_C_ExecuteUbergraph_BP_DYN_Vehicle_TempestRigV2, CallFunc_Conv_VectorToVector2D_ReturnValue) == 0x0001D0, "Member 'BP_DYN_Vehicle_TempestRigV2_C_ExecuteUbergraph_BP_DYN_Vehicle_TempestRigV2::CallFunc_Conv_VectorToVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DYN_Vehicle_TempestRigV2_C_ExecuteUbergraph_BP_DYN_Vehicle_TempestRigV2, CallFunc_GetGroundLocation_ReturnValue) == 0x0001E0, "Member 'BP_DYN_Vehicle_TempestRigV2_C_ExecuteUbergraph_BP_DYN_Vehicle_TempestRigV2::CallFunc_GetGroundLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DYN_Vehicle_TempestRigV2_C_ExecuteUbergraph_BP_DYN_Vehicle_TempestRigV2, CallFunc_K2_SetWorldRotation_SweepHitResult) == 0x0001F8, "Member 'BP_DYN_Vehicle_TempestRigV2_C_ExecuteUbergraph_BP_DYN_Vehicle_TempestRigV2::CallFunc_K2_SetWorldRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_DYN_Vehicle_TempestRigV2_C_ExecuteUbergraph_BP_DYN_Vehicle_TempestRigV2, Temp_object_Variable) == 0x0002F0, "Member 'BP_DYN_Vehicle_TempestRigV2_C_ExecuteUbergraph_BP_DYN_Vehicle_TempestRigV2::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_DYN_Vehicle_TempestRigV2_C_ExecuteUbergraph_BP_DYN_Vehicle_TempestRigV2, CallFunc_LineTraceSingleForObjects_OutHit) == 0x000300, "Member 'BP_DYN_Vehicle_TempestRigV2_C_ExecuteUbergraph_BP_DYN_Vehicle_TempestRigV2::CallFunc_LineTraceSingleForObjects_OutHit' has a wrong offset!");
static_assert(offsetof(BP_DYN_Vehicle_TempestRigV2_C_ExecuteUbergraph_BP_DYN_Vehicle_TempestRigV2, CallFunc_LineTraceSingleForObjects_ReturnValue) == 0x0003F8, "Member 'BP_DYN_Vehicle_TempestRigV2_C_ExecuteUbergraph_BP_DYN_Vehicle_TempestRigV2::CallFunc_LineTraceSingleForObjects_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DYN_Vehicle_TempestRigV2_C_ExecuteUbergraph_BP_DYN_Vehicle_TempestRigV2, CallFunc_GetSurfaceType_ReturnValue) == 0x0003F9, "Member 'BP_DYN_Vehicle_TempestRigV2_C_ExecuteUbergraph_BP_DYN_Vehicle_TempestRigV2::CallFunc_GetSurfaceType_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DYN_Vehicle_TempestRigV2_C_ExecuteUbergraph_BP_DYN_Vehicle_TempestRigV2, CallFunc_Conv_ByteToInt_ReturnValue) == 0x0003FC, "Member 'BP_DYN_Vehicle_TempestRigV2_C_ExecuteUbergraph_BP_DYN_Vehicle_TempestRigV2::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DYN_Vehicle_TempestRigV2_C_ExecuteUbergraph_BP_DYN_Vehicle_TempestRigV2, CallFunc_Less_DoubleDouble_A_ImplicitCast) == 0x000400, "Member 'BP_DYN_Vehicle_TempestRigV2_C_ExecuteUbergraph_BP_DYN_Vehicle_TempestRigV2::CallFunc_Less_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_DYN_Vehicle_TempestRigV2_C_ExecuteUbergraph_BP_DYN_Vehicle_TempestRigV2, CallFunc_Less_DoubleDouble_A_ImplicitCast_1) == 0x000408, "Member 'BP_DYN_Vehicle_TempestRigV2_C_ExecuteUbergraph_BP_DYN_Vehicle_TempestRigV2::CallFunc_Less_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_DYN_Vehicle_TempestRigV2_C_ExecuteUbergraph_BP_DYN_Vehicle_TempestRigV2, CallFunc_Less_DoubleDouble_A_ImplicitCast_2) == 0x000410, "Member 'BP_DYN_Vehicle_TempestRigV2_C_ExecuteUbergraph_BP_DYN_Vehicle_TempestRigV2::CallFunc_Less_DoubleDouble_A_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(BP_DYN_Vehicle_TempestRigV2_C_ExecuteUbergraph_BP_DYN_Vehicle_TempestRigV2, CallFunc_Square_A_ImplicitCast) == 0x000418, "Member 'BP_DYN_Vehicle_TempestRigV2_C_ExecuteUbergraph_BP_DYN_Vehicle_TempestRigV2::CallFunc_Square_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_DYN_Vehicle_TempestRigV2_C_ExecuteUbergraph_BP_DYN_Vehicle_TempestRigV2, CallFunc_SetFloatParameter_Param_ImplicitCast) == 0x000420, "Member 'BP_DYN_Vehicle_TempestRigV2_C_ExecuteUbergraph_BP_DYN_Vehicle_TempestRigV2::CallFunc_SetFloatParameter_Param_ImplicitCast' has a wrong offset!");

// Function BP_DYN_Vehicle_TempestRigV2.BP_DYN_Vehicle_TempestRigV2_C.ReceiveOnPawnReplaced
// 0x0008 (0x0008 - 0x0000)
struct BP_DYN_Vehicle_TempestRigV2_C_ReceiveOnPawnReplaced final
{
public:
	class ATedPawn*                               ReplacedBy;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DYN_Vehicle_TempestRigV2_C_ReceiveOnPawnReplaced) == 0x000008, "Wrong alignment on BP_DYN_Vehicle_TempestRigV2_C_ReceiveOnPawnReplaced");
static_assert(sizeof(BP_DYN_Vehicle_TempestRigV2_C_ReceiveOnPawnReplaced) == 0x000008, "Wrong size on BP_DYN_Vehicle_TempestRigV2_C_ReceiveOnPawnReplaced");
static_assert(offsetof(BP_DYN_Vehicle_TempestRigV2_C_ReceiveOnPawnReplaced, ReplacedBy) == 0x000000, "Member 'BP_DYN_Vehicle_TempestRigV2_C_ReceiveOnPawnReplaced::ReplacedBy' has a wrong offset!");

// Function BP_DYN_Vehicle_TempestRigV2.BP_DYN_Vehicle_TempestRigV2_C.ReceiveTickMovement
// 0x0008 (0x0008 - 0x0000)
struct BP_DYN_Vehicle_TempestRigV2_C_ReceiveTickMovement final
{
public:
	float                                         Speed;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxSpeed;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DYN_Vehicle_TempestRigV2_C_ReceiveTickMovement) == 0x000004, "Wrong alignment on BP_DYN_Vehicle_TempestRigV2_C_ReceiveTickMovement");
static_assert(sizeof(BP_DYN_Vehicle_TempestRigV2_C_ReceiveTickMovement) == 0x000008, "Wrong size on BP_DYN_Vehicle_TempestRigV2_C_ReceiveTickMovement");
static_assert(offsetof(BP_DYN_Vehicle_TempestRigV2_C_ReceiveTickMovement, Speed) == 0x000000, "Member 'BP_DYN_Vehicle_TempestRigV2_C_ReceiveTickMovement::Speed' has a wrong offset!");
static_assert(offsetof(BP_DYN_Vehicle_TempestRigV2_C_ReceiveTickMovement, MaxSpeed) == 0x000004, "Member 'BP_DYN_Vehicle_TempestRigV2_C_ReceiveTickMovement::MaxSpeed' has a wrong offset!");

// Function BP_DYN_Vehicle_TempestRigV2.BP_DYN_Vehicle_TempestRigV2_C.ReceiveUpdateHealthEffects
// 0x0004 (0x0004 - 0x0000)
struct BP_DYN_Vehicle_TempestRigV2_C_ReceiveUpdateHealthEffects final
{
public:
	float                                         HealthPct;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DYN_Vehicle_TempestRigV2_C_ReceiveUpdateHealthEffects) == 0x000004, "Wrong alignment on BP_DYN_Vehicle_TempestRigV2_C_ReceiveUpdateHealthEffects");
static_assert(sizeof(BP_DYN_Vehicle_TempestRigV2_C_ReceiveUpdateHealthEffects) == 0x000004, "Wrong size on BP_DYN_Vehicle_TempestRigV2_C_ReceiveUpdateHealthEffects");
static_assert(offsetof(BP_DYN_Vehicle_TempestRigV2_C_ReceiveUpdateHealthEffects, HealthPct) == 0x000000, "Member 'BP_DYN_Vehicle_TempestRigV2_C_ReceiveUpdateHealthEffects::HealthPct' has a wrong offset!");

}

