#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DYN_Vehicle_TempestRig

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function BP_DYN_Vehicle_TempestRig.BP_DYN_Vehicle_TempestRig_C.ExecuteUbergraph_BP_DYN_Vehicle_TempestRig
// 0x0138 (0x0138 - 0x0000)
struct BP_DYN_Vehicle_TempestRig_C_ExecuteUbergraph_BP_DYN_Vehicle_TempestRig final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_Speed;                                // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_MaxSpeed;                             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Square_ReturnValue;                       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_HealthPct;                            // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue_1;          // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue_2;          // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0027(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B[0x5];                                       // 0x002B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 Temp_struct_Variable;                              // 0x0030(0x00D8)(ConstParm, ContainsInstancedReference)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_1;          // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_2;          // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_3;          // 0x010A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10B[0x5];                                      // 0x010B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Square_A_ImplicitCast;                    // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetFloatParameter_Param_ImplicitCast;     // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11C[0x4];                                      // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast;         // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast_1;       // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast_2;       // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DYN_Vehicle_TempestRig_C_ExecuteUbergraph_BP_DYN_Vehicle_TempestRig) == 0x000008, "Wrong alignment on BP_DYN_Vehicle_TempestRig_C_ExecuteUbergraph_BP_DYN_Vehicle_TempestRig");
static_assert(sizeof(BP_DYN_Vehicle_TempestRig_C_ExecuteUbergraph_BP_DYN_Vehicle_TempestRig) == 0x000138, "Wrong size on BP_DYN_Vehicle_TempestRig_C_ExecuteUbergraph_BP_DYN_Vehicle_TempestRig");
static_assert(offsetof(BP_DYN_Vehicle_TempestRig_C_ExecuteUbergraph_BP_DYN_Vehicle_TempestRig, EntryPoint) == 0x000000, "Member 'BP_DYN_Vehicle_TempestRig_C_ExecuteUbergraph_BP_DYN_Vehicle_TempestRig::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_DYN_Vehicle_TempestRig_C_ExecuteUbergraph_BP_DYN_Vehicle_TempestRig, CallFunc_IsDedicatedServer_ReturnValue) == 0x000004, "Member 'BP_DYN_Vehicle_TempestRig_C_ExecuteUbergraph_BP_DYN_Vehicle_TempestRig::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DYN_Vehicle_TempestRig_C_ExecuteUbergraph_BP_DYN_Vehicle_TempestRig, K2Node_Event_Speed) == 0x000008, "Member 'BP_DYN_Vehicle_TempestRig_C_ExecuteUbergraph_BP_DYN_Vehicle_TempestRig::K2Node_Event_Speed' has a wrong offset!");
static_assert(offsetof(BP_DYN_Vehicle_TempestRig_C_ExecuteUbergraph_BP_DYN_Vehicle_TempestRig, K2Node_Event_MaxSpeed) == 0x00000C, "Member 'BP_DYN_Vehicle_TempestRig_C_ExecuteUbergraph_BP_DYN_Vehicle_TempestRig::K2Node_Event_MaxSpeed' has a wrong offset!");
static_assert(offsetof(BP_DYN_Vehicle_TempestRig_C_ExecuteUbergraph_BP_DYN_Vehicle_TempestRig, CallFunc_Square_ReturnValue) == 0x000010, "Member 'BP_DYN_Vehicle_TempestRig_C_ExecuteUbergraph_BP_DYN_Vehicle_TempestRig::CallFunc_Square_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DYN_Vehicle_TempestRig_C_ExecuteUbergraph_BP_DYN_Vehicle_TempestRig, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000018, "Member 'BP_DYN_Vehicle_TempestRig_C_ExecuteUbergraph_BP_DYN_Vehicle_TempestRig::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DYN_Vehicle_TempestRig_C_ExecuteUbergraph_BP_DYN_Vehicle_TempestRig, K2Node_Event_HealthPct) == 0x000020, "Member 'BP_DYN_Vehicle_TempestRig_C_ExecuteUbergraph_BP_DYN_Vehicle_TempestRig::K2Node_Event_HealthPct' has a wrong offset!");
static_assert(offsetof(BP_DYN_Vehicle_TempestRig_C_ExecuteUbergraph_BP_DYN_Vehicle_TempestRig, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000024, "Member 'BP_DYN_Vehicle_TempestRig_C_ExecuteUbergraph_BP_DYN_Vehicle_TempestRig::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DYN_Vehicle_TempestRig_C_ExecuteUbergraph_BP_DYN_Vehicle_TempestRig, CallFunc_Less_DoubleDouble_ReturnValue_1) == 0x000025, "Member 'BP_DYN_Vehicle_TempestRig_C_ExecuteUbergraph_BP_DYN_Vehicle_TempestRig::CallFunc_Less_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DYN_Vehicle_TempestRig_C_ExecuteUbergraph_BP_DYN_Vehicle_TempestRig, CallFunc_Less_DoubleDouble_ReturnValue_2) == 0x000026, "Member 'BP_DYN_Vehicle_TempestRig_C_ExecuteUbergraph_BP_DYN_Vehicle_TempestRig::CallFunc_Less_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_DYN_Vehicle_TempestRig_C_ExecuteUbergraph_BP_DYN_Vehicle_TempestRig, CallFunc_Not_PreBool_ReturnValue) == 0x000027, "Member 'BP_DYN_Vehicle_TempestRig_C_ExecuteUbergraph_BP_DYN_Vehicle_TempestRig::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DYN_Vehicle_TempestRig_C_ExecuteUbergraph_BP_DYN_Vehicle_TempestRig, CallFunc_Not_PreBool_ReturnValue_1) == 0x000028, "Member 'BP_DYN_Vehicle_TempestRig_C_ExecuteUbergraph_BP_DYN_Vehicle_TempestRig::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DYN_Vehicle_TempestRig_C_ExecuteUbergraph_BP_DYN_Vehicle_TempestRig, CallFunc_BooleanAND_ReturnValue) == 0x000029, "Member 'BP_DYN_Vehicle_TempestRig_C_ExecuteUbergraph_BP_DYN_Vehicle_TempestRig::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DYN_Vehicle_TempestRig_C_ExecuteUbergraph_BP_DYN_Vehicle_TempestRig, CallFunc_BooleanAND_ReturnValue_1) == 0x00002A, "Member 'BP_DYN_Vehicle_TempestRig_C_ExecuteUbergraph_BP_DYN_Vehicle_TempestRig::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DYN_Vehicle_TempestRig_C_ExecuteUbergraph_BP_DYN_Vehicle_TempestRig, Temp_struct_Variable) == 0x000030, "Member 'BP_DYN_Vehicle_TempestRig_C_ExecuteUbergraph_BP_DYN_Vehicle_TempestRig::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_DYN_Vehicle_TempestRig_C_ExecuteUbergraph_BP_DYN_Vehicle_TempestRig, CallFunc_IsDedicatedServer_ReturnValue_1) == 0x000108, "Member 'BP_DYN_Vehicle_TempestRig_C_ExecuteUbergraph_BP_DYN_Vehicle_TempestRig::CallFunc_IsDedicatedServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DYN_Vehicle_TempestRig_C_ExecuteUbergraph_BP_DYN_Vehicle_TempestRig, CallFunc_IsDedicatedServer_ReturnValue_2) == 0x000109, "Member 'BP_DYN_Vehicle_TempestRig_C_ExecuteUbergraph_BP_DYN_Vehicle_TempestRig::CallFunc_IsDedicatedServer_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_DYN_Vehicle_TempestRig_C_ExecuteUbergraph_BP_DYN_Vehicle_TempestRig, CallFunc_IsDedicatedServer_ReturnValue_3) == 0x00010A, "Member 'BP_DYN_Vehicle_TempestRig_C_ExecuteUbergraph_BP_DYN_Vehicle_TempestRig::CallFunc_IsDedicatedServer_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_DYN_Vehicle_TempestRig_C_ExecuteUbergraph_BP_DYN_Vehicle_TempestRig, CallFunc_Square_A_ImplicitCast) == 0x000110, "Member 'BP_DYN_Vehicle_TempestRig_C_ExecuteUbergraph_BP_DYN_Vehicle_TempestRig::CallFunc_Square_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_DYN_Vehicle_TempestRig_C_ExecuteUbergraph_BP_DYN_Vehicle_TempestRig, CallFunc_SetFloatParameter_Param_ImplicitCast) == 0x000118, "Member 'BP_DYN_Vehicle_TempestRig_C_ExecuteUbergraph_BP_DYN_Vehicle_TempestRig::CallFunc_SetFloatParameter_Param_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_DYN_Vehicle_TempestRig_C_ExecuteUbergraph_BP_DYN_Vehicle_TempestRig, CallFunc_Less_DoubleDouble_A_ImplicitCast) == 0x000120, "Member 'BP_DYN_Vehicle_TempestRig_C_ExecuteUbergraph_BP_DYN_Vehicle_TempestRig::CallFunc_Less_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_DYN_Vehicle_TempestRig_C_ExecuteUbergraph_BP_DYN_Vehicle_TempestRig, CallFunc_Less_DoubleDouble_A_ImplicitCast_1) == 0x000128, "Member 'BP_DYN_Vehicle_TempestRig_C_ExecuteUbergraph_BP_DYN_Vehicle_TempestRig::CallFunc_Less_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_DYN_Vehicle_TempestRig_C_ExecuteUbergraph_BP_DYN_Vehicle_TempestRig, CallFunc_Less_DoubleDouble_A_ImplicitCast_2) == 0x000130, "Member 'BP_DYN_Vehicle_TempestRig_C_ExecuteUbergraph_BP_DYN_Vehicle_TempestRig::CallFunc_Less_DoubleDouble_A_ImplicitCast_2' has a wrong offset!");

// Function BP_DYN_Vehicle_TempestRig.BP_DYN_Vehicle_TempestRig_C.ReceiveTickMovement
// 0x0008 (0x0008 - 0x0000)
struct BP_DYN_Vehicle_TempestRig_C_ReceiveTickMovement final
{
public:
	float                                         Speed;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxSpeed;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DYN_Vehicle_TempestRig_C_ReceiveTickMovement) == 0x000004, "Wrong alignment on BP_DYN_Vehicle_TempestRig_C_ReceiveTickMovement");
static_assert(sizeof(BP_DYN_Vehicle_TempestRig_C_ReceiveTickMovement) == 0x000008, "Wrong size on BP_DYN_Vehicle_TempestRig_C_ReceiveTickMovement");
static_assert(offsetof(BP_DYN_Vehicle_TempestRig_C_ReceiveTickMovement, Speed) == 0x000000, "Member 'BP_DYN_Vehicle_TempestRig_C_ReceiveTickMovement::Speed' has a wrong offset!");
static_assert(offsetof(BP_DYN_Vehicle_TempestRig_C_ReceiveTickMovement, MaxSpeed) == 0x000004, "Member 'BP_DYN_Vehicle_TempestRig_C_ReceiveTickMovement::MaxSpeed' has a wrong offset!");

// Function BP_DYN_Vehicle_TempestRig.BP_DYN_Vehicle_TempestRig_C.ReceiveUpdateHealthEffects
// 0x0004 (0x0004 - 0x0000)
struct BP_DYN_Vehicle_TempestRig_C_ReceiveUpdateHealthEffects final
{
public:
	float                                         HealthPct;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DYN_Vehicle_TempestRig_C_ReceiveUpdateHealthEffects) == 0x000004, "Wrong alignment on BP_DYN_Vehicle_TempestRig_C_ReceiveUpdateHealthEffects");
static_assert(sizeof(BP_DYN_Vehicle_TempestRig_C_ReceiveUpdateHealthEffects) == 0x000004, "Wrong size on BP_DYN_Vehicle_TempestRig_C_ReceiveUpdateHealthEffects");
static_assert(offsetof(BP_DYN_Vehicle_TempestRig_C_ReceiveUpdateHealthEffects, HealthPct) == 0x000000, "Member 'BP_DYN_Vehicle_TempestRig_C_ReceiveUpdateHealthEffects::HealthPct' has a wrong offset!");

}

