#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ExplosiveBarrel

#include "Basic.hpp"

#include "SavedGame_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_ExplosiveBarrel.BP_ExplosiveBarrel_C.ExecuteUbergraph_BP_ExplosiveBarrel
// 0x00D8 (0x00D8 - 0x0000)
struct BP_ExplosiveBarrel_C_ExecuteUbergraph_BP_ExplosiveBarrel final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_RandomFloatInRange_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0010(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_HealthPct;                            // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue_1;          // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue_2;          // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_1;                // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_1;          // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDecalComponent*                        CallFunc_SpawnDecalAtLocation_ReturnValue;         // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESavedGameYesNo                               CallFunc_IsLoadingGame_Output;                     // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_82[0x6];                                       // 0x0082(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0088(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDecalComponent*                        CallFunc_SpawnDecalAtLocation_ReturnValue_1;       // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Yaw_ImplicitCast;             // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast;         // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast_1;       // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast_2;       // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Yaw_ImplicitCast_1;           // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ExplosiveBarrel_C_ExecuteUbergraph_BP_ExplosiveBarrel) == 0x000008, "Wrong alignment on BP_ExplosiveBarrel_C_ExecuteUbergraph_BP_ExplosiveBarrel");
static_assert(sizeof(BP_ExplosiveBarrel_C_ExecuteUbergraph_BP_ExplosiveBarrel) == 0x0000D8, "Wrong size on BP_ExplosiveBarrel_C_ExecuteUbergraph_BP_ExplosiveBarrel");
static_assert(offsetof(BP_ExplosiveBarrel_C_ExecuteUbergraph_BP_ExplosiveBarrel, EntryPoint) == 0x000000, "Member 'BP_ExplosiveBarrel_C_ExecuteUbergraph_BP_ExplosiveBarrel::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ExplosiveBarrel_C_ExecuteUbergraph_BP_ExplosiveBarrel, CallFunc_RandomFloatInRange_ReturnValue) == 0x000008, "Member 'BP_ExplosiveBarrel_C_ExecuteUbergraph_BP_ExplosiveBarrel::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ExplosiveBarrel_C_ExecuteUbergraph_BP_ExplosiveBarrel, CallFunc_MakeRotator_ReturnValue) == 0x000010, "Member 'BP_ExplosiveBarrel_C_ExecuteUbergraph_BP_ExplosiveBarrel::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ExplosiveBarrel_C_ExecuteUbergraph_BP_ExplosiveBarrel, Temp_bool_IsClosed_Variable) == 0x000028, "Member 'BP_ExplosiveBarrel_C_ExecuteUbergraph_BP_ExplosiveBarrel::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_ExplosiveBarrel_C_ExecuteUbergraph_BP_ExplosiveBarrel, K2Node_Event_HealthPct) == 0x00002C, "Member 'BP_ExplosiveBarrel_C_ExecuteUbergraph_BP_ExplosiveBarrel::K2Node_Event_HealthPct' has a wrong offset!");
static_assert(offsetof(BP_ExplosiveBarrel_C_ExecuteUbergraph_BP_ExplosiveBarrel, CallFunc_IsDedicatedServer_ReturnValue) == 0x000030, "Member 'BP_ExplosiveBarrel_C_ExecuteUbergraph_BP_ExplosiveBarrel::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ExplosiveBarrel_C_ExecuteUbergraph_BP_ExplosiveBarrel, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000031, "Member 'BP_ExplosiveBarrel_C_ExecuteUbergraph_BP_ExplosiveBarrel::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ExplosiveBarrel_C_ExecuteUbergraph_BP_ExplosiveBarrel, CallFunc_Less_DoubleDouble_ReturnValue_1) == 0x000032, "Member 'BP_ExplosiveBarrel_C_ExecuteUbergraph_BP_ExplosiveBarrel::CallFunc_Less_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ExplosiveBarrel_C_ExecuteUbergraph_BP_ExplosiveBarrel, CallFunc_Less_DoubleDouble_ReturnValue_2) == 0x000033, "Member 'BP_ExplosiveBarrel_C_ExecuteUbergraph_BP_ExplosiveBarrel::CallFunc_Less_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ExplosiveBarrel_C_ExecuteUbergraph_BP_ExplosiveBarrel, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000038, "Member 'BP_ExplosiveBarrel_C_ExecuteUbergraph_BP_ExplosiveBarrel::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ExplosiveBarrel_C_ExecuteUbergraph_BP_ExplosiveBarrel, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x000050, "Member 'BP_ExplosiveBarrel_C_ExecuteUbergraph_BP_ExplosiveBarrel::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ExplosiveBarrel_C_ExecuteUbergraph_BP_ExplosiveBarrel, CallFunc_MakeRotator_ReturnValue_1) == 0x000058, "Member 'BP_ExplosiveBarrel_C_ExecuteUbergraph_BP_ExplosiveBarrel::CallFunc_MakeRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ExplosiveBarrel_C_ExecuteUbergraph_BP_ExplosiveBarrel, CallFunc_IsDedicatedServer_ReturnValue_1) == 0x000070, "Member 'BP_ExplosiveBarrel_C_ExecuteUbergraph_BP_ExplosiveBarrel::CallFunc_IsDedicatedServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ExplosiveBarrel_C_ExecuteUbergraph_BP_ExplosiveBarrel, CallFunc_SpawnDecalAtLocation_ReturnValue) == 0x000078, "Member 'BP_ExplosiveBarrel_C_ExecuteUbergraph_BP_ExplosiveBarrel::CallFunc_SpawnDecalAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ExplosiveBarrel_C_ExecuteUbergraph_BP_ExplosiveBarrel, Temp_bool_Has_Been_Initd_Variable) == 0x000080, "Member 'BP_ExplosiveBarrel_C_ExecuteUbergraph_BP_ExplosiveBarrel::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_ExplosiveBarrel_C_ExecuteUbergraph_BP_ExplosiveBarrel, CallFunc_IsLoadingGame_Output) == 0x000081, "Member 'BP_ExplosiveBarrel_C_ExecuteUbergraph_BP_ExplosiveBarrel::CallFunc_IsLoadingGame_Output' has a wrong offset!");
static_assert(offsetof(BP_ExplosiveBarrel_C_ExecuteUbergraph_BP_ExplosiveBarrel, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000088, "Member 'BP_ExplosiveBarrel_C_ExecuteUbergraph_BP_ExplosiveBarrel::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ExplosiveBarrel_C_ExecuteUbergraph_BP_ExplosiveBarrel, K2Node_SwitchEnum_CmpSuccess) == 0x0000A0, "Member 'BP_ExplosiveBarrel_C_ExecuteUbergraph_BP_ExplosiveBarrel::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_ExplosiveBarrel_C_ExecuteUbergraph_BP_ExplosiveBarrel, CallFunc_SpawnDecalAtLocation_ReturnValue_1) == 0x0000A8, "Member 'BP_ExplosiveBarrel_C_ExecuteUbergraph_BP_ExplosiveBarrel::CallFunc_SpawnDecalAtLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ExplosiveBarrel_C_ExecuteUbergraph_BP_ExplosiveBarrel, CallFunc_MakeRotator_Yaw_ImplicitCast) == 0x0000B0, "Member 'BP_ExplosiveBarrel_C_ExecuteUbergraph_BP_ExplosiveBarrel::CallFunc_MakeRotator_Yaw_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_ExplosiveBarrel_C_ExecuteUbergraph_BP_ExplosiveBarrel, CallFunc_Less_DoubleDouble_A_ImplicitCast) == 0x0000B8, "Member 'BP_ExplosiveBarrel_C_ExecuteUbergraph_BP_ExplosiveBarrel::CallFunc_Less_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_ExplosiveBarrel_C_ExecuteUbergraph_BP_ExplosiveBarrel, CallFunc_Less_DoubleDouble_A_ImplicitCast_1) == 0x0000C0, "Member 'BP_ExplosiveBarrel_C_ExecuteUbergraph_BP_ExplosiveBarrel::CallFunc_Less_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_ExplosiveBarrel_C_ExecuteUbergraph_BP_ExplosiveBarrel, CallFunc_Less_DoubleDouble_A_ImplicitCast_2) == 0x0000C8, "Member 'BP_ExplosiveBarrel_C_ExecuteUbergraph_BP_ExplosiveBarrel::CallFunc_Less_DoubleDouble_A_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(BP_ExplosiveBarrel_C_ExecuteUbergraph_BP_ExplosiveBarrel, CallFunc_MakeRotator_Yaw_ImplicitCast_1) == 0x0000D0, "Member 'BP_ExplosiveBarrel_C_ExecuteUbergraph_BP_ExplosiveBarrel::CallFunc_MakeRotator_Yaw_ImplicitCast_1' has a wrong offset!");

// Function BP_ExplosiveBarrel.BP_ExplosiveBarrel_C.ReceiveUpdateHealthEffects
// 0x0004 (0x0004 - 0x0000)
struct BP_ExplosiveBarrel_C_ReceiveUpdateHealthEffects final
{
public:
	float                                         HealthPct;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ExplosiveBarrel_C_ReceiveUpdateHealthEffects) == 0x000004, "Wrong alignment on BP_ExplosiveBarrel_C_ReceiveUpdateHealthEffects");
static_assert(sizeof(BP_ExplosiveBarrel_C_ReceiveUpdateHealthEffects) == 0x000004, "Wrong size on BP_ExplosiveBarrel_C_ReceiveUpdateHealthEffects");
static_assert(offsetof(BP_ExplosiveBarrel_C_ReceiveUpdateHealthEffects, HealthPct) == 0x000000, "Member 'BP_ExplosiveBarrel_C_ReceiveUpdateHealthEffects::HealthPct' has a wrong offset!");

}

