#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ExplosiveBarrel_Horizontal_NoAfterFire

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_ExplosiveBarrel_Horizontal_NoAfterFire.BP_ExplosiveBarrel_Horizontal_NoAfterFire_C.ExecuteUbergraph_BP_ExplosiveBarrel_Horizontal_NoAfterFire
// 0x0080 (0x0080 - 0x0000)
struct BP_ExplosiveBarrel_Horizontal_NoAfterFire_C_ExecuteUbergraph_BP_ExplosiveBarrel_Horizontal_NoAfterFire final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_HealthPct;                            // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue_1;          // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue_2;          // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0010(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue;           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_1;          // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDecalComponent*                        CallFunc_SpawnDecalAtLocation_ReturnValue;         // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast;         // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast_1;       // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast_2;       // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Yaw_ImplicitCast;             // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ExplosiveBarrel_Horizontal_NoAfterFire_C_ExecuteUbergraph_BP_ExplosiveBarrel_Horizontal_NoAfterFire) == 0x000008, "Wrong alignment on BP_ExplosiveBarrel_Horizontal_NoAfterFire_C_ExecuteUbergraph_BP_ExplosiveBarrel_Horizontal_NoAfterFire");
static_assert(sizeof(BP_ExplosiveBarrel_Horizontal_NoAfterFire_C_ExecuteUbergraph_BP_ExplosiveBarrel_Horizontal_NoAfterFire) == 0x000080, "Wrong size on BP_ExplosiveBarrel_Horizontal_NoAfterFire_C_ExecuteUbergraph_BP_ExplosiveBarrel_Horizontal_NoAfterFire");
static_assert(offsetof(BP_ExplosiveBarrel_Horizontal_NoAfterFire_C_ExecuteUbergraph_BP_ExplosiveBarrel_Horizontal_NoAfterFire, EntryPoint) == 0x000000, "Member 'BP_ExplosiveBarrel_Horizontal_NoAfterFire_C_ExecuteUbergraph_BP_ExplosiveBarrel_Horizontal_NoAfterFire::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ExplosiveBarrel_Horizontal_NoAfterFire_C_ExecuteUbergraph_BP_ExplosiveBarrel_Horizontal_NoAfterFire, Temp_bool_IsClosed_Variable) == 0x000004, "Member 'BP_ExplosiveBarrel_Horizontal_NoAfterFire_C_ExecuteUbergraph_BP_ExplosiveBarrel_Horizontal_NoAfterFire::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_ExplosiveBarrel_Horizontal_NoAfterFire_C_ExecuteUbergraph_BP_ExplosiveBarrel_Horizontal_NoAfterFire, K2Node_Event_HealthPct) == 0x000008, "Member 'BP_ExplosiveBarrel_Horizontal_NoAfterFire_C_ExecuteUbergraph_BP_ExplosiveBarrel_Horizontal_NoAfterFire::K2Node_Event_HealthPct' has a wrong offset!");
static_assert(offsetof(BP_ExplosiveBarrel_Horizontal_NoAfterFire_C_ExecuteUbergraph_BP_ExplosiveBarrel_Horizontal_NoAfterFire, CallFunc_IsDedicatedServer_ReturnValue) == 0x00000C, "Member 'BP_ExplosiveBarrel_Horizontal_NoAfterFire_C_ExecuteUbergraph_BP_ExplosiveBarrel_Horizontal_NoAfterFire::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ExplosiveBarrel_Horizontal_NoAfterFire_C_ExecuteUbergraph_BP_ExplosiveBarrel_Horizontal_NoAfterFire, CallFunc_Less_DoubleDouble_ReturnValue) == 0x00000D, "Member 'BP_ExplosiveBarrel_Horizontal_NoAfterFire_C_ExecuteUbergraph_BP_ExplosiveBarrel_Horizontal_NoAfterFire::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ExplosiveBarrel_Horizontal_NoAfterFire_C_ExecuteUbergraph_BP_ExplosiveBarrel_Horizontal_NoAfterFire, CallFunc_Less_DoubleDouble_ReturnValue_1) == 0x00000E, "Member 'BP_ExplosiveBarrel_Horizontal_NoAfterFire_C_ExecuteUbergraph_BP_ExplosiveBarrel_Horizontal_NoAfterFire::CallFunc_Less_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ExplosiveBarrel_Horizontal_NoAfterFire_C_ExecuteUbergraph_BP_ExplosiveBarrel_Horizontal_NoAfterFire, CallFunc_Less_DoubleDouble_ReturnValue_2) == 0x00000F, "Member 'BP_ExplosiveBarrel_Horizontal_NoAfterFire_C_ExecuteUbergraph_BP_ExplosiveBarrel_Horizontal_NoAfterFire::CallFunc_Less_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ExplosiveBarrel_Horizontal_NoAfterFire_C_ExecuteUbergraph_BP_ExplosiveBarrel_Horizontal_NoAfterFire, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000010, "Member 'BP_ExplosiveBarrel_Horizontal_NoAfterFire_C_ExecuteUbergraph_BP_ExplosiveBarrel_Horizontal_NoAfterFire::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ExplosiveBarrel_Horizontal_NoAfterFire_C_ExecuteUbergraph_BP_ExplosiveBarrel_Horizontal_NoAfterFire, CallFunc_RandomFloatInRange_ReturnValue) == 0x000028, "Member 'BP_ExplosiveBarrel_Horizontal_NoAfterFire_C_ExecuteUbergraph_BP_ExplosiveBarrel_Horizontal_NoAfterFire::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ExplosiveBarrel_Horizontal_NoAfterFire_C_ExecuteUbergraph_BP_ExplosiveBarrel_Horizontal_NoAfterFire, CallFunc_MakeRotator_ReturnValue) == 0x000030, "Member 'BP_ExplosiveBarrel_Horizontal_NoAfterFire_C_ExecuteUbergraph_BP_ExplosiveBarrel_Horizontal_NoAfterFire::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ExplosiveBarrel_Horizontal_NoAfterFire_C_ExecuteUbergraph_BP_ExplosiveBarrel_Horizontal_NoAfterFire, CallFunc_IsDedicatedServer_ReturnValue_1) == 0x000048, "Member 'BP_ExplosiveBarrel_Horizontal_NoAfterFire_C_ExecuteUbergraph_BP_ExplosiveBarrel_Horizontal_NoAfterFire::CallFunc_IsDedicatedServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ExplosiveBarrel_Horizontal_NoAfterFire_C_ExecuteUbergraph_BP_ExplosiveBarrel_Horizontal_NoAfterFire, CallFunc_SpawnDecalAtLocation_ReturnValue) == 0x000050, "Member 'BP_ExplosiveBarrel_Horizontal_NoAfterFire_C_ExecuteUbergraph_BP_ExplosiveBarrel_Horizontal_NoAfterFire::CallFunc_SpawnDecalAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ExplosiveBarrel_Horizontal_NoAfterFire_C_ExecuteUbergraph_BP_ExplosiveBarrel_Horizontal_NoAfterFire, Temp_bool_Has_Been_Initd_Variable) == 0x000058, "Member 'BP_ExplosiveBarrel_Horizontal_NoAfterFire_C_ExecuteUbergraph_BP_ExplosiveBarrel_Horizontal_NoAfterFire::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_ExplosiveBarrel_Horizontal_NoAfterFire_C_ExecuteUbergraph_BP_ExplosiveBarrel_Horizontal_NoAfterFire, CallFunc_Less_DoubleDouble_A_ImplicitCast) == 0x000060, "Member 'BP_ExplosiveBarrel_Horizontal_NoAfterFire_C_ExecuteUbergraph_BP_ExplosiveBarrel_Horizontal_NoAfterFire::CallFunc_Less_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_ExplosiveBarrel_Horizontal_NoAfterFire_C_ExecuteUbergraph_BP_ExplosiveBarrel_Horizontal_NoAfterFire, CallFunc_Less_DoubleDouble_A_ImplicitCast_1) == 0x000068, "Member 'BP_ExplosiveBarrel_Horizontal_NoAfterFire_C_ExecuteUbergraph_BP_ExplosiveBarrel_Horizontal_NoAfterFire::CallFunc_Less_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_ExplosiveBarrel_Horizontal_NoAfterFire_C_ExecuteUbergraph_BP_ExplosiveBarrel_Horizontal_NoAfterFire, CallFunc_Less_DoubleDouble_A_ImplicitCast_2) == 0x000070, "Member 'BP_ExplosiveBarrel_Horizontal_NoAfterFire_C_ExecuteUbergraph_BP_ExplosiveBarrel_Horizontal_NoAfterFire::CallFunc_Less_DoubleDouble_A_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(BP_ExplosiveBarrel_Horizontal_NoAfterFire_C_ExecuteUbergraph_BP_ExplosiveBarrel_Horizontal_NoAfterFire, CallFunc_MakeRotator_Yaw_ImplicitCast) == 0x000078, "Member 'BP_ExplosiveBarrel_Horizontal_NoAfterFire_C_ExecuteUbergraph_BP_ExplosiveBarrel_Horizontal_NoAfterFire::CallFunc_MakeRotator_Yaw_ImplicitCast' has a wrong offset!");

// Function BP_ExplosiveBarrel_Horizontal_NoAfterFire.BP_ExplosiveBarrel_Horizontal_NoAfterFire_C.ReceiveUpdateHealthEffects
// 0x0004 (0x0004 - 0x0000)
struct BP_ExplosiveBarrel_Horizontal_NoAfterFire_C_ReceiveUpdateHealthEffects final
{
public:
	float                                         HealthPct;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ExplosiveBarrel_Horizontal_NoAfterFire_C_ReceiveUpdateHealthEffects) == 0x000004, "Wrong alignment on BP_ExplosiveBarrel_Horizontal_NoAfterFire_C_ReceiveUpdateHealthEffects");
static_assert(sizeof(BP_ExplosiveBarrel_Horizontal_NoAfterFire_C_ReceiveUpdateHealthEffects) == 0x000004, "Wrong size on BP_ExplosiveBarrel_Horizontal_NoAfterFire_C_ReceiveUpdateHealthEffects");
static_assert(offsetof(BP_ExplosiveBarrel_Horizontal_NoAfterFire_C_ReceiveUpdateHealthEffects, HealthPct) == 0x000000, "Member 'BP_ExplosiveBarrel_Horizontal_NoAfterFire_C_ReceiveUpdateHealthEffects::HealthPct' has a wrong offset!");

}

