#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GDF_Vehicle_CombatDrone

#include "Basic.hpp"

#include "UniversalObjectLocator_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_GDF_Vehicle_CombatDrone.BP_GDF_Vehicle_CombatDrone_C.ExecuteUbergraph_BP_GDF_Vehicle_CombatDrone
// 0x0118 (0x0118 - 0x0000)
struct BP_GDF_Vehicle_CombatDrone_C_ExecuteUbergraph_BP_GDF_Vehicle_CombatDrone final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFXSystemComponent*                     CallFunc_SpawnEffectAtLocation_ReturnValue;        // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue_1;          // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 CallFunc_MakeGameplayCueParameters_ReturnValue;    // 0x0040(0x00D8)(ContainsInstancedReference)
};
static_assert(alignof(BP_GDF_Vehicle_CombatDrone_C_ExecuteUbergraph_BP_GDF_Vehicle_CombatDrone) == 0x000008, "Wrong alignment on BP_GDF_Vehicle_CombatDrone_C_ExecuteUbergraph_BP_GDF_Vehicle_CombatDrone");
static_assert(sizeof(BP_GDF_Vehicle_CombatDrone_C_ExecuteUbergraph_BP_GDF_Vehicle_CombatDrone) == 0x000118, "Wrong size on BP_GDF_Vehicle_CombatDrone_C_ExecuteUbergraph_BP_GDF_Vehicle_CombatDrone");
static_assert(offsetof(BP_GDF_Vehicle_CombatDrone_C_ExecuteUbergraph_BP_GDF_Vehicle_CombatDrone, EntryPoint) == 0x000000, "Member 'BP_GDF_Vehicle_CombatDrone_C_ExecuteUbergraph_BP_GDF_Vehicle_CombatDrone::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_GDF_Vehicle_CombatDrone_C_ExecuteUbergraph_BP_GDF_Vehicle_CombatDrone, CallFunc_HasAuthority_ReturnValue) == 0x000004, "Member 'BP_GDF_Vehicle_CombatDrone_C_ExecuteUbergraph_BP_GDF_Vehicle_CombatDrone::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GDF_Vehicle_CombatDrone_C_ExecuteUbergraph_BP_GDF_Vehicle_CombatDrone, CallFunc_GetSocketLocation_ReturnValue) == 0x000008, "Member 'BP_GDF_Vehicle_CombatDrone_C_ExecuteUbergraph_BP_GDF_Vehicle_CombatDrone::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GDF_Vehicle_CombatDrone_C_ExecuteUbergraph_BP_GDF_Vehicle_CombatDrone, CallFunc_SpawnEffectAtLocation_ReturnValue) == 0x000020, "Member 'BP_GDF_Vehicle_CombatDrone_C_ExecuteUbergraph_BP_GDF_Vehicle_CombatDrone::CallFunc_SpawnEffectAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GDF_Vehicle_CombatDrone_C_ExecuteUbergraph_BP_GDF_Vehicle_CombatDrone, CallFunc_GetSocketLocation_ReturnValue_1) == 0x000028, "Member 'BP_GDF_Vehicle_CombatDrone_C_ExecuteUbergraph_BP_GDF_Vehicle_CombatDrone::CallFunc_GetSocketLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GDF_Vehicle_CombatDrone_C_ExecuteUbergraph_BP_GDF_Vehicle_CombatDrone, CallFunc_MakeGameplayCueParameters_ReturnValue) == 0x000040, "Member 'BP_GDF_Vehicle_CombatDrone_C_ExecuteUbergraph_BP_GDF_Vehicle_CombatDrone::CallFunc_MakeGameplayCueParameters_ReturnValue' has a wrong offset!");

// Function BP_GDF_Vehicle_CombatDrone.BP_GDF_Vehicle_CombatDrone_C.K2_GetSelectionMIDs
// 0x0098 (0x0098 - 0x0000)
struct BP_GDF_Vehicle_CombatDrone_C_K2_GetSelectionMIDs final
{
public:
	TArray<class UMaterialInstanceDynamic*>       OutSelectionMIDs;                                  // 0x0000(0x0010)(Parm, OutParm)
	TArray<class UMaterialInstanceDynamic*>       MIDs;                                              // 0x0010(0x0010)(Edit, BlueprintVisible)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FUniversalObjectLocator                CallFunc_MakeUniversalObjectLocator_ReturnValue;   // 0x0028(0x0010)(HasGetValueTypeHash)
	struct FUniversalObjectLocator                CallFunc_MakeUniversalObjectLocator_ReturnValue_1; // 0x0038(0x0010)(HasGetValueTypeHash)
	class UObject*                                CallFunc_SyncLoad_ReturnValue;                     // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_SyncLoad_ReturnValue_1;                   // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceConstant*              K2Node_DynamicCast_AsMaterial_Instance_Constant;   // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceConstant*              K2Node_DynamicCast_AsMaterial_Instance_Constant_1; // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_1; // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_2; // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_2;                  // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GDF_Vehicle_CombatDrone_C_K2_GetSelectionMIDs) == 0x000008, "Wrong alignment on BP_GDF_Vehicle_CombatDrone_C_K2_GetSelectionMIDs");
static_assert(sizeof(BP_GDF_Vehicle_CombatDrone_C_K2_GetSelectionMIDs) == 0x000098, "Wrong size on BP_GDF_Vehicle_CombatDrone_C_K2_GetSelectionMIDs");
static_assert(offsetof(BP_GDF_Vehicle_CombatDrone_C_K2_GetSelectionMIDs, OutSelectionMIDs) == 0x000000, "Member 'BP_GDF_Vehicle_CombatDrone_C_K2_GetSelectionMIDs::OutSelectionMIDs' has a wrong offset!");
static_assert(offsetof(BP_GDF_Vehicle_CombatDrone_C_K2_GetSelectionMIDs, MIDs) == 0x000010, "Member 'BP_GDF_Vehicle_CombatDrone_C_K2_GetSelectionMIDs::MIDs' has a wrong offset!");
static_assert(offsetof(BP_GDF_Vehicle_CombatDrone_C_K2_GetSelectionMIDs, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000020, "Member 'BP_GDF_Vehicle_CombatDrone_C_K2_GetSelectionMIDs::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GDF_Vehicle_CombatDrone_C_K2_GetSelectionMIDs, CallFunc_MakeUniversalObjectLocator_ReturnValue) == 0x000028, "Member 'BP_GDF_Vehicle_CombatDrone_C_K2_GetSelectionMIDs::CallFunc_MakeUniversalObjectLocator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GDF_Vehicle_CombatDrone_C_K2_GetSelectionMIDs, CallFunc_MakeUniversalObjectLocator_ReturnValue_1) == 0x000038, "Member 'BP_GDF_Vehicle_CombatDrone_C_K2_GetSelectionMIDs::CallFunc_MakeUniversalObjectLocator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GDF_Vehicle_CombatDrone_C_K2_GetSelectionMIDs, CallFunc_SyncLoad_ReturnValue) == 0x000048, "Member 'BP_GDF_Vehicle_CombatDrone_C_K2_GetSelectionMIDs::CallFunc_SyncLoad_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GDF_Vehicle_CombatDrone_C_K2_GetSelectionMIDs, CallFunc_SyncLoad_ReturnValue_1) == 0x000050, "Member 'BP_GDF_Vehicle_CombatDrone_C_K2_GetSelectionMIDs::CallFunc_SyncLoad_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GDF_Vehicle_CombatDrone_C_K2_GetSelectionMIDs, K2Node_DynamicCast_AsMaterial_Instance_Constant) == 0x000058, "Member 'BP_GDF_Vehicle_CombatDrone_C_K2_GetSelectionMIDs::K2Node_DynamicCast_AsMaterial_Instance_Constant' has a wrong offset!");
static_assert(offsetof(BP_GDF_Vehicle_CombatDrone_C_K2_GetSelectionMIDs, K2Node_DynamicCast_bSuccess) == 0x000060, "Member 'BP_GDF_Vehicle_CombatDrone_C_K2_GetSelectionMIDs::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_GDF_Vehicle_CombatDrone_C_K2_GetSelectionMIDs, K2Node_DynamicCast_AsMaterial_Instance_Constant_1) == 0x000068, "Member 'BP_GDF_Vehicle_CombatDrone_C_K2_GetSelectionMIDs::K2Node_DynamicCast_AsMaterial_Instance_Constant_1' has a wrong offset!");
static_assert(offsetof(BP_GDF_Vehicle_CombatDrone_C_K2_GetSelectionMIDs, K2Node_DynamicCast_bSuccess_1) == 0x000070, "Member 'BP_GDF_Vehicle_CombatDrone_C_K2_GetSelectionMIDs::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_GDF_Vehicle_CombatDrone_C_K2_GetSelectionMIDs, CallFunc_CreateDynamicMaterialInstance_ReturnValue_1) == 0x000078, "Member 'BP_GDF_Vehicle_CombatDrone_C_K2_GetSelectionMIDs::CallFunc_CreateDynamicMaterialInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GDF_Vehicle_CombatDrone_C_K2_GetSelectionMIDs, CallFunc_CreateDynamicMaterialInstance_ReturnValue_2) == 0x000080, "Member 'BP_GDF_Vehicle_CombatDrone_C_K2_GetSelectionMIDs::CallFunc_CreateDynamicMaterialInstance_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_GDF_Vehicle_CombatDrone_C_K2_GetSelectionMIDs, CallFunc_Array_Add_ReturnValue) == 0x000088, "Member 'BP_GDF_Vehicle_CombatDrone_C_K2_GetSelectionMIDs::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GDF_Vehicle_CombatDrone_C_K2_GetSelectionMIDs, CallFunc_Array_Add_ReturnValue_1) == 0x00008C, "Member 'BP_GDF_Vehicle_CombatDrone_C_K2_GetSelectionMIDs::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GDF_Vehicle_CombatDrone_C_K2_GetSelectionMIDs, CallFunc_Array_Add_ReturnValue_2) == 0x000090, "Member 'BP_GDF_Vehicle_CombatDrone_C_K2_GetSelectionMIDs::CallFunc_Array_Add_ReturnValue_2' has a wrong offset!");

}

