#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GDF_Vehicle_Humvee

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_GDF_Vehicle_Humvee.BP_GDF_Vehicle_Humvee_C.ExecuteUbergraph_BP_GDF_Vehicle_Humvee
// 0x0140 (0x0140 - 0x0000)
struct BP_GDF_Vehicle_Humvee_C_ExecuteUbergraph_BP_GDF_Vehicle_Humvee final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Speed;                                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_MaxSpeed;                             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_HealthPct;                            // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue_1;          // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue_2;          // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x003E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F[0x1];                                       // 0x003F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 Temp_struct_Variable;                              // 0x0040(0x00D8)(ConstParm, ContainsInstancedReference)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_1;          // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_2;          // 0x011A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_3;          // 0x011B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11C[0x4];                                      // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast;         // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast_1;       // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast_2;       // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GDF_Vehicle_Humvee_C_ExecuteUbergraph_BP_GDF_Vehicle_Humvee) == 0x000008, "Wrong alignment on BP_GDF_Vehicle_Humvee_C_ExecuteUbergraph_BP_GDF_Vehicle_Humvee");
static_assert(sizeof(BP_GDF_Vehicle_Humvee_C_ExecuteUbergraph_BP_GDF_Vehicle_Humvee) == 0x000140, "Wrong size on BP_GDF_Vehicle_Humvee_C_ExecuteUbergraph_BP_GDF_Vehicle_Humvee");
static_assert(offsetof(BP_GDF_Vehicle_Humvee_C_ExecuteUbergraph_BP_GDF_Vehicle_Humvee, EntryPoint) == 0x000000, "Member 'BP_GDF_Vehicle_Humvee_C_ExecuteUbergraph_BP_GDF_Vehicle_Humvee::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_GDF_Vehicle_Humvee_C_ExecuteUbergraph_BP_GDF_Vehicle_Humvee, K2Node_Event_Speed) == 0x000004, "Member 'BP_GDF_Vehicle_Humvee_C_ExecuteUbergraph_BP_GDF_Vehicle_Humvee::K2Node_Event_Speed' has a wrong offset!");
static_assert(offsetof(BP_GDF_Vehicle_Humvee_C_ExecuteUbergraph_BP_GDF_Vehicle_Humvee, K2Node_Event_MaxSpeed) == 0x000008, "Member 'BP_GDF_Vehicle_Humvee_C_ExecuteUbergraph_BP_GDF_Vehicle_Humvee::K2Node_Event_MaxSpeed' has a wrong offset!");
static_assert(offsetof(BP_GDF_Vehicle_Humvee_C_ExecuteUbergraph_BP_GDF_Vehicle_Humvee, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000010, "Member 'BP_GDF_Vehicle_Humvee_C_ExecuteUbergraph_BP_GDF_Vehicle_Humvee::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GDF_Vehicle_Humvee_C_ExecuteUbergraph_BP_GDF_Vehicle_Humvee, K2Node_Event_HealthPct) == 0x000018, "Member 'BP_GDF_Vehicle_Humvee_C_ExecuteUbergraph_BP_GDF_Vehicle_Humvee::K2Node_Event_HealthPct' has a wrong offset!");
static_assert(offsetof(BP_GDF_Vehicle_Humvee_C_ExecuteUbergraph_BP_GDF_Vehicle_Humvee, CallFunc_MakeVector_ReturnValue) == 0x000020, "Member 'BP_GDF_Vehicle_Humvee_C_ExecuteUbergraph_BP_GDF_Vehicle_Humvee::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GDF_Vehicle_Humvee_C_ExecuteUbergraph_BP_GDF_Vehicle_Humvee, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000038, "Member 'BP_GDF_Vehicle_Humvee_C_ExecuteUbergraph_BP_GDF_Vehicle_Humvee::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GDF_Vehicle_Humvee_C_ExecuteUbergraph_BP_GDF_Vehicle_Humvee, CallFunc_Less_DoubleDouble_ReturnValue_1) == 0x000039, "Member 'BP_GDF_Vehicle_Humvee_C_ExecuteUbergraph_BP_GDF_Vehicle_Humvee::CallFunc_Less_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GDF_Vehicle_Humvee_C_ExecuteUbergraph_BP_GDF_Vehicle_Humvee, CallFunc_Less_DoubleDouble_ReturnValue_2) == 0x00003A, "Member 'BP_GDF_Vehicle_Humvee_C_ExecuteUbergraph_BP_GDF_Vehicle_Humvee::CallFunc_Less_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_GDF_Vehicle_Humvee_C_ExecuteUbergraph_BP_GDF_Vehicle_Humvee, CallFunc_Not_PreBool_ReturnValue) == 0x00003B, "Member 'BP_GDF_Vehicle_Humvee_C_ExecuteUbergraph_BP_GDF_Vehicle_Humvee::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GDF_Vehicle_Humvee_C_ExecuteUbergraph_BP_GDF_Vehicle_Humvee, CallFunc_Not_PreBool_ReturnValue_1) == 0x00003C, "Member 'BP_GDF_Vehicle_Humvee_C_ExecuteUbergraph_BP_GDF_Vehicle_Humvee::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GDF_Vehicle_Humvee_C_ExecuteUbergraph_BP_GDF_Vehicle_Humvee, CallFunc_BooleanAND_ReturnValue) == 0x00003D, "Member 'BP_GDF_Vehicle_Humvee_C_ExecuteUbergraph_BP_GDF_Vehicle_Humvee::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GDF_Vehicle_Humvee_C_ExecuteUbergraph_BP_GDF_Vehicle_Humvee, CallFunc_BooleanAND_ReturnValue_1) == 0x00003E, "Member 'BP_GDF_Vehicle_Humvee_C_ExecuteUbergraph_BP_GDF_Vehicle_Humvee::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GDF_Vehicle_Humvee_C_ExecuteUbergraph_BP_GDF_Vehicle_Humvee, Temp_struct_Variable) == 0x000040, "Member 'BP_GDF_Vehicle_Humvee_C_ExecuteUbergraph_BP_GDF_Vehicle_Humvee::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_GDF_Vehicle_Humvee_C_ExecuteUbergraph_BP_GDF_Vehicle_Humvee, CallFunc_IsDedicatedServer_ReturnValue) == 0x000118, "Member 'BP_GDF_Vehicle_Humvee_C_ExecuteUbergraph_BP_GDF_Vehicle_Humvee::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GDF_Vehicle_Humvee_C_ExecuteUbergraph_BP_GDF_Vehicle_Humvee, CallFunc_IsDedicatedServer_ReturnValue_1) == 0x000119, "Member 'BP_GDF_Vehicle_Humvee_C_ExecuteUbergraph_BP_GDF_Vehicle_Humvee::CallFunc_IsDedicatedServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GDF_Vehicle_Humvee_C_ExecuteUbergraph_BP_GDF_Vehicle_Humvee, CallFunc_IsDedicatedServer_ReturnValue_2) == 0x00011A, "Member 'BP_GDF_Vehicle_Humvee_C_ExecuteUbergraph_BP_GDF_Vehicle_Humvee::CallFunc_IsDedicatedServer_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_GDF_Vehicle_Humvee_C_ExecuteUbergraph_BP_GDF_Vehicle_Humvee, CallFunc_IsDedicatedServer_ReturnValue_3) == 0x00011B, "Member 'BP_GDF_Vehicle_Humvee_C_ExecuteUbergraph_BP_GDF_Vehicle_Humvee::CallFunc_IsDedicatedServer_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_GDF_Vehicle_Humvee_C_ExecuteUbergraph_BP_GDF_Vehicle_Humvee, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x000120, "Member 'BP_GDF_Vehicle_Humvee_C_ExecuteUbergraph_BP_GDF_Vehicle_Humvee::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_GDF_Vehicle_Humvee_C_ExecuteUbergraph_BP_GDF_Vehicle_Humvee, CallFunc_Less_DoubleDouble_A_ImplicitCast) == 0x000128, "Member 'BP_GDF_Vehicle_Humvee_C_ExecuteUbergraph_BP_GDF_Vehicle_Humvee::CallFunc_Less_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_GDF_Vehicle_Humvee_C_ExecuteUbergraph_BP_GDF_Vehicle_Humvee, CallFunc_Less_DoubleDouble_A_ImplicitCast_1) == 0x000130, "Member 'BP_GDF_Vehicle_Humvee_C_ExecuteUbergraph_BP_GDF_Vehicle_Humvee::CallFunc_Less_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_GDF_Vehicle_Humvee_C_ExecuteUbergraph_BP_GDF_Vehicle_Humvee, CallFunc_Less_DoubleDouble_A_ImplicitCast_2) == 0x000138, "Member 'BP_GDF_Vehicle_Humvee_C_ExecuteUbergraph_BP_GDF_Vehicle_Humvee::CallFunc_Less_DoubleDouble_A_ImplicitCast_2' has a wrong offset!");

// Function BP_GDF_Vehicle_Humvee.BP_GDF_Vehicle_Humvee_C.ReceiveTickMovement
// 0x0008 (0x0008 - 0x0000)
struct BP_GDF_Vehicle_Humvee_C_ReceiveTickMovement final
{
public:
	float                                         Speed;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxSpeed;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GDF_Vehicle_Humvee_C_ReceiveTickMovement) == 0x000004, "Wrong alignment on BP_GDF_Vehicle_Humvee_C_ReceiveTickMovement");
static_assert(sizeof(BP_GDF_Vehicle_Humvee_C_ReceiveTickMovement) == 0x000008, "Wrong size on BP_GDF_Vehicle_Humvee_C_ReceiveTickMovement");
static_assert(offsetof(BP_GDF_Vehicle_Humvee_C_ReceiveTickMovement, Speed) == 0x000000, "Member 'BP_GDF_Vehicle_Humvee_C_ReceiveTickMovement::Speed' has a wrong offset!");
static_assert(offsetof(BP_GDF_Vehicle_Humvee_C_ReceiveTickMovement, MaxSpeed) == 0x000004, "Member 'BP_GDF_Vehicle_Humvee_C_ReceiveTickMovement::MaxSpeed' has a wrong offset!");

// Function BP_GDF_Vehicle_Humvee.BP_GDF_Vehicle_Humvee_C.ReceiveUpdateHealthEffects
// 0x0004 (0x0004 - 0x0000)
struct BP_GDF_Vehicle_Humvee_C_ReceiveUpdateHealthEffects final
{
public:
	float                                         HealthPct;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GDF_Vehicle_Humvee_C_ReceiveUpdateHealthEffects) == 0x000004, "Wrong alignment on BP_GDF_Vehicle_Humvee_C_ReceiveUpdateHealthEffects");
static_assert(sizeof(BP_GDF_Vehicle_Humvee_C_ReceiveUpdateHealthEffects) == 0x000004, "Wrong size on BP_GDF_Vehicle_Humvee_C_ReceiveUpdateHealthEffects");
static_assert(offsetof(BP_GDF_Vehicle_Humvee_C_ReceiveUpdateHealthEffects, HealthPct) == 0x000000, "Member 'BP_GDF_Vehicle_Humvee_C_ReceiveUpdateHealthEffects::HealthPct' has a wrong offset!");

// Function BP_GDF_Vehicle_Humvee.BP_GDF_Vehicle_Humvee_C.UserConstructionScript
// 0x0001 (0x0001 - 0x0000)
struct BP_GDF_Vehicle_Humvee_C_UserConstructionScript final
{
public:
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GDF_Vehicle_Humvee_C_UserConstructionScript) == 0x000001, "Wrong alignment on BP_GDF_Vehicle_Humvee_C_UserConstructionScript");
static_assert(sizeof(BP_GDF_Vehicle_Humvee_C_UserConstructionScript) == 0x000001, "Wrong size on BP_GDF_Vehicle_Humvee_C_UserConstructionScript");
static_assert(offsetof(BP_GDF_Vehicle_Humvee_C_UserConstructionScript, CallFunc_K2_AttachToComponent_ReturnValue) == 0x000000, "Member 'BP_GDF_Vehicle_Humvee_C_UserConstructionScript::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");

}

