#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GDF_Vehicle_Skycrane

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_GDF_Vehicle_Skycrane.BP_GDF_Vehicle_Skycrane_C.ExecuteUbergraph_BP_GDF_Vehicle_Skycrane
// 0x0388 (0x0388 - 0x0000)
struct BP_GDF_Vehicle_Skycrane_C_ExecuteUbergraph_BP_GDF_Vehicle_Skycrane final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_1;          // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_HealthPct;                            // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 CallFunc_MakeGameplayCueParameters_ReturnValue;    // 0x0040(0x00D8)(ContainsInstancedReference)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue_1;          // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue_2;          // 0x011A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x011B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x011C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x011D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11E[0x2];                                      // 0x011E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0120(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_2;          // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0131(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_132[0x2];                                      // 0x0132(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           CallFunc_MakeLiteralGameplayTag_ReturnValue;       // 0x0134(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13C[0x4];                                      // 0x013C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0140(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityAsync_WaitGameplayTagAdded*     CallFunc_WaitGameplayTagAddToActor_ReturnValue;    // 0x0158(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_161[0x3];                                      // 0x0161(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           CallFunc_MakeLiteralGameplayTag_ReturnValue_1;     // 0x0164(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16C[0x4];                                      // 0x016C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityAsync_WaitGameplayTagRemoved*   CallFunc_WaitGameplayTagRemoveFromActor_ReturnValue; // 0x0170(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_179[0x7];                                      // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x0180(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult_1;  // 0x0278(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast;         // 0x0370(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast_1;       // 0x0378(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast_2;       // 0x0380(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GDF_Vehicle_Skycrane_C_ExecuteUbergraph_BP_GDF_Vehicle_Skycrane) == 0x000008, "Wrong alignment on BP_GDF_Vehicle_Skycrane_C_ExecuteUbergraph_BP_GDF_Vehicle_Skycrane");
static_assert(sizeof(BP_GDF_Vehicle_Skycrane_C_ExecuteUbergraph_BP_GDF_Vehicle_Skycrane) == 0x000388, "Wrong size on BP_GDF_Vehicle_Skycrane_C_ExecuteUbergraph_BP_GDF_Vehicle_Skycrane");
static_assert(offsetof(BP_GDF_Vehicle_Skycrane_C_ExecuteUbergraph_BP_GDF_Vehicle_Skycrane, EntryPoint) == 0x000000, "Member 'BP_GDF_Vehicle_Skycrane_C_ExecuteUbergraph_BP_GDF_Vehicle_Skycrane::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_GDF_Vehicle_Skycrane_C_ExecuteUbergraph_BP_GDF_Vehicle_Skycrane, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BP_GDF_Vehicle_Skycrane_C_ExecuteUbergraph_BP_GDF_Vehicle_Skycrane::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_GDF_Vehicle_Skycrane_C_ExecuteUbergraph_BP_GDF_Vehicle_Skycrane, CallFunc_IsDedicatedServer_ReturnValue) == 0x000014, "Member 'BP_GDF_Vehicle_Skycrane_C_ExecuteUbergraph_BP_GDF_Vehicle_Skycrane::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GDF_Vehicle_Skycrane_C_ExecuteUbergraph_BP_GDF_Vehicle_Skycrane, CallFunc_IsDedicatedServer_ReturnValue_1) == 0x000015, "Member 'BP_GDF_Vehicle_Skycrane_C_ExecuteUbergraph_BP_GDF_Vehicle_Skycrane::CallFunc_IsDedicatedServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GDF_Vehicle_Skycrane_C_ExecuteUbergraph_BP_GDF_Vehicle_Skycrane, K2Node_Event_HealthPct) == 0x000018, "Member 'BP_GDF_Vehicle_Skycrane_C_ExecuteUbergraph_BP_GDF_Vehicle_Skycrane::K2Node_Event_HealthPct' has a wrong offset!");
static_assert(offsetof(BP_GDF_Vehicle_Skycrane_C_ExecuteUbergraph_BP_GDF_Vehicle_Skycrane, CallFunc_GetSocketLocation_ReturnValue) == 0x000020, "Member 'BP_GDF_Vehicle_Skycrane_C_ExecuteUbergraph_BP_GDF_Vehicle_Skycrane::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GDF_Vehicle_Skycrane_C_ExecuteUbergraph_BP_GDF_Vehicle_Skycrane, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000038, "Member 'BP_GDF_Vehicle_Skycrane_C_ExecuteUbergraph_BP_GDF_Vehicle_Skycrane::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GDF_Vehicle_Skycrane_C_ExecuteUbergraph_BP_GDF_Vehicle_Skycrane, CallFunc_MakeGameplayCueParameters_ReturnValue) == 0x000040, "Member 'BP_GDF_Vehicle_Skycrane_C_ExecuteUbergraph_BP_GDF_Vehicle_Skycrane::CallFunc_MakeGameplayCueParameters_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GDF_Vehicle_Skycrane_C_ExecuteUbergraph_BP_GDF_Vehicle_Skycrane, CallFunc_Less_DoubleDouble_ReturnValue_1) == 0x000118, "Member 'BP_GDF_Vehicle_Skycrane_C_ExecuteUbergraph_BP_GDF_Vehicle_Skycrane::CallFunc_Less_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GDF_Vehicle_Skycrane_C_ExecuteUbergraph_BP_GDF_Vehicle_Skycrane, CallFunc_Not_PreBool_ReturnValue) == 0x000119, "Member 'BP_GDF_Vehicle_Skycrane_C_ExecuteUbergraph_BP_GDF_Vehicle_Skycrane::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GDF_Vehicle_Skycrane_C_ExecuteUbergraph_BP_GDF_Vehicle_Skycrane, CallFunc_Less_DoubleDouble_ReturnValue_2) == 0x00011A, "Member 'BP_GDF_Vehicle_Skycrane_C_ExecuteUbergraph_BP_GDF_Vehicle_Skycrane::CallFunc_Less_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_GDF_Vehicle_Skycrane_C_ExecuteUbergraph_BP_GDF_Vehicle_Skycrane, CallFunc_BooleanAND_ReturnValue) == 0x00011B, "Member 'BP_GDF_Vehicle_Skycrane_C_ExecuteUbergraph_BP_GDF_Vehicle_Skycrane::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GDF_Vehicle_Skycrane_C_ExecuteUbergraph_BP_GDF_Vehicle_Skycrane, CallFunc_Not_PreBool_ReturnValue_1) == 0x00011C, "Member 'BP_GDF_Vehicle_Skycrane_C_ExecuteUbergraph_BP_GDF_Vehicle_Skycrane::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GDF_Vehicle_Skycrane_C_ExecuteUbergraph_BP_GDF_Vehicle_Skycrane, CallFunc_BooleanAND_ReturnValue_1) == 0x00011D, "Member 'BP_GDF_Vehicle_Skycrane_C_ExecuteUbergraph_BP_GDF_Vehicle_Skycrane::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GDF_Vehicle_Skycrane_C_ExecuteUbergraph_BP_GDF_Vehicle_Skycrane, K2Node_CreateDelegate_OutputDelegate_1) == 0x000120, "Member 'BP_GDF_Vehicle_Skycrane_C_ExecuteUbergraph_BP_GDF_Vehicle_Skycrane::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_GDF_Vehicle_Skycrane_C_ExecuteUbergraph_BP_GDF_Vehicle_Skycrane, CallFunc_IsDedicatedServer_ReturnValue_2) == 0x000130, "Member 'BP_GDF_Vehicle_Skycrane_C_ExecuteUbergraph_BP_GDF_Vehicle_Skycrane::CallFunc_IsDedicatedServer_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_GDF_Vehicle_Skycrane_C_ExecuteUbergraph_BP_GDF_Vehicle_Skycrane, CallFunc_HasAuthority_ReturnValue) == 0x000131, "Member 'BP_GDF_Vehicle_Skycrane_C_ExecuteUbergraph_BP_GDF_Vehicle_Skycrane::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GDF_Vehicle_Skycrane_C_ExecuteUbergraph_BP_GDF_Vehicle_Skycrane, CallFunc_MakeLiteralGameplayTag_ReturnValue) == 0x000134, "Member 'BP_GDF_Vehicle_Skycrane_C_ExecuteUbergraph_BP_GDF_Vehicle_Skycrane::CallFunc_MakeLiteralGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GDF_Vehicle_Skycrane_C_ExecuteUbergraph_BP_GDF_Vehicle_Skycrane, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000140, "Member 'BP_GDF_Vehicle_Skycrane_C_ExecuteUbergraph_BP_GDF_Vehicle_Skycrane::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GDF_Vehicle_Skycrane_C_ExecuteUbergraph_BP_GDF_Vehicle_Skycrane, CallFunc_WaitGameplayTagAddToActor_ReturnValue) == 0x000158, "Member 'BP_GDF_Vehicle_Skycrane_C_ExecuteUbergraph_BP_GDF_Vehicle_Skycrane::CallFunc_WaitGameplayTagAddToActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GDF_Vehicle_Skycrane_C_ExecuteUbergraph_BP_GDF_Vehicle_Skycrane, CallFunc_IsValid_ReturnValue) == 0x000160, "Member 'BP_GDF_Vehicle_Skycrane_C_ExecuteUbergraph_BP_GDF_Vehicle_Skycrane::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GDF_Vehicle_Skycrane_C_ExecuteUbergraph_BP_GDF_Vehicle_Skycrane, CallFunc_MakeLiteralGameplayTag_ReturnValue_1) == 0x000164, "Member 'BP_GDF_Vehicle_Skycrane_C_ExecuteUbergraph_BP_GDF_Vehicle_Skycrane::CallFunc_MakeLiteralGameplayTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GDF_Vehicle_Skycrane_C_ExecuteUbergraph_BP_GDF_Vehicle_Skycrane, CallFunc_WaitGameplayTagRemoveFromActor_ReturnValue) == 0x000170, "Member 'BP_GDF_Vehicle_Skycrane_C_ExecuteUbergraph_BP_GDF_Vehicle_Skycrane::CallFunc_WaitGameplayTagRemoveFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GDF_Vehicle_Skycrane_C_ExecuteUbergraph_BP_GDF_Vehicle_Skycrane, CallFunc_IsValid_ReturnValue_1) == 0x000178, "Member 'BP_GDF_Vehicle_Skycrane_C_ExecuteUbergraph_BP_GDF_Vehicle_Skycrane::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GDF_Vehicle_Skycrane_C_ExecuteUbergraph_BP_GDF_Vehicle_Skycrane, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x000180, "Member 'BP_GDF_Vehicle_Skycrane_C_ExecuteUbergraph_BP_GDF_Vehicle_Skycrane::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_GDF_Vehicle_Skycrane_C_ExecuteUbergraph_BP_GDF_Vehicle_Skycrane, CallFunc_K2_SetRelativeRotation_SweepHitResult_1) == 0x000278, "Member 'BP_GDF_Vehicle_Skycrane_C_ExecuteUbergraph_BP_GDF_Vehicle_Skycrane::CallFunc_K2_SetRelativeRotation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(BP_GDF_Vehicle_Skycrane_C_ExecuteUbergraph_BP_GDF_Vehicle_Skycrane, CallFunc_Less_DoubleDouble_A_ImplicitCast) == 0x000370, "Member 'BP_GDF_Vehicle_Skycrane_C_ExecuteUbergraph_BP_GDF_Vehicle_Skycrane::CallFunc_Less_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_GDF_Vehicle_Skycrane_C_ExecuteUbergraph_BP_GDF_Vehicle_Skycrane, CallFunc_Less_DoubleDouble_A_ImplicitCast_1) == 0x000378, "Member 'BP_GDF_Vehicle_Skycrane_C_ExecuteUbergraph_BP_GDF_Vehicle_Skycrane::CallFunc_Less_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_GDF_Vehicle_Skycrane_C_ExecuteUbergraph_BP_GDF_Vehicle_Skycrane, CallFunc_Less_DoubleDouble_A_ImplicitCast_2) == 0x000380, "Member 'BP_GDF_Vehicle_Skycrane_C_ExecuteUbergraph_BP_GDF_Vehicle_Skycrane::CallFunc_Less_DoubleDouble_A_ImplicitCast_2' has a wrong offset!");

// Function BP_GDF_Vehicle_Skycrane.BP_GDF_Vehicle_Skycrane_C.ReceiveUpdateHealthEffects
// 0x0004 (0x0004 - 0x0000)
struct BP_GDF_Vehicle_Skycrane_C_ReceiveUpdateHealthEffects final
{
public:
	float                                         HealthPct;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GDF_Vehicle_Skycrane_C_ReceiveUpdateHealthEffects) == 0x000004, "Wrong alignment on BP_GDF_Vehicle_Skycrane_C_ReceiveUpdateHealthEffects");
static_assert(sizeof(BP_GDF_Vehicle_Skycrane_C_ReceiveUpdateHealthEffects) == 0x000004, "Wrong size on BP_GDF_Vehicle_Skycrane_C_ReceiveUpdateHealthEffects");
static_assert(offsetof(BP_GDF_Vehicle_Skycrane_C_ReceiveUpdateHealthEffects, HealthPct) == 0x000000, "Member 'BP_GDF_Vehicle_Skycrane_C_ReceiveUpdateHealthEffects::HealthPct' has a wrong offset!");

}

