#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GECAR_EmpoweredDynamos

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function BP_GECAR_EmpoweredDynamos.BP_GECAR_EmpoweredDynamos_C.CanApplyGameplayEffect
// 0x0308 (0x0308 - 0x0000)
struct BP_GECAR_EmpoweredDynamos_C_CanApplyGameplayEffect final
{
public:
	const class UGameplayEffect*                  GameplayEffect;                                    // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectSpec                    Spec;                                              // 0x0008(0x0298)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UAbilitySystemComponent*                ASC;                                               // 0x02A0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x02A8(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x02A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2AA[0x6];                                      // 0x02AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x02B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ATedPawn*                               K2Node_DynamicCast_AsTed_Pawn;                     // 0x02B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C1[0x3];                                      // 0x02C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           CallFunc_MakeLiteralGameplayTag_ReturnValue;       // 0x02C4(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2CC[0x4];                                      // 0x02CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTedPlayerData*                         CallFunc_GetOwningPlayerData_ReturnValue;          // 0x02D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D9[0x7];                                      // 0x02D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_GetOwnedTags_ReturnValue;                 // 0x02E0(0x0020)(ConstParm)
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x0300(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GECAR_EmpoweredDynamos_C_CanApplyGameplayEffect) == 0x000008, "Wrong alignment on BP_GECAR_EmpoweredDynamos_C_CanApplyGameplayEffect");
static_assert(sizeof(BP_GECAR_EmpoweredDynamos_C_CanApplyGameplayEffect) == 0x000308, "Wrong size on BP_GECAR_EmpoweredDynamos_C_CanApplyGameplayEffect");
static_assert(offsetof(BP_GECAR_EmpoweredDynamos_C_CanApplyGameplayEffect, GameplayEffect) == 0x000000, "Member 'BP_GECAR_EmpoweredDynamos_C_CanApplyGameplayEffect::GameplayEffect' has a wrong offset!");
static_assert(offsetof(BP_GECAR_EmpoweredDynamos_C_CanApplyGameplayEffect, Spec) == 0x000008, "Member 'BP_GECAR_EmpoweredDynamos_C_CanApplyGameplayEffect::Spec' has a wrong offset!");
static_assert(offsetof(BP_GECAR_EmpoweredDynamos_C_CanApplyGameplayEffect, ASC) == 0x0002A0, "Member 'BP_GECAR_EmpoweredDynamos_C_CanApplyGameplayEffect::ASC' has a wrong offset!");
static_assert(offsetof(BP_GECAR_EmpoweredDynamos_C_CanApplyGameplayEffect, ReturnValue) == 0x0002A8, "Member 'BP_GECAR_EmpoweredDynamos_C_CanApplyGameplayEffect::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GECAR_EmpoweredDynamos_C_CanApplyGameplayEffect, CallFunc_IsValid_ReturnValue) == 0x0002A9, "Member 'BP_GECAR_EmpoweredDynamos_C_CanApplyGameplayEffect::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GECAR_EmpoweredDynamos_C_CanApplyGameplayEffect, CallFunc_GetOwner_ReturnValue) == 0x0002B0, "Member 'BP_GECAR_EmpoweredDynamos_C_CanApplyGameplayEffect::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GECAR_EmpoweredDynamos_C_CanApplyGameplayEffect, K2Node_DynamicCast_AsTed_Pawn) == 0x0002B8, "Member 'BP_GECAR_EmpoweredDynamos_C_CanApplyGameplayEffect::K2Node_DynamicCast_AsTed_Pawn' has a wrong offset!");
static_assert(offsetof(BP_GECAR_EmpoweredDynamos_C_CanApplyGameplayEffect, K2Node_DynamicCast_bSuccess) == 0x0002C0, "Member 'BP_GECAR_EmpoweredDynamos_C_CanApplyGameplayEffect::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_GECAR_EmpoweredDynamos_C_CanApplyGameplayEffect, CallFunc_MakeLiteralGameplayTag_ReturnValue) == 0x0002C4, "Member 'BP_GECAR_EmpoweredDynamos_C_CanApplyGameplayEffect::CallFunc_MakeLiteralGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GECAR_EmpoweredDynamos_C_CanApplyGameplayEffect, CallFunc_GetOwningPlayerData_ReturnValue) == 0x0002D0, "Member 'BP_GECAR_EmpoweredDynamos_C_CanApplyGameplayEffect::CallFunc_GetOwningPlayerData_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GECAR_EmpoweredDynamos_C_CanApplyGameplayEffect, CallFunc_IsValid_ReturnValue_1) == 0x0002D8, "Member 'BP_GECAR_EmpoweredDynamos_C_CanApplyGameplayEffect::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GECAR_EmpoweredDynamos_C_CanApplyGameplayEffect, CallFunc_GetOwnedTags_ReturnValue) == 0x0002E0, "Member 'BP_GECAR_EmpoweredDynamos_C_CanApplyGameplayEffect::CallFunc_GetOwnedTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GECAR_EmpoweredDynamos_C_CanApplyGameplayEffect, CallFunc_HasTag_ReturnValue) == 0x000300, "Member 'BP_GECAR_EmpoweredDynamos_C_CanApplyGameplayEffect::CallFunc_HasTag_ReturnValue' has a wrong offset!");

}

