#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GDF_ConstructionSite

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "PhysicsCore_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_GDF_ConstructionSite.BP_GDF_ConstructionSite_C.CanBeSpawned
// 0x0038 (0x0038 - 0x0000)
struct BP_GDF_ConstructionSite_C_CanBeSpawned final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ATedPlayerController*                   K2Node_DynamicCast_AsTed_Player_Controller;        // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsFogOfWarVisibleFor_ReturnValue;         // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GDF_ConstructionSite_C_CanBeSpawned) == 0x000008, "Wrong alignment on BP_GDF_ConstructionSite_C_CanBeSpawned");
static_assert(sizeof(BP_GDF_ConstructionSite_C_CanBeSpawned) == 0x000038, "Wrong size on BP_GDF_ConstructionSite_C_CanBeSpawned");
static_assert(offsetof(BP_GDF_ConstructionSite_C_CanBeSpawned, Location) == 0x000000, "Member 'BP_GDF_ConstructionSite_C_CanBeSpawned::Location' has a wrong offset!");
static_assert(offsetof(BP_GDF_ConstructionSite_C_CanBeSpawned, Result) == 0x000018, "Member 'BP_GDF_ConstructionSite_C_CanBeSpawned::Result' has a wrong offset!");
static_assert(offsetof(BP_GDF_ConstructionSite_C_CanBeSpawned, CallFunc_GetPlayerController_ReturnValue) == 0x000020, "Member 'BP_GDF_ConstructionSite_C_CanBeSpawned::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GDF_ConstructionSite_C_CanBeSpawned, K2Node_DynamicCast_AsTed_Player_Controller) == 0x000028, "Member 'BP_GDF_ConstructionSite_C_CanBeSpawned::K2Node_DynamicCast_AsTed_Player_Controller' has a wrong offset!");
static_assert(offsetof(BP_GDF_ConstructionSite_C_CanBeSpawned, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'BP_GDF_ConstructionSite_C_CanBeSpawned::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_GDF_ConstructionSite_C_CanBeSpawned, CallFunc_IsFogOfWarVisibleFor_ReturnValue) == 0x000031, "Member 'BP_GDF_ConstructionSite_C_CanBeSpawned::CallFunc_IsFogOfWarVisibleFor_ReturnValue' has a wrong offset!");

// Function BP_GDF_ConstructionSite.BP_GDF_ConstructionSite_C.ExecuteUbergraph_BP_GDF_ConstructionSite
// 0x02B0 (0x02B0 - 0x0000)
struct BP_GDF_ConstructionSite_C_ExecuteUbergraph_BP_GDF_ConstructionSite final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanBeSpawned_Result;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EObjectTypeQuery>                      K2Node_MakeArray_Array;                            // 0x0008(0x0010)(ConstParm, ReferenceParm)
	struct FIntPoint                              CallFunc_GetStructureGridSize_ReturnValue;         // 0x0018(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Conv_IntPointToVector2D_ReturnValue;      // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_Vector2DToVector_ReturnValue;        // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0078(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0090(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult;       // 0x00A8(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x01A0(0x0010)(ConstParm, ReferenceParm)
	struct FHitResult                             CallFunc_LineTraceSingleForObjects_OutHit;         // 0x01B0(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingleForObjects_ReturnValue;    // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPhysicalSurface                              CallFunc_GetSurfaceType_ReturnValue;               // 0x02A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2AA[0x2];                                      // 0x02AA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x02AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GDF_ConstructionSite_C_ExecuteUbergraph_BP_GDF_ConstructionSite) == 0x000008, "Wrong alignment on BP_GDF_ConstructionSite_C_ExecuteUbergraph_BP_GDF_ConstructionSite");
static_assert(sizeof(BP_GDF_ConstructionSite_C_ExecuteUbergraph_BP_GDF_ConstructionSite) == 0x0002B0, "Wrong size on BP_GDF_ConstructionSite_C_ExecuteUbergraph_BP_GDF_ConstructionSite");
static_assert(offsetof(BP_GDF_ConstructionSite_C_ExecuteUbergraph_BP_GDF_ConstructionSite, EntryPoint) == 0x000000, "Member 'BP_GDF_ConstructionSite_C_ExecuteUbergraph_BP_GDF_ConstructionSite::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_GDF_ConstructionSite_C_ExecuteUbergraph_BP_GDF_ConstructionSite, CallFunc_CanBeSpawned_Result) == 0x000004, "Member 'BP_GDF_ConstructionSite_C_ExecuteUbergraph_BP_GDF_ConstructionSite::CallFunc_CanBeSpawned_Result' has a wrong offset!");
static_assert(offsetof(BP_GDF_ConstructionSite_C_ExecuteUbergraph_BP_GDF_ConstructionSite, CallFunc_IsDedicatedServer_ReturnValue) == 0x000005, "Member 'BP_GDF_ConstructionSite_C_ExecuteUbergraph_BP_GDF_ConstructionSite::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GDF_ConstructionSite_C_ExecuteUbergraph_BP_GDF_ConstructionSite, K2Node_MakeArray_Array) == 0x000008, "Member 'BP_GDF_ConstructionSite_C_ExecuteUbergraph_BP_GDF_ConstructionSite::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_GDF_ConstructionSite_C_ExecuteUbergraph_BP_GDF_ConstructionSite, CallFunc_GetStructureGridSize_ReturnValue) == 0x000018, "Member 'BP_GDF_ConstructionSite_C_ExecuteUbergraph_BP_GDF_ConstructionSite::CallFunc_GetStructureGridSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GDF_ConstructionSite_C_ExecuteUbergraph_BP_GDF_ConstructionSite, CallFunc_Add_VectorVector_ReturnValue) == 0x000020, "Member 'BP_GDF_ConstructionSite_C_ExecuteUbergraph_BP_GDF_ConstructionSite::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GDF_ConstructionSite_C_ExecuteUbergraph_BP_GDF_ConstructionSite, CallFunc_Conv_IntPointToVector2D_ReturnValue) == 0x000038, "Member 'BP_GDF_ConstructionSite_C_ExecuteUbergraph_BP_GDF_ConstructionSite::CallFunc_Conv_IntPointToVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GDF_ConstructionSite_C_ExecuteUbergraph_BP_GDF_ConstructionSite, CallFunc_Add_VectorVector_ReturnValue_1) == 0x000048, "Member 'BP_GDF_ConstructionSite_C_ExecuteUbergraph_BP_GDF_ConstructionSite::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GDF_ConstructionSite_C_ExecuteUbergraph_BP_GDF_ConstructionSite, CallFunc_Conv_Vector2DToVector_ReturnValue) == 0x000060, "Member 'BP_GDF_ConstructionSite_C_ExecuteUbergraph_BP_GDF_ConstructionSite::CallFunc_Conv_Vector2DToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GDF_ConstructionSite_C_ExecuteUbergraph_BP_GDF_ConstructionSite, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000078, "Member 'BP_GDF_ConstructionSite_C_ExecuteUbergraph_BP_GDF_ConstructionSite::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GDF_ConstructionSite_C_ExecuteUbergraph_BP_GDF_ConstructionSite, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000090, "Member 'BP_GDF_ConstructionSite_C_ExecuteUbergraph_BP_GDF_ConstructionSite::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GDF_ConstructionSite_C_ExecuteUbergraph_BP_GDF_ConstructionSite, CallFunc_K2_SetWorldRotation_SweepHitResult) == 0x0000A8, "Member 'BP_GDF_ConstructionSite_C_ExecuteUbergraph_BP_GDF_ConstructionSite::CallFunc_K2_SetWorldRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_GDF_ConstructionSite_C_ExecuteUbergraph_BP_GDF_ConstructionSite, Temp_object_Variable) == 0x0001A0, "Member 'BP_GDF_ConstructionSite_C_ExecuteUbergraph_BP_GDF_ConstructionSite::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_GDF_ConstructionSite_C_ExecuteUbergraph_BP_GDF_ConstructionSite, CallFunc_LineTraceSingleForObjects_OutHit) == 0x0001B0, "Member 'BP_GDF_ConstructionSite_C_ExecuteUbergraph_BP_GDF_ConstructionSite::CallFunc_LineTraceSingleForObjects_OutHit' has a wrong offset!");
static_assert(offsetof(BP_GDF_ConstructionSite_C_ExecuteUbergraph_BP_GDF_ConstructionSite, CallFunc_LineTraceSingleForObjects_ReturnValue) == 0x0002A8, "Member 'BP_GDF_ConstructionSite_C_ExecuteUbergraph_BP_GDF_ConstructionSite::CallFunc_LineTraceSingleForObjects_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GDF_ConstructionSite_C_ExecuteUbergraph_BP_GDF_ConstructionSite, CallFunc_GetSurfaceType_ReturnValue) == 0x0002A9, "Member 'BP_GDF_ConstructionSite_C_ExecuteUbergraph_BP_GDF_ConstructionSite::CallFunc_GetSurfaceType_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GDF_ConstructionSite_C_ExecuteUbergraph_BP_GDF_ConstructionSite, CallFunc_Conv_ByteToInt_ReturnValue) == 0x0002AC, "Member 'BP_GDF_ConstructionSite_C_ExecuteUbergraph_BP_GDF_ConstructionSite::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");

}

