#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GDF_Vehicle_MediumTank

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_Vehicle_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_GDF_Vehicle_MediumTank.BP_GDF_Vehicle_MediumTank_C
// 0x0050 (0x1D20 - 0x1CD0)
class ABP_GDF_Vehicle_MediumTank_C final : public ABP_Vehicle_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_GDF_Vehicle_MediumTank_C;        // 0x1CD0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UParticleSystemComponent*               PS_OverheatingSmoke;                               // 0x1CD8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               PS_SmokeVehicleDamagedMedium;                      // 0x1CE0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               PS_SmokeVehicleDamagedLight;                       // 0x1CE8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               PS_SmokeVehicleDamagedHeavy;                       // 0x1CF0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          HitBox_2;                                          // 0x1CF8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               PS_TracksMark_All;                                 // 0x1D00(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    FrontLight_2;                                      // 0x1D08(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    FrontLight_1;                                      // 0x1D10(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_Exhaust;                                        // 0x1D18(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_GDF_Vehicle_MediumTank(int32 EntryPoint);
	void ReceiveBeginMovement();
	void ReceiveEndMovement();
	void ReceiveOnDeath();
	void ReceiveTickMovement(float Speed, float MaxSpeed);
	void ReceiveUpdateHealthEffects(float HealthPct);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_GDF_Vehicle_MediumTank_C">();
	}
	static class ABP_GDF_Vehicle_MediumTank_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_GDF_Vehicle_MediumTank_C>();
	}
};
static_assert(alignof(ABP_GDF_Vehicle_MediumTank_C) == 0x000010, "Wrong alignment on ABP_GDF_Vehicle_MediumTank_C");
static_assert(sizeof(ABP_GDF_Vehicle_MediumTank_C) == 0x001D20, "Wrong size on ABP_GDF_Vehicle_MediumTank_C");
static_assert(offsetof(ABP_GDF_Vehicle_MediumTank_C, UberGraphFrame_BP_GDF_Vehicle_MediumTank_C) == 0x001CD0, "Member 'ABP_GDF_Vehicle_MediumTank_C::UberGraphFrame_BP_GDF_Vehicle_MediumTank_C' has a wrong offset!");
static_assert(offsetof(ABP_GDF_Vehicle_MediumTank_C, PS_OverheatingSmoke) == 0x001CD8, "Member 'ABP_GDF_Vehicle_MediumTank_C::PS_OverheatingSmoke' has a wrong offset!");
static_assert(offsetof(ABP_GDF_Vehicle_MediumTank_C, PS_SmokeVehicleDamagedMedium) == 0x001CE0, "Member 'ABP_GDF_Vehicle_MediumTank_C::PS_SmokeVehicleDamagedMedium' has a wrong offset!");
static_assert(offsetof(ABP_GDF_Vehicle_MediumTank_C, PS_SmokeVehicleDamagedLight) == 0x001CE8, "Member 'ABP_GDF_Vehicle_MediumTank_C::PS_SmokeVehicleDamagedLight' has a wrong offset!");
static_assert(offsetof(ABP_GDF_Vehicle_MediumTank_C, PS_SmokeVehicleDamagedHeavy) == 0x001CF0, "Member 'ABP_GDF_Vehicle_MediumTank_C::PS_SmokeVehicleDamagedHeavy' has a wrong offset!");
static_assert(offsetof(ABP_GDF_Vehicle_MediumTank_C, HitBox_2) == 0x001CF8, "Member 'ABP_GDF_Vehicle_MediumTank_C::HitBox_2' has a wrong offset!");
static_assert(offsetof(ABP_GDF_Vehicle_MediumTank_C, PS_TracksMark_All) == 0x001D00, "Member 'ABP_GDF_Vehicle_MediumTank_C::PS_TracksMark_All' has a wrong offset!");
static_assert(offsetof(ABP_GDF_Vehicle_MediumTank_C, FrontLight_2) == 0x001D08, "Member 'ABP_GDF_Vehicle_MediumTank_C::FrontLight_2' has a wrong offset!");
static_assert(offsetof(ABP_GDF_Vehicle_MediumTank_C, FrontLight_1) == 0x001D10, "Member 'ABP_GDF_Vehicle_MediumTank_C::FrontLight_1' has a wrong offset!");
static_assert(offsetof(ABP_GDF_Vehicle_MediumTank_C, NS_Exhaust) == 0x001D18, "Member 'ABP_GDF_Vehicle_MediumTank_C::NS_Exhaust' has a wrong offset!");

}

