#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GDF_Infantry_Sniper

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_GDF_Infantry_Sniper.BP_GDF_Infantry_Sniper_C.ExecuteUbergraph_BP_GDF_Infantry_Sniper
// 0x00A0 (0x00A0 - 0x0000)
struct BP_GDF_Infantry_Sniper_C_ExecuteUbergraph_BP_GDF_Infantry_Sniper final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCrawling_ReturnValue;                   // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0018(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B[0x1];                                       // 0x002B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           CallFunc_MakeLiteralGameplayTag_ReturnValue;       // 0x002C(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityAsync_WaitGameplayTagAdded*     CallFunc_WaitGameplayTagAddToActor_ReturnValue;    // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           CallFunc_MakeLiteralGameplayTag_ReturnValue_1;     // 0x005C(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0068(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityAsync_WaitGameplayTagRemoved*   CallFunc_WaitGameplayTagRemoveFromActor_ReturnValue; // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_1;          // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8A[0x6];                                       // 0x008A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UActorComponent*                        K2Node_Select_Default;                             // 0x0090(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UActorComponent*                        K2Node_Select_Default_1;                           // 0x0098(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GDF_Infantry_Sniper_C_ExecuteUbergraph_BP_GDF_Infantry_Sniper) == 0x000008, "Wrong alignment on BP_GDF_Infantry_Sniper_C_ExecuteUbergraph_BP_GDF_Infantry_Sniper");
static_assert(sizeof(BP_GDF_Infantry_Sniper_C_ExecuteUbergraph_BP_GDF_Infantry_Sniper) == 0x0000A0, "Wrong size on BP_GDF_Infantry_Sniper_C_ExecuteUbergraph_BP_GDF_Infantry_Sniper");
static_assert(offsetof(BP_GDF_Infantry_Sniper_C_ExecuteUbergraph_BP_GDF_Infantry_Sniper, EntryPoint) == 0x000000, "Member 'BP_GDF_Infantry_Sniper_C_ExecuteUbergraph_BP_GDF_Infantry_Sniper::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_GDF_Infantry_Sniper_C_ExecuteUbergraph_BP_GDF_Infantry_Sniper, CallFunc_IsCrawling_ReturnValue) == 0x000004, "Member 'BP_GDF_Infantry_Sniper_C_ExecuteUbergraph_BP_GDF_Infantry_Sniper::CallFunc_IsCrawling_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GDF_Infantry_Sniper_C_ExecuteUbergraph_BP_GDF_Infantry_Sniper, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'BP_GDF_Infantry_Sniper_C_ExecuteUbergraph_BP_GDF_Infantry_Sniper::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_GDF_Infantry_Sniper_C_ExecuteUbergraph_BP_GDF_Infantry_Sniper, K2Node_CreateDelegate_OutputDelegate_1) == 0x000018, "Member 'BP_GDF_Infantry_Sniper_C_ExecuteUbergraph_BP_GDF_Infantry_Sniper::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_GDF_Infantry_Sniper_C_ExecuteUbergraph_BP_GDF_Infantry_Sniper, Temp_bool_Variable) == 0x000028, "Member 'BP_GDF_Infantry_Sniper_C_ExecuteUbergraph_BP_GDF_Infantry_Sniper::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_GDF_Infantry_Sniper_C_ExecuteUbergraph_BP_GDF_Infantry_Sniper, Temp_bool_Variable_1) == 0x000029, "Member 'BP_GDF_Infantry_Sniper_C_ExecuteUbergraph_BP_GDF_Infantry_Sniper::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_GDF_Infantry_Sniper_C_ExecuteUbergraph_BP_GDF_Infantry_Sniper, CallFunc_IsDedicatedServer_ReturnValue) == 0x00002A, "Member 'BP_GDF_Infantry_Sniper_C_ExecuteUbergraph_BP_GDF_Infantry_Sniper::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GDF_Infantry_Sniper_C_ExecuteUbergraph_BP_GDF_Infantry_Sniper, CallFunc_MakeLiteralGameplayTag_ReturnValue) == 0x00002C, "Member 'BP_GDF_Infantry_Sniper_C_ExecuteUbergraph_BP_GDF_Infantry_Sniper::CallFunc_MakeLiteralGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GDF_Infantry_Sniper_C_ExecuteUbergraph_BP_GDF_Infantry_Sniper, CallFunc_WaitGameplayTagAddToActor_ReturnValue) == 0x000038, "Member 'BP_GDF_Infantry_Sniper_C_ExecuteUbergraph_BP_GDF_Infantry_Sniper::CallFunc_WaitGameplayTagAddToActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GDF_Infantry_Sniper_C_ExecuteUbergraph_BP_GDF_Infantry_Sniper, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000040, "Member 'BP_GDF_Infantry_Sniper_C_ExecuteUbergraph_BP_GDF_Infantry_Sniper::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GDF_Infantry_Sniper_C_ExecuteUbergraph_BP_GDF_Infantry_Sniper, CallFunc_IsValid_ReturnValue) == 0x000058, "Member 'BP_GDF_Infantry_Sniper_C_ExecuteUbergraph_BP_GDF_Infantry_Sniper::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GDF_Infantry_Sniper_C_ExecuteUbergraph_BP_GDF_Infantry_Sniper, CallFunc_MakeLiteralGameplayTag_ReturnValue_1) == 0x00005C, "Member 'BP_GDF_Infantry_Sniper_C_ExecuteUbergraph_BP_GDF_Infantry_Sniper::CallFunc_MakeLiteralGameplayTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GDF_Infantry_Sniper_C_ExecuteUbergraph_BP_GDF_Infantry_Sniper, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000068, "Member 'BP_GDF_Infantry_Sniper_C_ExecuteUbergraph_BP_GDF_Infantry_Sniper::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GDF_Infantry_Sniper_C_ExecuteUbergraph_BP_GDF_Infantry_Sniper, CallFunc_WaitGameplayTagRemoveFromActor_ReturnValue) == 0x000080, "Member 'BP_GDF_Infantry_Sniper_C_ExecuteUbergraph_BP_GDF_Infantry_Sniper::CallFunc_WaitGameplayTagRemoveFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GDF_Infantry_Sniper_C_ExecuteUbergraph_BP_GDF_Infantry_Sniper, CallFunc_IsValid_ReturnValue_1) == 0x000088, "Member 'BP_GDF_Infantry_Sniper_C_ExecuteUbergraph_BP_GDF_Infantry_Sniper::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GDF_Infantry_Sniper_C_ExecuteUbergraph_BP_GDF_Infantry_Sniper, CallFunc_IsDedicatedServer_ReturnValue_1) == 0x000089, "Member 'BP_GDF_Infantry_Sniper_C_ExecuteUbergraph_BP_GDF_Infantry_Sniper::CallFunc_IsDedicatedServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GDF_Infantry_Sniper_C_ExecuteUbergraph_BP_GDF_Infantry_Sniper, K2Node_Select_Default) == 0x000090, "Member 'BP_GDF_Infantry_Sniper_C_ExecuteUbergraph_BP_GDF_Infantry_Sniper::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_GDF_Infantry_Sniper_C_ExecuteUbergraph_BP_GDF_Infantry_Sniper, K2Node_Select_Default_1) == 0x000098, "Member 'BP_GDF_Infantry_Sniper_C_ExecuteUbergraph_BP_GDF_Infantry_Sniper::K2Node_Select_Default_1' has a wrong offset!");

}

