#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GDF_ConstructionSite

#include "Basic.hpp"

#include "PhysicsCore_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Tempest_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_GDF_ConstructionSite.BP_GDF_ConstructionSite_C
// 0x0030 (0x1CC0 - 0x1C90)
class ABP_GDF_ConstructionSite_C final : public ATedConstructionSite
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1C90(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      PS_DustStructurePlacement_01_ParamSize;            // 0x1C98(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CachedActorLocation;                               // 0x1CA0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void CanBeSpawned(const struct FVector& Location, bool* Result);
	void ExecuteUbergraph_BP_GDF_ConstructionSite(int32 EntryPoint);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_GDF_ConstructionSite_C">();
	}
	static class ABP_GDF_ConstructionSite_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_GDF_ConstructionSite_C>();
	}
};
static_assert(alignof(ABP_GDF_ConstructionSite_C) == 0x000010, "Wrong alignment on ABP_GDF_ConstructionSite_C");
static_assert(sizeof(ABP_GDF_ConstructionSite_C) == 0x001CC0, "Wrong size on ABP_GDF_ConstructionSite_C");
static_assert(offsetof(ABP_GDF_ConstructionSite_C, UberGraphFrame) == 0x001C90, "Member 'ABP_GDF_ConstructionSite_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_GDF_ConstructionSite_C, PS_DustStructurePlacement_01_ParamSize) == 0x001C98, "Member 'ABP_GDF_ConstructionSite_C::PS_DustStructurePlacement_01_ParamSize' has a wrong offset!");
static_assert(offsetof(ABP_GDF_ConstructionSite_C, CachedActorLocation) == 0x001CA0, "Member 'ABP_GDF_ConstructionSite_C::CachedActorLocation' has a wrong offset!");

}

