#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GDF_Vehicle_Peacekeeper

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_GDF_Vehicle_Peacekeeper.BP_GDF_Vehicle_Peacekeeper_C.ExecuteUbergraph_BP_GDF_Vehicle_Peacekeeper
// 0x0128 (0x0128 - 0x0000)
struct BP_GDF_Vehicle_Peacekeeper_C_ExecuteUbergraph_BP_GDF_Vehicle_Peacekeeper final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_1;          // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_HealthPct;                            // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue_1;          // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue_2;          // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_2;          // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 CallFunc_MakeGameplayCueParameters_ReturnValue;    // 0x0038(0x00D8)(ContainsInstancedReference)
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast;         // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast_1;       // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast_2;       // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GDF_Vehicle_Peacekeeper_C_ExecuteUbergraph_BP_GDF_Vehicle_Peacekeeper) == 0x000008, "Wrong alignment on BP_GDF_Vehicle_Peacekeeper_C_ExecuteUbergraph_BP_GDF_Vehicle_Peacekeeper");
static_assert(sizeof(BP_GDF_Vehicle_Peacekeeper_C_ExecuteUbergraph_BP_GDF_Vehicle_Peacekeeper) == 0x000128, "Wrong size on BP_GDF_Vehicle_Peacekeeper_C_ExecuteUbergraph_BP_GDF_Vehicle_Peacekeeper");
static_assert(offsetof(BP_GDF_Vehicle_Peacekeeper_C_ExecuteUbergraph_BP_GDF_Vehicle_Peacekeeper, EntryPoint) == 0x000000, "Member 'BP_GDF_Vehicle_Peacekeeper_C_ExecuteUbergraph_BP_GDF_Vehicle_Peacekeeper::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_GDF_Vehicle_Peacekeeper_C_ExecuteUbergraph_BP_GDF_Vehicle_Peacekeeper, CallFunc_IsDedicatedServer_ReturnValue) == 0x000004, "Member 'BP_GDF_Vehicle_Peacekeeper_C_ExecuteUbergraph_BP_GDF_Vehicle_Peacekeeper::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GDF_Vehicle_Peacekeeper_C_ExecuteUbergraph_BP_GDF_Vehicle_Peacekeeper, CallFunc_IsDedicatedServer_ReturnValue_1) == 0x000005, "Member 'BP_GDF_Vehicle_Peacekeeper_C_ExecuteUbergraph_BP_GDF_Vehicle_Peacekeeper::CallFunc_IsDedicatedServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GDF_Vehicle_Peacekeeper_C_ExecuteUbergraph_BP_GDF_Vehicle_Peacekeeper, K2Node_Event_HealthPct) == 0x000008, "Member 'BP_GDF_Vehicle_Peacekeeper_C_ExecuteUbergraph_BP_GDF_Vehicle_Peacekeeper::K2Node_Event_HealthPct' has a wrong offset!");
static_assert(offsetof(BP_GDF_Vehicle_Peacekeeper_C_ExecuteUbergraph_BP_GDF_Vehicle_Peacekeeper, CallFunc_Less_DoubleDouble_ReturnValue) == 0x00000C, "Member 'BP_GDF_Vehicle_Peacekeeper_C_ExecuteUbergraph_BP_GDF_Vehicle_Peacekeeper::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GDF_Vehicle_Peacekeeper_C_ExecuteUbergraph_BP_GDF_Vehicle_Peacekeeper, CallFunc_Less_DoubleDouble_ReturnValue_1) == 0x00000D, "Member 'BP_GDF_Vehicle_Peacekeeper_C_ExecuteUbergraph_BP_GDF_Vehicle_Peacekeeper::CallFunc_Less_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GDF_Vehicle_Peacekeeper_C_ExecuteUbergraph_BP_GDF_Vehicle_Peacekeeper, CallFunc_Less_DoubleDouble_ReturnValue_2) == 0x00000E, "Member 'BP_GDF_Vehicle_Peacekeeper_C_ExecuteUbergraph_BP_GDF_Vehicle_Peacekeeper::CallFunc_Less_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_GDF_Vehicle_Peacekeeper_C_ExecuteUbergraph_BP_GDF_Vehicle_Peacekeeper, CallFunc_Not_PreBool_ReturnValue) == 0x00000F, "Member 'BP_GDF_Vehicle_Peacekeeper_C_ExecuteUbergraph_BP_GDF_Vehicle_Peacekeeper::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GDF_Vehicle_Peacekeeper_C_ExecuteUbergraph_BP_GDF_Vehicle_Peacekeeper, CallFunc_Not_PreBool_ReturnValue_1) == 0x000010, "Member 'BP_GDF_Vehicle_Peacekeeper_C_ExecuteUbergraph_BP_GDF_Vehicle_Peacekeeper::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GDF_Vehicle_Peacekeeper_C_ExecuteUbergraph_BP_GDF_Vehicle_Peacekeeper, CallFunc_BooleanAND_ReturnValue) == 0x000011, "Member 'BP_GDF_Vehicle_Peacekeeper_C_ExecuteUbergraph_BP_GDF_Vehicle_Peacekeeper::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GDF_Vehicle_Peacekeeper_C_ExecuteUbergraph_BP_GDF_Vehicle_Peacekeeper, CallFunc_BooleanAND_ReturnValue_1) == 0x000012, "Member 'BP_GDF_Vehicle_Peacekeeper_C_ExecuteUbergraph_BP_GDF_Vehicle_Peacekeeper::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GDF_Vehicle_Peacekeeper_C_ExecuteUbergraph_BP_GDF_Vehicle_Peacekeeper, CallFunc_IsDedicatedServer_ReturnValue_2) == 0x000013, "Member 'BP_GDF_Vehicle_Peacekeeper_C_ExecuteUbergraph_BP_GDF_Vehicle_Peacekeeper::CallFunc_IsDedicatedServer_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_GDF_Vehicle_Peacekeeper_C_ExecuteUbergraph_BP_GDF_Vehicle_Peacekeeper, CallFunc_GetSocketLocation_ReturnValue) == 0x000018, "Member 'BP_GDF_Vehicle_Peacekeeper_C_ExecuteUbergraph_BP_GDF_Vehicle_Peacekeeper::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GDF_Vehicle_Peacekeeper_C_ExecuteUbergraph_BP_GDF_Vehicle_Peacekeeper, CallFunc_HasAuthority_ReturnValue) == 0x000030, "Member 'BP_GDF_Vehicle_Peacekeeper_C_ExecuteUbergraph_BP_GDF_Vehicle_Peacekeeper::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GDF_Vehicle_Peacekeeper_C_ExecuteUbergraph_BP_GDF_Vehicle_Peacekeeper, CallFunc_MakeGameplayCueParameters_ReturnValue) == 0x000038, "Member 'BP_GDF_Vehicle_Peacekeeper_C_ExecuteUbergraph_BP_GDF_Vehicle_Peacekeeper::CallFunc_MakeGameplayCueParameters_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GDF_Vehicle_Peacekeeper_C_ExecuteUbergraph_BP_GDF_Vehicle_Peacekeeper, CallFunc_Less_DoubleDouble_A_ImplicitCast) == 0x000110, "Member 'BP_GDF_Vehicle_Peacekeeper_C_ExecuteUbergraph_BP_GDF_Vehicle_Peacekeeper::CallFunc_Less_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_GDF_Vehicle_Peacekeeper_C_ExecuteUbergraph_BP_GDF_Vehicle_Peacekeeper, CallFunc_Less_DoubleDouble_A_ImplicitCast_1) == 0x000118, "Member 'BP_GDF_Vehicle_Peacekeeper_C_ExecuteUbergraph_BP_GDF_Vehicle_Peacekeeper::CallFunc_Less_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_GDF_Vehicle_Peacekeeper_C_ExecuteUbergraph_BP_GDF_Vehicle_Peacekeeper, CallFunc_Less_DoubleDouble_A_ImplicitCast_2) == 0x000120, "Member 'BP_GDF_Vehicle_Peacekeeper_C_ExecuteUbergraph_BP_GDF_Vehicle_Peacekeeper::CallFunc_Less_DoubleDouble_A_ImplicitCast_2' has a wrong offset!");

// Function BP_GDF_Vehicle_Peacekeeper.BP_GDF_Vehicle_Peacekeeper_C.ReceiveUpdateHealthEffects
// 0x0004 (0x0004 - 0x0000)
struct BP_GDF_Vehicle_Peacekeeper_C_ReceiveUpdateHealthEffects final
{
public:
	float                                         HealthPct;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GDF_Vehicle_Peacekeeper_C_ReceiveUpdateHealthEffects) == 0x000004, "Wrong alignment on BP_GDF_Vehicle_Peacekeeper_C_ReceiveUpdateHealthEffects");
static_assert(sizeof(BP_GDF_Vehicle_Peacekeeper_C_ReceiveUpdateHealthEffects) == 0x000004, "Wrong size on BP_GDF_Vehicle_Peacekeeper_C_ReceiveUpdateHealthEffects");
static_assert(offsetof(BP_GDF_Vehicle_Peacekeeper_C_ReceiveUpdateHealthEffects, HealthPct) == 0x000000, "Member 'BP_GDF_Vehicle_Peacekeeper_C_ReceiveUpdateHealthEffects::HealthPct' has a wrong offset!");

}

