#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GECAR_CanProduceUnitsOrHasWeapon

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function BP_GECAR_CanProduceUnitsOrHasWeapon.BP_GECAR_CanProduceUnitsOrHasWeapon_C.CanApplyGameplayEffect
// 0x02E0 (0x02E0 - 0x0000)
struct BP_GECAR_CanProduceUnitsOrHasWeapon_C_CanApplyGameplayEffect final
{
public:
	const class UGameplayEffect*                  GameplayEffect;                                    // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectSpec                    Spec;                                              // 0x0008(0x0298)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UAbilitySystemComponent*                ASC;                                               // 0x02A0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x02A8(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A9[0x7];                                      // 0x02A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x02B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ATedStructureBase*                      K2Node_DynamicCast_AsTed_Structure_Base;           // 0x02B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyWeapon_ReturnValue;                 // 0x02C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C2[0x6];                                      // 0x02C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	const class UTedStructureDefinitionAsset*     CallFunc_GetDefinitionAsset_ReturnValue;           // 0x02C8(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x02D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D1[0x3];                                      // 0x02D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetNumGameplayTagsInContainer_ReturnValue; // 0x02D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GECAR_CanProduceUnitsOrHasWeapon_C_CanApplyGameplayEffect) == 0x000008, "Wrong alignment on BP_GECAR_CanProduceUnitsOrHasWeapon_C_CanApplyGameplayEffect");
static_assert(sizeof(BP_GECAR_CanProduceUnitsOrHasWeapon_C_CanApplyGameplayEffect) == 0x0002E0, "Wrong size on BP_GECAR_CanProduceUnitsOrHasWeapon_C_CanApplyGameplayEffect");
static_assert(offsetof(BP_GECAR_CanProduceUnitsOrHasWeapon_C_CanApplyGameplayEffect, GameplayEffect) == 0x000000, "Member 'BP_GECAR_CanProduceUnitsOrHasWeapon_C_CanApplyGameplayEffect::GameplayEffect' has a wrong offset!");
static_assert(offsetof(BP_GECAR_CanProduceUnitsOrHasWeapon_C_CanApplyGameplayEffect, Spec) == 0x000008, "Member 'BP_GECAR_CanProduceUnitsOrHasWeapon_C_CanApplyGameplayEffect::Spec' has a wrong offset!");
static_assert(offsetof(BP_GECAR_CanProduceUnitsOrHasWeapon_C_CanApplyGameplayEffect, ASC) == 0x0002A0, "Member 'BP_GECAR_CanProduceUnitsOrHasWeapon_C_CanApplyGameplayEffect::ASC' has a wrong offset!");
static_assert(offsetof(BP_GECAR_CanProduceUnitsOrHasWeapon_C_CanApplyGameplayEffect, ReturnValue) == 0x0002A8, "Member 'BP_GECAR_CanProduceUnitsOrHasWeapon_C_CanApplyGameplayEffect::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GECAR_CanProduceUnitsOrHasWeapon_C_CanApplyGameplayEffect, CallFunc_GetOwner_ReturnValue) == 0x0002B0, "Member 'BP_GECAR_CanProduceUnitsOrHasWeapon_C_CanApplyGameplayEffect::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GECAR_CanProduceUnitsOrHasWeapon_C_CanApplyGameplayEffect, K2Node_DynamicCast_AsTed_Structure_Base) == 0x0002B8, "Member 'BP_GECAR_CanProduceUnitsOrHasWeapon_C_CanApplyGameplayEffect::K2Node_DynamicCast_AsTed_Structure_Base' has a wrong offset!");
static_assert(offsetof(BP_GECAR_CanProduceUnitsOrHasWeapon_C_CanApplyGameplayEffect, K2Node_DynamicCast_bSuccess) == 0x0002C0, "Member 'BP_GECAR_CanProduceUnitsOrHasWeapon_C_CanApplyGameplayEffect::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_GECAR_CanProduceUnitsOrHasWeapon_C_CanApplyGameplayEffect, CallFunc_HasAnyWeapon_ReturnValue) == 0x0002C1, "Member 'BP_GECAR_CanProduceUnitsOrHasWeapon_C_CanApplyGameplayEffect::CallFunc_HasAnyWeapon_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GECAR_CanProduceUnitsOrHasWeapon_C_CanApplyGameplayEffect, CallFunc_GetDefinitionAsset_ReturnValue) == 0x0002C8, "Member 'BP_GECAR_CanProduceUnitsOrHasWeapon_C_CanApplyGameplayEffect::CallFunc_GetDefinitionAsset_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GECAR_CanProduceUnitsOrHasWeapon_C_CanApplyGameplayEffect, CallFunc_IsValid_ReturnValue) == 0x0002D0, "Member 'BP_GECAR_CanProduceUnitsOrHasWeapon_C_CanApplyGameplayEffect::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GECAR_CanProduceUnitsOrHasWeapon_C_CanApplyGameplayEffect, CallFunc_GetNumGameplayTagsInContainer_ReturnValue) == 0x0002D4, "Member 'BP_GECAR_CanProduceUnitsOrHasWeapon_C_CanApplyGameplayEffect::CallFunc_GetNumGameplayTagsInContainer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GECAR_CanProduceUnitsOrHasWeapon_C_CanApplyGameplayEffect, CallFunc_Greater_IntInt_ReturnValue) == 0x0002D8, "Member 'BP_GECAR_CanProduceUnitsOrHasWeapon_C_CanApplyGameplayEffect::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

}

