#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GDF_Infantry_DroneOperator

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_GDF_Infantry_DroneOperator.BP_GDF_Infantry_DroneOperator_C.ExecuteUbergraph_BP_GDF_Infantry_DroneOperator
// 0x000C (0x000C - 0x0000)
struct BP_GDF_Infantry_DroneOperator_C_ExecuteUbergraph_BP_GDF_Infantry_DroneOperator final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsSelected;                          // 0x0004(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsHovered;                           // 0x0005(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetShouldDisplayPreviewRange_ReturnValue; // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GDF_Infantry_DroneOperator_C_ExecuteUbergraph_BP_GDF_Infantry_DroneOperator) == 0x000004, "Wrong alignment on BP_GDF_Infantry_DroneOperator_C_ExecuteUbergraph_BP_GDF_Infantry_DroneOperator");
static_assert(sizeof(BP_GDF_Infantry_DroneOperator_C_ExecuteUbergraph_BP_GDF_Infantry_DroneOperator) == 0x00000C, "Wrong size on BP_GDF_Infantry_DroneOperator_C_ExecuteUbergraph_BP_GDF_Infantry_DroneOperator");
static_assert(offsetof(BP_GDF_Infantry_DroneOperator_C_ExecuteUbergraph_BP_GDF_Infantry_DroneOperator, EntryPoint) == 0x000000, "Member 'BP_GDF_Infantry_DroneOperator_C_ExecuteUbergraph_BP_GDF_Infantry_DroneOperator::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_GDF_Infantry_DroneOperator_C_ExecuteUbergraph_BP_GDF_Infantry_DroneOperator, K2Node_Event_bIsSelected) == 0x000004, "Member 'BP_GDF_Infantry_DroneOperator_C_ExecuteUbergraph_BP_GDF_Infantry_DroneOperator::K2Node_Event_bIsSelected' has a wrong offset!");
static_assert(offsetof(BP_GDF_Infantry_DroneOperator_C_ExecuteUbergraph_BP_GDF_Infantry_DroneOperator, K2Node_Event_bIsHovered) == 0x000005, "Member 'BP_GDF_Infantry_DroneOperator_C_ExecuteUbergraph_BP_GDF_Infantry_DroneOperator::K2Node_Event_bIsHovered' has a wrong offset!");
static_assert(offsetof(BP_GDF_Infantry_DroneOperator_C_ExecuteUbergraph_BP_GDF_Infantry_DroneOperator, CallFunc_BooleanOR_ReturnValue) == 0x000006, "Member 'BP_GDF_Infantry_DroneOperator_C_ExecuteUbergraph_BP_GDF_Infantry_DroneOperator::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GDF_Infantry_DroneOperator_C_ExecuteUbergraph_BP_GDF_Infantry_DroneOperator, CallFunc_IsValid_ReturnValue) == 0x000007, "Member 'BP_GDF_Infantry_DroneOperator_C_ExecuteUbergraph_BP_GDF_Infantry_DroneOperator::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GDF_Infantry_DroneOperator_C_ExecuteUbergraph_BP_GDF_Infantry_DroneOperator, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000008, "Member 'BP_GDF_Infantry_DroneOperator_C_ExecuteUbergraph_BP_GDF_Infantry_DroneOperator::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GDF_Infantry_DroneOperator_C_ExecuteUbergraph_BP_GDF_Infantry_DroneOperator, CallFunc_GetShouldDisplayPreviewRange_ReturnValue) == 0x000009, "Member 'BP_GDF_Infantry_DroneOperator_C_ExecuteUbergraph_BP_GDF_Infantry_DroneOperator::CallFunc_GetShouldDisplayPreviewRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GDF_Infantry_DroneOperator_C_ExecuteUbergraph_BP_GDF_Infantry_DroneOperator, CallFunc_BooleanAND_ReturnValue) == 0x00000A, "Member 'BP_GDF_Infantry_DroneOperator_C_ExecuteUbergraph_BP_GDF_Infantry_DroneOperator::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GDF_Infantry_DroneOperator_C_ExecuteUbergraph_BP_GDF_Infantry_DroneOperator, CallFunc_BooleanAND_ReturnValue_1) == 0x00000B, "Member 'BP_GDF_Infantry_DroneOperator_C_ExecuteUbergraph_BP_GDF_Infantry_DroneOperator::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");

// Function BP_GDF_Infantry_DroneOperator.BP_GDF_Infantry_DroneOperator_C.OnSelectionChanged_Blueprint
// 0x0002 (0x0002 - 0x0000)
struct BP_GDF_Infantry_DroneOperator_C_OnSelectionChanged_Blueprint final
{
public:
	bool                                          bIsSelected;                                       // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsHovered;                                        // 0x0001(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GDF_Infantry_DroneOperator_C_OnSelectionChanged_Blueprint) == 0x000001, "Wrong alignment on BP_GDF_Infantry_DroneOperator_C_OnSelectionChanged_Blueprint");
static_assert(sizeof(BP_GDF_Infantry_DroneOperator_C_OnSelectionChanged_Blueprint) == 0x000002, "Wrong size on BP_GDF_Infantry_DroneOperator_C_OnSelectionChanged_Blueprint");
static_assert(offsetof(BP_GDF_Infantry_DroneOperator_C_OnSelectionChanged_Blueprint, bIsSelected) == 0x000000, "Member 'BP_GDF_Infantry_DroneOperator_C_OnSelectionChanged_Blueprint::bIsSelected' has a wrong offset!");
static_assert(offsetof(BP_GDF_Infantry_DroneOperator_C_OnSelectionChanged_Blueprint, bIsHovered) == 0x000001, "Member 'BP_GDF_Infantry_DroneOperator_C_OnSelectionChanged_Blueprint::bIsHovered' has a wrong offset!");

// Function BP_GDF_Infantry_DroneOperator.BP_GDF_Infantry_DroneOperator_C.UpdateRangeDecal
// 0x0010 (0x0010 - 0x0000)
struct BP_GDF_Infantry_DroneOperator_C_UpdateRangeDecal final
{
public:
	const class UTedUnitDefinitionAsset*          CallFunc_GetDefinitionAsset_ReturnValue;           // 0x0000(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_TryFindMaxAbilityRange_ReturnValue;       // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GDF_Infantry_DroneOperator_C_UpdateRangeDecal) == 0x000008, "Wrong alignment on BP_GDF_Infantry_DroneOperator_C_UpdateRangeDecal");
static_assert(sizeof(BP_GDF_Infantry_DroneOperator_C_UpdateRangeDecal) == 0x000010, "Wrong size on BP_GDF_Infantry_DroneOperator_C_UpdateRangeDecal");
static_assert(offsetof(BP_GDF_Infantry_DroneOperator_C_UpdateRangeDecal, CallFunc_GetDefinitionAsset_ReturnValue) == 0x000000, "Member 'BP_GDF_Infantry_DroneOperator_C_UpdateRangeDecal::CallFunc_GetDefinitionAsset_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GDF_Infantry_DroneOperator_C_UpdateRangeDecal, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'BP_GDF_Infantry_DroneOperator_C_UpdateRangeDecal::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GDF_Infantry_DroneOperator_C_UpdateRangeDecal, CallFunc_TryFindMaxAbilityRange_ReturnValue) == 0x00000C, "Member 'BP_GDF_Infantry_DroneOperator_C_UpdateRangeDecal::CallFunc_TryFindMaxAbilityRange_ReturnValue' has a wrong offset!");

}

