#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GDF_Infantry_Engineer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_Infantry_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_GDF_Infantry_Engineer.BP_GDF_Infantry_Engineer_C
// 0x0020 (0x1BE0 - 0x1BC0)
class ABP_GDF_Infantry_Engineer_C final : public ABP_Infantry_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1BC0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTedRangeDecalComponent*                DetectionDecal;                                    // 0x1BC8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          bCachedSelected;                                   // 0x1BD0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bCachedHovered;                                    // 0x1BD1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__BP_GDF_Infantry_CommsOfficer_DetectionDecal_K2Node_ComponentBoundEvent_1_RangeDecalDelegate__DelegateSignature();
	void BndEvt__BP_GDF_Infantry_Engineer_DetectionDecal_K2Node_ComponentBoundEvent_0_RangeDecalDelegate__DelegateSignature();
	void CheckRangeDecals();
	void ExecuteUbergraph_BP_GDF_Infantry_Engineer(int32 EntryPoint);
	void OnSelectionChanged_Blueprint(const bool bIsSelected, const bool bIsHovered);
	void UpdateDetectionRangeDecal();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_GDF_Infantry_Engineer_C">();
	}
	static class ABP_GDF_Infantry_Engineer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_GDF_Infantry_Engineer_C>();
	}
};
static_assert(alignof(ABP_GDF_Infantry_Engineer_C) == 0x000010, "Wrong alignment on ABP_GDF_Infantry_Engineer_C");
static_assert(sizeof(ABP_GDF_Infantry_Engineer_C) == 0x001BE0, "Wrong size on ABP_GDF_Infantry_Engineer_C");
static_assert(offsetof(ABP_GDF_Infantry_Engineer_C, UberGraphFrame) == 0x001BC0, "Member 'ABP_GDF_Infantry_Engineer_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_GDF_Infantry_Engineer_C, DetectionDecal) == 0x001BC8, "Member 'ABP_GDF_Infantry_Engineer_C::DetectionDecal' has a wrong offset!");
static_assert(offsetof(ABP_GDF_Infantry_Engineer_C, bCachedSelected) == 0x001BD0, "Member 'ABP_GDF_Infantry_Engineer_C::bCachedSelected' has a wrong offset!");
static_assert(offsetof(ABP_GDF_Infantry_Engineer_C, bCachedHovered) == 0x001BD1, "Member 'ABP_GDF_Infantry_Engineer_C::bCachedHovered' has a wrong offset!");

}

