#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ObjectiveCondition_ArmyGone

#include "Basic.hpp"

#include "Tempest_structs.hpp"


namespace SDK::Params
{

// Function BP_ObjectiveCondition_ArmyGone.BP_ObjectiveCondition_ArmyGone_C.ExecuteUbergraph_BP_ObjectiveCondition_ArmyGone
// 0x0050 (0x0050 - 0x0000)
struct BP_ObjectiveCondition_ArmyGone_C_ExecuteUbergraph_BP_ObjectiveCondition_ArmyGone final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTedPlayerData*                         CallFunc_GetByPlayerIndex_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UTedPlayerData* InPlayerData)> K2Node_CreateDelegate_OutputDelegate;        // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UTedPlayerData* InPlayerData)> K2Node_CreateDelegate_OutputDelegate_1;      // 0x0020(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTedPlayerData*                         K2Node_CustomEvent_InPlayerData_1;                 // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UTedPlayerData*                         CallFunc_GetByPlayerIndex_ReturnValue_1;           // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UTedPlayerData*                         K2Node_CustomEvent_InPlayerData;                   // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EObjectiveConditionState                      CallFunc_DetermineState_ReturnValue;               // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ObjectiveCondition_ArmyGone_C_ExecuteUbergraph_BP_ObjectiveCondition_ArmyGone) == 0x000008, "Wrong alignment on BP_ObjectiveCondition_ArmyGone_C_ExecuteUbergraph_BP_ObjectiveCondition_ArmyGone");
static_assert(sizeof(BP_ObjectiveCondition_ArmyGone_C_ExecuteUbergraph_BP_ObjectiveCondition_ArmyGone) == 0x000050, "Wrong size on BP_ObjectiveCondition_ArmyGone_C_ExecuteUbergraph_BP_ObjectiveCondition_ArmyGone");
static_assert(offsetof(BP_ObjectiveCondition_ArmyGone_C_ExecuteUbergraph_BP_ObjectiveCondition_ArmyGone, EntryPoint) == 0x000000, "Member 'BP_ObjectiveCondition_ArmyGone_C_ExecuteUbergraph_BP_ObjectiveCondition_ArmyGone::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ObjectiveCondition_ArmyGone_C_ExecuteUbergraph_BP_ObjectiveCondition_ArmyGone, CallFunc_GetByPlayerIndex_ReturnValue) == 0x000008, "Member 'BP_ObjectiveCondition_ArmyGone_C_ExecuteUbergraph_BP_ObjectiveCondition_ArmyGone::CallFunc_GetByPlayerIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ObjectiveCondition_ArmyGone_C_ExecuteUbergraph_BP_ObjectiveCondition_ArmyGone, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'BP_ObjectiveCondition_ArmyGone_C_ExecuteUbergraph_BP_ObjectiveCondition_ArmyGone::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_ObjectiveCondition_ArmyGone_C_ExecuteUbergraph_BP_ObjectiveCondition_ArmyGone, K2Node_CreateDelegate_OutputDelegate_1) == 0x000020, "Member 'BP_ObjectiveCondition_ArmyGone_C_ExecuteUbergraph_BP_ObjectiveCondition_ArmyGone::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_ObjectiveCondition_ArmyGone_C_ExecuteUbergraph_BP_ObjectiveCondition_ArmyGone, K2Node_CustomEvent_InPlayerData_1) == 0x000030, "Member 'BP_ObjectiveCondition_ArmyGone_C_ExecuteUbergraph_BP_ObjectiveCondition_ArmyGone::K2Node_CustomEvent_InPlayerData_1' has a wrong offset!");
static_assert(offsetof(BP_ObjectiveCondition_ArmyGone_C_ExecuteUbergraph_BP_ObjectiveCondition_ArmyGone, CallFunc_GetByPlayerIndex_ReturnValue_1) == 0x000038, "Member 'BP_ObjectiveCondition_ArmyGone_C_ExecuteUbergraph_BP_ObjectiveCondition_ArmyGone::CallFunc_GetByPlayerIndex_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ObjectiveCondition_ArmyGone_C_ExecuteUbergraph_BP_ObjectiveCondition_ArmyGone, K2Node_CustomEvent_InPlayerData) == 0x000040, "Member 'BP_ObjectiveCondition_ArmyGone_C_ExecuteUbergraph_BP_ObjectiveCondition_ArmyGone::K2Node_CustomEvent_InPlayerData' has a wrong offset!");
static_assert(offsetof(BP_ObjectiveCondition_ArmyGone_C_ExecuteUbergraph_BP_ObjectiveCondition_ArmyGone, CallFunc_DetermineState_ReturnValue) == 0x000048, "Member 'BP_ObjectiveCondition_ArmyGone_C_ExecuteUbergraph_BP_ObjectiveCondition_ArmyGone::CallFunc_DetermineState_ReturnValue' has a wrong offset!");

// Function BP_ObjectiveCondition_ArmyGone.BP_ObjectiveCondition_ArmyGone_C.OnStructuresChange_Event_0
// 0x0008 (0x0008 - 0x0000)
struct BP_ObjectiveCondition_ArmyGone_C_OnStructuresChange_Event_0 final
{
public:
	class UTedPlayerData*                         InPlayerData;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ObjectiveCondition_ArmyGone_C_OnStructuresChange_Event_0) == 0x000008, "Wrong alignment on BP_ObjectiveCondition_ArmyGone_C_OnStructuresChange_Event_0");
static_assert(sizeof(BP_ObjectiveCondition_ArmyGone_C_OnStructuresChange_Event_0) == 0x000008, "Wrong size on BP_ObjectiveCondition_ArmyGone_C_OnStructuresChange_Event_0");
static_assert(offsetof(BP_ObjectiveCondition_ArmyGone_C_OnStructuresChange_Event_0, InPlayerData) == 0x000000, "Member 'BP_ObjectiveCondition_ArmyGone_C_OnStructuresChange_Event_0::InPlayerData' has a wrong offset!");

// Function BP_ObjectiveCondition_ArmyGone.BP_ObjectiveCondition_ArmyGone_C.OnUnitsChange_Event_0
// 0x0008 (0x0008 - 0x0000)
struct BP_ObjectiveCondition_ArmyGone_C_OnUnitsChange_Event_0 final
{
public:
	class UTedPlayerData*                         InPlayerData;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ObjectiveCondition_ArmyGone_C_OnUnitsChange_Event_0) == 0x000008, "Wrong alignment on BP_ObjectiveCondition_ArmyGone_C_OnUnitsChange_Event_0");
static_assert(sizeof(BP_ObjectiveCondition_ArmyGone_C_OnUnitsChange_Event_0) == 0x000008, "Wrong size on BP_ObjectiveCondition_ArmyGone_C_OnUnitsChange_Event_0");
static_assert(offsetof(BP_ObjectiveCondition_ArmyGone_C_OnUnitsChange_Event_0, InPlayerData) == 0x000000, "Member 'BP_ObjectiveCondition_ArmyGone_C_OnUnitsChange_Event_0::InPlayerData' has a wrong offset!");

// Function BP_ObjectiveCondition_ArmyGone.BP_ObjectiveCondition_ArmyGone_C.DetermineState
// 0x00C8 (0x00C8 - 0x0000)
struct BP_ObjectiveCondition_ArmyGone_C_DetermineState final
{
public:
	EObjectiveConditionState                      ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Has_ProcessingCenter_;                             // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Has_combat_units_;                                 // 0x0002(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Has_Refinery_;                                     // 0x0003(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Has_Harvester_;                                    // 0x0004(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Has_Tempest_Rig_unit_;                             // 0x0005(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Has_Air_production_;                               // 0x0006(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Has_Vehicle_production_;                           // 0x0007(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Has_Unit_production_;                              // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Has_Construction_Yard_;                            // 0x0009(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23[0x1];                                       // 0x0023(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_3;                  // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_4;                  // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_5;                  // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTedPlayerData*                         CallFunc_GetByPlayerIndex_ReturnValue;             // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class ATedUnitBase*>                   CallFunc_GetOwnedUnits_OutUnits;                   // 0x0048(0x0010)(ReferenceParm)
	bool                                          CallFunc_GetOwnedUnits_ReturnValue;                // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetCredits_ReturnValue;                   // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATedUnitBase*                           CallFunc_Array_Get_Item;                           // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ObjectIsA_ReturnValue;                    // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ObjectIsA_ReturnValue_1;                  // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ObjectIsA_ReturnValue_2;                  // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_6;                  // 0x0073(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ObjectIsA_ReturnValue_3;                  // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_7;                  // 0x0075(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_76[0x2];                                       // 0x0076(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class ATedUnitBase*                           CallFunc_Array_Get_Item_1;                         // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ObjectIsA_ReturnValue_4;                  // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ObjectIsA_ReturnValue_5;                  // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ObjectIsA_ReturnValue_6;                  // 0x0082(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_83[0x1];                                       // 0x0083(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_8;                  // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_9;                  // 0x008A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8B[0x1];                                       // 0x008B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ATedStructureBase*>              CallFunc_GetOwnedStructures_OutStructures;         // 0x0090(0x0010)(ReferenceParm)
	bool                                          CallFunc_GetOwnedStructures_ReturnValue;           // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x00A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A3[0x5];                                       // 0x00A3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ATedStructureBase*                      CallFunc_Array_Get_Item_2;                         // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ObjectIsA_ReturnValue_7;                  // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ObjectIsA_ReturnValue_8;                  // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ObjectIsA_ReturnValue_9;                  // 0x00B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_10;                 // 0x00B3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ObjectIsA_ReturnValue_10;                 // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_11;                 // 0x00B5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ObjectIsA_ReturnValue_11;                 // 0x00B6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ObjectIsA_ReturnValue_12;                 // 0x00B7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ObjectIsA_ReturnValue_13;                 // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ObjectIsA_ReturnValue_14;                 // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_12;                 // 0x00BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ObjectIsA_ReturnValue_15;                 // 0x00BB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_13;                 // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_14;                 // 0x00BD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ObjectIsA_ReturnValue_16;                 // 0x00BE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ObjectIsA_ReturnValue_17;                 // 0x00BF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ObjectiveCondition_ArmyGone_C_DetermineState) == 0x000008, "Wrong alignment on BP_ObjectiveCondition_ArmyGone_C_DetermineState");
static_assert(sizeof(BP_ObjectiveCondition_ArmyGone_C_DetermineState) == 0x0000C8, "Wrong size on BP_ObjectiveCondition_ArmyGone_C_DetermineState");
static_assert(offsetof(BP_ObjectiveCondition_ArmyGone_C_DetermineState, ReturnValue) == 0x000000, "Member 'BP_ObjectiveCondition_ArmyGone_C_DetermineState::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ObjectiveCondition_ArmyGone_C_DetermineState, Has_ProcessingCenter_) == 0x000001, "Member 'BP_ObjectiveCondition_ArmyGone_C_DetermineState::Has_ProcessingCenter_' has a wrong offset!");
static_assert(offsetof(BP_ObjectiveCondition_ArmyGone_C_DetermineState, Has_combat_units_) == 0x000002, "Member 'BP_ObjectiveCondition_ArmyGone_C_DetermineState::Has_combat_units_' has a wrong offset!");
static_assert(offsetof(BP_ObjectiveCondition_ArmyGone_C_DetermineState, Has_Refinery_) == 0x000003, "Member 'BP_ObjectiveCondition_ArmyGone_C_DetermineState::Has_Refinery_' has a wrong offset!");
static_assert(offsetof(BP_ObjectiveCondition_ArmyGone_C_DetermineState, Has_Harvester_) == 0x000004, "Member 'BP_ObjectiveCondition_ArmyGone_C_DetermineState::Has_Harvester_' has a wrong offset!");
static_assert(offsetof(BP_ObjectiveCondition_ArmyGone_C_DetermineState, Has_Tempest_Rig_unit_) == 0x000005, "Member 'BP_ObjectiveCondition_ArmyGone_C_DetermineState::Has_Tempest_Rig_unit_' has a wrong offset!");
static_assert(offsetof(BP_ObjectiveCondition_ArmyGone_C_DetermineState, Has_Air_production_) == 0x000006, "Member 'BP_ObjectiveCondition_ArmyGone_C_DetermineState::Has_Air_production_' has a wrong offset!");
static_assert(offsetof(BP_ObjectiveCondition_ArmyGone_C_DetermineState, Has_Vehicle_production_) == 0x000007, "Member 'BP_ObjectiveCondition_ArmyGone_C_DetermineState::Has_Vehicle_production_' has a wrong offset!");
static_assert(offsetof(BP_ObjectiveCondition_ArmyGone_C_DetermineState, Has_Unit_production_) == 0x000008, "Member 'BP_ObjectiveCondition_ArmyGone_C_DetermineState::Has_Unit_production_' has a wrong offset!");
static_assert(offsetof(BP_ObjectiveCondition_ArmyGone_C_DetermineState, Has_Construction_Yard_) == 0x000009, "Member 'BP_ObjectiveCondition_ArmyGone_C_DetermineState::Has_Construction_Yard_' has a wrong offset!");
static_assert(offsetof(BP_ObjectiveCondition_ArmyGone_C_DetermineState, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'BP_ObjectiveCondition_ArmyGone_C_DetermineState::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_ObjectiveCondition_ArmyGone_C_DetermineState, Temp_int_Loop_Counter_Variable) == 0x000010, "Member 'BP_ObjectiveCondition_ArmyGone_C_DetermineState::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_ObjectiveCondition_ArmyGone_C_DetermineState, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'BP_ObjectiveCondition_ArmyGone_C_DetermineState::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ObjectiveCondition_ArmyGone_C_DetermineState, Temp_int_Loop_Counter_Variable_1) == 0x000018, "Member 'BP_ObjectiveCondition_ArmyGone_C_DetermineState::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ObjectiveCondition_ArmyGone_C_DetermineState, CallFunc_Add_IntInt_ReturnValue_1) == 0x00001C, "Member 'BP_ObjectiveCondition_ArmyGone_C_DetermineState::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ObjectiveCondition_ArmyGone_C_DetermineState, CallFunc_BooleanAND_ReturnValue) == 0x000020, "Member 'BP_ObjectiveCondition_ArmyGone_C_DetermineState::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ObjectiveCondition_ArmyGone_C_DetermineState, CallFunc_BooleanOR_ReturnValue) == 0x000021, "Member 'BP_ObjectiveCondition_ArmyGone_C_DetermineState::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ObjectiveCondition_ArmyGone_C_DetermineState, CallFunc_BooleanOR_ReturnValue_1) == 0x000022, "Member 'BP_ObjectiveCondition_ArmyGone_C_DetermineState::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ObjectiveCondition_ArmyGone_C_DetermineState, Temp_int_Array_Index_Variable_1) == 0x000024, "Member 'BP_ObjectiveCondition_ArmyGone_C_DetermineState::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ObjectiveCondition_ArmyGone_C_DetermineState, CallFunc_BooleanOR_ReturnValue_2) == 0x000028, "Member 'BP_ObjectiveCondition_ArmyGone_C_DetermineState::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ObjectiveCondition_ArmyGone_C_DetermineState, Temp_int_Array_Index_Variable_2) == 0x00002C, "Member 'BP_ObjectiveCondition_ArmyGone_C_DetermineState::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_ObjectiveCondition_ArmyGone_C_DetermineState, Temp_bool_True_if_break_was_hit_Variable) == 0x000030, "Member 'BP_ObjectiveCondition_ArmyGone_C_DetermineState::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(BP_ObjectiveCondition_ArmyGone_C_DetermineState, CallFunc_Not_PreBool_ReturnValue) == 0x000031, "Member 'BP_ObjectiveCondition_ArmyGone_C_DetermineState::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ObjectiveCondition_ArmyGone_C_DetermineState, CallFunc_BooleanOR_ReturnValue_3) == 0x000032, "Member 'BP_ObjectiveCondition_ArmyGone_C_DetermineState::CallFunc_BooleanOR_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_ObjectiveCondition_ArmyGone_C_DetermineState, CallFunc_BooleanOR_ReturnValue_4) == 0x000033, "Member 'BP_ObjectiveCondition_ArmyGone_C_DetermineState::CallFunc_BooleanOR_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_ObjectiveCondition_ArmyGone_C_DetermineState, CallFunc_BooleanOR_ReturnValue_5) == 0x000034, "Member 'BP_ObjectiveCondition_ArmyGone_C_DetermineState::CallFunc_BooleanOR_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_ObjectiveCondition_ArmyGone_C_DetermineState, Temp_int_Loop_Counter_Variable_2) == 0x000038, "Member 'BP_ObjectiveCondition_ArmyGone_C_DetermineState::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_ObjectiveCondition_ArmyGone_C_DetermineState, CallFunc_Add_IntInt_ReturnValue_2) == 0x00003C, "Member 'BP_ObjectiveCondition_ArmyGone_C_DetermineState::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ObjectiveCondition_ArmyGone_C_DetermineState, CallFunc_GetByPlayerIndex_ReturnValue) == 0x000040, "Member 'BP_ObjectiveCondition_ArmyGone_C_DetermineState::CallFunc_GetByPlayerIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ObjectiveCondition_ArmyGone_C_DetermineState, CallFunc_GetOwnedUnits_OutUnits) == 0x000048, "Member 'BP_ObjectiveCondition_ArmyGone_C_DetermineState::CallFunc_GetOwnedUnits_OutUnits' has a wrong offset!");
static_assert(offsetof(BP_ObjectiveCondition_ArmyGone_C_DetermineState, CallFunc_GetOwnedUnits_ReturnValue) == 0x000058, "Member 'BP_ObjectiveCondition_ArmyGone_C_DetermineState::CallFunc_GetOwnedUnits_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ObjectiveCondition_ArmyGone_C_DetermineState, CallFunc_GetCredits_ReturnValue) == 0x00005C, "Member 'BP_ObjectiveCondition_ArmyGone_C_DetermineState::CallFunc_GetCredits_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ObjectiveCondition_ArmyGone_C_DetermineState, CallFunc_Greater_IntInt_ReturnValue) == 0x000060, "Member 'BP_ObjectiveCondition_ArmyGone_C_DetermineState::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ObjectiveCondition_ArmyGone_C_DetermineState, CallFunc_Array_Get_Item) == 0x000068, "Member 'BP_ObjectiveCondition_ArmyGone_C_DetermineState::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_ObjectiveCondition_ArmyGone_C_DetermineState, CallFunc_ObjectIsA_ReturnValue) == 0x000070, "Member 'BP_ObjectiveCondition_ArmyGone_C_DetermineState::CallFunc_ObjectIsA_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ObjectiveCondition_ArmyGone_C_DetermineState, CallFunc_ObjectIsA_ReturnValue_1) == 0x000071, "Member 'BP_ObjectiveCondition_ArmyGone_C_DetermineState::CallFunc_ObjectIsA_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ObjectiveCondition_ArmyGone_C_DetermineState, CallFunc_ObjectIsA_ReturnValue_2) == 0x000072, "Member 'BP_ObjectiveCondition_ArmyGone_C_DetermineState::CallFunc_ObjectIsA_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ObjectiveCondition_ArmyGone_C_DetermineState, CallFunc_BooleanOR_ReturnValue_6) == 0x000073, "Member 'BP_ObjectiveCondition_ArmyGone_C_DetermineState::CallFunc_BooleanOR_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_ObjectiveCondition_ArmyGone_C_DetermineState, CallFunc_ObjectIsA_ReturnValue_3) == 0x000074, "Member 'BP_ObjectiveCondition_ArmyGone_C_DetermineState::CallFunc_ObjectIsA_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_ObjectiveCondition_ArmyGone_C_DetermineState, CallFunc_BooleanOR_ReturnValue_7) == 0x000075, "Member 'BP_ObjectiveCondition_ArmyGone_C_DetermineState::CallFunc_BooleanOR_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_ObjectiveCondition_ArmyGone_C_DetermineState, CallFunc_Array_Get_Item_1) == 0x000078, "Member 'BP_ObjectiveCondition_ArmyGone_C_DetermineState::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_ObjectiveCondition_ArmyGone_C_DetermineState, CallFunc_ObjectIsA_ReturnValue_4) == 0x000080, "Member 'BP_ObjectiveCondition_ArmyGone_C_DetermineState::CallFunc_ObjectIsA_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_ObjectiveCondition_ArmyGone_C_DetermineState, CallFunc_ObjectIsA_ReturnValue_5) == 0x000081, "Member 'BP_ObjectiveCondition_ArmyGone_C_DetermineState::CallFunc_ObjectIsA_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_ObjectiveCondition_ArmyGone_C_DetermineState, CallFunc_ObjectIsA_ReturnValue_6) == 0x000082, "Member 'BP_ObjectiveCondition_ArmyGone_C_DetermineState::CallFunc_ObjectIsA_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_ObjectiveCondition_ArmyGone_C_DetermineState, CallFunc_Array_Length_ReturnValue) == 0x000084, "Member 'BP_ObjectiveCondition_ArmyGone_C_DetermineState::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ObjectiveCondition_ArmyGone_C_DetermineState, CallFunc_BooleanOR_ReturnValue_8) == 0x000088, "Member 'BP_ObjectiveCondition_ArmyGone_C_DetermineState::CallFunc_BooleanOR_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_ObjectiveCondition_ArmyGone_C_DetermineState, CallFunc_Less_IntInt_ReturnValue) == 0x000089, "Member 'BP_ObjectiveCondition_ArmyGone_C_DetermineState::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ObjectiveCondition_ArmyGone_C_DetermineState, CallFunc_BooleanOR_ReturnValue_9) == 0x00008A, "Member 'BP_ObjectiveCondition_ArmyGone_C_DetermineState::CallFunc_BooleanOR_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(BP_ObjectiveCondition_ArmyGone_C_DetermineState, CallFunc_Array_Length_ReturnValue_1) == 0x00008C, "Member 'BP_ObjectiveCondition_ArmyGone_C_DetermineState::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ObjectiveCondition_ArmyGone_C_DetermineState, CallFunc_GetOwnedStructures_OutStructures) == 0x000090, "Member 'BP_ObjectiveCondition_ArmyGone_C_DetermineState::CallFunc_GetOwnedStructures_OutStructures' has a wrong offset!");
static_assert(offsetof(BP_ObjectiveCondition_ArmyGone_C_DetermineState, CallFunc_GetOwnedStructures_ReturnValue) == 0x0000A0, "Member 'BP_ObjectiveCondition_ArmyGone_C_DetermineState::CallFunc_GetOwnedStructures_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ObjectiveCondition_ArmyGone_C_DetermineState, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000A1, "Member 'BP_ObjectiveCondition_ArmyGone_C_DetermineState::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ObjectiveCondition_ArmyGone_C_DetermineState, CallFunc_BooleanAND_ReturnValue_1) == 0x0000A2, "Member 'BP_ObjectiveCondition_ArmyGone_C_DetermineState::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ObjectiveCondition_ArmyGone_C_DetermineState, CallFunc_Array_Get_Item_2) == 0x0000A8, "Member 'BP_ObjectiveCondition_ArmyGone_C_DetermineState::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(BP_ObjectiveCondition_ArmyGone_C_DetermineState, CallFunc_ObjectIsA_ReturnValue_7) == 0x0000B0, "Member 'BP_ObjectiveCondition_ArmyGone_C_DetermineState::CallFunc_ObjectIsA_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_ObjectiveCondition_ArmyGone_C_DetermineState, CallFunc_ObjectIsA_ReturnValue_8) == 0x0000B1, "Member 'BP_ObjectiveCondition_ArmyGone_C_DetermineState::CallFunc_ObjectIsA_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_ObjectiveCondition_ArmyGone_C_DetermineState, CallFunc_ObjectIsA_ReturnValue_9) == 0x0000B2, "Member 'BP_ObjectiveCondition_ArmyGone_C_DetermineState::CallFunc_ObjectIsA_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(BP_ObjectiveCondition_ArmyGone_C_DetermineState, CallFunc_BooleanOR_ReturnValue_10) == 0x0000B3, "Member 'BP_ObjectiveCondition_ArmyGone_C_DetermineState::CallFunc_BooleanOR_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(BP_ObjectiveCondition_ArmyGone_C_DetermineState, CallFunc_ObjectIsA_ReturnValue_10) == 0x0000B4, "Member 'BP_ObjectiveCondition_ArmyGone_C_DetermineState::CallFunc_ObjectIsA_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(BP_ObjectiveCondition_ArmyGone_C_DetermineState, CallFunc_BooleanOR_ReturnValue_11) == 0x0000B5, "Member 'BP_ObjectiveCondition_ArmyGone_C_DetermineState::CallFunc_BooleanOR_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(BP_ObjectiveCondition_ArmyGone_C_DetermineState, CallFunc_ObjectIsA_ReturnValue_11) == 0x0000B6, "Member 'BP_ObjectiveCondition_ArmyGone_C_DetermineState::CallFunc_ObjectIsA_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(BP_ObjectiveCondition_ArmyGone_C_DetermineState, CallFunc_ObjectIsA_ReturnValue_12) == 0x0000B7, "Member 'BP_ObjectiveCondition_ArmyGone_C_DetermineState::CallFunc_ObjectIsA_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(BP_ObjectiveCondition_ArmyGone_C_DetermineState, CallFunc_ObjectIsA_ReturnValue_13) == 0x0000B8, "Member 'BP_ObjectiveCondition_ArmyGone_C_DetermineState::CallFunc_ObjectIsA_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(BP_ObjectiveCondition_ArmyGone_C_DetermineState, CallFunc_ObjectIsA_ReturnValue_14) == 0x0000B9, "Member 'BP_ObjectiveCondition_ArmyGone_C_DetermineState::CallFunc_ObjectIsA_ReturnValue_14' has a wrong offset!");
static_assert(offsetof(BP_ObjectiveCondition_ArmyGone_C_DetermineState, CallFunc_BooleanOR_ReturnValue_12) == 0x0000BA, "Member 'BP_ObjectiveCondition_ArmyGone_C_DetermineState::CallFunc_BooleanOR_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(BP_ObjectiveCondition_ArmyGone_C_DetermineState, CallFunc_ObjectIsA_ReturnValue_15) == 0x0000BB, "Member 'BP_ObjectiveCondition_ArmyGone_C_DetermineState::CallFunc_ObjectIsA_ReturnValue_15' has a wrong offset!");
static_assert(offsetof(BP_ObjectiveCondition_ArmyGone_C_DetermineState, CallFunc_BooleanOR_ReturnValue_13) == 0x0000BC, "Member 'BP_ObjectiveCondition_ArmyGone_C_DetermineState::CallFunc_BooleanOR_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(BP_ObjectiveCondition_ArmyGone_C_DetermineState, CallFunc_BooleanOR_ReturnValue_14) == 0x0000BD, "Member 'BP_ObjectiveCondition_ArmyGone_C_DetermineState::CallFunc_BooleanOR_ReturnValue_14' has a wrong offset!");
static_assert(offsetof(BP_ObjectiveCondition_ArmyGone_C_DetermineState, CallFunc_ObjectIsA_ReturnValue_16) == 0x0000BE, "Member 'BP_ObjectiveCondition_ArmyGone_C_DetermineState::CallFunc_ObjectIsA_ReturnValue_16' has a wrong offset!");
static_assert(offsetof(BP_ObjectiveCondition_ArmyGone_C_DetermineState, CallFunc_ObjectIsA_ReturnValue_17) == 0x0000BF, "Member 'BP_ObjectiveCondition_ArmyGone_C_DetermineState::CallFunc_ObjectIsA_ReturnValue_17' has a wrong offset!");
static_assert(offsetof(BP_ObjectiveCondition_ArmyGone_C_DetermineState, CallFunc_Array_Length_ReturnValue_2) == 0x0000C0, "Member 'BP_ObjectiveCondition_ArmyGone_C_DetermineState::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ObjectiveCondition_ArmyGone_C_DetermineState, CallFunc_Less_IntInt_ReturnValue_2) == 0x0000C4, "Member 'BP_ObjectiveCondition_ArmyGone_C_DetermineState::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");

// Function BP_ObjectiveCondition_ArmyGone.BP_ObjectiveCondition_ArmyGone_C.OnIsAlreadyMet
// 0x0002 (0x0002 - 0x0000)
struct BP_ObjectiveCondition_ArmyGone_C_OnIsAlreadyMet final
{
public:
	EObjectiveConditionState                      ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EObjectiveConditionState                      CallFunc_DetermineState_ReturnValue;               // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ObjectiveCondition_ArmyGone_C_OnIsAlreadyMet) == 0x000001, "Wrong alignment on BP_ObjectiveCondition_ArmyGone_C_OnIsAlreadyMet");
static_assert(sizeof(BP_ObjectiveCondition_ArmyGone_C_OnIsAlreadyMet) == 0x000002, "Wrong size on BP_ObjectiveCondition_ArmyGone_C_OnIsAlreadyMet");
static_assert(offsetof(BP_ObjectiveCondition_ArmyGone_C_OnIsAlreadyMet, ReturnValue) == 0x000000, "Member 'BP_ObjectiveCondition_ArmyGone_C_OnIsAlreadyMet::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ObjectiveCondition_ArmyGone_C_OnIsAlreadyMet, CallFunc_DetermineState_ReturnValue) == 0x000001, "Member 'BP_ObjectiveCondition_ArmyGone_C_OnIsAlreadyMet::CallFunc_DetermineState_ReturnValue' has a wrong offset!");

// Function BP_ObjectiveCondition_ArmyGone.BP_ObjectiveCondition_ArmyGone_C.OnIsValidSetup
// 0x0018 (0x0018 - 0x0000)
struct BP_ObjectiveCondition_ArmyGone_C_OnIsValidSetup final
{
public:
	class FString                                 OutFailReason;                                     // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ObjectiveCondition_ArmyGone_C_OnIsValidSetup) == 0x000008, "Wrong alignment on BP_ObjectiveCondition_ArmyGone_C_OnIsValidSetup");
static_assert(sizeof(BP_ObjectiveCondition_ArmyGone_C_OnIsValidSetup) == 0x000018, "Wrong size on BP_ObjectiveCondition_ArmyGone_C_OnIsValidSetup");
static_assert(offsetof(BP_ObjectiveCondition_ArmyGone_C_OnIsValidSetup, OutFailReason) == 0x000000, "Member 'BP_ObjectiveCondition_ArmyGone_C_OnIsValidSetup::OutFailReason' has a wrong offset!");
static_assert(offsetof(BP_ObjectiveCondition_ArmyGone_C_OnIsValidSetup, ReturnValue) == 0x000010, "Member 'BP_ObjectiveCondition_ArmyGone_C_OnIsValidSetup::ReturnValue' has a wrong offset!");

}

