#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Projectile_Rocket_DYNPorcupine

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_Projectile_Rocket_DYNPorcupine.BP_Projectile_Rocket_DYNPorcupine_C.ExecuteUbergraph_BP_Projectile_Rocket_DYNPorcupine
// 0x0060 (0x0060 - 0x0000)
struct BP_Projectile_Rocket_DYNPorcupine_C_ExecuteUbergraph_BP_Projectile_Rocket_DYNPorcupine final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ATedPawn*                               K2Node_DynamicCast_AsTed_Pawn;                     // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_GetSocketRotation_ReturnValue;            // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UFXSystemComponent*                     CallFunc_SpawnEffectAtLocation_ReturnValue;        // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Projectile_Rocket_DYNPorcupine_C_ExecuteUbergraph_BP_Projectile_Rocket_DYNPorcupine) == 0x000008, "Wrong alignment on BP_Projectile_Rocket_DYNPorcupine_C_ExecuteUbergraph_BP_Projectile_Rocket_DYNPorcupine");
static_assert(sizeof(BP_Projectile_Rocket_DYNPorcupine_C_ExecuteUbergraph_BP_Projectile_Rocket_DYNPorcupine) == 0x000060, "Wrong size on BP_Projectile_Rocket_DYNPorcupine_C_ExecuteUbergraph_BP_Projectile_Rocket_DYNPorcupine");
static_assert(offsetof(BP_Projectile_Rocket_DYNPorcupine_C_ExecuteUbergraph_BP_Projectile_Rocket_DYNPorcupine, EntryPoint) == 0x000000, "Member 'BP_Projectile_Rocket_DYNPorcupine_C_ExecuteUbergraph_BP_Projectile_Rocket_DYNPorcupine::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Rocket_DYNPorcupine_C_ExecuteUbergraph_BP_Projectile_Rocket_DYNPorcupine, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000008, "Member 'BP_Projectile_Rocket_DYNPorcupine_C_ExecuteUbergraph_BP_Projectile_Rocket_DYNPorcupine::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Rocket_DYNPorcupine_C_ExecuteUbergraph_BP_Projectile_Rocket_DYNPorcupine, CallFunc_IsDedicatedServer_ReturnValue) == 0x000020, "Member 'BP_Projectile_Rocket_DYNPorcupine_C_ExecuteUbergraph_BP_Projectile_Rocket_DYNPorcupine::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Rocket_DYNPorcupine_C_ExecuteUbergraph_BP_Projectile_Rocket_DYNPorcupine, CallFunc_GetOwner_ReturnValue) == 0x000028, "Member 'BP_Projectile_Rocket_DYNPorcupine_C_ExecuteUbergraph_BP_Projectile_Rocket_DYNPorcupine::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Rocket_DYNPorcupine_C_ExecuteUbergraph_BP_Projectile_Rocket_DYNPorcupine, K2Node_DynamicCast_AsTed_Pawn) == 0x000030, "Member 'BP_Projectile_Rocket_DYNPorcupine_C_ExecuteUbergraph_BP_Projectile_Rocket_DYNPorcupine::K2Node_DynamicCast_AsTed_Pawn' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Rocket_DYNPorcupine_C_ExecuteUbergraph_BP_Projectile_Rocket_DYNPorcupine, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'BP_Projectile_Rocket_DYNPorcupine_C_ExecuteUbergraph_BP_Projectile_Rocket_DYNPorcupine::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Rocket_DYNPorcupine_C_ExecuteUbergraph_BP_Projectile_Rocket_DYNPorcupine, CallFunc_GetSocketRotation_ReturnValue) == 0x000040, "Member 'BP_Projectile_Rocket_DYNPorcupine_C_ExecuteUbergraph_BP_Projectile_Rocket_DYNPorcupine::CallFunc_GetSocketRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Rocket_DYNPorcupine_C_ExecuteUbergraph_BP_Projectile_Rocket_DYNPorcupine, CallFunc_SpawnEffectAtLocation_ReturnValue) == 0x000058, "Member 'BP_Projectile_Rocket_DYNPorcupine_C_ExecuteUbergraph_BP_Projectile_Rocket_DYNPorcupine::CallFunc_SpawnEffectAtLocation_ReturnValue' has a wrong offset!");

}

