#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Projectile_VoltaicBarrage_VETShepherd

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_Projectile_VoltaicBarrage_VETShepherd.BP_Projectile_VoltaicBarrage_VETShepherd_C.ExecuteUbergraph_BP_Projectile_VoltaicBarrage_VETShepherd
// 0x0320 (0x0320 - 0x0000)
struct BP_Projectile_VoltaicBarrage_VETShepherd_C_ExecuteUbergraph_BP_Projectile_VoltaicBarrage_VETShepherd final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_VSize_ReturnValue;                        // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x0010(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x004B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetDestination_ReturnValue;               // 0x0050(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetStart_ReturnValue;                     // 0x0068(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_VSize_ReturnValue_1;                      // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0088(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFXSystemComponent*                     CallFunc_SpawnEffectAtLocation_ReturnValue;        // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue_1;                     // 0x00B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      K2Node_DynamicCast_AsNiagara_Particle_System_Component; // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue_1;       // 0x00D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_AddRelativeRotation_SweepHitResult;    // 0x00F0(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x01E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_VETI_Infantry_Shepherd_C*           K2Node_DynamicCast_AsBP_VETI_Infantry_Shepherd;    // 0x01F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F9[0x7];                                      // 0x01F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFXSystemComponent*                     CallFunc_SpawnEffectAttached_ReturnValue;          // 0x0200(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      K2Node_DynamicCast_AsNiagara_Particle_System_Component_1; // 0x0208(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_211[0x7];                                      // 0x0211(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult;       // 0x0218(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_SetVariableFloat_InValue_ImplicitCast;    // 0x0310(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetVariableFloat_InValue_ImplicitCast_1;  // 0x0314(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetVariableFloat_InValue_ImplicitCast_2;  // 0x0318(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetVariableFloat_InValue_ImplicitCast_3;  // 0x031C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Projectile_VoltaicBarrage_VETShepherd_C_ExecuteUbergraph_BP_Projectile_VoltaicBarrage_VETShepherd) == 0x000008, "Wrong alignment on BP_Projectile_VoltaicBarrage_VETShepherd_C_ExecuteUbergraph_BP_Projectile_VoltaicBarrage_VETShepherd");
static_assert(sizeof(BP_Projectile_VoltaicBarrage_VETShepherd_C_ExecuteUbergraph_BP_Projectile_VoltaicBarrage_VETShepherd) == 0x000320, "Wrong size on BP_Projectile_VoltaicBarrage_VETShepherd_C_ExecuteUbergraph_BP_Projectile_VoltaicBarrage_VETShepherd");
static_assert(offsetof(BP_Projectile_VoltaicBarrage_VETShepherd_C_ExecuteUbergraph_BP_Projectile_VoltaicBarrage_VETShepherd, EntryPoint) == 0x000000, "Member 'BP_Projectile_VoltaicBarrage_VETShepherd_C_ExecuteUbergraph_BP_Projectile_VoltaicBarrage_VETShepherd::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Projectile_VoltaicBarrage_VETShepherd_C_ExecuteUbergraph_BP_Projectile_VoltaicBarrage_VETShepherd, CallFunc_VSize_ReturnValue) == 0x000008, "Member 'BP_Projectile_VoltaicBarrage_VETShepherd_C_ExecuteUbergraph_BP_Projectile_VoltaicBarrage_VETShepherd::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Projectile_VoltaicBarrage_VETShepherd_C_ExecuteUbergraph_BP_Projectile_VoltaicBarrage_VETShepherd, CallFunc_Normal_ReturnValue) == 0x000010, "Member 'BP_Projectile_VoltaicBarrage_VETShepherd_C_ExecuteUbergraph_BP_Projectile_VoltaicBarrage_VETShepherd::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Projectile_VoltaicBarrage_VETShepherd_C_ExecuteUbergraph_BP_Projectile_VoltaicBarrage_VETShepherd, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000028, "Member 'BP_Projectile_VoltaicBarrage_VETShepherd_C_ExecuteUbergraph_BP_Projectile_VoltaicBarrage_VETShepherd::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Projectile_VoltaicBarrage_VETShepherd_C_ExecuteUbergraph_BP_Projectile_VoltaicBarrage_VETShepherd, CallFunc_Conv_VectorToRotator_ReturnValue) == 0x000030, "Member 'BP_Projectile_VoltaicBarrage_VETShepherd_C_ExecuteUbergraph_BP_Projectile_VoltaicBarrage_VETShepherd::CallFunc_Conv_VectorToRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Projectile_VoltaicBarrage_VETShepherd_C_ExecuteUbergraph_BP_Projectile_VoltaicBarrage_VETShepherd, CallFunc_IsDedicatedServer_ReturnValue) == 0x000048, "Member 'BP_Projectile_VoltaicBarrage_VETShepherd_C_ExecuteUbergraph_BP_Projectile_VoltaicBarrage_VETShepherd::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Projectile_VoltaicBarrage_VETShepherd_C_ExecuteUbergraph_BP_Projectile_VoltaicBarrage_VETShepherd, CallFunc_Not_PreBool_ReturnValue) == 0x000049, "Member 'BP_Projectile_VoltaicBarrage_VETShepherd_C_ExecuteUbergraph_BP_Projectile_VoltaicBarrage_VETShepherd::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Projectile_VoltaicBarrage_VETShepherd_C_ExecuteUbergraph_BP_Projectile_VoltaicBarrage_VETShepherd, CallFunc_Not_PreBool_ReturnValue_1) == 0x00004A, "Member 'BP_Projectile_VoltaicBarrage_VETShepherd_C_ExecuteUbergraph_BP_Projectile_VoltaicBarrage_VETShepherd::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Projectile_VoltaicBarrage_VETShepherd_C_ExecuteUbergraph_BP_Projectile_VoltaicBarrage_VETShepherd, CallFunc_BooleanAND_ReturnValue) == 0x00004B, "Member 'BP_Projectile_VoltaicBarrage_VETShepherd_C_ExecuteUbergraph_BP_Projectile_VoltaicBarrage_VETShepherd::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Projectile_VoltaicBarrage_VETShepherd_C_ExecuteUbergraph_BP_Projectile_VoltaicBarrage_VETShepherd, CallFunc_GetDestination_ReturnValue) == 0x000050, "Member 'BP_Projectile_VoltaicBarrage_VETShepherd_C_ExecuteUbergraph_BP_Projectile_VoltaicBarrage_VETShepherd::CallFunc_GetDestination_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Projectile_VoltaicBarrage_VETShepherd_C_ExecuteUbergraph_BP_Projectile_VoltaicBarrage_VETShepherd, CallFunc_GetStart_ReturnValue) == 0x000068, "Member 'BP_Projectile_VoltaicBarrage_VETShepherd_C_ExecuteUbergraph_BP_Projectile_VoltaicBarrage_VETShepherd::CallFunc_GetStart_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Projectile_VoltaicBarrage_VETShepherd_C_ExecuteUbergraph_BP_Projectile_VoltaicBarrage_VETShepherd, CallFunc_VSize_ReturnValue_1) == 0x000080, "Member 'BP_Projectile_VoltaicBarrage_VETShepherd_C_ExecuteUbergraph_BP_Projectile_VoltaicBarrage_VETShepherd::CallFunc_VSize_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Projectile_VoltaicBarrage_VETShepherd_C_ExecuteUbergraph_BP_Projectile_VoltaicBarrage_VETShepherd, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000088, "Member 'BP_Projectile_VoltaicBarrage_VETShepherd_C_ExecuteUbergraph_BP_Projectile_VoltaicBarrage_VETShepherd::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Projectile_VoltaicBarrage_VETShepherd_C_ExecuteUbergraph_BP_Projectile_VoltaicBarrage_VETShepherd, CallFunc_Divide_DoubleDouble_ReturnValue_1) == 0x0000A0, "Member 'BP_Projectile_VoltaicBarrage_VETShepherd_C_ExecuteUbergraph_BP_Projectile_VoltaicBarrage_VETShepherd::CallFunc_Divide_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Projectile_VoltaicBarrage_VETShepherd_C_ExecuteUbergraph_BP_Projectile_VoltaicBarrage_VETShepherd, CallFunc_SpawnEffectAtLocation_ReturnValue) == 0x0000A8, "Member 'BP_Projectile_VoltaicBarrage_VETShepherd_C_ExecuteUbergraph_BP_Projectile_VoltaicBarrage_VETShepherd::CallFunc_SpawnEffectAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Projectile_VoltaicBarrage_VETShepherd_C_ExecuteUbergraph_BP_Projectile_VoltaicBarrage_VETShepherd, CallFunc_Normal_ReturnValue_1) == 0x0000B0, "Member 'BP_Projectile_VoltaicBarrage_VETShepherd_C_ExecuteUbergraph_BP_Projectile_VoltaicBarrage_VETShepherd::CallFunc_Normal_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Projectile_VoltaicBarrage_VETShepherd_C_ExecuteUbergraph_BP_Projectile_VoltaicBarrage_VETShepherd, K2Node_DynamicCast_AsNiagara_Particle_System_Component) == 0x0000C8, "Member 'BP_Projectile_VoltaicBarrage_VETShepherd_C_ExecuteUbergraph_BP_Projectile_VoltaicBarrage_VETShepherd::K2Node_DynamicCast_AsNiagara_Particle_System_Component' has a wrong offset!");
static_assert(offsetof(BP_Projectile_VoltaicBarrage_VETShepherd_C_ExecuteUbergraph_BP_Projectile_VoltaicBarrage_VETShepherd, K2Node_DynamicCast_bSuccess) == 0x0000D0, "Member 'BP_Projectile_VoltaicBarrage_VETShepherd_C_ExecuteUbergraph_BP_Projectile_VoltaicBarrage_VETShepherd::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Projectile_VoltaicBarrage_VETShepherd_C_ExecuteUbergraph_BP_Projectile_VoltaicBarrage_VETShepherd, CallFunc_Conv_VectorToRotator_ReturnValue_1) == 0x0000D8, "Member 'BP_Projectile_VoltaicBarrage_VETShepherd_C_ExecuteUbergraph_BP_Projectile_VoltaicBarrage_VETShepherd::CallFunc_Conv_VectorToRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Projectile_VoltaicBarrage_VETShepherd_C_ExecuteUbergraph_BP_Projectile_VoltaicBarrage_VETShepherd, CallFunc_K2_AddRelativeRotation_SweepHitResult) == 0x0000F0, "Member 'BP_Projectile_VoltaicBarrage_VETShepherd_C_ExecuteUbergraph_BP_Projectile_VoltaicBarrage_VETShepherd::CallFunc_K2_AddRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_Projectile_VoltaicBarrage_VETShepherd_C_ExecuteUbergraph_BP_Projectile_VoltaicBarrage_VETShepherd, CallFunc_GetOwner_ReturnValue) == 0x0001E8, "Member 'BP_Projectile_VoltaicBarrage_VETShepherd_C_ExecuteUbergraph_BP_Projectile_VoltaicBarrage_VETShepherd::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Projectile_VoltaicBarrage_VETShepherd_C_ExecuteUbergraph_BP_Projectile_VoltaicBarrage_VETShepherd, K2Node_DynamicCast_AsBP_VETI_Infantry_Shepherd) == 0x0001F0, "Member 'BP_Projectile_VoltaicBarrage_VETShepherd_C_ExecuteUbergraph_BP_Projectile_VoltaicBarrage_VETShepherd::K2Node_DynamicCast_AsBP_VETI_Infantry_Shepherd' has a wrong offset!");
static_assert(offsetof(BP_Projectile_VoltaicBarrage_VETShepherd_C_ExecuteUbergraph_BP_Projectile_VoltaicBarrage_VETShepherd, K2Node_DynamicCast_bSuccess_1) == 0x0001F8, "Member 'BP_Projectile_VoltaicBarrage_VETShepherd_C_ExecuteUbergraph_BP_Projectile_VoltaicBarrage_VETShepherd::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_Projectile_VoltaicBarrage_VETShepherd_C_ExecuteUbergraph_BP_Projectile_VoltaicBarrage_VETShepherd, CallFunc_SpawnEffectAttached_ReturnValue) == 0x000200, "Member 'BP_Projectile_VoltaicBarrage_VETShepherd_C_ExecuteUbergraph_BP_Projectile_VoltaicBarrage_VETShepherd::CallFunc_SpawnEffectAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Projectile_VoltaicBarrage_VETShepherd_C_ExecuteUbergraph_BP_Projectile_VoltaicBarrage_VETShepherd, K2Node_DynamicCast_AsNiagara_Particle_System_Component_1) == 0x000208, "Member 'BP_Projectile_VoltaicBarrage_VETShepherd_C_ExecuteUbergraph_BP_Projectile_VoltaicBarrage_VETShepherd::K2Node_DynamicCast_AsNiagara_Particle_System_Component_1' has a wrong offset!");
static_assert(offsetof(BP_Projectile_VoltaicBarrage_VETShepherd_C_ExecuteUbergraph_BP_Projectile_VoltaicBarrage_VETShepherd, K2Node_DynamicCast_bSuccess_2) == 0x000210, "Member 'BP_Projectile_VoltaicBarrage_VETShepherd_C_ExecuteUbergraph_BP_Projectile_VoltaicBarrage_VETShepherd::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_Projectile_VoltaicBarrage_VETShepherd_C_ExecuteUbergraph_BP_Projectile_VoltaicBarrage_VETShepherd, CallFunc_K2_SetWorldRotation_SweepHitResult) == 0x000218, "Member 'BP_Projectile_VoltaicBarrage_VETShepherd_C_ExecuteUbergraph_BP_Projectile_VoltaicBarrage_VETShepherd::CallFunc_K2_SetWorldRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_Projectile_VoltaicBarrage_VETShepherd_C_ExecuteUbergraph_BP_Projectile_VoltaicBarrage_VETShepherd, CallFunc_SetVariableFloat_InValue_ImplicitCast) == 0x000310, "Member 'BP_Projectile_VoltaicBarrage_VETShepherd_C_ExecuteUbergraph_BP_Projectile_VoltaicBarrage_VETShepherd::CallFunc_SetVariableFloat_InValue_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Projectile_VoltaicBarrage_VETShepherd_C_ExecuteUbergraph_BP_Projectile_VoltaicBarrage_VETShepherd, CallFunc_SetVariableFloat_InValue_ImplicitCast_1) == 0x000314, "Member 'BP_Projectile_VoltaicBarrage_VETShepherd_C_ExecuteUbergraph_BP_Projectile_VoltaicBarrage_VETShepherd::CallFunc_SetVariableFloat_InValue_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_Projectile_VoltaicBarrage_VETShepherd_C_ExecuteUbergraph_BP_Projectile_VoltaicBarrage_VETShepherd, CallFunc_SetVariableFloat_InValue_ImplicitCast_2) == 0x000318, "Member 'BP_Projectile_VoltaicBarrage_VETShepherd_C_ExecuteUbergraph_BP_Projectile_VoltaicBarrage_VETShepherd::CallFunc_SetVariableFloat_InValue_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(BP_Projectile_VoltaicBarrage_VETShepherd_C_ExecuteUbergraph_BP_Projectile_VoltaicBarrage_VETShepherd, CallFunc_SetVariableFloat_InValue_ImplicitCast_3) == 0x00031C, "Member 'BP_Projectile_VoltaicBarrage_VETShepherd_C_ExecuteUbergraph_BP_Projectile_VoltaicBarrage_VETShepherd::CallFunc_SetVariableFloat_InValue_ImplicitCast_3' has a wrong offset!");

}

