#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Projectile_LaserBeam_VETAscended

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_Projectile_LaserBeam_VETAscended.BP_Projectile_LaserBeam_VETAscended_C.ExecuteUbergraph_BP_Projectile_LaserBeam_VETAscended
// 0x03B0 (0x03B0 - 0x0000)
struct BP_Projectile_LaserBeam_VETAscended_C_ExecuteUbergraph_BP_Projectile_LaserBeam_VETAscended final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_VSize_ReturnValue;                        // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam;                // 0x0070(0x00E0)(IsPlainOldData, NoDestructor)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetDestination_ReturnValue;               // 0x0158(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam_1;              // 0x0170(0x00E0)(IsPlainOldData, NoDestructor)
	TArray<struct FParticleSysParam>              K2Node_MakeArray_Array;                            // 0x0250(0x0010)(ReferenceParm)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0261(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0262(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0263(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_264[0x4];                                      // 0x0264(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetStart_ReturnValue;                     // 0x0268(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0280(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFXSystemComponent*                     CallFunc_SpawnEffectAtLocation_ReturnValue;        // 0x0298(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_AddRelativeRotation_SweepHitResult;    // 0x02A0(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class UParticleSystemComponent*               K2Node_DynamicCast_AsCascade_Particle_System_Component; // 0x0398(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x03A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A1[0x3];                                      // 0x03A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_MakeStruct_Scalar_ImplicitCast;             // 0x03A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Projectile_LaserBeam_VETAscended_C_ExecuteUbergraph_BP_Projectile_LaserBeam_VETAscended) == 0x000010, "Wrong alignment on BP_Projectile_LaserBeam_VETAscended_C_ExecuteUbergraph_BP_Projectile_LaserBeam_VETAscended");
static_assert(sizeof(BP_Projectile_LaserBeam_VETAscended_C_ExecuteUbergraph_BP_Projectile_LaserBeam_VETAscended) == 0x0003B0, "Wrong size on BP_Projectile_LaserBeam_VETAscended_C_ExecuteUbergraph_BP_Projectile_LaserBeam_VETAscended");
static_assert(offsetof(BP_Projectile_LaserBeam_VETAscended_C_ExecuteUbergraph_BP_Projectile_LaserBeam_VETAscended, EntryPoint) == 0x000000, "Member 'BP_Projectile_LaserBeam_VETAscended_C_ExecuteUbergraph_BP_Projectile_LaserBeam_VETAscended::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Projectile_LaserBeam_VETAscended_C_ExecuteUbergraph_BP_Projectile_LaserBeam_VETAscended, CallFunc_MakeVector_ReturnValue) == 0x000008, "Member 'BP_Projectile_LaserBeam_VETAscended_C_ExecuteUbergraph_BP_Projectile_LaserBeam_VETAscended::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Projectile_LaserBeam_VETAscended_C_ExecuteUbergraph_BP_Projectile_LaserBeam_VETAscended, CallFunc_VSize_ReturnValue) == 0x000020, "Member 'BP_Projectile_LaserBeam_VETAscended_C_ExecuteUbergraph_BP_Projectile_LaserBeam_VETAscended::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Projectile_LaserBeam_VETAscended_C_ExecuteUbergraph_BP_Projectile_LaserBeam_VETAscended, CallFunc_Normal_ReturnValue) == 0x000028, "Member 'BP_Projectile_LaserBeam_VETAscended_C_ExecuteUbergraph_BP_Projectile_LaserBeam_VETAscended::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Projectile_LaserBeam_VETAscended_C_ExecuteUbergraph_BP_Projectile_LaserBeam_VETAscended, CallFunc_MakeVector_ReturnValue_1) == 0x000040, "Member 'BP_Projectile_LaserBeam_VETAscended_C_ExecuteUbergraph_BP_Projectile_LaserBeam_VETAscended::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Projectile_LaserBeam_VETAscended_C_ExecuteUbergraph_BP_Projectile_LaserBeam_VETAscended, CallFunc_Conv_VectorToRotator_ReturnValue) == 0x000058, "Member 'BP_Projectile_LaserBeam_VETAscended_C_ExecuteUbergraph_BP_Projectile_LaserBeam_VETAscended::CallFunc_Conv_VectorToRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Projectile_LaserBeam_VETAscended_C_ExecuteUbergraph_BP_Projectile_LaserBeam_VETAscended, K2Node_MakeStruct_ParticleSysParam) == 0x000070, "Member 'BP_Projectile_LaserBeam_VETAscended_C_ExecuteUbergraph_BP_Projectile_LaserBeam_VETAscended::K2Node_MakeStruct_ParticleSysParam' has a wrong offset!");
static_assert(offsetof(BP_Projectile_LaserBeam_VETAscended_C_ExecuteUbergraph_BP_Projectile_LaserBeam_VETAscended, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000150, "Member 'BP_Projectile_LaserBeam_VETAscended_C_ExecuteUbergraph_BP_Projectile_LaserBeam_VETAscended::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Projectile_LaserBeam_VETAscended_C_ExecuteUbergraph_BP_Projectile_LaserBeam_VETAscended, CallFunc_GetDestination_ReturnValue) == 0x000158, "Member 'BP_Projectile_LaserBeam_VETAscended_C_ExecuteUbergraph_BP_Projectile_LaserBeam_VETAscended::CallFunc_GetDestination_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Projectile_LaserBeam_VETAscended_C_ExecuteUbergraph_BP_Projectile_LaserBeam_VETAscended, K2Node_MakeStruct_ParticleSysParam_1) == 0x000170, "Member 'BP_Projectile_LaserBeam_VETAscended_C_ExecuteUbergraph_BP_Projectile_LaserBeam_VETAscended::K2Node_MakeStruct_ParticleSysParam_1' has a wrong offset!");
static_assert(offsetof(BP_Projectile_LaserBeam_VETAscended_C_ExecuteUbergraph_BP_Projectile_LaserBeam_VETAscended, K2Node_MakeArray_Array) == 0x000250, "Member 'BP_Projectile_LaserBeam_VETAscended_C_ExecuteUbergraph_BP_Projectile_LaserBeam_VETAscended::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_Projectile_LaserBeam_VETAscended_C_ExecuteUbergraph_BP_Projectile_LaserBeam_VETAscended, CallFunc_IsDedicatedServer_ReturnValue) == 0x000260, "Member 'BP_Projectile_LaserBeam_VETAscended_C_ExecuteUbergraph_BP_Projectile_LaserBeam_VETAscended::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Projectile_LaserBeam_VETAscended_C_ExecuteUbergraph_BP_Projectile_LaserBeam_VETAscended, CallFunc_Not_PreBool_ReturnValue) == 0x000261, "Member 'BP_Projectile_LaserBeam_VETAscended_C_ExecuteUbergraph_BP_Projectile_LaserBeam_VETAscended::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Projectile_LaserBeam_VETAscended_C_ExecuteUbergraph_BP_Projectile_LaserBeam_VETAscended, CallFunc_Not_PreBool_ReturnValue_1) == 0x000262, "Member 'BP_Projectile_LaserBeam_VETAscended_C_ExecuteUbergraph_BP_Projectile_LaserBeam_VETAscended::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Projectile_LaserBeam_VETAscended_C_ExecuteUbergraph_BP_Projectile_LaserBeam_VETAscended, CallFunc_BooleanAND_ReturnValue) == 0x000263, "Member 'BP_Projectile_LaserBeam_VETAscended_C_ExecuteUbergraph_BP_Projectile_LaserBeam_VETAscended::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Projectile_LaserBeam_VETAscended_C_ExecuteUbergraph_BP_Projectile_LaserBeam_VETAscended, CallFunc_GetStart_ReturnValue) == 0x000268, "Member 'BP_Projectile_LaserBeam_VETAscended_C_ExecuteUbergraph_BP_Projectile_LaserBeam_VETAscended::CallFunc_GetStart_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Projectile_LaserBeam_VETAscended_C_ExecuteUbergraph_BP_Projectile_LaserBeam_VETAscended, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000280, "Member 'BP_Projectile_LaserBeam_VETAscended_C_ExecuteUbergraph_BP_Projectile_LaserBeam_VETAscended::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Projectile_LaserBeam_VETAscended_C_ExecuteUbergraph_BP_Projectile_LaserBeam_VETAscended, CallFunc_SpawnEffectAtLocation_ReturnValue) == 0x000298, "Member 'BP_Projectile_LaserBeam_VETAscended_C_ExecuteUbergraph_BP_Projectile_LaserBeam_VETAscended::CallFunc_SpawnEffectAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Projectile_LaserBeam_VETAscended_C_ExecuteUbergraph_BP_Projectile_LaserBeam_VETAscended, CallFunc_K2_AddRelativeRotation_SweepHitResult) == 0x0002A0, "Member 'BP_Projectile_LaserBeam_VETAscended_C_ExecuteUbergraph_BP_Projectile_LaserBeam_VETAscended::CallFunc_K2_AddRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_Projectile_LaserBeam_VETAscended_C_ExecuteUbergraph_BP_Projectile_LaserBeam_VETAscended, K2Node_DynamicCast_AsCascade_Particle_System_Component) == 0x000398, "Member 'BP_Projectile_LaserBeam_VETAscended_C_ExecuteUbergraph_BP_Projectile_LaserBeam_VETAscended::K2Node_DynamicCast_AsCascade_Particle_System_Component' has a wrong offset!");
static_assert(offsetof(BP_Projectile_LaserBeam_VETAscended_C_ExecuteUbergraph_BP_Projectile_LaserBeam_VETAscended, K2Node_DynamicCast_bSuccess) == 0x0003A0, "Member 'BP_Projectile_LaserBeam_VETAscended_C_ExecuteUbergraph_BP_Projectile_LaserBeam_VETAscended::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Projectile_LaserBeam_VETAscended_C_ExecuteUbergraph_BP_Projectile_LaserBeam_VETAscended, K2Node_MakeStruct_Scalar_ImplicitCast) == 0x0003A4, "Member 'BP_Projectile_LaserBeam_VETAscended_C_ExecuteUbergraph_BP_Projectile_LaserBeam_VETAscended::K2Node_MakeStruct_Scalar_ImplicitCast' has a wrong offset!");

}

