#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Projectile_Augur

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Tempest_structs.hpp"


namespace SDK::Params
{

// Function BP_Projectile_Augur.BP_Projectile_Augur_C.ExecuteUbergraph_BP_Projectile_Augur
// 0x0050 (0x0050 - 0x0000)
struct BP_Projectile_Augur_C_ExecuteUbergraph_BP_Projectile_Augur final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Temp_struct_Variable;                              // 0x0008(0x0018)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATedPawn*                               K2Node_DynamicCast_AsTed_Pawn;                     // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATedPlayerState*                        CallFunc_GetOwningPlayerState_ReturnValue;         // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ETedTeamID                                    CallFunc_GetTeamID_ReturnValue;                    // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFoWAgentHandle                        CallFunc_RevealFogOfWar_ReturnValue;               // 0x004C(0x0004)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Projectile_Augur_C_ExecuteUbergraph_BP_Projectile_Augur) == 0x000008, "Wrong alignment on BP_Projectile_Augur_C_ExecuteUbergraph_BP_Projectile_Augur");
static_assert(sizeof(BP_Projectile_Augur_C_ExecuteUbergraph_BP_Projectile_Augur) == 0x000050, "Wrong size on BP_Projectile_Augur_C_ExecuteUbergraph_BP_Projectile_Augur");
static_assert(offsetof(BP_Projectile_Augur_C_ExecuteUbergraph_BP_Projectile_Augur, EntryPoint) == 0x000000, "Member 'BP_Projectile_Augur_C_ExecuteUbergraph_BP_Projectile_Augur::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Augur_C_ExecuteUbergraph_BP_Projectile_Augur, Temp_struct_Variable) == 0x000008, "Member 'BP_Projectile_Augur_C_ExecuteUbergraph_BP_Projectile_Augur::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Augur_C_ExecuteUbergraph_BP_Projectile_Augur, CallFunc_GetOwner_ReturnValue) == 0x000020, "Member 'BP_Projectile_Augur_C_ExecuteUbergraph_BP_Projectile_Augur::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Augur_C_ExecuteUbergraph_BP_Projectile_Augur, CallFunc_IsDedicatedServer_ReturnValue) == 0x000028, "Member 'BP_Projectile_Augur_C_ExecuteUbergraph_BP_Projectile_Augur::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Augur_C_ExecuteUbergraph_BP_Projectile_Augur, K2Node_DynamicCast_AsTed_Pawn) == 0x000030, "Member 'BP_Projectile_Augur_C_ExecuteUbergraph_BP_Projectile_Augur::K2Node_DynamicCast_AsTed_Pawn' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Augur_C_ExecuteUbergraph_BP_Projectile_Augur, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'BP_Projectile_Augur_C_ExecuteUbergraph_BP_Projectile_Augur::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Augur_C_ExecuteUbergraph_BP_Projectile_Augur, CallFunc_GetOwningPlayerState_ReturnValue) == 0x000040, "Member 'BP_Projectile_Augur_C_ExecuteUbergraph_BP_Projectile_Augur::CallFunc_GetOwningPlayerState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Augur_C_ExecuteUbergraph_BP_Projectile_Augur, CallFunc_GetTeamID_ReturnValue) == 0x000048, "Member 'BP_Projectile_Augur_C_ExecuteUbergraph_BP_Projectile_Augur::CallFunc_GetTeamID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Augur_C_ExecuteUbergraph_BP_Projectile_Augur, CallFunc_RevealFogOfWar_ReturnValue) == 0x00004C, "Member 'BP_Projectile_Augur_C_ExecuteUbergraph_BP_Projectile_Augur::CallFunc_RevealFogOfWar_ReturnValue' has a wrong offset!");

}

