#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Projectile_Ambassador

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_Projectile_Ambassador.BP_Projectile_Ambassador_C.ExecuteUbergraph_BP_Projectile_Ambassador
// 0x0040 (0x0040 - 0x0000)
struct BP_Projectile_Ambassador_C_ExecuteUbergraph_BP_Projectile_Ambassador final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFXSystemComponent*                     CallFunc_SpawnEffectAtLocation_ReturnValue;        // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Projectile_Ambassador_C_ExecuteUbergraph_BP_Projectile_Ambassador) == 0x000008, "Wrong alignment on BP_Projectile_Ambassador_C_ExecuteUbergraph_BP_Projectile_Ambassador");
static_assert(sizeof(BP_Projectile_Ambassador_C_ExecuteUbergraph_BP_Projectile_Ambassador) == 0x000040, "Wrong size on BP_Projectile_Ambassador_C_ExecuteUbergraph_BP_Projectile_Ambassador");
static_assert(offsetof(BP_Projectile_Ambassador_C_ExecuteUbergraph_BP_Projectile_Ambassador, EntryPoint) == 0x000000, "Member 'BP_Projectile_Ambassador_C_ExecuteUbergraph_BP_Projectile_Ambassador::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Ambassador_C_ExecuteUbergraph_BP_Projectile_Ambassador, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000008, "Member 'BP_Projectile_Ambassador_C_ExecuteUbergraph_BP_Projectile_Ambassador::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Ambassador_C_ExecuteUbergraph_BP_Projectile_Ambassador, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000020, "Member 'BP_Projectile_Ambassador_C_ExecuteUbergraph_BP_Projectile_Ambassador::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Ambassador_C_ExecuteUbergraph_BP_Projectile_Ambassador, CallFunc_SpawnEffectAtLocation_ReturnValue) == 0x000038, "Member 'BP_Projectile_Ambassador_C_ExecuteUbergraph_BP_Projectile_Ambassador::CallFunc_SpawnEffectAtLocation_ReturnValue' has a wrong offset!");

}

