#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Projectile_ClusterMine

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Tempest_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Projectile_ClusterMine.BP_Projectile_ClusterMine_C
// 0x0028 (0x0498 - 0x0470)
class ABP_Projectile_ClusterMine_C final : public ATedProjectile_ClusterMine
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0470(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAudioComponent*                        MineDeploySFX;                                     // 0x0478(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_TEMP_Bomb;                                      // 0x0480(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               ParticleSystem;                                    // 0x0488(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ATedPawn*                               PawnOwner;                                         // 0x0490(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Projectile_ClusterMine(int32 EntryPoint);
	void ReceiveOnProjectileHit();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Projectile_ClusterMine_C">();
	}
	static class ABP_Projectile_ClusterMine_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Projectile_ClusterMine_C>();
	}
};
static_assert(alignof(ABP_Projectile_ClusterMine_C) == 0x000008, "Wrong alignment on ABP_Projectile_ClusterMine_C");
static_assert(sizeof(ABP_Projectile_ClusterMine_C) == 0x000498, "Wrong size on ABP_Projectile_ClusterMine_C");
static_assert(offsetof(ABP_Projectile_ClusterMine_C, UberGraphFrame) == 0x000470, "Member 'ABP_Projectile_ClusterMine_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Projectile_ClusterMine_C, MineDeploySFX) == 0x000478, "Member 'ABP_Projectile_ClusterMine_C::MineDeploySFX' has a wrong offset!");
static_assert(offsetof(ABP_Projectile_ClusterMine_C, SM_TEMP_Bomb) == 0x000480, "Member 'ABP_Projectile_ClusterMine_C::SM_TEMP_Bomb' has a wrong offset!");
static_assert(offsetof(ABP_Projectile_ClusterMine_C, ParticleSystem) == 0x000488, "Member 'ABP_Projectile_ClusterMine_C::ParticleSystem' has a wrong offset!");
static_assert(offsetof(ABP_Projectile_ClusterMine_C, PawnOwner) == 0x000490, "Member 'ABP_Projectile_ClusterMine_C::PawnOwner' has a wrong offset!");

}

