#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Projectile_LaserBeam_Queller

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_Projectile_LaserBeam_Queller.BP_Projectile_LaserBeam_Queller_C.ExecuteUbergraph_BP_Projectile_LaserBeam_Queller
// 0x0050 (0x0050 - 0x0000)
struct BP_Projectile_LaserBeam_Queller_C_ExecuteUbergraph_BP_Projectile_LaserBeam_Queller final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetStart_ReturnValue;                     // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetDestination_ReturnValue;               // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFXSystemComponent*                     CallFunc_SpawnEffectAtLocation_ReturnValue;        // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               K2Node_DynamicCast_AsCascade_Particle_System_Component; // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x004B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Projectile_LaserBeam_Queller_C_ExecuteUbergraph_BP_Projectile_LaserBeam_Queller) == 0x000008, "Wrong alignment on BP_Projectile_LaserBeam_Queller_C_ExecuteUbergraph_BP_Projectile_LaserBeam_Queller");
static_assert(sizeof(BP_Projectile_LaserBeam_Queller_C_ExecuteUbergraph_BP_Projectile_LaserBeam_Queller) == 0x000050, "Wrong size on BP_Projectile_LaserBeam_Queller_C_ExecuteUbergraph_BP_Projectile_LaserBeam_Queller");
static_assert(offsetof(BP_Projectile_LaserBeam_Queller_C_ExecuteUbergraph_BP_Projectile_LaserBeam_Queller, EntryPoint) == 0x000000, "Member 'BP_Projectile_LaserBeam_Queller_C_ExecuteUbergraph_BP_Projectile_LaserBeam_Queller::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Projectile_LaserBeam_Queller_C_ExecuteUbergraph_BP_Projectile_LaserBeam_Queller, CallFunc_GetStart_ReturnValue) == 0x000008, "Member 'BP_Projectile_LaserBeam_Queller_C_ExecuteUbergraph_BP_Projectile_LaserBeam_Queller::CallFunc_GetStart_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Projectile_LaserBeam_Queller_C_ExecuteUbergraph_BP_Projectile_LaserBeam_Queller, CallFunc_GetDestination_ReturnValue) == 0x000020, "Member 'BP_Projectile_LaserBeam_Queller_C_ExecuteUbergraph_BP_Projectile_LaserBeam_Queller::CallFunc_GetDestination_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Projectile_LaserBeam_Queller_C_ExecuteUbergraph_BP_Projectile_LaserBeam_Queller, CallFunc_SpawnEffectAtLocation_ReturnValue) == 0x000038, "Member 'BP_Projectile_LaserBeam_Queller_C_ExecuteUbergraph_BP_Projectile_LaserBeam_Queller::CallFunc_SpawnEffectAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Projectile_LaserBeam_Queller_C_ExecuteUbergraph_BP_Projectile_LaserBeam_Queller, K2Node_DynamicCast_AsCascade_Particle_System_Component) == 0x000040, "Member 'BP_Projectile_LaserBeam_Queller_C_ExecuteUbergraph_BP_Projectile_LaserBeam_Queller::K2Node_DynamicCast_AsCascade_Particle_System_Component' has a wrong offset!");
static_assert(offsetof(BP_Projectile_LaserBeam_Queller_C_ExecuteUbergraph_BP_Projectile_LaserBeam_Queller, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'BP_Projectile_LaserBeam_Queller_C_ExecuteUbergraph_BP_Projectile_LaserBeam_Queller::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Projectile_LaserBeam_Queller_C_ExecuteUbergraph_BP_Projectile_LaserBeam_Queller, CallFunc_IsDedicatedServer_ReturnValue) == 0x000049, "Member 'BP_Projectile_LaserBeam_Queller_C_ExecuteUbergraph_BP_Projectile_LaserBeam_Queller::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Projectile_LaserBeam_Queller_C_ExecuteUbergraph_BP_Projectile_LaserBeam_Queller, CallFunc_Not_PreBool_ReturnValue) == 0x00004A, "Member 'BP_Projectile_LaserBeam_Queller_C_ExecuteUbergraph_BP_Projectile_LaserBeam_Queller::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Projectile_LaserBeam_Queller_C_ExecuteUbergraph_BP_Projectile_LaserBeam_Queller, CallFunc_Not_PreBool_ReturnValue_1) == 0x00004B, "Member 'BP_Projectile_LaserBeam_Queller_C_ExecuteUbergraph_BP_Projectile_LaserBeam_Queller::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Projectile_LaserBeam_Queller_C_ExecuteUbergraph_BP_Projectile_LaserBeam_Queller, CallFunc_BooleanAND_ReturnValue) == 0x00004C, "Member 'BP_Projectile_LaserBeam_Queller_C_ExecuteUbergraph_BP_Projectile_LaserBeam_Queller::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

}

