#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Projectile_Rocket_GDFScrambler

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Tempest_structs.hpp"


namespace SDK::Params
{

// Function BP_Projectile_Rocket_GDFScrambler.BP_Projectile_Rocket_GDFScrambler_C.ExecuteUbergraph_BP_Projectile_Rocket_GDFScrambler
// 0x0048 (0x0048 - 0x0000)
struct BP_Projectile_Rocket_GDFScrambler_C_ExecuteUbergraph_BP_Projectile_Rocket_GDFScrambler final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Temp_struct_Variable;                              // 0x0008(0x0018)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ATedPawn*                               K2Node_DynamicCast_AsTed_Pawn;                     // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATedPlayerState*                        CallFunc_GetOwningPlayerState_ReturnValue;         // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ETedTeamID                                    CallFunc_GetTeamID_ReturnValue;                    // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFoWAgentHandle                        CallFunc_RevealFogOfWar_ReturnValue;               // 0x0044(0x0004)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Projectile_Rocket_GDFScrambler_C_ExecuteUbergraph_BP_Projectile_Rocket_GDFScrambler) == 0x000008, "Wrong alignment on BP_Projectile_Rocket_GDFScrambler_C_ExecuteUbergraph_BP_Projectile_Rocket_GDFScrambler");
static_assert(sizeof(BP_Projectile_Rocket_GDFScrambler_C_ExecuteUbergraph_BP_Projectile_Rocket_GDFScrambler) == 0x000048, "Wrong size on BP_Projectile_Rocket_GDFScrambler_C_ExecuteUbergraph_BP_Projectile_Rocket_GDFScrambler");
static_assert(offsetof(BP_Projectile_Rocket_GDFScrambler_C_ExecuteUbergraph_BP_Projectile_Rocket_GDFScrambler, EntryPoint) == 0x000000, "Member 'BP_Projectile_Rocket_GDFScrambler_C_ExecuteUbergraph_BP_Projectile_Rocket_GDFScrambler::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Rocket_GDFScrambler_C_ExecuteUbergraph_BP_Projectile_Rocket_GDFScrambler, Temp_struct_Variable) == 0x000008, "Member 'BP_Projectile_Rocket_GDFScrambler_C_ExecuteUbergraph_BP_Projectile_Rocket_GDFScrambler::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Rocket_GDFScrambler_C_ExecuteUbergraph_BP_Projectile_Rocket_GDFScrambler, CallFunc_GetOwner_ReturnValue) == 0x000020, "Member 'BP_Projectile_Rocket_GDFScrambler_C_ExecuteUbergraph_BP_Projectile_Rocket_GDFScrambler::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Rocket_GDFScrambler_C_ExecuteUbergraph_BP_Projectile_Rocket_GDFScrambler, K2Node_DynamicCast_AsTed_Pawn) == 0x000028, "Member 'BP_Projectile_Rocket_GDFScrambler_C_ExecuteUbergraph_BP_Projectile_Rocket_GDFScrambler::K2Node_DynamicCast_AsTed_Pawn' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Rocket_GDFScrambler_C_ExecuteUbergraph_BP_Projectile_Rocket_GDFScrambler, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'BP_Projectile_Rocket_GDFScrambler_C_ExecuteUbergraph_BP_Projectile_Rocket_GDFScrambler::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Rocket_GDFScrambler_C_ExecuteUbergraph_BP_Projectile_Rocket_GDFScrambler, CallFunc_GetOwningPlayerState_ReturnValue) == 0x000038, "Member 'BP_Projectile_Rocket_GDFScrambler_C_ExecuteUbergraph_BP_Projectile_Rocket_GDFScrambler::CallFunc_GetOwningPlayerState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Rocket_GDFScrambler_C_ExecuteUbergraph_BP_Projectile_Rocket_GDFScrambler, CallFunc_GetTeamID_ReturnValue) == 0x000040, "Member 'BP_Projectile_Rocket_GDFScrambler_C_ExecuteUbergraph_BP_Projectile_Rocket_GDFScrambler::CallFunc_GetTeamID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Rocket_GDFScrambler_C_ExecuteUbergraph_BP_Projectile_Rocket_GDFScrambler, CallFunc_RevealFogOfWar_ReturnValue) == 0x000044, "Member 'BP_Projectile_Rocket_GDFScrambler_C_ExecuteUbergraph_BP_Projectile_Rocket_GDFScrambler::CallFunc_RevealFogOfWar_ReturnValue' has a wrong offset!");

}

