#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_RallyPoint

#include "Basic.hpp"

#include "Tempest_structs.hpp"


namespace SDK::Params
{

// Function BP_RallyPoint.BP_RallyPoint_C.ExecuteUbergraph_BP_RallyPoint
// 0x0020 (0x0020 - 0x0000)
struct BP_RallyPoint_C_ExecuteUbergraph_BP_RallyPoint final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue_1;              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue_2;              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue_3;              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ATedPlayerController*                   K2Node_DynamicCast_AsTed_Player_Controller;        // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETedFaction                                   CallFunc_GetPlayerFaction_ReturnValue;             // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_RallyPoint_C_ExecuteUbergraph_BP_RallyPoint) == 0x000008, "Wrong alignment on BP_RallyPoint_C_ExecuteUbergraph_BP_RallyPoint");
static_assert(sizeof(BP_RallyPoint_C_ExecuteUbergraph_BP_RallyPoint) == 0x000020, "Wrong size on BP_RallyPoint_C_ExecuteUbergraph_BP_RallyPoint");
static_assert(offsetof(BP_RallyPoint_C_ExecuteUbergraph_BP_RallyPoint, EntryPoint) == 0x000000, "Member 'BP_RallyPoint_C_ExecuteUbergraph_BP_RallyPoint::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_RallyPoint_C_ExecuteUbergraph_BP_RallyPoint, CallFunc_SetStaticMesh_ReturnValue) == 0x000004, "Member 'BP_RallyPoint_C_ExecuteUbergraph_BP_RallyPoint::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RallyPoint_C_ExecuteUbergraph_BP_RallyPoint, CallFunc_SetStaticMesh_ReturnValue_1) == 0x000005, "Member 'BP_RallyPoint_C_ExecuteUbergraph_BP_RallyPoint::CallFunc_SetStaticMesh_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_RallyPoint_C_ExecuteUbergraph_BP_RallyPoint, CallFunc_SetStaticMesh_ReturnValue_2) == 0x000006, "Member 'BP_RallyPoint_C_ExecuteUbergraph_BP_RallyPoint::CallFunc_SetStaticMesh_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_RallyPoint_C_ExecuteUbergraph_BP_RallyPoint, CallFunc_SetStaticMesh_ReturnValue_3) == 0x000007, "Member 'BP_RallyPoint_C_ExecuteUbergraph_BP_RallyPoint::CallFunc_SetStaticMesh_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_RallyPoint_C_ExecuteUbergraph_BP_RallyPoint, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'BP_RallyPoint_C_ExecuteUbergraph_BP_RallyPoint::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RallyPoint_C_ExecuteUbergraph_BP_RallyPoint, K2Node_DynamicCast_AsTed_Player_Controller) == 0x000010, "Member 'BP_RallyPoint_C_ExecuteUbergraph_BP_RallyPoint::K2Node_DynamicCast_AsTed_Player_Controller' has a wrong offset!");
static_assert(offsetof(BP_RallyPoint_C_ExecuteUbergraph_BP_RallyPoint, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_RallyPoint_C_ExecuteUbergraph_BP_RallyPoint::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_RallyPoint_C_ExecuteUbergraph_BP_RallyPoint, CallFunc_GetPlayerFaction_ReturnValue) == 0x000019, "Member 'BP_RallyPoint_C_ExecuteUbergraph_BP_RallyPoint::CallFunc_GetPlayerFaction_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RallyPoint_C_ExecuteUbergraph_BP_RallyPoint, K2Node_SwitchEnum_CmpSuccess) == 0x00001A, "Member 'BP_RallyPoint_C_ExecuteUbergraph_BP_RallyPoint::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

}

