#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TempestFieldAmbience

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_TempestFieldAmbience.BP_TempestFieldAmbience_C.ExecuteUbergraph_BP_TempestFieldAmbience
// 0x04D0 (0x04D0 - 0x0000)
struct BP_TempestFieldAmbience_C_ExecuteUbergraph_BP_TempestFieldAmbience final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorBounds_Origin;                    // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorBounds_BoxExtent;                 // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetCameraLocation_ReturnValue;            // 0x0050(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_1;                          // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_1;                          // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_1;                          // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_1;      // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F8[0x8];                                       // 0x00F8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_Conv_VectorToTransform_ReturnValue;       // 0x0100(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0160(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16C[0x4];                                      // 0x016C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_TempestFieldAmbienceActor_C*        CallFunc_FinishSpawningActor_ReturnValue;          // 0x0170(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x0178(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_271[0x7];                                      // 0x0271(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0278(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_2;                          // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_2;                          // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_2;                          // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue;           // 0x02A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x02C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_3;                          // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_3;                          // 0x02E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_3;                          // 0x02E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue_1;     // 0x02F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0300(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_301[0x7];                                      // 0x0301(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetCameraLocation_ReturnValue_1;          // 0x0308(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Vector_Distance_ReturnValue;              // 0x0320(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_3;      // 0x0328(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0330(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0348(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_349[0x7];                                      // 0x0349(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0350(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_4;                          // 0x0368(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_4;                          // 0x0370(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_4;                          // 0x0378(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0380(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0381(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_1;          // 0x0382(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_2;          // 0x0383(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0384(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_385[0x3];                                      // 0x0385(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0388(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0398(0x0008)(NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x03A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue_1;                     // 0x03A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x03B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult_1;     // 0x03C8(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue_1;        // 0x04C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_VectorVector_ReturnValue;        // 0x04C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TempestFieldAmbience_C_ExecuteUbergraph_BP_TempestFieldAmbience) == 0x000010, "Wrong alignment on BP_TempestFieldAmbience_C_ExecuteUbergraph_BP_TempestFieldAmbience");
static_assert(sizeof(BP_TempestFieldAmbience_C_ExecuteUbergraph_BP_TempestFieldAmbience) == 0x0004D0, "Wrong size on BP_TempestFieldAmbience_C_ExecuteUbergraph_BP_TempestFieldAmbience");
static_assert(offsetof(BP_TempestFieldAmbience_C_ExecuteUbergraph_BP_TempestFieldAmbience, EntryPoint) == 0x000000, "Member 'BP_TempestFieldAmbience_C_ExecuteUbergraph_BP_TempestFieldAmbience::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_TempestFieldAmbience_C_ExecuteUbergraph_BP_TempestFieldAmbience, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'BP_TempestFieldAmbience_C_ExecuteUbergraph_BP_TempestFieldAmbience::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TempestFieldAmbience_C_ExecuteUbergraph_BP_TempestFieldAmbience, CallFunc_GetOwner_ReturnValue_1) == 0x000010, "Member 'BP_TempestFieldAmbience_C_ExecuteUbergraph_BP_TempestFieldAmbience::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TempestFieldAmbience_C_ExecuteUbergraph_BP_TempestFieldAmbience, CallFunc_GetPlayerCameraManager_ReturnValue) == 0x000018, "Member 'BP_TempestFieldAmbience_C_ExecuteUbergraph_BP_TempestFieldAmbience::CallFunc_GetPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TempestFieldAmbience_C_ExecuteUbergraph_BP_TempestFieldAmbience, CallFunc_GetActorBounds_Origin) == 0x000020, "Member 'BP_TempestFieldAmbience_C_ExecuteUbergraph_BP_TempestFieldAmbience::CallFunc_GetActorBounds_Origin' has a wrong offset!");
static_assert(offsetof(BP_TempestFieldAmbience_C_ExecuteUbergraph_BP_TempestFieldAmbience, CallFunc_GetActorBounds_BoxExtent) == 0x000038, "Member 'BP_TempestFieldAmbience_C_ExecuteUbergraph_BP_TempestFieldAmbience::CallFunc_GetActorBounds_BoxExtent' has a wrong offset!");
static_assert(offsetof(BP_TempestFieldAmbience_C_ExecuteUbergraph_BP_TempestFieldAmbience, CallFunc_GetCameraLocation_ReturnValue) == 0x000050, "Member 'BP_TempestFieldAmbience_C_ExecuteUbergraph_BP_TempestFieldAmbience::CallFunc_GetCameraLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TempestFieldAmbience_C_ExecuteUbergraph_BP_TempestFieldAmbience, CallFunc_BreakVector_X) == 0x000068, "Member 'BP_TempestFieldAmbience_C_ExecuteUbergraph_BP_TempestFieldAmbience::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_TempestFieldAmbience_C_ExecuteUbergraph_BP_TempestFieldAmbience, CallFunc_BreakVector_Y) == 0x000070, "Member 'BP_TempestFieldAmbience_C_ExecuteUbergraph_BP_TempestFieldAmbience::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_TempestFieldAmbience_C_ExecuteUbergraph_BP_TempestFieldAmbience, CallFunc_BreakVector_Z) == 0x000078, "Member 'BP_TempestFieldAmbience_C_ExecuteUbergraph_BP_TempestFieldAmbience::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_TempestFieldAmbience_C_ExecuteUbergraph_BP_TempestFieldAmbience, CallFunc_BreakVector_X_1) == 0x000080, "Member 'BP_TempestFieldAmbience_C_ExecuteUbergraph_BP_TempestFieldAmbience::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(BP_TempestFieldAmbience_C_ExecuteUbergraph_BP_TempestFieldAmbience, CallFunc_BreakVector_Y_1) == 0x000088, "Member 'BP_TempestFieldAmbience_C_ExecuteUbergraph_BP_TempestFieldAmbience::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(BP_TempestFieldAmbience_C_ExecuteUbergraph_BP_TempestFieldAmbience, CallFunc_BreakVector_Z_1) == 0x000090, "Member 'BP_TempestFieldAmbience_C_ExecuteUbergraph_BP_TempestFieldAmbience::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(BP_TempestFieldAmbience_C_ExecuteUbergraph_BP_TempestFieldAmbience, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000098, "Member 'BP_TempestFieldAmbience_C_ExecuteUbergraph_BP_TempestFieldAmbience::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TempestFieldAmbience_C_ExecuteUbergraph_BP_TempestFieldAmbience, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x0000A0, "Member 'BP_TempestFieldAmbience_C_ExecuteUbergraph_BP_TempestFieldAmbience::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TempestFieldAmbience_C_ExecuteUbergraph_BP_TempestFieldAmbience, CallFunc_Add_DoubleDouble_ReturnValue) == 0x0000A8, "Member 'BP_TempestFieldAmbience_C_ExecuteUbergraph_BP_TempestFieldAmbience::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TempestFieldAmbience_C_ExecuteUbergraph_BP_TempestFieldAmbience, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x0000B0, "Member 'BP_TempestFieldAmbience_C_ExecuteUbergraph_BP_TempestFieldAmbience::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TempestFieldAmbience_C_ExecuteUbergraph_BP_TempestFieldAmbience, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x0000B8, "Member 'BP_TempestFieldAmbience_C_ExecuteUbergraph_BP_TempestFieldAmbience::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TempestFieldAmbience_C_ExecuteUbergraph_BP_TempestFieldAmbience, CallFunc_Divide_DoubleDouble_ReturnValue_1) == 0x0000C0, "Member 'BP_TempestFieldAmbience_C_ExecuteUbergraph_BP_TempestFieldAmbience::CallFunc_Divide_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TempestFieldAmbience_C_ExecuteUbergraph_BP_TempestFieldAmbience, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x0000C8, "Member 'BP_TempestFieldAmbience_C_ExecuteUbergraph_BP_TempestFieldAmbience::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TempestFieldAmbience_C_ExecuteUbergraph_BP_TempestFieldAmbience, CallFunc_Add_DoubleDouble_ReturnValue_1) == 0x0000D0, "Member 'BP_TempestFieldAmbience_C_ExecuteUbergraph_BP_TempestFieldAmbience::CallFunc_Add_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TempestFieldAmbience_C_ExecuteUbergraph_BP_TempestFieldAmbience, CallFunc_Subtract_DoubleDouble_ReturnValue_1) == 0x0000D8, "Member 'BP_TempestFieldAmbience_C_ExecuteUbergraph_BP_TempestFieldAmbience::CallFunc_Subtract_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TempestFieldAmbience_C_ExecuteUbergraph_BP_TempestFieldAmbience, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0000E0, "Member 'BP_TempestFieldAmbience_C_ExecuteUbergraph_BP_TempestFieldAmbience::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TempestFieldAmbience_C_ExecuteUbergraph_BP_TempestFieldAmbience, CallFunc_Conv_VectorToTransform_ReturnValue) == 0x000100, "Member 'BP_TempestFieldAmbience_C_ExecuteUbergraph_BP_TempestFieldAmbience::CallFunc_Conv_VectorToTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TempestFieldAmbience_C_ExecuteUbergraph_BP_TempestFieldAmbience, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000160, "Member 'BP_TempestFieldAmbience_C_ExecuteUbergraph_BP_TempestFieldAmbience::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TempestFieldAmbience_C_ExecuteUbergraph_BP_TempestFieldAmbience, K2Node_Event_DeltaSeconds) == 0x000168, "Member 'BP_TempestFieldAmbience_C_ExecuteUbergraph_BP_TempestFieldAmbience::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_TempestFieldAmbience_C_ExecuteUbergraph_BP_TempestFieldAmbience, CallFunc_FinishSpawningActor_ReturnValue) == 0x000170, "Member 'BP_TempestFieldAmbience_C_ExecuteUbergraph_BP_TempestFieldAmbience::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TempestFieldAmbience_C_ExecuteUbergraph_BP_TempestFieldAmbience, CallFunc_K2_SetActorLocation_SweepHitResult) == 0x000178, "Member 'BP_TempestFieldAmbience_C_ExecuteUbergraph_BP_TempestFieldAmbience::CallFunc_K2_SetActorLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_TempestFieldAmbience_C_ExecuteUbergraph_BP_TempestFieldAmbience, CallFunc_K2_SetActorLocation_ReturnValue) == 0x000270, "Member 'BP_TempestFieldAmbience_C_ExecuteUbergraph_BP_TempestFieldAmbience::CallFunc_K2_SetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TempestFieldAmbience_C_ExecuteUbergraph_BP_TempestFieldAmbience, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000278, "Member 'BP_TempestFieldAmbience_C_ExecuteUbergraph_BP_TempestFieldAmbience::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TempestFieldAmbience_C_ExecuteUbergraph_BP_TempestFieldAmbience, CallFunc_BreakVector_X_2) == 0x000290, "Member 'BP_TempestFieldAmbience_C_ExecuteUbergraph_BP_TempestFieldAmbience::CallFunc_BreakVector_X_2' has a wrong offset!");
static_assert(offsetof(BP_TempestFieldAmbience_C_ExecuteUbergraph_BP_TempestFieldAmbience, CallFunc_BreakVector_Y_2) == 0x000298, "Member 'BP_TempestFieldAmbience_C_ExecuteUbergraph_BP_TempestFieldAmbience::CallFunc_BreakVector_Y_2' has a wrong offset!");
static_assert(offsetof(BP_TempestFieldAmbience_C_ExecuteUbergraph_BP_TempestFieldAmbience, CallFunc_BreakVector_Z_2) == 0x0002A0, "Member 'BP_TempestFieldAmbience_C_ExecuteUbergraph_BP_TempestFieldAmbience::CallFunc_BreakVector_Z_2' has a wrong offset!");
static_assert(offsetof(BP_TempestFieldAmbience_C_ExecuteUbergraph_BP_TempestFieldAmbience, CallFunc_FindLookAtRotation_ReturnValue) == 0x0002A8, "Member 'BP_TempestFieldAmbience_C_ExecuteUbergraph_BP_TempestFieldAmbience::CallFunc_FindLookAtRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TempestFieldAmbience_C_ExecuteUbergraph_BP_TempestFieldAmbience, CallFunc_GetForwardVector_ReturnValue) == 0x0002C0, "Member 'BP_TempestFieldAmbience_C_ExecuteUbergraph_BP_TempestFieldAmbience::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TempestFieldAmbience_C_ExecuteUbergraph_BP_TempestFieldAmbience, CallFunc_BreakVector_X_3) == 0x0002D8, "Member 'BP_TempestFieldAmbience_C_ExecuteUbergraph_BP_TempestFieldAmbience::CallFunc_BreakVector_X_3' has a wrong offset!");
static_assert(offsetof(BP_TempestFieldAmbience_C_ExecuteUbergraph_BP_TempestFieldAmbience, CallFunc_BreakVector_Y_3) == 0x0002E0, "Member 'BP_TempestFieldAmbience_C_ExecuteUbergraph_BP_TempestFieldAmbience::CallFunc_BreakVector_Y_3' has a wrong offset!");
static_assert(offsetof(BP_TempestFieldAmbience_C_ExecuteUbergraph_BP_TempestFieldAmbience, CallFunc_BreakVector_Z_3) == 0x0002E8, "Member 'BP_TempestFieldAmbience_C_ExecuteUbergraph_BP_TempestFieldAmbience::CallFunc_BreakVector_Z_3' has a wrong offset!");
static_assert(offsetof(BP_TempestFieldAmbience_C_ExecuteUbergraph_BP_TempestFieldAmbience, CallFunc_GetPlayerCameraManager_ReturnValue_1) == 0x0002F0, "Member 'BP_TempestFieldAmbience_C_ExecuteUbergraph_BP_TempestFieldAmbience::CallFunc_GetPlayerCameraManager_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TempestFieldAmbience_C_ExecuteUbergraph_BP_TempestFieldAmbience, CallFunc_Multiply_DoubleDouble_ReturnValue_2) == 0x0002F8, "Member 'BP_TempestFieldAmbience_C_ExecuteUbergraph_BP_TempestFieldAmbience::CallFunc_Multiply_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_TempestFieldAmbience_C_ExecuteUbergraph_BP_TempestFieldAmbience, CallFunc_IsValid_ReturnValue) == 0x000300, "Member 'BP_TempestFieldAmbience_C_ExecuteUbergraph_BP_TempestFieldAmbience::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TempestFieldAmbience_C_ExecuteUbergraph_BP_TempestFieldAmbience, CallFunc_GetCameraLocation_ReturnValue_1) == 0x000308, "Member 'BP_TempestFieldAmbience_C_ExecuteUbergraph_BP_TempestFieldAmbience::CallFunc_GetCameraLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TempestFieldAmbience_C_ExecuteUbergraph_BP_TempestFieldAmbience, CallFunc_Vector_Distance_ReturnValue) == 0x000320, "Member 'BP_TempestFieldAmbience_C_ExecuteUbergraph_BP_TempestFieldAmbience::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TempestFieldAmbience_C_ExecuteUbergraph_BP_TempestFieldAmbience, CallFunc_Multiply_DoubleDouble_ReturnValue_3) == 0x000328, "Member 'BP_TempestFieldAmbience_C_ExecuteUbergraph_BP_TempestFieldAmbience::CallFunc_Multiply_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_TempestFieldAmbience_C_ExecuteUbergraph_BP_TempestFieldAmbience, CallFunc_MakeVector_ReturnValue) == 0x000330, "Member 'BP_TempestFieldAmbience_C_ExecuteUbergraph_BP_TempestFieldAmbience::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TempestFieldAmbience_C_ExecuteUbergraph_BP_TempestFieldAmbience, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000348, "Member 'BP_TempestFieldAmbience_C_ExecuteUbergraph_BP_TempestFieldAmbience::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TempestFieldAmbience_C_ExecuteUbergraph_BP_TempestFieldAmbience, CallFunc_Add_VectorVector_ReturnValue) == 0x000350, "Member 'BP_TempestFieldAmbience_C_ExecuteUbergraph_BP_TempestFieldAmbience::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TempestFieldAmbience_C_ExecuteUbergraph_BP_TempestFieldAmbience, CallFunc_BreakVector_X_4) == 0x000368, "Member 'BP_TempestFieldAmbience_C_ExecuteUbergraph_BP_TempestFieldAmbience::CallFunc_BreakVector_X_4' has a wrong offset!");
static_assert(offsetof(BP_TempestFieldAmbience_C_ExecuteUbergraph_BP_TempestFieldAmbience, CallFunc_BreakVector_Y_4) == 0x000370, "Member 'BP_TempestFieldAmbience_C_ExecuteUbergraph_BP_TempestFieldAmbience::CallFunc_BreakVector_Y_4' has a wrong offset!");
static_assert(offsetof(BP_TempestFieldAmbience_C_ExecuteUbergraph_BP_TempestFieldAmbience, CallFunc_BreakVector_Z_4) == 0x000378, "Member 'BP_TempestFieldAmbience_C_ExecuteUbergraph_BP_TempestFieldAmbience::CallFunc_BreakVector_Z_4' has a wrong offset!");
static_assert(offsetof(BP_TempestFieldAmbience_C_ExecuteUbergraph_BP_TempestFieldAmbience, Temp_bool_Has_Been_Initd_Variable) == 0x000380, "Member 'BP_TempestFieldAmbience_C_ExecuteUbergraph_BP_TempestFieldAmbience::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_TempestFieldAmbience_C_ExecuteUbergraph_BP_TempestFieldAmbience, CallFunc_IsDedicatedServer_ReturnValue) == 0x000381, "Member 'BP_TempestFieldAmbience_C_ExecuteUbergraph_BP_TempestFieldAmbience::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TempestFieldAmbience_C_ExecuteUbergraph_BP_TempestFieldAmbience, CallFunc_IsDedicatedServer_ReturnValue_1) == 0x000382, "Member 'BP_TempestFieldAmbience_C_ExecuteUbergraph_BP_TempestFieldAmbience::CallFunc_IsDedicatedServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TempestFieldAmbience_C_ExecuteUbergraph_BP_TempestFieldAmbience, CallFunc_IsDedicatedServer_ReturnValue_2) == 0x000383, "Member 'BP_TempestFieldAmbience_C_ExecuteUbergraph_BP_TempestFieldAmbience::CallFunc_IsDedicatedServer_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_TempestFieldAmbience_C_ExecuteUbergraph_BP_TempestFieldAmbience, Temp_bool_IsClosed_Variable) == 0x000384, "Member 'BP_TempestFieldAmbience_C_ExecuteUbergraph_BP_TempestFieldAmbience::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_TempestFieldAmbience_C_ExecuteUbergraph_BP_TempestFieldAmbience, K2Node_CreateDelegate_OutputDelegate) == 0x000388, "Member 'BP_TempestFieldAmbience_C_ExecuteUbergraph_BP_TempestFieldAmbience::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_TempestFieldAmbience_C_ExecuteUbergraph_BP_TempestFieldAmbience, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000398, "Member 'BP_TempestFieldAmbience_C_ExecuteUbergraph_BP_TempestFieldAmbience::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TempestFieldAmbience_C_ExecuteUbergraph_BP_TempestFieldAmbience, CallFunc_FClamp_ReturnValue) == 0x0003A0, "Member 'BP_TempestFieldAmbience_C_ExecuteUbergraph_BP_TempestFieldAmbience::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TempestFieldAmbience_C_ExecuteUbergraph_BP_TempestFieldAmbience, CallFunc_FClamp_ReturnValue_1) == 0x0003A8, "Member 'BP_TempestFieldAmbience_C_ExecuteUbergraph_BP_TempestFieldAmbience::CallFunc_FClamp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TempestFieldAmbience_C_ExecuteUbergraph_BP_TempestFieldAmbience, CallFunc_MakeVector_ReturnValue_1) == 0x0003B0, "Member 'BP_TempestFieldAmbience_C_ExecuteUbergraph_BP_TempestFieldAmbience::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TempestFieldAmbience_C_ExecuteUbergraph_BP_TempestFieldAmbience, CallFunc_K2_SetActorLocation_SweepHitResult_1) == 0x0003C8, "Member 'BP_TempestFieldAmbience_C_ExecuteUbergraph_BP_TempestFieldAmbience::CallFunc_K2_SetActorLocation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(BP_TempestFieldAmbience_C_ExecuteUbergraph_BP_TempestFieldAmbience, CallFunc_K2_SetActorLocation_ReturnValue_1) == 0x0004C0, "Member 'BP_TempestFieldAmbience_C_ExecuteUbergraph_BP_TempestFieldAmbience::CallFunc_K2_SetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TempestFieldAmbience_C_ExecuteUbergraph_BP_TempestFieldAmbience, CallFunc_NotEqual_VectorVector_ReturnValue) == 0x0004C1, "Member 'BP_TempestFieldAmbience_C_ExecuteUbergraph_BP_TempestFieldAmbience::CallFunc_NotEqual_VectorVector_ReturnValue' has a wrong offset!");

// Function BP_TempestFieldAmbience.BP_TempestFieldAmbience_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_TempestFieldAmbience_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TempestFieldAmbience_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_TempestFieldAmbience_C_ReceiveTick");
static_assert(sizeof(BP_TempestFieldAmbience_C_ReceiveTick) == 0x000004, "Wrong size on BP_TempestFieldAmbience_C_ReceiveTick");
static_assert(offsetof(BP_TempestFieldAmbience_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_TempestFieldAmbience_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

