#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TempestFieldAmbienceActor

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_TempestFieldAmbienceActor.BP_TempestFieldAmbienceActor_C.ExecuteUbergraph_BP_TempestFieldAmbienceActor
// 0x0108 (0x0108 - 0x0000)
struct BP_TempestFieldAmbienceActor_C_ExecuteUbergraph_BP_TempestFieldAmbienceActor final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_DoubleToString_ReturnValue;          // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_DoubleToString_ReturnValue_1;        // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_DoubleToString_ReturnValue_2;        // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATempestFieldVolume*                    K2Node_DynamicCast_AsTempest_Field_Volume;         // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7A[0x2];                                       // 0x007A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetVisibleResourcePct_ReturnValue;        // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_DoubleToString_ReturnValue_3;        // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x0090(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_DoubleDouble_ReturnValue;        // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_DoubleDouble_ReturnValue_1;      // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_DoubleDouble_ReturnValue_2;      // 0x00A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A3[0x5];                                       // 0x00A3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Lerp_ReturnValue;                         // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue_1;                       // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue_2;                       // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlaying_ReturnValue;                    // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlaying_ReturnValue_1;                  // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x00C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlaying_ReturnValue_2;                  // 0x00C3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00C5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C6[0x2];                                       // 0x00C6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Lerp_Alpha_ImplicitCast;                  // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetFloatParameter_InFloat_ImplicitCast;   // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Lerp_Alpha_ImplicitCast_1;                // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetFloatParameter_InFloat_ImplicitCast_1; // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Lerp_Alpha_ImplicitCast_2;                // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetFloatParameter_InFloat_ImplicitCast_2; // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F4[0x4];                                       // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_DoubleToString_InDouble_ImplicitCast; // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_UpdateTargetLayerValues_ResourcePct_ImplicitCast; // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TempestFieldAmbienceActor_C_ExecuteUbergraph_BP_TempestFieldAmbienceActor) == 0x000008, "Wrong alignment on BP_TempestFieldAmbienceActor_C_ExecuteUbergraph_BP_TempestFieldAmbienceActor");
static_assert(sizeof(BP_TempestFieldAmbienceActor_C_ExecuteUbergraph_BP_TempestFieldAmbienceActor) == 0x000108, "Wrong size on BP_TempestFieldAmbienceActor_C_ExecuteUbergraph_BP_TempestFieldAmbienceActor");
static_assert(offsetof(BP_TempestFieldAmbienceActor_C_ExecuteUbergraph_BP_TempestFieldAmbienceActor, EntryPoint) == 0x000000, "Member 'BP_TempestFieldAmbienceActor_C_ExecuteUbergraph_BP_TempestFieldAmbienceActor::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_TempestFieldAmbienceActor_C_ExecuteUbergraph_BP_TempestFieldAmbienceActor, CallFunc_Conv_DoubleToString_ReturnValue) == 0x000008, "Member 'BP_TempestFieldAmbienceActor_C_ExecuteUbergraph_BP_TempestFieldAmbienceActor::CallFunc_Conv_DoubleToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TempestFieldAmbienceActor_C_ExecuteUbergraph_BP_TempestFieldAmbienceActor, CallFunc_Concat_StrStr_ReturnValue) == 0x000018, "Member 'BP_TempestFieldAmbienceActor_C_ExecuteUbergraph_BP_TempestFieldAmbienceActor::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TempestFieldAmbienceActor_C_ExecuteUbergraph_BP_TempestFieldAmbienceActor, CallFunc_Conv_DoubleToString_ReturnValue_1) == 0x000028, "Member 'BP_TempestFieldAmbienceActor_C_ExecuteUbergraph_BP_TempestFieldAmbienceActor::CallFunc_Conv_DoubleToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TempestFieldAmbienceActor_C_ExecuteUbergraph_BP_TempestFieldAmbienceActor, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000038, "Member 'BP_TempestFieldAmbienceActor_C_ExecuteUbergraph_BP_TempestFieldAmbienceActor::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TempestFieldAmbienceActor_C_ExecuteUbergraph_BP_TempestFieldAmbienceActor, CallFunc_Conv_DoubleToString_ReturnValue_2) == 0x000048, "Member 'BP_TempestFieldAmbienceActor_C_ExecuteUbergraph_BP_TempestFieldAmbienceActor::CallFunc_Conv_DoubleToString_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_TempestFieldAmbienceActor_C_ExecuteUbergraph_BP_TempestFieldAmbienceActor, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000058, "Member 'BP_TempestFieldAmbienceActor_C_ExecuteUbergraph_BP_TempestFieldAmbienceActor::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_TempestFieldAmbienceActor_C_ExecuteUbergraph_BP_TempestFieldAmbienceActor, K2Node_Event_DeltaSeconds) == 0x000068, "Member 'BP_TempestFieldAmbienceActor_C_ExecuteUbergraph_BP_TempestFieldAmbienceActor::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_TempestFieldAmbienceActor_C_ExecuteUbergraph_BP_TempestFieldAmbienceActor, K2Node_DynamicCast_AsTempest_Field_Volume) == 0x000070, "Member 'BP_TempestFieldAmbienceActor_C_ExecuteUbergraph_BP_TempestFieldAmbienceActor::K2Node_DynamicCast_AsTempest_Field_Volume' has a wrong offset!");
static_assert(offsetof(BP_TempestFieldAmbienceActor_C_ExecuteUbergraph_BP_TempestFieldAmbienceActor, K2Node_DynamicCast_bSuccess) == 0x000078, "Member 'BP_TempestFieldAmbienceActor_C_ExecuteUbergraph_BP_TempestFieldAmbienceActor::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_TempestFieldAmbienceActor_C_ExecuteUbergraph_BP_TempestFieldAmbienceActor, CallFunc_IsValid_ReturnValue) == 0x000079, "Member 'BP_TempestFieldAmbienceActor_C_ExecuteUbergraph_BP_TempestFieldAmbienceActor::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TempestFieldAmbienceActor_C_ExecuteUbergraph_BP_TempestFieldAmbienceActor, CallFunc_GetVisibleResourcePct_ReturnValue) == 0x00007C, "Member 'BP_TempestFieldAmbienceActor_C_ExecuteUbergraph_BP_TempestFieldAmbienceActor::CallFunc_GetVisibleResourcePct_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TempestFieldAmbienceActor_C_ExecuteUbergraph_BP_TempestFieldAmbienceActor, CallFunc_Conv_DoubleToString_ReturnValue_3) == 0x000080, "Member 'BP_TempestFieldAmbienceActor_C_ExecuteUbergraph_BP_TempestFieldAmbienceActor::CallFunc_Conv_DoubleToString_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_TempestFieldAmbienceActor_C_ExecuteUbergraph_BP_TempestFieldAmbienceActor, CallFunc_Concat_StrStr_ReturnValue_3) == 0x000090, "Member 'BP_TempestFieldAmbienceActor_C_ExecuteUbergraph_BP_TempestFieldAmbienceActor::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_TempestFieldAmbienceActor_C_ExecuteUbergraph_BP_TempestFieldAmbienceActor, CallFunc_NotEqual_DoubleDouble_ReturnValue) == 0x0000A0, "Member 'BP_TempestFieldAmbienceActor_C_ExecuteUbergraph_BP_TempestFieldAmbienceActor::CallFunc_NotEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TempestFieldAmbienceActor_C_ExecuteUbergraph_BP_TempestFieldAmbienceActor, CallFunc_NotEqual_DoubleDouble_ReturnValue_1) == 0x0000A1, "Member 'BP_TempestFieldAmbienceActor_C_ExecuteUbergraph_BP_TempestFieldAmbienceActor::CallFunc_NotEqual_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TempestFieldAmbienceActor_C_ExecuteUbergraph_BP_TempestFieldAmbienceActor, CallFunc_NotEqual_DoubleDouble_ReturnValue_2) == 0x0000A2, "Member 'BP_TempestFieldAmbienceActor_C_ExecuteUbergraph_BP_TempestFieldAmbienceActor::CallFunc_NotEqual_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_TempestFieldAmbienceActor_C_ExecuteUbergraph_BP_TempestFieldAmbienceActor, CallFunc_Lerp_ReturnValue) == 0x0000A8, "Member 'BP_TempestFieldAmbienceActor_C_ExecuteUbergraph_BP_TempestFieldAmbienceActor::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TempestFieldAmbienceActor_C_ExecuteUbergraph_BP_TempestFieldAmbienceActor, CallFunc_Lerp_ReturnValue_1) == 0x0000B0, "Member 'BP_TempestFieldAmbienceActor_C_ExecuteUbergraph_BP_TempestFieldAmbienceActor::CallFunc_Lerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TempestFieldAmbienceActor_C_ExecuteUbergraph_BP_TempestFieldAmbienceActor, CallFunc_Lerp_ReturnValue_2) == 0x0000B8, "Member 'BP_TempestFieldAmbienceActor_C_ExecuteUbergraph_BP_TempestFieldAmbienceActor::CallFunc_Lerp_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_TempestFieldAmbienceActor_C_ExecuteUbergraph_BP_TempestFieldAmbienceActor, CallFunc_IsPlaying_ReturnValue) == 0x0000C0, "Member 'BP_TempestFieldAmbienceActor_C_ExecuteUbergraph_BP_TempestFieldAmbienceActor::CallFunc_IsPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TempestFieldAmbienceActor_C_ExecuteUbergraph_BP_TempestFieldAmbienceActor, CallFunc_IsPlaying_ReturnValue_1) == 0x0000C1, "Member 'BP_TempestFieldAmbienceActor_C_ExecuteUbergraph_BP_TempestFieldAmbienceActor::CallFunc_IsPlaying_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TempestFieldAmbienceActor_C_ExecuteUbergraph_BP_TempestFieldAmbienceActor, CallFunc_BooleanOR_ReturnValue) == 0x0000C2, "Member 'BP_TempestFieldAmbienceActor_C_ExecuteUbergraph_BP_TempestFieldAmbienceActor::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TempestFieldAmbienceActor_C_ExecuteUbergraph_BP_TempestFieldAmbienceActor, CallFunc_IsPlaying_ReturnValue_2) == 0x0000C3, "Member 'BP_TempestFieldAmbienceActor_C_ExecuteUbergraph_BP_TempestFieldAmbienceActor::CallFunc_IsPlaying_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_TempestFieldAmbienceActor_C_ExecuteUbergraph_BP_TempestFieldAmbienceActor, CallFunc_BooleanOR_ReturnValue_1) == 0x0000C4, "Member 'BP_TempestFieldAmbienceActor_C_ExecuteUbergraph_BP_TempestFieldAmbienceActor::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TempestFieldAmbienceActor_C_ExecuteUbergraph_BP_TempestFieldAmbienceActor, CallFunc_Not_PreBool_ReturnValue) == 0x0000C5, "Member 'BP_TempestFieldAmbienceActor_C_ExecuteUbergraph_BP_TempestFieldAmbienceActor::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TempestFieldAmbienceActor_C_ExecuteUbergraph_BP_TempestFieldAmbienceActor, CallFunc_Lerp_Alpha_ImplicitCast) == 0x0000C8, "Member 'BP_TempestFieldAmbienceActor_C_ExecuteUbergraph_BP_TempestFieldAmbienceActor::CallFunc_Lerp_Alpha_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_TempestFieldAmbienceActor_C_ExecuteUbergraph_BP_TempestFieldAmbienceActor, CallFunc_SetFloatParameter_InFloat_ImplicitCast) == 0x0000D0, "Member 'BP_TempestFieldAmbienceActor_C_ExecuteUbergraph_BP_TempestFieldAmbienceActor::CallFunc_SetFloatParameter_InFloat_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_TempestFieldAmbienceActor_C_ExecuteUbergraph_BP_TempestFieldAmbienceActor, CallFunc_Lerp_Alpha_ImplicitCast_1) == 0x0000D8, "Member 'BP_TempestFieldAmbienceActor_C_ExecuteUbergraph_BP_TempestFieldAmbienceActor::CallFunc_Lerp_Alpha_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_TempestFieldAmbienceActor_C_ExecuteUbergraph_BP_TempestFieldAmbienceActor, CallFunc_SetFloatParameter_InFloat_ImplicitCast_1) == 0x0000E0, "Member 'BP_TempestFieldAmbienceActor_C_ExecuteUbergraph_BP_TempestFieldAmbienceActor::CallFunc_SetFloatParameter_InFloat_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_TempestFieldAmbienceActor_C_ExecuteUbergraph_BP_TempestFieldAmbienceActor, CallFunc_Lerp_Alpha_ImplicitCast_2) == 0x0000E8, "Member 'BP_TempestFieldAmbienceActor_C_ExecuteUbergraph_BP_TempestFieldAmbienceActor::CallFunc_Lerp_Alpha_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(BP_TempestFieldAmbienceActor_C_ExecuteUbergraph_BP_TempestFieldAmbienceActor, CallFunc_SetFloatParameter_InFloat_ImplicitCast_2) == 0x0000F0, "Member 'BP_TempestFieldAmbienceActor_C_ExecuteUbergraph_BP_TempestFieldAmbienceActor::CallFunc_SetFloatParameter_InFloat_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(BP_TempestFieldAmbienceActor_C_ExecuteUbergraph_BP_TempestFieldAmbienceActor, CallFunc_Conv_DoubleToString_InDouble_ImplicitCast) == 0x0000F8, "Member 'BP_TempestFieldAmbienceActor_C_ExecuteUbergraph_BP_TempestFieldAmbienceActor::CallFunc_Conv_DoubleToString_InDouble_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_TempestFieldAmbienceActor_C_ExecuteUbergraph_BP_TempestFieldAmbienceActor, CallFunc_UpdateTargetLayerValues_ResourcePct_ImplicitCast) == 0x000100, "Member 'BP_TempestFieldAmbienceActor_C_ExecuteUbergraph_BP_TempestFieldAmbienceActor::CallFunc_UpdateTargetLayerValues_ResourcePct_ImplicitCast' has a wrong offset!");

// Function BP_TempestFieldAmbienceActor.BP_TempestFieldAmbienceActor_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_TempestFieldAmbienceActor_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TempestFieldAmbienceActor_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_TempestFieldAmbienceActor_C_ReceiveTick");
static_assert(sizeof(BP_TempestFieldAmbienceActor_C_ReceiveTick) == 0x000004, "Wrong size on BP_TempestFieldAmbienceActor_C_ReceiveTick");
static_assert(offsetof(BP_TempestFieldAmbienceActor_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_TempestFieldAmbienceActor_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_TempestFieldAmbienceActor.BP_TempestFieldAmbienceActor_C.UpdateTargetLayerValues
// 0x0078 (0x0078 - 0x0000)
struct BP_TempestFieldAmbienceActor_C_UpdateTargetLayerValues final
{
public:
	double                                        ResourcePct;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable;                                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_1;                              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_2;                              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_3;                              // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_4;                              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_1;       // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue_1;     // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_46[0x2];                                       // 0x0046(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_Select_Default;                             // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_2;       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue_2;     // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52[0x6];                                       // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_5;                              // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62[0x6];                                       // 0x0062(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_Select_Default_1;                           // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Select_Default_2;                           // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TempestFieldAmbienceActor_C_UpdateTargetLayerValues) == 0x000008, "Wrong alignment on BP_TempestFieldAmbienceActor_C_UpdateTargetLayerValues");
static_assert(sizeof(BP_TempestFieldAmbienceActor_C_UpdateTargetLayerValues) == 0x000078, "Wrong size on BP_TempestFieldAmbienceActor_C_UpdateTargetLayerValues");
static_assert(offsetof(BP_TempestFieldAmbienceActor_C_UpdateTargetLayerValues, ResourcePct) == 0x000000, "Member 'BP_TempestFieldAmbienceActor_C_UpdateTargetLayerValues::ResourcePct' has a wrong offset!");
static_assert(offsetof(BP_TempestFieldAmbienceActor_C_UpdateTargetLayerValues, Temp_real_Variable) == 0x000008, "Member 'BP_TempestFieldAmbienceActor_C_UpdateTargetLayerValues::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(BP_TempestFieldAmbienceActor_C_UpdateTargetLayerValues, Temp_bool_Variable) == 0x000010, "Member 'BP_TempestFieldAmbienceActor_C_UpdateTargetLayerValues::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_TempestFieldAmbienceActor_C_UpdateTargetLayerValues, Temp_real_Variable_1) == 0x000018, "Member 'BP_TempestFieldAmbienceActor_C_UpdateTargetLayerValues::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_TempestFieldAmbienceActor_C_UpdateTargetLayerValues, Temp_real_Variable_2) == 0x000020, "Member 'BP_TempestFieldAmbienceActor_C_UpdateTargetLayerValues::Temp_real_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_TempestFieldAmbienceActor_C_UpdateTargetLayerValues, Temp_bool_Variable_1) == 0x000028, "Member 'BP_TempestFieldAmbienceActor_C_UpdateTargetLayerValues::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_TempestFieldAmbienceActor_C_UpdateTargetLayerValues, Temp_real_Variable_3) == 0x000030, "Member 'BP_TempestFieldAmbienceActor_C_UpdateTargetLayerValues::Temp_real_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_TempestFieldAmbienceActor_C_UpdateTargetLayerValues, Temp_real_Variable_4) == 0x000038, "Member 'BP_TempestFieldAmbienceActor_C_UpdateTargetLayerValues::Temp_real_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_TempestFieldAmbienceActor_C_UpdateTargetLayerValues, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000040, "Member 'BP_TempestFieldAmbienceActor_C_UpdateTargetLayerValues::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TempestFieldAmbienceActor_C_UpdateTargetLayerValues, CallFunc_Greater_DoubleDouble_ReturnValue_1) == 0x000041, "Member 'BP_TempestFieldAmbienceActor_C_UpdateTargetLayerValues::CallFunc_Greater_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TempestFieldAmbienceActor_C_UpdateTargetLayerValues, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x000042, "Member 'BP_TempestFieldAmbienceActor_C_UpdateTargetLayerValues::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TempestFieldAmbienceActor_C_UpdateTargetLayerValues, CallFunc_LessEqual_DoubleDouble_ReturnValue_1) == 0x000043, "Member 'BP_TempestFieldAmbienceActor_C_UpdateTargetLayerValues::CallFunc_LessEqual_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TempestFieldAmbienceActor_C_UpdateTargetLayerValues, CallFunc_BooleanAND_ReturnValue) == 0x000044, "Member 'BP_TempestFieldAmbienceActor_C_UpdateTargetLayerValues::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TempestFieldAmbienceActor_C_UpdateTargetLayerValues, CallFunc_BooleanAND_ReturnValue_1) == 0x000045, "Member 'BP_TempestFieldAmbienceActor_C_UpdateTargetLayerValues::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TempestFieldAmbienceActor_C_UpdateTargetLayerValues, K2Node_Select_Default) == 0x000048, "Member 'BP_TempestFieldAmbienceActor_C_UpdateTargetLayerValues::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_TempestFieldAmbienceActor_C_UpdateTargetLayerValues, CallFunc_Greater_DoubleDouble_ReturnValue_2) == 0x000050, "Member 'BP_TempestFieldAmbienceActor_C_UpdateTargetLayerValues::CallFunc_Greater_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_TempestFieldAmbienceActor_C_UpdateTargetLayerValues, CallFunc_LessEqual_DoubleDouble_ReturnValue_2) == 0x000051, "Member 'BP_TempestFieldAmbienceActor_C_UpdateTargetLayerValues::CallFunc_LessEqual_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_TempestFieldAmbienceActor_C_UpdateTargetLayerValues, Temp_real_Variable_5) == 0x000058, "Member 'BP_TempestFieldAmbienceActor_C_UpdateTargetLayerValues::Temp_real_Variable_5' has a wrong offset!");
static_assert(offsetof(BP_TempestFieldAmbienceActor_C_UpdateTargetLayerValues, CallFunc_BooleanAND_ReturnValue_2) == 0x000060, "Member 'BP_TempestFieldAmbienceActor_C_UpdateTargetLayerValues::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_TempestFieldAmbienceActor_C_UpdateTargetLayerValues, Temp_bool_Variable_2) == 0x000061, "Member 'BP_TempestFieldAmbienceActor_C_UpdateTargetLayerValues::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_TempestFieldAmbienceActor_C_UpdateTargetLayerValues, K2Node_Select_Default_1) == 0x000068, "Member 'BP_TempestFieldAmbienceActor_C_UpdateTargetLayerValues::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(BP_TempestFieldAmbienceActor_C_UpdateTargetLayerValues, K2Node_Select_Default_2) == 0x000070, "Member 'BP_TempestFieldAmbienceActor_C_UpdateTargetLayerValues::K2Node_Select_Default_2' has a wrong offset!");

}

