#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TempestFieldAmbienceActor

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_TempestFieldAmbienceActor.BP_TempestFieldAmbienceActor_C
// 0x0088 (0x0318 - 0x0290)
class ABP_TempestFieldAmbienceActor_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAudioComponent*                        FieldAmbientSound;                                 // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_8_Alpha_D259FE2F4C162079FB64E08DDA91D0CC; // 0x02A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_8__Direction_D259FE2F4C162079FB64E08DDA91D0CC; // 0x02AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2AD[0x3];                                      // 0x02AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_8;                                        // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_7_Alpha_3DADA7B74F1D221D89DBA08C8701EEAB; // 0x02B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_7__Direction_3DADA7B74F1D221D89DBA08C8701EEAB; // 0x02BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2BD[0x3];                                      // 0x02BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_7;                                        // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_6_Alpha_2A137CF04762BD2602BE29B2BF6E9A3C; // 0x02C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_6__Direction_2A137CF04762BD2602BE29B2BF6E9A3C; // 0x02CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2CD[0x3];                                      // 0x02CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_6;                                        // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Parent_Field;                                      // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        CurrentMinLayerValue;                              // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        TargetMinLayerValue;                               // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CurrentMidLayerValue;                              // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        TargetMidLayerValue;                               // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CurrentMaxLayerValue;                              // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        TargetMaxLayerValue;                               // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Debug_Enabled;                                     // 0x0310(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_TempestFieldAmbienceActor(int32 EntryPoint);
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);
	void Timeline_6__FinishedFunc();
	void Timeline_6__UpdateFunc();
	void Timeline_7__FinishedFunc();
	void Timeline_7__UpdateFunc();
	void Timeline_8__FinishedFunc();
	void Timeline_8__UpdateFunc();
	void UpdateTargetLayerValues(double ResourcePct);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_TempestFieldAmbienceActor_C">();
	}
	static class ABP_TempestFieldAmbienceActor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_TempestFieldAmbienceActor_C>();
	}
};
static_assert(alignof(ABP_TempestFieldAmbienceActor_C) == 0x000008, "Wrong alignment on ABP_TempestFieldAmbienceActor_C");
static_assert(sizeof(ABP_TempestFieldAmbienceActor_C) == 0x000318, "Wrong size on ABP_TempestFieldAmbienceActor_C");
static_assert(offsetof(ABP_TempestFieldAmbienceActor_C, UberGraphFrame) == 0x000290, "Member 'ABP_TempestFieldAmbienceActor_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_TempestFieldAmbienceActor_C, FieldAmbientSound) == 0x000298, "Member 'ABP_TempestFieldAmbienceActor_C::FieldAmbientSound' has a wrong offset!");
static_assert(offsetof(ABP_TempestFieldAmbienceActor_C, DefaultSceneRoot) == 0x0002A0, "Member 'ABP_TempestFieldAmbienceActor_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_TempestFieldAmbienceActor_C, Timeline_8_Alpha_D259FE2F4C162079FB64E08DDA91D0CC) == 0x0002A8, "Member 'ABP_TempestFieldAmbienceActor_C::Timeline_8_Alpha_D259FE2F4C162079FB64E08DDA91D0CC' has a wrong offset!");
static_assert(offsetof(ABP_TempestFieldAmbienceActor_C, Timeline_8__Direction_D259FE2F4C162079FB64E08DDA91D0CC) == 0x0002AC, "Member 'ABP_TempestFieldAmbienceActor_C::Timeline_8__Direction_D259FE2F4C162079FB64E08DDA91D0CC' has a wrong offset!");
static_assert(offsetof(ABP_TempestFieldAmbienceActor_C, Timeline_8) == 0x0002B0, "Member 'ABP_TempestFieldAmbienceActor_C::Timeline_8' has a wrong offset!");
static_assert(offsetof(ABP_TempestFieldAmbienceActor_C, Timeline_7_Alpha_3DADA7B74F1D221D89DBA08C8701EEAB) == 0x0002B8, "Member 'ABP_TempestFieldAmbienceActor_C::Timeline_7_Alpha_3DADA7B74F1D221D89DBA08C8701EEAB' has a wrong offset!");
static_assert(offsetof(ABP_TempestFieldAmbienceActor_C, Timeline_7__Direction_3DADA7B74F1D221D89DBA08C8701EEAB) == 0x0002BC, "Member 'ABP_TempestFieldAmbienceActor_C::Timeline_7__Direction_3DADA7B74F1D221D89DBA08C8701EEAB' has a wrong offset!");
static_assert(offsetof(ABP_TempestFieldAmbienceActor_C, Timeline_7) == 0x0002C0, "Member 'ABP_TempestFieldAmbienceActor_C::Timeline_7' has a wrong offset!");
static_assert(offsetof(ABP_TempestFieldAmbienceActor_C, Timeline_6_Alpha_2A137CF04762BD2602BE29B2BF6E9A3C) == 0x0002C8, "Member 'ABP_TempestFieldAmbienceActor_C::Timeline_6_Alpha_2A137CF04762BD2602BE29B2BF6E9A3C' has a wrong offset!");
static_assert(offsetof(ABP_TempestFieldAmbienceActor_C, Timeline_6__Direction_2A137CF04762BD2602BE29B2BF6E9A3C) == 0x0002CC, "Member 'ABP_TempestFieldAmbienceActor_C::Timeline_6__Direction_2A137CF04762BD2602BE29B2BF6E9A3C' has a wrong offset!");
static_assert(offsetof(ABP_TempestFieldAmbienceActor_C, Timeline_6) == 0x0002D0, "Member 'ABP_TempestFieldAmbienceActor_C::Timeline_6' has a wrong offset!");
static_assert(offsetof(ABP_TempestFieldAmbienceActor_C, Parent_Field) == 0x0002D8, "Member 'ABP_TempestFieldAmbienceActor_C::Parent_Field' has a wrong offset!");
static_assert(offsetof(ABP_TempestFieldAmbienceActor_C, CurrentMinLayerValue) == 0x0002E0, "Member 'ABP_TempestFieldAmbienceActor_C::CurrentMinLayerValue' has a wrong offset!");
static_assert(offsetof(ABP_TempestFieldAmbienceActor_C, TargetMinLayerValue) == 0x0002E8, "Member 'ABP_TempestFieldAmbienceActor_C::TargetMinLayerValue' has a wrong offset!");
static_assert(offsetof(ABP_TempestFieldAmbienceActor_C, CurrentMidLayerValue) == 0x0002F0, "Member 'ABP_TempestFieldAmbienceActor_C::CurrentMidLayerValue' has a wrong offset!");
static_assert(offsetof(ABP_TempestFieldAmbienceActor_C, TargetMidLayerValue) == 0x0002F8, "Member 'ABP_TempestFieldAmbienceActor_C::TargetMidLayerValue' has a wrong offset!");
static_assert(offsetof(ABP_TempestFieldAmbienceActor_C, CurrentMaxLayerValue) == 0x000300, "Member 'ABP_TempestFieldAmbienceActor_C::CurrentMaxLayerValue' has a wrong offset!");
static_assert(offsetof(ABP_TempestFieldAmbienceActor_C, TargetMaxLayerValue) == 0x000308, "Member 'ABP_TempestFieldAmbienceActor_C::TargetMaxLayerValue' has a wrong offset!");
static_assert(offsetof(ABP_TempestFieldAmbienceActor_C, Debug_Enabled) == 0x000310, "Member 'ABP_TempestFieldAmbienceActor_C::Debug_Enabled' has a wrong offset!");

}

