#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_VETI_Infantry_Enlightened

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_VETI_Infantry_Enlightened.BP_VETI_Infantry_Enlightened_C.ExecuteUbergraph_BP_VETI_Infantry_Enlightened
// 0x00C8 (0x00C8 - 0x0000)
struct BP_VETI_Infantry_Enlightened_C_ExecuteUbergraph_BP_VETI_Infantry_Enlightened final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_1;          // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13[0x5];                                       // 0x0013(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue;           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Conv_VectorToVector2D_ReturnValue;        // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetGroundLocation_ReturnValue;            // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_2;         // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0088(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        CallFunc_SpawnDecalAtLocation_ReturnValue;         // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Roll_ImplicitCast;            // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_VETI_Infantry_Enlightened_C_ExecuteUbergraph_BP_VETI_Infantry_Enlightened) == 0x000008, "Wrong alignment on BP_VETI_Infantry_Enlightened_C_ExecuteUbergraph_BP_VETI_Infantry_Enlightened");
static_assert(sizeof(BP_VETI_Infantry_Enlightened_C_ExecuteUbergraph_BP_VETI_Infantry_Enlightened) == 0x0000C8, "Wrong size on BP_VETI_Infantry_Enlightened_C_ExecuteUbergraph_BP_VETI_Infantry_Enlightened");
static_assert(offsetof(BP_VETI_Infantry_Enlightened_C_ExecuteUbergraph_BP_VETI_Infantry_Enlightened, EntryPoint) == 0x000000, "Member 'BP_VETI_Infantry_Enlightened_C_ExecuteUbergraph_BP_VETI_Infantry_Enlightened::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_VETI_Infantry_Enlightened_C_ExecuteUbergraph_BP_VETI_Infantry_Enlightened, Temp_int_Variable) == 0x000004, "Member 'BP_VETI_Infantry_Enlightened_C_ExecuteUbergraph_BP_VETI_Infantry_Enlightened::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_VETI_Infantry_Enlightened_C_ExecuteUbergraph_BP_VETI_Infantry_Enlightened, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000008, "Member 'BP_VETI_Infantry_Enlightened_C_ExecuteUbergraph_BP_VETI_Infantry_Enlightened::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VETI_Infantry_Enlightened_C_ExecuteUbergraph_BP_VETI_Infantry_Enlightened, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'BP_VETI_Infantry_Enlightened_C_ExecuteUbergraph_BP_VETI_Infantry_Enlightened::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VETI_Infantry_Enlightened_C_ExecuteUbergraph_BP_VETI_Infantry_Enlightened, CallFunc_IsDedicatedServer_ReturnValue) == 0x000010, "Member 'BP_VETI_Infantry_Enlightened_C_ExecuteUbergraph_BP_VETI_Infantry_Enlightened::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VETI_Infantry_Enlightened_C_ExecuteUbergraph_BP_VETI_Infantry_Enlightened, CallFunc_IsDedicatedServer_ReturnValue_1) == 0x000011, "Member 'BP_VETI_Infantry_Enlightened_C_ExecuteUbergraph_BP_VETI_Infantry_Enlightened::CallFunc_IsDedicatedServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_VETI_Infantry_Enlightened_C_ExecuteUbergraph_BP_VETI_Infantry_Enlightened, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x000012, "Member 'BP_VETI_Infantry_Enlightened_C_ExecuteUbergraph_BP_VETI_Infantry_Enlightened::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VETI_Infantry_Enlightened_C_ExecuteUbergraph_BP_VETI_Infantry_Enlightened, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000018, "Member 'BP_VETI_Infantry_Enlightened_C_ExecuteUbergraph_BP_VETI_Infantry_Enlightened::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VETI_Infantry_Enlightened_C_ExecuteUbergraph_BP_VETI_Infantry_Enlightened, CallFunc_RandomFloatInRange_ReturnValue) == 0x000030, "Member 'BP_VETI_Infantry_Enlightened_C_ExecuteUbergraph_BP_VETI_Infantry_Enlightened::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VETI_Infantry_Enlightened_C_ExecuteUbergraph_BP_VETI_Infantry_Enlightened, CallFunc_Conv_VectorToVector2D_ReturnValue) == 0x000038, "Member 'BP_VETI_Infantry_Enlightened_C_ExecuteUbergraph_BP_VETI_Infantry_Enlightened::CallFunc_Conv_VectorToVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VETI_Infantry_Enlightened_C_ExecuteUbergraph_BP_VETI_Infantry_Enlightened, CallFunc_MakeRotator_ReturnValue) == 0x000048, "Member 'BP_VETI_Infantry_Enlightened_C_ExecuteUbergraph_BP_VETI_Infantry_Enlightened::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VETI_Infantry_Enlightened_C_ExecuteUbergraph_BP_VETI_Infantry_Enlightened, CallFunc_GetGroundLocation_ReturnValue) == 0x000060, "Member 'BP_VETI_Infantry_Enlightened_C_ExecuteUbergraph_BP_VETI_Infantry_Enlightened::CallFunc_GetGroundLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VETI_Infantry_Enlightened_C_ExecuteUbergraph_BP_VETI_Infantry_Enlightened, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x000078, "Member 'BP_VETI_Infantry_Enlightened_C_ExecuteUbergraph_BP_VETI_Infantry_Enlightened::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_VETI_Infantry_Enlightened_C_ExecuteUbergraph_BP_VETI_Infantry_Enlightened, CallFunc_RandomFloatInRange_ReturnValue_2) == 0x000080, "Member 'BP_VETI_Infantry_Enlightened_C_ExecuteUbergraph_BP_VETI_Infantry_Enlightened::CallFunc_RandomFloatInRange_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_VETI_Infantry_Enlightened_C_ExecuteUbergraph_BP_VETI_Infantry_Enlightened, CallFunc_MakeVector_ReturnValue) == 0x000088, "Member 'BP_VETI_Infantry_Enlightened_C_ExecuteUbergraph_BP_VETI_Infantry_Enlightened::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VETI_Infantry_Enlightened_C_ExecuteUbergraph_BP_VETI_Infantry_Enlightened, CallFunc_Add_VectorVector_ReturnValue) == 0x0000A0, "Member 'BP_VETI_Infantry_Enlightened_C_ExecuteUbergraph_BP_VETI_Infantry_Enlightened::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VETI_Infantry_Enlightened_C_ExecuteUbergraph_BP_VETI_Infantry_Enlightened, CallFunc_SpawnDecalAtLocation_ReturnValue) == 0x0000B8, "Member 'BP_VETI_Infantry_Enlightened_C_ExecuteUbergraph_BP_VETI_Infantry_Enlightened::CallFunc_SpawnDecalAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VETI_Infantry_Enlightened_C_ExecuteUbergraph_BP_VETI_Infantry_Enlightened, CallFunc_MakeRotator_Roll_ImplicitCast) == 0x0000C0, "Member 'BP_VETI_Infantry_Enlightened_C_ExecuteUbergraph_BP_VETI_Infantry_Enlightened::CallFunc_MakeRotator_Roll_ImplicitCast' has a wrong offset!");

}

