#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_VehicleWreck

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Tempest_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_VehicleWreck.BP_VehicleWreck_C
// 0x0018 (0x03B8 - 0x03A0)
class ABP_VehicleWreck_C final : public ATedVehicleWreckActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAudioComponent*                        FireSFX;                                           // 0x03A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               PS_SmokeVehicleDestroyed;                          // 0x03B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_VehicleWreck(int32 EntryPoint);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_VehicleWreck_C">();
	}
	static class ABP_VehicleWreck_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_VehicleWreck_C>();
	}
};
static_assert(alignof(ABP_VehicleWreck_C) == 0x000008, "Wrong alignment on ABP_VehicleWreck_C");
static_assert(sizeof(ABP_VehicleWreck_C) == 0x0003B8, "Wrong size on ABP_VehicleWreck_C");
static_assert(offsetof(ABP_VehicleWreck_C, UberGraphFrame) == 0x0003A0, "Member 'ABP_VehicleWreck_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_VehicleWreck_C, FireSFX) == 0x0003A8, "Member 'ABP_VehicleWreck_C::FireSFX' has a wrong offset!");
static_assert(offsetof(ABP_VehicleWreck_C, PS_SmokeVehicleDestroyed) == 0x0003B0, "Member 'ABP_VehicleWreck_C::PS_SmokeVehicleDestroyed' has a wrong offset!");

}

