#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_VehicleWreck_Matchstick

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "PhysicsCore_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_VehicleWreck_Matchstick.BP_VehicleWreck_Matchstick_C.BndEvt__BP_VehicleWreck_Peacekeeper_SkeletalMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature
// 0x0128 (0x0128 - 0x0000)
struct BP_VehicleWreck_Matchstick_C_BndEvt__BP_VehicleWreck_Peacekeeper_SkeletalMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    HitComponent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                NormalImpulse;                                     // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit_0;                                             // 0x0030(0x00F8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_VehicleWreck_Matchstick_C_BndEvt__BP_VehicleWreck_Peacekeeper_SkeletalMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_VehicleWreck_Matchstick_C_BndEvt__BP_VehicleWreck_Peacekeeper_SkeletalMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature");
static_assert(sizeof(BP_VehicleWreck_Matchstick_C_BndEvt__BP_VehicleWreck_Peacekeeper_SkeletalMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature) == 0x000128, "Wrong size on BP_VehicleWreck_Matchstick_C_BndEvt__BP_VehicleWreck_Peacekeeper_SkeletalMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature");
static_assert(offsetof(BP_VehicleWreck_Matchstick_C_BndEvt__BP_VehicleWreck_Peacekeeper_SkeletalMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature, HitComponent) == 0x000000, "Member 'BP_VehicleWreck_Matchstick_C_BndEvt__BP_VehicleWreck_Peacekeeper_SkeletalMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature::HitComponent' has a wrong offset!");
static_assert(offsetof(BP_VehicleWreck_Matchstick_C_BndEvt__BP_VehicleWreck_Peacekeeper_SkeletalMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_VehicleWreck_Matchstick_C_BndEvt__BP_VehicleWreck_Peacekeeper_SkeletalMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_VehicleWreck_Matchstick_C_BndEvt__BP_VehicleWreck_Peacekeeper_SkeletalMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_VehicleWreck_Matchstick_C_BndEvt__BP_VehicleWreck_Peacekeeper_SkeletalMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_VehicleWreck_Matchstick_C_BndEvt__BP_VehicleWreck_Peacekeeper_SkeletalMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature, NormalImpulse) == 0x000018, "Member 'BP_VehicleWreck_Matchstick_C_BndEvt__BP_VehicleWreck_Peacekeeper_SkeletalMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature::NormalImpulse' has a wrong offset!");
static_assert(offsetof(BP_VehicleWreck_Matchstick_C_BndEvt__BP_VehicleWreck_Peacekeeper_SkeletalMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature, Hit_0) == 0x000030, "Member 'BP_VehicleWreck_Matchstick_C_BndEvt__BP_VehicleWreck_Peacekeeper_SkeletalMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature::Hit_0' has a wrong offset!");

// Function BP_VehicleWreck_Matchstick.BP_VehicleWreck_Matchstick_C.ExecuteUbergraph_BP_VehicleWreck_Matchstick
// 0x0658 (0x0658 - 0x0000)
struct BP_VehicleWreck_Matchstick_C_ExecuteUbergraph_BP_VehicleWreck_Matchstick final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0008(0x0010)(ConstParm, ReferenceParm)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Temp_object_Variable_1;                            // 0x0030(0x0010)(ConstParm, ReferenceParm)
	double                                        CallFunc_RandomFloatInRange_ReturnValue;           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EObjectTypeQuery>                      K2Node_MakeArray_Array;                            // 0x0078(0x0010)(ConstParm, ReferenceParm)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x0088(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue_1;          // 0x00B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingleForObjects_OutHit;         // 0x00D0(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingleForObjects_ReturnValue;    // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C9[0x7];                                      // 0x01C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDecalComponent*                        CallFunc_SpawnDecalAtLocation_ReturnValue;         // 0x01D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EPhysicalSurface                              CallFunc_GetSurfaceType_ReturnValue;               // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1DA[0x2];                                      // 0x01DA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x01DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x01E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E2[0x2];                                      // 0x01E2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1EC[0x4];                                      // 0x01EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x01F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0208(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0220(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0238(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0250(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0258(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0260(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0278(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x027C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0280(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_284[0x4];                                      // 0x0284(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0288(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x02A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFXSystemComponent*                     CallFunc_SpawnEffectAtLocation_ReturnValue;        // 0x02B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UFXSystemComponent*                     CallFunc_SpawnEffectAtLocation_ReturnValue_1;      // 0x02C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x02C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2CC[0x4];                                      // 0x02CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EObjectTypeQuery>                      K2Node_MakeArray_Array_1;                          // 0x02D0(0x0010)(ConstParm, ReferenceParm)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_HitComponent;           // 0x02E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x02E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x02F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_ComponentBoundEvent_NormalImpulse;          // 0x02F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_ComponentBoundEvent_Hit;                    // 0x0310(0x00F8)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue_2;          // 0x0408(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollisionChannel                             CallFunc_GetCollisionObjectType_ReturnValue;       // 0x0420(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_421[0x7];                                      // 0x0421(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0428(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0440(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_441[0x7];                                      // 0x0441(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_LineTraceSingleForObjects_OutHit_1;       // 0x0448(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingleForObjects_ReturnValue_1;  // 0x0540(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPhysicalSurface                              CallFunc_GetSurfaceType_ReturnValue_1;             // 0x0541(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_542[0x2];                                      // 0x0542(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x0544(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit_1;            // 0x0548(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap_1;         // 0x0549(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54A[0x2];                                      // 0x054A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time_1;                    // 0x054C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance_1;                // 0x0550(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_554[0x4];                                      // 0x0554(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location_1;                // 0x0558(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint_1;             // 0x0570(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal_1;                  // 0x0588(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal_1;            // 0x05A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat_1;                 // 0x05B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor_1;                // 0x05C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent_1;            // 0x05C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName_1;             // 0x05D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName_1;                // 0x05D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem_1;                 // 0x05E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex_1;            // 0x05E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex_1;               // 0x05E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5EC[0x4];                                      // 0x05EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart_1;              // 0x05F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd_1;                // 0x0608(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFXSystemComponent*                     CallFunc_SpawnEffectAtLocation_ReturnValue_2;      // 0x0620(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0628(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FInterpTo_ReturnValue;                    // 0x0640(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetPlayRate_Rate_ImplicitCast;            // 0x0648(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Yaw_ImplicitCast;             // 0x064C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FInterpTo_DeltaTime_ImplicitCast;         // 0x0650(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_VehicleWreck_Matchstick_C_ExecuteUbergraph_BP_VehicleWreck_Matchstick) == 0x000008, "Wrong alignment on BP_VehicleWreck_Matchstick_C_ExecuteUbergraph_BP_VehicleWreck_Matchstick");
static_assert(sizeof(BP_VehicleWreck_Matchstick_C_ExecuteUbergraph_BP_VehicleWreck_Matchstick) == 0x000658, "Wrong size on BP_VehicleWreck_Matchstick_C_ExecuteUbergraph_BP_VehicleWreck_Matchstick");
static_assert(offsetof(BP_VehicleWreck_Matchstick_C_ExecuteUbergraph_BP_VehicleWreck_Matchstick, EntryPoint) == 0x000000, "Member 'BP_VehicleWreck_Matchstick_C_ExecuteUbergraph_BP_VehicleWreck_Matchstick::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_VehicleWreck_Matchstick_C_ExecuteUbergraph_BP_VehicleWreck_Matchstick, Temp_object_Variable) == 0x000008, "Member 'BP_VehicleWreck_Matchstick_C_ExecuteUbergraph_BP_VehicleWreck_Matchstick::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_VehicleWreck_Matchstick_C_ExecuteUbergraph_BP_VehicleWreck_Matchstick, CallFunc_MakeVector_ReturnValue) == 0x000018, "Member 'BP_VehicleWreck_Matchstick_C_ExecuteUbergraph_BP_VehicleWreck_Matchstick::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VehicleWreck_Matchstick_C_ExecuteUbergraph_BP_VehicleWreck_Matchstick, Temp_object_Variable_1) == 0x000030, "Member 'BP_VehicleWreck_Matchstick_C_ExecuteUbergraph_BP_VehicleWreck_Matchstick::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_VehicleWreck_Matchstick_C_ExecuteUbergraph_BP_VehicleWreck_Matchstick, CallFunc_RandomFloatInRange_ReturnValue) == 0x000040, "Member 'BP_VehicleWreck_Matchstick_C_ExecuteUbergraph_BP_VehicleWreck_Matchstick::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VehicleWreck_Matchstick_C_ExecuteUbergraph_BP_VehicleWreck_Matchstick, CallFunc_MakeRotator_ReturnValue) == 0x000048, "Member 'BP_VehicleWreck_Matchstick_C_ExecuteUbergraph_BP_VehicleWreck_Matchstick::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VehicleWreck_Matchstick_C_ExecuteUbergraph_BP_VehicleWreck_Matchstick, CallFunc_MakeVector_ReturnValue_1) == 0x000060, "Member 'BP_VehicleWreck_Matchstick_C_ExecuteUbergraph_BP_VehicleWreck_Matchstick::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_VehicleWreck_Matchstick_C_ExecuteUbergraph_BP_VehicleWreck_Matchstick, K2Node_MakeArray_Array) == 0x000078, "Member 'BP_VehicleWreck_Matchstick_C_ExecuteUbergraph_BP_VehicleWreck_Matchstick::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_VehicleWreck_Matchstick_C_ExecuteUbergraph_BP_VehicleWreck_Matchstick, CallFunc_GetSocketLocation_ReturnValue) == 0x000088, "Member 'BP_VehicleWreck_Matchstick_C_ExecuteUbergraph_BP_VehicleWreck_Matchstick::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VehicleWreck_Matchstick_C_ExecuteUbergraph_BP_VehicleWreck_Matchstick, CallFunc_Add_VectorVector_ReturnValue) == 0x0000A0, "Member 'BP_VehicleWreck_Matchstick_C_ExecuteUbergraph_BP_VehicleWreck_Matchstick::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VehicleWreck_Matchstick_C_ExecuteUbergraph_BP_VehicleWreck_Matchstick, CallFunc_GetSocketLocation_ReturnValue_1) == 0x0000B8, "Member 'BP_VehicleWreck_Matchstick_C_ExecuteUbergraph_BP_VehicleWreck_Matchstick::CallFunc_GetSocketLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_VehicleWreck_Matchstick_C_ExecuteUbergraph_BP_VehicleWreck_Matchstick, CallFunc_LineTraceSingleForObjects_OutHit) == 0x0000D0, "Member 'BP_VehicleWreck_Matchstick_C_ExecuteUbergraph_BP_VehicleWreck_Matchstick::CallFunc_LineTraceSingleForObjects_OutHit' has a wrong offset!");
static_assert(offsetof(BP_VehicleWreck_Matchstick_C_ExecuteUbergraph_BP_VehicleWreck_Matchstick, CallFunc_LineTraceSingleForObjects_ReturnValue) == 0x0001C8, "Member 'BP_VehicleWreck_Matchstick_C_ExecuteUbergraph_BP_VehicleWreck_Matchstick::CallFunc_LineTraceSingleForObjects_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VehicleWreck_Matchstick_C_ExecuteUbergraph_BP_VehicleWreck_Matchstick, CallFunc_SpawnDecalAtLocation_ReturnValue) == 0x0001D0, "Member 'BP_VehicleWreck_Matchstick_C_ExecuteUbergraph_BP_VehicleWreck_Matchstick::CallFunc_SpawnDecalAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VehicleWreck_Matchstick_C_ExecuteUbergraph_BP_VehicleWreck_Matchstick, CallFunc_GetSurfaceType_ReturnValue) == 0x0001D8, "Member 'BP_VehicleWreck_Matchstick_C_ExecuteUbergraph_BP_VehicleWreck_Matchstick::CallFunc_GetSurfaceType_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VehicleWreck_Matchstick_C_ExecuteUbergraph_BP_VehicleWreck_Matchstick, CallFunc_IsValid_ReturnValue) == 0x0001D9, "Member 'BP_VehicleWreck_Matchstick_C_ExecuteUbergraph_BP_VehicleWreck_Matchstick::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VehicleWreck_Matchstick_C_ExecuteUbergraph_BP_VehicleWreck_Matchstick, CallFunc_Conv_ByteToInt_ReturnValue) == 0x0001DC, "Member 'BP_VehicleWreck_Matchstick_C_ExecuteUbergraph_BP_VehicleWreck_Matchstick::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VehicleWreck_Matchstick_C_ExecuteUbergraph_BP_VehicleWreck_Matchstick, CallFunc_BreakHitResult_bBlockingHit) == 0x0001E0, "Member 'BP_VehicleWreck_Matchstick_C_ExecuteUbergraph_BP_VehicleWreck_Matchstick::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(BP_VehicleWreck_Matchstick_C_ExecuteUbergraph_BP_VehicleWreck_Matchstick, CallFunc_BreakHitResult_bInitialOverlap) == 0x0001E1, "Member 'BP_VehicleWreck_Matchstick_C_ExecuteUbergraph_BP_VehicleWreck_Matchstick::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(BP_VehicleWreck_Matchstick_C_ExecuteUbergraph_BP_VehicleWreck_Matchstick, CallFunc_BreakHitResult_Time) == 0x0001E4, "Member 'BP_VehicleWreck_Matchstick_C_ExecuteUbergraph_BP_VehicleWreck_Matchstick::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(BP_VehicleWreck_Matchstick_C_ExecuteUbergraph_BP_VehicleWreck_Matchstick, CallFunc_BreakHitResult_Distance) == 0x0001E8, "Member 'BP_VehicleWreck_Matchstick_C_ExecuteUbergraph_BP_VehicleWreck_Matchstick::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(BP_VehicleWreck_Matchstick_C_ExecuteUbergraph_BP_VehicleWreck_Matchstick, CallFunc_BreakHitResult_Location) == 0x0001F0, "Member 'BP_VehicleWreck_Matchstick_C_ExecuteUbergraph_BP_VehicleWreck_Matchstick::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(BP_VehicleWreck_Matchstick_C_ExecuteUbergraph_BP_VehicleWreck_Matchstick, CallFunc_BreakHitResult_ImpactPoint) == 0x000208, "Member 'BP_VehicleWreck_Matchstick_C_ExecuteUbergraph_BP_VehicleWreck_Matchstick::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(BP_VehicleWreck_Matchstick_C_ExecuteUbergraph_BP_VehicleWreck_Matchstick, CallFunc_BreakHitResult_Normal) == 0x000220, "Member 'BP_VehicleWreck_Matchstick_C_ExecuteUbergraph_BP_VehicleWreck_Matchstick::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(BP_VehicleWreck_Matchstick_C_ExecuteUbergraph_BP_VehicleWreck_Matchstick, CallFunc_BreakHitResult_ImpactNormal) == 0x000238, "Member 'BP_VehicleWreck_Matchstick_C_ExecuteUbergraph_BP_VehicleWreck_Matchstick::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(BP_VehicleWreck_Matchstick_C_ExecuteUbergraph_BP_VehicleWreck_Matchstick, CallFunc_BreakHitResult_PhysMat) == 0x000250, "Member 'BP_VehicleWreck_Matchstick_C_ExecuteUbergraph_BP_VehicleWreck_Matchstick::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(BP_VehicleWreck_Matchstick_C_ExecuteUbergraph_BP_VehicleWreck_Matchstick, CallFunc_BreakHitResult_HitActor) == 0x000258, "Member 'BP_VehicleWreck_Matchstick_C_ExecuteUbergraph_BP_VehicleWreck_Matchstick::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(BP_VehicleWreck_Matchstick_C_ExecuteUbergraph_BP_VehicleWreck_Matchstick, CallFunc_BreakHitResult_HitComponent) == 0x000260, "Member 'BP_VehicleWreck_Matchstick_C_ExecuteUbergraph_BP_VehicleWreck_Matchstick::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(BP_VehicleWreck_Matchstick_C_ExecuteUbergraph_BP_VehicleWreck_Matchstick, CallFunc_BreakHitResult_HitBoneName) == 0x000268, "Member 'BP_VehicleWreck_Matchstick_C_ExecuteUbergraph_BP_VehicleWreck_Matchstick::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(BP_VehicleWreck_Matchstick_C_ExecuteUbergraph_BP_VehicleWreck_Matchstick, CallFunc_BreakHitResult_BoneName) == 0x000270, "Member 'BP_VehicleWreck_Matchstick_C_ExecuteUbergraph_BP_VehicleWreck_Matchstick::CallFunc_BreakHitResult_BoneName' has a wrong offset!");
static_assert(offsetof(BP_VehicleWreck_Matchstick_C_ExecuteUbergraph_BP_VehicleWreck_Matchstick, CallFunc_BreakHitResult_HitItem) == 0x000278, "Member 'BP_VehicleWreck_Matchstick_C_ExecuteUbergraph_BP_VehicleWreck_Matchstick::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(BP_VehicleWreck_Matchstick_C_ExecuteUbergraph_BP_VehicleWreck_Matchstick, CallFunc_BreakHitResult_ElementIndex) == 0x00027C, "Member 'BP_VehicleWreck_Matchstick_C_ExecuteUbergraph_BP_VehicleWreck_Matchstick::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(BP_VehicleWreck_Matchstick_C_ExecuteUbergraph_BP_VehicleWreck_Matchstick, CallFunc_BreakHitResult_FaceIndex) == 0x000280, "Member 'BP_VehicleWreck_Matchstick_C_ExecuteUbergraph_BP_VehicleWreck_Matchstick::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(BP_VehicleWreck_Matchstick_C_ExecuteUbergraph_BP_VehicleWreck_Matchstick, CallFunc_BreakHitResult_TraceStart) == 0x000288, "Member 'BP_VehicleWreck_Matchstick_C_ExecuteUbergraph_BP_VehicleWreck_Matchstick::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(BP_VehicleWreck_Matchstick_C_ExecuteUbergraph_BP_VehicleWreck_Matchstick, CallFunc_BreakHitResult_TraceEnd) == 0x0002A0, "Member 'BP_VehicleWreck_Matchstick_C_ExecuteUbergraph_BP_VehicleWreck_Matchstick::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(BP_VehicleWreck_Matchstick_C_ExecuteUbergraph_BP_VehicleWreck_Matchstick, CallFunc_SpawnEffectAtLocation_ReturnValue) == 0x0002B8, "Member 'BP_VehicleWreck_Matchstick_C_ExecuteUbergraph_BP_VehicleWreck_Matchstick::CallFunc_SpawnEffectAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VehicleWreck_Matchstick_C_ExecuteUbergraph_BP_VehicleWreck_Matchstick, CallFunc_SpawnEffectAtLocation_ReturnValue_1) == 0x0002C0, "Member 'BP_VehicleWreck_Matchstick_C_ExecuteUbergraph_BP_VehicleWreck_Matchstick::CallFunc_SpawnEffectAtLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_VehicleWreck_Matchstick_C_ExecuteUbergraph_BP_VehicleWreck_Matchstick, K2Node_Event_DeltaSeconds) == 0x0002C8, "Member 'BP_VehicleWreck_Matchstick_C_ExecuteUbergraph_BP_VehicleWreck_Matchstick::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_VehicleWreck_Matchstick_C_ExecuteUbergraph_BP_VehicleWreck_Matchstick, K2Node_MakeArray_Array_1) == 0x0002D0, "Member 'BP_VehicleWreck_Matchstick_C_ExecuteUbergraph_BP_VehicleWreck_Matchstick::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BP_VehicleWreck_Matchstick_C_ExecuteUbergraph_BP_VehicleWreck_Matchstick, K2Node_ComponentBoundEvent_HitComponent) == 0x0002E0, "Member 'BP_VehicleWreck_Matchstick_C_ExecuteUbergraph_BP_VehicleWreck_Matchstick::K2Node_ComponentBoundEvent_HitComponent' has a wrong offset!");
static_assert(offsetof(BP_VehicleWreck_Matchstick_C_ExecuteUbergraph_BP_VehicleWreck_Matchstick, K2Node_ComponentBoundEvent_OtherActor) == 0x0002E8, "Member 'BP_VehicleWreck_Matchstick_C_ExecuteUbergraph_BP_VehicleWreck_Matchstick::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(BP_VehicleWreck_Matchstick_C_ExecuteUbergraph_BP_VehicleWreck_Matchstick, K2Node_ComponentBoundEvent_OtherComp) == 0x0002F0, "Member 'BP_VehicleWreck_Matchstick_C_ExecuteUbergraph_BP_VehicleWreck_Matchstick::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(BP_VehicleWreck_Matchstick_C_ExecuteUbergraph_BP_VehicleWreck_Matchstick, K2Node_ComponentBoundEvent_NormalImpulse) == 0x0002F8, "Member 'BP_VehicleWreck_Matchstick_C_ExecuteUbergraph_BP_VehicleWreck_Matchstick::K2Node_ComponentBoundEvent_NormalImpulse' has a wrong offset!");
static_assert(offsetof(BP_VehicleWreck_Matchstick_C_ExecuteUbergraph_BP_VehicleWreck_Matchstick, K2Node_ComponentBoundEvent_Hit) == 0x000310, "Member 'BP_VehicleWreck_Matchstick_C_ExecuteUbergraph_BP_VehicleWreck_Matchstick::K2Node_ComponentBoundEvent_Hit' has a wrong offset!");
static_assert(offsetof(BP_VehicleWreck_Matchstick_C_ExecuteUbergraph_BP_VehicleWreck_Matchstick, CallFunc_GetSocketLocation_ReturnValue_2) == 0x000408, "Member 'BP_VehicleWreck_Matchstick_C_ExecuteUbergraph_BP_VehicleWreck_Matchstick::CallFunc_GetSocketLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_VehicleWreck_Matchstick_C_ExecuteUbergraph_BP_VehicleWreck_Matchstick, CallFunc_GetCollisionObjectType_ReturnValue) == 0x000420, "Member 'BP_VehicleWreck_Matchstick_C_ExecuteUbergraph_BP_VehicleWreck_Matchstick::CallFunc_GetCollisionObjectType_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VehicleWreck_Matchstick_C_ExecuteUbergraph_BP_VehicleWreck_Matchstick, CallFunc_Add_VectorVector_ReturnValue_1) == 0x000428, "Member 'BP_VehicleWreck_Matchstick_C_ExecuteUbergraph_BP_VehicleWreck_Matchstick::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_VehicleWreck_Matchstick_C_ExecuteUbergraph_BP_VehicleWreck_Matchstick, K2Node_SwitchEnum_CmpSuccess) == 0x000440, "Member 'BP_VehicleWreck_Matchstick_C_ExecuteUbergraph_BP_VehicleWreck_Matchstick::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_VehicleWreck_Matchstick_C_ExecuteUbergraph_BP_VehicleWreck_Matchstick, CallFunc_LineTraceSingleForObjects_OutHit_1) == 0x000448, "Member 'BP_VehicleWreck_Matchstick_C_ExecuteUbergraph_BP_VehicleWreck_Matchstick::CallFunc_LineTraceSingleForObjects_OutHit_1' has a wrong offset!");
static_assert(offsetof(BP_VehicleWreck_Matchstick_C_ExecuteUbergraph_BP_VehicleWreck_Matchstick, CallFunc_LineTraceSingleForObjects_ReturnValue_1) == 0x000540, "Member 'BP_VehicleWreck_Matchstick_C_ExecuteUbergraph_BP_VehicleWreck_Matchstick::CallFunc_LineTraceSingleForObjects_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_VehicleWreck_Matchstick_C_ExecuteUbergraph_BP_VehicleWreck_Matchstick, CallFunc_GetSurfaceType_ReturnValue_1) == 0x000541, "Member 'BP_VehicleWreck_Matchstick_C_ExecuteUbergraph_BP_VehicleWreck_Matchstick::CallFunc_GetSurfaceType_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_VehicleWreck_Matchstick_C_ExecuteUbergraph_BP_VehicleWreck_Matchstick, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x000544, "Member 'BP_VehicleWreck_Matchstick_C_ExecuteUbergraph_BP_VehicleWreck_Matchstick::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_VehicleWreck_Matchstick_C_ExecuteUbergraph_BP_VehicleWreck_Matchstick, CallFunc_BreakHitResult_bBlockingHit_1) == 0x000548, "Member 'BP_VehicleWreck_Matchstick_C_ExecuteUbergraph_BP_VehicleWreck_Matchstick::CallFunc_BreakHitResult_bBlockingHit_1' has a wrong offset!");
static_assert(offsetof(BP_VehicleWreck_Matchstick_C_ExecuteUbergraph_BP_VehicleWreck_Matchstick, CallFunc_BreakHitResult_bInitialOverlap_1) == 0x000549, "Member 'BP_VehicleWreck_Matchstick_C_ExecuteUbergraph_BP_VehicleWreck_Matchstick::CallFunc_BreakHitResult_bInitialOverlap_1' has a wrong offset!");
static_assert(offsetof(BP_VehicleWreck_Matchstick_C_ExecuteUbergraph_BP_VehicleWreck_Matchstick, CallFunc_BreakHitResult_Time_1) == 0x00054C, "Member 'BP_VehicleWreck_Matchstick_C_ExecuteUbergraph_BP_VehicleWreck_Matchstick::CallFunc_BreakHitResult_Time_1' has a wrong offset!");
static_assert(offsetof(BP_VehicleWreck_Matchstick_C_ExecuteUbergraph_BP_VehicleWreck_Matchstick, CallFunc_BreakHitResult_Distance_1) == 0x000550, "Member 'BP_VehicleWreck_Matchstick_C_ExecuteUbergraph_BP_VehicleWreck_Matchstick::CallFunc_BreakHitResult_Distance_1' has a wrong offset!");
static_assert(offsetof(BP_VehicleWreck_Matchstick_C_ExecuteUbergraph_BP_VehicleWreck_Matchstick, CallFunc_BreakHitResult_Location_1) == 0x000558, "Member 'BP_VehicleWreck_Matchstick_C_ExecuteUbergraph_BP_VehicleWreck_Matchstick::CallFunc_BreakHitResult_Location_1' has a wrong offset!");
static_assert(offsetof(BP_VehicleWreck_Matchstick_C_ExecuteUbergraph_BP_VehicleWreck_Matchstick, CallFunc_BreakHitResult_ImpactPoint_1) == 0x000570, "Member 'BP_VehicleWreck_Matchstick_C_ExecuteUbergraph_BP_VehicleWreck_Matchstick::CallFunc_BreakHitResult_ImpactPoint_1' has a wrong offset!");
static_assert(offsetof(BP_VehicleWreck_Matchstick_C_ExecuteUbergraph_BP_VehicleWreck_Matchstick, CallFunc_BreakHitResult_Normal_1) == 0x000588, "Member 'BP_VehicleWreck_Matchstick_C_ExecuteUbergraph_BP_VehicleWreck_Matchstick::CallFunc_BreakHitResult_Normal_1' has a wrong offset!");
static_assert(offsetof(BP_VehicleWreck_Matchstick_C_ExecuteUbergraph_BP_VehicleWreck_Matchstick, CallFunc_BreakHitResult_ImpactNormal_1) == 0x0005A0, "Member 'BP_VehicleWreck_Matchstick_C_ExecuteUbergraph_BP_VehicleWreck_Matchstick::CallFunc_BreakHitResult_ImpactNormal_1' has a wrong offset!");
static_assert(offsetof(BP_VehicleWreck_Matchstick_C_ExecuteUbergraph_BP_VehicleWreck_Matchstick, CallFunc_BreakHitResult_PhysMat_1) == 0x0005B8, "Member 'BP_VehicleWreck_Matchstick_C_ExecuteUbergraph_BP_VehicleWreck_Matchstick::CallFunc_BreakHitResult_PhysMat_1' has a wrong offset!");
static_assert(offsetof(BP_VehicleWreck_Matchstick_C_ExecuteUbergraph_BP_VehicleWreck_Matchstick, CallFunc_BreakHitResult_HitActor_1) == 0x0005C0, "Member 'BP_VehicleWreck_Matchstick_C_ExecuteUbergraph_BP_VehicleWreck_Matchstick::CallFunc_BreakHitResult_HitActor_1' has a wrong offset!");
static_assert(offsetof(BP_VehicleWreck_Matchstick_C_ExecuteUbergraph_BP_VehicleWreck_Matchstick, CallFunc_BreakHitResult_HitComponent_1) == 0x0005C8, "Member 'BP_VehicleWreck_Matchstick_C_ExecuteUbergraph_BP_VehicleWreck_Matchstick::CallFunc_BreakHitResult_HitComponent_1' has a wrong offset!");
static_assert(offsetof(BP_VehicleWreck_Matchstick_C_ExecuteUbergraph_BP_VehicleWreck_Matchstick, CallFunc_BreakHitResult_HitBoneName_1) == 0x0005D0, "Member 'BP_VehicleWreck_Matchstick_C_ExecuteUbergraph_BP_VehicleWreck_Matchstick::CallFunc_BreakHitResult_HitBoneName_1' has a wrong offset!");
static_assert(offsetof(BP_VehicleWreck_Matchstick_C_ExecuteUbergraph_BP_VehicleWreck_Matchstick, CallFunc_BreakHitResult_BoneName_1) == 0x0005D8, "Member 'BP_VehicleWreck_Matchstick_C_ExecuteUbergraph_BP_VehicleWreck_Matchstick::CallFunc_BreakHitResult_BoneName_1' has a wrong offset!");
static_assert(offsetof(BP_VehicleWreck_Matchstick_C_ExecuteUbergraph_BP_VehicleWreck_Matchstick, CallFunc_BreakHitResult_HitItem_1) == 0x0005E0, "Member 'BP_VehicleWreck_Matchstick_C_ExecuteUbergraph_BP_VehicleWreck_Matchstick::CallFunc_BreakHitResult_HitItem_1' has a wrong offset!");
static_assert(offsetof(BP_VehicleWreck_Matchstick_C_ExecuteUbergraph_BP_VehicleWreck_Matchstick, CallFunc_BreakHitResult_ElementIndex_1) == 0x0005E4, "Member 'BP_VehicleWreck_Matchstick_C_ExecuteUbergraph_BP_VehicleWreck_Matchstick::CallFunc_BreakHitResult_ElementIndex_1' has a wrong offset!");
static_assert(offsetof(BP_VehicleWreck_Matchstick_C_ExecuteUbergraph_BP_VehicleWreck_Matchstick, CallFunc_BreakHitResult_FaceIndex_1) == 0x0005E8, "Member 'BP_VehicleWreck_Matchstick_C_ExecuteUbergraph_BP_VehicleWreck_Matchstick::CallFunc_BreakHitResult_FaceIndex_1' has a wrong offset!");
static_assert(offsetof(BP_VehicleWreck_Matchstick_C_ExecuteUbergraph_BP_VehicleWreck_Matchstick, CallFunc_BreakHitResult_TraceStart_1) == 0x0005F0, "Member 'BP_VehicleWreck_Matchstick_C_ExecuteUbergraph_BP_VehicleWreck_Matchstick::CallFunc_BreakHitResult_TraceStart_1' has a wrong offset!");
static_assert(offsetof(BP_VehicleWreck_Matchstick_C_ExecuteUbergraph_BP_VehicleWreck_Matchstick, CallFunc_BreakHitResult_TraceEnd_1) == 0x000608, "Member 'BP_VehicleWreck_Matchstick_C_ExecuteUbergraph_BP_VehicleWreck_Matchstick::CallFunc_BreakHitResult_TraceEnd_1' has a wrong offset!");
static_assert(offsetof(BP_VehicleWreck_Matchstick_C_ExecuteUbergraph_BP_VehicleWreck_Matchstick, CallFunc_SpawnEffectAtLocation_ReturnValue_2) == 0x000620, "Member 'BP_VehicleWreck_Matchstick_C_ExecuteUbergraph_BP_VehicleWreck_Matchstick::CallFunc_SpawnEffectAtLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_VehicleWreck_Matchstick_C_ExecuteUbergraph_BP_VehicleWreck_Matchstick, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000628, "Member 'BP_VehicleWreck_Matchstick_C_ExecuteUbergraph_BP_VehicleWreck_Matchstick::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VehicleWreck_Matchstick_C_ExecuteUbergraph_BP_VehicleWreck_Matchstick, CallFunc_FInterpTo_ReturnValue) == 0x000640, "Member 'BP_VehicleWreck_Matchstick_C_ExecuteUbergraph_BP_VehicleWreck_Matchstick::CallFunc_FInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VehicleWreck_Matchstick_C_ExecuteUbergraph_BP_VehicleWreck_Matchstick, CallFunc_SetPlayRate_Rate_ImplicitCast) == 0x000648, "Member 'BP_VehicleWreck_Matchstick_C_ExecuteUbergraph_BP_VehicleWreck_Matchstick::CallFunc_SetPlayRate_Rate_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_VehicleWreck_Matchstick_C_ExecuteUbergraph_BP_VehicleWreck_Matchstick, CallFunc_MakeRotator_Yaw_ImplicitCast) == 0x00064C, "Member 'BP_VehicleWreck_Matchstick_C_ExecuteUbergraph_BP_VehicleWreck_Matchstick::CallFunc_MakeRotator_Yaw_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_VehicleWreck_Matchstick_C_ExecuteUbergraph_BP_VehicleWreck_Matchstick, CallFunc_FInterpTo_DeltaTime_ImplicitCast) == 0x000650, "Member 'BP_VehicleWreck_Matchstick_C_ExecuteUbergraph_BP_VehicleWreck_Matchstick::CallFunc_FInterpTo_DeltaTime_ImplicitCast' has a wrong offset!");

// Function BP_VehicleWreck_Matchstick.BP_VehicleWreck_Matchstick_C.Hit Aircraft Ground Flip Force
// 0x01D0 (0x01D0 - 0x0000)
struct BP_VehicleWreck_Matchstick_C_Hit_Aircraft_Ground_Flip_Force final
{
public:
	class USkeletalMeshComponent*                 Skeletal_Mesh;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   Bone_Name;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Rotation_Axis;                                     // 0x0010(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Flip_Force;                                        // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Side_Vector;                                       // 0x0030(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetComponentVelocity_ReturnValue;         // 0x0070(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_88[0x8];                                       // 0x0088(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0090(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x00F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_TransformDirection_ReturnValue;           // 0x0108(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_VSize_ReturnValue;                        // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x0128(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue_1;                     // 0x0148(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_TransformDirection_ReturnValue_1;         // 0x0160(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Dot_VectorVector_ReturnValue;             // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0181(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_182[0x6];                                      // 0x0182(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SignOfFloat_ReturnValue;                  // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_191[0x7];                                      // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_3;      // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x01B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_VehicleWreck_Matchstick_C_Hit_Aircraft_Ground_Flip_Force) == 0x000010, "Wrong alignment on BP_VehicleWreck_Matchstick_C_Hit_Aircraft_Ground_Flip_Force");
static_assert(sizeof(BP_VehicleWreck_Matchstick_C_Hit_Aircraft_Ground_Flip_Force) == 0x0001D0, "Wrong size on BP_VehicleWreck_Matchstick_C_Hit_Aircraft_Ground_Flip_Force");
static_assert(offsetof(BP_VehicleWreck_Matchstick_C_Hit_Aircraft_Ground_Flip_Force, Skeletal_Mesh) == 0x000000, "Member 'BP_VehicleWreck_Matchstick_C_Hit_Aircraft_Ground_Flip_Force::Skeletal_Mesh' has a wrong offset!");
static_assert(offsetof(BP_VehicleWreck_Matchstick_C_Hit_Aircraft_Ground_Flip_Force, Bone_Name) == 0x000008, "Member 'BP_VehicleWreck_Matchstick_C_Hit_Aircraft_Ground_Flip_Force::Bone_Name' has a wrong offset!");
static_assert(offsetof(BP_VehicleWreck_Matchstick_C_Hit_Aircraft_Ground_Flip_Force, Rotation_Axis) == 0x000010, "Member 'BP_VehicleWreck_Matchstick_C_Hit_Aircraft_Ground_Flip_Force::Rotation_Axis' has a wrong offset!");
static_assert(offsetof(BP_VehicleWreck_Matchstick_C_Hit_Aircraft_Ground_Flip_Force, Flip_Force) == 0x000028, "Member 'BP_VehicleWreck_Matchstick_C_Hit_Aircraft_Ground_Flip_Force::Flip_Force' has a wrong offset!");
static_assert(offsetof(BP_VehicleWreck_Matchstick_C_Hit_Aircraft_Ground_Flip_Force, Side_Vector) == 0x000030, "Member 'BP_VehicleWreck_Matchstick_C_Hit_Aircraft_Ground_Flip_Force::Side_Vector' has a wrong offset!");
static_assert(offsetof(BP_VehicleWreck_Matchstick_C_Hit_Aircraft_Ground_Flip_Force, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000048, "Member 'BP_VehicleWreck_Matchstick_C_Hit_Aircraft_Ground_Flip_Force::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VehicleWreck_Matchstick_C_Hit_Aircraft_Ground_Flip_Force, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000050, "Member 'BP_VehicleWreck_Matchstick_C_Hit_Aircraft_Ground_Flip_Force::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_VehicleWreck_Matchstick_C_Hit_Aircraft_Ground_Flip_Force, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000058, "Member 'BP_VehicleWreck_Matchstick_C_Hit_Aircraft_Ground_Flip_Force::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VehicleWreck_Matchstick_C_Hit_Aircraft_Ground_Flip_Force, CallFunc_GetComponentVelocity_ReturnValue) == 0x000070, "Member 'BP_VehicleWreck_Matchstick_C_Hit_Aircraft_Ground_Flip_Force::CallFunc_GetComponentVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VehicleWreck_Matchstick_C_Hit_Aircraft_Ground_Flip_Force, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x000090, "Member 'BP_VehicleWreck_Matchstick_C_Hit_Aircraft_Ground_Flip_Force::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VehicleWreck_Matchstick_C_Hit_Aircraft_Ground_Flip_Force, CallFunc_Multiply_VectorVector_ReturnValue) == 0x0000F0, "Member 'BP_VehicleWreck_Matchstick_C_Hit_Aircraft_Ground_Flip_Force::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VehicleWreck_Matchstick_C_Hit_Aircraft_Ground_Flip_Force, CallFunc_TransformDirection_ReturnValue) == 0x000108, "Member 'BP_VehicleWreck_Matchstick_C_Hit_Aircraft_Ground_Flip_Force::CallFunc_TransformDirection_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VehicleWreck_Matchstick_C_Hit_Aircraft_Ground_Flip_Force, CallFunc_VSize_ReturnValue) == 0x000120, "Member 'BP_VehicleWreck_Matchstick_C_Hit_Aircraft_Ground_Flip_Force::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VehicleWreck_Matchstick_C_Hit_Aircraft_Ground_Flip_Force, CallFunc_Normal_ReturnValue) == 0x000128, "Member 'BP_VehicleWreck_Matchstick_C_Hit_Aircraft_Ground_Flip_Force::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VehicleWreck_Matchstick_C_Hit_Aircraft_Ground_Flip_Force, CallFunc_FClamp_ReturnValue) == 0x000140, "Member 'BP_VehicleWreck_Matchstick_C_Hit_Aircraft_Ground_Flip_Force::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VehicleWreck_Matchstick_C_Hit_Aircraft_Ground_Flip_Force, CallFunc_Normal_ReturnValue_1) == 0x000148, "Member 'BP_VehicleWreck_Matchstick_C_Hit_Aircraft_Ground_Flip_Force::CallFunc_Normal_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_VehicleWreck_Matchstick_C_Hit_Aircraft_Ground_Flip_Force, CallFunc_TransformDirection_ReturnValue_1) == 0x000160, "Member 'BP_VehicleWreck_Matchstick_C_Hit_Aircraft_Ground_Flip_Force::CallFunc_TransformDirection_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_VehicleWreck_Matchstick_C_Hit_Aircraft_Ground_Flip_Force, CallFunc_Dot_VectorVector_ReturnValue) == 0x000178, "Member 'BP_VehicleWreck_Matchstick_C_Hit_Aircraft_Ground_Flip_Force::CallFunc_Dot_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VehicleWreck_Matchstick_C_Hit_Aircraft_Ground_Flip_Force, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000180, "Member 'BP_VehicleWreck_Matchstick_C_Hit_Aircraft_Ground_Flip_Force::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VehicleWreck_Matchstick_C_Hit_Aircraft_Ground_Flip_Force, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000181, "Member 'BP_VehicleWreck_Matchstick_C_Hit_Aircraft_Ground_Flip_Force::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VehicleWreck_Matchstick_C_Hit_Aircraft_Ground_Flip_Force, CallFunc_SignOfFloat_ReturnValue) == 0x000188, "Member 'BP_VehicleWreck_Matchstick_C_Hit_Aircraft_Ground_Flip_Force::CallFunc_SignOfFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VehicleWreck_Matchstick_C_Hit_Aircraft_Ground_Flip_Force, CallFunc_BooleanAND_ReturnValue) == 0x000190, "Member 'BP_VehicleWreck_Matchstick_C_Hit_Aircraft_Ground_Flip_Force::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VehicleWreck_Matchstick_C_Hit_Aircraft_Ground_Flip_Force, CallFunc_Multiply_DoubleDouble_ReturnValue_2) == 0x000198, "Member 'BP_VehicleWreck_Matchstick_C_Hit_Aircraft_Ground_Flip_Force::CallFunc_Multiply_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_VehicleWreck_Matchstick_C_Hit_Aircraft_Ground_Flip_Force, CallFunc_SelectFloat_ReturnValue) == 0x0001A0, "Member 'BP_VehicleWreck_Matchstick_C_Hit_Aircraft_Ground_Flip_Force::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VehicleWreck_Matchstick_C_Hit_Aircraft_Ground_Flip_Force, CallFunc_Multiply_DoubleDouble_ReturnValue_3) == 0x0001A8, "Member 'BP_VehicleWreck_Matchstick_C_Hit_Aircraft_Ground_Flip_Force::CallFunc_Multiply_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_VehicleWreck_Matchstick_C_Hit_Aircraft_Ground_Flip_Force, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x0001B0, "Member 'BP_VehicleWreck_Matchstick_C_Hit_Aircraft_Ground_Flip_Force::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");

// Function BP_VehicleWreck_Matchstick.BP_VehicleWreck_Matchstick_C.Initial Aircraft Destruction Force
// 0x0280 (0x0280 - 0x0000)
struct BP_VehicleWreck_Matchstick_C_Initial_Aircraft_Destruction_Force final
{
public:
	class USkeletalMeshComponent*                 Skeletal_Mesh;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Static_Mesh__TEMP_;                                // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   Bone_Name;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Rotation_Force_Axis_0;                             // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Rotation_Force_Multiplier_0;                       // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<bool>                                  Rotation_Force_Locked_Axis_0;                      // 0x0038(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FVector                                Forward_Force_Direction_0;                         // 0x0048(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Forward_Force_0;                                   // 0x0060(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_68[0x8];                                       // 0x0068(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             ActorTransform;                                    // 0x0070(0x0060)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x00D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_TransformDirection_ReturnValue;           // 0x00E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetComponentVelocity_ReturnValue;         // 0x0100(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0118(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RandomBool_ReturnValue;                   // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_VSize_ReturnValue;                        // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue_1;                // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RandomBool_ReturnValue_1;                 // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
