#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_VETI_Vehicle_Messenger

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_Veti_Aircraft_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_VETI_Vehicle_Messenger.BP_VETI_Vehicle_Messenger_C
// 0x0080 (0x1DC0 - 0x1D40)
class ABP_VETI_Vehicle_Messenger_C final : public ABP_Veti_Aircraft_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_VETI_Vehicle_Messenger_C;        // 0x1D40(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTedRangeDecalComponent*                DetectionDecal;                                    // 0x1D48(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               PS_SmokeVETVehicleDamageMedium;                    // 0x1D50(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               PS_SmokeVETVehicleDamageHeavy;                     // 0x1D58(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               PS_SmokeVETVehicleDamageLight;                     // 0x1D60(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               PS_SmokeVETMessenger_03;                           // 0x1D68(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               PS_SmokeVETMessenger_02;                           // 0x1D70(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               PS_SmokeVETMessenger_01;                           // 0x1D78(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          HitBox3;                                           // 0x1D80(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          HitBox5;                                           // 0x1D88(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          HitBox4;                                           // 0x1D90(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          HitBox2;                                           // 0x1D98(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               PS_JetEngine_2;                                    // 0x1DA0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               PS_JetEngine_1;                                    // 0x1DA8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          bCachedSelected;                                   // 0x1DB0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bCachedHovered;                                    // 0x1DB1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__BP_GDF_Infantry_CommsOfficer_DetectionDecal_K2Node_ComponentBoundEvent_1_RangeDecalDelegate__DelegateSignature();
	void CheckRangeDecals();
	void ExecuteUbergraph_BP_VETI_Vehicle_Messenger(int32 EntryPoint);
	void OnSelectionChanged_Blueprint(const bool bIsSelected, const bool bIsHovered);
	void ReceiveBeginMovement();
	void ReceiveBeginPlay();
	void ReceiveEndMovement();
	void ReceiveOnDeath();
	void ReceiveUpdateHealthEffects(float HealthPct);
	void UpdateDetectionRangeDecal();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_VETI_Vehicle_Messenger_C">();
	}
	static class ABP_VETI_Vehicle_Messenger_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_VETI_Vehicle_Messenger_C>();
	}
};
static_assert(alignof(ABP_VETI_Vehicle_Messenger_C) == 0x000010, "Wrong alignment on ABP_VETI_Vehicle_Messenger_C");
static_assert(sizeof(ABP_VETI_Vehicle_Messenger_C) == 0x001DC0, "Wrong size on ABP_VETI_Vehicle_Messenger_C");
static_assert(offsetof(ABP_VETI_Vehicle_Messenger_C, UberGraphFrame_BP_VETI_Vehicle_Messenger_C) == 0x001D40, "Member 'ABP_VETI_Vehicle_Messenger_C::UberGraphFrame_BP_VETI_Vehicle_Messenger_C' has a wrong offset!");
static_assert(offsetof(ABP_VETI_Vehicle_Messenger_C, DetectionDecal) == 0x001D48, "Member 'ABP_VETI_Vehicle_Messenger_C::DetectionDecal' has a wrong offset!");
static_assert(offsetof(ABP_VETI_Vehicle_Messenger_C, PS_SmokeVETVehicleDamageMedium) == 0x001D50, "Member 'ABP_VETI_Vehicle_Messenger_C::PS_SmokeVETVehicleDamageMedium' has a wrong offset!");
static_assert(offsetof(ABP_VETI_Vehicle_Messenger_C, PS_SmokeVETVehicleDamageHeavy) == 0x001D58, "Member 'ABP_VETI_Vehicle_Messenger_C::PS_SmokeVETVehicleDamageHeavy' has a wrong offset!");
static_assert(offsetof(ABP_VETI_Vehicle_Messenger_C, PS_SmokeVETVehicleDamageLight) == 0x001D60, "Member 'ABP_VETI_Vehicle_Messenger_C::PS_SmokeVETVehicleDamageLight' has a wrong offset!");
static_assert(offsetof(ABP_VETI_Vehicle_Messenger_C, PS_SmokeVETMessenger_03) == 0x001D68, "Member 'ABP_VETI_Vehicle_Messenger_C::PS_SmokeVETMessenger_03' has a wrong offset!");
static_assert(offsetof(ABP_VETI_Vehicle_Messenger_C, PS_SmokeVETMessenger_02) == 0x001D70, "Member 'ABP_VETI_Vehicle_Messenger_C::PS_SmokeVETMessenger_02' has a wrong offset!");
static_assert(offsetof(ABP_VETI_Vehicle_Messenger_C, PS_SmokeVETMessenger_01) == 0x001D78, "Member 'ABP_VETI_Vehicle_Messenger_C::PS_SmokeVETMessenger_01' has a wrong offset!");
static_assert(offsetof(ABP_VETI_Vehicle_Messenger_C, HitBox3) == 0x001D80, "Member 'ABP_VETI_Vehicle_Messenger_C::HitBox3' has a wrong offset!");
static_assert(offsetof(ABP_VETI_Vehicle_Messenger_C, HitBox5) == 0x001D88, "Member 'ABP_VETI_Vehicle_Messenger_C::HitBox5' has a wrong offset!");
static_assert(offsetof(ABP_VETI_Vehicle_Messenger_C, HitBox4) == 0x001D90, "Member 'ABP_VETI_Vehicle_Messenger_C::HitBox4' has a wrong offset!");
static_assert(offsetof(ABP_VETI_Vehicle_Messenger_C, HitBox2) == 0x001D98, "Member 'ABP_VETI_Vehicle_Messenger_C::HitBox2' has a wrong offset!");
static_assert(offsetof(ABP_VETI_Vehicle_Messenger_C, PS_JetEngine_2) == 0x001DA0, "Member 'ABP_VETI_Vehicle_Messenger_C::PS_JetEngine_2' has a wrong offset!");
static_assert(offsetof(ABP_VETI_Vehicle_Messenger_C, PS_JetEngine_1) == 0x001DA8, "Member 'ABP_VETI_Vehicle_Messenger_C::PS_JetEngine_1' has a wrong offset!");
static_assert(offsetof(ABP_VETI_Vehicle_Messenger_C, bCachedSelected) == 0x001DB0, "Member 'ABP_VETI_Vehicle_Messenger_C::bCachedSelected' has a wrong offset!");
static_assert(offsetof(ABP_VETI_Vehicle_Messenger_C, bCachedHovered) == 0x001DB1, "Member 'ABP_VETI_Vehicle_Messenger_C::bCachedHovered' has a wrong offset!");

}

