#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_VETI_Vehicle_RepairServitor

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_VETI_Vehicle_RepairServitor.BP_VETI_Vehicle_RepairServitor_C.EventReceived_3E9E8D1C47DBD8AC69093DA048EAC8E3
// 0x00B0 (0x00B0 - 0x0000)
struct BP_VETI_Vehicle_RepairServitor_C_EventReceived_3E9E8D1C47DBD8AC69093DA048EAC8E3 final
{
public:
	struct FGameplayEventData                     Payload;                                           // 0x0000(0x00B0)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(BP_VETI_Vehicle_RepairServitor_C_EventReceived_3E9E8D1C47DBD8AC69093DA048EAC8E3) == 0x000008, "Wrong alignment on BP_VETI_Vehicle_RepairServitor_C_EventReceived_3E9E8D1C47DBD8AC69093DA048EAC8E3");
static_assert(sizeof(BP_VETI_Vehicle_RepairServitor_C_EventReceived_3E9E8D1C47DBD8AC69093DA048EAC8E3) == 0x0000B0, "Wrong size on BP_VETI_Vehicle_RepairServitor_C_EventReceived_3E9E8D1C47DBD8AC69093DA048EAC8E3");
static_assert(offsetof(BP_VETI_Vehicle_RepairServitor_C_EventReceived_3E9E8D1C47DBD8AC69093DA048EAC8E3, Payload) == 0x000000, "Member 'BP_VETI_Vehicle_RepairServitor_C_EventReceived_3E9E8D1C47DBD8AC69093DA048EAC8E3::Payload' has a wrong offset!");

// Function BP_VETI_Vehicle_RepairServitor.BP_VETI_Vehicle_RepairServitor_C.ExecuteUbergraph_BP_VETI_Vehicle_RepairServitor
// 0x02B8 (0x02B8 - 0x0000)
struct BP_VETI_Vehicle_RepairServitor_C_ExecuteUbergraph_BP_VETI_Vehicle_RepairServitor final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayEventData& Payload)> K2Node_CreateDelegate_OutputDelegate;  // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_CustomEvent_Payload;                        // 0x0018(0x00B0)()
	struct FGameplayEventData                     Temp_struct_Variable;                              // 0x00C8(0x00B0)()
	class UAbilityAsync_WaitGameplayEvent*        CallFunc_WaitGameplayEventToActor_ReturnValue;     // 0x0178(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0181(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_1;          // 0x0182(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_183[0x1];                                      // 0x0183(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_HealthPct;                            // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x0188(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A1[0x7];                                      // 0x01A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 CallFunc_MakeGameplayCueParameters_ReturnValue;    // 0x01A8(0x00D8)(ContainsInstancedReference)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_2;          // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0281(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayerControlled_ReturnValue;           // 0x0282(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_283[0x5];                                      // 0x0283(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ATedPlayerController*                   CallFunc_GetOwningPlayerController_ReturnValue;    // 0x0288(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocalPlayerController_ReturnValue;      // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0291(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_292[0x6];                                      // 0x0292(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ATedPawn*                               CallFunc_GetDroneOwner_ReturnValue;                // 0x0298(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_BD_VETI_WarAssembly_C*              K2Node_DynamicCast_AsBP_BD_VETI_War_Assembly;      // 0x02A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A9[0x7];                                      // 0x02A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast;         // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_VETI_Vehicle_RepairServitor_C_ExecuteUbergraph_BP_VETI_Vehicle_RepairServitor) == 0x000008, "Wrong alignment on BP_VETI_Vehicle_RepairServitor_C_ExecuteUbergraph_BP_VETI_Vehicle_RepairServitor");
static_assert(sizeof(BP_VETI_Vehicle_RepairServitor_C_ExecuteUbergraph_BP_VETI_Vehicle_RepairServitor) == 0x0002B8, "Wrong size on BP_VETI_Vehicle_RepairServitor_C_ExecuteUbergraph_BP_VETI_Vehicle_RepairServitor");
static_assert(offsetof(BP_VETI_Vehicle_RepairServitor_C_ExecuteUbergraph_BP_VETI_Vehicle_RepairServitor, EntryPoint) == 0x000000, "Member 'BP_VETI_Vehicle_RepairServitor_C_ExecuteUbergraph_BP_VETI_Vehicle_RepairServitor::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_VETI_Vehicle_RepairServitor_C_ExecuteUbergraph_BP_VETI_Vehicle_RepairServitor, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BP_VETI_Vehicle_RepairServitor_C_ExecuteUbergraph_BP_VETI_Vehicle_RepairServitor::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_VETI_Vehicle_RepairServitor_C_ExecuteUbergraph_BP_VETI_Vehicle_RepairServitor, K2Node_CustomEvent_Payload) == 0x000018, "Member 'BP_VETI_Vehicle_RepairServitor_C_ExecuteUbergraph_BP_VETI_Vehicle_RepairServitor::K2Node_CustomEvent_Payload' has a wrong offset!");
static_assert(offsetof(BP_VETI_Vehicle_RepairServitor_C_ExecuteUbergraph_BP_VETI_Vehicle_RepairServitor, Temp_struct_Variable) == 0x0000C8, "Member 'BP_VETI_Vehicle_RepairServitor_C_ExecuteUbergraph_BP_VETI_Vehicle_RepairServitor::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_VETI_Vehicle_RepairServitor_C_ExecuteUbergraph_BP_VETI_Vehicle_RepairServitor, CallFunc_WaitGameplayEventToActor_ReturnValue) == 0x000178, "Member 'BP_VETI_Vehicle_RepairServitor_C_ExecuteUbergraph_BP_VETI_Vehicle_RepairServitor::CallFunc_WaitGameplayEventToActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VETI_Vehicle_RepairServitor_C_ExecuteUbergraph_BP_VETI_Vehicle_RepairServitor, CallFunc_IsValid_ReturnValue) == 0x000180, "Member 'BP_VETI_Vehicle_RepairServitor_C_ExecuteUbergraph_BP_VETI_Vehicle_RepairServitor::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VETI_Vehicle_RepairServitor_C_ExecuteUbergraph_BP_VETI_Vehicle_RepairServitor, CallFunc_IsDedicatedServer_ReturnValue) == 0x000181, "Member 'BP_VETI_Vehicle_RepairServitor_C_ExecuteUbergraph_BP_VETI_Vehicle_RepairServitor::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VETI_Vehicle_RepairServitor_C_ExecuteUbergraph_BP_VETI_Vehicle_RepairServitor, CallFunc_IsDedicatedServer_ReturnValue_1) == 0x000182, "Member 'BP_VETI_Vehicle_RepairServitor_C_ExecuteUbergraph_BP_VETI_Vehicle_RepairServitor::CallFunc_IsDedicatedServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_VETI_Vehicle_RepairServitor_C_ExecuteUbergraph_BP_VETI_Vehicle_RepairServitor, K2Node_Event_HealthPct) == 0x000184, "Member 'BP_VETI_Vehicle_RepairServitor_C_ExecuteUbergraph_BP_VETI_Vehicle_RepairServitor::K2Node_Event_HealthPct' has a wrong offset!");
static_assert(offsetof(BP_VETI_Vehicle_RepairServitor_C_ExecuteUbergraph_BP_VETI_Vehicle_RepairServitor, CallFunc_GetSocketLocation_ReturnValue) == 0x000188, "Member 'BP_VETI_Vehicle_RepairServitor_C_ExecuteUbergraph_BP_VETI_Vehicle_RepairServitor::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VETI_Vehicle_RepairServitor_C_ExecuteUbergraph_BP_VETI_Vehicle_RepairServitor, CallFunc_Less_DoubleDouble_ReturnValue) == 0x0001A0, "Member 'BP_VETI_Vehicle_RepairServitor_C_ExecuteUbergraph_BP_VETI_Vehicle_RepairServitor::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VETI_Vehicle_RepairServitor_C_ExecuteUbergraph_BP_VETI_Vehicle_RepairServitor, CallFunc_MakeGameplayCueParameters_ReturnValue) == 0x0001A8, "Member 'BP_VETI_Vehicle_RepairServitor_C_ExecuteUbergraph_BP_VETI_Vehicle_RepairServitor::CallFunc_MakeGameplayCueParameters_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VETI_Vehicle_RepairServitor_C_ExecuteUbergraph_BP_VETI_Vehicle_RepairServitor, CallFunc_IsDedicatedServer_ReturnValue_2) == 0x000280, "Member 'BP_VETI_Vehicle_RepairServitor_C_ExecuteUbergraph_BP_VETI_Vehicle_RepairServitor::CallFunc_IsDedicatedServer_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_VETI_Vehicle_RepairServitor_C_ExecuteUbergraph_BP_VETI_Vehicle_RepairServitor, CallFunc_HasAuthority_ReturnValue) == 0x000281, "Member 'BP_VETI_Vehicle_RepairServitor_C_ExecuteUbergraph_BP_VETI_Vehicle_RepairServitor::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VETI_Vehicle_RepairServitor_C_ExecuteUbergraph_BP_VETI_Vehicle_RepairServitor, CallFunc_IsPlayerControlled_ReturnValue) == 0x000282, "Member 'BP_VETI_Vehicle_RepairServitor_C_ExecuteUbergraph_BP_VETI_Vehicle_RepairServitor::CallFunc_IsPlayerControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VETI_Vehicle_RepairServitor_C_ExecuteUbergraph_BP_VETI_Vehicle_RepairServitor, CallFunc_GetOwningPlayerController_ReturnValue) == 0x000288, "Member 'BP_VETI_Vehicle_RepairServitor_C_ExecuteUbergraph_BP_VETI_Vehicle_RepairServitor::CallFunc_GetOwningPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VETI_Vehicle_RepairServitor_C_ExecuteUbergraph_BP_VETI_Vehicle_RepairServitor, CallFunc_IsLocalPlayerController_ReturnValue) == 0x000290, "Member 'BP_VETI_Vehicle_RepairServitor_C_ExecuteUbergraph_BP_VETI_Vehicle_RepairServitor::CallFunc_IsLocalPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VETI_Vehicle_RepairServitor_C_ExecuteUbergraph_BP_VETI_Vehicle_RepairServitor, CallFunc_BooleanAND_ReturnValue) == 0x000291, "Member 'BP_VETI_Vehicle_RepairServitor_C_ExecuteUbergraph_BP_VETI_Vehicle_RepairServitor::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VETI_Vehicle_RepairServitor_C_ExecuteUbergraph_BP_VETI_Vehicle_RepairServitor, CallFunc_GetDroneOwner_ReturnValue) == 0x000298, "Member 'BP_VETI_Vehicle_RepairServitor_C_ExecuteUbergraph_BP_VETI_Vehicle_RepairServitor::CallFunc_GetDroneOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VETI_Vehicle_RepairServitor_C_ExecuteUbergraph_BP_VETI_Vehicle_RepairServitor, K2Node_DynamicCast_AsBP_BD_VETI_War_Assembly) == 0x0002A0, "Member 'BP_VETI_Vehicle_RepairServitor_C_ExecuteUbergraph_BP_VETI_Vehicle_RepairServitor::K2Node_DynamicCast_AsBP_BD_VETI_War_Assembly' has a wrong offset!");
static_assert(offsetof(BP_VETI_Vehicle_RepairServitor_C_ExecuteUbergraph_BP_VETI_Vehicle_RepairServitor, K2Node_DynamicCast_bSuccess) == 0x0002A8, "Member 'BP_VETI_Vehicle_RepairServitor_C_ExecuteUbergraph_BP_VETI_Vehicle_RepairServitor::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_VETI_Vehicle_RepairServitor_C_ExecuteUbergraph_BP_VETI_Vehicle_RepairServitor, CallFunc_Less_DoubleDouble_A_ImplicitCast) == 0x0002B0, "Member 'BP_VETI_Vehicle_RepairServitor_C_ExecuteUbergraph_BP_VETI_Vehicle_RepairServitor::CallFunc_Less_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function BP_VETI_Vehicle_RepairServitor.BP_VETI_Vehicle_RepairServitor_C.ReceiveUpdateHealthEffects
// 0x0004 (0x0004 - 0x0000)
struct BP_VETI_Vehicle_RepairServitor_C_ReceiveUpdateHealthEffects final
{
public:
	float                                         HealthPct;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_VETI_Vehicle_RepairServitor_C_ReceiveUpdateHealthEffects) == 0x000004, "Wrong alignment on BP_VETI_Vehicle_RepairServitor_C_ReceiveUpdateHealthEffects");
static_assert(sizeof(BP_VETI_Vehicle_RepairServitor_C_ReceiveUpdateHealthEffects) == 0x000004, "Wrong size on BP_VETI_Vehicle_RepairServitor_C_ReceiveUpdateHealthEffects");
static_assert(offsetof(BP_VETI_Vehicle_RepairServitor_C_ReceiveUpdateHealthEffects, HealthPct) == 0x000000, "Member 'BP_VETI_Vehicle_RepairServitor_C_ReceiveUpdateHealthEffects::HealthPct' has a wrong offset!");

}

