#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Veti_Aircraft_Base

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Tempest_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Veti_Aircraft_Base.BP_Veti_Aircraft_Base_C
// 0x0030 (0x1D40 - 0x1D10)
class ABP_Veti_Aircraft_Base_C : public ATedAircraft
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1D10(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      PS_VetiShield;                                     // 0x1D18(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         TL_Shield_Opacity_3DE38FCB47DF8B79487A62AC776C7EFE; // 0x1D20(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            TL_Shield__Direction_3DE38FCB47DF8B79487A62AC776C7EFE; // 0x1D24(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D25[0x3];                                     // 0x1D25(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     TL_Shield;                                         // 0x1D28(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Primary_Material_Index;                            // 0x1D30(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D34[0x4];                                     // 0x1D34(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               Mid;                                               // 0x1D38(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Veti_Aircraft_Base(int32 EntryPoint);
	void OnReceiveGravityManipulators();
	void OnReceiveLifebloodBattery();
	void OnReceiveRegrowthProtocols();
	void OnReceiveShield();
	void OnReceiveSpecificDeathEnlightened();
	void ReceiveBeginPlay();
	void ReceiveOnDeath();
	void ReceiveTick(float DeltaSeconds);
	void TL_Shield__FinishedFunc();
	void TL_Shield__UpdateFunc();
	void UserConstructionScript();

	void K2_GetSelectionMIDs(TArray<class UMaterialInstanceDynamic*>* OutSelectionMIDs) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Veti_Aircraft_Base_C">();
	}
	static class ABP_Veti_Aircraft_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Veti_Aircraft_Base_C>();
	}
};
static_assert(alignof(ABP_Veti_Aircraft_Base_C) == 0x000010, "Wrong alignment on ABP_Veti_Aircraft_Base_C");
static_assert(sizeof(ABP_Veti_Aircraft_Base_C) == 0x001D40, "Wrong size on ABP_Veti_Aircraft_Base_C");
static_assert(offsetof(ABP_Veti_Aircraft_Base_C, UberGraphFrame) == 0x001D10, "Member 'ABP_Veti_Aircraft_Base_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Veti_Aircraft_Base_C, PS_VetiShield) == 0x001D18, "Member 'ABP_Veti_Aircraft_Base_C::PS_VetiShield' has a wrong offset!");
static_assert(offsetof(ABP_Veti_Aircraft_Base_C, TL_Shield_Opacity_3DE38FCB47DF8B79487A62AC776C7EFE) == 0x001D20, "Member 'ABP_Veti_Aircraft_Base_C::TL_Shield_Opacity_3DE38FCB47DF8B79487A62AC776C7EFE' has a wrong offset!");
static_assert(offsetof(ABP_Veti_Aircraft_Base_C, TL_Shield__Direction_3DE38FCB47DF8B79487A62AC776C7EFE) == 0x001D24, "Member 'ABP_Veti_Aircraft_Base_C::TL_Shield__Direction_3DE38FCB47DF8B79487A62AC776C7EFE' has a wrong offset!");
static_assert(offsetof(ABP_Veti_Aircraft_Base_C, TL_Shield) == 0x001D28, "Member 'ABP_Veti_Aircraft_Base_C::TL_Shield' has a wrong offset!");
static_assert(offsetof(ABP_Veti_Aircraft_Base_C, Primary_Material_Index) == 0x001D30, "Member 'ABP_Veti_Aircraft_Base_C::Primary_Material_Index' has a wrong offset!");
static_assert(offsetof(ABP_Veti_Aircraft_Base_C, Mid) == 0x001D38, "Member 'ABP_Veti_Aircraft_Base_C::Mid' has a wrong offset!");

}

