#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Veti_Vehicle_Base

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Tempest_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Veti_Vehicle_Base.BP_Veti_Vehicle_Base_C
// 0x0040 (0x1D00 - 0x1CC0)
class ABP_Veti_Vehicle_Base_C : public ATedVehicle
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1CC0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      PS_VETILifebloodBattery;                           // 0x1CC8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      PS_VetiShield;                                     // 0x1CD0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          HitBox;                                            // 0x1CD8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         TL_Shield_Opacity_B4323C48420256011473BC802239083A; // 0x1CE0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            TL_Shield__Direction_B4323C48420256011473BC802239083A; // 0x1CE4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1CE5[0x3];                                     // 0x1CE5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     TL_Shield;                                         // 0x1CE8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Primary_Material_Index;                            // 0x1CF0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1CF4[0x4];                                     // 0x1CF4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               Mid;                                               // 0x1CF8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Veti_Vehicle_Base(int32 EntryPoint);
	void LifebloodBattery();
	void OnReceiveGravityManipulators();
	void OnReceiveLifebloodBattery();
	void OnReceiveRegrowthProtocols();
	void OnReceiveShield();
	void OnReceiveSpecificDeathEnlightened();
	void ReceiveBeginPlay();
	void ReceiveOnDeath();
	void TL_Shield__FinishedFunc();
	void TL_Shield__UpdateFunc();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Veti_Vehicle_Base_C">();
	}
	static class ABP_Veti_Vehicle_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Veti_Vehicle_Base_C>();
	}
};
static_assert(alignof(ABP_Veti_Vehicle_Base_C) == 0x000010, "Wrong alignment on ABP_Veti_Vehicle_Base_C");
static_assert(sizeof(ABP_Veti_Vehicle_Base_C) == 0x001D00, "Wrong size on ABP_Veti_Vehicle_Base_C");
static_assert(offsetof(ABP_Veti_Vehicle_Base_C, UberGraphFrame) == 0x001CC0, "Member 'ABP_Veti_Vehicle_Base_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Veti_Vehicle_Base_C, PS_VETILifebloodBattery) == 0x001CC8, "Member 'ABP_Veti_Vehicle_Base_C::PS_VETILifebloodBattery' has a wrong offset!");
static_assert(offsetof(ABP_Veti_Vehicle_Base_C, PS_VetiShield) == 0x001CD0, "Member 'ABP_Veti_Vehicle_Base_C::PS_VetiShield' has a wrong offset!");
static_assert(offsetof(ABP_Veti_Vehicle_Base_C, HitBox) == 0x001CD8, "Member 'ABP_Veti_Vehicle_Base_C::HitBox' has a wrong offset!");
static_assert(offsetof(ABP_Veti_Vehicle_Base_C, TL_Shield_Opacity_B4323C48420256011473BC802239083A) == 0x001CE0, "Member 'ABP_Veti_Vehicle_Base_C::TL_Shield_Opacity_B4323C48420256011473BC802239083A' has a wrong offset!");
static_assert(offsetof(ABP_Veti_Vehicle_Base_C, TL_Shield__Direction_B4323C48420256011473BC802239083A) == 0x001CE4, "Member 'ABP_Veti_Vehicle_Base_C::TL_Shield__Direction_B4323C48420256011473BC802239083A' has a wrong offset!");
static_assert(offsetof(ABP_Veti_Vehicle_Base_C, TL_Shield) == 0x001CE8, "Member 'ABP_Veti_Vehicle_Base_C::TL_Shield' has a wrong offset!");
static_assert(offsetof(ABP_Veti_Vehicle_Base_C, Primary_Material_Index) == 0x001CF0, "Member 'ABP_Veti_Vehicle_Base_C::Primary_Material_Index' has a wrong offset!");
static_assert(offsetof(ABP_Veti_Vehicle_Base_C, Mid) == 0x001CF8, "Member 'ABP_Veti_Vehicle_Base_C::Mid' has a wrong offset!");

}

