#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_VehicleWreck_Warden

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Tempest_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_VehicleWreck_Warden.BP_VehicleWreck_Warden_C
// 0x0110 (0x04B0 - 0x03A0)
class ABP_VehicleWreck_Warden_C final : public ATedVehicleWreckActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   SM_WreckVETWarden_Top;                             // 0x03A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_WreckVETWarden_FrontL;                          // 0x03B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_WreckVETWarden_FrontR;                          // 0x03B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_WreckVETWarden_MiddleTop;                       // 0x03C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      PS_Dissolve;                                       // 0x03C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      PS_Dissolve_MiddleTop;                             // 0x03D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      PS_Dissolve_FrontR;                                // 0x03D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      PS_Dissolve_FrontL;                                // 0x03E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      PS_Dissolve_Top;                                   // 0x03E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_Vines_Rotting_E77CB06D4A2B9C4BDB3DEBA2D0C8D96B; // 0x03F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_Pod_Death_E77CB06D4A2B9C4BDB3DEBA2D0C8D96B; // 0x03F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_Dissolve_Parts_E77CB06D4A2B9C4BDB3DEBA2D0C8D96B; // 0x03F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_E77CB06D4A2B9C4BDB3DEBA2D0C8D96B; // 0x03FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3FD[0x3];                                      // 0x03FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x0400(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_Vines_Rotting_52DF855A4F8A528510FCDEB883FE6C73; // 0x0408(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_Pod_Death_52DF855A4F8A528510FCDEB883FE6C73; // 0x040C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_Dissolve_Main_52DF855A4F8A528510FCDEB883FE6C73; // 0x0410(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline__Direction_52DF855A4F8A528510FCDEB883FE6C73; // 0x0414(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_415[0x3];                                      // 0x0415(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline;                                          // 0x0418(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             ActorTransformCache;                               // 0x0420(0x0060)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        VelocityVectorLength;                              // 0x0480(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                VelocityToTransfer;                                // 0x0488(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MaxBaseVelocityVectorLength;                       // 0x04A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Dissolved;                                         // 0x04A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__BP_VehicleWreck_MediumTank_Mesh_K2Node_ComponentBoundEvent_2_ComponentHitSignature__DelegateSignature(class UPrimitiveComponent* HitComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, const struct FVector& NormalImpulse, const struct FHitResult& Hit);
	void ExecuteUbergraph_BP_VehicleWreck_Warden(int32 EntryPoint);
	void ReceiveBeginPlay();
	void Timeline_0__FinishedFunc();
	void Timeline_0__UpdateFunc();
	void Timeline__FinishedFunc();
	void Timeline__Treat_as_Dissolved__EventFunc();
	void Timeline__UpdateFunc();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_VehicleWreck_Warden_C">();
	}
	static class ABP_VehicleWreck_Warden_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_VehicleWreck_Warden_C>();
	}
};
static_assert(alignof(ABP_VehicleWreck_Warden_C) == 0x000010, "Wrong alignment on ABP_VehicleWreck_Warden_C");
static_assert(sizeof(ABP_VehicleWreck_Warden_C) == 0x0004B0, "Wrong size on ABP_VehicleWreck_Warden_C");
static_assert(offsetof(ABP_VehicleWreck_Warden_C, UberGraphFrame) == 0x0003A0, "Member 'ABP_VehicleWreck_Warden_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_VehicleWreck_Warden_C, SM_WreckVETWarden_Top) == 0x0003A8, "Member 'ABP_VehicleWreck_Warden_C::SM_WreckVETWarden_Top' has a wrong offset!");
static_assert(offsetof(ABP_VehicleWreck_Warden_C, SM_WreckVETWarden_FrontL) == 0x0003B0, "Member 'ABP_VehicleWreck_Warden_C::SM_WreckVETWarden_FrontL' has a wrong offset!");
static_assert(offsetof(ABP_VehicleWreck_Warden_C, SM_WreckVETWarden_FrontR) == 0x0003B8, "Member 'ABP_VehicleWreck_Warden_C::SM_WreckVETWarden_FrontR' has a wrong offset!");
static_assert(offsetof(ABP_VehicleWreck_Warden_C, SM_WreckVETWarden_MiddleTop) == 0x0003C0, "Member 'ABP_VehicleWreck_Warden_C::SM_WreckVETWarden_MiddleTop' has a wrong offset!");
static_assert(offsetof(ABP_VehicleWreck_Warden_C, PS_Dissolve) == 0x0003C8, "Member 'ABP_VehicleWreck_Warden_C::PS_Dissolve' has a wrong offset!");
static_assert(offsetof(ABP_VehicleWreck_Warden_C, PS_Dissolve_MiddleTop) == 0x0003D0, "Member 'ABP_VehicleWreck_Warden_C::PS_Dissolve_MiddleTop' has a wrong offset!");
static_assert(offsetof(ABP_VehicleWreck_Warden_C, PS_Dissolve_FrontR) == 0x0003D8, "Member 'ABP_VehicleWreck_Warden_C::PS_Dissolve_FrontR' has a wrong offset!");
static_assert(offsetof(ABP_VehicleWreck_Warden_C, PS_Dissolve_FrontL) == 0x0003E0, "Member 'ABP_VehicleWreck_Warden_C::PS_Dissolve_FrontL' has a wrong offset!");
static_assert(offsetof(ABP_VehicleWreck_Warden_C, PS_Dissolve_Top) == 0x0003E8, "Member 'ABP_VehicleWreck_Warden_C::PS_Dissolve_Top' has a wrong offset!");
static_assert(offsetof(ABP_VehicleWreck_Warden_C, Timeline_0_Vines_Rotting_E77CB06D4A2B9C4BDB3DEBA2D0C8D96B) == 0x0003F0, "Member 'ABP_VehicleWreck_Warden_C::Timeline_0_Vines_Rotting_E77CB06D4A2B9C4BDB3DEBA2D0C8D96B' has a wrong offset!");
static_assert(offsetof(ABP_VehicleWreck_Warden_C, Timeline_0_Pod_Death_E77CB06D4A2B9C4BDB3DEBA2D0C8D96B) == 0x0003F4, "Member 'ABP_VehicleWreck_Warden_C::Timeline_0_Pod_Death_E77CB06D4A2B9C4BDB3DEBA2D0C8D96B' has a wrong offset!");
static_assert(offsetof(ABP_VehicleWreck_Warden_C, Timeline_0_Dissolve_Parts_E77CB06D4A2B9C4BDB3DEBA2D0C8D96B) == 0x0003F8, "Member 'ABP_VehicleWreck_Warden_C::Timeline_0_Dissolve_Parts_E77CB06D4A2B9C4BDB3DEBA2D0C8D96B' has a wrong offset!");
static_assert(offsetof(ABP_VehicleWreck_Warden_C, Timeline_0__Direction_E77CB06D4A2B9C4BDB3DEBA2D0C8D96B) == 0x0003FC, "Member 'ABP_VehicleWreck_Warden_C::Timeline_0__Direction_E77CB06D4A2B9C4BDB3DEBA2D0C8D96B' has a wrong offset!");
static_assert(offsetof(ABP_VehicleWreck_Warden_C, Timeline_0) == 0x000400, "Member 'ABP_VehicleWreck_Warden_C::Timeline_0' has a wrong offset!");
static_assert(offsetof(ABP_VehicleWreck_Warden_C, Timeline_Vines_Rotting_52DF855A4F8A528510FCDEB883FE6C73) == 0x000408, "Member 'ABP_VehicleWreck_Warden_C::Timeline_Vines_Rotting_52DF855A4F8A528510FCDEB883FE6C73' has a wrong offset!");
static_assert(offsetof(ABP_VehicleWreck_Warden_C, Timeline_Pod_Death_52DF855A4F8A528510FCDEB883FE6C73) == 0x00040C, "Member 'ABP_VehicleWreck_Warden_C::Timeline_Pod_Death_52DF855A4F8A528510FCDEB883FE6C73' has a wrong offset!");
static_assert(offsetof(ABP_VehicleWreck_Warden_C, Timeline_Dissolve_Main_52DF855A4F8A528510FCDEB883FE6C73) == 0x000410, "Member 'ABP_VehicleWreck_Warden_C::Timeline_Dissolve_Main_52DF855A4F8A528510FCDEB883FE6C73' has a wrong offset!");
static_assert(offsetof(ABP_VehicleWreck_Warden_C, Timeline__Direction_52DF855A4F8A528510FCDEB883FE6C73) == 0x000414, "Member 'ABP_VehicleWreck_Warden_C::Timeline__Direction_52DF855A4F8A528510FCDEB883FE6C73' has a wrong offset!");
static_assert(offsetof(ABP_VehicleWreck_Warden_C, Timeline) == 0x000418, "Member 'ABP_VehicleWreck_Warden_C::Timeline' has a wrong offset!");
static_assert(offsetof(ABP_VehicleWreck_Warden_C, ActorTransformCache) == 0x000420, "Member 'ABP_VehicleWreck_Warden_C::ActorTransformCache' has a wrong offset!");
static_assert(offsetof(ABP_VehicleWreck_Warden_C, VelocityVectorLength) == 0x000480, "Member 'ABP_VehicleWreck_Warden_C::VelocityVectorLength' has a wrong offset!");
static_assert(offsetof(ABP_VehicleWreck_Warden_C, VelocityToTransfer) == 0x000488, "Member 'ABP_VehicleWreck_Warden_C::VelocityToTransfer' has a wrong offset!");
static_assert(offsetof(ABP_VehicleWreck_Warden_C, MaxBaseVelocityVectorLength) == 0x0004A0, "Member 'ABP_VehicleWreck_Warden_C::MaxBaseVelocityVectorLength' has a wrong offset!");
static_assert(offsetof(ABP_VehicleWreck_Warden_C, Dissolved) == 0x0004A8, "Member 'ABP_VehicleWreck_Warden_C::Dissolved' has a wrong offset!");

}

