#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_VETI_Vehicle_Vimana

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_VETI_Vehicle_Vimana.BP_VETI_Vehicle_Vimana_C.ExecuteUbergraph_BP_VETI_Vehicle_Vimana
// 0x0140 (0x0140 - 0x0000)
struct BP_VETI_Vehicle_Vimana_C_ExecuteUbergraph_BP_VETI_Vehicle_Vimana final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_1;          // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_2;          // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_3;          // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_HealthPct;                            // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x0010(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 CallFunc_MakeGameplayCueParameters_ReturnValue;    // 0x0030(0x00D8)(ContainsInstancedReference)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue_1;          // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue_2;          // 0x010A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x010B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x010C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x010D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_4;          // 0x010E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x010F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_111[0x3];                                      // 0x0111(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_RemoveActiveEffectsWithGrantedTags_ReturnValue; // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_2;               // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_119[0x3];                                      // 0x0119(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue; // 0x011C(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0124(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsSelected;                          // 0x0125(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsHovered;                           // 0x0126(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0127(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast;         // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast_1;       // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast_2;       // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_VETI_Vehicle_Vimana_C_ExecuteUbergraph_BP_VETI_Vehicle_Vimana) == 0x000008, "Wrong alignment on BP_VETI_Vehicle_Vimana_C_ExecuteUbergraph_BP_VETI_Vehicle_Vimana");
static_assert(sizeof(BP_VETI_Vehicle_Vimana_C_ExecuteUbergraph_BP_VETI_Vehicle_Vimana) == 0x000140, "Wrong size on BP_VETI_Vehicle_Vimana_C_ExecuteUbergraph_BP_VETI_Vehicle_Vimana");
static_assert(offsetof(BP_VETI_Vehicle_Vimana_C_ExecuteUbergraph_BP_VETI_Vehicle_Vimana, EntryPoint) == 0x000000, "Member 'BP_VETI_Vehicle_Vimana_C_ExecuteUbergraph_BP_VETI_Vehicle_Vimana::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_VETI_Vehicle_Vimana_C_ExecuteUbergraph_BP_VETI_Vehicle_Vimana, CallFunc_IsDedicatedServer_ReturnValue) == 0x000004, "Member 'BP_VETI_Vehicle_Vimana_C_ExecuteUbergraph_BP_VETI_Vehicle_Vimana::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VETI_Vehicle_Vimana_C_ExecuteUbergraph_BP_VETI_Vehicle_Vimana, CallFunc_IsDedicatedServer_ReturnValue_1) == 0x000005, "Member 'BP_VETI_Vehicle_Vimana_C_ExecuteUbergraph_BP_VETI_Vehicle_Vimana::CallFunc_IsDedicatedServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_VETI_Vehicle_Vimana_C_ExecuteUbergraph_BP_VETI_Vehicle_Vimana, CallFunc_IsDedicatedServer_ReturnValue_2) == 0x000006, "Member 'BP_VETI_Vehicle_Vimana_C_ExecuteUbergraph_BP_VETI_Vehicle_Vimana::CallFunc_IsDedicatedServer_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_VETI_Vehicle_Vimana_C_ExecuteUbergraph_BP_VETI_Vehicle_Vimana, CallFunc_IsDedicatedServer_ReturnValue_3) == 0x000007, "Member 'BP_VETI_Vehicle_Vimana_C_ExecuteUbergraph_BP_VETI_Vehicle_Vimana::CallFunc_IsDedicatedServer_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_VETI_Vehicle_Vimana_C_ExecuteUbergraph_BP_VETI_Vehicle_Vimana, K2Node_Event_HealthPct) == 0x000008, "Member 'BP_VETI_Vehicle_Vimana_C_ExecuteUbergraph_BP_VETI_Vehicle_Vimana::K2Node_Event_HealthPct' has a wrong offset!");
static_assert(offsetof(BP_VETI_Vehicle_Vimana_C_ExecuteUbergraph_BP_VETI_Vehicle_Vimana, CallFunc_GetSocketLocation_ReturnValue) == 0x000010, "Member 'BP_VETI_Vehicle_Vimana_C_ExecuteUbergraph_BP_VETI_Vehicle_Vimana::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VETI_Vehicle_Vimana_C_ExecuteUbergraph_BP_VETI_Vehicle_Vimana, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000028, "Member 'BP_VETI_Vehicle_Vimana_C_ExecuteUbergraph_BP_VETI_Vehicle_Vimana::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VETI_Vehicle_Vimana_C_ExecuteUbergraph_BP_VETI_Vehicle_Vimana, CallFunc_MakeGameplayCueParameters_ReturnValue) == 0x000030, "Member 'BP_VETI_Vehicle_Vimana_C_ExecuteUbergraph_BP_VETI_Vehicle_Vimana::CallFunc_MakeGameplayCueParameters_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VETI_Vehicle_Vimana_C_ExecuteUbergraph_BP_VETI_Vehicle_Vimana, CallFunc_Less_DoubleDouble_ReturnValue_1) == 0x000108, "Member 'BP_VETI_Vehicle_Vimana_C_ExecuteUbergraph_BP_VETI_Vehicle_Vimana::CallFunc_Less_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_VETI_Vehicle_Vimana_C_ExecuteUbergraph_BP_VETI_Vehicle_Vimana, CallFunc_Not_PreBool_ReturnValue) == 0x000109, "Member 'BP_VETI_Vehicle_Vimana_C_ExecuteUbergraph_BP_VETI_Vehicle_Vimana::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VETI_Vehicle_Vimana_C_ExecuteUbergraph_BP_VETI_Vehicle_Vimana, CallFunc_Less_DoubleDouble_ReturnValue_2) == 0x00010A, "Member 'BP_VETI_Vehicle_Vimana_C_ExecuteUbergraph_BP_VETI_Vehicle_Vimana::CallFunc_Less_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_VETI_Vehicle_Vimana_C_ExecuteUbergraph_BP_VETI_Vehicle_Vimana, CallFunc_BooleanAND_ReturnValue) == 0x00010B, "Member 'BP_VETI_Vehicle_Vimana_C_ExecuteUbergraph_BP_VETI_Vehicle_Vimana::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VETI_Vehicle_Vimana_C_ExecuteUbergraph_BP_VETI_Vehicle_Vimana, CallFunc_Not_PreBool_ReturnValue_1) == 0x00010C, "Member 'BP_VETI_Vehicle_Vimana_C_ExecuteUbergraph_BP_VETI_Vehicle_Vimana::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_VETI_Vehicle_Vimana_C_ExecuteUbergraph_BP_VETI_Vehicle_Vimana, CallFunc_BooleanAND_ReturnValue_1) == 0x00010D, "Member 'BP_VETI_Vehicle_Vimana_C_ExecuteUbergraph_BP_VETI_Vehicle_Vimana::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_VETI_Vehicle_Vimana_C_ExecuteUbergraph_BP_VETI_Vehicle_Vimana, CallFunc_IsDedicatedServer_ReturnValue_4) == 0x00010E, "Member 'BP_VETI_Vehicle_Vimana_C_ExecuteUbergraph_BP_VETI_Vehicle_Vimana::CallFunc_IsDedicatedServer_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_VETI_Vehicle_Vimana_C_ExecuteUbergraph_BP_VETI_Vehicle_Vimana, CallFunc_HasAuthority_ReturnValue) == 0x00010F, "Member 'BP_VETI_Vehicle_Vimana_C_ExecuteUbergraph_BP_VETI_Vehicle_Vimana::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VETI_Vehicle_Vimana_C_ExecuteUbergraph_BP_VETI_Vehicle_Vimana, CallFunc_HasAuthority_ReturnValue_1) == 0x000110, "Member 'BP_VETI_Vehicle_Vimana_C_ExecuteUbergraph_BP_VETI_Vehicle_Vimana::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_VETI_Vehicle_Vimana_C_ExecuteUbergraph_BP_VETI_Vehicle_Vimana, CallFunc_RemoveActiveEffectsWithGrantedTags_ReturnValue) == 0x000114, "Member 'BP_VETI_Vehicle_Vimana_C_ExecuteUbergraph_BP_VETI_Vehicle_Vimana::CallFunc_RemoveActiveEffectsWithGrantedTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VETI_Vehicle_Vimana_C_ExecuteUbergraph_BP_VETI_Vehicle_Vimana, CallFunc_HasAuthority_ReturnValue_2) == 0x000118, "Member 'BP_VETI_Vehicle_Vimana_C_ExecuteUbergraph_BP_VETI_Vehicle_Vimana::CallFunc_HasAuthority_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_VETI_Vehicle_Vimana_C_ExecuteUbergraph_BP_VETI_Vehicle_Vimana, CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue) == 0x00011C, "Member 'BP_VETI_Vehicle_Vimana_C_ExecuteUbergraph_BP_VETI_Vehicle_Vimana::CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VETI_Vehicle_Vimana_C_ExecuteUbergraph_BP_VETI_Vehicle_Vimana, CallFunc_BooleanOR_ReturnValue) == 0x000124, "Member 'BP_VETI_Vehicle_Vimana_C_ExecuteUbergraph_BP_VETI_Vehicle_Vimana::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VETI_Vehicle_Vimana_C_ExecuteUbergraph_BP_VETI_Vehicle_Vimana, K2Node_Event_bIsSelected) == 0x000125, "Member 'BP_VETI_Vehicle_Vimana_C_ExecuteUbergraph_BP_VETI_Vehicle_Vimana::K2Node_Event_bIsSelected' has a wrong offset!");
static_assert(offsetof(BP_VETI_Vehicle_Vimana_C_ExecuteUbergraph_BP_VETI_Vehicle_Vimana, K2Node_Event_bIsHovered) == 0x000126, "Member 'BP_VETI_Vehicle_Vimana_C_ExecuteUbergraph_BP_VETI_Vehicle_Vimana::K2Node_Event_bIsHovered' has a wrong offset!");
static_assert(offsetof(BP_VETI_Vehicle_Vimana_C_ExecuteUbergraph_BP_VETI_Vehicle_Vimana, CallFunc_IsValid_ReturnValue) == 0x000127, "Member 'BP_VETI_Vehicle_Vimana_C_ExecuteUbergraph_BP_VETI_Vehicle_Vimana::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VETI_Vehicle_Vimana_C_ExecuteUbergraph_BP_VETI_Vehicle_Vimana, CallFunc_Less_DoubleDouble_A_ImplicitCast) == 0x000128, "Member 'BP_VETI_Vehicle_Vimana_C_ExecuteUbergraph_BP_VETI_Vehicle_Vimana::CallFunc_Less_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_VETI_Vehicle_Vimana_C_ExecuteUbergraph_BP_VETI_Vehicle_Vimana, CallFunc_Less_DoubleDouble_A_ImplicitCast_1) == 0x000130, "Member 'BP_VETI_Vehicle_Vimana_C_ExecuteUbergraph_BP_VETI_Vehicle_Vimana::CallFunc_Less_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_VETI_Vehicle_Vimana_C_ExecuteUbergraph_BP_VETI_Vehicle_Vimana, CallFunc_Less_DoubleDouble_A_ImplicitCast_2) == 0x000138, "Member 'BP_VETI_Vehicle_Vimana_C_ExecuteUbergraph_BP_VETI_Vehicle_Vimana::CallFunc_Less_DoubleDouble_A_ImplicitCast_2' has a wrong offset!");

// Function BP_VETI_Vehicle_Vimana.BP_VETI_Vehicle_Vimana_C.OnSelectionChanged_Blueprint
// 0x0002 (0x0002 - 0x0000)
struct BP_VETI_Vehicle_Vimana_C_OnSelectionChanged_Blueprint final
{
public:
	bool                                          bIsSelected;                                       // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsHovered;                                        // 0x0001(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_VETI_Vehicle_Vimana_C_OnSelectionChanged_Blueprint) == 0x000001, "Wrong alignment on BP_VETI_Vehicle_Vimana_C_OnSelectionChanged_Blueprint");
static_assert(sizeof(BP_VETI_Vehicle_Vimana_C_OnSelectionChanged_Blueprint) == 0x000002, "Wrong size on BP_VETI_Vehicle_Vimana_C_OnSelectionChanged_Blueprint");
static_assert(offsetof(BP_VETI_Vehicle_Vimana_C_OnSelectionChanged_Blueprint, bIsSelected) == 0x000000, "Member 'BP_VETI_Vehicle_Vimana_C_OnSelectionChanged_Blueprint::bIsSelected' has a wrong offset!");
static_assert(offsetof(BP_VETI_Vehicle_Vimana_C_OnSelectionChanged_Blueprint, bIsHovered) == 0x000001, "Member 'BP_VETI_Vehicle_Vimana_C_OnSelectionChanged_Blueprint::bIsHovered' has a wrong offset!");

// Function BP_VETI_Vehicle_Vimana.BP_VETI_Vehicle_Vimana_C.ReceiveUpdateHealthEffects
// 0x0004 (0x0004 - 0x0000)
struct BP_VETI_Vehicle_Vimana_C_ReceiveUpdateHealthEffects final
{
public:
	float                                         HealthPct;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_VETI_Vehicle_Vimana_C_ReceiveUpdateHealthEffects) == 0x000004, "Wrong alignment on BP_VETI_Vehicle_Vimana_C_ReceiveUpdateHealthEffects");
static_assert(sizeof(BP_VETI_Vehicle_Vimana_C_ReceiveUpdateHealthEffects) == 0x000004, "Wrong size on BP_VETI_Vehicle_Vimana_C_ReceiveUpdateHealthEffects");
static_assert(offsetof(BP_VETI_Vehicle_Vimana_C_ReceiveUpdateHealthEffects, HealthPct) == 0x000000, "Member 'BP_VETI_Vehicle_Vimana_C_ReceiveUpdateHealthEffects::HealthPct' has a wrong offset!");

// Function BP_VETI_Vehicle_Vimana.BP_VETI_Vehicle_Vimana_C.UpdateDetectionRangeDecal
// 0x0010 (0x0010 - 0x0000)
struct BP_VETI_Vehicle_Vimana_C_UpdateDetectionRangeDecal final
{
public:
	double                                        CallFunc_MakeLiteralDouble_ReturnValue;            // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetRadius_Radius_ImplicitCast;            // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_VETI_Vehicle_Vimana_C_UpdateDetectionRangeDecal) == 0x000008, "Wrong alignment on BP_VETI_Vehicle_Vimana_C_UpdateDetectionRangeDecal");
static_assert(sizeof(BP_VETI_Vehicle_Vimana_C_UpdateDetectionRangeDecal) == 0x000010, "Wrong size on BP_VETI_Vehicle_Vimana_C_UpdateDetectionRangeDecal");
static_assert(offsetof(BP_VETI_Vehicle_Vimana_C_UpdateDetectionRangeDecal, CallFunc_MakeLiteralDouble_ReturnValue) == 0x000000, "Member 'BP_VETI_Vehicle_Vimana_C_UpdateDetectionRangeDecal::CallFunc_MakeLiteralDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VETI_Vehicle_Vimana_C_UpdateDetectionRangeDecal, CallFunc_SetRadius_Radius_ImplicitCast) == 0x000008, "Member 'BP_VETI_Vehicle_Vimana_C_UpdateDetectionRangeDecal::CallFunc_SetRadius_Radius_ImplicitCast' has a wrong offset!");

}

