#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_VETI_Vehicle_Thunderhead

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_Veti_Aircraft_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_VETI_Vehicle_Thunderhead.BP_VETI_Vehicle_Thunderhead_C
// 0x0060 (0x1DA0 - 0x1D40)
class ABP_VETI_Vehicle_Thunderhead_C final : public ABP_Veti_Aircraft_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_VETI_Vehicle_Thunderhead_C;      // 0x1D40(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UParticleSystemComponent*               PS_SmokeVETVehicleDamageLight;                     // 0x1D48(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               PS_SmokeVETVehicleDamageMedium;                    // 0x1D50(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               PS_SmokeVETVehicleDamageHeavy;                     // 0x1D58(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               PS_SmokeTempest_4;                                 // 0x1D60(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               PS_SmokeTempest_3;                                 // 0x1D68(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               PS_SmokeTempest_2;                                 // 0x1D70(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               PS_SmokeTempest_1;                                 // 0x1D78(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               PS_Hover_1;                                        // 0x1D80(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               PS_FlareVETGoldenCannonGlobe_01;                   // 0x1D88(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTedPawnContainerComponent*             TedPawnContainer;                                  // 0x1D90(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_VETI_Vehicle_Thunderhead(int32 EntryPoint);
	void ReceiveBeginMovement();
	void ReceiveBeginPlay();
	void ReceiveEndMovement();
	void ReceiveOnDeath();
	void ReceiveUpdateHealthEffects(float HealthPct);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_VETI_Vehicle_Thunderhead_C">();
	}
	static class ABP_VETI_Vehicle_Thunderhead_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_VETI_Vehicle_Thunderhead_C>();
	}
};
static_assert(alignof(ABP_VETI_Vehicle_Thunderhead_C) == 0x000010, "Wrong alignment on ABP_VETI_Vehicle_Thunderhead_C");
static_assert(sizeof(ABP_VETI_Vehicle_Thunderhead_C) == 0x001DA0, "Wrong size on ABP_VETI_Vehicle_Thunderhead_C");
static_assert(offsetof(ABP_VETI_Vehicle_Thunderhead_C, UberGraphFrame_BP_VETI_Vehicle_Thunderhead_C) == 0x001D40, "Member 'ABP_VETI_Vehicle_Thunderhead_C::UberGraphFrame_BP_VETI_Vehicle_Thunderhead_C' has a wrong offset!");
static_assert(offsetof(ABP_VETI_Vehicle_Thunderhead_C, PS_SmokeVETVehicleDamageLight) == 0x001D48, "Member 'ABP_VETI_Vehicle_Thunderhead_C::PS_SmokeVETVehicleDamageLight' has a wrong offset!");
static_assert(offsetof(ABP_VETI_Vehicle_Thunderhead_C, PS_SmokeVETVehicleDamageMedium) == 0x001D50, "Member 'ABP_VETI_Vehicle_Thunderhead_C::PS_SmokeVETVehicleDamageMedium' has a wrong offset!");
static_assert(offsetof(ABP_VETI_Vehicle_Thunderhead_C, PS_SmokeVETVehicleDamageHeavy) == 0x001D58, "Member 'ABP_VETI_Vehicle_Thunderhead_C::PS_SmokeVETVehicleDamageHeavy' has a wrong offset!");
static_assert(offsetof(ABP_VETI_Vehicle_Thunderhead_C, PS_SmokeTempest_4) == 0x001D60, "Member 'ABP_VETI_Vehicle_Thunderhead_C::PS_SmokeTempest_4' has a wrong offset!");
static_assert(offsetof(ABP_VETI_Vehicle_Thunderhead_C, PS_SmokeTempest_3) == 0x001D68, "Member 'ABP_VETI_Vehicle_Thunderhead_C::PS_SmokeTempest_3' has a wrong offset!");
static_assert(offsetof(ABP_VETI_Vehicle_Thunderhead_C, PS_SmokeTempest_2) == 0x001D70, "Member 'ABP_VETI_Vehicle_Thunderhead_C::PS_SmokeTempest_2' has a wrong offset!");
static_assert(offsetof(ABP_VETI_Vehicle_Thunderhead_C, PS_SmokeTempest_1) == 0x001D78, "Member 'ABP_VETI_Vehicle_Thunderhead_C::PS_SmokeTempest_1' has a wrong offset!");
static_assert(offsetof(ABP_VETI_Vehicle_Thunderhead_C, PS_Hover_1) == 0x001D80, "Member 'ABP_VETI_Vehicle_Thunderhead_C::PS_Hover_1' has a wrong offset!");
static_assert(offsetof(ABP_VETI_Vehicle_Thunderhead_C, PS_FlareVETGoldenCannonGlobe_01) == 0x001D88, "Member 'ABP_VETI_Vehicle_Thunderhead_C::PS_FlareVETGoldenCannonGlobe_01' has a wrong offset!");
static_assert(offsetof(ABP_VETI_Vehicle_Thunderhead_C, TedPawnContainer) == 0x001D90, "Member 'ABP_VETI_Vehicle_Thunderhead_C::TedPawnContainer' has a wrong offset!");

}

