#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Veti_Infantry_Base

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_Infantry_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Veti_Infantry_Base.BP_Veti_Infantry_Base_C
// 0x0030 (0x1BF0 - 0x1BC0)
class ABP_Veti_Infantry_Base_C : public ABP_Infantry_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1BC0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      PS_VetiShield;                                     // 0x1BC8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         TL_Shield_Opacity_1366779441CA2FAB5CA2C88E7C99DD69; // 0x1BD0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            TL_Shield__Direction_1366779441CA2FAB5CA2C88E7C99DD69; // 0x1BD4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1BD5[0x3];                                     // 0x1BD5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     TL_Shield;                                         // 0x1BD8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               Mid;                                               // 0x1BE0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         Primary_Material_Index;                            // 0x1BE8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Veti_Infantry_Base(int32 EntryPoint);
	void OnReceiveGravityManipulators();
	void OnReceiveLifebloodBattery();
	void OnReceiveRegrowthProtocols();
	void OnReceiveShield();
	void OnReceiveSpecificDeathEnlightened();
	void ReceiveBeginPlay();
	void ReceiveOnDeath();
	void TL_Shield__FinishedFunc();
	void TL_Shield__UpdateFunc();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Veti_Infantry_Base_C">();
	}
	static class ABP_Veti_Infantry_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Veti_Infantry_Base_C>();
	}
};
static_assert(alignof(ABP_Veti_Infantry_Base_C) == 0x000010, "Wrong alignment on ABP_Veti_Infantry_Base_C");
static_assert(sizeof(ABP_Veti_Infantry_Base_C) == 0x001BF0, "Wrong size on ABP_Veti_Infantry_Base_C");
static_assert(offsetof(ABP_Veti_Infantry_Base_C, UberGraphFrame) == 0x001BC0, "Member 'ABP_Veti_Infantry_Base_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Veti_Infantry_Base_C, PS_VetiShield) == 0x001BC8, "Member 'ABP_Veti_Infantry_Base_C::PS_VetiShield' has a wrong offset!");
static_assert(offsetof(ABP_Veti_Infantry_Base_C, TL_Shield_Opacity_1366779441CA2FAB5CA2C88E7C99DD69) == 0x001BD0, "Member 'ABP_Veti_Infantry_Base_C::TL_Shield_Opacity_1366779441CA2FAB5CA2C88E7C99DD69' has a wrong offset!");
static_assert(offsetof(ABP_Veti_Infantry_Base_C, TL_Shield__Direction_1366779441CA2FAB5CA2C88E7C99DD69) == 0x001BD4, "Member 'ABP_Veti_Infantry_Base_C::TL_Shield__Direction_1366779441CA2FAB5CA2C88E7C99DD69' has a wrong offset!");
static_assert(offsetof(ABP_Veti_Infantry_Base_C, TL_Shield) == 0x001BD8, "Member 'ABP_Veti_Infantry_Base_C::TL_Shield' has a wrong offset!");
static_assert(offsetof(ABP_Veti_Infantry_Base_C, Mid) == 0x001BE0, "Member 'ABP_Veti_Infantry_Base_C::Mid' has a wrong offset!");
static_assert(offsetof(ABP_Veti_Infantry_Base_C, Primary_Material_Index) == 0x001BE8, "Member 'ABP_Veti_Infantry_Base_C::Primary_Material_Index' has a wrong offset!");

}

