#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_VehicleWreck

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_VehicleWreck.BP_VehicleWreck_C.ExecuteUbergraph_BP_VehicleWreck
// 0x0058 (0x0058 - 0x0000)
struct BP_VehicleWreck_C_ExecuteUbergraph_BP_VehicleWreck final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_RandomFloatInRange_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0010(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        CallFunc_SpawnDecalAtLocation_ReturnValue;         // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UFXSystemComponent*                     CallFunc_SpawnEffectAtLocation_ReturnValue;        // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_MakeRotator_Yaw_ImplicitCast;             // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_VehicleWreck_C_ExecuteUbergraph_BP_VehicleWreck) == 0x000008, "Wrong alignment on BP_VehicleWreck_C_ExecuteUbergraph_BP_VehicleWreck");
static_assert(sizeof(BP_VehicleWreck_C_ExecuteUbergraph_BP_VehicleWreck) == 0x000058, "Wrong size on BP_VehicleWreck_C_ExecuteUbergraph_BP_VehicleWreck");
static_assert(offsetof(BP_VehicleWreck_C_ExecuteUbergraph_BP_VehicleWreck, EntryPoint) == 0x000000, "Member 'BP_VehicleWreck_C_ExecuteUbergraph_BP_VehicleWreck::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_VehicleWreck_C_ExecuteUbergraph_BP_VehicleWreck, CallFunc_RandomFloatInRange_ReturnValue) == 0x000008, "Member 'BP_VehicleWreck_C_ExecuteUbergraph_BP_VehicleWreck::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VehicleWreck_C_ExecuteUbergraph_BP_VehicleWreck, CallFunc_MakeRotator_ReturnValue) == 0x000010, "Member 'BP_VehicleWreck_C_ExecuteUbergraph_BP_VehicleWreck::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VehicleWreck_C_ExecuteUbergraph_BP_VehicleWreck, CallFunc_GetSocketLocation_ReturnValue) == 0x000028, "Member 'BP_VehicleWreck_C_ExecuteUbergraph_BP_VehicleWreck::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VehicleWreck_C_ExecuteUbergraph_BP_VehicleWreck, CallFunc_SpawnDecalAtLocation_ReturnValue) == 0x000040, "Member 'BP_VehicleWreck_C_ExecuteUbergraph_BP_VehicleWreck::CallFunc_SpawnDecalAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VehicleWreck_C_ExecuteUbergraph_BP_VehicleWreck, CallFunc_SpawnEffectAtLocation_ReturnValue) == 0x000048, "Member 'BP_VehicleWreck_C_ExecuteUbergraph_BP_VehicleWreck::CallFunc_SpawnEffectAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VehicleWreck_C_ExecuteUbergraph_BP_VehicleWreck, CallFunc_IsValid_ReturnValue) == 0x000050, "Member 'BP_VehicleWreck_C_ExecuteUbergraph_BP_VehicleWreck::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VehicleWreck_C_ExecuteUbergraph_BP_VehicleWreck, CallFunc_MakeRotator_Yaw_ImplicitCast) == 0x000054, "Member 'BP_VehicleWreck_C_ExecuteUbergraph_BP_VehicleWreck::CallFunc_MakeRotator_Yaw_ImplicitCast' has a wrong offset!");

}

