#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_VehicleWreck_Luminary

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Tempest_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_VehicleWreck_Luminary.BP_VehicleWreck_Luminary_C
// 0x0120 (0x04C0 - 0x03A0)
class ABP_VehicleWreck_Luminary_C final : public ATedVehicleWreckActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   SM_WreckVETLuminary_Head;                          // 0x03A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_WreckVETLuminary_BackTopL;                      // 0x03B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_WreckVETLuminary_BackTopR;                      // 0x03B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_WreckVETLuminary_BackBottomR;                   // 0x03C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_WreckVETLuminary_BackBottomL;                   // 0x03C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      PS_Dissolve;                                       // 0x03D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      PS_Dissolve_BackBottomR;                           // 0x03D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      PS_Dissolve_BackBottomL;                           // 0x03E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      PS_Dissolve_BackTopR;                              // 0x03E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      PS_Dissolve_BackTopL;                              // 0x03F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      PS_Dissolve_Head;                                  // 0x03F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_Dissolve_Parts_56A4798344BE0652F573D7A439CAA430; // 0x0400(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_56A4798344BE0652F573D7A439CAA430; // 0x0404(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_405[0x3];                                      // 0x0405(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x0408(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_Vines_Rotting_A36E530E43C1D29F05C711839B763A4B; // 0x0410(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_Pod_Death_A36E530E43C1D29F05C711839B763A4B; // 0x0414(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_Dissolve_Main_A36E530E43C1D29F05C711839B763A4B; // 0x0418(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline__Direction_A36E530E43C1D29F05C711839B763A4B; // 0x041C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41D[0x3];                                      // 0x041D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline;                                          // 0x0420(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_428[0x8];                                      // 0x0428(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             ActorTransformCache;                               // 0x0430(0x0060)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        VelocityVectorLength;                              // 0x0490(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                VelocityToTransfer;                                // 0x0498(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MaxBaseVelocityVectorLength;                       // 0x04B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Dissolved;                                         // 0x04B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__BP_VehicleWreck_MediumTank_Mesh_K2Node_ComponentBoundEvent_2_ComponentHitSignature__DelegateSignature(class UPrimitiveComponent* HitComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, const struct FVector& NormalImpulse, const struct FHitResult& Hit);
	void BndEvt__BP_VehicleWreck_MediumTank_SM_WreckMediumTank_02_K2Node_ComponentBoundEvent_1_ComponentHitSignature__DelegateSignature(class UPrimitiveComponent* HitComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, const struct FVector& NormalImpulse, const struct FHitResult& Hit);
	void ExecuteUbergraph_BP_VehicleWreck_Luminary(int32 EntryPoint);
	void ReceiveBeginPlay();
	void Timeline_0__FinishedFunc();
	void Timeline_0__UpdateFunc();
	void Timeline__FinishedFunc();
	void Timeline__Treat_as_Dissolved__EventFunc();
	void Timeline__UpdateFunc();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_VehicleWreck_Luminary_C">();
	}
	static class ABP_VehicleWreck_Luminary_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_VehicleWreck_Luminary_C>();
	}
};
static_assert(alignof(ABP_VehicleWreck_Luminary_C) == 0x000010, "Wrong alignment on ABP_VehicleWreck_Luminary_C");
static_assert(sizeof(ABP_VehicleWreck_Luminary_C) == 0x0004C0, "Wrong size on ABP_VehicleWreck_Luminary_C");
static_assert(offsetof(ABP_VehicleWreck_Luminary_C, UberGraphFrame) == 0x0003A0, "Member 'ABP_VehicleWreck_Luminary_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_VehicleWreck_Luminary_C, SM_WreckVETLuminary_Head) == 0x0003A8, "Member 'ABP_VehicleWreck_Luminary_C::SM_WreckVETLuminary_Head' has a wrong offset!");
static_assert(offsetof(ABP_VehicleWreck_Luminary_C, SM_WreckVETLuminary_BackTopL) == 0x0003B0, "Member 'ABP_VehicleWreck_Luminary_C::SM_WreckVETLuminary_BackTopL' has a wrong offset!");
static_assert(offsetof(ABP_VehicleWreck_Luminary_C, SM_WreckVETLuminary_BackTopR) == 0x0003B8, "Member 'ABP_VehicleWreck_Luminary_C::SM_WreckVETLuminary_BackTopR' has a wrong offset!");
static_assert(offsetof(ABP_VehicleWreck_Luminary_C, SM_WreckVETLuminary_BackBottomR) == 0x0003C0, "Member 'ABP_VehicleWreck_Luminary_C::SM_WreckVETLuminary_BackBottomR' has a wrong offset!");
static_assert(offsetof(ABP_VehicleWreck_Luminary_C, SM_WreckVETLuminary_BackBottomL) == 0x0003C8, "Member 'ABP_VehicleWreck_Luminary_C::SM_WreckVETLuminary_BackBottomL' has a wrong offset!");
static_assert(offsetof(ABP_VehicleWreck_Luminary_C, PS_Dissolve) == 0x0003D0, "Member 'ABP_VehicleWreck_Luminary_C::PS_Dissolve' has a wrong offset!");
static_assert(offsetof(ABP_VehicleWreck_Luminary_C, PS_Dissolve_BackBottomR) == 0x0003D8, "Member 'ABP_VehicleWreck_Luminary_C::PS_Dissolve_BackBottomR' has a wrong offset!");
static_assert(offsetof(ABP_VehicleWreck_Luminary_C, PS_Dissolve_BackBottomL) == 0x0003E0, "Member 'ABP_VehicleWreck_Luminary_C::PS_Dissolve_BackBottomL' has a wrong offset!");
static_assert(offsetof(ABP_VehicleWreck_Luminary_C, PS_Dissolve_BackTopR) == 0x0003E8, "Member 'ABP_VehicleWreck_Luminary_C::PS_Dissolve_BackTopR' has a wrong offset!");
static_assert(offsetof(ABP_VehicleWreck_Luminary_C, PS_Dissolve_BackTopL) == 0x0003F0, "Member 'ABP_VehicleWreck_Luminary_C::PS_Dissolve_BackTopL' has a wrong offset!");
static_assert(offsetof(ABP_VehicleWreck_Luminary_C, PS_Dissolve_Head) == 0x0003F8, "Member 'ABP_VehicleWreck_Luminary_C::PS_Dissolve_Head' has a wrong offset!");
static_assert(offsetof(ABP_VehicleWreck_Luminary_C, Timeline_0_Dissolve_Parts_56A4798344BE0652F573D7A439CAA430) == 0x000400, "Member 'ABP_VehicleWreck_Luminary_C::Timeline_0_Dissolve_Parts_56A4798344BE0652F573D7A439CAA430' has a wrong offset!");
static_assert(offsetof(ABP_VehicleWreck_Luminary_C, Timeline_0__Direction_56A4798344BE0652F573D7A439CAA430) == 0x000404, "Member 'ABP_VehicleWreck_Luminary_C::Timeline_0__Direction_56A4798344BE0652F573D7A439CAA430' has a wrong offset!");
static_assert(offsetof(ABP_VehicleWreck_Luminary_C, Timeline_0) == 0x000408, "Member 'ABP_VehicleWreck_Luminary_C::Timeline_0' has a wrong offset!");
static_assert(offsetof(ABP_VehicleWreck_Luminary_C, Timeline_Vines_Rotting_A36E530E43C1D29F05C711839B763A4B) == 0x000410, "Member 'ABP_VehicleWreck_Luminary_C::Timeline_Vines_Rotting_A36E530E43C1D29F05C711839B763A4B' has a wrong offset!");
static_assert(offsetof(ABP_VehicleWreck_Luminary_C, Timeline_Pod_Death_A36E530E43C1D29F05C711839B763A4B) == 0x000414, "Member 'ABP_VehicleWreck_Luminary_C::Timeline_Pod_Death_A36E530E43C1D29F05C711839B763A4B' has a wrong offset!");
static_assert(offsetof(ABP_VehicleWreck_Luminary_C, Timeline_Dissolve_Main_A36E530E43C1D29F05C711839B763A4B) == 0x000418, "Member 'ABP_VehicleWreck_Luminary_C::Timeline_Dissolve_Main_A36E530E43C1D29F05C711839B763A4B' has a wrong offset!");
static_assert(offsetof(ABP_VehicleWreck_Luminary_C, Timeline__Direction_A36E530E43C1D29F05C711839B763A4B) == 0x00041C, "Member 'ABP_VehicleWreck_Luminary_C::Timeline__Direction_A36E530E43C1D29F05C711839B763A4B' has a wrong offset!");
static_assert(offsetof(ABP_VehicleWreck_Luminary_C, Timeline) == 0x000420, "Member 'ABP_VehicleWreck_Luminary_C::Timeline' has a wrong offset!");
static_assert(offsetof(ABP_VehicleWreck_Luminary_C, ActorTransformCache) == 0x000430, "Member 'ABP_VehicleWreck_Luminary_C::ActorTransformCache' has a wrong offset!");
static_assert(offsetof(ABP_VehicleWreck_Luminary_C, VelocityVectorLength) == 0x000490, "Member 'ABP_VehicleWreck_Luminary_C::VelocityVectorLength' has a wrong offset!");
static_assert(offsetof(ABP_VehicleWreck_Luminary_C, VelocityToTransfer) == 0x000498, "Member 'ABP_VehicleWreck_Luminary_C::VelocityToTransfer' has a wrong offset!");
static_assert(offsetof(ABP_VehicleWreck_Luminary_C, MaxBaseVelocityVectorLength) == 0x0004B0, "Member 'ABP_VehicleWreck_Luminary_C::MaxBaseVelocityVectorLength' has a wrong offset!");
static_assert(offsetof(ABP_VehicleWreck_Luminary_C, Dissolved) == 0x0004B8, "Member 'ABP_VehicleWreck_Luminary_C::Dissolved' has a wrong offset!");

}

