#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_WireSpline

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_WireSpline.BP_WireSpline_C.UserConstructionScript
// 0x02C0 (0x02C0 - 0x0000)
struct BP_WireSpline_C_UserConstructionScript final
{
public:
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_GetScalarParameterValue_ReturnValue;   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetSplineLength_ReturnValue;              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorScale3D_ReturnValue;              // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_58[0x8];                                       // 0x0058(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Temp_struct_Variable;                              // 0x0060(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USplineMeshComponent*                   CallFunc_AddComponent_ReturnValue;                 // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_IntFloat_ReturnValue;            // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_IntFloat_ReturnValue_1;          // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetTangentAtDistanceAlongSpline_ReturnValue; // 0x00D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_ClampVectorSize_ReturnValue;              // 0x00F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue; // 0x0118(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_134[0x4];                                      // 0x0134(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetTangentAtDistanceAlongSpline_ReturnValue_1; // 0x0138(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_ClampVectorSize_ReturnValue_1;            // 0x0158(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue_1; // 0x0170(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_188[0x8];                                      // 0x0188(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Temp_struct_Variable_1;                            // 0x0190(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESplineMeshAxis                               Temp_byte_Variable;                                // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F1[0x7];                                      // 0x01F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USplineMeshComponent*                   CallFunc_AddComponent_ReturnValue_1;               // 0x01F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Select_Default;                             // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue_1;              // 0x0211(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_212[0x6];                                      // 0x0212(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetLocationAndTangentAtSplinePoint_Location; // 0x0218(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAndTangentAtSplinePoint_Tangent; // 0x0230(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAndTangentAtSplinePoint_Location_1; // 0x0248(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAndTangentAtSplinePoint_Tangent_1; // 0x0260(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumberOfSplinePoints_ReturnValue;      // 0x0280(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0284(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_289[0x7];                                      // 0x0289(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_VariableSet_Max_Emissive_ImplicitCast;      // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_A_ImplicitCast;       // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetLocationAtDistanceAlongSpline_Distance_ImplicitCast; // 0x02A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTangentAtDistanceAlongSpline_Distance_ImplicitCast; // 0x02A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetLocationAtDistanceAlongSpline_Distance_ImplicitCast_1; // 0x02A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTangentAtDistanceAlongSpline_Distance_ImplicitCast_1; // 0x02AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x02B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_WireSpline_C_UserConstructionScript) == 0x000010, "Wrong alignment on BP_WireSpline_C_UserConstructionScript");
static_assert(sizeof(BP_WireSpline_C_UserConstructionScript) == 0x0002C0, "Wrong size on BP_WireSpline_C_UserConstructionScript");
static_assert(offsetof(BP_WireSpline_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000000, "Member 'BP_WireSpline_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WireSpline_C_UserConstructionScript, CallFunc_K2_GetScalarParameterValue_ReturnValue) == 0x000008, "Member 'BP_WireSpline_C_UserConstructionScript::CallFunc_K2_GetScalarParameterValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WireSpline_C_UserConstructionScript, CallFunc_GetSplineLength_ReturnValue) == 0x00000C, "Member 'BP_WireSpline_C_UserConstructionScript::CallFunc_GetSplineLength_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WireSpline_C_UserConstructionScript, Temp_int_Variable) == 0x000010, "Member 'BP_WireSpline_C_UserConstructionScript::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_WireSpline_C_UserConstructionScript, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'BP_WireSpline_C_UserConstructionScript::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WireSpline_C_UserConstructionScript, CallFunc_Add_IntInt_ReturnValue_1) == 0x000018, "Member 'BP_WireSpline_C_UserConstructionScript::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WireSpline_C_UserConstructionScript, Temp_int_Variable_1) == 0x00001C, "Member 'BP_WireSpline_C_UserConstructionScript::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_WireSpline_C_UserConstructionScript, CallFunc_Add_IntInt_ReturnValue_2) == 0x000020, "Member 'BP_WireSpline_C_UserConstructionScript::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_WireSpline_C_UserConstructionScript, CallFunc_Add_IntInt_ReturnValue_3) == 0x000024, "Member 'BP_WireSpline_C_UserConstructionScript::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_WireSpline_C_UserConstructionScript, CallFunc_GetActorScale3D_ReturnValue) == 0x000028, "Member 'BP_WireSpline_C_UserConstructionScript::CallFunc_GetActorScale3D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WireSpline_C_UserConstructionScript, CallFunc_BreakVector_X) == 0x000040, "Member 'BP_WireSpline_C_UserConstructionScript::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_WireSpline_C_UserConstructionScript, CallFunc_BreakVector_Y) == 0x000048, "Member 'BP_WireSpline_C_UserConstructionScript::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_WireSpline_C_UserConstructionScript, CallFunc_BreakVector_Z) == 0x000050, "Member 'BP_WireSpline_C_UserConstructionScript::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_WireSpline_C_UserConstructionScript, Temp_struct_Variable) == 0x000060, "Member 'BP_WireSpline_C_UserConstructionScript::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_WireSpline_C_UserConstructionScript, CallFunc_AddComponent_ReturnValue) == 0x0000C0, "Member 'BP_WireSpline_C_UserConstructionScript::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WireSpline_C_UserConstructionScript, CallFunc_Multiply_IntFloat_ReturnValue) == 0x0000C8, "Member 'BP_WireSpline_C_UserConstructionScript::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WireSpline_C_UserConstructionScript, CallFunc_Multiply_IntFloat_ReturnValue_1) == 0x0000D0, "Member 'BP_WireSpline_C_UserConstructionScript::CallFunc_Multiply_IntFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WireSpline_C_UserConstructionScript, CallFunc_GetTangentAtDistanceAlongSpline_ReturnValue) == 0x0000D8, "Member 'BP_WireSpline_C_UserConstructionScript::CallFunc_GetTangentAtDistanceAlongSpline_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WireSpline_C_UserConstructionScript, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x0000F0, "Member 'BP_WireSpline_C_UserConstructionScript::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WireSpline_C_UserConstructionScript, CallFunc_ClampVectorSize_ReturnValue) == 0x0000F8, "Member 'BP_WireSpline_C_UserConstructionScript::CallFunc_ClampVectorSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WireSpline_C_UserConstructionScript, CallFunc_FTrunc_ReturnValue) == 0x000110, "Member 'BP_WireSpline_C_UserConstructionScript::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WireSpline_C_UserConstructionScript, CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue) == 0x000118, "Member 'BP_WireSpline_C_UserConstructionScript::CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WireSpline_C_UserConstructionScript, CallFunc_Subtract_IntInt_ReturnValue) == 0x000130, "Member 'BP_WireSpline_C_UserConstructionScript::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WireSpline_C_UserConstructionScript, CallFunc_GetTangentAtDistanceAlongSpline_ReturnValue_1) == 0x000138, "Member 'BP_WireSpline_C_UserConstructionScript::CallFunc_GetTangentAtDistanceAlongSpline_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WireSpline_C_UserConstructionScript, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000150, "Member 'BP_WireSpline_C_UserConstructionScript::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WireSpline_C_UserConstructionScript, CallFunc_ClampVectorSize_ReturnValue_1) == 0x000158, "Member 'BP_WireSpline_C_UserConstructionScript::CallFunc_ClampVectorSize_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WireSpline_C_UserConstructionScript, CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue_1) == 0x000170, "Member 'BP_WireSpline_C_UserConstructionScript::CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WireSpline_C_UserConstructionScript, Temp_struct_Variable_1) == 0x000190, "Member 'BP_WireSpline_C_UserConstructionScript::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_WireSpline_C_UserConstructionScript, Temp_byte_Variable) == 0x0001F0, "Member 'BP_WireSpline_C_UserConstructionScript::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_WireSpline_C_UserConstructionScript, CallFunc_AddComponent_ReturnValue_1) == 0x0001F8, "Member 'BP_WireSpline_C_UserConstructionScript::CallFunc_AddComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WireSpline_C_UserConstructionScript, K2Node_Select_Default) == 0x000200, "Member 'BP_WireSpline_C_UserConstructionScript::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_WireSpline_C_UserConstructionScript, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000208, "Member 'BP_WireSpline_C_UserConstructionScript::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WireSpline_C_UserConstructionScript, CallFunc_SetStaticMesh_ReturnValue) == 0x000210, "Member 'BP_WireSpline_C_UserConstructionScript::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WireSpline_C_UserConstructionScript, CallFunc_SetStaticMesh_ReturnValue_1) == 0x000211, "Member 'BP_WireSpline_C_UserConstructionScript::CallFunc_SetStaticMesh_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WireSpline_C_UserConstructionScript, CallFunc_GetLocationAndTangentAtSplinePoint_Location) == 0x000218, "Member 'BP_WireSpline_C_UserConstructionScript::CallFunc_GetLocationAndTangentAtSplinePoint_Location' has a wrong offset!");
static_assert(offsetof(BP_WireSpline_C_UserConstructionScript, CallFunc_GetLocationAndTangentAtSplinePoint_Tangent) == 0x000230, "Member 'BP_WireSpline_C_UserConstructionScript::CallFunc_GetLocationAndTangentAtSplinePoint_Tangent' has a wrong offset!");
static_assert(offsetof(BP_WireSpline_C_UserConstructionScript, CallFunc_GetLocationAndTangentAtSplinePoint_Location_1) == 0x000248, "Member 'BP_WireSpline_C_UserConstructionScript::CallFunc_GetLocationAndTangentAtSplinePoint_Location_1' has a wrong offset!");
static_assert(offsetof(BP_WireSpline_C_UserConstructionScript, CallFunc_GetLocationAndTangentAtSplinePoint_Tangent_1) == 0x000260, "Member 'BP_WireSpline_C_UserConstructionScript::CallFunc_GetLocationAndTangentAtSplinePoint_Tangent_1' has a wrong offset!");
static_assert(offsetof(BP_WireSpline_C_UserConstructionScript, CallFunc_SelectFloat_ReturnValue) == 0x000278, "Member 'BP_WireSpline_C_UserConstructionScript::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WireSpline_C_UserConstructionScript, CallFunc_GetNumberOfSplinePoints_ReturnValue) == 0x000280, "Member 'BP_WireSpline_C_UserConstructionScript::CallFunc_GetNumberOfSplinePoints_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WireSpline_C_UserConstructionScript, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000284, "Member 'BP_WireSpline_C_UserConstructionScript::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WireSpline_C_UserConstructionScript, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x000288, "Member 'BP_WireSpline_C_UserConstructionScript::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WireSpline_C_UserConstructionScript, K2Node_VariableSet_Max_Emissive_ImplicitCast) == 0x000290, "Member 'BP_WireSpline_C_UserConstructionScript::K2Node_VariableSet_Max_Emissive_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_WireSpline_C_UserConstructionScript, CallFunc_Divide_DoubleDouble_A_ImplicitCast) == 0x000298, "Member 'BP_WireSpline_C_UserConstructionScript::CallFunc_Divide_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_WireSpline_C_UserConstructionScript, CallFunc_GetLocationAtDistanceAlongSpline_Distance_ImplicitCast) == 0x0002A0, "Member 'BP_WireSpline_C_UserConstructionScript::CallFunc_GetLocationAtDistanceAlongSpline_Distance_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_WireSpline_C_UserConstructionScript, CallFunc_GetTangentAtDistanceAlongSpline_Distance_ImplicitCast) == 0x0002A4, "Member 'BP_WireSpline_C_UserConstructionScript::CallFunc_GetTangentAtDistanceAlongSpline_Distance_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_WireSpline_C_UserConstructionScript, CallFunc_GetLocationAtDistanceAlongSpline_Distance_ImplicitCast_1) == 0x0002A8, "Member 'BP_WireSpline_C_UserConstructionScript::CallFunc_GetLocationAtDistanceAlongSpline_Distance_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_WireSpline_C_UserConstructionScript, CallFunc_GetTangentAtDistanceAlongSpline_Distance_ImplicitCast_1) == 0x0002AC, "Member 'BP_WireSpline_C_UserConstructionScript::CallFunc_GetTangentAtDistanceAlongSpline_Distance_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_WireSpline_C_UserConstructionScript, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x0002B0, "Member 'BP_WireSpline_C_UserConstructionScript::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");

// Function BP_WireSpline.BP_WireSpline_C.Toggle Cable Emissive
// 0x0001 (0x0001 - 0x0000)
struct BP_WireSpline_C_Toggle_Cable_Emissive final
{
public:
	bool                                          Off;                                               // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_WireSpline_C_Toggle_Cable_Emissive) == 0x000001, "Wrong alignment on BP_WireSpline_C_Toggle_Cable_Emissive");
static_assert(sizeof(BP_WireSpline_C_Toggle_Cable_Emissive) == 0x000001, "Wrong size on BP_WireSpline_C_Toggle_Cable_Emissive");
static_assert(offsetof(BP_WireSpline_C_Toggle_Cable_Emissive, Off) == 0x000000, "Member 'BP_WireSpline_C_Toggle_Cable_Emissive::Off' has a wrong offset!");

// Function BP_WireSpline.BP_WireSpline_C.ExecuteUbergraph_BP_WireSpline
// 0x0028 (0x0028 - 0x0000)
struct BP_WireSpline_C_ExecuteUbergraph_BP_WireSpline final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Lerp_ReturnValue;                         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_On_Off;                         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Lerp_Alpha_ImplicitCast;                  // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_WireSpline_C_ExecuteUbergraph_BP_WireSpline) == 0x000008, "Wrong alignment on BP_WireSpline_C_ExecuteUbergraph_BP_WireSpline");
static_assert(sizeof(BP_WireSpline_C_ExecuteUbergraph_BP_WireSpline) == 0x000028, "Wrong size on BP_WireSpline_C_ExecuteUbergraph_BP_WireSpline");
static_assert(offsetof(BP_WireSpline_C_ExecuteUbergraph_BP_WireSpline, EntryPoint) == 0x000000, "Member 'BP_WireSpline_C_ExecuteUbergraph_BP_WireSpline::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_WireSpline_C_ExecuteUbergraph_BP_WireSpline, CallFunc_Lerp_ReturnValue) == 0x000008, "Member 'BP_WireSpline_C_ExecuteUbergraph_BP_WireSpline::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WireSpline_C_ExecuteUbergraph_BP_WireSpline, K2Node_CustomEvent_On_Off) == 0x000010, "Member 'BP_WireSpline_C_ExecuteUbergraph_BP_WireSpline::K2Node_CustomEvent_On_Off' has a wrong offset!");
static_assert(offsetof(BP_WireSpline_C_ExecuteUbergraph_BP_WireSpline, CallFunc_Lerp_Alpha_ImplicitCast) == 0x000018, "Member 'BP_WireSpline_C_ExecuteUbergraph_BP_WireSpline::CallFunc_Lerp_Alpha_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_WireSpline_C_ExecuteUbergraph_BP_WireSpline, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000020, "Member 'BP_WireSpline_C_ExecuteUbergraph_BP_WireSpline::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");

}

