#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTT_FindClosestResourceVolume

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BTT_FindClosestResourceVolume.BTT_FindClosestResourceVolume_C
// 0x0088 (0x0130 - 0x00A8)
class UBTT_FindClosestResourceVolume_C final : public UBTTask_BlueprintBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FVector                                Location;                                          // 0x00B0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBlackboardKeySelector                 OutRipenField;                                     // 0x00C8(0x0028)(Edit, BlueprintVisible)
	double                                        InMaximumDistance;                                 // 0x00F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATempestFieldVolume*                    ResourceVolume;                                    // 0x00F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        MinDistance;                                       // 0x0100(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBlackboardKeySelector                 InParentRefinery;                                  // 0x0108(0x0028)(Edit, BlueprintVisible)

public:
	void ExecuteUbergraph_BTT_FindClosestResourceVolume(int32 EntryPoint);
	void ReceiveExecuteAI(class AAIController* OwnerController, class APawn* ControlledPawn);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BTT_FindClosestResourceVolume_C">();
	}
	static class UBTT_FindClosestResourceVolume_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTT_FindClosestResourceVolume_C>();
	}
};
static_assert(alignof(UBTT_FindClosestResourceVolume_C) == 0x000008, "Wrong alignment on UBTT_FindClosestResourceVolume_C");
static_assert(sizeof(UBTT_FindClosestResourceVolume_C) == 0x000130, "Wrong size on UBTT_FindClosestResourceVolume_C");
static_assert(offsetof(UBTT_FindClosestResourceVolume_C, UberGraphFrame) == 0x0000A8, "Member 'UBTT_FindClosestResourceVolume_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBTT_FindClosestResourceVolume_C, Location) == 0x0000B0, "Member 'UBTT_FindClosestResourceVolume_C::Location' has a wrong offset!");
static_assert(offsetof(UBTT_FindClosestResourceVolume_C, OutRipenField) == 0x0000C8, "Member 'UBTT_FindClosestResourceVolume_C::OutRipenField' has a wrong offset!");
static_assert(offsetof(UBTT_FindClosestResourceVolume_C, InMaximumDistance) == 0x0000F0, "Member 'UBTT_FindClosestResourceVolume_C::InMaximumDistance' has a wrong offset!");
static_assert(offsetof(UBTT_FindClosestResourceVolume_C, ResourceVolume) == 0x0000F8, "Member 'UBTT_FindClosestResourceVolume_C::ResourceVolume' has a wrong offset!");
static_assert(offsetof(UBTT_FindClosestResourceVolume_C, MinDistance) == 0x000100, "Member 'UBTT_FindClosestResourceVolume_C::MinDistance' has a wrong offset!");
static_assert(offsetof(UBTT_FindClosestResourceVolume_C, InParentRefinery) == 0x000108, "Member 'UBTT_FindClosestResourceVolume_C::InParentRefinery' has a wrong offset!");

}

