#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FXSystemAnimNotifies

#include "Basic.hpp"


namespace SDK::Params
{

// Function FXSystemAnimNotifies.AnimNotifyState_TimedFXSystem.OnActorDestroyed
// 0x0008 (0x0008 - 0x0000)
struct AnimNotifyState_TimedFXSystem_OnActorDestroyed final
{
public:
	class AActor*                                 DestroyedActorPtr;                                 // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AnimNotifyState_TimedFXSystem_OnActorDestroyed) == 0x000008, "Wrong alignment on AnimNotifyState_TimedFXSystem_OnActorDestroyed");
static_assert(sizeof(AnimNotifyState_TimedFXSystem_OnActorDestroyed) == 0x000008, "Wrong size on AnimNotifyState_TimedFXSystem_OnActorDestroyed");
static_assert(offsetof(AnimNotifyState_TimedFXSystem_OnActorDestroyed, DestroyedActorPtr) == 0x000000, "Member 'AnimNotifyState_TimedFXSystem_OnActorDestroyed::DestroyedActorPtr' has a wrong offset!");

// Function FXSystemAnimNotifies.AnimNotifyState_TimedFXSystemAdvanced.GetNotifyProgress
// 0x0010 (0x0010 - 0x0000)
struct AnimNotifyState_TimedFXSystemAdvanced_GetNotifyProgress final
{
public:
	class UMeshComponent*                         MeshComp;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AnimNotifyState_TimedFXSystemAdvanced_GetNotifyProgress) == 0x000008, "Wrong alignment on AnimNotifyState_TimedFXSystemAdvanced_GetNotifyProgress");
static_assert(sizeof(AnimNotifyState_TimedFXSystemAdvanced_GetNotifyProgress) == 0x000010, "Wrong size on AnimNotifyState_TimedFXSystemAdvanced_GetNotifyProgress");
static_assert(offsetof(AnimNotifyState_TimedFXSystemAdvanced_GetNotifyProgress, MeshComp) == 0x000000, "Member 'AnimNotifyState_TimedFXSystemAdvanced_GetNotifyProgress::MeshComp' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_TimedFXSystemAdvanced_GetNotifyProgress, ReturnValue) == 0x000008, "Member 'AnimNotifyState_TimedFXSystemAdvanced_GetNotifyProgress::ReturnValue' has a wrong offset!");

// Function FXSystemAnimNotifies.AnimNotify_PlayFXSystem.GetSpawnedEffect
// 0x0008 (0x0008 - 0x0000)
struct AnimNotify_PlayFXSystem_GetSpawnedEffect final
{
public:
	class UFXSystemComponent*                     ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AnimNotify_PlayFXSystem_GetSpawnedEffect) == 0x000008, "Wrong alignment on AnimNotify_PlayFXSystem_GetSpawnedEffect");
static_assert(sizeof(AnimNotify_PlayFXSystem_GetSpawnedEffect) == 0x000008, "Wrong size on AnimNotify_PlayFXSystem_GetSpawnedEffect");
static_assert(offsetof(AnimNotify_PlayFXSystem_GetSpawnedEffect, ReturnValue) == 0x000000, "Member 'AnimNotify_PlayFXSystem_GetSpawnedEffect::ReturnValue' has a wrong offset!");

}

