#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_DepositResource_Harvester

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function GA_DepositResource_Harvester.GA_DepositResource_Harvester_C.ExecuteUbergraph_GA_DepositResource_Harvester
// 0x00F0 (0x00F0 - 0x0000)
struct GA_DepositResource_Harvester_C_ExecuteUbergraph_GA_DepositResource_Harvester final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0024(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0034(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x0044(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x0054(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_6;            // 0x0064(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_7;            // 0x0074(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATedPawn*                               CallFunc_GetTedPawnFromActorInfo_ReturnValue;      // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_MakeLiteralGameplayTag_ReturnValue;       // 0x0090(0x0008)(NoDestructor, HasGetValueTypeHash)
	TArray<class UAnimMontage*>                   CallFunc_K2_GetAnimMontagesFromSet_ReturnValue;    // 0x0098(0x0010)(ReferenceParm)
	class ATedPawn*                               CallFunc_GetTedPawnFromActorInfo_ReturnValue_1;    // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           CallFunc_Array_Get_Item;                           // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_MakeLiteralGameplayTag_ReturnValue_1;     // 0x00B8(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_PlayMontageAndWait*        CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue; // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UAnimMontage*>                   CallFunc_K2_GetAnimMontagesFromSet_ReturnValue_1;  // 0x00C8(0x0010)(ReferenceParm)
	class UAnimMontage*                           CallFunc_Array_Get_Item_1;                         // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_PlayMontageAndWait*        CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue_1; // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_DepositResource_Harvester_C_ExecuteUbergraph_GA_DepositResource_Harvester) == 0x000008, "Wrong alignment on GA_DepositResource_Harvester_C_ExecuteUbergraph_GA_DepositResource_Harvester");
static_assert(sizeof(GA_DepositResource_Harvester_C_ExecuteUbergraph_GA_DepositResource_Harvester) == 0x0000F0, "Wrong size on GA_DepositResource_Harvester_C_ExecuteUbergraph_GA_DepositResource_Harvester");
static_assert(offsetof(GA_DepositResource_Harvester_C_ExecuteUbergraph_GA_DepositResource_Harvester, EntryPoint) == 0x000000, "Member 'GA_DepositResource_Harvester_C_ExecuteUbergraph_GA_DepositResource_Harvester::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_DepositResource_Harvester_C_ExecuteUbergraph_GA_DepositResource_Harvester, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'GA_DepositResource_Harvester_C_ExecuteUbergraph_GA_DepositResource_Harvester::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_DepositResource_Harvester_C_ExecuteUbergraph_GA_DepositResource_Harvester, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'GA_DepositResource_Harvester_C_ExecuteUbergraph_GA_DepositResource_Harvester::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GA_DepositResource_Harvester_C_ExecuteUbergraph_GA_DepositResource_Harvester, K2Node_CreateDelegate_OutputDelegate_2) == 0x000024, "Member 'GA_DepositResource_Harvester_C_ExecuteUbergraph_GA_DepositResource_Harvester::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(GA_DepositResource_Harvester_C_ExecuteUbergraph_GA_DepositResource_Harvester, K2Node_CreateDelegate_OutputDelegate_3) == 0x000034, "Member 'GA_DepositResource_Harvester_C_ExecuteUbergraph_GA_DepositResource_Harvester::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(GA_DepositResource_Harvester_C_ExecuteUbergraph_GA_DepositResource_Harvester, K2Node_CreateDelegate_OutputDelegate_4) == 0x000044, "Member 'GA_DepositResource_Harvester_C_ExecuteUbergraph_GA_DepositResource_Harvester::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(GA_DepositResource_Harvester_C_ExecuteUbergraph_GA_DepositResource_Harvester, K2Node_CreateDelegate_OutputDelegate_5) == 0x000054, "Member 'GA_DepositResource_Harvester_C_ExecuteUbergraph_GA_DepositResource_Harvester::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(GA_DepositResource_Harvester_C_ExecuteUbergraph_GA_DepositResource_Harvester, K2Node_CreateDelegate_OutputDelegate_6) == 0x000064, "Member 'GA_DepositResource_Harvester_C_ExecuteUbergraph_GA_DepositResource_Harvester::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(GA_DepositResource_Harvester_C_ExecuteUbergraph_GA_DepositResource_Harvester, K2Node_CreateDelegate_OutputDelegate_7) == 0x000074, "Member 'GA_DepositResource_Harvester_C_ExecuteUbergraph_GA_DepositResource_Harvester::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(GA_DepositResource_Harvester_C_ExecuteUbergraph_GA_DepositResource_Harvester, CallFunc_GetTedPawnFromActorInfo_ReturnValue) == 0x000088, "Member 'GA_DepositResource_Harvester_C_ExecuteUbergraph_GA_DepositResource_Harvester::CallFunc_GetTedPawnFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_DepositResource_Harvester_C_ExecuteUbergraph_GA_DepositResource_Harvester, CallFunc_MakeLiteralGameplayTag_ReturnValue) == 0x000090, "Member 'GA_DepositResource_Harvester_C_ExecuteUbergraph_GA_DepositResource_Harvester::CallFunc_MakeLiteralGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_DepositResource_Harvester_C_ExecuteUbergraph_GA_DepositResource_Harvester, CallFunc_K2_GetAnimMontagesFromSet_ReturnValue) == 0x000098, "Member 'GA_DepositResource_Harvester_C_ExecuteUbergraph_GA_DepositResource_Harvester::CallFunc_K2_GetAnimMontagesFromSet_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_DepositResource_Harvester_C_ExecuteUbergraph_GA_DepositResource_Harvester, CallFunc_GetTedPawnFromActorInfo_ReturnValue_1) == 0x0000A8, "Member 'GA_DepositResource_Harvester_C_ExecuteUbergraph_GA_DepositResource_Harvester::CallFunc_GetTedPawnFromActorInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_DepositResource_Harvester_C_ExecuteUbergraph_GA_DepositResource_Harvester, CallFunc_Array_Get_Item) == 0x0000B0, "Member 'GA_DepositResource_Harvester_C_ExecuteUbergraph_GA_DepositResource_Harvester::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GA_DepositResource_Harvester_C_ExecuteUbergraph_GA_DepositResource_Harvester, CallFunc_MakeLiteralGameplayTag_ReturnValue_1) == 0x0000B8, "Member 'GA_DepositResource_Harvester_C_ExecuteUbergraph_GA_DepositResource_Harvester::CallFunc_MakeLiteralGameplayTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_DepositResource_Harvester_C_ExecuteUbergraph_GA_DepositResource_Harvester, CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue) == 0x0000C0, "Member 'GA_DepositResource_Harvester_C_ExecuteUbergraph_GA_DepositResource_Harvester::CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_DepositResource_Harvester_C_ExecuteUbergraph_GA_DepositResource_Harvester, CallFunc_K2_GetAnimMontagesFromSet_ReturnValue_1) == 0x0000C8, "Member 'GA_DepositResource_Harvester_C_ExecuteUbergraph_GA_DepositResource_Harvester::CallFunc_K2_GetAnimMontagesFromSet_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_DepositResource_Harvester_C_ExecuteUbergraph_GA_DepositResource_Harvester, CallFunc_Array_Get_Item_1) == 0x0000D8, "Member 'GA_DepositResource_Harvester_C_ExecuteUbergraph_GA_DepositResource_Harvester::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(GA_DepositResource_Harvester_C_ExecuteUbergraph_GA_DepositResource_Harvester, CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue_1) == 0x0000E0, "Member 'GA_DepositResource_Harvester_C_ExecuteUbergraph_GA_DepositResource_Harvester::CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_DepositResource_Harvester_C_ExecuteUbergraph_GA_DepositResource_Harvester, CallFunc_IsValid_ReturnValue) == 0x0000E8, "Member 'GA_DepositResource_Harvester_C_ExecuteUbergraph_GA_DepositResource_Harvester::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_DepositResource_Harvester_C_ExecuteUbergraph_GA_DepositResource_Harvester, CallFunc_IsValid_ReturnValue_1) == 0x0000E9, "Member 'GA_DepositResource_Harvester_C_ExecuteUbergraph_GA_DepositResource_Harvester::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

}

