#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_DeployStructure_HealingTurret

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GA_DeployStructure_HealingTurret.GA_DeployStructure_HealingTurret_C.ExecuteUbergraph_GA_DeployStructure_HealingTurret
// 0x0028 (0x0028 - 0x0000)
struct GA_DeployStructure_HealingTurret_C_ExecuteUbergraph_GA_DeployStructure_HealingTurret final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATedUnitBase*                           CallFunc_GetTedUnitFromActorInfo_ReturnValue;      // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATedUnitBase*                           CallFunc_GetTedUnitFromActorInfo_ReturnValue_1;    // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x0020(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_DeployStructure_HealingTurret_C_ExecuteUbergraph_GA_DeployStructure_HealingTurret) == 0x000008, "Wrong alignment on GA_DeployStructure_HealingTurret_C_ExecuteUbergraph_GA_DeployStructure_HealingTurret");
static_assert(sizeof(GA_DeployStructure_HealingTurret_C_ExecuteUbergraph_GA_DeployStructure_HealingTurret) == 0x000028, "Wrong size on GA_DeployStructure_HealingTurret_C_ExecuteUbergraph_GA_DeployStructure_HealingTurret");
static_assert(offsetof(GA_DeployStructure_HealingTurret_C_ExecuteUbergraph_GA_DeployStructure_HealingTurret, EntryPoint) == 0x000000, "Member 'GA_DeployStructure_HealingTurret_C_ExecuteUbergraph_GA_DeployStructure_HealingTurret::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_DeployStructure_HealingTurret_C_ExecuteUbergraph_GA_DeployStructure_HealingTurret, CallFunc_GetTedUnitFromActorInfo_ReturnValue) == 0x000008, "Member 'GA_DeployStructure_HealingTurret_C_ExecuteUbergraph_GA_DeployStructure_HealingTurret::CallFunc_GetTedUnitFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_DeployStructure_HealingTurret_C_ExecuteUbergraph_GA_DeployStructure_HealingTurret, K2Node_Event_bWasCancelled) == 0x000010, "Member 'GA_DeployStructure_HealingTurret_C_ExecuteUbergraph_GA_DeployStructure_HealingTurret::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(GA_DeployStructure_HealingTurret_C_ExecuteUbergraph_GA_DeployStructure_HealingTurret, CallFunc_GetTedUnitFromActorInfo_ReturnValue_1) == 0x000018, "Member 'GA_DeployStructure_HealingTurret_C_ExecuteUbergraph_GA_DeployStructure_HealingTurret::CallFunc_GetTedUnitFromActorInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_DeployStructure_HealingTurret_C_ExecuteUbergraph_GA_DeployStructure_HealingTurret, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue) == 0x000020, "Member 'GA_DeployStructure_HealingTurret_C_ExecuteUbergraph_GA_DeployStructure_HealingTurret::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue' has a wrong offset!");

// Function GA_DeployStructure_HealingTurret.GA_DeployStructure_HealingTurret_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GA_DeployStructure_HealingTurret_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_DeployStructure_HealingTurret_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on GA_DeployStructure_HealingTurret_C_K2_OnEndAbility");
static_assert(sizeof(GA_DeployStructure_HealingTurret_C_K2_OnEndAbility) == 0x000001, "Wrong size on GA_DeployStructure_HealingTurret_C_K2_OnEndAbility");
static_assert(offsetof(GA_DeployStructure_HealingTurret_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'GA_DeployStructure_HealingTurret_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

}

