#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_LayMines_Rifleman

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GA_LayMines_Rifleman.GA_LayMines_Rifleman_C.ExecuteUbergraph_GA_LayMines_Rifleman
// 0x0140 (0x0140 - 0x0000)
struct GA_LayMines_Rifleman_C_ExecuteUbergraph_GA_LayMines_Rifleman final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATedUnitBase*                           CallFunc_GetTedUnitFromActorInfo_ReturnValue;      // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ATedInfantry*                           K2Node_DynamicCast_AsTed_Infantry;                 // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x001C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCrawling_ReturnValue;                   // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0030(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0040(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0050(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           Temp_object_Variable;                              // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           Temp_object_Variable_1;                            // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           K2Node_Select_Default;                             // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     K2Node_Event_EventData;                            // 0x0080(0x00B0)(ConstParm)
	class UAbilityTask_PlayMontageAndWait*        CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue; // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_LayMines_Rifleman_C_ExecuteUbergraph_GA_LayMines_Rifleman) == 0x000008, "Wrong alignment on GA_LayMines_Rifleman_C_ExecuteUbergraph_GA_LayMines_Rifleman");
static_assert(sizeof(GA_LayMines_Rifleman_C_ExecuteUbergraph_GA_LayMines_Rifleman) == 0x000140, "Wrong size on GA_LayMines_Rifleman_C_ExecuteUbergraph_GA_LayMines_Rifleman");
static_assert(offsetof(GA_LayMines_Rifleman_C_ExecuteUbergraph_GA_LayMines_Rifleman, EntryPoint) == 0x000000, "Member 'GA_LayMines_Rifleman_C_ExecuteUbergraph_GA_LayMines_Rifleman::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_LayMines_Rifleman_C_ExecuteUbergraph_GA_LayMines_Rifleman, CallFunc_GetTedUnitFromActorInfo_ReturnValue) == 0x000008, "Member 'GA_LayMines_Rifleman_C_ExecuteUbergraph_GA_LayMines_Rifleman::CallFunc_GetTedUnitFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_LayMines_Rifleman_C_ExecuteUbergraph_GA_LayMines_Rifleman, K2Node_DynamicCast_AsTed_Infantry) == 0x000010, "Member 'GA_LayMines_Rifleman_C_ExecuteUbergraph_GA_LayMines_Rifleman::K2Node_DynamicCast_AsTed_Infantry' has a wrong offset!");
static_assert(offsetof(GA_LayMines_Rifleman_C_ExecuteUbergraph_GA_LayMines_Rifleman, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'GA_LayMines_Rifleman_C_ExecuteUbergraph_GA_LayMines_Rifleman::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_LayMines_Rifleman_C_ExecuteUbergraph_GA_LayMines_Rifleman, K2Node_CreateDelegate_OutputDelegate) == 0x00001C, "Member 'GA_LayMines_Rifleman_C_ExecuteUbergraph_GA_LayMines_Rifleman::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_LayMines_Rifleman_C_ExecuteUbergraph_GA_LayMines_Rifleman, CallFunc_IsCrawling_ReturnValue) == 0x00002C, "Member 'GA_LayMines_Rifleman_C_ExecuteUbergraph_GA_LayMines_Rifleman::CallFunc_IsCrawling_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_LayMines_Rifleman_C_ExecuteUbergraph_GA_LayMines_Rifleman, K2Node_CreateDelegate_OutputDelegate_1) == 0x000030, "Member 'GA_LayMines_Rifleman_C_ExecuteUbergraph_GA_LayMines_Rifleman::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GA_LayMines_Rifleman_C_ExecuteUbergraph_GA_LayMines_Rifleman, K2Node_CreateDelegate_OutputDelegate_2) == 0x000040, "Member 'GA_LayMines_Rifleman_C_ExecuteUbergraph_GA_LayMines_Rifleman::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(GA_LayMines_Rifleman_C_ExecuteUbergraph_GA_LayMines_Rifleman, K2Node_CreateDelegate_OutputDelegate_3) == 0x000050, "Member 'GA_LayMines_Rifleman_C_ExecuteUbergraph_GA_LayMines_Rifleman::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(GA_LayMines_Rifleman_C_ExecuteUbergraph_GA_LayMines_Rifleman, Temp_bool_Variable) == 0x000060, "Member 'GA_LayMines_Rifleman_C_ExecuteUbergraph_GA_LayMines_Rifleman::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(GA_LayMines_Rifleman_C_ExecuteUbergraph_GA_LayMines_Rifleman, Temp_object_Variable) == 0x000068, "Member 'GA_LayMines_Rifleman_C_ExecuteUbergraph_GA_LayMines_Rifleman::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(GA_LayMines_Rifleman_C_ExecuteUbergraph_GA_LayMines_Rifleman, Temp_object_Variable_1) == 0x000070, "Member 'GA_LayMines_Rifleman_C_ExecuteUbergraph_GA_LayMines_Rifleman::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_LayMines_Rifleman_C_ExecuteUbergraph_GA_LayMines_Rifleman, K2Node_Select_Default) == 0x000078, "Member 'GA_LayMines_Rifleman_C_ExecuteUbergraph_GA_LayMines_Rifleman::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(GA_LayMines_Rifleman_C_ExecuteUbergraph_GA_LayMines_Rifleman, K2Node_Event_EventData) == 0x000080, "Member 'GA_LayMines_Rifleman_C_ExecuteUbergraph_GA_LayMines_Rifleman::K2Node_Event_EventData' has a wrong offset!");
static_assert(offsetof(GA_LayMines_Rifleman_C_ExecuteUbergraph_GA_LayMines_Rifleman, CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue) == 0x000130, "Member 'GA_LayMines_Rifleman_C_ExecuteUbergraph_GA_LayMines_Rifleman::CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_LayMines_Rifleman_C_ExecuteUbergraph_GA_LayMines_Rifleman, CallFunc_IsValid_ReturnValue) == 0x000138, "Member 'GA_LayMines_Rifleman_C_ExecuteUbergraph_GA_LayMines_Rifleman::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function GA_LayMines_Rifleman.GA_LayMines_Rifleman_C.K2_ActivateAbilityFromEvent
// 0x00B0 (0x00B0 - 0x0000)
struct GA_LayMines_Rifleman_C_K2_ActivateAbilityFromEvent final
{
public:
	struct FGameplayEventData                     EventData;                                         // 0x0000(0x00B0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(GA_LayMines_Rifleman_C_K2_ActivateAbilityFromEvent) == 0x000008, "Wrong alignment on GA_LayMines_Rifleman_C_K2_ActivateAbilityFromEvent");
static_assert(sizeof(GA_LayMines_Rifleman_C_K2_ActivateAbilityFromEvent) == 0x0000B0, "Wrong size on GA_LayMines_Rifleman_C_K2_ActivateAbilityFromEvent");
static_assert(offsetof(GA_LayMines_Rifleman_C_K2_ActivateAbilityFromEvent, EventData) == 0x000000, "Member 'GA_LayMines_Rifleman_C_K2_ActivateAbilityFromEvent::EventData' has a wrong offset!");

}

