#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_RemoteControl_Drone

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GA_RemoteControl_Drone.GA_RemoteControl_Drone_C.EventReceived_03EC46F9421E1AB83766BAAAB0E0B964
// 0x00B0 (0x00B0 - 0x0000)
struct GA_RemoteControl_Drone_C_EventReceived_03EC46F9421E1AB83766BAAAB0E0B964 final
{
public:
	struct FGameplayEventData                     Payload;                                           // 0x0000(0x00B0)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_RemoteControl_Drone_C_EventReceived_03EC46F9421E1AB83766BAAAB0E0B964) == 0x000008, "Wrong alignment on GA_RemoteControl_Drone_C_EventReceived_03EC46F9421E1AB83766BAAAB0E0B964");
static_assert(sizeof(GA_RemoteControl_Drone_C_EventReceived_03EC46F9421E1AB83766BAAAB0E0B964) == 0x0000B0, "Wrong size on GA_RemoteControl_Drone_C_EventReceived_03EC46F9421E1AB83766BAAAB0E0B964");
static_assert(offsetof(GA_RemoteControl_Drone_C_EventReceived_03EC46F9421E1AB83766BAAAB0E0B964, Payload) == 0x000000, "Member 'GA_RemoteControl_Drone_C_EventReceived_03EC46F9421E1AB83766BAAAB0E0B964::Payload' has a wrong offset!");

// Function GA_RemoteControl_Drone.GA_RemoteControl_Drone_C.ExecuteUbergraph_GA_RemoteControl_Drone
// 0x0278 (0x0278 - 0x0000)
struct GA_RemoteControl_Drone_C_ExecuteUbergraph_GA_RemoteControl_Drone final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     Temp_struct_Variable;                              // 0x0008(0x00B0)()
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x00BC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ATedUnitBase*>                   CallFunc_GetSpawnedUnits_ReturnValue;              // 0x00D0(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitGameplayTagAdded*      CallFunc_WaitGameplayTagAdd_ReturnValue;           // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F2[0x2];                                       // 0x00F2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x00F4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0104(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0114(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x0124(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_134[0x4];                                      // 0x0134(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_PlayMontageAndWait*        CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue; // 0x0138(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_144[0x4];                                      // 0x0144(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATedPawn*                               CallFunc_Array_Get_Item;                           // 0x0148(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue; // 0x0150(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_159[0x3];                                      // 0x0159(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayEventData& Payload)> K2Node_CreateDelegate_OutputDelegate_5; // 0x0168(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ATedUnitBase*                           CallFunc_GetTedUnitFromActorInfo_ReturnValue;      // 0x0178(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTedUnitSpawnerComponent*               CallFunc_GetComponentByClass_ReturnValue;          // 0x0180(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_WaitGameplayEvent*         CallFunc_WaitGameplayEvent_ReturnValue;            // 0x0188(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0191(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x0192(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0193(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_194[0x4];                                      // 0x0194(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_CustomEvent_Payload;                        // 0x0198(0x00B0)()
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x0248(0x0008)(NoDestructor, HasGetValueTypeHash)
	TArray<class ATedUnitBase*>                   CallFunc_GetSpawnedUnits_ReturnValue_1;            // 0x0250(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0260(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_264[0x4];                                      // 0x0264(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATedPawn*                               CallFunc_Array_Get_Item_1;                         // 0x0268(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_RemoteControl_Drone_C_ExecuteUbergraph_GA_RemoteControl_Drone) == 0x000008, "Wrong alignment on GA_RemoteControl_Drone_C_ExecuteUbergraph_GA_RemoteControl_Drone");
static_assert(sizeof(GA_RemoteControl_Drone_C_ExecuteUbergraph_GA_RemoteControl_Drone) == 0x000278, "Wrong size on GA_RemoteControl_Drone_C_ExecuteUbergraph_GA_RemoteControl_Drone");
static_assert(offsetof(GA_RemoteControl_Drone_C_ExecuteUbergraph_GA_RemoteControl_Drone, EntryPoint) == 0x000000, "Member 'GA_RemoteControl_Drone_C_ExecuteUbergraph_GA_RemoteControl_Drone::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_RemoteControl_Drone_C_ExecuteUbergraph_GA_RemoteControl_Drone, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'GA_RemoteControl_Drone_C_ExecuteUbergraph_GA_RemoteControl_Drone::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(GA_RemoteControl_Drone_C_ExecuteUbergraph_GA_RemoteControl_Drone, Temp_struct_Variable) == 0x000008, "Member 'GA_RemoteControl_Drone_C_ExecuteUbergraph_GA_RemoteControl_Drone::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_RemoteControl_Drone_C_ExecuteUbergraph_GA_RemoteControl_Drone, CallFunc_Add_IntInt_ReturnValue) == 0x0000B8, "Member 'GA_RemoteControl_Drone_C_ExecuteUbergraph_GA_RemoteControl_Drone::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_RemoteControl_Drone_C_ExecuteUbergraph_GA_RemoteControl_Drone, K2Node_CreateDelegate_OutputDelegate) == 0x0000BC, "Member 'GA_RemoteControl_Drone_C_ExecuteUbergraph_GA_RemoteControl_Drone::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_RemoteControl_Drone_C_ExecuteUbergraph_GA_RemoteControl_Drone, CallFunc_GetSpawnedUnits_ReturnValue) == 0x0000D0, "Member 'GA_RemoteControl_Drone_C_ExecuteUbergraph_GA_RemoteControl_Drone::CallFunc_GetSpawnedUnits_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_RemoteControl_Drone_C_ExecuteUbergraph_GA_RemoteControl_Drone, CallFunc_Array_Length_ReturnValue) == 0x0000E0, "Member 'GA_RemoteControl_Drone_C_ExecuteUbergraph_GA_RemoteControl_Drone::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_RemoteControl_Drone_C_ExecuteUbergraph_GA_RemoteControl_Drone, CallFunc_WaitGameplayTagAdd_ReturnValue) == 0x0000E8, "Member 'GA_RemoteControl_Drone_C_ExecuteUbergraph_GA_RemoteControl_Drone::CallFunc_WaitGameplayTagAdd_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_RemoteControl_Drone_C_ExecuteUbergraph_GA_RemoteControl_Drone, CallFunc_Less_IntInt_ReturnValue) == 0x0000F0, "Member 'GA_RemoteControl_Drone_C_ExecuteUbergraph_GA_RemoteControl_Drone::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_RemoteControl_Drone_C_ExecuteUbergraph_GA_RemoteControl_Drone, CallFunc_IsValid_ReturnValue) == 0x0000F1, "Member 'GA_RemoteControl_Drone_C_ExecuteUbergraph_GA_RemoteControl_Drone::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_RemoteControl_Drone_C_ExecuteUbergraph_GA_RemoteControl_Drone, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000F4, "Member 'GA_RemoteControl_Drone_C_ExecuteUbergraph_GA_RemoteControl_Drone::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GA_RemoteControl_Drone_C_ExecuteUbergraph_GA_RemoteControl_Drone, K2Node_CreateDelegate_OutputDelegate_2) == 0x000104, "Member 'GA_RemoteControl_Drone_C_ExecuteUbergraph_GA_RemoteControl_Drone::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(GA_RemoteControl_Drone_C_ExecuteUbergraph_GA_RemoteControl_Drone, K2Node_CreateDelegate_OutputDelegate_3) == 0x000114, "Member 'GA_RemoteControl_Drone_C_ExecuteUbergraph_GA_RemoteControl_Drone::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(GA_RemoteControl_Drone_C_ExecuteUbergraph_GA_RemoteControl_Drone, K2Node_CreateDelegate_OutputDelegate_4) == 0x000124, "Member 'GA_RemoteControl_Drone_C_ExecuteUbergraph_GA_RemoteControl_Drone::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(GA_RemoteControl_Drone_C_ExecuteUbergraph_GA_RemoteControl_Drone, CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue) == 0x000138, "Member 'GA_RemoteControl_Drone_C_ExecuteUbergraph_GA_RemoteControl_Drone::CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_RemoteControl_Drone_C_ExecuteUbergraph_GA_RemoteControl_Drone, Temp_int_Array_Index_Variable) == 0x000140, "Member 'GA_RemoteControl_Drone_C_ExecuteUbergraph_GA_RemoteControl_Drone::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(GA_RemoteControl_Drone_C_ExecuteUbergraph_GA_RemoteControl_Drone, CallFunc_Array_Get_Item) == 0x000148, "Member 'GA_RemoteControl_Drone_C_ExecuteUbergraph_GA_RemoteControl_Drone::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GA_RemoteControl_Drone_C_ExecuteUbergraph_GA_RemoteControl_Drone, CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue) == 0x000150, "Member 'GA_RemoteControl_Drone_C_ExecuteUbergraph_GA_RemoteControl_Drone::CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_RemoteControl_Drone_C_ExecuteUbergraph_GA_RemoteControl_Drone, CallFunc_IsValid_ReturnValue_1) == 0x000158, "Member 'GA_RemoteControl_Drone_C_ExecuteUbergraph_GA_RemoteControl_Drone::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_RemoteControl_Drone_C_ExecuteUbergraph_GA_RemoteControl_Drone, Temp_int_Loop_Counter_Variable_1) == 0x00015C, "Member 'GA_RemoteControl_Drone_C_ExecuteUbergraph_GA_RemoteControl_Drone::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_RemoteControl_Drone_C_ExecuteUbergraph_GA_RemoteControl_Drone, CallFunc_Add_IntInt_ReturnValue_1) == 0x000160, "Member 'GA_RemoteControl_Drone_C_ExecuteUbergraph_GA_RemoteControl_Drone::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_RemoteControl_Drone_C_ExecuteUbergraph_GA_RemoteControl_Drone, Temp_int_Array_Index_Variable_1) == 0x000164, "Member 'GA_RemoteControl_Drone_C_ExecuteUbergraph_GA_RemoteControl_Drone::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_RemoteControl_Drone_C_ExecuteUbergraph_GA_RemoteControl_Drone, K2Node_CreateDelegate_OutputDelegate_5) == 0x000168, "Member 'GA_RemoteControl_Drone_C_ExecuteUbergraph_GA_RemoteControl_Drone::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(GA_RemoteControl_Drone_C_ExecuteUbergraph_GA_RemoteControl_Drone, CallFunc_GetTedUnitFromActorInfo_ReturnValue) == 0x000178, "Member 'GA_RemoteControl_Drone_C_ExecuteUbergraph_GA_RemoteControl_Drone::CallFunc_GetTedUnitFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_RemoteControl_Drone_C_ExecuteUbergraph_GA_RemoteControl_Drone, CallFunc_GetComponentByClass_ReturnValue) == 0x000180, "Member 'GA_RemoteControl_Drone_C_ExecuteUbergraph_GA_RemoteControl_Drone::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_RemoteControl_Drone_C_ExecuteUbergraph_GA_RemoteControl_Drone, CallFunc_WaitGameplayEvent_ReturnValue) == 0x000188, "Member 'GA_RemoteControl_Drone_C_ExecuteUbergraph_GA_RemoteControl_Drone::CallFunc_WaitGameplayEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_RemoteControl_Drone_C_ExecuteUbergraph_GA_RemoteControl_Drone, CallFunc_IsValid_ReturnValue_2) == 0x000190, "Member 'GA_RemoteControl_Drone_C_ExecuteUbergraph_GA_RemoteControl_Drone::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_RemoteControl_Drone_C_ExecuteUbergraph_GA_RemoteControl_Drone, CallFunc_IsValid_ReturnValue_3) == 0x000191, "Member 'GA_RemoteControl_Drone_C_ExecuteUbergraph_GA_RemoteControl_Drone::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_RemoteControl_Drone_C_ExecuteUbergraph_GA_RemoteControl_Drone, K2Node_Event_bWasCancelled) == 0x000192, "Member 'GA_RemoteControl_Drone_C_ExecuteUbergraph_GA_RemoteControl_Drone::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(GA_RemoteControl_Drone_C_ExecuteUbergraph_GA_RemoteControl_Drone, CallFunc_IsValid_ReturnValue_4) == 0x000193, "Member 'GA_RemoteControl_Drone_C_ExecuteUbergraph_GA_RemoteControl_Drone::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GA_RemoteControl_Drone_C_ExecuteUbergraph_GA_RemoteControl_Drone, K2Node_CustomEvent_Payload) == 0x000198, "Member 'GA_RemoteControl_Drone_C_ExecuteUbergraph_GA_RemoteControl_Drone::K2Node_CustomEvent_Payload' has a wrong offset!");
static_assert(offsetof(GA_RemoteControl_Drone_C_ExecuteUbergraph_GA_RemoteControl_Drone, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue) == 0x000248, "Member 'GA_RemoteControl_Drone_C_ExecuteUbergraph_GA_RemoteControl_Drone::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_RemoteControl_Drone_C_ExecuteUbergraph_GA_RemoteControl_Drone, CallFunc_GetSpawnedUnits_ReturnValue_1) == 0x000250, "Member 'GA_RemoteControl_Drone_C_ExecuteUbergraph_GA_RemoteControl_Drone::CallFunc_GetSpawnedUnits_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_RemoteControl_Drone_C_ExecuteUbergraph_GA_RemoteControl_Drone, CallFunc_Array_Length_ReturnValue_1) == 0x000260, "Member 'GA_RemoteControl_Drone_C_ExecuteUbergraph_GA_RemoteControl_Drone::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_RemoteControl_Drone_C_ExecuteUbergraph_GA_RemoteControl_Drone, CallFunc_Array_Get_Item_1) == 0x000268, "Member 'GA_RemoteControl_Drone_C_ExecuteUbergraph_GA_RemoteControl_Drone::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(GA_RemoteControl_Drone_C_ExecuteUbergraph_GA_RemoteControl_Drone, CallFunc_Less_IntInt_ReturnValue_1) == 0x000270, "Member 'GA_RemoteControl_Drone_C_ExecuteUbergraph_GA_RemoteControl_Drone::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");

// Function GA_RemoteControl_Drone.GA_RemoteControl_Drone_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GA_RemoteControl_Drone_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_RemoteControl_Drone_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on GA_RemoteControl_Drone_C_K2_OnEndAbility");
static_assert(sizeof(GA_RemoteControl_Drone_C_K2_OnEndAbility) == 0x000001, "Wrong size on GA_RemoteControl_Drone_C_K2_OnEndAbility");
static_assert(offsetof(GA_RemoteControl_Drone_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'GA_RemoteControl_Drone_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

}

