#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_StealthActive

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GA_StealthActive.GA_StealthActive_C.ExecuteUbergraph_GA_StealthActive
// 0x0050 (0x0050 - 0x0000)
struct GA_StealthActive_C_ExecuteUbergraph_GA_StealthActive final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidClass_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_WaitGameplayTagRemoved*    CallFunc_WaitGameplayTagRemove_ReturnValue;        // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATedPawn*                               CallFunc_GetTedPawnFromActorInfo_ReturnValue;      // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput; // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x0044(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_StealthActive_C_ExecuteUbergraph_GA_StealthActive) == 0x000008, "Wrong alignment on GA_StealthActive_C_ExecuteUbergraph_GA_StealthActive");
static_assert(sizeof(GA_StealthActive_C_ExecuteUbergraph_GA_StealthActive) == 0x000050, "Wrong size on GA_StealthActive_C_ExecuteUbergraph_GA_StealthActive");
static_assert(offsetof(GA_StealthActive_C_ExecuteUbergraph_GA_StealthActive, EntryPoint) == 0x000000, "Member 'GA_StealthActive_C_ExecuteUbergraph_GA_StealthActive::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_StealthActive_C_ExecuteUbergraph_GA_StealthActive, CallFunc_IsValidClass_ReturnValue) == 0x000004, "Member 'GA_StealthActive_C_ExecuteUbergraph_GA_StealthActive::CallFunc_IsValidClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_StealthActive_C_ExecuteUbergraph_GA_StealthActive, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'GA_StealthActive_C_ExecuteUbergraph_GA_StealthActive::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_StealthActive_C_ExecuteUbergraph_GA_StealthActive, CallFunc_WaitGameplayTagRemove_ReturnValue) == 0x000018, "Member 'GA_StealthActive_C_ExecuteUbergraph_GA_StealthActive::CallFunc_WaitGameplayTagRemove_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_StealthActive_C_ExecuteUbergraph_GA_StealthActive, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'GA_StealthActive_C_ExecuteUbergraph_GA_StealthActive::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_StealthActive_C_ExecuteUbergraph_GA_StealthActive, CallFunc_GetTedPawnFromActorInfo_ReturnValue) == 0x000028, "Member 'GA_StealthActive_C_ExecuteUbergraph_GA_StealthActive::CallFunc_GetTedPawnFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_StealthActive_C_ExecuteUbergraph_GA_StealthActive, CallFunc_HasMatchingGameplayTag_self_CastInput) == 0x000030, "Member 'GA_StealthActive_C_ExecuteUbergraph_GA_StealthActive::CallFunc_HasMatchingGameplayTag_self_CastInput' has a wrong offset!");
static_assert(offsetof(GA_StealthActive_C_ExecuteUbergraph_GA_StealthActive, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x000040, "Member 'GA_StealthActive_C_ExecuteUbergraph_GA_StealthActive::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_StealthActive_C_ExecuteUbergraph_GA_StealthActive, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue) == 0x000044, "Member 'GA_StealthActive_C_ExecuteUbergraph_GA_StealthActive::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue' has a wrong offset!");

}

