#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_TakeOff_Aircraft

#include "Basic.hpp"


namespace SDK::Params
{

// Function GA_TakeOff_Aircraft.GA_TakeOff_Aircraft_C.ExecuteUbergraph_GA_TakeOff_Aircraft
// 0x0050 (0x0050 - 0x0000)
struct GA_TakeOff_Aircraft_C_ExecuteUbergraph_GA_TakeOff_Aircraft final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitDelay*                 CallFunc_WaitDelay_ReturnValue;                    // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATedPawn*                               CallFunc_GetTedPawnFromActorInfo_ReturnValue;      // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UAnimMontage*>                   CallFunc_K2_GetAnimMontagesFromSet_ReturnValue;    // 0x0030(0x0010)(ReferenceParm)
	class UAnimMontage*                           CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MontagePlay_ReturnValue;                  // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_TakeOff_Aircraft_C_ExecuteUbergraph_GA_TakeOff_Aircraft) == 0x000008, "Wrong alignment on GA_TakeOff_Aircraft_C_ExecuteUbergraph_GA_TakeOff_Aircraft");
static_assert(sizeof(GA_TakeOff_Aircraft_C_ExecuteUbergraph_GA_TakeOff_Aircraft) == 0x000050, "Wrong size on GA_TakeOff_Aircraft_C_ExecuteUbergraph_GA_TakeOff_Aircraft");
static_assert(offsetof(GA_TakeOff_Aircraft_C_ExecuteUbergraph_GA_TakeOff_Aircraft, EntryPoint) == 0x000000, "Member 'GA_TakeOff_Aircraft_C_ExecuteUbergraph_GA_TakeOff_Aircraft::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_TakeOff_Aircraft_C_ExecuteUbergraph_GA_TakeOff_Aircraft, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'GA_TakeOff_Aircraft_C_ExecuteUbergraph_GA_TakeOff_Aircraft::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_TakeOff_Aircraft_C_ExecuteUbergraph_GA_TakeOff_Aircraft, CallFunc_WaitDelay_ReturnValue) == 0x000018, "Member 'GA_TakeOff_Aircraft_C_ExecuteUbergraph_GA_TakeOff_Aircraft::CallFunc_WaitDelay_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TakeOff_Aircraft_C_ExecuteUbergraph_GA_TakeOff_Aircraft, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'GA_TakeOff_Aircraft_C_ExecuteUbergraph_GA_TakeOff_Aircraft::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TakeOff_Aircraft_C_ExecuteUbergraph_GA_TakeOff_Aircraft, CallFunc_GetTedPawnFromActorInfo_ReturnValue) == 0x000028, "Member 'GA_TakeOff_Aircraft_C_ExecuteUbergraph_GA_TakeOff_Aircraft::CallFunc_GetTedPawnFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TakeOff_Aircraft_C_ExecuteUbergraph_GA_TakeOff_Aircraft, CallFunc_K2_GetAnimMontagesFromSet_ReturnValue) == 0x000030, "Member 'GA_TakeOff_Aircraft_C_ExecuteUbergraph_GA_TakeOff_Aircraft::CallFunc_K2_GetAnimMontagesFromSet_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TakeOff_Aircraft_C_ExecuteUbergraph_GA_TakeOff_Aircraft, CallFunc_Array_Get_Item) == 0x000040, "Member 'GA_TakeOff_Aircraft_C_ExecuteUbergraph_GA_TakeOff_Aircraft::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GA_TakeOff_Aircraft_C_ExecuteUbergraph_GA_TakeOff_Aircraft, CallFunc_MontagePlay_ReturnValue) == 0x000048, "Member 'GA_TakeOff_Aircraft_C_ExecuteUbergraph_GA_TakeOff_Aircraft::CallFunc_MontagePlay_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TakeOff_Aircraft_C_ExecuteUbergraph_GA_TakeOff_Aircraft, CallFunc_IsValid_ReturnValue_1) == 0x00004C, "Member 'GA_TakeOff_Aircraft_C_ExecuteUbergraph_GA_TakeOff_Aircraft::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

}

