#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCue_Impact_EnlightenedSacrificeReceiveBuff

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Tempest_classes.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GCue_Impact_EnlightenedSacrificeReceiveBuff.GCue_Impact_EnlightenedSacrificeReceiveBuff_C
// 0x0040 (0x0390 - 0x0350)
class AGCue_Impact_EnlightenedSacrificeReceiveBuff_C final : public ATedGameplayCueNotify_StatusEffect
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CauserActor;                                       // 0x0360(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FVector                                TargetLocation;                                    // 0x0368(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFXSystemAsset*                         Hit_Effect_Asset;                                  // 0x0380(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 TargetActor;                                       // 0x0388(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GCue_Impact_EnlightenedSacrificeReceiveBuff(int32 EntryPoint);
	void K2_HandleGameplayCue(class AActor* MyTarget, EGameplayCueEvent EventType, const struct FGameplayCueParameters& Parameters);
	void OnReceiveGravityManipulators();
	void OnReceiveLifebloodBattery();
	void OnReceiveRegrowthProtocols();
	void OnReceiveShield();
	void OnReceiveSpecificDeathEnlightened();
	bool WhileActive(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GCue_Impact_EnlightenedSacrificeReceiveBuff_C">();
	}
	static class AGCue_Impact_EnlightenedSacrificeReceiveBuff_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGCue_Impact_EnlightenedSacrificeReceiveBuff_C>();
	}
};
static_assert(alignof(AGCue_Impact_EnlightenedSacrificeReceiveBuff_C) == 0x000008, "Wrong alignment on AGCue_Impact_EnlightenedSacrificeReceiveBuff_C");
static_assert(sizeof(AGCue_Impact_EnlightenedSacrificeReceiveBuff_C) == 0x000390, "Wrong size on AGCue_Impact_EnlightenedSacrificeReceiveBuff_C");
static_assert(offsetof(AGCue_Impact_EnlightenedSacrificeReceiveBuff_C, UberGraphFrame) == 0x000350, "Member 'AGCue_Impact_EnlightenedSacrificeReceiveBuff_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AGCue_Impact_EnlightenedSacrificeReceiveBuff_C, DefaultSceneRoot) == 0x000358, "Member 'AGCue_Impact_EnlightenedSacrificeReceiveBuff_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AGCue_Impact_EnlightenedSacrificeReceiveBuff_C, CauserActor) == 0x000360, "Member 'AGCue_Impact_EnlightenedSacrificeReceiveBuff_C::CauserActor' has a wrong offset!");
static_assert(offsetof(AGCue_Impact_EnlightenedSacrificeReceiveBuff_C, TargetLocation) == 0x000368, "Member 'AGCue_Impact_EnlightenedSacrificeReceiveBuff_C::TargetLocation' has a wrong offset!");
static_assert(offsetof(AGCue_Impact_EnlightenedSacrificeReceiveBuff_C, Hit_Effect_Asset) == 0x000380, "Member 'AGCue_Impact_EnlightenedSacrificeReceiveBuff_C::Hit_Effect_Asset' has a wrong offset!");
static_assert(offsetof(AGCue_Impact_EnlightenedSacrificeReceiveBuff_C, TargetActor) == 0x000388, "Member 'AGCue_Impact_EnlightenedSacrificeReceiveBuff_C::TargetActor' has a wrong offset!");

}

