#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCue_Status_Burning_Infantry

#include "Basic.hpp"

#include "Tempest_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GCue_Status_Burning_Infantry.GCue_Status_Burning_Infantry_C
// 0x0018 (0x0368 - 0x0350)
class AGCue_Status_Burning_Infantry_C final : public ATedGameplayCueNotify_StatusEffect
{
public:
	class UParticleSystemComponent*               PS_BurningInfantry_01;                             // 0x0350(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ATedInfantry*                           My_Target;                                         // 0x0360(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	bool OnRemove(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters);
	bool WhileActive(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GCue_Status_Burning_Infantry_C">();
	}
	static class AGCue_Status_Burning_Infantry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGCue_Status_Burning_Infantry_C>();
	}
};
static_assert(alignof(AGCue_Status_Burning_Infantry_C) == 0x000008, "Wrong alignment on AGCue_Status_Burning_Infantry_C");
static_assert(sizeof(AGCue_Status_Burning_Infantry_C) == 0x000368, "Wrong size on AGCue_Status_Burning_Infantry_C");
static_assert(offsetof(AGCue_Status_Burning_Infantry_C, PS_BurningInfantry_01) == 0x000350, "Member 'AGCue_Status_Burning_Infantry_C::PS_BurningInfantry_01' has a wrong offset!");
static_assert(offsetof(AGCue_Status_Burning_Infantry_C, DefaultSceneRoot) == 0x000358, "Member 'AGCue_Status_Burning_Infantry_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AGCue_Status_Burning_Infantry_C, My_Target) == 0x000360, "Member 'AGCue_Status_Burning_Infantry_C::My_Target' has a wrong offset!");

}

