#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCue_Status_TempestSphereRam_Default

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function GCue_Status_TempestSphereRam_Default.GCue_Status_TempestSphereRam_Default_C.ExecuteUbergraph_GCue_Status_TempestSphereRam_Default
// 0x02D0 (0x02D0 - 0x0000)
struct GCue_Status_TempestSphereRam_Default_C_ExecuteUbergraph_GCue_Status_TempestSphereRam_Default final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_MyTarget;                             // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EGameplayCueEvent                             K2Node_Event_EventType;                            // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 K2Node_Event_Parameters;                           // 0x0048(0x00D8)(ConstParm, ContainsInstancedReference)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_RandomFloatInRange_ReturnValue;           // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0138(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0150(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        CallFunc_Vector_Distance_ReturnValue;              // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_171[0x7];                                      // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_Conv_VectorToVector2D_ReturnValue;        // 0x0178(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetGroundLocation_ReturnValue;            // 0x0188(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        CallFunc_SpawnDecalAtLocation_ReturnValue;         // 0x01A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Conv_VectorToVector2D_ReturnValue_1;      // 0x01A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetGroundLocation_ReturnValue_1;          // 0x01B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x01D0(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_MakeRotator_Roll_ImplicitCast;            // 0x02C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCue_Status_TempestSphereRam_Default_C_ExecuteUbergraph_GCue_Status_TempestSphereRam_Default) == 0x000008, "Wrong alignment on GCue_Status_TempestSphereRam_Default_C_ExecuteUbergraph_GCue_Status_TempestSphereRam_Default");
static_assert(sizeof(GCue_Status_TempestSphereRam_Default_C_ExecuteUbergraph_GCue_Status_TempestSphereRam_Default) == 0x0002D0, "Wrong size on GCue_Status_TempestSphereRam_Default_C_ExecuteUbergraph_GCue_Status_TempestSphereRam_Default");
static_assert(offsetof(GCue_Status_TempestSphereRam_Default_C_ExecuteUbergraph_GCue_Status_TempestSphereRam_Default, EntryPoint) == 0x000000, "Member 'GCue_Status_TempestSphereRam_Default_C_ExecuteUbergraph_GCue_Status_TempestSphereRam_Default::EntryPoint' has a wrong offset!");
static_assert(offsetof(GCue_Status_TempestSphereRam_Default_C_ExecuteUbergraph_GCue_Status_TempestSphereRam_Default, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000008, "Member 'GCue_Status_TempestSphereRam_Default_C_ExecuteUbergraph_GCue_Status_TempestSphereRam_Default::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCue_Status_TempestSphereRam_Default_C_ExecuteUbergraph_GCue_Status_TempestSphereRam_Default, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000020, "Member 'GCue_Status_TempestSphereRam_Default_C_ExecuteUbergraph_GCue_Status_TempestSphereRam_Default::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GCue_Status_TempestSphereRam_Default_C_ExecuteUbergraph_GCue_Status_TempestSphereRam_Default, K2Node_Event_MyTarget) == 0x000038, "Member 'GCue_Status_TempestSphereRam_Default_C_ExecuteUbergraph_GCue_Status_TempestSphereRam_Default::K2Node_Event_MyTarget' has a wrong offset!");
static_assert(offsetof(GCue_Status_TempestSphereRam_Default_C_ExecuteUbergraph_GCue_Status_TempestSphereRam_Default, K2Node_Event_EventType) == 0x000040, "Member 'GCue_Status_TempestSphereRam_Default_C_ExecuteUbergraph_GCue_Status_TempestSphereRam_Default::K2Node_Event_EventType' has a wrong offset!");
static_assert(offsetof(GCue_Status_TempestSphereRam_Default_C_ExecuteUbergraph_GCue_Status_TempestSphereRam_Default, K2Node_Event_Parameters) == 0x000048, "Member 'GCue_Status_TempestSphereRam_Default_C_ExecuteUbergraph_GCue_Status_TempestSphereRam_Default::K2Node_Event_Parameters' has a wrong offset!");
static_assert(offsetof(GCue_Status_TempestSphereRam_Default_C_ExecuteUbergraph_GCue_Status_TempestSphereRam_Default, K2Node_SwitchEnum_CmpSuccess) == 0x000120, "Member 'GCue_Status_TempestSphereRam_Default_C_ExecuteUbergraph_GCue_Status_TempestSphereRam_Default::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(GCue_Status_TempestSphereRam_Default_C_ExecuteUbergraph_GCue_Status_TempestSphereRam_Default, CallFunc_RandomFloatInRange_ReturnValue) == 0x000128, "Member 'GCue_Status_TempestSphereRam_Default_C_ExecuteUbergraph_GCue_Status_TempestSphereRam_Default::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCue_Status_TempestSphereRam_Default_C_ExecuteUbergraph_GCue_Status_TempestSphereRam_Default, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x000130, "Member 'GCue_Status_TempestSphereRam_Default_C_ExecuteUbergraph_GCue_Status_TempestSphereRam_Default::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GCue_Status_TempestSphereRam_Default_C_ExecuteUbergraph_GCue_Status_TempestSphereRam_Default, CallFunc_MakeVector_ReturnValue) == 0x000138, "Member 'GCue_Status_TempestSphereRam_Default_C_ExecuteUbergraph_GCue_Status_TempestSphereRam_Default::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCue_Status_TempestSphereRam_Default_C_ExecuteUbergraph_GCue_Status_TempestSphereRam_Default, CallFunc_MakeRotator_ReturnValue) == 0x000150, "Member 'GCue_Status_TempestSphereRam_Default_C_ExecuteUbergraph_GCue_Status_TempestSphereRam_Default::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCue_Status_TempestSphereRam_Default_C_ExecuteUbergraph_GCue_Status_TempestSphereRam_Default, CallFunc_Vector_Distance_ReturnValue) == 0x000168, "Member 'GCue_Status_TempestSphereRam_Default_C_ExecuteUbergraph_GCue_Status_TempestSphereRam_Default::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCue_Status_TempestSphereRam_Default_C_ExecuteUbergraph_GCue_Status_TempestSphereRam_Default, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000170, "Member 'GCue_Status_TempestSphereRam_Default_C_ExecuteUbergraph_GCue_Status_TempestSphereRam_Default::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCue_Status_TempestSphereRam_Default_C_ExecuteUbergraph_GCue_Status_TempestSphereRam_Default, CallFunc_Conv_VectorToVector2D_ReturnValue) == 0x000178, "Member 'GCue_Status_TempestSphereRam_Default_C_ExecuteUbergraph_GCue_Status_TempestSphereRam_Default::CallFunc_Conv_VectorToVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCue_Status_TempestSphereRam_Default_C_ExecuteUbergraph_GCue_Status_TempestSphereRam_Default, CallFunc_GetGroundLocation_ReturnValue) == 0x000188, "Member 'GCue_Status_TempestSphereRam_Default_C_ExecuteUbergraph_GCue_Status_TempestSphereRam_Default::CallFunc_GetGroundLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCue_Status_TempestSphereRam_Default_C_ExecuteUbergraph_GCue_Status_TempestSphereRam_Default, CallFunc_SpawnDecalAtLocation_ReturnValue) == 0x0001A0, "Member 'GCue_Status_TempestSphereRam_Default_C_ExecuteUbergraph_GCue_Status_TempestSphereRam_Default::CallFunc_SpawnDecalAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCue_Status_TempestSphereRam_Default_C_ExecuteUbergraph_GCue_Status_TempestSphereRam_Default, CallFunc_Conv_VectorToVector2D_ReturnValue_1) == 0x0001A8, "Member 'GCue_Status_TempestSphereRam_Default_C_ExecuteUbergraph_GCue_Status_TempestSphereRam_Default::CallFunc_Conv_VectorToVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GCue_Status_TempestSphereRam_Default_C_ExecuteUbergraph_GCue_Status_TempestSphereRam_Default, CallFunc_GetGroundLocation_ReturnValue_1) == 0x0001B8, "Member 'GCue_Status_TempestSphereRam_Default_C_ExecuteUbergraph_GCue_Status_TempestSphereRam_Default::CallFunc_GetGroundLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GCue_Status_TempestSphereRam_Default_C_ExecuteUbergraph_GCue_Status_TempestSphereRam_Default, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x0001D0, "Member 'GCue_Status_TempestSphereRam_Default_C_ExecuteUbergraph_GCue_Status_TempestSphereRam_Default::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(GCue_Status_TempestSphereRam_Default_C_ExecuteUbergraph_GCue_Status_TempestSphereRam_Default, CallFunc_MakeRotator_Roll_ImplicitCast) == 0x0002C8, "Member 'GCue_Status_TempestSphereRam_Default_C_ExecuteUbergraph_GCue_Status_TempestSphereRam_Default::CallFunc_MakeRotator_Roll_ImplicitCast' has a wrong offset!");

// Function GCue_Status_TempestSphereRam_Default.GCue_Status_TempestSphereRam_Default_C.K2_HandleGameplayCue
// 0x00E8 (0x00E8 - 0x0000)
struct GCue_Status_TempestSphereRam_Default_C_K2_HandleGameplayCue final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EGameplayCueEvent                             EventType;                                         // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 Parameters;                                        // 0x0010(0x00D8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GCue_Status_TempestSphereRam_Default_C_K2_HandleGameplayCue) == 0x000008, "Wrong alignment on GCue_Status_TempestSphereRam_Default_C_K2_HandleGameplayCue");
static_assert(sizeof(GCue_Status_TempestSphereRam_Default_C_K2_HandleGameplayCue) == 0x0000E8, "Wrong size on GCue_Status_TempestSphereRam_Default_C_K2_HandleGameplayCue");
static_assert(offsetof(GCue_Status_TempestSphereRam_Default_C_K2_HandleGameplayCue, MyTarget) == 0x000000, "Member 'GCue_Status_TempestSphereRam_Default_C_K2_HandleGameplayCue::MyTarget' has a wrong offset!");
static_assert(offsetof(GCue_Status_TempestSphereRam_Default_C_K2_HandleGameplayCue, EventType) == 0x000008, "Member 'GCue_Status_TempestSphereRam_Default_C_K2_HandleGameplayCue::EventType' has a wrong offset!");
static_assert(offsetof(GCue_Status_TempestSphereRam_Default_C_K2_HandleGameplayCue, Parameters) == 0x000010, "Member 'GCue_Status_TempestSphereRam_Default_C_K2_HandleGameplayCue::Parameters' has a wrong offset!");

}

