#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCue_Status_Sprint_Default

#include "Basic.hpp"

#include "Tempest_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GCue_Status_Sprint_Default.GCue_Status_Sprint_Default_C
// 0x0038 (0x0388 - 0x0350)
class AGCue_Status_Sprint_Default_C final : public ATedGameplayCueNotify_StatusEffect
{
public:
	class UAudioComponent*                        SFX_SprintAbility_Loop;                            // 0x0350(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        SFX_SprintAbility_Off;                             // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        SFX_SprintAbility_On;                              // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               PS_WindHaste_01;                                   // 0x0368(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               PS_WindHasteSmear_01;                              // 0x0370(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0378(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Sprint_SFX_Fade_In_Time;                           // 0x0380(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Sprint_SFX_Fade_Out_Time;                          // 0x0384(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	bool OnRemove(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters);
	bool WhileActive(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GCue_Status_Sprint_Default_C">();
	}
	static class AGCue_Status_Sprint_Default_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGCue_Status_Sprint_Default_C>();
	}
};
static_assert(alignof(AGCue_Status_Sprint_Default_C) == 0x000008, "Wrong alignment on AGCue_Status_Sprint_Default_C");
static_assert(sizeof(AGCue_Status_Sprint_Default_C) == 0x000388, "Wrong size on AGCue_Status_Sprint_Default_C");
static_assert(offsetof(AGCue_Status_Sprint_Default_C, SFX_SprintAbility_Loop) == 0x000350, "Member 'AGCue_Status_Sprint_Default_C::SFX_SprintAbility_Loop' has a wrong offset!");
static_assert(offsetof(AGCue_Status_Sprint_Default_C, SFX_SprintAbility_Off) == 0x000358, "Member 'AGCue_Status_Sprint_Default_C::SFX_SprintAbility_Off' has a wrong offset!");
static_assert(offsetof(AGCue_Status_Sprint_Default_C, SFX_SprintAbility_On) == 0x000360, "Member 'AGCue_Status_Sprint_Default_C::SFX_SprintAbility_On' has a wrong offset!");
static_assert(offsetof(AGCue_Status_Sprint_Default_C, PS_WindHaste_01) == 0x000368, "Member 'AGCue_Status_Sprint_Default_C::PS_WindHaste_01' has a wrong offset!");
static_assert(offsetof(AGCue_Status_Sprint_Default_C, PS_WindHasteSmear_01) == 0x000370, "Member 'AGCue_Status_Sprint_Default_C::PS_WindHasteSmear_01' has a wrong offset!");
static_assert(offsetof(AGCue_Status_Sprint_Default_C, DefaultSceneRoot) == 0x000378, "Member 'AGCue_Status_Sprint_Default_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AGCue_Status_Sprint_Default_C, Sprint_SFX_Fade_In_Time) == 0x000380, "Member 'AGCue_Status_Sprint_Default_C::Sprint_SFX_Fade_In_Time' has a wrong offset!");
static_assert(offsetof(AGCue_Status_Sprint_Default_C, Sprint_SFX_Fade_Out_Time) == 0x000384, "Member 'AGCue_Status_Sprint_Default_C::Sprint_SFX_Fade_Out_Time' has a wrong offset!");

}

