#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCue_Status_SlowWeaponMissile_Structures

#include "Basic.hpp"

#include "Tempest_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GCue_Status_SlowWeaponMissile_Structures.GCue_Status_SlowWeaponMissile_Structures_C
// 0x0028 (0x0378 - 0x0350)
class AGCue_Status_SlowWeaponMissile_Structures_C final : public ATedGameplayCueNotify_StatusEffect
{
public:
	class UParticleSystemComponent*               PS_StatusSlow_01_WeaponMissile_SAMSite;            // 0x0350(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               PS_StatusSlow_01_WeaponMissile_MissileTurret;      // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               PS_StatusSlow_01_WeaponMissile_Haywire;            // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               PS_StatusSlow_01_WeaponMissile_AirFactory;         // 0x0368(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0370(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	bool OnRemove(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters);
	bool WhileActive(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GCue_Status_SlowWeaponMissile_Structures_C">();
	}
	static class AGCue_Status_SlowWeaponMissile_Structures_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGCue_Status_SlowWeaponMissile_Structures_C>();
	}
};
static_assert(alignof(AGCue_Status_SlowWeaponMissile_Structures_C) == 0x000008, "Wrong alignment on AGCue_Status_SlowWeaponMissile_Structures_C");
static_assert(sizeof(AGCue_Status_SlowWeaponMissile_Structures_C) == 0x000378, "Wrong size on AGCue_Status_SlowWeaponMissile_Structures_C");
static_assert(offsetof(AGCue_Status_SlowWeaponMissile_Structures_C, PS_StatusSlow_01_WeaponMissile_SAMSite) == 0x000350, "Member 'AGCue_Status_SlowWeaponMissile_Structures_C::PS_StatusSlow_01_WeaponMissile_SAMSite' has a wrong offset!");
static_assert(offsetof(AGCue_Status_SlowWeaponMissile_Structures_C, PS_StatusSlow_01_WeaponMissile_MissileTurret) == 0x000358, "Member 'AGCue_Status_SlowWeaponMissile_Structures_C::PS_StatusSlow_01_WeaponMissile_MissileTurret' has a wrong offset!");
static_assert(offsetof(AGCue_Status_SlowWeaponMissile_Structures_C, PS_StatusSlow_01_WeaponMissile_Haywire) == 0x000360, "Member 'AGCue_Status_SlowWeaponMissile_Structures_C::PS_StatusSlow_01_WeaponMissile_Haywire' has a wrong offset!");
static_assert(offsetof(AGCue_Status_SlowWeaponMissile_Structures_C, PS_StatusSlow_01_WeaponMissile_AirFactory) == 0x000368, "Member 'AGCue_Status_SlowWeaponMissile_Structures_C::PS_StatusSlow_01_WeaponMissile_AirFactory' has a wrong offset!");
static_assert(offsetof(AGCue_Status_SlowWeaponMissile_Structures_C, DefaultSceneRoot) == 0x000370, "Member 'AGCue_Status_SlowWeaponMissile_Structures_C::DefaultSceneRoot' has a wrong offset!");

}

