#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCue_Explosion_GrenadierDeath

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GCue_Explosion_GrenadierDeath.GCue_Explosion_GrenadierDeath_C.K2_HandleGameplayCue
// 0x0100 (0x0100 - 0x0000)
struct GCue_Explosion_GrenadierDeath_C_K2_HandleGameplayCue final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EGameplayCueEvent                             EventType;                                         // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 Parameters;                                        // 0x0010(0x00D8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class ATedUnitBase*                           K2Node_DynamicCast_AsTed_Unit_Base;                // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFXSystemComponent*                     CallFunc_SpawnEffectAttached_ReturnValue;          // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCue_Explosion_GrenadierDeath_C_K2_HandleGameplayCue) == 0x000008, "Wrong alignment on GCue_Explosion_GrenadierDeath_C_K2_HandleGameplayCue");
static_assert(sizeof(GCue_Explosion_GrenadierDeath_C_K2_HandleGameplayCue) == 0x000100, "Wrong size on GCue_Explosion_GrenadierDeath_C_K2_HandleGameplayCue");
static_assert(offsetof(GCue_Explosion_GrenadierDeath_C_K2_HandleGameplayCue, MyTarget) == 0x000000, "Member 'GCue_Explosion_GrenadierDeath_C_K2_HandleGameplayCue::MyTarget' has a wrong offset!");
static_assert(offsetof(GCue_Explosion_GrenadierDeath_C_K2_HandleGameplayCue, EventType) == 0x000008, "Member 'GCue_Explosion_GrenadierDeath_C_K2_HandleGameplayCue::EventType' has a wrong offset!");
static_assert(offsetof(GCue_Explosion_GrenadierDeath_C_K2_HandleGameplayCue, Parameters) == 0x000010, "Member 'GCue_Explosion_GrenadierDeath_C_K2_HandleGameplayCue::Parameters' has a wrong offset!");
static_assert(offsetof(GCue_Explosion_GrenadierDeath_C_K2_HandleGameplayCue, K2Node_DynamicCast_AsTed_Unit_Base) == 0x0000E8, "Member 'GCue_Explosion_GrenadierDeath_C_K2_HandleGameplayCue::K2Node_DynamicCast_AsTed_Unit_Base' has a wrong offset!");
static_assert(offsetof(GCue_Explosion_GrenadierDeath_C_K2_HandleGameplayCue, K2Node_DynamicCast_bSuccess) == 0x0000F0, "Member 'GCue_Explosion_GrenadierDeath_C_K2_HandleGameplayCue::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GCue_Explosion_GrenadierDeath_C_K2_HandleGameplayCue, CallFunc_SpawnEffectAttached_ReturnValue) == 0x0000F8, "Member 'GCue_Explosion_GrenadierDeath_C_K2_HandleGameplayCue::CallFunc_SpawnEffectAttached_ReturnValue' has a wrong offset!");

}

