#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCue_Status_GolemAura

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Tempest_classes.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GCue_Status_GolemAura.GCue_Status_GolemAura_C
// 0x0080 (0x03D0 - 0x0350)
class AGCue_Status_GolemAura_C final : public ATedGameplayCueNotify_StatusEffect
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CauserActor;                                       // 0x0360(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FVector                                TargetLocation;                                    // 0x0368(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFXSystemAsset*                         Hit_Effect_Asset;                                  // 0x0380(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           SocketsNames;                                      // 0x0388(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FVector                                CauserLocation;                                    // 0x0398(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FVector>                        SocketsLocations;                                  // 0x03B0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<double>                                DistanceSocketToTarget;                            // 0x03C0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_GCue_Status_GolemAura(int32 EntryPoint);
	void K2_HandleGameplayCue(class AActor* MyTarget, EGameplayCueEvent EventType, const struct FGameplayCueParameters& Parameters);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GCue_Status_GolemAura_C">();
	}
	static class AGCue_Status_GolemAura_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGCue_Status_GolemAura_C>();
	}
};
static_assert(alignof(AGCue_Status_GolemAura_C) == 0x000008, "Wrong alignment on AGCue_Status_GolemAura_C");
static_assert(sizeof(AGCue_Status_GolemAura_C) == 0x0003D0, "Wrong size on AGCue_Status_GolemAura_C");
static_assert(offsetof(AGCue_Status_GolemAura_C, UberGraphFrame) == 0x000350, "Member 'AGCue_Status_GolemAura_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AGCue_Status_GolemAura_C, DefaultSceneRoot) == 0x000358, "Member 'AGCue_Status_GolemAura_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AGCue_Status_GolemAura_C, CauserActor) == 0x000360, "Member 'AGCue_Status_GolemAura_C::CauserActor' has a wrong offset!");
static_assert(offsetof(AGCue_Status_GolemAura_C, TargetLocation) == 0x000368, "Member 'AGCue_Status_GolemAura_C::TargetLocation' has a wrong offset!");
static_assert(offsetof(AGCue_Status_GolemAura_C, Hit_Effect_Asset) == 0x000380, "Member 'AGCue_Status_GolemAura_C::Hit_Effect_Asset' has a wrong offset!");
static_assert(offsetof(AGCue_Status_GolemAura_C, SocketsNames) == 0x000388, "Member 'AGCue_Status_GolemAura_C::SocketsNames' has a wrong offset!");
static_assert(offsetof(AGCue_Status_GolemAura_C, CauserLocation) == 0x000398, "Member 'AGCue_Status_GolemAura_C::CauserLocation' has a wrong offset!");
static_assert(offsetof(AGCue_Status_GolemAura_C, SocketsLocations) == 0x0003B0, "Member 'AGCue_Status_GolemAura_C::SocketsLocations' has a wrong offset!");
static_assert(offsetof(AGCue_Status_GolemAura_C, DistanceSocketToTarget) == 0x0003C0, "Member 'AGCue_Status_GolemAura_C::DistanceSocketToTarget' has a wrong offset!");

}

