#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCue_Impact_Arcing_Moment

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function GCue_Impact_Arcing_Moment.GCue_Impact_Arcing_Moment_C.ExecuteUbergraph_GCue_Impact_Arcing_Moment
// 0x03D8 (0x03D8 - 0x0000)
struct GCue_Impact_Arcing_Moment_C_ExecuteUbergraph_GCue_Impact_Arcing_Moment final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_MyTarget;                             // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EGameplayCueEvent                             K2Node_Event_EventType;                            // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 K2Node_Event_Parameters;                           // 0x0040(0x00D8)(ConstParm, ContainsInstancedReference)
	float                                         CallFunc_BreakGameplayCueParameters_NormalizedMagnitude; // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakGameplayCueParameters_RawMagnitude;  // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           CallFunc_BreakGameplayCueParameters_EffectContext; // 0x0120(0x0018)()
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_MatchedTagName; // 0x0138(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_OriginalTag;   // 0x0140(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedSourceTags; // 0x0148(0x0020)()
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedTargetTags; // 0x0168(0x0020)()
	struct FVector                                CallFunc_BreakGameplayCueParameters_Location;      // 0x0188(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakGameplayCueParameters_Normal;        // 0x01A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_Instigator;    // 0x01B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_EffectCauser;  // 0x01C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_BreakGameplayCueParameters_SourceObject;  // 0x01C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakGameplayCueParameters_PhysicalMaterial; // 0x01D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_GameplayEffectLevel; // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_AbilityLevel;  // 0x01DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_BreakGameplayCueParameters_TargetAttachComponent; // 0x01E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy; // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E9[0x7];                                      // 0x01E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_EffectContextGetEffectCauser_ReturnValue; // 0x01F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F9[0x7];                                      // 0x01F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0200(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATedUnitBase*                           K2Node_DynamicCast_AsTed_Unit_Base;                // 0x0218(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_221[0x7];                                      // 0x0221(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATedStructureBase*                      K2Node_DynamicCast_AsTed_Structure_Base;           // 0x0228(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_231[0x7];                                      // 0x0231(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATedAircraft*                           K2Node_DynamicCast_AsTed_Aircraft;                 // 0x0238(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_241[0x7];                                      // 0x0241(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATedInfantry*                           K2Node_DynamicCast_AsTed_Infantry;                 // 0x0248(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_251[0x7];                                      // 0x0251(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_VETI_Vehicle_Moment_C*              K2Node_DynamicCast_AsBP_VETI_Vehicle_Moment;       // 0x0258(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_261[0x7];                                      // 0x0261(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x0268(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x0280(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x02A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A4[0x4];                                      // 0x02A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue_1;          // 0x02A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C1[0x3];                                      // 0x02C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_MinOfFloatArray_IndexOfMinValue;          // 0x02C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MinOfFloatArray_MinValue;                 // 0x02C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x02CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Vector_Distance_ReturnValue;              // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x02D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2DC[0x4];                                      // 0x02DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x02E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_1;      // 0x02F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x0310(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue_1;       // 0x0328(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x0340(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UFXSystemComponent*                     CallFunc_SpawnEffectAtLocation_ReturnValue;        // 0x0348(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_3;        // 0x0350(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_FindClosestBone_K2_BoneLocation;          // 0x0368(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_FindClosestBone_K2_ReturnValue;           // 0x0380(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_FindClosestBone_K2_BoneLocation_1;        // 0x0388(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_FindClosestBone_K2_ReturnValue_1;         // 0x03A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_FindClosestBone_K2_BoneLocation_2;        // 0x03A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_FindClosestBone_K2_ReturnValue_2;         // 0x03C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 CallFunc_MinOfFloatArray_FloatArray_ImplicitCast;  // 0x03C8(0x0010)(ConstParm, ReferenceParm)
};
static_assert(alignof(GCue_Impact_Arcing_Moment_C_ExecuteUbergraph_GCue_Impact_Arcing_Moment) == 0x000008, "Wrong alignment on GCue_Impact_Arcing_Moment_C_ExecuteUbergraph_GCue_Impact_Arcing_Moment");
static_assert(sizeof(GCue_Impact_Arcing_Moment_C_ExecuteUbergraph_GCue_Impact_Arcing_Moment) == 0x0003D8, "Wrong size on GCue_Impact_Arcing_Moment_C_ExecuteUbergraph_GCue_Impact_Arcing_Moment");
static_assert(offsetof(GCue_Impact_Arcing_Moment_C_ExecuteUbergraph_GCue_Impact_Arcing_Moment, EntryPoint) == 0x000000, "Member 'GCue_Impact_Arcing_Moment_C_ExecuteUbergraph_GCue_Impact_Arcing_Moment::EntryPoint' has a wrong offset!");
static_assert(offsetof(GCue_Impact_Arcing_Moment_C_ExecuteUbergraph_GCue_Impact_Arcing_Moment, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000008, "Member 'GCue_Impact_Arcing_Moment_C_ExecuteUbergraph_GCue_Impact_Arcing_Moment::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCue_Impact_Arcing_Moment_C_ExecuteUbergraph_GCue_Impact_Arcing_Moment, Temp_int_Loop_Counter_Variable) == 0x000020, "Member 'GCue_Impact_Arcing_Moment_C_ExecuteUbergraph_GCue_Impact_Arcing_Moment::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(GCue_Impact_Arcing_Moment_C_ExecuteUbergraph_GCue_Impact_Arcing_Moment, CallFunc_Add_IntInt_ReturnValue) == 0x000024, "Member 'GCue_Impact_Arcing_Moment_C_ExecuteUbergraph_GCue_Impact_Arcing_Moment::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCue_Impact_Arcing_Moment_C_ExecuteUbergraph_GCue_Impact_Arcing_Moment, Temp_int_Array_Index_Variable) == 0x000028, "Member 'GCue_Impact_Arcing_Moment_C_ExecuteUbergraph_GCue_Impact_Arcing_Moment::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(GCue_Impact_Arcing_Moment_C_ExecuteUbergraph_GCue_Impact_Arcing_Moment, K2Node_Event_MyTarget) == 0x000030, "Member 'GCue_Impact_Arcing_Moment_C_ExecuteUbergraph_GCue_Impact_Arcing_Moment::K2Node_Event_MyTarget' has a wrong offset!");
static_assert(offsetof(GCue_Impact_Arcing_Moment_C_ExecuteUbergraph_GCue_Impact_Arcing_Moment, K2Node_Event_EventType) == 0x000038, "Member 'GCue_Impact_Arcing_Moment_C_ExecuteUbergraph_GCue_Impact_Arcing_Moment::K2Node_Event_EventType' has a wrong offset!");
static_assert(offsetof(GCue_Impact_Arcing_Moment_C_ExecuteUbergraph_GCue_Impact_Arcing_Moment, K2Node_Event_Parameters) == 0x000040, "Member 'GCue_Impact_Arcing_Moment_C_ExecuteUbergraph_GCue_Impact_Arcing_Moment::K2Node_Event_Parameters' has a wrong offset!");
static_assert(offsetof(GCue_Impact_Arcing_Moment_C_ExecuteUbergraph_GCue_Impact_Arcing_Moment, CallFunc_BreakGameplayCueParameters_NormalizedMagnitude) == 0x000118, "Member 'GCue_Impact_Arcing_Moment_C_ExecuteUbergraph_GCue_Impact_Arcing_Moment::CallFunc_BreakGameplayCueParameters_NormalizedMagnitude' has a wrong offset!");
static_assert(offsetof(GCue_Impact_Arcing_Moment_C_ExecuteUbergraph_GCue_Impact_Arcing_Moment, CallFunc_BreakGameplayCueParameters_RawMagnitude) == 0x00011C, "Member 'GCue_Impact_Arcing_Moment_C_ExecuteUbergraph_GCue_Impact_Arcing_Moment::CallFunc_BreakGameplayCueParameters_RawMagnitude' has a wrong offset!");
static_assert(offsetof(GCue_Impact_Arcing_Moment_C_ExecuteUbergraph_GCue_Impact_Arcing_Moment, CallFunc_BreakGameplayCueParameters_EffectContext) == 0x000120, "Member 'GCue_Impact_Arcing_Moment_C_ExecuteUbergraph_GCue_Impact_Arcing_Moment::CallFunc_BreakGameplayCueParameters_EffectContext' has a wrong offset!");
static_assert(offsetof(GCue_Impact_Arcing_Moment_C_ExecuteUbergraph_GCue_Impact_Arcing_Moment, CallFunc_BreakGameplayCueParameters_MatchedTagName) == 0x000138, "Member 'GCue_Impact_Arcing_Moment_C_ExecuteUbergraph_GCue_Impact_Arcing_Moment::CallFunc_BreakGameplayCueParameters_MatchedTagName' has a wrong offset!");
static_assert(offsetof(GCue_Impact_Arcing_Moment_C_ExecuteUbergraph_GCue_Impact_Arcing_Moment, CallFunc_BreakGameplayCueParameters_OriginalTag) == 0x000140, "Member 'GCue_Impact_Arcing_Moment_C_ExecuteUbergraph_GCue_Impact_Arcing_Moment::CallFunc_BreakGameplayCueParameters_OriginalTag' has a wrong offset!");
static_assert(offsetof(GCue_Impact_Arcing_Moment_C_ExecuteUbergraph_GCue_Impact_Arcing_Moment, CallFunc_BreakGameplayCueParameters_AggregatedSourceTags) == 0x000148, "Member 'GCue_Impact_Arcing_Moment_C_ExecuteUbergraph_GCue_Impact_Arcing_Moment::CallFunc_BreakGameplayCueParameters_AggregatedSourceTags' has a wrong offset!");
static_assert(offsetof(GCue_Impact_Arcing_Moment_C_ExecuteUbergraph_GCue_Impact_Arcing_Moment, CallFunc_BreakGameplayCueParameters_AggregatedTargetTags) == 0x000168, "Member 'GCue_Impact_Arcing_Moment_C_ExecuteUbergraph_GCue_Impact_Arcing_Moment::CallFunc_BreakGameplayCueParameters_AggregatedTargetTags' has a wrong offset!");
static_assert(offsetof(GCue_Impact_Arcing_Moment_C_ExecuteUbergraph_GCue_Impact_Arcing_Moment, CallFunc_BreakGameplayCueParameters_Location) == 0x000188, "Member 'GCue_Impact_Arcing_Moment_C_ExecuteUbergraph_GCue_Impact_Arcing_Moment::CallFunc_BreakGameplayCueParameters_Location' has a wrong offset!");
static_assert(offsetof(GCue_Impact_Arcing_Moment_C_ExecuteUbergraph_GCue_Impact_Arcing_Moment, CallFunc_BreakGameplayCueParameters_Normal) == 0x0001A0, "Member 'GCue_Impact_Arcing_Moment_C_ExecuteUbergraph_GCue_Impact_Arcing_Moment::CallFunc_BreakGameplayCueParameters_Normal' has a wrong offset!");
static_assert(offsetof(GCue_Impact_Arcing_Moment_C_ExecuteUbergraph_GCue_Impact_Arcing_Moment, CallFunc_BreakGameplayCueParameters_Instigator) == 0x0001B8, "Member 'GCue_Impact_Arcing_Moment_C_ExecuteUbergraph_GCue_Impact_Arcing_Moment::CallFunc_BreakGameplayCueParameters_Instigator' has a wrong offset!");
static_assert(offsetof(GCue_Impact_Arcing_Moment_C_ExecuteUbergraph_GCue_Impact_Arcing_Moment, CallFunc_BreakGameplayCueParameters_EffectCauser) == 0x0001C0, "Member 'GCue_Impact_Arcing_Moment_C_ExecuteUbergraph_GCue_Impact_Arcing_Moment::CallFunc_BreakGameplayCueParameters_EffectCauser' has a wrong offset!");
static_assert(offsetof(GCue_Impact_Arcing_Moment_C_ExecuteUbergraph_GCue_Impact_Arcing_Moment, CallFunc_BreakGameplayCueParameters_SourceObject) == 0x0001C8, "Member 'GCue_Impact_Arcing_Moment_C_ExecuteUbergraph_GCue_Impact_Arcing_Moment::CallFunc_BreakGameplayCueParameters_SourceObject' has a wrong offset!");
static_assert(offsetof(GCue_Impact_Arcing_Moment_C_ExecuteUbergraph_GCue_Impact_Arcing_Moment, CallFunc_BreakGameplayCueParameters_PhysicalMaterial) == 0x0001D0, "Member 'GCue_Impact_Arcing_Moment_C_ExecuteUbergraph_GCue_Impact_Arcing_Moment::CallFunc_BreakGameplayCueParameters_PhysicalMaterial' has a wrong offset!");
static_assert(offsetof(GCue_Impact_Arcing_Moment_C_ExecuteUbergraph_GCue_Impact_Arcing_Moment, CallFunc_BreakGameplayCueParameters_GameplayEffectLevel) == 0x0001D8, "Member 'GCue_Impact_Arcing_Moment_C_ExecuteUbergraph_GCue_Impact_Arcing_Moment::CallFunc_BreakGameplayCueParameters_GameplayEffectLevel' has a wrong offset!");
static_assert(offsetof(GCue_Impact_Arcing_Moment_C_ExecuteUbergraph_GCue_Impact_Arcing_Moment, CallFunc_BreakGameplayCueParameters_AbilityLevel) == 0x0001DC, "Member 'GCue_Impact_Arcing_Moment_C_ExecuteUbergraph_GCue_Impact_Arcing_Moment::CallFunc_BreakGameplayCueParameters_AbilityLevel' has a wrong offset!");
static_assert(offsetof(GCue_Impact_Arcing_Moment_C_ExecuteUbergraph_GCue_Impact_Arcing_Moment, CallFunc_BreakGameplayCueParameters_TargetAttachComponent) == 0x0001E0, "Member 'GCue_Impact_Arcing_Moment_C_ExecuteUbergraph_GCue_Impact_Arcing_Moment::CallFunc_BreakGameplayCueParameters_TargetAttachComponent' has a wrong offset!");
static_assert(offsetof(GCue_Impact_Arcing_Moment_C_ExecuteUbergraph_GCue_Impact_Arcing_Moment, CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy) == 0x0001E8, "Member 'GCue_Impact_Arcing_Moment_C_ExecuteUbergraph_GCue_Impact_Arcing_Moment::CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy' has a wrong offset!");
static_assert(offsetof(GCue_Impact_Arcing_Moment_C_ExecuteUbergraph_GCue_Impact_Arcing_Moment, CallFunc_EffectContextGetEffectCauser_ReturnValue) == 0x0001F0, "Member 'GCue_Impact_Arcing_Moment_C_ExecuteUbergraph_GCue_Impact_Arcing_Moment::CallFunc_EffectContextGetEffectCauser_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCue_Impact_Arcing_Moment_C_ExecuteUbergraph_GCue_Impact_Arcing_Moment, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x0001F8, "Member 'GCue_Impact_Arcing_Moment_C_ExecuteUbergraph_GCue_Impact_Arcing_Moment::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCue_Impact_Arcing_Moment_C_ExecuteUbergraph_GCue_Impact_Arcing_Moment, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000200, "Member 'GCue_Impact_Arcing_Moment_C_ExecuteUbergraph_GCue_Impact_Arcing_Moment::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GCue_Impact_Arcing_Moment_C_ExecuteUbergraph_GCue_Impact_Arcing_Moment, K2Node_DynamicCast_AsTed_Unit_Base) == 0x000218, "Member 'GCue_Impact_Arcing_Moment_C_ExecuteUbergraph_GCue_Impact_Arcing_Moment::K2Node_DynamicCast_AsTed_Unit_Base' has a wrong offset!");
static_assert(offsetof(GCue_Impact_Arcing_Moment_C_ExecuteUbergraph_GCue_Impact_Arcing_Moment, K2Node_DynamicCast_bSuccess) == 0x000220, "Member 'GCue_Impact_Arcing_Moment_C_ExecuteUbergraph_GCue_Impact_Arcing_Moment::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GCue_Impact_Arcing_Moment_C_ExecuteUbergraph_GCue_Impact_Arcing_Moment, K2Node_DynamicCast_AsTed_Structure_Base) == 0x000228, "Member 'GCue_Impact_Arcing_Moment_C_ExecuteUbergraph_GCue_Impact_Arcing_Moment::K2Node_DynamicCast_AsTed_Structure_Base' has a wrong offset!");
static_assert(offsetof(GCue_Impact_Arcing_Moment_C_ExecuteUbergraph_GCue_Impact_Arcing_Moment, K2Node_DynamicCast_bSuccess_1) == 0x000230, "Member 'GCue_Impact_Arcing_Moment_C_ExecuteUbergraph_GCue_Impact_Arcing_Moment::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GCue_Impact_Arcing_Moment_C_ExecuteUbergraph_GCue_Impact_Arcing_Moment, K2Node_DynamicCast_AsTed_Aircraft) == 0x000238, "Member 'GCue_Impact_Arcing_Moment_C_ExecuteUbergraph_GCue_Impact_Arcing_Moment::K2Node_DynamicCast_AsTed_Aircraft' has a wrong offset!");
static_assert(offsetof(GCue_Impact_Arcing_Moment_C_ExecuteUbergraph_GCue_Impact_Arcing_Moment, K2Node_DynamicCast_bSuccess_2) == 0x000240, "Member 'GCue_Impact_Arcing_Moment_C_ExecuteUbergraph_GCue_Impact_Arcing_Moment::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(GCue_Impact_Arcing_Moment_C_ExecuteUbergraph_GCue_Impact_Arcing_Moment, K2Node_DynamicCast_AsTed_Infantry) == 0x000248, "Member 'GCue_Impact_Arcing_Moment_C_ExecuteUbergraph_GCue_Impact_Arcing_Moment::K2Node_DynamicCast_AsTed_Infantry' has a wrong offset!");
static_assert(offsetof(GCue_Impact_Arcing_Moment_C_ExecuteUbergraph_GCue_Impact_Arcing_Moment, K2Node_DynamicCast_bSuccess_3) == 0x000250, "Member 'GCue_Impact_Arcing_Moment_C_ExecuteUbergraph_GCue_Impact_Arcing_Moment::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(GCue_Impact_Arcing_Moment_C_ExecuteUbergraph_GCue_Impact_Arcing_Moment, K2Node_DynamicCast_AsBP_VETI_Vehicle_Moment) == 0x000258, "Member 'GCue_Impact_Arcing_Moment_C_ExecuteUbergraph_GCue_Impact_Arcing_Moment::K2Node_DynamicCast_AsBP_VETI_Vehicle_Moment' has a wrong offset!");
static_assert(offsetof(GCue_Impact_Arcing_Moment_C_ExecuteUbergraph_GCue_Impact_Arcing_Moment, K2Node_DynamicCast_bSuccess_4) == 0x000260, "Member 'GCue_Impact_Arcing_Moment_C_ExecuteUbergraph_GCue_Impact_Arcing_Moment::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(GCue_Impact_Arcing_Moment_C_ExecuteUbergraph_GCue_Impact_Arcing_Moment, CallFunc_GetSocketLocation_ReturnValue) == 0x000268, "Member 'GCue_Impact_Arcing_Moment_C_ExecuteUbergraph_GCue_Impact_Arcing_Moment::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCue_Impact_Arcing_Moment_C_ExecuteUbergraph_GCue_Impact_Arcing_Moment, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x000280, "Member 'GCue_Impact_Arcing_Moment_C_ExecuteUbergraph_GCue_Impact_Arcing_Moment::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GCue_Impact_Arcing_Moment_C_ExecuteUbergraph_GCue_Impact_Arcing_Moment, CallFunc_Array_Get_Item) == 0x000298, "Member 'GCue_Impact_Arcing_Moment_C_ExecuteUbergraph_GCue_Impact_Arcing_Moment::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GCue_Impact_Arcing_Moment_C_ExecuteUbergraph_GCue_Impact_Arcing_Moment, CallFunc_Array_Length_ReturnValue) == 0x0002A0, "Member 'GCue_Impact_Arcing_Moment_C_ExecuteUbergraph_GCue_Impact_Arcing_Moment::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCue_Impact_Arcing_Moment_C_ExecuteUbergraph_GCue_Impact_Arcing_Moment, CallFunc_GetSocketLocation_ReturnValue_1) == 0x0002A8, "Member 'GCue_Impact_Arcing_Moment_C_ExecuteUbergraph_GCue_Impact_Arcing_Moment::CallFunc_GetSocketLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GCue_Impact_Arcing_Moment_C_ExecuteUbergraph_GCue_Impact_Arcing_Moment, CallFunc_Less_IntInt_ReturnValue) == 0x0002C0, "Member 'GCue_Impact_Arcing_Moment_C_ExecuteUbergraph_GCue_Impact_Arcing_Moment::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCue_Impact_Arcing_Moment_C_ExecuteUbergraph_GCue_Impact_Arcing_Moment, CallFunc_MinOfFloatArray_IndexOfMinValue) == 0x0002C4, "Member 'GCue_Impact_Arcing_Moment_C_ExecuteUbergraph_GCue_Impact_Arcing_Moment::CallFunc_MinOfFloatArray_IndexOfMinValue' has a wrong offset!");
static_assert(offsetof(GCue_Impact_Arcing_Moment_C_ExecuteUbergraph_GCue_Impact_Arcing_Moment, CallFunc_MinOfFloatArray_MinValue) == 0x0002C8, "Member 'GCue_Impact_Arcing_Moment_C_ExecuteUbergraph_GCue_Impact_Arcing_Moment::CallFunc_MinOfFloatArray_MinValue' has a wrong offset!");
static_assert(offsetof(GCue_Impact_Arcing_Moment_C_ExecuteUbergraph_GCue_Impact_Arcing_Moment, CallFunc_Array_Add_ReturnValue) == 0x0002CC, "Member 'GCue_Impact_Arcing_Moment_C_ExecuteUbergraph_GCue_Impact_Arcing_Moment::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCue_Impact_Arcing_Moment_C_ExecuteUbergraph_GCue_Impact_Arcing_Moment, CallFunc_Vector_Distance_ReturnValue) == 0x0002D0, "Member 'GCue_Impact_Arcing_Moment_C_ExecuteUbergraph_GCue_Impact_Arcing_Moment::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCue_Impact_Arcing_Moment_C_ExecuteUbergraph_GCue_Impact_Arcing_Moment, CallFunc_Array_Add_ReturnValue_1) == 0x0002D8, "Member 'GCue_Impact_Arcing_Moment_C_ExecuteUbergraph_GCue_Impact_Arcing_Moment::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GCue_Impact_Arcing_Moment_C_ExecuteUbergraph_GCue_Impact_Arcing_Moment, CallFunc_Subtract_VectorVector_ReturnValue) == 0x0002E0, "Member 'GCue_Impact_Arcing_Moment_C_ExecuteUbergraph_GCue_Impact_Arcing_Moment::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCue_Impact_Arcing_Moment_C_ExecuteUbergraph_GCue_Impact_Arcing_Moment, CallFunc_Subtract_VectorVector_ReturnValue_1) == 0x0002F8, "Member 'GCue_Impact_Arcing_Moment_C_ExecuteUbergraph_GCue_Impact_Arcing_Moment::CallFunc_Subtract_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GCue_Impact_Arcing_Moment_C_ExecuteUbergraph_GCue_Impact_Arcing_Moment, CallFunc_Conv_VectorToRotator_ReturnValue) == 0x000310, "Member 'GCue_Impact_Arcing_Moment_C_ExecuteUbergraph_GCue_Impact_Arcing_Moment::CallFunc_Conv_VectorToRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCue_Impact_Arcing_Moment_C_ExecuteUbergraph_GCue_Impact_Arcing_Moment, CallFunc_Conv_VectorToRotator_ReturnValue_1) == 0x000328, "Member 'GCue_Impact_Arcing_Moment_C_ExecuteUbergraph_GCue_Impact_Arcing_Moment::CallFunc_Conv_VectorToRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GCue_Impact_Arcing_Moment_C_ExecuteUbergraph_GCue_Impact_Arcing_Moment, CallFunc_SpawnSystemAtLocation_ReturnValue) == 0x000340, "Member 'GCue_Impact_Arcing_Moment_C_ExecuteUbergraph_GCue_Impact_Arcing_Moment::CallFunc_SpawnSystemAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCue_Impact_Arcing_Moment_C_ExecuteUbergraph_GCue_Impact_Arcing_Moment, CallFunc_SpawnEffectAtLocation_ReturnValue) == 0x000348, "Member 'GCue_Impact_Arcing_Moment_C_ExecuteUbergraph_GCue_Impact_Arcing_Moment::CallFunc_SpawnEffectAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCue_Impact_Arcing_Moment_C_ExecuteUbergraph_GCue_Impact_Arcing_Moment, CallFunc_K2_GetActorLocation_ReturnValue_3) == 0x000350, "Member 'GCue_Impact_Arcing_Moment_C_ExecuteUbergraph_GCue_Impact_Arcing_Moment::CallFunc_K2_GetActorLocation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GCue_Impact_Arcing_Moment_C_ExecuteUbergraph_GCue_Impact_Arcing_Moment, CallFunc_FindClosestBone_K2_BoneLocation) == 0x000368, "Member 'GCue_Impact_Arcing_Moment_C_ExecuteUbergraph_GCue_Impact_Arcing_Moment::CallFunc_FindClosestBone_K2_BoneLocation' has a wrong offset!");
static_assert(offsetof(GCue_Impact_Arcing_Moment_C_ExecuteUbergraph_GCue_Impact_Arcing_Moment, CallFunc_FindClosestBone_K2_ReturnValue) == 0x000380, "Member 'GCue_Impact_Arcing_Moment_C_ExecuteUbergraph_GCue_Impact_Arcing_Moment::CallFunc_FindClosestBone_K2_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCue_Impact_Arcing_Moment_C_ExecuteUbergraph_GCue_Impact_Arcing_Moment, CallFunc_FindClosestBone_K2_BoneLocation_1) == 0x000388, "Member 'GCue_Impact_Arcing_Moment_C_ExecuteUbergraph_GCue_Impact_Arcing_Moment::CallFunc_FindClosestBone_K2_BoneLocation_1' has a wrong offset!");
static_assert(offsetof(GCue_Impact_Arcing_Moment_C_ExecuteUbergraph_GCue_Impact_Arcing_Moment, CallFunc_FindClosestBone_K2_ReturnValue_1) == 0x0003A0, "Member 'GCue_Impact_Arcing_Moment_C_ExecuteUbergraph_GCue_Impact_Arcing_Moment::CallFunc_FindClosestBone_K2_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GCue_Impact_Arcing_Moment_C_ExecuteUbergraph_GCue_Impact_Arcing_Moment, CallFunc_FindClosestBone_K2_BoneLocation_2) == 0x0003A8, "Member 'GCue_Impact_Arcing_Moment_C_ExecuteUbergraph_GCue_Impact_Arcing_Moment::CallFunc_FindClosestBone_K2_BoneLocation_2' has a wrong offset!");
static_assert(offsetof(GCue_Impact_Arcing_Moment_C_ExecuteUbergraph_GCue_Impact_Arcing_Moment, CallFunc_FindClosestBone_K2_ReturnValue_2) == 0x0003C0, "Member 'GCue_Impact_Arcing_Moment_C_ExecuteUbergraph_GCue_Impact_Arcing_Moment::CallFunc_FindClosestBone_K2_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GCue_Impact_Arcing_Moment_C_ExecuteUbergraph_GCue_Impact_Arcing_Moment, CallFunc_MinOfFloatArray_FloatArray_ImplicitCast) == 0x0003C8, "Member 'GCue_Impact_Arcing_Moment_C_ExecuteUbergraph_GCue_Impact_Arcing_Moment::CallFunc_MinOfFloatArray_FloatArray_ImplicitCast' has a wrong offset!");

// Function GCue_Impact_Arcing_Moment.GCue_Impact_Arcing_Moment_C.K2_HandleGameplayCue
// 0x00E8 (0x00E8 - 0x0000)
struct GCue_Impact_Arcing_Moment_C_K2_HandleGameplayCue final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EGameplayCueEvent                             EventType;                                         // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 Parameters;                                        // 0x0010(0x00D8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GCue_Impact_Arcing_Moment_C_K2_HandleGameplayCue) == 0x000008, "Wrong alignment on GCue_Impact_Arcing_Moment_C_K2_HandleGameplayCue");
static_assert(sizeof(GCue_Impact_Arcing_Moment_C_K2_HandleGameplayCue) == 0x0000E8, "Wrong size on GCue_Impact_Arcing_Moment_C_K2_HandleGameplayCue");
static_assert(offsetof(GCue_Impact_Arcing_Moment_C_K2_HandleGameplayCue, MyTarget) == 0x000000, "Member 'GCue_Impact_Arcing_Moment_C_K2_HandleGameplayCue::MyTarget' has a wrong offset!");
static_assert(offsetof(GCue_Impact_Arcing_Moment_C_K2_HandleGameplayCue, EventType) == 0x000008, "Member 'GCue_Impact_Arcing_Moment_C_K2_HandleGameplayCue::EventType' has a wrong offset!");
