#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCue_Status_Repair_Default

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function GCue_Status_Repair_Default.GCue_Status_Repair_Default_C.EnableCheckHealth
// 0x0001 (0x0001 - 0x0000)
struct GCue_Status_Repair_Default_C_EnableCheckHealth final
{
public:
	bool                                          bEnable;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCue_Status_Repair_Default_C_EnableCheckHealth) == 0x000001, "Wrong alignment on GCue_Status_Repair_Default_C_EnableCheckHealth");
static_assert(sizeof(GCue_Status_Repair_Default_C_EnableCheckHealth) == 0x000001, "Wrong size on GCue_Status_Repair_Default_C_EnableCheckHealth");
static_assert(offsetof(GCue_Status_Repair_Default_C_EnableCheckHealth, bEnable) == 0x000000, "Member 'GCue_Status_Repair_Default_C_EnableCheckHealth::bEnable' has a wrong offset!");

// Function GCue_Status_Repair_Default.GCue_Status_Repair_Default_C.ExecuteUbergraph_GCue_Status_Repair_Default
// 0x0078 (0x0078 - 0x0000)
struct GCue_Status_Repair_Default_C_ExecuteUbergraph_GCue_Status_Repair_Default final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0020(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bEnable;                        // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetHealthMax_ReturnValue;                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetHealth_ReturnValue;                    // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsActive_ReturnValue;                     // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E[0x2];                                       // 0x003E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_Array_Get_Item_1;                         // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x005D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E[0x2];                                       // 0x005E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GreaterEqual_DoubleDouble_B_ImplicitCast; // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast; // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCue_Status_Repair_Default_C_ExecuteUbergraph_GCue_Status_Repair_Default) == 0x000008, "Wrong alignment on GCue_Status_Repair_Default_C_ExecuteUbergraph_GCue_Status_Repair_Default");
static_assert(sizeof(GCue_Status_Repair_Default_C_ExecuteUbergraph_GCue_Status_Repair_Default) == 0x000078, "Wrong size on GCue_Status_Repair_Default_C_ExecuteUbergraph_GCue_Status_Repair_Default");
static_assert(offsetof(GCue_Status_Repair_Default_C_ExecuteUbergraph_GCue_Status_Repair_Default, EntryPoint) == 0x000000, "Member 'GCue_Status_Repair_Default_C_ExecuteUbergraph_GCue_Status_Repair_Default::EntryPoint' has a wrong offset!");
static_assert(offsetof(GCue_Status_Repair_Default_C_ExecuteUbergraph_GCue_Status_Repair_Default, Temp_int_Array_Index_Variable) == 0x000004, "Member 'GCue_Status_Repair_Default_C_ExecuteUbergraph_GCue_Status_Repair_Default::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(GCue_Status_Repair_Default_C_ExecuteUbergraph_GCue_Status_Repair_Default, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'GCue_Status_Repair_Default_C_ExecuteUbergraph_GCue_Status_Repair_Default::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GCue_Status_Repair_Default_C_ExecuteUbergraph_GCue_Status_Repair_Default, Temp_int_Loop_Counter_Variable) == 0x000018, "Member 'GCue_Status_Repair_Default_C_ExecuteUbergraph_GCue_Status_Repair_Default::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(GCue_Status_Repair_Default_C_ExecuteUbergraph_GCue_Status_Repair_Default, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000020, "Member 'GCue_Status_Repair_Default_C_ExecuteUbergraph_GCue_Status_Repair_Default::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCue_Status_Repair_Default_C_ExecuteUbergraph_GCue_Status_Repair_Default, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'GCue_Status_Repair_Default_C_ExecuteUbergraph_GCue_Status_Repair_Default::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCue_Status_Repair_Default_C_ExecuteUbergraph_GCue_Status_Repair_Default, Temp_int_Array_Index_Variable_1) == 0x00002C, "Member 'GCue_Status_Repair_Default_C_ExecuteUbergraph_GCue_Status_Repair_Default::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(GCue_Status_Repair_Default_C_ExecuteUbergraph_GCue_Status_Repair_Default, K2Node_CustomEvent_bEnable) == 0x000030, "Member 'GCue_Status_Repair_Default_C_ExecuteUbergraph_GCue_Status_Repair_Default::K2Node_CustomEvent_bEnable' has a wrong offset!");
static_assert(offsetof(GCue_Status_Repair_Default_C_ExecuteUbergraph_GCue_Status_Repair_Default, CallFunc_GetHealthMax_ReturnValue) == 0x000034, "Member 'GCue_Status_Repair_Default_C_ExecuteUbergraph_GCue_Status_Repair_Default::CallFunc_GetHealthMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCue_Status_Repair_Default_C_ExecuteUbergraph_GCue_Status_Repair_Default, CallFunc_GetHealth_ReturnValue) == 0x000038, "Member 'GCue_Status_Repair_Default_C_ExecuteUbergraph_GCue_Status_Repair_Default::CallFunc_GetHealth_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCue_Status_Repair_Default_C_ExecuteUbergraph_GCue_Status_Repair_Default, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x00003C, "Member 'GCue_Status_Repair_Default_C_ExecuteUbergraph_GCue_Status_Repair_Default::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCue_Status_Repair_Default_C_ExecuteUbergraph_GCue_Status_Repair_Default, CallFunc_IsActive_ReturnValue) == 0x00003D, "Member 'GCue_Status_Repair_Default_C_ExecuteUbergraph_GCue_Status_Repair_Default::CallFunc_IsActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCue_Status_Repair_Default_C_ExecuteUbergraph_GCue_Status_Repair_Default, CallFunc_Array_Get_Item) == 0x000040, "Member 'GCue_Status_Repair_Default_C_ExecuteUbergraph_GCue_Status_Repair_Default::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GCue_Status_Repair_Default_C_ExecuteUbergraph_GCue_Status_Repair_Default, CallFunc_Array_Length_ReturnValue) == 0x000048, "Member 'GCue_Status_Repair_Default_C_ExecuteUbergraph_GCue_Status_Repair_Default::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCue_Status_Repair_Default_C_ExecuteUbergraph_GCue_Status_Repair_Default, Temp_int_Loop_Counter_Variable_1) == 0x00004C, "Member 'GCue_Status_Repair_Default_C_ExecuteUbergraph_GCue_Status_Repair_Default::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(GCue_Status_Repair_Default_C_ExecuteUbergraph_GCue_Status_Repair_Default, CallFunc_Array_Get_Item_1) == 0x000050, "Member 'GCue_Status_Repair_Default_C_ExecuteUbergraph_GCue_Status_Repair_Default::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(GCue_Status_Repair_Default_C_ExecuteUbergraph_GCue_Status_Repair_Default, CallFunc_Array_Length_ReturnValue_1) == 0x000058, "Member 'GCue_Status_Repair_Default_C_ExecuteUbergraph_GCue_Status_Repair_Default::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GCue_Status_Repair_Default_C_ExecuteUbergraph_GCue_Status_Repair_Default, CallFunc_Less_IntInt_ReturnValue) == 0x00005C, "Member 'GCue_Status_Repair_Default_C_ExecuteUbergraph_GCue_Status_Repair_Default::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCue_Status_Repair_Default_C_ExecuteUbergraph_GCue_Status_Repair_Default, CallFunc_Less_IntInt_ReturnValue_1) == 0x00005D, "Member 'GCue_Status_Repair_Default_C_ExecuteUbergraph_GCue_Status_Repair_Default::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GCue_Status_Repair_Default_C_ExecuteUbergraph_GCue_Status_Repair_Default, CallFunc_Add_IntInt_ReturnValue_1) == 0x000060, "Member 'GCue_Status_Repair_Default_C_ExecuteUbergraph_GCue_Status_Repair_Default::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GCue_Status_Repair_Default_C_ExecuteUbergraph_GCue_Status_Repair_Default, CallFunc_GreaterEqual_DoubleDouble_B_ImplicitCast) == 0x000068, "Member 'GCue_Status_Repair_Default_C_ExecuteUbergraph_GCue_Status_Repair_Default::CallFunc_GreaterEqual_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GCue_Status_Repair_Default_C_ExecuteUbergraph_GCue_Status_Repair_Default, CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast) == 0x000070, "Member 'GCue_Status_Repair_Default_C_ExecuteUbergraph_GCue_Status_Repair_Default::CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function GCue_Status_Repair_Default.GCue_Status_Repair_Default_C.OnRemove
// 0x0108 (0x0108 - 0x0000)
struct GCue_Status_Repair_Default_C_OnRemove final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00D8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00E0(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_OnRemove_ReturnValue;                     // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E2[0x2];                                       // 0x00E2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_Array_Get_Item;                           // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCue_Status_Repair_Default_C_OnRemove) == 0x000008, "Wrong alignment on GCue_Status_Repair_Default_C_OnRemove");
static_assert(sizeof(GCue_Status_Repair_Default_C_OnRemove) == 0x000108, "Wrong size on GCue_Status_Repair_Default_C_OnRemove");
static_assert(offsetof(GCue_Status_Repair_Default_C_OnRemove, MyTarget) == 0x000000, "Member 'GCue_Status_Repair_Default_C_OnRemove::MyTarget' has a wrong offset!");
static_assert(offsetof(GCue_Status_Repair_Default_C_OnRemove, Parameters) == 0x000008, "Member 'GCue_Status_Repair_Default_C_OnRemove::Parameters' has a wrong offset!");
static_assert(offsetof(GCue_Status_Repair_Default_C_OnRemove, ReturnValue) == 0x0000E0, "Member 'GCue_Status_Repair_Default_C_OnRemove::ReturnValue' has a wrong offset!");
static_assert(offsetof(GCue_Status_Repair_Default_C_OnRemove, CallFunc_OnRemove_ReturnValue) == 0x0000E1, "Member 'GCue_Status_Repair_Default_C_OnRemove::CallFunc_OnRemove_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCue_Status_Repair_Default_C_OnRemove, Temp_int_Array_Index_Variable) == 0x0000E4, "Member 'GCue_Status_Repair_Default_C_OnRemove::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(GCue_Status_Repair_Default_C_OnRemove, Temp_int_Loop_Counter_Variable) == 0x0000E8, "Member 'GCue_Status_Repair_Default_C_OnRemove::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(GCue_Status_Repair_Default_C_OnRemove, CallFunc_Array_Get_Item) == 0x0000F0, "Member 'GCue_Status_Repair_Default_C_OnRemove::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GCue_Status_Repair_Default_C_OnRemove, CallFunc_Add_IntInt_ReturnValue) == 0x0000F8, "Member 'GCue_Status_Repair_Default_C_OnRemove::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCue_Status_Repair_Default_C_OnRemove, CallFunc_Array_Length_ReturnValue) == 0x0000FC, "Member 'GCue_Status_Repair_Default_C_OnRemove::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCue_Status_Repair_Default_C_OnRemove, CallFunc_Less_IntInt_ReturnValue) == 0x000100, "Member 'GCue_Status_Repair_Default_C_OnRemove::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCue_Status_Repair_Default_C_OnRemove, CallFunc_IsValid_ReturnValue) == 0x000101, "Member 'GCue_Status_Repair_Default_C_OnRemove::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function GCue_Status_Repair_Default.GCue_Status_Repair_Default_C.WhileActive
// 0x02A8 (0x02A8 - 0x0000)
struct GCue_Status_Repair_Default_C_WhileActive final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00D8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00E0(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_WhileActive_ReturnValue;                  // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E2[0x6];                                       // 0x00E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ATedPawn*                               K2Node_DynamicCast_AsTed_Pawn;                     // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x3];                                       // 0x00F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetHealthMax_ReturnValue;                 // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetHealth_ReturnValue;                    // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetComponentBounds_Origin;                // 0x0110(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetComponentBounds_BoxExtent;             // 0x0128(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetComponentBounds_SphereRadius;          // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_144[0x4];                                      // 0x0144(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector_X;                            // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0160(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0178(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_Array_Get_Item;                           // 0x0190(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x019C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19D[0x3];                                      // 0x019D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x01A0(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	double                                        CallFunc_Less_DoubleDouble_B_ImplicitCast;         // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast;         // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCue_Status_Repair_Default_C_WhileActive) == 0x000008, "Wrong alignment on GCue_Status_Repair_Default_C_WhileActive");
static_assert(sizeof(GCue_Status_Repair_Default_C_WhileActive) == 0x0002A8, "Wrong size on GCue_Status_Repair_Default_C_WhileActive");
static_assert(offsetof(GCue_Status_Repair_Default_C_WhileActive, MyTarget) == 0x000000, "Member 'GCue_Status_Repair_Default_C_WhileActive::MyTarget' has a wrong offset!");
static_assert(offsetof(GCue_Status_Repair_Default_C_WhileActive, Parameters) == 0x000008, "Member 'GCue_Status_Repair_Default_C_WhileActive::Parameters' has a wrong offset!");
static_assert(offsetof(GCue_Status_Repair_Default_C_WhileActive, ReturnValue) == 0x0000E0, "Member 'GCue_Status_Repair_Default_C_WhileActive::ReturnValue' has a wrong offset!");
static_assert(offsetof(GCue_Status_Repair_Default_C_WhileActive, CallFunc_WhileActive_ReturnValue) == 0x0000E1, "Member 'GCue_Status_Repair_Default_C_WhileActive::CallFunc_WhileActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCue_Status_Repair_Default_C_WhileActive, K2Node_DynamicCast_AsTed_Pawn) == 0x0000E8, "Member 'GCue_Status_Repair_Default_C_WhileActive::K2Node_DynamicCast_AsTed_Pawn' has a wrong offset!");
static_assert(offsetof(GCue_Status_Repair_Default_C_WhileActive, K2Node_DynamicCast_bSuccess) == 0x0000F0, "Member 'GCue_Status_Repair_Default_C_WhileActive::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GCue_Status_Repair_Default_C_WhileActive, Temp_int_Array_Index_Variable) == 0x0000F4, "Member 'GCue_Status_Repair_Default_C_WhileActive::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(GCue_Status_Repair_Default_C_WhileActive, Temp_int_Loop_Counter_Variable) == 0x0000F8, "Member 'GCue_Status_Repair_Default_C_WhileActive::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(GCue_Status_Repair_Default_C_WhileActive, CallFunc_Add_IntInt_ReturnValue) == 0x0000FC, "Member 'GCue_Status_Repair_Default_C_WhileActive::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCue_Status_Repair_Default_C_WhileActive, CallFunc_GetHealthMax_ReturnValue) == 0x000100, "Member 'GCue_Status_Repair_Default_C_WhileActive::CallFunc_GetHealthMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCue_Status_Repair_Default_C_WhileActive, CallFunc_GetHealth_ReturnValue) == 0x000104, "Member 'GCue_Status_Repair_Default_C_WhileActive::CallFunc_GetHealth_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCue_Status_Repair_Default_C_WhileActive, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000108, "Member 'GCue_Status_Repair_Default_C_WhileActive::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCue_Status_Repair_Default_C_WhileActive, CallFunc_GetComponentBounds_Origin) == 0x000110, "Member 'GCue_Status_Repair_Default_C_WhileActive::CallFunc_GetComponentBounds_Origin' has a wrong offset!");
static_assert(offsetof(GCue_Status_Repair_Default_C_WhileActive, CallFunc_GetComponentBounds_BoxExtent) == 0x000128, "Member 'GCue_Status_Repair_Default_C_WhileActive::CallFunc_GetComponentBounds_BoxExtent' has a wrong offset!");
static_assert(offsetof(GCue_Status_Repair_Default_C_WhileActive, CallFunc_GetComponentBounds_SphereRadius) == 0x000140, "Member 'GCue_Status_Repair_Default_C_WhileActive::CallFunc_GetComponentBounds_SphereRadius' has a wrong offset!");
static_assert(offsetof(GCue_Status_Repair_Default_C_WhileActive, CallFunc_BreakVector_X) == 0x000148, "Member 'GCue_Status_Repair_Default_C_WhileActive::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(GCue_Status_Repair_Default_C_WhileActive, CallFunc_BreakVector_Y) == 0x000150, "Member 'GCue_Status_Repair_Default_C_WhileActive::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(GCue_Status_Repair_Default_C_WhileActive, CallFunc_BreakVector_Z) == 0x000158, "Member 'GCue_Status_Repair_Default_C_WhileActive::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(GCue_Status_Repair_Default_C_WhileActive, CallFunc_MakeVector_ReturnValue) == 0x000160, "Member 'GCue_Status_Repair_Default_C_WhileActive::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCue_Status_Repair_Default_C_WhileActive, CallFunc_Add_VectorVector_ReturnValue) == 0x000178, "Member 'GCue_Status_Repair_Default_C_WhileActive::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCue_Status_Repair_Default_C_WhileActive, CallFunc_Array_Get_Item) == 0x000190, "Member 'GCue_Status_Repair_Default_C_WhileActive::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GCue_Status_Repair_Default_C_WhileActive, CallFunc_Array_Length_ReturnValue) == 0x000198, "Member 'GCue_Status_Repair_Default_C_WhileActive::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCue_Status_Repair_Default_C_WhileActive, CallFunc_Less_IntInt_ReturnValue) == 0x00019C, "Member 'GCue_Status_Repair_Default_C_WhileActive::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCue_Status_Repair_Default_C_WhileActive, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x0001A0, "Member 'GCue_Status_Repair_Default_C_WhileActive::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(GCue_Status_Repair_Default_C_WhileActive, CallFunc_Less_DoubleDouble_B_ImplicitCast) == 0x000298, "Member 'GCue_Status_Repair_Default_C_WhileActive::CallFunc_Less_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GCue_Status_Repair_Default_C_WhileActive, CallFunc_Less_DoubleDouble_A_ImplicitCast) == 0x0002A0, "Member 'GCue_Status_Repair_Default_C_WhileActive::CallFunc_Less_DoubleDouble_A_ImplicitCast' has a wrong offset!");

}

