#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCue_Ability_RiotSuppressionSystem_Default

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function GCue_Ability_RiotSuppressionSystem_Default.GCue_Ability_RiotSuppressionSystem_Default_C.OnActive
// 0x0230 (0x0230 - 0x0000)
struct GCue_Ability_RiotSuppressionSystem_Default_C_OnActive final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00D8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00E0(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ATedUnitBase*                           K2Node_DynamicCast_AsTed_Unit_Base;                // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetComponentBounds_Origin;                // 0x0100(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetComponentBounds_BoxExtent;             // 0x0118(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetComponentBounds_SphereRadius;          // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_134[0x4];                                      // 0x0134(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x0138(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(GCue_Ability_RiotSuppressionSystem_Default_C_OnActive) == 0x000008, "Wrong alignment on GCue_Ability_RiotSuppressionSystem_Default_C_OnActive");
static_assert(sizeof(GCue_Ability_RiotSuppressionSystem_Default_C_OnActive) == 0x000230, "Wrong size on GCue_Ability_RiotSuppressionSystem_Default_C_OnActive");
static_assert(offsetof(GCue_Ability_RiotSuppressionSystem_Default_C_OnActive, MyTarget) == 0x000000, "Member 'GCue_Ability_RiotSuppressionSystem_Default_C_OnActive::MyTarget' has a wrong offset!");
static_assert(offsetof(GCue_Ability_RiotSuppressionSystem_Default_C_OnActive, Parameters) == 0x000008, "Member 'GCue_Ability_RiotSuppressionSystem_Default_C_OnActive::Parameters' has a wrong offset!");
static_assert(offsetof(GCue_Ability_RiotSuppressionSystem_Default_C_OnActive, ReturnValue) == 0x0000E0, "Member 'GCue_Ability_RiotSuppressionSystem_Default_C_OnActive::ReturnValue' has a wrong offset!");
static_assert(offsetof(GCue_Ability_RiotSuppressionSystem_Default_C_OnActive, CallFunc_GetOwner_ReturnValue) == 0x0000E8, "Member 'GCue_Ability_RiotSuppressionSystem_Default_C_OnActive::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCue_Ability_RiotSuppressionSystem_Default_C_OnActive, K2Node_DynamicCast_AsTed_Unit_Base) == 0x0000F0, "Member 'GCue_Ability_RiotSuppressionSystem_Default_C_OnActive::K2Node_DynamicCast_AsTed_Unit_Base' has a wrong offset!");
static_assert(offsetof(GCue_Ability_RiotSuppressionSystem_Default_C_OnActive, K2Node_DynamicCast_bSuccess) == 0x0000F8, "Member 'GCue_Ability_RiotSuppressionSystem_Default_C_OnActive::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GCue_Ability_RiotSuppressionSystem_Default_C_OnActive, CallFunc_GetComponentBounds_Origin) == 0x000100, "Member 'GCue_Ability_RiotSuppressionSystem_Default_C_OnActive::CallFunc_GetComponentBounds_Origin' has a wrong offset!");
static_assert(offsetof(GCue_Ability_RiotSuppressionSystem_Default_C_OnActive, CallFunc_GetComponentBounds_BoxExtent) == 0x000118, "Member 'GCue_Ability_RiotSuppressionSystem_Default_C_OnActive::CallFunc_GetComponentBounds_BoxExtent' has a wrong offset!");
static_assert(offsetof(GCue_Ability_RiotSuppressionSystem_Default_C_OnActive, CallFunc_GetComponentBounds_SphereRadius) == 0x000130, "Member 'GCue_Ability_RiotSuppressionSystem_Default_C_OnActive::CallFunc_GetComponentBounds_SphereRadius' has a wrong offset!");
static_assert(offsetof(GCue_Ability_RiotSuppressionSystem_Default_C_OnActive, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x000138, "Member 'GCue_Ability_RiotSuppressionSystem_Default_C_OnActive::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");

// Function GCue_Ability_RiotSuppressionSystem_Default.GCue_Ability_RiotSuppressionSystem_Default_C.OnRemove
// 0x00E8 (0x00E8 - 0x0000)
struct GCue_Ability_RiotSuppressionSystem_Default_C_OnRemove final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00D8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00E0(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCue_Ability_RiotSuppressionSystem_Default_C_OnRemove) == 0x000008, "Wrong alignment on GCue_Ability_RiotSuppressionSystem_Default_C_OnRemove");
static_assert(sizeof(GCue_Ability_RiotSuppressionSystem_Default_C_OnRemove) == 0x0000E8, "Wrong size on GCue_Ability_RiotSuppressionSystem_Default_C_OnRemove");
static_assert(offsetof(GCue_Ability_RiotSuppressionSystem_Default_C_OnRemove, MyTarget) == 0x000000, "Member 'GCue_Ability_RiotSuppressionSystem_Default_C_OnRemove::MyTarget' has a wrong offset!");
static_assert(offsetof(GCue_Ability_RiotSuppressionSystem_Default_C_OnRemove, Parameters) == 0x000008, "Member 'GCue_Ability_RiotSuppressionSystem_Default_C_OnRemove::Parameters' has a wrong offset!");
static_assert(offsetof(GCue_Ability_RiotSuppressionSystem_Default_C_OnRemove, ReturnValue) == 0x0000E0, "Member 'GCue_Ability_RiotSuppressionSystem_Default_C_OnRemove::ReturnValue' has a wrong offset!");

}

