#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCue_Status_Repair_Default

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Tempest_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GCue_Status_Repair_Default.GCue_Status_Repair_Default_C
// 0x0040 (0x0390 - 0x0350)
class AGCue_Status_Repair_Default_C final : public ATedGameplayCueNotify_StatusEffect
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAudioComponent*                        VehicleRepairSFX;                                  // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               PS_Repair_01;                                      // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0368(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ATedPawn*                               TedUnitCastCache;                                  // 0x0370(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class UMaterialInstanceDynamic*>       MeshMIDsCache;                                     // 0x0378(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FTimerHandle                           CheckHealthHandle;                                 // 0x0388(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void CustomEvent_0();
	void EnableCheckHealth(bool bEnable);
	void ExecuteUbergraph_GCue_Status_Repair_Default(int32 EntryPoint);
	bool OnRemove(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters);
	bool WhileActive(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GCue_Status_Repair_Default_C">();
	}
	static class AGCue_Status_Repair_Default_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGCue_Status_Repair_Default_C>();
	}
};
static_assert(alignof(AGCue_Status_Repair_Default_C) == 0x000008, "Wrong alignment on AGCue_Status_Repair_Default_C");
static_assert(sizeof(AGCue_Status_Repair_Default_C) == 0x000390, "Wrong size on AGCue_Status_Repair_Default_C");
static_assert(offsetof(AGCue_Status_Repair_Default_C, UberGraphFrame) == 0x000350, "Member 'AGCue_Status_Repair_Default_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AGCue_Status_Repair_Default_C, VehicleRepairSFX) == 0x000358, "Member 'AGCue_Status_Repair_Default_C::VehicleRepairSFX' has a wrong offset!");
static_assert(offsetof(AGCue_Status_Repair_Default_C, PS_Repair_01) == 0x000360, "Member 'AGCue_Status_Repair_Default_C::PS_Repair_01' has a wrong offset!");
static_assert(offsetof(AGCue_Status_Repair_Default_C, DefaultSceneRoot) == 0x000368, "Member 'AGCue_Status_Repair_Default_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AGCue_Status_Repair_Default_C, TedUnitCastCache) == 0x000370, "Member 'AGCue_Status_Repair_Default_C::TedUnitCastCache' has a wrong offset!");
static_assert(offsetof(AGCue_Status_Repair_Default_C, MeshMIDsCache) == 0x000378, "Member 'AGCue_Status_Repair_Default_C::MeshMIDsCache' has a wrong offset!");
static_assert(offsetof(AGCue_Status_Repair_Default_C, CheckHealthHandle) == 0x000388, "Member 'AGCue_Status_Repair_Default_C::CheckHealthHandle' has a wrong offset!");

}

