#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCue_Impact_VoltaicBolt_Default

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function GCue_Impact_VoltaicBolt_Default.GCue_Impact_VoltaicBolt_Default_C.K2_HandleGameplayCue
// 0x02B8 (0x02B8 - 0x0000)
struct GCue_Impact_VoltaicBolt_Default_C_K2_HandleGameplayCue final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EGameplayCueEvent                             EventType;                                         // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 Parameters;                                        // 0x0010(0x00D8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	struct FVector                                Effect_Start_Location;                             // 0x00E8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakGameplayCueParameters_NormalizedMagnitude; // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakGameplayCueParameters_RawMagnitude;  // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           CallFunc_BreakGameplayCueParameters_EffectContext; // 0x0108(0x0018)()
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_MatchedTagName; // 0x0120(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_OriginalTag;   // 0x0128(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedSourceTags; // 0x0130(0x0020)()
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedTargetTags; // 0x0150(0x0020)()
	struct FVector                                CallFunc_BreakGameplayCueParameters_Location;      // 0x0170(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakGameplayCueParameters_Normal;        // 0x0188(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_Instigator;    // 0x01A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_EffectCauser;  // 0x01A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_BreakGameplayCueParameters_SourceObject;  // 0x01B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakGameplayCueParameters_PhysicalMaterial; // 0x01B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_GameplayEffectLevel; // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_AbilityLevel;  // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_BreakGameplayCueParameters_TargetAttachComponent; // 0x01C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy; // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D1[0x7];                                      // 0x01D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x01D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_VETI_Vehicle_Messenger_C*           K2Node_DynamicCast_AsBP_VETI_Vehicle_Messenger;    // 0x01F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F9[0x7];                                      // 0x01F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0200(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFXSystemComponent*                     CallFunc_SpawnEffectAtLocation_ReturnValue;        // 0x0218(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x0220(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UParticleSystemComponent*               K2Node_DynamicCast_AsCascade_Particle_System_Component; // 0x0238(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_241[0x7];                                      // 0x0241(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFXSystemComponent*                     CallFunc_SpawnEffectAtLocation_ReturnValue_1;      // 0x0248(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ABP_DYN_Infantry_Machinist_C*           K2Node_DynamicCast_AsBP_DYN_Infantry_Machinist;    // 0x0250(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_259[0x7];                                      // 0x0259(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_DYN_Vehicle_VoltaicTank_C*          K2Node_DynamicCast_AsBP_DYN_Vehicle_Voltaic_Tank;  // 0x0260(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_269[0x7];                                      // 0x0269(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x0270(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue_1;          // 0x0288(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x02A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCue_Impact_VoltaicBolt_Default_C_K2_HandleGameplayCue) == 0x000008, "Wrong alignment on GCue_Impact_VoltaicBolt_Default_C_K2_HandleGameplayCue");
static_assert(sizeof(GCue_Impact_VoltaicBolt_Default_C_K2_HandleGameplayCue) == 0x0002B8, "Wrong size on GCue_Impact_VoltaicBolt_Default_C_K2_HandleGameplayCue");
static_assert(offsetof(GCue_Impact_VoltaicBolt_Default_C_K2_HandleGameplayCue, MyTarget) == 0x000000, "Member 'GCue_Impact_VoltaicBolt_Default_C_K2_HandleGameplayCue::MyTarget' has a wrong offset!");
static_assert(offsetof(GCue_Impact_VoltaicBolt_Default_C_K2_HandleGameplayCue, EventType) == 0x000008, "Member 'GCue_Impact_VoltaicBolt_Default_C_K2_HandleGameplayCue::EventType' has a wrong offset!");
static_assert(offsetof(GCue_Impact_VoltaicBolt_Default_C_K2_HandleGameplayCue, Parameters) == 0x000010, "Member 'GCue_Impact_VoltaicBolt_Default_C_K2_HandleGameplayCue::Parameters' has a wrong offset!");
static_assert(offsetof(GCue_Impact_VoltaicBolt_Default_C_K2_HandleGameplayCue, Effect_Start_Location) == 0x0000E8, "Member 'GCue_Impact_VoltaicBolt_Default_C_K2_HandleGameplayCue::Effect_Start_Location' has a wrong offset!");
static_assert(offsetof(GCue_Impact_VoltaicBolt_Default_C_K2_HandleGameplayCue, CallFunc_BreakGameplayCueParameters_NormalizedMagnitude) == 0x000100, "Member 'GCue_Impact_VoltaicBolt_Default_C_K2_HandleGameplayCue::CallFunc_BreakGameplayCueParameters_NormalizedMagnitude' has a wrong offset!");
static_assert(offsetof(GCue_Impact_VoltaicBolt_Default_C_K2_HandleGameplayCue, CallFunc_BreakGameplayCueParameters_RawMagnitude) == 0x000104, "Member 'GCue_Impact_VoltaicBolt_Default_C_K2_HandleGameplayCue::CallFunc_BreakGameplayCueParameters_RawMagnitude' has a wrong offset!");
static_assert(offsetof(GCue_Impact_VoltaicBolt_Default_C_K2_HandleGameplayCue, CallFunc_BreakGameplayCueParameters_EffectContext) == 0x000108, "Member 'GCue_Impact_VoltaicBolt_Default_C_K2_HandleGameplayCue::CallFunc_BreakGameplayCueParameters_EffectContext' has a wrong offset!");
static_assert(offsetof(GCue_Impact_VoltaicBolt_Default_C_K2_HandleGameplayCue, CallFunc_BreakGameplayCueParameters_MatchedTagName) == 0x000120, "Member 'GCue_Impact_VoltaicBolt_Default_C_K2_HandleGameplayCue::CallFunc_BreakGameplayCueParameters_MatchedTagName' has a wrong offset!");
static_assert(offsetof(GCue_Impact_VoltaicBolt_Default_C_K2_HandleGameplayCue, CallFunc_BreakGameplayCueParameters_OriginalTag) == 0x000128, "Member 'GCue_Impact_VoltaicBolt_Default_C_K2_HandleGameplayCue::CallFunc_BreakGameplayCueParameters_OriginalTag' has a wrong offset!");
static_assert(offsetof(GCue_Impact_VoltaicBolt_Default_C_K2_HandleGameplayCue, CallFunc_BreakGameplayCueParameters_AggregatedSourceTags) == 0x000130, "Member 'GCue_Impact_VoltaicBolt_Default_C_K2_HandleGameplayCue::CallFunc_BreakGameplayCueParameters_AggregatedSourceTags' has a wrong offset!");
static_assert(offsetof(GCue_Impact_VoltaicBolt_Default_C_K2_HandleGameplayCue, CallFunc_BreakGameplayCueParameters_AggregatedTargetTags) == 0x000150, "Member 'GCue_Impact_VoltaicBolt_Default_C_K2_HandleGameplayCue::CallFunc_BreakGameplayCueParameters_AggregatedTargetTags' has a wrong offset!");
static_assert(offsetof(GCue_Impact_VoltaicBolt_Default_C_K2_HandleGameplayCue, CallFunc_BreakGameplayCueParameters_Location) == 0x000170, "Member 'GCue_Impact_VoltaicBolt_Default_C_K2_HandleGameplayCue::CallFunc_BreakGameplayCueParameters_Location' has a wrong offset!");
static_assert(offsetof(GCue_Impact_VoltaicBolt_Default_C_K2_HandleGameplayCue, CallFunc_BreakGameplayCueParameters_Normal) == 0x000188, "Member 'GCue_Impact_VoltaicBolt_Default_C_K2_HandleGameplayCue::CallFunc_BreakGameplayCueParameters_Normal' has a wrong offset!");
static_assert(offsetof(GCue_Impact_VoltaicBolt_Default_C_K2_HandleGameplayCue, CallFunc_BreakGameplayCueParameters_Instigator) == 0x0001A0, "Member 'GCue_Impact_VoltaicBolt_Default_C_K2_HandleGameplayCue::CallFunc_BreakGameplayCueParameters_Instigator' has a wrong offset!");
static_assert(offsetof(GCue_Impact_VoltaicBolt_Default_C_K2_HandleGameplayCue, CallFunc_BreakGameplayCueParameters_EffectCauser) == 0x0001A8, "Member 'GCue_Impact_VoltaicBolt_Default_C_K2_HandleGameplayCue::CallFunc_BreakGameplayCueParameters_EffectCauser' has a wrong offset!");
static_assert(offsetof(GCue_Impact_VoltaicBolt_Default_C_K2_HandleGameplayCue, CallFunc_BreakGameplayCueParameters_SourceObject) == 0x0001B0, "Member 'GCue_Impact_VoltaicBolt_Default_C_K2_HandleGameplayCue::CallFunc_BreakGameplayCueParameters_SourceObject' has a wrong offset!");
static_assert(offsetof(GCue_Impact_VoltaicBolt_Default_C_K2_HandleGameplayCue, CallFunc_BreakGameplayCueParameters_PhysicalMaterial) == 0x0001B8, "Member 'GCue_Impact_VoltaicBolt_Default_C_K2_HandleGameplayCue::CallFunc_BreakGameplayCueParameters_PhysicalMaterial' has a wrong offset!");
static_assert(offsetof(GCue_Impact_VoltaicBolt_Default_C_K2_HandleGameplayCue, CallFunc_BreakGameplayCueParameters_GameplayEffectLevel) == 0x0001C0, "Member 'GCue_Impact_VoltaicBolt_Default_C_K2_HandleGameplayCue::CallFunc_BreakGameplayCueParameters_GameplayEffectLevel' has a wrong offset!");
static_assert(offsetof(GCue_Impact_VoltaicBolt_Default_C_K2_HandleGameplayCue, CallFunc_BreakGameplayCueParameters_AbilityLevel) == 0x0001C4, "Member 'GCue_Impact_VoltaicBolt_Default_C_K2_HandleGameplayCue::CallFunc_BreakGameplayCueParameters_AbilityLevel' has a wrong offset!");
static_assert(offsetof(GCue_Impact_VoltaicBolt_Default_C_K2_HandleGameplayCue, CallFunc_BreakGameplayCueParameters_TargetAttachComponent) == 0x0001C8, "Member 'GCue_Impact_VoltaicBolt_Default_C_K2_HandleGameplayCue::CallFunc_BreakGameplayCueParameters_TargetAttachComponent' has a wrong offset!");
static_assert(offsetof(GCue_Impact_VoltaicBolt_Default_C_K2_HandleGameplayCue, CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy) == 0x0001D0, "Member 'GCue_Impact_VoltaicBolt_Default_C_K2_HandleGameplayCue::CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy' has a wrong offset!");
static_assert(offsetof(GCue_Impact_VoltaicBolt_Default_C_K2_HandleGameplayCue, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0001D8, "Member 'GCue_Impact_VoltaicBolt_Default_C_K2_HandleGameplayCue::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCue_Impact_VoltaicBolt_Default_C_K2_HandleGameplayCue, K2Node_DynamicCast_AsBP_VETI_Vehicle_Messenger) == 0x0001F0, "Member 'GCue_Impact_VoltaicBolt_Default_C_K2_HandleGameplayCue::K2Node_DynamicCast_AsBP_VETI_Vehicle_Messenger' has a wrong offset!");
static_assert(offsetof(GCue_Impact_VoltaicBolt_Default_C_K2_HandleGameplayCue, K2Node_DynamicCast_bSuccess) == 0x0001F8, "Member 'GCue_Impact_VoltaicBolt_Default_C_K2_HandleGameplayCue::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GCue_Impact_VoltaicBolt_Default_C_K2_HandleGameplayCue, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000200, "Member 'GCue_Impact_VoltaicBolt_Default_C_K2_HandleGameplayCue::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCue_Impact_VoltaicBolt_Default_C_K2_HandleGameplayCue, CallFunc_SpawnEffectAtLocation_ReturnValue) == 0x000218, "Member 'GCue_Impact_VoltaicBolt_Default_C_K2_HandleGameplayCue::CallFunc_SpawnEffectAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCue_Impact_VoltaicBolt_Default_C_K2_HandleGameplayCue, CallFunc_Conv_VectorToRotator_ReturnValue) == 0x000220, "Member 'GCue_Impact_VoltaicBolt_Default_C_K2_HandleGameplayCue::CallFunc_Conv_VectorToRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCue_Impact_VoltaicBolt_Default_C_K2_HandleGameplayCue, K2Node_DynamicCast_AsCascade_Particle_System_Component) == 0x000238, "Member 'GCue_Impact_VoltaicBolt_Default_C_K2_HandleGameplayCue::K2Node_DynamicCast_AsCascade_Particle_System_Component' has a wrong offset!");
static_assert(offsetof(GCue_Impact_VoltaicBolt_Default_C_K2_HandleGameplayCue, K2Node_DynamicCast_bSuccess_1) == 0x000240, "Member 'GCue_Impact_VoltaicBolt_Default_C_K2_HandleGameplayCue::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GCue_Impact_VoltaicBolt_Default_C_K2_HandleGameplayCue, CallFunc_SpawnEffectAtLocation_ReturnValue_1) == 0x000248, "Member 'GCue_Impact_VoltaicBolt_Default_C_K2_HandleGameplayCue::CallFunc_SpawnEffectAtLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GCue_Impact_VoltaicBolt_Default_C_K2_HandleGameplayCue, K2Node_DynamicCast_AsBP_DYN_Infantry_Machinist) == 0x000250, "Member 'GCue_Impact_VoltaicBolt_Default_C_K2_HandleGameplayCue::K2Node_DynamicCast_AsBP_DYN_Infantry_Machinist' has a wrong offset!");
static_assert(offsetof(GCue_Impact_VoltaicBolt_Default_C_K2_HandleGameplayCue, K2Node_DynamicCast_bSuccess_2) == 0x000258, "Member 'GCue_Impact_VoltaicBolt_Default_C_K2_HandleGameplayCue::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(GCue_Impact_VoltaicBolt_Default_C_K2_HandleGameplayCue, K2Node_DynamicCast_AsBP_DYN_Vehicle_Voltaic_Tank) == 0x000260, "Member 'GCue_Impact_VoltaicBolt_Default_C_K2_HandleGameplayCue::K2Node_DynamicCast_AsBP_DYN_Vehicle_Voltaic_Tank' has a wrong offset!");
static_assert(offsetof(GCue_Impact_VoltaicBolt_Default_C_K2_HandleGameplayCue, K2Node_DynamicCast_bSuccess_3) == 0x000268, "Member 'GCue_Impact_VoltaicBolt_Default_C_K2_HandleGameplayCue::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(GCue_Impact_VoltaicBolt_Default_C_K2_HandleGameplayCue, CallFunc_GetSocketLocation_ReturnValue) == 0x000270, "Member 'GCue_Impact_VoltaicBolt_Default_C_K2_HandleGameplayCue::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCue_Impact_VoltaicBolt_Default_C_K2_HandleGameplayCue, CallFunc_GetSocketLocation_ReturnValue_1) == 0x000288, "Member 'GCue_Impact_VoltaicBolt_Default_C_K2_HandleGameplayCue::CallFunc_GetSocketLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GCue_Impact_VoltaicBolt_Default_C_K2_HandleGameplayCue, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x0002A0, "Member 'GCue_Impact_VoltaicBolt_Default_C_K2_HandleGameplayCue::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");

}

