#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCue_Impact_Arcing_Moment

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Tempest_classes.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GCue_Impact_Arcing_Moment.GCue_Impact_Arcing_Moment_C
// 0x0080 (0x03D0 - 0x0350)
class AGCue_Impact_Arcing_Moment_C final : public ATedGameplayCueNotify_StatusEffect
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CauserActor;                                       // 0x0360(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FVector                                TargetLocation;                                    // 0x0368(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CauserLocation;                                    // 0x0380(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<double>                                DistanceSocketToTarget;                            // 0x0398(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class FName>                           SocketsNames;                                      // 0x03A8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FVector>                        SocketsLocations;                                  // 0x03B8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UFXSystemAsset*                         Hit_Effect_Asset;                                  // 0x03C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GCue_Impact_Arcing_Moment(int32 EntryPoint);
	void K2_HandleGameplayCue(class AActor* MyTarget, EGameplayCueEvent EventType, const struct FGameplayCueParameters& Parameters);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GCue_Impact_Arcing_Moment_C">();
	}
	static class AGCue_Impact_Arcing_Moment_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGCue_Impact_Arcing_Moment_C>();
	}
};
static_assert(alignof(AGCue_Impact_Arcing_Moment_C) == 0x000008, "Wrong alignment on AGCue_Impact_Arcing_Moment_C");
static_assert(sizeof(AGCue_Impact_Arcing_Moment_C) == 0x0003D0, "Wrong size on AGCue_Impact_Arcing_Moment_C");
static_assert(offsetof(AGCue_Impact_Arcing_Moment_C, UberGraphFrame) == 0x000350, "Member 'AGCue_Impact_Arcing_Moment_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AGCue_Impact_Arcing_Moment_C, DefaultSceneRoot) == 0x000358, "Member 'AGCue_Impact_Arcing_Moment_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AGCue_Impact_Arcing_Moment_C, CauserActor) == 0x000360, "Member 'AGCue_Impact_Arcing_Moment_C::CauserActor' has a wrong offset!");
static_assert(offsetof(AGCue_Impact_Arcing_Moment_C, TargetLocation) == 0x000368, "Member 'AGCue_Impact_Arcing_Moment_C::TargetLocation' has a wrong offset!");
static_assert(offsetof(AGCue_Impact_Arcing_Moment_C, CauserLocation) == 0x000380, "Member 'AGCue_Impact_Arcing_Moment_C::CauserLocation' has a wrong offset!");
static_assert(offsetof(AGCue_Impact_Arcing_Moment_C, DistanceSocketToTarget) == 0x000398, "Member 'AGCue_Impact_Arcing_Moment_C::DistanceSocketToTarget' has a wrong offset!");
static_assert(offsetof(AGCue_Impact_Arcing_Moment_C, SocketsNames) == 0x0003A8, "Member 'AGCue_Impact_Arcing_Moment_C::SocketsNames' has a wrong offset!");
static_assert(offsetof(AGCue_Impact_Arcing_Moment_C, SocketsLocations) == 0x0003B8, "Member 'AGCue_Impact_Arcing_Moment_C::SocketsLocations' has a wrong offset!");
static_assert(offsetof(AGCue_Impact_Arcing_Moment_C, Hit_Effect_Asset) == 0x0003C8, "Member 'AGCue_Impact_Arcing_Moment_C::Hit_Effect_Asset' has a wrong offset!");

}

