#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCue_Impact_ExplosiveArtilleryTempestRadial_Infantry

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function GCue_Impact_ExplosiveArtilleryTempestRadial_Infantry.GCue_Impact_ExplosiveArtilleryTempestRadial_Infantry_C.K2_HandleGameplayCue
// 0x0140 (0x0140 - 0x0000)
struct GCue_Impact_ExplosiveArtilleryTempestRadial_Infantry_C_K2_HandleGameplayCue final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EGameplayCueEvent                             EventType;                                         // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 Parameters;                                        // 0x0010(0x00D8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class AActor*                                 My_Target_Cache;                                   // 0x00E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class ATedUnitBase*                           K2Node_DynamicCast_AsTed_Unit_Base;                // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetComponentBounds_Origin;                // 0x0100(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetComponentBounds_BoxExtent;             // 0x0118(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetComponentBounds_SphereRadius;          // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_134[0x4];                                      // 0x0134(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x0138(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCue_Impact_ExplosiveArtilleryTempestRadial_Infantry_C_K2_HandleGameplayCue) == 0x000008, "Wrong alignment on GCue_Impact_ExplosiveArtilleryTempestRadial_Infantry_C_K2_HandleGameplayCue");
static_assert(sizeof(GCue_Impact_ExplosiveArtilleryTempestRadial_Infantry_C_K2_HandleGameplayCue) == 0x000140, "Wrong size on GCue_Impact_ExplosiveArtilleryTempestRadial_Infantry_C_K2_HandleGameplayCue");
static_assert(offsetof(GCue_Impact_ExplosiveArtilleryTempestRadial_Infantry_C_K2_HandleGameplayCue, MyTarget) == 0x000000, "Member 'GCue_Impact_ExplosiveArtilleryTempestRadial_Infantry_C_K2_HandleGameplayCue::MyTarget' has a wrong offset!");
static_assert(offsetof(GCue_Impact_ExplosiveArtilleryTempestRadial_Infantry_C_K2_HandleGameplayCue, EventType) == 0x000008, "Member 'GCue_Impact_ExplosiveArtilleryTempestRadial_Infantry_C_K2_HandleGameplayCue::EventType' has a wrong offset!");
static_assert(offsetof(GCue_Impact_ExplosiveArtilleryTempestRadial_Infantry_C_K2_HandleGameplayCue, Parameters) == 0x000010, "Member 'GCue_Impact_ExplosiveArtilleryTempestRadial_Infantry_C_K2_HandleGameplayCue::Parameters' has a wrong offset!");
static_assert(offsetof(GCue_Impact_ExplosiveArtilleryTempestRadial_Infantry_C_K2_HandleGameplayCue, My_Target_Cache) == 0x0000E8, "Member 'GCue_Impact_ExplosiveArtilleryTempestRadial_Infantry_C_K2_HandleGameplayCue::My_Target_Cache' has a wrong offset!");
static_assert(offsetof(GCue_Impact_ExplosiveArtilleryTempestRadial_Infantry_C_K2_HandleGameplayCue, K2Node_DynamicCast_AsTed_Unit_Base) == 0x0000F0, "Member 'GCue_Impact_ExplosiveArtilleryTempestRadial_Infantry_C_K2_HandleGameplayCue::K2Node_DynamicCast_AsTed_Unit_Base' has a wrong offset!");
static_assert(offsetof(GCue_Impact_ExplosiveArtilleryTempestRadial_Infantry_C_K2_HandleGameplayCue, K2Node_DynamicCast_bSuccess) == 0x0000F8, "Member 'GCue_Impact_ExplosiveArtilleryTempestRadial_Infantry_C_K2_HandleGameplayCue::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GCue_Impact_ExplosiveArtilleryTempestRadial_Infantry_C_K2_HandleGameplayCue, CallFunc_GetComponentBounds_Origin) == 0x000100, "Member 'GCue_Impact_ExplosiveArtilleryTempestRadial_Infantry_C_K2_HandleGameplayCue::CallFunc_GetComponentBounds_Origin' has a wrong offset!");
static_assert(offsetof(GCue_Impact_ExplosiveArtilleryTempestRadial_Infantry_C_K2_HandleGameplayCue, CallFunc_GetComponentBounds_BoxExtent) == 0x000118, "Member 'GCue_Impact_ExplosiveArtilleryTempestRadial_Infantry_C_K2_HandleGameplayCue::CallFunc_GetComponentBounds_BoxExtent' has a wrong offset!");
static_assert(offsetof(GCue_Impact_ExplosiveArtilleryTempestRadial_Infantry_C_K2_HandleGameplayCue, CallFunc_GetComponentBounds_SphereRadius) == 0x000130, "Member 'GCue_Impact_ExplosiveArtilleryTempestRadial_Infantry_C_K2_HandleGameplayCue::CallFunc_GetComponentBounds_SphereRadius' has a wrong offset!");
static_assert(offsetof(GCue_Impact_ExplosiveArtilleryTempestRadial_Infantry_C_K2_HandleGameplayCue, CallFunc_SpawnSystemAtLocation_ReturnValue) == 0x000138, "Member 'GCue_Impact_ExplosiveArtilleryTempestRadial_Infantry_C_K2_HandleGameplayCue::CallFunc_SpawnSystemAtLocation_ReturnValue' has a wrong offset!");

}

