#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCue_Status_SlowWeaponMissile_Vehicles

#include "Basic.hpp"

#include "Tempest_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GCue_Status_SlowWeaponMissile_Vehicles.GCue_Status_SlowWeaponMissile_Vehicles_C
// 0x0020 (0x0370 - 0x0350)
class AGCue_Status_SlowWeaponMissile_Vehicles_C final : public ATedGameplayCueNotify_StatusEffect
{
public:
	class UParticleSystemComponent*               PS_StatusSlow_01_WeaponMissile_Scrambler;          // 0x0350(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               PS_StatusSlow_01_WeaponMissile_Porcupine;          // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               PS_StatusSlow_01_WeaponMissile_RocketBuggy;        // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0368(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	bool OnRemove(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters);
	bool WhileActive(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GCue_Status_SlowWeaponMissile_Vehicles_C">();
	}
	static class AGCue_Status_SlowWeaponMissile_Vehicles_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGCue_Status_SlowWeaponMissile_Vehicles_C>();
	}
};
static_assert(alignof(AGCue_Status_SlowWeaponMissile_Vehicles_C) == 0x000008, "Wrong alignment on AGCue_Status_SlowWeaponMissile_Vehicles_C");
static_assert(sizeof(AGCue_Status_SlowWeaponMissile_Vehicles_C) == 0x000370, "Wrong size on AGCue_Status_SlowWeaponMissile_Vehicles_C");
static_assert(offsetof(AGCue_Status_SlowWeaponMissile_Vehicles_C, PS_StatusSlow_01_WeaponMissile_Scrambler) == 0x000350, "Member 'AGCue_Status_SlowWeaponMissile_Vehicles_C::PS_StatusSlow_01_WeaponMissile_Scrambler' has a wrong offset!");
static_assert(offsetof(AGCue_Status_SlowWeaponMissile_Vehicles_C, PS_StatusSlow_01_WeaponMissile_Porcupine) == 0x000358, "Member 'AGCue_Status_SlowWeaponMissile_Vehicles_C::PS_StatusSlow_01_WeaponMissile_Porcupine' has a wrong offset!");
static_assert(offsetof(AGCue_Status_SlowWeaponMissile_Vehicles_C, PS_StatusSlow_01_WeaponMissile_RocketBuggy) == 0x000360, "Member 'AGCue_Status_SlowWeaponMissile_Vehicles_C::PS_StatusSlow_01_WeaponMissile_RocketBuggy' has a wrong offset!");
static_assert(offsetof(AGCue_Status_SlowWeaponMissile_Vehicles_C, DefaultSceneRoot) == 0x000368, "Member 'AGCue_Status_SlowWeaponMissile_Vehicles_C::DefaultSceneRoot' has a wrong offset!");

}

