#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCue_Status_GolemAura

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function GCue_Status_GolemAura.GCue_Status_GolemAura_C.ExecuteUbergraph_GCue_Status_GolemAura
// 0x0300 (0x0300 - 0x0000)
struct GCue_Status_GolemAura_C_ExecuteUbergraph_GCue_Status_GolemAura final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_MyTarget;                             // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EGameplayCueEvent                             K2Node_Event_EventType;                            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 K2Node_Event_Parameters;                           // 0x0020(0x00D8)(ConstParm, ContainsInstancedReference)
	float                                         CallFunc_BreakGameplayCueParameters_NormalizedMagnitude; // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakGameplayCueParameters_RawMagnitude;  // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           CallFunc_BreakGameplayCueParameters_EffectContext; // 0x0100(0x0018)()
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_MatchedTagName; // 0x0118(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_OriginalTag;   // 0x0120(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedSourceTags; // 0x0128(0x0020)()
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedTargetTags; // 0x0148(0x0020)()
	struct FVector                                CallFunc_BreakGameplayCueParameters_Location;      // 0x0168(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakGameplayCueParameters_Normal;        // 0x0180(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_Instigator;    // 0x0198(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_EffectCauser;  // 0x01A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_BreakGameplayCueParameters_SourceObject;  // 0x01A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakGameplayCueParameters_PhysicalMaterial; // 0x01B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_GameplayEffectLevel; // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_AbilityLevel;  // 0x01BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_BreakGameplayCueParameters_TargetAttachComponent; // 0x01C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy; // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C9[0x7];                                      // 0x01C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_EffectContextGetEffectCauser_ReturnValue; // 0x01D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D9[0x7];                                      // 0x01D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATedAircraft*                           K2Node_DynamicCast_AsTed_Aircraft;                 // 0x01E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E9[0x7];                                      // 0x01E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_FindClosestBone_K2_BoneLocation;          // 0x01F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_FindClosestBone_K2_ReturnValue;           // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_VETI_Infantry_Golem_C*              K2Node_DynamicCast_AsBP_VETI_Infantry_Golem;       // 0x0210(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_219[0x7];                                      // 0x0219(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0220(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0240(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_244[0x4];                                      // 0x0244(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x0248(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_261[0x3];                                      // 0x0261(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_MinOfFloatArray_IndexOfMinValue;          // 0x0264(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MinOfFloatArray_MinValue;                 // 0x0268(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x026C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Vector_Distance_ReturnValue;              // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0278(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_27C[0x4];                                      // 0x027C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0280(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_1;      // 0x0298(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x02B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue_1;       // 0x02C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x02E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UFXSystemComponent*                     CallFunc_SpawnEffectAtLocation_ReturnValue;        // 0x02E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 CallFunc_MinOfFloatArray_FloatArray_ImplicitCast;  // 0x02F0(0x0010)(ConstParm, ReferenceParm)
};
static_assert(alignof(GCue_Status_GolemAura_C_ExecuteUbergraph_GCue_Status_GolemAura) == 0x000008, "Wrong alignment on GCue_Status_GolemAura_C_ExecuteUbergraph_GCue_Status_GolemAura");
static_assert(sizeof(GCue_Status_GolemAura_C_ExecuteUbergraph_GCue_Status_GolemAura) == 0x000300, "Wrong size on GCue_Status_GolemAura_C_ExecuteUbergraph_GCue_Status_GolemAura");
static_assert(offsetof(GCue_Status_GolemAura_C_ExecuteUbergraph_GCue_Status_GolemAura, EntryPoint) == 0x000000, "Member 'GCue_Status_GolemAura_C_ExecuteUbergraph_GCue_Status_GolemAura::EntryPoint' has a wrong offset!");
static_assert(offsetof(GCue_Status_GolemAura_C_ExecuteUbergraph_GCue_Status_GolemAura, Temp_int_Array_Index_Variable) == 0x000004, "Member 'GCue_Status_GolemAura_C_ExecuteUbergraph_GCue_Status_GolemAura::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(GCue_Status_GolemAura_C_ExecuteUbergraph_GCue_Status_GolemAura, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'GCue_Status_GolemAura_C_ExecuteUbergraph_GCue_Status_GolemAura::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(GCue_Status_GolemAura_C_ExecuteUbergraph_GCue_Status_GolemAura, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'GCue_Status_GolemAura_C_ExecuteUbergraph_GCue_Status_GolemAura::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCue_Status_GolemAura_C_ExecuteUbergraph_GCue_Status_GolemAura, K2Node_Event_MyTarget) == 0x000010, "Member 'GCue_Status_GolemAura_C_ExecuteUbergraph_GCue_Status_GolemAura::K2Node_Event_MyTarget' has a wrong offset!");
static_assert(offsetof(GCue_Status_GolemAura_C_ExecuteUbergraph_GCue_Status_GolemAura, K2Node_Event_EventType) == 0x000018, "Member 'GCue_Status_GolemAura_C_ExecuteUbergraph_GCue_Status_GolemAura::K2Node_Event_EventType' has a wrong offset!");
static_assert(offsetof(GCue_Status_GolemAura_C_ExecuteUbergraph_GCue_Status_GolemAura, K2Node_Event_Parameters) == 0x000020, "Member 'GCue_Status_GolemAura_C_ExecuteUbergraph_GCue_Status_GolemAura::K2Node_Event_Parameters' has a wrong offset!");
static_assert(offsetof(GCue_Status_GolemAura_C_ExecuteUbergraph_GCue_Status_GolemAura, CallFunc_BreakGameplayCueParameters_NormalizedMagnitude) == 0x0000F8, "Member 'GCue_Status_GolemAura_C_ExecuteUbergraph_GCue_Status_GolemAura::CallFunc_BreakGameplayCueParameters_NormalizedMagnitude' has a wrong offset!");
static_assert(offsetof(GCue_Status_GolemAura_C_ExecuteUbergraph_GCue_Status_GolemAura, CallFunc_BreakGameplayCueParameters_RawMagnitude) == 0x0000FC, "Member 'GCue_Status_GolemAura_C_ExecuteUbergraph_GCue_Status_GolemAura::CallFunc_BreakGameplayCueParameters_RawMagnitude' has a wrong offset!");
static_assert(offsetof(GCue_Status_GolemAura_C_ExecuteUbergraph_GCue_Status_GolemAura, CallFunc_BreakGameplayCueParameters_EffectContext) == 0x000100, "Member 'GCue_Status_GolemAura_C_ExecuteUbergraph_GCue_Status_GolemAura::CallFunc_BreakGameplayCueParameters_EffectContext' has a wrong offset!");
static_assert(offsetof(GCue_Status_GolemAura_C_ExecuteUbergraph_GCue_Status_GolemAura, CallFunc_BreakGameplayCueParameters_MatchedTagName) == 0x000118, "Member 'GCue_Status_GolemAura_C_ExecuteUbergraph_GCue_Status_GolemAura::CallFunc_BreakGameplayCueParameters_MatchedTagName' has a wrong offset!");
static_assert(offsetof(GCue_Status_GolemAura_C_ExecuteUbergraph_GCue_Status_GolemAura, CallFunc_BreakGameplayCueParameters_OriginalTag) == 0x000120, "Member 'GCue_Status_GolemAura_C_ExecuteUbergraph_GCue_Status_GolemAura::CallFunc_BreakGameplayCueParameters_OriginalTag' has a wrong offset!");
static_assert(offsetof(GCue_Status_GolemAura_C_ExecuteUbergraph_GCue_Status_GolemAura, CallFunc_BreakGameplayCueParameters_AggregatedSourceTags) == 0x000128, "Member 'GCue_Status_GolemAura_C_ExecuteUbergraph_GCue_Status_GolemAura::CallFunc_BreakGameplayCueParameters_AggregatedSourceTags' has a wrong offset!");
static_assert(offsetof(GCue_Status_GolemAura_C_ExecuteUbergraph_GCue_Status_GolemAura, CallFunc_BreakGameplayCueParameters_AggregatedTargetTags) == 0x000148, "Member 'GCue_Status_GolemAura_C_ExecuteUbergraph_GCue_Status_GolemAura::CallFunc_BreakGameplayCueParameters_AggregatedTargetTags' has a wrong offset!");
static_assert(offsetof(GCue_Status_GolemAura_C_ExecuteUbergraph_GCue_Status_GolemAura, CallFunc_BreakGameplayCueParameters_Location) == 0x000168, "Member 'GCue_Status_GolemAura_C_ExecuteUbergraph_GCue_Status_GolemAura::CallFunc_BreakGameplayCueParameters_Location' has a wrong offset!");
static_assert(offsetof(GCue_Status_GolemAura_C_ExecuteUbergraph_GCue_Status_GolemAura, CallFunc_BreakGameplayCueParameters_Normal) == 0x000180, "Member 'GCue_Status_GolemAura_C_ExecuteUbergraph_GCue_Status_GolemAura::CallFunc_BreakGameplayCueParameters_Normal' has a wrong offset!");
static_assert(offsetof(GCue_Status_GolemAura_C_ExecuteUbergraph_GCue_Status_GolemAura, CallFunc_BreakGameplayCueParameters_Instigator) == 0x000198, "Member 'GCue_Status_GolemAura_C_ExecuteUbergraph_GCue_Status_GolemAura::CallFunc_BreakGameplayCueParameters_Instigator' has a wrong offset!");
static_assert(offsetof(GCue_Status_GolemAura_C_ExecuteUbergraph_GCue_Status_GolemAura, CallFunc_BreakGameplayCueParameters_EffectCauser) == 0x0001A0, "Member 'GCue_Status_GolemAura_C_ExecuteUbergraph_GCue_Status_GolemAura::CallFunc_BreakGameplayCueParameters_EffectCauser' has a wrong offset!");
static_assert(offsetof(GCue_Status_GolemAura_C_ExecuteUbergraph_GCue_Status_GolemAura, CallFunc_BreakGameplayCueParameters_SourceObject) == 0x0001A8, "Member 'GCue_Status_GolemAura_C_ExecuteUbergraph_GCue_Status_GolemAura::CallFunc_BreakGameplayCueParameters_SourceObject' has a wrong offset!");
static_assert(offsetof(GCue_Status_GolemAura_C_ExecuteUbergraph_GCue_Status_GolemAura, CallFunc_BreakGameplayCueParameters_PhysicalMaterial) == 0x0001B0, "Member 'GCue_Status_GolemAura_C_ExecuteUbergraph_GCue_Status_GolemAura::CallFunc_BreakGameplayCueParameters_PhysicalMaterial' has a wrong offset!");
static_assert(offsetof(GCue_Status_GolemAura_C_ExecuteUbergraph_GCue_Status_GolemAura, CallFunc_BreakGameplayCueParameters_GameplayEffectLevel) == 0x0001B8, "Member 'GCue_Status_GolemAura_C_ExecuteUbergraph_GCue_Status_GolemAura::CallFunc_BreakGameplayCueParameters_GameplayEffectLevel' has a wrong offset!");
static_assert(offsetof(GCue_Status_GolemAura_C_ExecuteUbergraph_GCue_Status_GolemAura, CallFunc_BreakGameplayCueParameters_AbilityLevel) == 0x0001BC, "Member 'GCue_Status_GolemAura_C_ExecuteUbergraph_GCue_Status_GolemAura::CallFunc_BreakGameplayCueParameters_AbilityLevel' has a wrong offset!");
static_assert(offsetof(GCue_Status_GolemAura_C_ExecuteUbergraph_GCue_Status_GolemAura, CallFunc_BreakGameplayCueParameters_TargetAttachComponent) == 0x0001C0, "Member 'GCue_Status_GolemAura_C_ExecuteUbergraph_GCue_Status_GolemAura::CallFunc_BreakGameplayCueParameters_TargetAttachComponent' has a wrong offset!");
static_assert(offsetof(GCue_Status_GolemAura_C_ExecuteUbergraph_GCue_Status_GolemAura, CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy) == 0x0001C8, "Member 'GCue_Status_GolemAura_C_ExecuteUbergraph_GCue_Status_GolemAura::CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy' has a wrong offset!");
static_assert(offsetof(GCue_Status_GolemAura_C_ExecuteUbergraph_GCue_Status_GolemAura, CallFunc_EffectContextGetEffectCauser_ReturnValue) == 0x0001D0, "Member 'GCue_Status_GolemAura_C_ExecuteUbergraph_GCue_Status_GolemAura::CallFunc_EffectContextGetEffectCauser_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCue_Status_GolemAura_C_ExecuteUbergraph_GCue_Status_GolemAura, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x0001D8, "Member 'GCue_Status_GolemAura_C_ExecuteUbergraph_GCue_Status_GolemAura::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCue_Status_GolemAura_C_ExecuteUbergraph_GCue_Status_GolemAura, K2Node_DynamicCast_AsTed_Aircraft) == 0x0001E0, "Member 'GCue_Status_GolemAura_C_ExecuteUbergraph_GCue_Status_GolemAura::K2Node_DynamicCast_AsTed_Aircraft' has a wrong offset!");
static_assert(offsetof(GCue_Status_GolemAura_C_ExecuteUbergraph_GCue_Status_GolemAura, K2Node_DynamicCast_bSuccess) == 0x0001E8, "Member 'GCue_Status_GolemAura_C_ExecuteUbergraph_GCue_Status_GolemAura::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GCue_Status_GolemAura_C_ExecuteUbergraph_GCue_Status_GolemAura, CallFunc_FindClosestBone_K2_BoneLocation) == 0x0001F0, "Member 'GCue_Status_GolemAura_C_ExecuteUbergraph_GCue_Status_GolemAura::CallFunc_FindClosestBone_K2_BoneLocation' has a wrong offset!");
static_assert(offsetof(GCue_Status_GolemAura_C_ExecuteUbergraph_GCue_Status_GolemAura, CallFunc_FindClosestBone_K2_ReturnValue) == 0x000208, "Member 'GCue_Status_GolemAura_C_ExecuteUbergraph_GCue_Status_GolemAura::CallFunc_FindClosestBone_K2_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCue_Status_GolemAura_C_ExecuteUbergraph_GCue_Status_GolemAura, K2Node_DynamicCast_AsBP_VETI_Infantry_Golem) == 0x000210, "Member 'GCue_Status_GolemAura_C_ExecuteUbergraph_GCue_Status_GolemAura::K2Node_DynamicCast_AsBP_VETI_Infantry_Golem' has a wrong offset!");
static_assert(offsetof(GCue_Status_GolemAura_C_ExecuteUbergraph_GCue_Status_GolemAura, K2Node_DynamicCast_bSuccess_1) == 0x000218, "Member 'GCue_Status_GolemAura_C_ExecuteUbergraph_GCue_Status_GolemAura::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GCue_Status_GolemAura_C_ExecuteUbergraph_GCue_Status_GolemAura, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000220, "Member 'GCue_Status_GolemAura_C_ExecuteUbergraph_GCue_Status_GolemAura::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCue_Status_GolemAura_C_ExecuteUbergraph_GCue_Status_GolemAura, CallFunc_Array_Get_Item) == 0x000238, "Member 'GCue_Status_GolemAura_C_ExecuteUbergraph_GCue_Status_GolemAura::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GCue_Status_GolemAura_C_ExecuteUbergraph_GCue_Status_GolemAura, CallFunc_Array_Length_ReturnValue) == 0x000240, "Member 'GCue_Status_GolemAura_C_ExecuteUbergraph_GCue_Status_GolemAura::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCue_Status_GolemAura_C_ExecuteUbergraph_GCue_Status_GolemAura, CallFunc_GetSocketLocation_ReturnValue) == 0x000248, "Member 'GCue_Status_GolemAura_C_ExecuteUbergraph_GCue_Status_GolemAura::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCue_Status_GolemAura_C_ExecuteUbergraph_GCue_Status_GolemAura, CallFunc_Less_IntInt_ReturnValue) == 0x000260, "Member 'GCue_Status_GolemAura_C_ExecuteUbergraph_GCue_Status_GolemAura::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCue_Status_GolemAura_C_ExecuteUbergraph_GCue_Status_GolemAura, CallFunc_MinOfFloatArray_IndexOfMinValue) == 0x000264, "Member 'GCue_Status_GolemAura_C_ExecuteUbergraph_GCue_Status_GolemAura::CallFunc_MinOfFloatArray_IndexOfMinValue' has a wrong offset!");
static_assert(offsetof(GCue_Status_GolemAura_C_ExecuteUbergraph_GCue_Status_GolemAura, CallFunc_MinOfFloatArray_MinValue) == 0x000268, "Member 'GCue_Status_GolemAura_C_ExecuteUbergraph_GCue_Status_GolemAura::CallFunc_MinOfFloatArray_MinValue' has a wrong offset!");
static_assert(offsetof(GCue_Status_GolemAura_C_ExecuteUbergraph_GCue_Status_GolemAura, CallFunc_Array_Add_ReturnValue) == 0x00026C, "Member 'GCue_Status_GolemAura_C_ExecuteUbergraph_GCue_Status_GolemAura::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCue_Status_GolemAura_C_ExecuteUbergraph_GCue_Status_GolemAura, CallFunc_Vector_Distance_ReturnValue) == 0x000270, "Member 'GCue_Status_GolemAura_C_ExecuteUbergraph_GCue_Status_GolemAura::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCue_Status_GolemAura_C_ExecuteUbergraph_GCue_Status_GolemAura, CallFunc_Array_Add_ReturnValue_1) == 0x000278, "Member 'GCue_Status_GolemAura_C_ExecuteUbergraph_GCue_Status_GolemAura::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GCue_Status_GolemAura_C_ExecuteUbergraph_GCue_Status_GolemAura, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000280, "Member 'GCue_Status_GolemAura_C_ExecuteUbergraph_GCue_Status_GolemAura::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCue_Status_GolemAura_C_ExecuteUbergraph_GCue_Status_GolemAura, CallFunc_Subtract_VectorVector_ReturnValue_1) == 0x000298, "Member 'GCue_Status_GolemAura_C_ExecuteUbergraph_GCue_Status_GolemAura::CallFunc_Subtract_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GCue_Status_GolemAura_C_ExecuteUbergraph_GCue_Status_GolemAura, CallFunc_Conv_VectorToRotator_ReturnValue) == 0x0002B0, "Member 'GCue_Status_GolemAura_C_ExecuteUbergraph_GCue_Status_GolemAura::CallFunc_Conv_VectorToRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCue_Status_GolemAura_C_ExecuteUbergraph_GCue_Status_GolemAura, CallFunc_Conv_VectorToRotator_ReturnValue_1) == 0x0002C8, "Member 'GCue_Status_GolemAura_C_ExecuteUbergraph_GCue_Status_GolemAura::CallFunc_Conv_VectorToRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GCue_Status_GolemAura_C_ExecuteUbergraph_GCue_Status_GolemAura, CallFunc_SpawnSystemAtLocation_ReturnValue) == 0x0002E0, "Member 'GCue_Status_GolemAura_C_ExecuteUbergraph_GCue_Status_GolemAura::CallFunc_SpawnSystemAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCue_Status_GolemAura_C_ExecuteUbergraph_GCue_Status_GolemAura, CallFunc_SpawnEffectAtLocation_ReturnValue) == 0x0002E8, "Member 'GCue_Status_GolemAura_C_ExecuteUbergraph_GCue_Status_GolemAura::CallFunc_SpawnEffectAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCue_Status_GolemAura_C_ExecuteUbergraph_GCue_Status_GolemAura, CallFunc_MinOfFloatArray_FloatArray_ImplicitCast) == 0x0002F0, "Member 'GCue_Status_GolemAura_C_ExecuteUbergraph_GCue_Status_GolemAura::CallFunc_MinOfFloatArray_FloatArray_ImplicitCast' has a wrong offset!");

// Function GCue_Status_GolemAura.GCue_Status_GolemAura_C.K2_HandleGameplayCue
// 0x00E8 (0x00E8 - 0x0000)
struct GCue_Status_GolemAura_C_K2_HandleGameplayCue final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EGameplayCueEvent                             EventType;                                         // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 Parameters;                                        // 0x0010(0x00D8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GCue_Status_GolemAura_C_K2_HandleGameplayCue) == 0x000008, "Wrong alignment on GCue_Status_GolemAura_C_K2_HandleGameplayCue");
static_assert(sizeof(GCue_Status_GolemAura_C_K2_HandleGameplayCue) == 0x0000E8, "Wrong size on GCue_Status_GolemAura_C_K2_HandleGameplayCue");
static_assert(offsetof(GCue_Status_GolemAura_C_K2_HandleGameplayCue, MyTarget) == 0x000000, "Member 'GCue_Status_GolemAura_C_K2_HandleGameplayCue::MyTarget' has a wrong offset!");
static_assert(offsetof(GCue_Status_GolemAura_C_K2_HandleGameplayCue, EventType) == 0x000008, "Member 'GCue_Status_GolemAura_C_K2_HandleGameplayCue::EventType' has a wrong offset!");
static_assert(offsetof(GCue_Status_GolemAura_C_K2_HandleGameplayCue, Parameters) == 0x000010, "Member 'GCue_Status_GolemAura_C_K2_HandleGameplayCue::Parameters' has a wrong offset!");

}

