#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCue_Explosion_AerialHeavyVETI

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function GCue_Explosion_AerialHeavyVETI.GCue_Explosion_AerialHeavyVETI_C.OnExecute
// 0x0208 (0x0208 - 0x0000)
struct GCue_Explosion_AerialHeavyVETI_C_OnExecute final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00D8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00E0(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_RandomFloatInRange_ReturnValue;           // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakGameplayCueParameters_NormalizedMagnitude; // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakGameplayCueParameters_RawMagnitude;  // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           CallFunc_BreakGameplayCueParameters_EffectContext; // 0x00F8(0x0018)()
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_MatchedTagName; // 0x0110(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_OriginalTag;   // 0x0118(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedSourceTags; // 0x0120(0x0020)()
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedTargetTags; // 0x0140(0x0020)()
	struct FVector                                CallFunc_BreakGameplayCueParameters_Location;      // 0x0160(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakGameplayCueParameters_Normal;        // 0x0178(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_Instigator;    // 0x0190(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_EffectCauser;  // 0x0198(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_BreakGameplayCueParameters_SourceObject;  // 0x01A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakGameplayCueParameters_PhysicalMaterial; // 0x01A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_GameplayEffectLevel; // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_AbilityLevel;  // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_BreakGameplayCueParameters_TargetAttachComponent; // 0x01B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy; // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C1[0x7];                                      // 0x01C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_2;         // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x01D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UFXSystemComponent*                     CallFunc_SpawnEffectAtLocation_ReturnValue;        // 0x01F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Yaw_ImplicitCast;             // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Pitch_ImplicitCast;           // 0x01FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Roll_ImplicitCast;            // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCue_Explosion_AerialHeavyVETI_C_OnExecute) == 0x000008, "Wrong alignment on GCue_Explosion_AerialHeavyVETI_C_OnExecute");
static_assert(sizeof(GCue_Explosion_AerialHeavyVETI_C_OnExecute) == 0x000208, "Wrong size on GCue_Explosion_AerialHeavyVETI_C_OnExecute");
static_assert(offsetof(GCue_Explosion_AerialHeavyVETI_C_OnExecute, MyTarget) == 0x000000, "Member 'GCue_Explosion_AerialHeavyVETI_C_OnExecute::MyTarget' has a wrong offset!");
static_assert(offsetof(GCue_Explosion_AerialHeavyVETI_C_OnExecute, Parameters) == 0x000008, "Member 'GCue_Explosion_AerialHeavyVETI_C_OnExecute::Parameters' has a wrong offset!");
static_assert(offsetof(GCue_Explosion_AerialHeavyVETI_C_OnExecute, ReturnValue) == 0x0000E0, "Member 'GCue_Explosion_AerialHeavyVETI_C_OnExecute::ReturnValue' has a wrong offset!");
static_assert(offsetof(GCue_Explosion_AerialHeavyVETI_C_OnExecute, CallFunc_RandomFloatInRange_ReturnValue) == 0x0000E8, "Member 'GCue_Explosion_AerialHeavyVETI_C_OnExecute::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCue_Explosion_AerialHeavyVETI_C_OnExecute, CallFunc_BreakGameplayCueParameters_NormalizedMagnitude) == 0x0000F0, "Member 'GCue_Explosion_AerialHeavyVETI_C_OnExecute::CallFunc_BreakGameplayCueParameters_NormalizedMagnitude' has a wrong offset!");
static_assert(offsetof(GCue_Explosion_AerialHeavyVETI_C_OnExecute, CallFunc_BreakGameplayCueParameters_RawMagnitude) == 0x0000F4, "Member 'GCue_Explosion_AerialHeavyVETI_C_OnExecute::CallFunc_BreakGameplayCueParameters_RawMagnitude' has a wrong offset!");
static_assert(offsetof(GCue_Explosion_AerialHeavyVETI_C_OnExecute, CallFunc_BreakGameplayCueParameters_EffectContext) == 0x0000F8, "Member 'GCue_Explosion_AerialHeavyVETI_C_OnExecute::CallFunc_BreakGameplayCueParameters_EffectContext' has a wrong offset!");
static_assert(offsetof(GCue_Explosion_AerialHeavyVETI_C_OnExecute, CallFunc_BreakGameplayCueParameters_MatchedTagName) == 0x000110, "Member 'GCue_Explosion_AerialHeavyVETI_C_OnExecute::CallFunc_BreakGameplayCueParameters_MatchedTagName' has a wrong offset!");
static_assert(offsetof(GCue_Explosion_AerialHeavyVETI_C_OnExecute, CallFunc_BreakGameplayCueParameters_OriginalTag) == 0x000118, "Member 'GCue_Explosion_AerialHeavyVETI_C_OnExecute::CallFunc_BreakGameplayCueParameters_OriginalTag' has a wrong offset!");
static_assert(offsetof(GCue_Explosion_AerialHeavyVETI_C_OnExecute, CallFunc_BreakGameplayCueParameters_AggregatedSourceTags) == 0x000120, "Member 'GCue_Explosion_AerialHeavyVETI_C_OnExecute::CallFunc_BreakGameplayCueParameters_AggregatedSourceTags' has a wrong offset!");
static_assert(offsetof(GCue_Explosion_AerialHeavyVETI_C_OnExecute, CallFunc_BreakGameplayCueParameters_AggregatedTargetTags) == 0x000140, "Member 'GCue_Explosion_AerialHeavyVETI_C_OnExecute::CallFunc_BreakGameplayCueParameters_AggregatedTargetTags' has a wrong offset!");
static_assert(offsetof(GCue_Explosion_AerialHeavyVETI_C_OnExecute, CallFunc_BreakGameplayCueParameters_Location) == 0x000160, "Member 'GCue_Explosion_AerialHeavyVETI_C_OnExecute::CallFunc_BreakGameplayCueParameters_Location' has a wrong offset!");
static_assert(offsetof(GCue_Explosion_AerialHeavyVETI_C_OnExecute, CallFunc_BreakGameplayCueParameters_Normal) == 0x000178, "Member 'GCue_Explosion_AerialHeavyVETI_C_OnExecute::CallFunc_BreakGameplayCueParameters_Normal' has a wrong offset!");
static_assert(offsetof(GCue_Explosion_AerialHeavyVETI_C_OnExecute, CallFunc_BreakGameplayCueParameters_Instigator) == 0x000190, "Member 'GCue_Explosion_AerialHeavyVETI_C_OnExecute::CallFunc_BreakGameplayCueParameters_Instigator' has a wrong offset!");
static_assert(offsetof(GCue_Explosion_AerialHeavyVETI_C_OnExecute, CallFunc_BreakGameplayCueParameters_EffectCauser) == 0x000198, "Member 'GCue_Explosion_AerialHeavyVETI_C_OnExecute::CallFunc_BreakGameplayCueParameters_EffectCauser' has a wrong offset!");
static_assert(offsetof(GCue_Explosion_AerialHeavyVETI_C_OnExecute, CallFunc_BreakGameplayCueParameters_SourceObject) == 0x0001A0, "Member 'GCue_Explosion_AerialHeavyVETI_C_OnExecute::CallFunc_BreakGameplayCueParameters_SourceObject' has a wrong offset!");
static_assert(offsetof(GCue_Explosion_AerialHeavyVETI_C_OnExecute, CallFunc_BreakGameplayCueParameters_PhysicalMaterial) == 0x0001A8, "Member 'GCue_Explosion_AerialHeavyVETI_C_OnExecute::CallFunc_BreakGameplayCueParameters_PhysicalMaterial' has a wrong offset!");
static_assert(offsetof(GCue_Explosion_AerialHeavyVETI_C_OnExecute, CallFunc_BreakGameplayCueParameters_GameplayEffectLevel) == 0x0001B0, "Member 'GCue_Explosion_AerialHeavyVETI_C_OnExecute::CallFunc_BreakGameplayCueParameters_GameplayEffectLevel' has a wrong offset!");
static_assert(offsetof(GCue_Explosion_AerialHeavyVETI_C_OnExecute, CallFunc_BreakGameplayCueParameters_AbilityLevel) == 0x0001B4, "Member 'GCue_Explosion_AerialHeavyVETI_C_OnExecute::CallFunc_BreakGameplayCueParameters_AbilityLevel' has a wrong offset!");
static_assert(offsetof(GCue_Explosion_AerialHeavyVETI_C_OnExecute, CallFunc_BreakGameplayCueParameters_TargetAttachComponent) == 0x0001B8, "Member 'GCue_Explosion_AerialHeavyVETI_C_OnExecute::CallFunc_BreakGameplayCueParameters_TargetAttachComponent' has a wrong offset!");
static_assert(offsetof(GCue_Explosion_AerialHeavyVETI_C_OnExecute, CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy) == 0x0001C0, "Member 'GCue_Explosion_AerialHeavyVETI_C_OnExecute::CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy' has a wrong offset!");
static_assert(offsetof(GCue_Explosion_AerialHeavyVETI_C_OnExecute, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x0001C8, "Member 'GCue_Explosion_AerialHeavyVETI_C_OnExecute::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GCue_Explosion_AerialHeavyVETI_C_OnExecute, CallFunc_RandomFloatInRange_ReturnValue_2) == 0x0001D0, "Member 'GCue_Explosion_AerialHeavyVETI_C_OnExecute::CallFunc_RandomFloatInRange_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GCue_Explosion_AerialHeavyVETI_C_OnExecute, CallFunc_MakeRotator_ReturnValue) == 0x0001D8, "Member 'GCue_Explosion_AerialHeavyVETI_C_OnExecute::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCue_Explosion_AerialHeavyVETI_C_OnExecute, CallFunc_SpawnEffectAtLocation_ReturnValue) == 0x0001F0, "Member 'GCue_Explosion_AerialHeavyVETI_C_OnExecute::CallFunc_SpawnEffectAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCue_Explosion_AerialHeavyVETI_C_OnExecute, CallFunc_MakeRotator_Yaw_ImplicitCast) == 0x0001F8, "Member 'GCue_Explosion_AerialHeavyVETI_C_OnExecute::CallFunc_MakeRotator_Yaw_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GCue_Explosion_AerialHeavyVETI_C_OnExecute, CallFunc_MakeRotator_Pitch_ImplicitCast) == 0x0001FC, "Member 'GCue_Explosion_AerialHeavyVETI_C_OnExecute::CallFunc_MakeRotator_Pitch_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GCue_Explosion_AerialHeavyVETI_C_OnExecute, CallFunc_MakeRotator_Roll_ImplicitCast) == 0x000200, "Member 'GCue_Explosion_AerialHeavyVETI_C_OnExecute::CallFunc_MakeRotator_Roll_ImplicitCast' has a wrong offset!");

}

