#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Hydra5

#include "Basic.hpp"

#include "ProsSDK_structs.hpp"
#include "Pros_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// Enum Hydra5.EPartyInviteAnswer
// NumValues: 0x0004
enum class EPartyInviteAnswer : uint8
{
	ACCEPT_SUCCESS                           = 0,
	ACCEPT_FAILED                            = 1,
	REJECT                                   = 2,
	EPartyInviteAnswer_MAX                   = 3,
};

// ScriptStruct Hydra5.RatingsGameEntry
// 0x0038 (0x0038 - 0x0000)
struct FRatingsGameEntry final
{
public:
	int32                                         GamesCount;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Rating;                                            // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 SessionId;                                         // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         Time;                                              // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Data;                                              // 0x0020(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EHydra5MatchResult                            Result;                                            // 0x0030(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FRatingsGameEntry) == 0x000008, "Wrong alignment on FRatingsGameEntry");
static_assert(sizeof(FRatingsGameEntry) == 0x000038, "Wrong size on FRatingsGameEntry");
static_assert(offsetof(FRatingsGameEntry, GamesCount) == 0x000000, "Member 'FRatingsGameEntry::GamesCount' has a wrong offset!");
static_assert(offsetof(FRatingsGameEntry, Rating) == 0x000004, "Member 'FRatingsGameEntry::Rating' has a wrong offset!");
static_assert(offsetof(FRatingsGameEntry, SessionId) == 0x000008, "Member 'FRatingsGameEntry::SessionId' has a wrong offset!");
static_assert(offsetof(FRatingsGameEntry, Time) == 0x000018, "Member 'FRatingsGameEntry::Time' has a wrong offset!");
static_assert(offsetof(FRatingsGameEntry, Data) == 0x000020, "Member 'FRatingsGameEntry::Data' has a wrong offset!");
static_assert(offsetof(FRatingsGameEntry, Result) == 0x000030, "Member 'FRatingsGameEntry::Result' has a wrong offset!");

// ScriptStruct Hydra5.AbstractDataRecordHeader
// 0x0010 (0x0010 - 0x0000)
struct FAbstractDataRecordHeader final
{
public:
	int64                                         DataVersion;                                       // 0x0000(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         DataLayout;                                        // 0x0008(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FAbstractDataRecordHeader) == 0x000008, "Wrong alignment on FAbstractDataRecordHeader");
static_assert(sizeof(FAbstractDataRecordHeader) == 0x000010, "Wrong size on FAbstractDataRecordHeader");
static_assert(offsetof(FAbstractDataRecordHeader, DataVersion) == 0x000000, "Member 'FAbstractDataRecordHeader::DataVersion' has a wrong offset!");
static_assert(offsetof(FAbstractDataRecordHeader, DataLayout) == 0x000008, "Member 'FAbstractDataRecordHeader::DataLayout' has a wrong offset!");

// ScriptStruct Hydra5.AbstractDataRecord
// 0x0030 (0x0030 - 0x0000)
struct FAbstractDataRecord final
{
public:
	struct FAbstractDataRecordHeader              Header;                                            // 0x0000(0x0010)(BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	TArray<uint8>                                 Buffer;                                            // 0x0010(0x0010)(BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_20[0x10];                                      // 0x0020(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FAbstractDataRecord) == 0x000008, "Wrong alignment on FAbstractDataRecord");
static_assert(sizeof(FAbstractDataRecord) == 0x000030, "Wrong size on FAbstractDataRecord");
static_assert(offsetof(FAbstractDataRecord, Header) == 0x000000, "Member 'FAbstractDataRecord::Header' has a wrong offset!");
static_assert(offsetof(FAbstractDataRecord, Buffer) == 0x000010, "Member 'FAbstractDataRecord::Buffer' has a wrong offset!");

// ScriptStruct Hydra5.AbstractDataContainerRecord
// 0x0050 (0x0050 - 0x0000)
struct FAbstractDataContainerRecord final
{
public:
	class FString                                 ContainerName;                                     // 0x0000(0x0010)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAbstractDataRecord                    AbstractDataRecord;                                // 0x0010(0x0030)(BlueprintVisible, NativeAccessSpecifierPublic)
	uint8                                         Pad_40[0x10];                                      // 0x0040(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FAbstractDataContainerRecord) == 0x000008, "Wrong alignment on FAbstractDataContainerRecord");
static_assert(sizeof(FAbstractDataContainerRecord) == 0x000050, "Wrong size on FAbstractDataContainerRecord");
static_assert(offsetof(FAbstractDataContainerRecord, ContainerName) == 0x000000, "Member 'FAbstractDataContainerRecord::ContainerName' has a wrong offset!");
static_assert(offsetof(FAbstractDataContainerRecord, AbstractDataRecord) == 0x000010, "Member 'FAbstractDataContainerRecord::AbstractDataRecord' has a wrong offset!");

// ScriptStruct Hydra5.ChallengeMilestoneData
// 0x0008 (0x0008 - 0x0000)
struct FChallengeMilestoneData final
{
public:
	int64                                         Milestone;                                         // 0x0000(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FChallengeMilestoneData) == 0x000008, "Wrong alignment on FChallengeMilestoneData");
static_assert(sizeof(FChallengeMilestoneData) == 0x000008, "Wrong size on FChallengeMilestoneData");
static_assert(offsetof(FChallengeMilestoneData, Milestone) == 0x000000, "Member 'FChallengeMilestoneData::Milestone' has a wrong offset!");

// ScriptStruct Hydra5.ChallengeCounterData
// 0x0030 (0x0030 - 0x0000)
struct FChallengeCounterData final
{
public:
	class FString                                 ID;                                                // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FChallengeMilestoneData>        Milestones;                                        // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	int64                                         Value;                                             // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         Goal;                                              // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FChallengeCounterData) == 0x000008, "Wrong alignment on FChallengeCounterData");
static_assert(sizeof(FChallengeCounterData) == 0x000030, "Wrong size on FChallengeCounterData");
static_assert(offsetof(FChallengeCounterData, ID) == 0x000000, "Member 'FChallengeCounterData::ID' has a wrong offset!");
static_assert(offsetof(FChallengeCounterData, Milestones) == 0x000010, "Member 'FChallengeCounterData::Milestones' has a wrong offset!");
static_assert(offsetof(FChallengeCounterData, Value) == 0x000020, "Member 'FChallengeCounterData::Value' has a wrong offset!");
static_assert(offsetof(FChallengeCounterData, Goal) == 0x000028, "Member 'FChallengeCounterData::Goal' has a wrong offset!");

// ScriptStruct Hydra5.ChallengeClientData
// 0x0040 (0x0040 - 0x0000)
struct FChallengeClientData final
{
public:
	class FString                                 ID;                                                // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Definition;                                        // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EChallengeType                                Type;                                              // 0x0020(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EChallengeState                               State;                                             // 0x0021(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_22[0x2];                                       // 0x0022(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Slot;                                              // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         Tick;                                              // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FChallengeCounterData>          Counters;                                          // 0x0030(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FChallengeClientData) == 0x000008, "Wrong alignment on FChallengeClientData");
static_assert(sizeof(FChallengeClientData) == 0x000040, "Wrong size on FChallengeClientData");
static_assert(offsetof(FChallengeClientData, ID) == 0x000000, "Member 'FChallengeClientData::ID' has a wrong offset!");
static_assert(offsetof(FChallengeClientData, Definition) == 0x000010, "Member 'FChallengeClientData::Definition' has a wrong offset!");
static_assert(offsetof(FChallengeClientData, Type) == 0x000020, "Member 'FChallengeClientData::Type' has a wrong offset!");
static_assert(offsetof(FChallengeClientData, State) == 0x000021, "Member 'FChallengeClientData::State' has a wrong offset!");
static_assert(offsetof(FChallengeClientData, Slot) == 0x000024, "Member 'FChallengeClientData::Slot' has a wrong offset!");
static_assert(offsetof(FChallengeClientData, Tick) == 0x000028, "Member 'FChallengeClientData::Tick' has a wrong offset!");
static_assert(offsetof(FChallengeClientData, Counters) == 0x000030, "Member 'FChallengeClientData::Counters' has a wrong offset!");

// ScriptStruct Hydra5.ChallengeDailySlot
// 0x0010 (0x0010 - 0x0000)
struct FChallengeDailySlot final
{
public:
	int32                                         AvailableRechargeCount;                            // 0x0000(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         RemainingCooldownSec;                              // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         ExpirationSec;                                     // 0x0008(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FChallengeDailySlot) == 0x000008, "Wrong alignment on FChallengeDailySlot");
static_assert(sizeof(FChallengeDailySlot) == 0x000010, "Wrong size on FChallengeDailySlot");
static_assert(offsetof(FChallengeDailySlot, AvailableRechargeCount) == 0x000000, "Member 'FChallengeDailySlot::AvailableRechargeCount' has a wrong offset!");
static_assert(offsetof(FChallengeDailySlot, RemainingCooldownSec) == 0x000004, "Member 'FChallengeDailySlot::RemainingCooldownSec' has a wrong offset!");
static_assert(offsetof(FChallengeDailySlot, ExpirationSec) == 0x000008, "Member 'FChallengeDailySlot::ExpirationSec' has a wrong offset!");

// ScriptStruct Hydra5.ChallengeClientStatus
// 0x0028 (0x0028 - 0x0000)
struct FChallengeClientStatus final
{
public:
	int64                                         CurrentTick;                                       // 0x0000(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FChallengeClientData>           Challenges;                                        // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FChallengeDailySlot>            SlotsInfo;                                         // 0x0018(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FChallengeClientStatus) == 0x000008, "Wrong alignment on FChallengeClientStatus");
static_assert(sizeof(FChallengeClientStatus) == 0x000028, "Wrong size on FChallengeClientStatus");
static_assert(offsetof(FChallengeClientStatus, CurrentTick) == 0x000000, "Member 'FChallengeClientStatus::CurrentTick' has a wrong offset!");
static_assert(offsetof(FChallengeClientStatus, Challenges) == 0x000008, "Member 'FChallengeClientStatus::Challenges' has a wrong offset!");
static_assert(offsetof(FChallengeClientStatus, SlotsInfo) == 0x000018, "Member 'FChallengeClientStatus::SlotsInfo' has a wrong offset!");

// ScriptStruct Hydra5.RatingsEntry
// 0x0038 (0x0038 - 0x0000)
struct FRatingsEntry final
{
public:
	class FString                                 UserId;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Rating;                                            // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         GamesCount;                                        // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FRatingsGameEntry>              History;                                           // 0x0018(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	class FString                                 RatingId;                                          // 0x0028(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FRatingsEntry) == 0x000008, "Wrong alignment on FRatingsEntry");
static_assert(sizeof(FRatingsEntry) == 0x000038, "Wrong size on FRatingsEntry");
static_assert(offsetof(FRatingsEntry, UserId) == 0x000000, "Member 'FRatingsEntry::UserId' has a wrong offset!");
static_assert(offsetof(FRatingsEntry, Rating) == 0x000010, "Member 'FRatingsEntry::Rating' has a wrong offset!");
static_assert(offsetof(FRatingsEntry, GamesCount) == 0x000014, "Member 'FRatingsEntry::GamesCount' has a wrong offset!");
static_assert(offsetof(FRatingsEntry, History) == 0x000018, "Member 'FRatingsEntry::History' has a wrong offset!");
static_assert(offsetof(FRatingsEntry, RatingId) == 0x000028, "Member 'FRatingsEntry::RatingId' has a wrong offset!");

// ScriptStruct Hydra5.OfferItem
// 0x0030 (0x0030 - 0x0000)
struct FOfferItem final
{
public:
	class FString                                 ID;                                                // 0x0000(0x0010)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReferenceId;                                       // 0x0010(0x0010)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_20[0x10];                                      // 0x0020(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FOfferItem) == 0x000008, "Wrong alignment on FOfferItem");
static_assert(sizeof(FOfferItem) == 0x000030, "Wrong size on FOfferItem");
static_assert(offsetof(FOfferItem, ID) == 0x000000, "Member 'FOfferItem::ID' has a wrong offset!");
static_assert(offsetof(FOfferItem, ReferenceId) == 0x000010, "Member 'FOfferItem::ReferenceId' has a wrong offset!");

// ScriptStruct Hydra5.EconomyUserStateValue
// 0x0038 (0x0038 - 0x0000)
struct FEconomyUserStateValue final
{
public:
	EUserStateOwnType                             OwnType;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EUserStateDataType                            DataType;                                          // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ValueString;                                       // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         ValueInt64;                                        // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         ValueVectorStrings;                                // 0x0020(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FDateTime                              ValueTimeBased;                                    // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FEconomyUserStateValue) == 0x000008, "Wrong alignment on FEconomyUserStateValue");
static_assert(sizeof(FEconomyUserStateValue) == 0x000038, "Wrong size on FEconomyUserStateValue");
static_assert(offsetof(FEconomyUserStateValue, OwnType) == 0x000000, "Member 'FEconomyUserStateValue::OwnType' has a wrong offset!");
static_assert(offsetof(FEconomyUserStateValue, DataType) == 0x000001, "Member 'FEconomyUserStateValue::DataType' has a wrong offset!");
static_assert(offsetof(FEconomyUserStateValue, ValueString) == 0x000008, "Member 'FEconomyUserStateValue::ValueString' has a wrong offset!");
static_assert(offsetof(FEconomyUserStateValue, ValueInt64) == 0x000018, "Member 'FEconomyUserStateValue::ValueInt64' has a wrong offset!");
static_assert(offsetof(FEconomyUserStateValue, ValueVectorStrings) == 0x000020, "Member 'FEconomyUserStateValue::ValueVectorStrings' has a wrong offset!");
static_assert(offsetof(FEconomyUserStateValue, ValueTimeBased) == 0x000030, "Member 'FEconomyUserStateValue::ValueTimeBased' has a wrong offset!");

// ScriptStruct Hydra5.EconomyTransactionExtendedInfo
// 0x0020 (0x0020 - 0x0000)
struct FEconomyTransactionExtendedInfo final
{
public:
	class FString                                 Key;                                               // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Value;                                             // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FEconomyTransactionExtendedInfo) == 0x000008, "Wrong alignment on FEconomyTransactionExtendedInfo");
static_assert(sizeof(FEconomyTransactionExtendedInfo) == 0x000020, "Wrong size on FEconomyTransactionExtendedInfo");
static_assert(offsetof(FEconomyTransactionExtendedInfo, Key) == 0x000000, "Member 'FEconomyTransactionExtendedInfo::Key' has a wrong offset!");
static_assert(offsetof(FEconomyTransactionExtendedInfo, Value) == 0x000010, "Member 'FEconomyTransactionExtendedInfo::Value' has a wrong offset!");

// ScriptStruct Hydra5.EconomyTransactionItem
// 0x0098 (0x0098 - 0x0000)
struct FEconomyTransactionItem final
{
public:
	class FString                                 StateId;                                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EUserStateOpType                              OperationType;                                     // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEconomyUserStateValue                 Previous;                                          // 0x0018(0x0038)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FEconomyUserStateValue                 Current;                                           // 0x0050(0x0038)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	TArray<struct FEconomyTransactionExtendedInfo> Infos;                                            // 0x0088(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FEconomyTransactionItem) == 0x000008, "Wrong alignment on FEconomyTransactionItem");
static_assert(sizeof(FEconomyTransactionItem) == 0x000098, "Wrong size on FEconomyTransactionItem");
static_assert(offsetof(FEconomyTransactionItem, StateId) == 0x000000, "Member 'FEconomyTransactionItem::StateId' has a wrong offset!");
static_assert(offsetof(FEconomyTransactionItem, OperationType) == 0x000010, "Member 'FEconomyTransactionItem::OperationType' has a wrong offset!");
static_assert(offsetof(FEconomyTransactionItem, Previous) == 0x000018, "Member 'FEconomyTransactionItem::Previous' has a wrong offset!");
static_assert(offsetof(FEconomyTransactionItem, Current) == 0x000050, "Member 'FEconomyTransactionItem::Current' has a wrong offset!");
static_assert(offsetof(FEconomyTransactionItem, Infos) == 0x000088, "Member 'FEconomyTransactionItem::Infos' has a wrong offset!");

// ScriptStruct Hydra5.EconomyTransaction
// 0x0060 (0x0060 - 0x0000)
struct FEconomyTransaction final
{
public:
	int64                                         ID;                                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FOfferItem                             OfferItem;                                         // 0x0008(0x0030)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	TArray<struct FEconomyTransactionItem>        Items;                                             // 0x0038(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FEconomyTransactionExtendedInfo> Infos;                                            // 0x0048(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FDateTime                              TimestampCreatedAt;                                // 0x0058(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FEconomyTransaction) == 0x000008, "Wrong alignment on FEconomyTransaction");
static_assert(sizeof(FEconomyTransaction) == 0x000060, "Wrong size on FEconomyTransaction");
static_assert(offsetof(FEconomyTransaction, ID) == 0x000000, "Member 'FEconomyTransaction::ID' has a wrong offset!");
static_assert(offsetof(FEconomyTransaction, OfferItem) == 0x000008, "Member 'FEconomyTransaction::OfferItem' has a wrong offset!");
static_assert(offsetof(FEconomyTransaction, Items) == 0x000038, "Member 'FEconomyTransaction::Items' has a wrong offset!");
static_assert(offsetof(FEconomyTransaction, Infos) == 0x000048, "Member 'FEconomyTransaction::Infos' has a wrong offset!");
static_assert(offsetof(FEconomyTransaction, TimestampCreatedAt) == 0x000058, "Member 'FEconomyTransaction::TimestampCreatedAt' has a wrong offset!");

// ScriptStruct Hydra5.EconomyUserState
// 0x0048 (0x0048 - 0x0000)
struct FEconomyUserState final
{
public:
	class FString                                 ID;                                                // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FEconomyUserStateValue                 Value;                                             // 0x0010(0x0038)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
};
static_assert(alignof(FEconomyUserState) == 0x000008, "Wrong alignment on FEconomyUserState");
static_assert(sizeof(FEconomyUserState) == 0x000048, "Wrong size on FEconomyUserState");
static_assert(offsetof(FEconomyUserState, ID) == 0x000000, "Member 'FEconomyUserState::ID' has a wrong offset!");
static_assert(offsetof(FEconomyUserState, Value) == 0x000010, "Member 'FEconomyUserState::Value' has a wrong offset!");

// ScriptStruct Hydra5.EconomyUpdate
// 0x0020 (0x0020 - 0x0000)
struct FEconomyUpdate final
{
public:
	TArray<struct FEconomyTransaction>            Transactions;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FEconomyUserState>              States;                                            // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FEconomyUpdate) == 0x000008, "Wrong alignment on FEconomyUpdate");
static_assert(sizeof(FEconomyUpdate) == 0x000020, "Wrong size on FEconomyUpdate");
static_assert(offsetof(FEconomyUpdate, Transactions) == 0x000000, "Member 'FEconomyUpdate::Transactions' has a wrong offset!");
static_assert(offsetof(FEconomyUpdate, States) == 0x000010, "Member 'FEconomyUpdate::States' has a wrong offset!");

// ScriptStruct Hydra5.PresenceStaticDataSerializable
// 0x0028 (0x0028 - 0x0000)
struct FPresenceStaticDataSerializable final
{
public:
	class FString                                 Nickname;                                          // 0x0000(0x0010)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EProsProvider                                 Provider;                                          // 0x0010(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ExtendedData;                                      // 0x0018(0x0010)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FPresenceStaticDataSerializable) == 0x000008, "Wrong alignment on FPresenceStaticDataSerializable");
static_assert(sizeof(FPresenceStaticDataSerializable) == 0x000028, "Wrong size on FPresenceStaticDataSerializable");
static_assert(offsetof(FPresenceStaticDataSerializable, Nickname) == 0x000000, "Member 'FPresenceStaticDataSerializable::Nickname' has a wrong offset!");
static_assert(offsetof(FPresenceStaticDataSerializable, Provider) == 0x000010, "Member 'FPresenceStaticDataSerializable::Provider' has a wrong offset!");
static_assert(offsetof(FPresenceStaticDataSerializable, ExtendedData) == 0x000018, "Member 'FPresenceStaticDataSerializable::ExtendedData' has a wrong offset!");

// ScriptStruct Hydra5.MatchmakeSessionSettings
// 0x0028 (0x0028 - 0x0000)
struct FMatchmakeSessionSettings final
{
public:
	int32                                         PlayersMaxCount;                                   // 0x0000(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMatchmakeJipState                            Jip;                                               // 0x0004(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMatchmakeJoinDelegation                      JoinDelegation;                                    // 0x0005(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         AllowedPlayerIds;                                  // 0x0008(0x0010)(BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_18[0x10];                                      // 0x0018(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FMatchmakeSessionSettings) == 0x000008, "Wrong alignment on FMatchmakeSessionSettings");
static_assert(sizeof(FMatchmakeSessionSettings) == 0x000028, "Wrong size on FMatchmakeSessionSettings");
static_assert(offsetof(FMatchmakeSessionSettings, PlayersMaxCount) == 0x000000, "Member 'FMatchmakeSessionSettings::PlayersMaxCount' has a wrong offset!");
static_assert(offsetof(FMatchmakeSessionSettings, Jip) == 0x000004, "Member 'FMatchmakeSessionSettings::Jip' has a wrong offset!");
static_assert(offsetof(FMatchmakeSessionSettings, JoinDelegation) == 0x000005, "Member 'FMatchmakeSessionSettings::JoinDelegation' has a wrong offset!");
static_assert(offsetof(FMatchmakeSessionSettings, AllowedPlayerIds) == 0x000008, "Member 'FMatchmakeSessionSettings::AllowedPlayerIds' has a wrong offset!");

// ScriptStruct Hydra5.SessionControlKeyContainer
// 0x0050 (0x0050 - 0x0000)
struct FSessionControlKeyContainer final
{
public:
	TArray<uint8>                                 Key;                                               // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<uint8>                                 HashKey;                                           // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<uint8>                                 InitVectorValue;                                   // 0x0020(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<uint8>                                 Nonce;                                             // 0x0030(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_40[0x10];                                      // 0x0040(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FSessionControlKeyContainer) == 0x000008, "Wrong alignment on FSessionControlKeyContainer");
static_assert(sizeof(FSessionControlKeyContainer) == 0x000050, "Wrong size on FSessionControlKeyContainer");
static_assert(offsetof(FSessionControlKeyContainer, Key) == 0x000000, "Member 'FSessionControlKeyContainer::Key' has a wrong offset!");
static_assert(offsetof(FSessionControlKeyContainer, HashKey) == 0x000010, "Member 'FSessionControlKeyContainer::HashKey' has a wrong offset!");
static_assert(offsetof(FSessionControlKeyContainer, InitVectorValue) == 0x000020, "Member 'FSessionControlKeyContainer::InitVectorValue' has a wrong offset!");
static_assert(offsetof(FSessionControlKeyContainer, Nonce) == 0x000030, "Member 'FSessionControlKeyContainer::Nonce' has a wrong offset!");

// ScriptStruct Hydra5.MatchmakeSessionControlContainerOptional
// 0x0068 (0x0068 - 0x0000)
struct FMatchmakeSessionControlContainerOptional final
{
public:
	bool                                          bIsValid;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSessionControlKeyContainer            Key;                                               // 0x0008(0x0050)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	uint8                                         Pad_58[0x10];                                      // 0x0058(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FMatchmakeSessionControlContainerOptional) == 0x000008, "Wrong alignment on FMatchmakeSessionControlContainerOptional");
static_assert(sizeof(FMatchmakeSessionControlContainerOptional) == 0x000068, "Wrong size on FMatchmakeSessionControlContainerOptional");
static_assert(offsetof(FMatchmakeSessionControlContainerOptional, bIsValid) == 0x000000, "Member 'FMatchmakeSessionControlContainerOptional::bIsValid' has a wrong offset!");
static_assert(offsetof(FMatchmakeSessionControlContainerOptional, Key) == 0x000008, "Member 'FMatchmakeSessionControlContainerOptional::Key' has a wrong offset!");

// ScriptStruct Hydra5.Hy5PresenceProviderData
// 0x0002 (0x0002 - 0x0000)
struct FHy5PresenceProviderData final
{
public:
	EProsBuildPlatform                            Platform;                                          // 0x0000(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EProsProvider                                 Provider;                                          // 0x0001(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FHy5PresenceProviderData) == 0x000001, "Wrong alignment on FHy5PresenceProviderData");
static_assert(sizeof(FHy5PresenceProviderData) == 0x000002, "Wrong size on FHy5PresenceProviderData");
static_assert(offsetof(FHy5PresenceProviderData, Platform) == 0x000000, "Member 'FHy5PresenceProviderData::Platform' has a wrong offset!");
static_assert(offsetof(FHy5PresenceProviderData, Provider) == 0x000001, "Member 'FHy5PresenceProviderData::Provider' has a wrong offset!");

// ScriptStruct Hydra5.MatchmakeSessionMember
// 0x00D0 (0x00D0 - 0x0000)
struct FMatchmakeSessionMember final
{
public:
	class FString                                 Hydra5UserId;                                      // 0x0000(0x0010)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Data;                                              // 0x0010(0x0010)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 StaticData;                                        // 0x0020(0x0010)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsOwner;                                          // 0x0030(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsLocal;                                          // 0x0031(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_32[0x2];                                       // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SortIndex;                                         // 0x0034(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 GroupId;                                           // 0x0038(0x0010)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TeamID;                                            // 0x0048(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMatchmakeSessionControlContainerOptional KeyContainer;                                   // 0x0050(0x0068)(BlueprintVisible, NativeAccessSpecifierPublic)
	EHydra5MemberState                            State;                                             // 0x00B8(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FHy5PresenceProviderData               UserProvider;                                      // 0x00B9(0x0002)(BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_BB[0x15];                                      // 0x00BB(0x0015)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FMatchmakeSessionMember) == 0x000008, "Wrong alignment on FMatchmakeSessionMember");
static_assert(sizeof(FMatchmakeSessionMember) == 0x0000D0, "Wrong size on FMatchmakeSessionMember");
static_assert(offsetof(FMatchmakeSessionMember, Hydra5UserId) == 0x000000, "Member 'FMatchmakeSessionMember::Hydra5UserId' has a wrong offset!");
static_assert(offsetof(FMatchmakeSessionMember, Data) == 0x000010, "Member 'FMatchmakeSessionMember::Data' has a wrong offset!");
static_assert(offsetof(FMatchmakeSessionMember, StaticData) == 0x000020, "Member 'FMatchmakeSessionMember::StaticData' has a wrong offset!");
static_assert(offsetof(FMatchmakeSessionMember, bIsOwner) == 0x000030, "Member 'FMatchmakeSessionMember::bIsOwner' has a wrong offset!");
static_assert(offsetof(FMatchmakeSessionMember, bIsLocal) == 0x000031, "Member 'FMatchmakeSessionMember::bIsLocal' has a wrong offset!");
static_assert(offsetof(FMatchmakeSessionMember, SortIndex) == 0x000034, "Member 'FMatchmakeSessionMember::SortIndex' has a wrong offset!");
static_assert(offsetof(FMatchmakeSessionMember, GroupId) == 0x000038, "Member 'FMatchmakeSessionMember::GroupId' has a wrong offset!");
static_assert(offsetof(FMatchmakeSessionMember, TeamID) == 0x000048, "Member 'FMatchmakeSessionMember::TeamID' has a wrong offset!");
static_assert(offsetof(FMatchmakeSessionMember, KeyContainer) == 0x000050, "Member 'FMatchmakeSessionMember::KeyContainer' has a wrong offset!");
static_assert(offsetof(FMatchmakeSessionMember, State) == 0x0000B8, "Member 'FMatchmakeSessionMember::State' has a wrong offset!");
static_assert(offsetof(FMatchmakeSessionMember, UserProvider) == 0x0000B9, "Member 'FMatchmakeSessionMember::UserProvider' has a wrong offset!");

// ScriptStruct Hydra5.PresenceUserSessionStatus
// 0x0070 (0x0070 - 0x0000)
struct FPresenceUserSessionStatus final
{
public:
	class FString                                 ID;                                                // 0x0000(0x0010)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Data;                                              // 0x0010(0x0010)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMatchmakeSessionSettings              Settings;                                          // 0x0020(0x0028)(BlueprintVisible, NativeAccessSpecifierPublic)
	TArray<struct FProsSdkKeyValue>               Variants;                                          // 0x0048(0x0010)(BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FMatchmakeSessionMember>        Members;                                           // 0x0058(0x0010)(BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	EHydra5MatchmakeCrossplaySessionType          CrossplayType;                                     // 0x0068(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FPresenceUserSessionStatus) == 0x000008, "Wrong alignment on FPresenceUserSessionStatus");
static_assert(sizeof(FPresenceUserSessionStatus) == 0x000070, "Wrong size on FPresenceUserSessionStatus");
static_assert(offsetof(FPresenceUserSessionStatus, ID) == 0x000000, "Member 'FPresenceUserSessionStatus::ID' has a wrong offset!");
static_assert(offsetof(FPresenceUserSessionStatus, Data) == 0x000010, "Member 'FPresenceUserSessionStatus::Data' has a wrong offset!");
static_assert(offsetof(FPresenceUserSessionStatus, Settings) == 0x000020, "Member 'FPresenceUserSessionStatus::Settings' has a wrong offset!");
static_assert(offsetof(FPresenceUserSessionStatus, Variants) == 0x000048, "Member 'FPresenceUserSessionStatus::Variants' has a wrong offset!");
static_assert(offsetof(FPresenceUserSessionStatus, Members) == 0x000058, "Member 'FPresenceUserSessionStatus::Members' has a wrong offset!");
static_assert(offsetof(FPresenceUserSessionStatus, CrossplayType) == 0x000068, "Member 'FPresenceUserSessionStatus::CrossplayType' has a wrong offset!");

// ScriptStruct Hydra5.PresenceUsersSessionStatusOptional
// 0x0078 (0x0078 - 0x0000)
struct FPresenceUsersSessionStatusOptional final
{
public:
	bool                                          bIsValid;                                          // 0x0000(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPresenceUserSessionStatus             Session;                                           // 0x0008(0x0070)(BlueprintVisible, NativeAccessSpecifierPublic)
};
static_assert(alignof(FPresenceUsersSessionStatusOptional) == 0x000008, "Wrong alignment on FPresenceUsersSessionStatusOptional");
static_assert(sizeof(FPresenceUsersSessionStatusOptional) == 0x000078, "Wrong size on FPresenceUsersSessionStatusOptional");
static_assert(offsetof(FPresenceUsersSessionStatusOptional, bIsValid) == 0x000000, "Member 'FPresenceUsersSessionStatusOptional::bIsValid' has a wrong offset!");
static_assert(offsetof(FPresenceUsersSessionStatusOptional, Session) == 0x000008, "Member 'FPresenceUsersSessionStatusOptional::Session' has a wrong offset!");

// ScriptStruct Hydra5.PresenceUserPresenceData
// 0x00D0 (0x00D0 - 0x0000)
struct FPresenceUserPresenceData final
{
public:
	class FString                                 Hydra5UserId;                                      // 0x0000(0x0010)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsOnline;                                         // 0x0010(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsInvitable;                                      // 0x0011(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 StaticData;                                        // 0x0018(0x0010)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPresenceStaticDataSerializable        StaticDataObject;                                  // 0x0028(0x0028)(BlueprintVisible, NativeAccessSpecifierPublic)
	struct FPresenceUsersSessionStatusOptional    SessionStatus;                                     // 0x0050(0x0078)(BlueprintVisible, NativeAccessSpecifierPublic)
	struct FHy5PresenceProviderData               UserProvider;                                      // 0x00C8(0x0002)(BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_CA[0x6];                                       // 0x00CA(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FPresenceUserPresenceData) == 0x000008, "Wrong alignment on FPresenceUserPresenceData");
static_assert(sizeof(FPresenceUserPresenceData) == 0x0000D0, "Wrong size on FPresenceUserPresenceData");
static_assert(offsetof(FPresenceUserPresenceData, Hydra5UserId) == 0x000000, "Member 'FPresenceUserPresenceData::Hydra5UserId' has a wrong offset!");
static_assert(offsetof(FPresenceUserPresenceData, bIsOnline) == 0x000010, "Member 'FPresenceUserPresenceData::bIsOnline' has a wrong offset!");
static_assert(offsetof(FPresenceUserPresenceData, bIsInvitable) == 0x000011, "Member 'FPresenceUserPresenceData::bIsInvitable' has a wrong offset!");
static_assert(offsetof(FPresenceUserPresenceData, StaticData) == 0x000018, "Member 'FPresenceUserPresenceData::StaticData' has a wrong offset!");
static_assert(offsetof(FPresenceUserPresenceData, StaticDataObject) == 0x000028, "Member 'FPresenceUserPresenceData::StaticDataObject' has a wrong offset!");
static_assert(offsetof(FPresenceUserPresenceData, SessionStatus) == 0x000050, "Member 'FPresenceUserPresenceData::SessionStatus' has a wrong offset!");
static_assert(offsetof(FPresenceUserPresenceData, UserProvider) == 0x0000C8, "Member 'FPresenceUserPresenceData::UserProvider' has a wrong offset!");

// ScriptStruct Hydra5.PresenceUsersPresence
// 0x0010 (0x0010 - 0x0000)
struct FPresenceUsersPresence final
{
public:
	TArray<struct FPresenceUserPresenceData>      Users;                                             // 0x0000(0x0010)(BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FPresenceUsersPresence) == 0x000008, "Wrong alignment on FPresenceUsersPresence");
static_assert(sizeof(FPresenceUsersPresence) == 0x000010, "Wrong size on FPresenceUsersPresence");
static_assert(offsetof(FPresenceUsersPresence, Users) == 0x000000, "Member 'FPresenceUsersPresence::Users' has a wrong offset!");

// ScriptStruct Hydra5.RatingsUpdateEntry
// 0x0040 (0x0040 - 0x0000)
struct FRatingsUpdateEntry final
{
public:
	class FString                                 Hydra5UserId;                                      // 0x0000(0x0010)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Rating;                                            // 0x0010(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Data;                                              // 0x0018(0x0010)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EHydra5MatchResult                            Result;                                            // 0x0028(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x17];                                      // 0x0029(0x0017)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FRatingsUpdateEntry) == 0x000008, "Wrong alignment on FRatingsUpdateEntry");
static_assert(sizeof(FRatingsUpdateEntry) == 0x000040, "Wrong size on FRatingsUpdateEntry");
static_assert(offsetof(FRatingsUpdateEntry, Hydra5UserId) == 0x000000, "Member 'FRatingsUpdateEntry::Hydra5UserId' has a wrong offset!");
static_assert(offsetof(FRatingsUpdateEntry, Rating) == 0x000010, "Member 'FRatingsUpdateEntry::Rating' has a wrong offset!");
static_assert(offsetof(FRatingsUpdateEntry, Data) == 0x000018, "Member 'FRatingsUpdateEntry::Data' has a wrong offset!");
static_assert(offsetof(FRatingsUpdateEntry, Result) == 0x000028, "Member 'FRatingsUpdateEntry::Result' has a wrong offset!");

// ScriptStruct Hydra5.RatingsUpdateEntryIndividual
// 0x0048 (0x0048 - 0x0000)
struct FRatingsUpdateEntryIndividual final
{
public:
	class FString                                 Hydra5UserId;                                      // 0x0000(0x0010)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PlacementInGame;                                   // 0x0010(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Data;                                              // 0x0018(0x0010)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 RatingId;                                          // 0x0028(0x0010)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_38[0x10];                                      // 0x0038(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FRatingsUpdateEntryIndividual) == 0x000008, "Wrong alignment on FRatingsUpdateEntryIndividual");
static_assert(sizeof(FRatingsUpdateEntryIndividual) == 0x000048, "Wrong size on FRatingsUpdateEntryIndividual");
static_assert(offsetof(FRatingsUpdateEntryIndividual, Hydra5UserId) == 0x000000, "Member 'FRatingsUpdateEntryIndividual::Hydra5UserId' has a wrong offset!");
static_assert(offsetof(FRatingsUpdateEntryIndividual, PlacementInGame) == 0x000010, "Member 'FRatingsUpdateEntryIndividual::PlacementInGame' has a wrong offset!");
static_assert(offsetof(FRatingsUpdateEntryIndividual, Data) == 0x000018, "Member 'FRatingsUpdateEntryIndividual::Data' has a wrong offset!");
static_assert(offsetof(FRatingsUpdateEntryIndividual, RatingId) == 0x000028, "Member 'FRatingsUpdateEntryIndividual::RatingId' has a wrong offset!");

// ScriptStruct Hydra5.LeaderboardEntry
// 0x0038 (0x0038 - 0x0000)
struct FLeaderboardEntry final
{
public:
	class FString                                 Hydra5UserId;                                      // 0x0000(0x0010)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Value;                                             // 0x0010(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Data;                                              // 0x0018(0x0010)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_28[0x10];                                      // 0x0028(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FLeaderboardEntry) == 0x000008, "Wrong alignment on FLeaderboardEntry");
static_assert(sizeof(FLeaderboardEntry) == 0x000038, "Wrong size on FLeaderboardEntry");
static_assert(offsetof(FLeaderboardEntry, Hydra5UserId) == 0x000000, "Member 'FLeaderboardEntry::Hydra5UserId' has a wrong offset!");
static_assert(offsetof(FLeaderboardEntry, Value) == 0x000010, "Member 'FLeaderboardEntry::Value' has a wrong offset!");
static_assert(offsetof(FLeaderboardEntry, Data) == 0x000018, "Member 'FLeaderboardEntry::Data' has a wrong offset!");

// ScriptStruct Hydra5.LeaderboardPosition
// 0x0048 (0x0048 - 0x0000)
struct FLeaderboardPosition final
{
public:
	struct FLeaderboardEntry                      Entry;                                             // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	int64                                         LastUpdated;                                       // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         position;                                          // 0x0040(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FLeaderboardPosition) == 0x000008, "Wrong alignment on FLeaderboardPosition");
static_assert(sizeof(FLeaderboardPosition) == 0x000048, "Wrong size on FLeaderboardPosition");
static_assert(offsetof(FLeaderboardPosition, Entry) == 0x000000, "Member 'FLeaderboardPosition::Entry' has a wrong offset!");
static_assert(offsetof(FLeaderboardPosition, LastUpdated) == 0x000038, "Member 'FLeaderboardPosition::LastUpdated' has a wrong offset!");
static_assert(offsetof(FLeaderboardPosition, position) == 0x000040, "Member 'FLeaderboardPosition::position' has a wrong offset!");

// ScriptStruct Hydra5.Hy5FriendsListUpdate
// 0x0040 (0x0040 - 0x0000)
struct FHy5FriendsListUpdate final
{
public:
	EHydra5FriendListUpdateType                   Type;                                              // 0x0000(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 UserId;                                            // 0x0008(0x0010)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EHydra5FriendState                            State;                                             // 0x0018(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 DynamicData;                                       // 0x0020(0x0010)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 CustomData;                                        // 0x0030(0x0010)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FHy5FriendsListUpdate) == 0x000008, "Wrong alignment on FHy5FriendsListUpdate");
static_assert(sizeof(FHy5FriendsListUpdate) == 0x000040, "Wrong size on FHy5FriendsListUpdate");
static_assert(offsetof(FHy5FriendsListUpdate, Type) == 0x000000, "Member 'FHy5FriendsListUpdate::Type' has a wrong offset!");
static_assert(offsetof(FHy5FriendsListUpdate, UserId) == 0x000008, "Member 'FHy5FriendsListUpdate::UserId' has a wrong offset!");
static_assert(offsetof(FHy5FriendsListUpdate, State) == 0x000018, "Member 'FHy5FriendsListUpdate::State' has a wrong offset!");
static_assert(offsetof(FHy5FriendsListUpdate, DynamicData) == 0x000020, "Member 'FHy5FriendsListUpdate::DynamicData' has a wrong offset!");
static_assert(offsetof(FHy5FriendsListUpdate, CustomData) == 0x000030, "Member 'FHy5FriendsListUpdate::CustomData' has a wrong offset!");

// ScriptStruct Hydra5.LayerProperties
// 0x0030 (0x0030 - 0x0000)
struct FLayerProperties final
{
public:
	class FString                                 ID;                                                // 0x0000(0x0010)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Version;                                           // 0x0010(0x0010)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_20[0x10];                                      // 0x0020(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FLayerProperties) == 0x000008, "Wrong alignment on FLayerProperties");
static_assert(sizeof(FLayerProperties) == 0x000030, "Wrong size on FLayerProperties");
static_assert(offsetof(FLayerProperties, ID) == 0x000000, "Member 'FLayerProperties::ID' has a wrong offset!");
static_assert(offsetof(FLayerProperties, Version) == 0x000010, "Member 'FLayerProperties::Version' has a wrong offset!");

// ScriptStruct Hydra5.LayerInfo
// 0x0040 (0x0040 - 0x0000)
struct FLayerInfo final
{
public:
	struct FLayerProperties                       Properties;                                        // 0x0000(0x0030)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	class FString                                 Hash;                                              // 0x0030(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FLayerInfo) == 0x000008, "Wrong alignment on FLayerInfo");
static_assert(sizeof(FLayerInfo) == 0x000040, "Wrong size on FLayerInfo");
static_assert(offsetof(FLayerInfo, Properties) == 0x000000, "Member 'FLayerInfo::Properties' has a wrong offset!");
