#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Hydra5

#include "Basic.hpp"

#include "ProsSDK_structs.hpp"
#include "Hydra5_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Pros_structs.hpp"


namespace SDK::Params
{

// Function Hydra5.Hydra5AbstractDataService.Get
// 0x0008 (0x0008 - 0x0000)
struct Hydra5AbstractDataService_Get final
{
public:
	class UHydra5AbstractDataService*             ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Hydra5AbstractDataService_Get) == 0x000008, "Wrong alignment on Hydra5AbstractDataService_Get");
static_assert(sizeof(Hydra5AbstractDataService_Get) == 0x000008, "Wrong size on Hydra5AbstractDataService_Get");
static_assert(offsetof(Hydra5AbstractDataService_Get, ReturnValue) == 0x000000, "Member 'Hydra5AbstractDataService_Get::ReturnValue' has a wrong offset!");

// Function Hydra5.Hydra5AbstractDataService.InstantGetData
// 0x0030 (0x0030 - 0x0000)
struct Hydra5AbstractDataService_InstantGetData final
{
public:
	int32                                         LocalUserNum;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAbstractDataGetRequestRecord>  RequestRecords;                                    // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TDelegate<void(int32 LocalUserNum, EProsdkErrorCodeAbstractData ResultCode, const TArray<struct FAbstractDataKeyRecord>& KeyRecords)> Delegate; // 0x0018(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EProsdkErrorCodeAbstractData                  ReturnValue;                                       // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(Hydra5AbstractDataService_InstantGetData) == 0x000008, "Wrong alignment on Hydra5AbstractDataService_InstantGetData");
static_assert(sizeof(Hydra5AbstractDataService_InstantGetData) == 0x000030, "Wrong size on Hydra5AbstractDataService_InstantGetData");
static_assert(offsetof(Hydra5AbstractDataService_InstantGetData, LocalUserNum) == 0x000000, "Member 'Hydra5AbstractDataService_InstantGetData::LocalUserNum' has a wrong offset!");
static_assert(offsetof(Hydra5AbstractDataService_InstantGetData, RequestRecords) == 0x000008, "Member 'Hydra5AbstractDataService_InstantGetData::RequestRecords' has a wrong offset!");
static_assert(offsetof(Hydra5AbstractDataService_InstantGetData, Delegate) == 0x000018, "Member 'Hydra5AbstractDataService_InstantGetData::Delegate' has a wrong offset!");
static_assert(offsetof(Hydra5AbstractDataService_InstantGetData, ReturnValue) == 0x000028, "Member 'Hydra5AbstractDataService_InstantGetData::ReturnValue' has a wrong offset!");

// Function Hydra5.Hydra5AbstractDataService.InstantGetOwnData
// 0x0030 (0x0030 - 0x0000)
struct Hydra5AbstractDataService_InstantGetOwnData final
{
public:
	int32                                         LocalUserNum;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ContainerName;                                     // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(int32 LocalUserNum, EProsdkErrorCodeAbstractData ResultCode, const TArray<struct FAbstractDataKeyRecord>& KeyRecords)> Delegate; // 0x0018(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EProsdkErrorCodeAbstractData                  ReturnValue;                                       // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(Hydra5AbstractDataService_InstantGetOwnData) == 0x000008, "Wrong alignment on Hydra5AbstractDataService_InstantGetOwnData");
static_assert(sizeof(Hydra5AbstractDataService_InstantGetOwnData) == 0x000030, "Wrong size on Hydra5AbstractDataService_InstantGetOwnData");
static_assert(offsetof(Hydra5AbstractDataService_InstantGetOwnData, LocalUserNum) == 0x000000, "Member 'Hydra5AbstractDataService_InstantGetOwnData::LocalUserNum' has a wrong offset!");
static_assert(offsetof(Hydra5AbstractDataService_InstantGetOwnData, ContainerName) == 0x000008, "Member 'Hydra5AbstractDataService_InstantGetOwnData::ContainerName' has a wrong offset!");
static_assert(offsetof(Hydra5AbstractDataService_InstantGetOwnData, Delegate) == 0x000018, "Member 'Hydra5AbstractDataService_InstantGetOwnData::Delegate' has a wrong offset!");
static_assert(offsetof(Hydra5AbstractDataService_InstantGetOwnData, ReturnValue) == 0x000028, "Member 'Hydra5AbstractDataService_InstantGetOwnData::ReturnValue' has a wrong offset!");

// Function Hydra5.Hydra5AbstractDataService.InstantGetOwnDataArray
// 0x0030 (0x0030 - 0x0000)
struct Hydra5AbstractDataService_InstantGetOwnDataArray final
{
public:
	int32                                         LocalUserNum;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         ContainerNames;                                    // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TDelegate<void(int32 LocalUserNum, EProsdkErrorCodeAbstractData ResultCode, const TArray<struct FAbstractDataKeyRecord>& KeyRecords)> Delegate; // 0x0018(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EProsdkErrorCodeAbstractData                  ReturnValue;                                       // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(Hydra5AbstractDataService_InstantGetOwnDataArray) == 0x000008, "Wrong alignment on Hydra5AbstractDataService_InstantGetOwnDataArray");
static_assert(sizeof(Hydra5AbstractDataService_InstantGetOwnDataArray) == 0x000030, "Wrong size on Hydra5AbstractDataService_InstantGetOwnDataArray");
static_assert(offsetof(Hydra5AbstractDataService_InstantGetOwnDataArray, LocalUserNum) == 0x000000, "Member 'Hydra5AbstractDataService_InstantGetOwnDataArray::LocalUserNum' has a wrong offset!");
static_assert(offsetof(Hydra5AbstractDataService_InstantGetOwnDataArray, ContainerNames) == 0x000008, "Member 'Hydra5AbstractDataService_InstantGetOwnDataArray::ContainerNames' has a wrong offset!");
static_assert(offsetof(Hydra5AbstractDataService_InstantGetOwnDataArray, Delegate) == 0x000018, "Member 'Hydra5AbstractDataService_InstantGetOwnDataArray::Delegate' has a wrong offset!");
static_assert(offsetof(Hydra5AbstractDataService_InstantGetOwnDataArray, ReturnValue) == 0x000028, "Member 'Hydra5AbstractDataService_InstantGetOwnDataArray::ReturnValue' has a wrong offset!");

// Function Hydra5.Hydra5AbstractDataService.InstantWriteData
// 0x0030 (0x0030 - 0x0000)
struct Hydra5AbstractDataService_InstantWriteData final
{
public:
	int32                                         LocalUserNum;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAbstractDataKeyRecord>         KeyRecords;                                        // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TDelegate<void(int32 LocalUserNum, EProsdkErrorCodeAbstractData ResultCode)> Delegate;           // 0x0018(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EProsdkErrorCodeAbstractData                  ReturnValue;                                       // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(Hydra5AbstractDataService_InstantWriteData) == 0x000008, "Wrong alignment on Hydra5AbstractDataService_InstantWriteData");
static_assert(sizeof(Hydra5AbstractDataService_InstantWriteData) == 0x000030, "Wrong size on Hydra5AbstractDataService_InstantWriteData");
static_assert(offsetof(Hydra5AbstractDataService_InstantWriteData, LocalUserNum) == 0x000000, "Member 'Hydra5AbstractDataService_InstantWriteData::LocalUserNum' has a wrong offset!");
static_assert(offsetof(Hydra5AbstractDataService_InstantWriteData, KeyRecords) == 0x000008, "Member 'Hydra5AbstractDataService_InstantWriteData::KeyRecords' has a wrong offset!");
static_assert(offsetof(Hydra5AbstractDataService_InstantWriteData, Delegate) == 0x000018, "Member 'Hydra5AbstractDataService_InstantWriteData::Delegate' has a wrong offset!");
static_assert(offsetof(Hydra5AbstractDataService_InstantWriteData, ReturnValue) == 0x000028, "Member 'Hydra5AbstractDataService_InstantWriteData::ReturnValue' has a wrong offset!");

// Function Hydra5.Hydra5AbstractDataService.InstantWriteOwnData
// 0x0060 (0x0060 - 0x0000)
struct Hydra5AbstractDataService_InstantWriteOwnData final
{
public:
	int32                                         LocalUserNum;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ContainerName;                                     // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAbstractDataRecord                    AbstractDataRecord;                                // 0x0018(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TDelegate<void(int32 LocalUserNum, EProsdkErrorCodeAbstractData ResultCode)> Delegate;           // 0x0048(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EProsdkErrorCodeAbstractData                  ReturnValue;                                       // 0x0058(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(Hydra5AbstractDataService_InstantWriteOwnData) == 0x000008, "Wrong alignment on Hydra5AbstractDataService_InstantWriteOwnData");
static_assert(sizeof(Hydra5AbstractDataService_InstantWriteOwnData) == 0x000060, "Wrong size on Hydra5AbstractDataService_InstantWriteOwnData");
static_assert(offsetof(Hydra5AbstractDataService_InstantWriteOwnData, LocalUserNum) == 0x000000, "Member 'Hydra5AbstractDataService_InstantWriteOwnData::LocalUserNum' has a wrong offset!");
static_assert(offsetof(Hydra5AbstractDataService_InstantWriteOwnData, ContainerName) == 0x000008, "Member 'Hydra5AbstractDataService_InstantWriteOwnData::ContainerName' has a wrong offset!");
static_assert(offsetof(Hydra5AbstractDataService_InstantWriteOwnData, AbstractDataRecord) == 0x000018, "Member 'Hydra5AbstractDataService_InstantWriteOwnData::AbstractDataRecord' has a wrong offset!");
static_assert(offsetof(Hydra5AbstractDataService_InstantWriteOwnData, Delegate) == 0x000048, "Member 'Hydra5AbstractDataService_InstantWriteOwnData::Delegate' has a wrong offset!");
static_assert(offsetof(Hydra5AbstractDataService_InstantWriteOwnData, ReturnValue) == 0x000058, "Member 'Hydra5AbstractDataService_InstantWriteOwnData::ReturnValue' has a wrong offset!");

// Function Hydra5.Hydra5AbstractDataService.InstantWriteOwnDataArray
// 0x0030 (0x0030 - 0x0000)
struct Hydra5AbstractDataService_InstantWriteOwnDataArray final
{
public:
	int32                                         LocalUserNum;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAbstractDataContainerRecord>   Containers;                                        // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TDelegate<void(int32 LocalUserNum, EProsdkErrorCodeAbstractData ResultCode)> Delegate;           // 0x0018(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EProsdkErrorCodeAbstractData                  ReturnValue;                                       // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(Hydra5AbstractDataService_InstantWriteOwnDataArray) == 0x000008, "Wrong alignment on Hydra5AbstractDataService_InstantWriteOwnDataArray");
static_assert(sizeof(Hydra5AbstractDataService_InstantWriteOwnDataArray) == 0x000030, "Wrong size on Hydra5AbstractDataService_InstantWriteOwnDataArray");
static_assert(offsetof(Hydra5AbstractDataService_InstantWriteOwnDataArray, LocalUserNum) == 0x000000, "Member 'Hydra5AbstractDataService_InstantWriteOwnDataArray::LocalUserNum' has a wrong offset!");
static_assert(offsetof(Hydra5AbstractDataService_InstantWriteOwnDataArray, Containers) == 0x000008, "Member 'Hydra5AbstractDataService_InstantWriteOwnDataArray::Containers' has a wrong offset!");
static_assert(offsetof(Hydra5AbstractDataService_InstantWriteOwnDataArray, Delegate) == 0x000018, "Member 'Hydra5AbstractDataService_InstantWriteOwnDataArray::Delegate' has a wrong offset!");
static_assert(offsetof(Hydra5AbstractDataService_InstantWriteOwnDataArray, ReturnValue) == 0x000028, "Member 'Hydra5AbstractDataService_InstantWriteOwnDataArray::ReturnValue' has a wrong offset!");

// Function Hydra5.Hydra5AbstractDataService.RequestData
// 0x0030 (0x0030 - 0x0000)
struct Hydra5AbstractDataService_RequestData final
{
public:
	int32                                         LocalUserNum;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAbstractDataGetRequestRecord>  RequestRecords;                                    // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TDelegate<void(int32 LocalUserNum, EProsdkErrorCodeAbstractData ResultCode, const TArray<struct FAbstractDataKeyRecord>& KeyRecords)> Delegate; // 0x0018(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EProsdkErrorCodeAbstractData                  ReturnValue;                                       // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(Hydra5AbstractDataService_RequestData) == 0x000008, "Wrong alignment on Hydra5AbstractDataService_RequestData");
static_assert(sizeof(Hydra5AbstractDataService_RequestData) == 0x000030, "Wrong size on Hydra5AbstractDataService_RequestData");
static_assert(offsetof(Hydra5AbstractDataService_RequestData, LocalUserNum) == 0x000000, "Member 'Hydra5AbstractDataService_RequestData::LocalUserNum' has a wrong offset!");
static_assert(offsetof(Hydra5AbstractDataService_RequestData, RequestRecords) == 0x000008, "Member 'Hydra5AbstractDataService_RequestData::RequestRecords' has a wrong offset!");
static_assert(offsetof(Hydra5AbstractDataService_RequestData, Delegate) == 0x000018, "Member 'Hydra5AbstractDataService_RequestData::Delegate' has a wrong offset!");
static_assert(offsetof(Hydra5AbstractDataService_RequestData, ReturnValue) == 0x000028, "Member 'Hydra5AbstractDataService_RequestData::ReturnValue' has a wrong offset!");

// Function Hydra5.Hydra5AbstractDataService.RequestOwnData
// 0x0030 (0x0030 - 0x0000)
struct Hydra5AbstractDataService_RequestOwnData final
{
public:
	int32                                         LocalUserNum;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ContainerName;                                     // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(int32 LocalUserNum, EProsdkErrorCodeAbstractData ResultCode, const TArray<struct FAbstractDataKeyRecord>& KeyRecords)> Delegate; // 0x0018(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EProsdkErrorCodeAbstractData                  ReturnValue;                                       // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(Hydra5AbstractDataService_RequestOwnData) == 0x000008, "Wrong alignment on Hydra5AbstractDataService_RequestOwnData");
static_assert(sizeof(Hydra5AbstractDataService_RequestOwnData) == 0x000030, "Wrong size on Hydra5AbstractDataService_RequestOwnData");
static_assert(offsetof(Hydra5AbstractDataService_RequestOwnData, LocalUserNum) == 0x000000, "Member 'Hydra5AbstractDataService_RequestOwnData::LocalUserNum' has a wrong offset!");
static_assert(offsetof(Hydra5AbstractDataService_RequestOwnData, ContainerName) == 0x000008, "Member 'Hydra5AbstractDataService_RequestOwnData::ContainerName' has a wrong offset!");
static_assert(offsetof(Hydra5AbstractDataService_RequestOwnData, Delegate) == 0x000018, "Member 'Hydra5AbstractDataService_RequestOwnData::Delegate' has a wrong offset!");
static_assert(offsetof(Hydra5AbstractDataService_RequestOwnData, ReturnValue) == 0x000028, "Member 'Hydra5AbstractDataService_RequestOwnData::ReturnValue' has a wrong offset!");

// Function Hydra5.Hydra5AbstractDataService.RequestOwnDataArray
// 0x0030 (0x0030 - 0x0000)
struct Hydra5AbstractDataService_RequestOwnDataArray final
{
public:
	int32                                         LocalUserNum;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         ContainerNames;                                    // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TDelegate<void(int32 LocalUserNum, EProsdkErrorCodeAbstractData ResultCode, const TArray<struct FAbstractDataKeyRecord>& KeyRecords)> Delegate; // 0x0018(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EProsdkErrorCodeAbstractData                  ReturnValue;                                       // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(Hydra5AbstractDataService_RequestOwnDataArray) == 0x000008, "Wrong alignment on Hydra5AbstractDataService_RequestOwnDataArray");
static_assert(sizeof(Hydra5AbstractDataService_RequestOwnDataArray) == 0x000030, "Wrong size on Hydra5AbstractDataService_RequestOwnDataArray");
static_assert(offsetof(Hydra5AbstractDataService_RequestOwnDataArray, LocalUserNum) == 0x000000, "Member 'Hydra5AbstractDataService_RequestOwnDataArray::LocalUserNum' has a wrong offset!");
static_assert(offsetof(Hydra5AbstractDataService_RequestOwnDataArray, ContainerNames) == 0x000008, "Member 'Hydra5AbstractDataService_RequestOwnDataArray::ContainerNames' has a wrong offset!");
static_assert(offsetof(Hydra5AbstractDataService_RequestOwnDataArray, Delegate) == 0x000018, "Member 'Hydra5AbstractDataService_RequestOwnDataArray::Delegate' has a wrong offset!");
static_assert(offsetof(Hydra5AbstractDataService_RequestOwnDataArray, ReturnValue) == 0x000028, "Member 'Hydra5AbstractDataService_RequestOwnDataArray::ReturnValue' has a wrong offset!");

// Function Hydra5.Hydra5AbstractDataService.ServerRequestData
// 0x0028 (0x0028 - 0x0000)
struct Hydra5AbstractDataService_ServerRequestData final
{
public:
	TArray<struct FAbstractDataGetRequestRecord>  RequestRecords;                                    // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TDelegate<void(int32 LocalUserNum, EProsdkErrorCodeAbstractData ResultCode, const TArray<struct FAbstractDataKeyRecord>& KeyRecords)> Delegate; // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EProsdkErrorCodeAbstractData                  ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(Hydra5AbstractDataService_ServerRequestData) == 0x000008, "Wrong alignment on Hydra5AbstractDataService_ServerRequestData");
static_assert(sizeof(Hydra5AbstractDataService_ServerRequestData) == 0x000028, "Wrong size on Hydra5AbstractDataService_ServerRequestData");
static_assert(offsetof(Hydra5AbstractDataService_ServerRequestData, RequestRecords) == 0x000000, "Member 'Hydra5AbstractDataService_ServerRequestData::RequestRecords' has a wrong offset!");
static_assert(offsetof(Hydra5AbstractDataService_ServerRequestData, Delegate) == 0x000010, "Member 'Hydra5AbstractDataService_ServerRequestData::Delegate' has a wrong offset!");
static_assert(offsetof(Hydra5AbstractDataService_ServerRequestData, ReturnValue) == 0x000020, "Member 'Hydra5AbstractDataService_ServerRequestData::ReturnValue' has a wrong offset!");

// Function Hydra5.Hydra5AbstractDataService.ServerSetData
// 0x0028 (0x0028 - 0x0000)
struct Hydra5AbstractDataService_ServerSetData final
{
public:
	TArray<struct FAbstractDataKeyRecord>         KeyRecords;                                        // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TDelegate<void(EProsdkErrorCodeAbstractData ResultCode)> Delegate;                               // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EProsdkErrorCodeAbstractData                  ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(Hydra5AbstractDataService_ServerSetData) == 0x000008, "Wrong alignment on Hydra5AbstractDataService_ServerSetData");
static_assert(sizeof(Hydra5AbstractDataService_ServerSetData) == 0x000028, "Wrong size on Hydra5AbstractDataService_ServerSetData");
static_assert(offsetof(Hydra5AbstractDataService_ServerSetData, KeyRecords) == 0x000000, "Member 'Hydra5AbstractDataService_ServerSetData::KeyRecords' has a wrong offset!");
static_assert(offsetof(Hydra5AbstractDataService_ServerSetData, Delegate) == 0x000010, "Member 'Hydra5AbstractDataService_ServerSetData::Delegate' has a wrong offset!");
static_assert(offsetof(Hydra5AbstractDataService_ServerSetData, ReturnValue) == 0x000020, "Member 'Hydra5AbstractDataService_ServerSetData::ReturnValue' has a wrong offset!");

// Function Hydra5.Hydra5AbstractDataService.SetData
// 0x0030 (0x0030 - 0x0000)
struct Hydra5AbstractDataService_SetData final
{
public:
	int32                                         LocalUserNum;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAbstractDataKeyRecord>         KeyRecords;                                        // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TDelegate<void(int32 LocalUserNum, EProsdkErrorCodeAbstractData ResultCode)> Delegate;           // 0x0018(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EProsdkErrorCodeAbstractData                  ReturnValue;                                       // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(Hydra5AbstractDataService_SetData) == 0x000008, "Wrong alignment on Hydra5AbstractDataService_SetData");
static_assert(sizeof(Hydra5AbstractDataService_SetData) == 0x000030, "Wrong size on Hydra5AbstractDataService_SetData");
static_assert(offsetof(Hydra5AbstractDataService_SetData, LocalUserNum) == 0x000000, "Member 'Hydra5AbstractDataService_SetData::LocalUserNum' has a wrong offset!");
static_assert(offsetof(Hydra5AbstractDataService_SetData, KeyRecords) == 0x000008, "Member 'Hydra5AbstractDataService_SetData::KeyRecords' has a wrong offset!");
static_assert(offsetof(Hydra5AbstractDataService_SetData, Delegate) == 0x000018, "Member 'Hydra5AbstractDataService_SetData::Delegate' has a wrong offset!");
static_assert(offsetof(Hydra5AbstractDataService_SetData, ReturnValue) == 0x000028, "Member 'Hydra5AbstractDataService_SetData::ReturnValue' has a wrong offset!");

// Function Hydra5.Hydra5AbstractDataService.SetOwnData
// 0x0060 (0x0060 - 0x0000)
struct Hydra5AbstractDataService_SetOwnData final
{
public:
	int32                                         LocalUserNum;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ContainerName;                                     // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAbstractDataRecord                    AbstractDataRecord;                                // 0x0018(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TDelegate<void(int32 LocalUserNum, EProsdkErrorCodeAbstractData ResultCode)> Delegate;           // 0x0048(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EProsdkErrorCodeAbstractData                  ReturnValue;                                       // 0x0058(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(Hydra5AbstractDataService_SetOwnData) == 0x000008, "Wrong alignment on Hydra5AbstractDataService_SetOwnData");
static_assert(sizeof(Hydra5AbstractDataService_SetOwnData) == 0x000060, "Wrong size on Hydra5AbstractDataService_SetOwnData");
static_assert(offsetof(Hydra5AbstractDataService_SetOwnData, LocalUserNum) == 0x000000, "Member 'Hydra5AbstractDataService_SetOwnData::LocalUserNum' has a wrong offset!");
static_assert(offsetof(Hydra5AbstractDataService_SetOwnData, ContainerName) == 0x000008, "Member 'Hydra5AbstractDataService_SetOwnData::ContainerName' has a wrong offset!");
static_assert(offsetof(Hydra5AbstractDataService_SetOwnData, AbstractDataRecord) == 0x000018, "Member 'Hydra5AbstractDataService_SetOwnData::AbstractDataRecord' has a wrong offset!");
static_assert(offsetof(Hydra5AbstractDataService_SetOwnData, Delegate) == 0x000048, "Member 'Hydra5AbstractDataService_SetOwnData::Delegate' has a wrong offset!");
static_assert(offsetof(Hydra5AbstractDataService_SetOwnData, ReturnValue) == 0x000058, "Member 'Hydra5AbstractDataService_SetOwnData::ReturnValue' has a wrong offset!");

// Function Hydra5.Hydra5AbstractDataService.SetOwnDataArray
// 0x0030 (0x0030 - 0x0000)
struct Hydra5AbstractDataService_SetOwnDataArray final
{
public:
	int32                                         LocalUserNum;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAbstractDataContainerRecord>   Containers;                                        // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TDelegate<void(int32 LocalUserNum, EProsdkErrorCodeAbstractData ResultCode)> Delegate;           // 0x0018(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EProsdkErrorCodeAbstractData                  ReturnValue;                                       // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(Hydra5AbstractDataService_SetOwnDataArray) == 0x000008, "Wrong alignment on Hydra5AbstractDataService_SetOwnDataArray");
static_assert(sizeof(Hydra5AbstractDataService_SetOwnDataArray) == 0x000030, "Wrong size on Hydra5AbstractDataService_SetOwnDataArray");
static_assert(offsetof(Hydra5AbstractDataService_SetOwnDataArray, LocalUserNum) == 0x000000, "Member 'Hydra5AbstractDataService_SetOwnDataArray::LocalUserNum' has a wrong offset!");
static_assert(offsetof(Hydra5AbstractDataService_SetOwnDataArray, Containers) == 0x000008, "Member 'Hydra5AbstractDataService_SetOwnDataArray::Containers' has a wrong offset!");
static_assert(offsetof(Hydra5AbstractDataService_SetOwnDataArray, Delegate) == 0x000018, "Member 'Hydra5AbstractDataService_SetOwnDataArray::Delegate' has a wrong offset!");
static_assert(offsetof(Hydra5AbstractDataService_SetOwnDataArray, ReturnValue) == 0x000028, "Member 'Hydra5AbstractDataService_SetOwnDataArray::ReturnValue' has a wrong offset!");

// Function Hydra5.Hydra5BansService.Get
// 0x0008 (0x0008 - 0x0000)
struct Hydra5BansService_Get final
{
public:
	class UHydra5BansService*                     ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Hydra5BansService_Get) == 0x000008, "Wrong alignment on Hydra5BansService_Get");
static_assert(sizeof(Hydra5BansService_Get) == 0x000008, "Wrong size on Hydra5BansService_Get");
static_assert(offsetof(Hydra5BansService_Get, ReturnValue) == 0x000000, "Member 'Hydra5BansService_Get::ReturnValue' has a wrong offset!");

// Function Hydra5.Hydra5BansService.GetActiveUserBans
// 0x0018 (0x0018 - 0x0000)
struct Hydra5BansService_GetActiveUserBans final
{
public:
	int32                                         LocalUserNum;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(int32 LocalUserNum, EProsdkErrorCodeDefault ResultCode, const TArray<struct FBanInfoRecord>& BanRecords)> Delegate; // 0x0004(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EProsdkErrorCodeDefault                       ReturnValue;                                       // 0x0014(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(Hydra5BansService_GetActiveUserBans) == 0x000004, "Wrong alignment on Hydra5BansService_GetActiveUserBans");
static_assert(sizeof(Hydra5BansService_GetActiveUserBans) == 0x000018, "Wrong size on Hydra5BansService_GetActiveUserBans");
static_assert(offsetof(Hydra5BansService_GetActiveUserBans, LocalUserNum) == 0x000000, "Member 'Hydra5BansService_GetActiveUserBans::LocalUserNum' has a wrong offset!");
static_assert(offsetof(Hydra5BansService_GetActiveUserBans, Delegate) == 0x000004, "Member 'Hydra5BansService_GetActiveUserBans::Delegate' has a wrong offset!");
static_assert(offsetof(Hydra5BansService_GetActiveUserBans, ReturnValue) == 0x000014, "Member 'Hydra5BansService_GetActiveUserBans::ReturnValue' has a wrong offset!");

// Function Hydra5.Hydra5ChallengesService.Get
// 0x0008 (0x0008 - 0x0000)
struct Hydra5ChallengesService_Get final
{
public:
	class UHydra5ChallengesService*               ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Hydra5ChallengesService_Get) == 0x000008, "Wrong alignment on Hydra5ChallengesService_Get");
static_assert(sizeof(Hydra5ChallengesService_Get) == 0x000008, "Wrong size on Hydra5ChallengesService_Get");
static_assert(offsetof(Hydra5ChallengesService_Get, ReturnValue) == 0x000000, "Member 'Hydra5ChallengesService_Get::ReturnValue' has a wrong offset!");

// Function Hydra5.Hydra5ChallengesService.ChallengesGet
// 0x0018 (0x0018 - 0x0000)
struct Hydra5ChallengesService_ChallengesGet final
{
public:
	int32                                         LocalUserNum;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(int32 LocalUserNum, EProsdkErrorCodeChallenges ResultCode, const struct FChallengeClientStatus& ClientStatus)> Delegate; // 0x0004(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EProsdkErrorCodeChallenges                    ReturnValue;                                       // 0x0014(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(Hydra5ChallengesService_ChallengesGet) == 0x000004, "Wrong alignment on Hydra5ChallengesService_ChallengesGet");
static_assert(sizeof(Hydra5ChallengesService_ChallengesGet) == 0x000018, "Wrong size on Hydra5ChallengesService_ChallengesGet");
static_assert(offsetof(Hydra5ChallengesService_ChallengesGet, LocalUserNum) == 0x000000, "Member 'Hydra5ChallengesService_ChallengesGet::LocalUserNum' has a wrong offset!");
static_assert(offsetof(Hydra5ChallengesService_ChallengesGet, Delegate) == 0x000004, "Member 'Hydra5ChallengesService_ChallengesGet::Delegate' has a wrong offset!");
static_assert(offsetof(Hydra5ChallengesService_ChallengesGet, ReturnValue) == 0x000014, "Member 'Hydra5ChallengesService_ChallengesGet::ReturnValue' has a wrong offset!");

// Function Hydra5.Hydra5ChallengesService.ChallengesSubscribe
// 0x0018 (0x0018 - 0x0000)
struct Hydra5ChallengesService_ChallengesSubscribe final
{
public:
	int32                                         LocalUserNum;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(int32 LocalUserNum, const struct FChallengesUpdate& ClientUpdate)> Delegate;      // 0x0004(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EProsdkErrorCodeChallenges                    ReturnValue;                                       // 0x0014(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(Hydra5ChallengesService_ChallengesSubscribe) == 0x000004, "Wrong alignment on Hydra5ChallengesService_ChallengesSubscribe");
static_assert(sizeof(Hydra5ChallengesService_ChallengesSubscribe) == 0x000018, "Wrong size on Hydra5ChallengesService_ChallengesSubscribe");
static_assert(offsetof(Hydra5ChallengesService_ChallengesSubscribe, LocalUserNum) == 0x000000, "Member 'Hydra5ChallengesService_ChallengesSubscribe::LocalUserNum' has a wrong offset!");
static_assert(offsetof(Hydra5ChallengesService_ChallengesSubscribe, Delegate) == 0x000004, "Member 'Hydra5ChallengesService_ChallengesSubscribe::Delegate' has a wrong offset!");
static_assert(offsetof(Hydra5ChallengesService_ChallengesSubscribe, ReturnValue) == 0x000014, "Member 'Hydra5ChallengesService_ChallengesSubscribe::ReturnValue' has a wrong offset!");

// Function Hydra5.Hydra5ChallengesService.ChallengesUnSubscribe
// 0x0004 (0x0004 - 0x0000)
struct Hydra5ChallengesService_ChallengesUnSubscribe final
{
public:
	int32                                         LocalUserNum;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Hydra5ChallengesService_ChallengesUnSubscribe) == 0x000004, "Wrong alignment on Hydra5ChallengesService_ChallengesUnSubscribe");
static_assert(sizeof(Hydra5ChallengesService_ChallengesUnSubscribe) == 0x000004, "Wrong size on Hydra5ChallengesService_ChallengesUnSubscribe");
static_assert(offsetof(Hydra5ChallengesService_ChallengesUnSubscribe, LocalUserNum) == 0x000000, "Member 'Hydra5ChallengesService_ChallengesUnSubscribe::LocalUserNum' has a wrong offset!");

// Function Hydra5.Hydra5ChallengesService.ClientChallengesRegisterUsers
// 0x0020 (0x0020 - 0x0000)
struct Hydra5ChallengesService_ClientChallengesRegisterUsers final
{
public:
	int32                                         LocalUserNum;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         Users;                                             // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	EProsdkErrorCodeChallenges                    ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(Hydra5ChallengesService_ClientChallengesRegisterUsers) == 0x000008, "Wrong alignment on Hydra5ChallengesService_ClientChallengesRegisterUsers");
static_assert(sizeof(Hydra5ChallengesService_ClientChallengesRegisterUsers) == 0x000020, "Wrong size on Hydra5ChallengesService_ClientChallengesRegisterUsers");
static_assert(offsetof(Hydra5ChallengesService_ClientChallengesRegisterUsers, LocalUserNum) == 0x000000, "Member 'Hydra5ChallengesService_ClientChallengesRegisterUsers::LocalUserNum' has a wrong offset!");
static_assert(offsetof(Hydra5ChallengesService_ClientChallengesRegisterUsers, Users) == 0x000008, "Member 'Hydra5ChallengesService_ClientChallengesRegisterUsers::Users' has a wrong offset!");
static_assert(offsetof(Hydra5ChallengesService_ClientChallengesRegisterUsers, ReturnValue) == 0x000018, "Member 'Hydra5ChallengesService_ClientChallengesRegisterUsers::ReturnValue' has a wrong offset!");

// Function Hydra5.Hydra5ChallengesService.ClientChallengesRemoveUsers
// 0x0020 (0x0020 - 0x0000)
struct Hydra5ChallengesService_ClientChallengesRemoveUsers final
{
public:
	int32                                         LocalUserNum;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         Users;                                             // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	EProsdkErrorCodeChallenges                    ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(Hydra5ChallengesService_ClientChallengesRemoveUsers) == 0x000008, "Wrong alignment on Hydra5ChallengesService_ClientChallengesRemoveUsers");
static_assert(sizeof(Hydra5ChallengesService_ClientChallengesRemoveUsers) == 0x000020, "Wrong size on Hydra5ChallengesService_ClientChallengesRemoveUsers");
static_assert(offsetof(Hydra5ChallengesService_ClientChallengesRemoveUsers, LocalUserNum) == 0x000000, "Member 'Hydra5ChallengesService_ClientChallengesRemoveUsers::LocalUserNum' has a wrong offset!");
static_assert(offsetof(Hydra5ChallengesService_ClientChallengesRemoveUsers, Users) == 0x000008, "Member 'Hydra5ChallengesService_ClientChallengesRemoveUsers::Users' has a wrong offset!");
static_assert(offsetof(Hydra5ChallengesService_ClientChallengesRemoveUsers, ReturnValue) == 0x000018, "Member 'Hydra5ChallengesService_ClientChallengesRemoveUsers::ReturnValue' has a wrong offset!");

// Function Hydra5.Hydra5ChallengesService.ClientChallengesSubmitUserEvents
// 0x0020 (0x0020 - 0x0000)
struct Hydra5ChallengesService_ClientChallengesSubmitUserEvents final
{
public:
	int32                                         LocalUserNum;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FChallengePerUserEvent>         Events;                                            // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	EProsdkErrorCodeChallenges                    ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(Hydra5ChallengesService_ClientChallengesSubmitUserEvents) == 0x000008, "Wrong alignment on Hydra5ChallengesService_ClientChallengesSubmitUserEvents");
static_assert(sizeof(Hydra5ChallengesService_ClientChallengesSubmitUserEvents) == 0x000020, "Wrong size on Hydra5ChallengesService_ClientChallengesSubmitUserEvents");
static_assert(offsetof(Hydra5ChallengesService_ClientChallengesSubmitUserEvents, LocalUserNum) == 0x000000, "Member 'Hydra5ChallengesService_ClientChallengesSubmitUserEvents::LocalUserNum' has a wrong offset!");
static_assert(offsetof(Hydra5ChallengesService_ClientChallengesSubmitUserEvents, Events) == 0x000008, "Member 'Hydra5ChallengesService_ClientChallengesSubmitUserEvents::Events' has a wrong offset!");
static_assert(offsetof(Hydra5ChallengesService_ClientChallengesSubmitUserEvents, ReturnValue) == 0x000018, "Member 'Hydra5ChallengesService_ClientChallengesSubmitUserEvents::ReturnValue' has a wrong offset!");

// Function Hydra5.Hydra5ChallengesService.ServerChallengesRegisterUsers
// 0x0018 (0x0018 - 0x0000)
struct Hydra5ChallengesService_ServerChallengesRegisterUsers final
{
public:
	TArray<class FString>                         Users;                                             // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	EProsdkErrorCodeChallenges                    ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(Hydra5ChallengesService_ServerChallengesRegisterUsers) == 0x000008, "Wrong alignment on Hydra5ChallengesService_ServerChallengesRegisterUsers");
static_assert(sizeof(Hydra5ChallengesService_ServerChallengesRegisterUsers) == 0x000018, "Wrong size on Hydra5ChallengesService_ServerChallengesRegisterUsers");
static_assert(offsetof(Hydra5ChallengesService_ServerChallengesRegisterUsers, Users) == 0x000000, "Member 'Hydra5ChallengesService_ServerChallengesRegisterUsers::Users' has a wrong offset!");
static_assert(offsetof(Hydra5ChallengesService_ServerChallengesRegisterUsers, ReturnValue) == 0x000010, "Member 'Hydra5ChallengesService_ServerChallengesRegisterUsers::ReturnValue' has a wrong offset!");

// Function Hydra5.Hydra5ChallengesService.ServerChallengesRemoveUsers
// 0x0018 (0x0018 - 0x0000)
struct Hydra5ChallengesService_ServerChallengesRemoveUsers final
{
public:
	TArray<class FString>                         Users;                                             // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	EProsdkErrorCodeChallenges                    ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(Hydra5ChallengesService_ServerChallengesRemoveUsers) == 0x000008, "Wrong alignment on Hydra5ChallengesService_ServerChallengesRemoveUsers");
static_assert(sizeof(Hydra5ChallengesService_ServerChallengesRemoveUsers) == 0x000018, "Wrong size on Hydra5ChallengesService_ServerChallengesRemoveUsers");
static_assert(offsetof(Hydra5ChallengesService_ServerChallengesRemoveUsers, Users) == 0x000000, "Member 'Hydra5ChallengesService_ServerChallengesRemoveUsers::Users' has a wrong offset!");
static_assert(offsetof(Hydra5ChallengesService_ServerChallengesRemoveUsers, ReturnValue) == 0x000010, "Member 'Hydra5ChallengesService_ServerChallengesRemoveUsers::ReturnValue' has a wrong offset!");

// Function Hydra5.Hydra5ChallengesService.ServerChallengesSubmitUserEvents
// 0x0018 (0x0018 - 0x0000)
struct Hydra5ChallengesService_ServerChallengesSubmitUserEvents final
{
public:
	TArray<struct FChallengePerUserEvent>         Events;                                            // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	EProsdkErrorCodeChallenges                    ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(Hydra5ChallengesService_ServerChallengesSubmitUserEvents) == 0x000008, "Wrong alignment on Hydra5ChallengesService_ServerChallengesSubmitUserEvents");
static_assert(sizeof(Hydra5ChallengesService_ServerChallengesSubmitUserEvents) == 0x000018, "Wrong size on Hydra5ChallengesService_ServerChallengesSubmitUserEvents");
static_assert(offsetof(Hydra5ChallengesService_ServerChallengesSubmitUserEvents, Events) == 0x000000, "Member 'Hydra5ChallengesService_ServerChallengesSubmitUserEvents::Events' has a wrong offset!");
static_assert(offsetof(Hydra5ChallengesService_ServerChallengesSubmitUserEvents, ReturnValue) == 0x000010, "Member 'Hydra5ChallengesService_ServerChallengesSubmitUserEvents::ReturnValue' has a wrong offset!");

// Function Hydra5.Hydra5DiagnosticsService.Get
// 0x0008 (0x0008 - 0x0000)
struct Hydra5DiagnosticsService_Get final
{
public:
	class UHydra5DiagnosticsService*              ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Hydra5DiagnosticsService_Get) == 0x000008, "Wrong alignment on Hydra5DiagnosticsService_Get");
static_assert(sizeof(Hydra5DiagnosticsService_Get) == 0x000008, "Wrong size on Hydra5DiagnosticsService_Get");
static_assert(offsetof(Hydra5DiagnosticsService_Get, ReturnValue) == 0x000000, "Member 'Hydra5DiagnosticsService_Get::ReturnValue' has a wrong offset!");

// Function Hydra5.Hydra5DiagnosticsService.TryGet
// 0x0008 (0x0008 - 0x0000)
struct Hydra5DiagnosticsService_TryGet final
{
public:
	class UHydra5DiagnosticsService*              ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Hydra5DiagnosticsService_TryGet) == 0x000008, "Wrong alignment on Hydra5DiagnosticsService_TryGet");
static_assert(sizeof(Hydra5DiagnosticsService_TryGet) == 0x000008, "Wrong size on Hydra5DiagnosticsService_TryGet");
static_assert(offsetof(Hydra5DiagnosticsService_TryGet, ReturnValue) == 0x000000, "Member 'Hydra5DiagnosticsService_TryGet::ReturnValue' has a wrong offset!");

// Function Hydra5.Hydra5DiagnosticsService.CrashDumpUpload
// 0x0048 (0x0048 - 0x0000)
struct Hydra5DiagnosticsService_CrashDumpUpload final
{
public:
	struct FDiagnosticsCrashDumpData              Data;                                              // 0x0000(0x0040)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	EProsdkErrorCodeDefault                       ReturnValue;                                       // 0x0040(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(Hydra5DiagnosticsService_CrashDumpUpload) == 0x000008, "Wrong alignment on Hydra5DiagnosticsService_CrashDumpUpload");
static_assert(sizeof(Hydra5DiagnosticsService_CrashDumpUpload) == 0x000048, "Wrong size on Hydra5DiagnosticsService_CrashDumpUpload");
static_assert(offsetof(Hydra5DiagnosticsService_CrashDumpUpload, Data) == 0x000000, "Member 'Hydra5DiagnosticsService_CrashDumpUpload::Data' has a wrong offset!");
static_assert(offsetof(Hydra5DiagnosticsService_CrashDumpUpload, ReturnValue) == 0x000040, "Member 'Hydra5DiagnosticsService_CrashDumpUpload::ReturnValue' has a wrong offset!");

// Function Hydra5.Hydra5DiagnosticsService.CrashDumpUploadUserToken
// 0x0058 (0x0058 - 0x0000)
struct Hydra5DiagnosticsService_CrashDumpUploadUserToken final
{
public:
	class FString                                 Token;                                             // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDiagnosticsCrashDumpData              Data;                                              // 0x0010(0x0040)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	EProsdkErrorCodeDefault                       ReturnValue;                                       // 0x0050(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(Hydra5DiagnosticsService_CrashDumpUploadUserToken) == 0x000008, "Wrong alignment on Hydra5DiagnosticsService_CrashDumpUploadUserToken");
static_assert(sizeof(Hydra5DiagnosticsService_CrashDumpUploadUserToken) == 0x000058, "Wrong size on Hydra5DiagnosticsService_CrashDumpUploadUserToken");
static_assert(offsetof(Hydra5DiagnosticsService_CrashDumpUploadUserToken, Token) == 0x000000, "Member 'Hydra5DiagnosticsService_CrashDumpUploadUserToken::Token' has a wrong offset!");
static_assert(offsetof(Hydra5DiagnosticsService_CrashDumpUploadUserToken, Data) == 0x000010, "Member 'Hydra5DiagnosticsService_CrashDumpUploadUserToken::Data' has a wrong offset!");
static_assert(offsetof(Hydra5DiagnosticsService_CrashDumpUploadUserToken, ReturnValue) == 0x000050, "Member 'Hydra5DiagnosticsService_CrashDumpUploadUserToken::ReturnValue' has a wrong offset!");

// Function Hydra5.Hydra5DiagnosticsService.GetCrashReporterUserToken
// 0x0018 (0x0018 - 0x0000)
struct Hydra5DiagnosticsService_GetCrashReporterUserToken final
{
public:
	class FString                                 OutReporterToken;                                  // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EProsdkErrorCodeDefault                       ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(Hydra5DiagnosticsService_GetCrashReporterUserToken) == 0x000008, "Wrong alignment on Hydra5DiagnosticsService_GetCrashReporterUserToken");
static_assert(sizeof(Hydra5DiagnosticsService_GetCrashReporterUserToken) == 0x000018, "Wrong size on Hydra5DiagnosticsService_GetCrashReporterUserToken");
static_assert(offsetof(Hydra5DiagnosticsService_GetCrashReporterUserToken, OutReporterToken) == 0x000000, "Member 'Hydra5DiagnosticsService_GetCrashReporterUserToken::OutReporterToken' has a wrong offset!");
static_assert(offsetof(Hydra5DiagnosticsService_GetCrashReporterUserToken, ReturnValue) == 0x000010, "Member 'Hydra5DiagnosticsService_GetCrashReporterUserToken::ReturnValue' has a wrong offset!");

// Function Hydra5.Hydra5EconomyService.Get
// 0x0008 (0x0008 - 0x0000)
struct Hydra5EconomyService_Get final
{
public:
	class UHydra5EconomyService*                  ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Hydra5EconomyService_Get) == 0x000008, "Wrong alignment on Hydra5EconomyService_Get");
static_assert(sizeof(Hydra5EconomyService_Get) == 0x000008, "Wrong size on Hydra5EconomyService_Get");
