#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Map_SP_M03_Objectives

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "InputCore_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Tempest_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayCommands_structs.hpp"
#include "SavedGame_structs.hpp"


namespace SDK::Params
{

// Function Map_SP_M03_Objectives.Map_SP_M03_Objectives_C.1 Havoc N
// 0x0001 (0x0001 - 0x0000)
struct Map_SP_M03_Objectives_C_One_Havoc_N final
{
public:
	EAIMissionPatrolMode                          PatrolMode;                                        // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Map_SP_M03_Objectives_C_One_Havoc_N) == 0x000001, "Wrong alignment on Map_SP_M03_Objectives_C_One_Havoc_N");
static_assert(sizeof(Map_SP_M03_Objectives_C_One_Havoc_N) == 0x000001, "Wrong size on Map_SP_M03_Objectives_C_One_Havoc_N");
static_assert(offsetof(Map_SP_M03_Objectives_C_One_Havoc_N, PatrolMode) == 0x000000, "Member 'Map_SP_M03_Objectives_C_One_Havoc_N::PatrolMode' has a wrong offset!");

// Function Map_SP_M03_Objectives.Map_SP_M03_Objectives_C.1 Havoc S
// 0x0001 (0x0001 - 0x0000)
struct Map_SP_M03_Objectives_C_One_Havoc_S final
{
public:
	EAIMissionPatrolMode                          PatrolMode;                                        // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Map_SP_M03_Objectives_C_One_Havoc_S) == 0x000001, "Wrong alignment on Map_SP_M03_Objectives_C_One_Havoc_S");
static_assert(sizeof(Map_SP_M03_Objectives_C_One_Havoc_S) == 0x000001, "Wrong size on Map_SP_M03_Objectives_C_One_Havoc_S");
static_assert(offsetof(Map_SP_M03_Objectives_C_One_Havoc_S, PatrolMode) == 0x000000, "Member 'Map_SP_M03_Objectives_C_One_Havoc_S::PatrolMode' has a wrong offset!");

// Function Map_SP_M03_Objectives.Map_SP_M03_Objectives_C.1 Tank N
// 0x0001 (0x0001 - 0x0000)
struct Map_SP_M03_Objectives_C_One_Tank_N final
{
public:
	EAIMissionPatrolMode                          PatrolMode;                                        // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Map_SP_M03_Objectives_C_One_Tank_N) == 0x000001, "Wrong alignment on Map_SP_M03_Objectives_C_One_Tank_N");
static_assert(sizeof(Map_SP_M03_Objectives_C_One_Tank_N) == 0x000001, "Wrong size on Map_SP_M03_Objectives_C_One_Tank_N");
static_assert(offsetof(Map_SP_M03_Objectives_C_One_Tank_N, PatrolMode) == 0x000000, "Member 'Map_SP_M03_Objectives_C_One_Tank_N::PatrolMode' has a wrong offset!");

// Function Map_SP_M03_Objectives.Map_SP_M03_Objectives_C.1 Tank S
// 0x0001 (0x0001 - 0x0000)
struct Map_SP_M03_Objectives_C_One_Tank_S final
{
public:
	EAIMissionPatrolMode                          PatrolMode;                                        // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Map_SP_M03_Objectives_C_One_Tank_S) == 0x000001, "Wrong alignment on Map_SP_M03_Objectives_C_One_Tank_S");
static_assert(sizeof(Map_SP_M03_Objectives_C_One_Tank_S) == 0x000001, "Wrong size on Map_SP_M03_Objectives_C_One_Tank_S");
static_assert(offsetof(Map_SP_M03_Objectives_C_One_Tank_S, PatrolMode) == 0x000000, "Member 'Map_SP_M03_Objectives_C_One_Tank_S::PatrolMode' has a wrong offset!");

// Function Map_SP_M03_Objectives.Map_SP_M03_Objectives_C.1 Tank, 1 Havoc N
// 0x0001 (0x0001 - 0x0000)
struct Map_SP_M03_Objectives_C_One_Tank__1_Havoc_N final
{
public:
	EAIMissionPatrolMode                          PatrolMode;                                        // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Map_SP_M03_Objectives_C_One_Tank__1_Havoc_N) == 0x000001, "Wrong alignment on Map_SP_M03_Objectives_C_One_Tank__1_Havoc_N");
static_assert(sizeof(Map_SP_M03_Objectives_C_One_Tank__1_Havoc_N) == 0x000001, "Wrong size on Map_SP_M03_Objectives_C_One_Tank__1_Havoc_N");
static_assert(offsetof(Map_SP_M03_Objectives_C_One_Tank__1_Havoc_N, PatrolMode) == 0x000000, "Member 'Map_SP_M03_Objectives_C_One_Tank__1_Havoc_N::PatrolMode' has a wrong offset!");

// Function Map_SP_M03_Objectives.Map_SP_M03_Objectives_C.1 Tank, 1 Havoc S
// 0x0001 (0x0001 - 0x0000)
struct Map_SP_M03_Objectives_C_One_Tank__1_Havoc_S final
{
public:
	EAIMissionPatrolMode                          PatrolMode;                                        // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Map_SP_M03_Objectives_C_One_Tank__1_Havoc_S) == 0x000001, "Wrong alignment on Map_SP_M03_Objectives_C_One_Tank__1_Havoc_S");
static_assert(sizeof(Map_SP_M03_Objectives_C_One_Tank__1_Havoc_S) == 0x000001, "Wrong size on Map_SP_M03_Objectives_C_One_Tank__1_Havoc_S");
static_assert(offsetof(Map_SP_M03_Objectives_C_One_Tank__1_Havoc_S, PatrolMode) == 0x000000, "Member 'Map_SP_M03_Objectives_C_One_Tank__1_Havoc_S::PatrolMode' has a wrong offset!");

// Function Map_SP_M03_Objectives.Map_SP_M03_Objectives_C.2 Havoc N
// 0x0001 (0x0001 - 0x0000)
struct Map_SP_M03_Objectives_C_Two_Havoc_N final
{
public:
	EAIMissionPatrolMode                          PatrolMode;                                        // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Map_SP_M03_Objectives_C_Two_Havoc_N) == 0x000001, "Wrong alignment on Map_SP_M03_Objectives_C_Two_Havoc_N");
static_assert(sizeof(Map_SP_M03_Objectives_C_Two_Havoc_N) == 0x000001, "Wrong size on Map_SP_M03_Objectives_C_Two_Havoc_N");
static_assert(offsetof(Map_SP_M03_Objectives_C_Two_Havoc_N, PatrolMode) == 0x000000, "Member 'Map_SP_M03_Objectives_C_Two_Havoc_N::PatrolMode' has a wrong offset!");

// Function Map_SP_M03_Objectives.Map_SP_M03_Objectives_C.2 Havoc S
// 0x0001 (0x0001 - 0x0000)
struct Map_SP_M03_Objectives_C_Two_Havoc_S final
{
public:
	EAIMissionPatrolMode                          PatrolMode;                                        // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Map_SP_M03_Objectives_C_Two_Havoc_S) == 0x000001, "Wrong alignment on Map_SP_M03_Objectives_C_Two_Havoc_S");
static_assert(sizeof(Map_SP_M03_Objectives_C_Two_Havoc_S) == 0x000001, "Wrong size on Map_SP_M03_Objectives_C_Two_Havoc_S");
static_assert(offsetof(Map_SP_M03_Objectives_C_Two_Havoc_S, PatrolMode) == 0x000000, "Member 'Map_SP_M03_Objectives_C_Two_Havoc_S::PatrolMode' has a wrong offset!");

// Function Map_SP_M03_Objectives.Map_SP_M03_Objectives_C.2 Tank N
// 0x0001 (0x0001 - 0x0000)
struct Map_SP_M03_Objectives_C_Two_Tank_N final
{
public:
	EAIMissionPatrolMode                          PatrolMode;                                        // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Map_SP_M03_Objectives_C_Two_Tank_N) == 0x000001, "Wrong alignment on Map_SP_M03_Objectives_C_Two_Tank_N");
static_assert(sizeof(Map_SP_M03_Objectives_C_Two_Tank_N) == 0x000001, "Wrong size on Map_SP_M03_Objectives_C_Two_Tank_N");
static_assert(offsetof(Map_SP_M03_Objectives_C_Two_Tank_N, PatrolMode) == 0x000000, "Member 'Map_SP_M03_Objectives_C_Two_Tank_N::PatrolMode' has a wrong offset!");

// Function Map_SP_M03_Objectives.Map_SP_M03_Objectives_C.2 Tank S
// 0x0001 (0x0001 - 0x0000)
struct Map_SP_M03_Objectives_C_Two_Tank_S final
{
public:
	EAIMissionPatrolMode                          PatrolMode;                                        // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Map_SP_M03_Objectives_C_Two_Tank_S) == 0x000001, "Wrong alignment on Map_SP_M03_Objectives_C_Two_Tank_S");
static_assert(sizeof(Map_SP_M03_Objectives_C_Two_Tank_S) == 0x000001, "Wrong size on Map_SP_M03_Objectives_C_Two_Tank_S");
static_assert(offsetof(Map_SP_M03_Objectives_C_Two_Tank_S, PatrolMode) == 0x000000, "Member 'Map_SP_M03_Objectives_C_Two_Tank_S::PatrolMode' has a wrong offset!");

// Function Map_SP_M03_Objectives.Map_SP_M03_Objectives_C.ER_01_RocketBuggyBase
// 0x0001 (0x0001 - 0x0000)
struct Map_SP_M03_Objectives_C_ER_01_RocketBuggyBase final
{
public:
	bool                                          Reduced;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Map_SP_M03_Objectives_C_ER_01_RocketBuggyBase) == 0x000001, "Wrong alignment on Map_SP_M03_Objectives_C_ER_01_RocketBuggyBase");
static_assert(sizeof(Map_SP_M03_Objectives_C_ER_01_RocketBuggyBase) == 0x000001, "Wrong size on Map_SP_M03_Objectives_C_ER_01_RocketBuggyBase");
static_assert(offsetof(Map_SP_M03_Objectives_C_ER_01_RocketBuggyBase, Reduced) == 0x000000, "Member 'Map_SP_M03_Objectives_C_ER_01_RocketBuggyBase::Reduced' has a wrong offset!");

// Function Map_SP_M03_Objectives.Map_SP_M03_Objectives_C.ExecLatentFromSave_0192D252490185BF2714109838DF2F0F
// 0x0020 (0x0020 - 0x0000)
struct Map_SP_M03_Objectives_C_ExecLatentFromSave_0192D252490185BF2714109838DF2F0F final
{
public:
	struct FLatentActionSaveGameData              SaveInfo;                                          // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(Map_SP_M03_Objectives_C_ExecLatentFromSave_0192D252490185BF2714109838DF2F0F) == 0x000008, "Wrong alignment on Map_SP_M03_Objectives_C_ExecLatentFromSave_0192D252490185BF2714109838DF2F0F");
static_assert(sizeof(Map_SP_M03_Objectives_C_ExecLatentFromSave_0192D252490185BF2714109838DF2F0F) == 0x000020, "Wrong size on Map_SP_M03_Objectives_C_ExecLatentFromSave_0192D252490185BF2714109838DF2F0F");
static_assert(offsetof(Map_SP_M03_Objectives_C_ExecLatentFromSave_0192D252490185BF2714109838DF2F0F, SaveInfo) == 0x000000, "Member 'Map_SP_M03_Objectives_C_ExecLatentFromSave_0192D252490185BF2714109838DF2F0F::SaveInfo' has a wrong offset!");

// Function Map_SP_M03_Objectives.Map_SP_M03_Objectives_C.ExecLatentFromSave_02D3498E42956FAD7BC2EAB9F146D0D7
// 0x0020 (0x0020 - 0x0000)
struct Map_SP_M03_Objectives_C_ExecLatentFromSave_02D3498E42956FAD7BC2EAB9F146D0D7 final
{
public:
	struct FLatentActionSaveGameData              SaveInfo;                                          // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(Map_SP_M03_Objectives_C_ExecLatentFromSave_02D3498E42956FAD7BC2EAB9F146D0D7) == 0x000008, "Wrong alignment on Map_SP_M03_Objectives_C_ExecLatentFromSave_02D3498E42956FAD7BC2EAB9F146D0D7");
static_assert(sizeof(Map_SP_M03_Objectives_C_ExecLatentFromSave_02D3498E42956FAD7BC2EAB9F146D0D7) == 0x000020, "Wrong size on Map_SP_M03_Objectives_C_ExecLatentFromSave_02D3498E42956FAD7BC2EAB9F146D0D7");
static_assert(offsetof(Map_SP_M03_Objectives_C_ExecLatentFromSave_02D3498E42956FAD7BC2EAB9F146D0D7, SaveInfo) == 0x000000, "Member 'Map_SP_M03_Objectives_C_ExecLatentFromSave_02D3498E42956FAD7BC2EAB9F146D0D7::SaveInfo' has a wrong offset!");

// Function Map_SP_M03_Objectives.Map_SP_M03_Objectives_C.ExecLatentFromSave_0303D1B546EC9C185B8E678C6D7AFA9B
// 0x0020 (0x0020 - 0x0000)
struct Map_SP_M03_Objectives_C_ExecLatentFromSave_0303D1B546EC9C185B8E678C6D7AFA9B final
{
public:
	struct FLatentActionSaveGameData              LatentSaveGameData;                                // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(Map_SP_M03_Objectives_C_ExecLatentFromSave_0303D1B546EC9C185B8E678C6D7AFA9B) == 0x000008, "Wrong alignment on Map_SP_M03_Objectives_C_ExecLatentFromSave_0303D1B546EC9C185B8E678C6D7AFA9B");
static_assert(sizeof(Map_SP_M03_Objectives_C_ExecLatentFromSave_0303D1B546EC9C185B8E678C6D7AFA9B) == 0x000020, "Wrong size on Map_SP_M03_Objectives_C_ExecLatentFromSave_0303D1B546EC9C185B8E678C6D7AFA9B");
static_assert(offsetof(Map_SP_M03_Objectives_C_ExecLatentFromSave_0303D1B546EC9C185B8E678C6D7AFA9B, LatentSaveGameData) == 0x000000, "Member 'Map_SP_M03_Objectives_C_ExecLatentFromSave_0303D1B546EC9C185B8E678C6D7AFA9B::LatentSaveGameData' has a wrong offset!");

// Function Map_SP_M03_Objectives.Map_SP_M03_Objectives_C.ExecLatentFromSave_032053AE4992A20FDC48C292747B957A
// 0x0020 (0x0020 - 0x0000)
struct Map_SP_M03_Objectives_C_ExecLatentFromSave_032053AE4992A20FDC48C292747B957A final
{
public:
	struct FLatentActionSaveGameData              SaveInfo;                                          // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(Map_SP_M03_Objectives_C_ExecLatentFromSave_032053AE4992A20FDC48C292747B957A) == 0x000008, "Wrong alignment on Map_SP_M03_Objectives_C_ExecLatentFromSave_032053AE4992A20FDC48C292747B957A");
static_assert(sizeof(Map_SP_M03_Objectives_C_ExecLatentFromSave_032053AE4992A20FDC48C292747B957A) == 0x000020, "Wrong size on Map_SP_M03_Objectives_C_ExecLatentFromSave_032053AE4992A20FDC48C292747B957A");
static_assert(offsetof(Map_SP_M03_Objectives_C_ExecLatentFromSave_032053AE4992A20FDC48C292747B957A, SaveInfo) == 0x000000, "Member 'Map_SP_M03_Objectives_C_ExecLatentFromSave_032053AE4992A20FDC48C292747B957A::SaveInfo' has a wrong offset!");

// Function Map_SP_M03_Objectives.Map_SP_M03_Objectives_C.ExecLatentFromSave_03A83F3E46B1977A9DF830A314780068
// 0x0020 (0x0020 - 0x0000)
struct Map_SP_M03_Objectives_C_ExecLatentFromSave_03A83F3E46B1977A9DF830A314780068 final
{
public:
	struct FLatentActionSaveGameData              SaveInfo;                                          // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(Map_SP_M03_Objectives_C_ExecLatentFromSave_03A83F3E46B1977A9DF830A314780068) == 0x000008, "Wrong alignment on Map_SP_M03_Objectives_C_ExecLatentFromSave_03A83F3E46B1977A9DF830A314780068");
static_assert(sizeof(Map_SP_M03_Objectives_C_ExecLatentFromSave_03A83F3E46B1977A9DF830A314780068) == 0x000020, "Wrong size on Map_SP_M03_Objectives_C_ExecLatentFromSave_03A83F3E46B1977A9DF830A314780068");
static_assert(offsetof(Map_SP_M03_Objectives_C_ExecLatentFromSave_03A83F3E46B1977A9DF830A314780068, SaveInfo) == 0x000000, "Member 'Map_SP_M03_Objectives_C_ExecLatentFromSave_03A83F3E46B1977A9DF830A314780068::SaveInfo' has a wrong offset!");

// Function Map_SP_M03_Objectives.Map_SP_M03_Objectives_C.ExecLatentFromSave_03A83F3E46B1977A9DF830A31AEEB24F
// 0x0020 (0x0020 - 0x0000)
struct Map_SP_M03_Objectives_C_ExecLatentFromSave_03A83F3E46B1977A9DF830A31AEEB24F final
{
public:
	struct FLatentActionSaveGameData              SaveInfo;                                          // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(Map_SP_M03_Objectives_C_ExecLatentFromSave_03A83F3E46B1977A9DF830A31AEEB24F) == 0x000008, "Wrong alignment on Map_SP_M03_Objectives_C_ExecLatentFromSave_03A83F3E46B1977A9DF830A31AEEB24F");
static_assert(sizeof(Map_SP_M03_Objectives_C_ExecLatentFromSave_03A83F3E46B1977A9DF830A31AEEB24F) == 0x000020, "Wrong size on Map_SP_M03_Objectives_C_ExecLatentFromSave_03A83F3E46B1977A9DF830A31AEEB24F");
static_assert(offsetof(Map_SP_M03_Objectives_C_ExecLatentFromSave_03A83F3E46B1977A9DF830A31AEEB24F, SaveInfo) == 0x000000, "Member 'Map_SP_M03_Objectives_C_ExecLatentFromSave_03A83F3E46B1977A9DF830A31AEEB24F::SaveInfo' has a wrong offset!");

// Function Map_SP_M03_Objectives.Map_SP_M03_Objectives_C.ExecLatentFromSave_03A83F3E46B1977A9DF830A32F7318DB
// 0x0020 (0x0020 - 0x0000)
struct Map_SP_M03_Objectives_C_ExecLatentFromSave_03A83F3E46B1977A9DF830A32F7318DB final
{
public:
	struct FLatentActionSaveGameData              SaveInfo;                                          // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(Map_SP_M03_Objectives_C_ExecLatentFromSave_03A83F3E46B1977A9DF830A32F7318DB) == 0x000008, "Wrong alignment on Map_SP_M03_Objectives_C_ExecLatentFromSave_03A83F3E46B1977A9DF830A32F7318DB");
static_assert(sizeof(Map_SP_M03_Objectives_C_ExecLatentFromSave_03A83F3E46B1977A9DF830A32F7318DB) == 0x000020, "Wrong size on Map_SP_M03_Objectives_C_ExecLatentFromSave_03A83F3E46B1977A9DF830A32F7318DB");
static_assert(offsetof(Map_SP_M03_Objectives_C_ExecLatentFromSave_03A83F3E46B1977A9DF830A32F7318DB, SaveInfo) == 0x000000, "Member 'Map_SP_M03_Objectives_C_ExecLatentFromSave_03A83F3E46B1977A9DF830A32F7318DB::SaveInfo' has a wrong offset!");

// Function Map_SP_M03_Objectives.Map_SP_M03_Objectives_C.ExecLatentFromSave_03A83F3E46B1977A9DF830A3508AD44F
// 0x0020 (0x0020 - 0x0000)
struct Map_SP_M03_Objectives_C_ExecLatentFromSave_03A83F3E46B1977A9DF830A3508AD44F final
{
public:
	struct FLatentActionSaveGameData              SaveInfo;                                          // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(Map_SP_M03_Objectives_C_ExecLatentFromSave_03A83F3E46B1977A9DF830A3508AD44F) == 0x000008, "Wrong alignment on Map_SP_M03_Objectives_C_ExecLatentFromSave_03A83F3E46B1977A9DF830A3508AD44F");
static_assert(sizeof(Map_SP_M03_Objectives_C_ExecLatentFromSave_03A83F3E46B1977A9DF830A3508AD44F) == 0x000020, "Wrong size on Map_SP_M03_Objectives_C_ExecLatentFromSave_03A83F3E46B1977A9DF830A3508AD44F");
static_assert(offsetof(Map_SP_M03_Objectives_C_ExecLatentFromSave_03A83F3E46B1977A9DF830A3508AD44F, SaveInfo) == 0x000000, "Member 'Map_SP_M03_Objectives_C_ExecLatentFromSave_03A83F3E46B1977A9DF830A3508AD44F::SaveInfo' has a wrong offset!");

// Function Map_SP_M03_Objectives.Map_SP_M03_Objectives_C.ExecLatentFromSave_03A83F3E46B1977A9DF830A39CA2156F
// 0x0020 (0x0020 - 0x0000)
struct Map_SP_M03_Objectives_C_ExecLatentFromSave_03A83F3E46B1977A9DF830A39CA2156F final
{
public:
	struct FLatentActionSaveGameData              SaveInfo;                                          // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(Map_SP_M03_Objectives_C_ExecLatentFromSave_03A83F3E46B1977A9DF830A39CA2156F) == 0x000008, "Wrong alignment on Map_SP_M03_Objectives_C_ExecLatentFromSave_03A83F3E46B1977A9DF830A39CA2156F");
static_assert(sizeof(Map_SP_M03_Objectives_C_ExecLatentFromSave_03A83F3E46B1977A9DF830A39CA2156F) == 0x000020, "Wrong size on Map_SP_M03_Objectives_C_ExecLatentFromSave_03A83F3E46B1977A9DF830A39CA2156F");
static_assert(offsetof(Map_SP_M03_Objectives_C_ExecLatentFromSave_03A83F3E46B1977A9DF830A39CA2156F, SaveInfo) == 0x000000, "Member 'Map_SP_M03_Objectives_C_ExecLatentFromSave_03A83F3E46B1977A9DF830A39CA2156F::SaveInfo' has a wrong offset!");

// Function Map_SP_M03_Objectives.Map_SP_M03_Objectives_C.ExecLatentFromSave_03A83F3E46B1977A9DF830A3FEDD71C5
// 0x0020 (0x0020 - 0x0000)
struct Map_SP_M03_Objectives_C_ExecLatentFromSave_03A83F3E46B1977A9DF830A3FEDD71C5 final
{
public:
	struct FLatentActionSaveGameData              SaveInfo;                                          // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(Map_SP_M03_Objectives_C_ExecLatentFromSave_03A83F3E46B1977A9DF830A3FEDD71C5) == 0x000008, "Wrong alignment on Map_SP_M03_Objectives_C_ExecLatentFromSave_03A83F3E46B1977A9DF830A3FEDD71C5");
static_assert(sizeof(Map_SP_M03_Objectives_C_ExecLatentFromSave_03A83F3E46B1977A9DF830A3FEDD71C5) == 0x000020, "Wrong size on Map_SP_M03_Objectives_C_ExecLatentFromSave_03A83F3E46B1977A9DF830A3FEDD71C5");
static_assert(offsetof(Map_SP_M03_Objectives_C_ExecLatentFromSave_03A83F3E46B1977A9DF830A3FEDD71C5, SaveInfo) == 0x000000, "Member 'Map_SP_M03_Objectives_C_ExecLatentFromSave_03A83F3E46B1977A9DF830A3FEDD71C5::SaveInfo' has a wrong offset!");

// Function Map_SP_M03_Objectives.Map_SP_M03_Objectives_C.ExecLatentFromSave_0468FFDA46144A104DEFF9BD34C6D4C3
// 0x0020 (0x0020 - 0x0000)
struct Map_SP_M03_Objectives_C_ExecLatentFromSave_0468FFDA46144A104DEFF9BD34C6D4C3 final
{
public:
	struct FLatentActionSaveGameData              SaveInfo;                                          // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(Map_SP_M03_Objectives_C_ExecLatentFromSave_0468FFDA46144A104DEFF9BD34C6D4C3) == 0x000008, "Wrong alignment on Map_SP_M03_Objectives_C_ExecLatentFromSave_0468FFDA46144A104DEFF9BD34C6D4C3");
static_assert(sizeof(Map_SP_M03_Objectives_C_ExecLatentFromSave_0468FFDA46144A104DEFF9BD34C6D4C3) == 0x000020, "Wrong size on Map_SP_M03_Objectives_C_ExecLatentFromSave_0468FFDA46144A104DEFF9BD34C6D4C3");
static_assert(offsetof(Map_SP_M03_Objectives_C_ExecLatentFromSave_0468FFDA46144A104DEFF9BD34C6D4C3, SaveInfo) == 0x000000, "Member 'Map_SP_M03_Objectives_C_ExecLatentFromSave_0468FFDA46144A104DEFF9BD34C6D4C3::SaveInfo' has a wrong offset!");

// Function Map_SP_M03_Objectives.Map_SP_M03_Objectives_C.ExecLatentFromSave_0868C9C246E2E597D8B510AC3A0E7022
// 0x0020 (0x0020 - 0x0000)
struct Map_SP_M03_Objectives_C_ExecLatentFromSave_0868C9C246E2E597D8B510AC3A0E7022 final
{
public:
	struct FLatentActionSaveGameData              LatentSaveGameData;                                // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(Map_SP_M03_Objectives_C_ExecLatentFromSave_0868C9C246E2E597D8B510AC3A0E7022) == 0x000008, "Wrong alignment on Map_SP_M03_Objectives_C_ExecLatentFromSave_0868C9C246E2E597D8B510AC3A0E7022");
static_assert(sizeof(Map_SP_M03_Objectives_C_ExecLatentFromSave_0868C9C246E2E597D8B510AC3A0E7022) == 0x000020, "Wrong size on Map_SP_M03_Objectives_C_ExecLatentFromSave_0868C9C246E2E597D8B510AC3A0E7022");
static_assert(offsetof(Map_SP_M03_Objectives_C_ExecLatentFromSave_0868C9C246E2E597D8B510AC3A0E7022, LatentSaveGameData) == 0x000000, "Member 'Map_SP_M03_Objectives_C_ExecLatentFromSave_0868C9C246E2E597D8B510AC3A0E7022::LatentSaveGameData' has a wrong offset!");

// Function Map_SP_M03_Objectives.Map_SP_M03_Objectives_C.ExecLatentFromSave_098D0C2846A5D5E9F65EFB8A999C6D4D
// 0x0020 (0x0020 - 0x0000)
struct Map_SP_M03_Objectives_C_ExecLatentFromSave_098D0C2846A5D5E9F65EFB8A999C6D4D final
{
public:
	struct FLatentActionSaveGameData              LatentSaveGameData;                                // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(Map_SP_M03_Objectives_C_ExecLatentFromSave_098D0C2846A5D5E9F65EFB8A999C6D4D) == 0x000008, "Wrong alignment on Map_SP_M03_Objectives_C_ExecLatentFromSave_098D0C2846A5D5E9F65EFB8A999C6D4D");
static_assert(sizeof(Map_SP_M03_Objectives_C_ExecLatentFromSave_098D0C2846A5D5E9F65EFB8A999C6D4D) == 0x000020, "Wrong size on Map_SP_M03_Objectives_C_ExecLatentFromSave_098D0C2846A5D5E9F65EFB8A999C6D4D");
static_assert(offsetof(Map_SP_M03_Objectives_C_ExecLatentFromSave_098D0C2846A5D5E9F65EFB8A999C6D4D, LatentSaveGameData) == 0x000000, "Member 'Map_SP_M03_Objectives_C_ExecLatentFromSave_098D0C2846A5D5E9F65EFB8A999C6D4D::LatentSaveGameData' has a wrong offset!");

// Function Map_SP_M03_Objectives.Map_SP_M03_Objectives_C.ExecLatentFromSave_0A7D6D974F7586F3AD0914B51EB355DC
// 0x0020 (0x0020 - 0x0000)
struct Map_SP_M03_Objectives_C_ExecLatentFromSave_0A7D6D974F7586F3AD0914B51EB355DC final
{
public:
	struct FLatentActionSaveGameData              LatentSaveGameData;                                // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(Map_SP_M03_Objectives_C_ExecLatentFromSave_0A7D6D974F7586F3AD0914B51EB355DC) == 0x000008, "Wrong alignment on Map_SP_M03_Objectives_C_ExecLatentFromSave_0A7D6D974F7586F3AD0914B51EB355DC");
static_assert(sizeof(Map_SP_M03_Objectives_C_ExecLatentFromSave_0A7D6D974F7586F3AD0914B51EB355DC) == 0x000020, "Wrong size on Map_SP_M03_Objectives_C_ExecLatentFromSave_0A7D6D974F7586F3AD0914B51EB355DC");
static_assert(offsetof(Map_SP_M03_Objectives_C_ExecLatentFromSave_0A7D6D974F7586F3AD0914B51EB355DC, LatentSaveGameData) == 0x000000, "Member 'Map_SP_M03_Objectives_C_ExecLatentFromSave_0A7D6D974F7586F3AD0914B51EB355DC::LatentSaveGameData' has a wrong offset!");

// Function Map_SP_M03_Objectives.Map_SP_M03_Objectives_C.ExecLatentFromSave_0AFBC4D94DFCBACC8DABE58A313B9DEB
// 0x0020 (0x0020 - 0x0000)
struct Map_SP_M03_Objectives_C_ExecLatentFromSave_0AFBC4D94DFCBACC8DABE58A313B9DEB final
{
public:
	struct FLatentActionSaveGameData              SaveInfo;                                          // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(Map_SP_M03_Objectives_C_ExecLatentFromSave_0AFBC4D94DFCBACC8DABE58A313B9DEB) == 0x000008, "Wrong alignment on Map_SP_M03_Objectives_C_ExecLatentFromSave_0AFBC4D94DFCBACC8DABE58A313B9DEB");
static_assert(sizeof(Map_SP_M03_Objectives_C_ExecLatentFromSave_0AFBC4D94DFCBACC8DABE58A313B9DEB) == 0x000020, "Wrong size on Map_SP_M03_Objectives_C_ExecLatentFromSave_0AFBC4D94DFCBACC8DABE58A313B9DEB");
static_assert(offsetof(Map_SP_M03_Objectives_C_ExecLatentFromSave_0AFBC4D94DFCBACC8DABE58A313B9DEB, SaveInfo) == 0x000000, "Member 'Map_SP_M03_Objectives_C_ExecLatentFromSave_0AFBC4D94DFCBACC8DABE58A313B9DEB::SaveInfo' has a wrong offset!");

// Function Map_SP_M03_Objectives.Map_SP_M03_Objectives_C.ExecLatentFromSave_0CACC6324969BAD5145C288750622542
// 0x0020 (0x0020 - 0x0000)
struct Map_SP_M03_Objectives_C_ExecLatentFromSave_0CACC6324969BAD5145C288750622542 final
{
public:
	struct FLatentActionSaveGameData              LatentSaveGameData;                                // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(Map_SP_M03_Objectives_C_ExecLatentFromSave_0CACC6324969BAD5145C288750622542) == 0x000008, "Wrong alignment on Map_SP_M03_Objectives_C_ExecLatentFromSave_0CACC6324969BAD5145C288750622542");
static_assert(sizeof(Map_SP_M03_Objectives_C_ExecLatentFromSave_0CACC6324969BAD5145C288750622542) == 0x000020, "Wrong size on Map_SP_M03_Objectives_C_ExecLatentFromSave_0CACC6324969BAD5145C288750622542");
static_assert(offsetof(Map_SP_M03_Objectives_C_ExecLatentFromSave_0CACC6324969BAD5145C288750622542, LatentSaveGameData) == 0x000000, "Member 'Map_SP_M03_Objectives_C_ExecLatentFromSave_0CACC6324969BAD5145C288750622542::LatentSaveGameData' has a wrong offset!");

// Function Map_SP_M03_Objectives.Map_SP_M03_Objectives_C.ExecLatentFromSave_0D0E41304B6EF28717A81EB3BF93FB48
// 0x0020 (0x0020 - 0x0000)
struct Map_SP_M03_Objectives_C_ExecLatentFromSave_0D0E41304B6EF28717A81EB3BF93FB48 final
{
public:
	struct FLatentActionSaveGameData              LatentSaveGameData;                                // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(Map_SP_M03_Objectives_C_ExecLatentFromSave_0D0E41304B6EF28717A81EB3BF93FB48) == 0x000008, "Wrong alignment on Map_SP_M03_Objectives_C_ExecLatentFromSave_0D0E41304B6EF28717A81EB3BF93FB48");
static_assert(sizeof(Map_SP_M03_Objectives_C_ExecLatentFromSave_0D0E41304B6EF28717A81EB3BF93FB48) == 0x000020, "Wrong size on Map_SP_M03_Objectives_C_ExecLatentFromSave_0D0E41304B6EF28717A81EB3BF93FB48");
static_assert(offsetof(Map_SP_M03_Objectives_C_ExecLatentFromSave_0D0E41304B6EF28717A81EB3BF93FB48, LatentSaveGameData) == 0x000000, "Member 'Map_SP_M03_Objectives_C_ExecLatentFromSave_0D0E41304B6EF28717A81EB3BF93FB48::LatentSaveGameData' has a wrong offset!");

// Function Map_SP_M03_Objectives.Map_SP_M03_Objectives_C.ExecLatentFromSave_0D56538047E1025E3D2A6B979F53285F
// 0x0020 (0x0020 - 0x0000)
struct Map_SP_M03_Objectives_C_ExecLatentFromSave_0D56538047E1025E3D2A6B979F53285F final
{
public:
	struct FLatentActionSaveGameData              SaveInfo;                                          // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(Map_SP_M03_Objectives_C_ExecLatentFromSave_0D56538047E1025E3D2A6B979F53285F) == 0x000008, "Wrong alignment on Map_SP_M03_Objectives_C_ExecLatentFromSave_0D56538047E1025E3D2A6B979F53285F");
static_assert(sizeof(Map_SP_M03_Objectives_C_ExecLatentFromSave_0D56538047E1025E3D2A6B979F53285F) == 0x000020, "Wrong size on Map_SP_M03_Objectives_C_ExecLatentFromSave_0D56538047E1025E3D2A6B979F53285F");
static_assert(offsetof(Map_SP_M03_Objectives_C_ExecLatentFromSave_0D56538047E1025E3D2A6B979F53285F, SaveInfo) == 0x000000, "Member 'Map_SP_M03_Objectives_C_ExecLatentFromSave_0D56538047E1025E3D2A6B979F53285F::SaveInfo' has a wrong offset!");

// Function Map_SP_M03_Objectives.Map_SP_M03_Objectives_C.ExecLatentFromSave_1067B99C44179BC66F43E4BD970BF352
// 0x0020 (0x0020 - 0x0000)
struct Map_SP_M03_Objectives_C_ExecLatentFromSave_1067B99C44179BC66F43E4BD970BF352 final
{
public:
	struct FLatentActionSaveGameData              LatentSaveGameData;                                // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(Map_SP_M03_Objectives_C_ExecLatentFromSave_1067B99C44179BC66F43E4BD970BF352) == 0x000008, "Wrong alignment on Map_SP_M03_Objectives_C_ExecLatentFromSave_1067B99C44179BC66F43E4BD970BF352");
static_assert(sizeof(Map_SP_M03_Objectives_C_ExecLatentFromSave_1067B99C44179BC66F43E4BD970BF352) == 0x000020, "Wrong size on Map_SP_M03_Objectives_C_ExecLatentFromSave_1067B99C44179BC66F43E4BD970BF352");
static_assert(offsetof(Map_SP_M03_Objectives_C_ExecLatentFromSave_1067B99C44179BC66F43E4BD970BF352, LatentSaveGameData) == 0x000000, "Member 'Map_SP_M03_Objectives_C_ExecLatentFromSave_1067B99C44179BC66F43E4BD970BF352::LatentSaveGameData' has a wrong offset!");

// Function Map_SP_M03_Objectives.Map_SP_M03_Objectives_C.ExecLatentFromSave_107C8A014F44E88830D978B2631FF916
// 0x0020 (0x0020 - 0x0000)
struct Map_SP_M03_Objectives_C_ExecLatentFromSave_107C8A014F44E88830D978B2631FF916 final
{
public:
	struct FLatentActionSaveGameData              SaveInfo;                                          // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(Map_SP_M03_Objectives_C_ExecLatentFromSave_107C8A014F44E88830D978B2631FF916) == 0x000008, "Wrong alignment on Map_SP_M03_Objectives_C_ExecLatentFromSave_107C8A014F44E88830D978B2631FF916");
static_assert(sizeof(Map_SP_M03_Objectives_C_ExecLatentFromSave_107C8A014F44E88830D978B2631FF916) == 0x000020, "Wrong size on Map_SP_M03_Objectives_C_ExecLatentFromSave_107C8A014F44E88830D978B2631FF916");
static_assert(offsetof(Map_SP_M03_Objectives_C_ExecLatentFromSave_107C8A014F44E88830D978B2631FF916, SaveInfo) == 0x000000, "Member 'Map_SP_M03_Objectives_C_ExecLatentFromSave_107C8A014F44E88830D978B2631FF916::SaveInfo' has a wrong offset!");

// Function Map_SP_M03_Objectives.Map_SP_M03_Objectives_C.ExecLatentFromSave_10EA04584A6044AE3098589251F15EB9
// 0x0020 (0x0020 - 0x0000)
struct Map_SP_M03_Objectives_C_ExecLatentFromSave_10EA04584A6044AE3098589251F15EB9 final
{
public:
	struct FLatentActionSaveGameData              SaveInfo;                                          // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(Map_SP_M03_Objectives_C_ExecLatentFromSave_10EA04584A6044AE3098589251F15EB9) == 0x000008, "Wrong alignment on Map_SP_M03_Objectives_C_ExecLatentFromSave_10EA04584A6044AE3098589251F15EB9");
static_assert(sizeof(Map_SP_M03_Objectives_C_ExecLatentFromSave_10EA04584A6044AE3098589251F15EB9) == 0x000020, "Wrong size on Map_SP_M03_Objectives_C_ExecLatentFromSave_10EA04584A6044AE3098589251F15EB9");
static_assert(offsetof(Map_SP_M03_Objectives_C_ExecLatentFromSave_10EA04584A6044AE3098589251F15EB9, SaveInfo) == 0x000000, "Member 'Map_SP_M03_Objectives_C_ExecLatentFromSave_10EA04584A6044AE3098589251F15EB9::SaveInfo' has a wrong offset!");

// Function Map_SP_M03_Objectives.Map_SP_M03_Objectives_C.ExecLatentFromSave_10EA04584A6044AE30985892781739E3
// 0x0020 (0x0020 - 0x0000)
struct Map_SP_M03_Objectives_C_ExecLatentFromSave_10EA04584A6044AE30985892781739E3 final
{
public:
	struct FLatentActionSaveGameData              SaveInfo;                                          // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(Map_SP_M03_Objectives_C_ExecLatentFromSave_10EA04584A6044AE30985892781739E3) == 0x000008, "Wrong alignment on Map_SP_M03_Objectives_C_ExecLatentFromSave_10EA04584A6044AE30985892781739E3");
static_assert(sizeof(Map_SP_M03_Objectives_C_ExecLatentFromSave_10EA04584A6044AE30985892781739E3) == 0x000020, "Wrong size on Map_SP_M03_Objectives_C_ExecLatentFromSave_10EA04584A6044AE30985892781739E3");
static_assert(offsetof(Map_SP_M03_Objectives_C_ExecLatentFromSave_10EA04584A6044AE30985892781739E3, SaveInfo) == 0x000000, "Member 'Map_SP_M03_Objectives_C_ExecLatentFromSave_10EA04584A6044AE30985892781739E3::SaveInfo' has a wrong offset!");

// Function Map_SP_M03_Objectives.Map_SP_M03_Objectives_C.ExecLatentFromSave_10EA04584A6044AE309858928E478EB1
// 0x0020 (0x0020 - 0x0000)
struct Map_SP_M03_Objectives_C_ExecLatentFromSave_10EA04584A6044AE309858928E478EB1 final
{
public:
	struct FLatentActionSaveGameData              SaveInfo;                                          // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(Map_SP_M03_Objectives_C_ExecLatentFromSave_10EA04584A6044AE309858928E478EB1) == 0x000008, "Wrong alignment on Map_SP_M03_Objectives_C_ExecLatentFromSave_10EA04584A6044AE309858928E478EB1");
static_assert(sizeof(Map_SP_M03_Objectives_C_ExecLatentFromSave_10EA04584A6044AE309858928E478EB1) == 0x000020, "Wrong size on Map_SP_M03_Objectives_C_ExecLatentFromSave_10EA04584A6044AE309858928E478EB1");
static_assert(offsetof(Map_SP_M03_Objectives_C_ExecLatentFromSave_10EA04584A6044AE309858928E478EB1, SaveInfo) == 0x000000, "Member 'Map_SP_M03_Objectives_C_ExecLatentFromSave_10EA04584A6044AE309858928E478EB1::SaveInfo' has a wrong offset!");

// Function Map_SP_M03_Objectives.Map_SP_M03_Objectives_C.ExecLatentFromSave_10EA04584A6044AE3098589294885C6D
// 0x0020 (0x0020 - 0x0000)
struct Map_SP_M03_Objectives_C_ExecLatentFromSave_10EA04584A6044AE3098589294885C6D final
{
public:
	struct FLatentActionSaveGameData              SaveInfo;                                          // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(Map_SP_M03_Objectives_C_ExecLatentFromSave_10EA04584A6044AE3098589294885C6D) == 0x000008, "Wrong alignment on Map_SP_M03_Objectives_C_ExecLatentFromSave_10EA04584A6044AE3098589294885C6D");
static_assert(sizeof(Map_SP_M03_Objectives_C_ExecLatentFromSave_10EA04584A6044AE3098589294885C6D) == 0x000020, "Wrong size on Map_SP_M03_Objectives_C_ExecLatentFromSave_10EA04584A6044AE3098589294885C6D");
static_assert(offsetof(Map_SP_M03_Objectives_C_ExecLatentFromSave_10EA04584A6044AE3098589294885C6D, SaveInfo) == 0x000000, "Member 'Map_SP_M03_Objectives_C_ExecLatentFromSave_10EA04584A6044AE3098589294885C6D::SaveInfo' has a wrong offset!");

// Function Map_SP_M03_Objectives.Map_SP_M03_Objectives_C.ExecLatentFromSave_1150EF0C4D4A03042B77B69A43951095
// 0x0020 (0x0020 - 0x0000)
struct Map_SP_M03_Objectives_C_ExecLatentFromSave_1150EF0C4D4A03042B77B69A43951095 final
{
public:
	struct FLatentActionSaveGameData              LatentSaveGameData;                                // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(Map_SP_M03_Objectives_C_ExecLatentFromSave_1150EF0C4D4A03042B77B69A43951095) == 0x000008, "Wrong alignment on Map_SP_M03_Objectives_C_ExecLatentFromSave_1150EF0C4D4A03042B77B69A43951095");
static_assert(sizeof(Map_SP_M03_Objectives_C_ExecLatentFromSave_1150EF0C4D4A03042B77B69A43951095) == 0x000020, "Wrong size on Map_SP_M03_Objectives_C_ExecLatentFromSave_1150EF0C4D4A03042B77B69A43951095");
static_assert(offsetof(Map_SP_M03_Objectives_C_ExecLatentFromSave_1150EF0C4D4A03042B77B69A43951095, LatentSaveGameData) == 0x000000, "Member 'Map_SP_M03_Objectives_C_ExecLatentFromSave_1150EF0C4D4A03042B77B69A43951095::LatentSaveGameData' has a wrong offset!");

// Function Map_SP_M03_Objectives.Map_SP_M03_Objectives_C.ExecLatentFromSave_1150EF0C4D4A03042B77B69A6A7377CF
// 0x0020 (0x0020 - 0x0000)
struct Map_SP_M03_Objectives_C_ExecLatentFromSave_1150EF0C4D4A03042B77B69A6A7377CF final
{
public:
	struct FLatentActionSaveGameData              LatentSaveGameData;                                // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(Map_SP_M03_Objectives_C_ExecLatentFromSave_1150EF0C4D4A03042B77B69A6A7377CF) == 0x000008, "Wrong alignment on Map_SP_M03_Objectives_C_ExecLatentFromSave_1150EF0C4D4A03042B77B69A6A7377CF");
static_assert(sizeof(Map_SP_M03_Objectives_C_ExecLatentFromSave_1150EF0C4D4A03042B77B69A6A7377CF) == 0x000020, "Wrong size on Map_SP_M03_Objectives_C_ExecLatentFromSave_1150EF0C4D4A03042B77B69A6A7377CF");
static_assert(offsetof(Map_SP_M03_Objectives_C_ExecLatentFromSave_1150EF0C4D4A03042B77B69A6A7377CF, LatentSaveGameData) == 0x000000, "Member 'Map_SP_M03_Objectives_C_ExecLatentFromSave_1150EF0C4D4A03042B77B69A6A7377CF::LatentSaveGameData' has a wrong offset!");

// Function Map_SP_M03_Objectives.Map_SP_M03_Objectives_C.ExecLatentFromSave_1150EF0C4D4A03042B77B69A86EC1241
// 0x0020 (0x0020 - 0x0000)
struct Map_SP_M03_Objectives_C_ExecLatentFromSave_1150EF0C4D4A03042B77B69A86EC1241 final
{
public:
	struct FLatentActionSaveGameData              LatentSaveGameData;                                // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(Map_SP_M03_Objectives_C_ExecLatentFromSave_1150EF0C4D4A03042B77B69A86EC1241) == 0x000008, "Wrong alignment on Map_SP_M03_Objectives_C_ExecLatentFromSave_1150EF0C4D4A03042B77B69A86EC1241");
static_assert(sizeof(Map_SP_M03_Objectives_C_ExecLatentFromSave_1150EF0C4D4A03042B77B69A86EC1241) == 0x000020, "Wrong size on Map_SP_M03_Objectives_C_ExecLatentFromSave_1150EF0C4D4A03042B77B69A86EC1241");
static_assert(offsetof(Map_SP_M03_Objectives_C_ExecLatentFromSave_1150EF0C4D4A03042B77B69A86EC1241, LatentSaveGameData) == 0x000000, "Member 'Map_SP_M03_Objectives_C_ExecLatentFromSave_1150EF0C4D4A03042B77B69A86EC1241::LatentSaveGameData' has a wrong offset!");

// Function Map_SP_M03_Objectives.Map_SP_M03_Objectives_C.ExecLatentFromSave_1150EF0C4D4A03042B77B69A9C23C09D
// 0x0020 (0x0020 - 0x0000)
struct Map_SP_M03_Objectives_C_ExecLatentFromSave_1150EF0C4D4A03042B77B69A9C23C09D final
{
public:
	struct FLatentActionSaveGameData              LatentSaveGameData;                                // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(Map_SP_M03_Objectives_C_ExecLatentFromSave_1150EF0C4D4A03042B77B69A9C23C09D) == 0x000008, "Wrong alignment on Map_SP_M03_Objectives_C_ExecLatentFromSave_1150EF0C4D4A03042B77B69A9C23C09D");
static_assert(sizeof(Map_SP_M03_Objectives_C_ExecLatentFromSave_1150EF0C4D4A03042B77B69A9C23C09D) == 0x000020, "Wrong size on Map_SP_M03_Objectives_C_ExecLatentFromSave_1150EF0C4D4A03042B77B69A9C23C09D");
static_assert(offsetof(Map_SP_M03_Objectives_C_ExecLatentFromSave_1150EF0C4D4A03042B77B69A9C23C09D, LatentSaveGameData) == 0x000000, "Member 'Map_SP_M03_Objectives_C_ExecLatentFromSave_1150EF0C4D4A03042B77B69A9C23C09D::LatentSaveGameData' has a wrong offset!");

// Function Map_SP_M03_Objectives.Map_SP_M03_Objectives_C.ExecLatentFromSave_11957B8141C612E1A436849363ABDAAE
// 0x0020 (0x0020 - 0x0000)
struct Map_SP_M03_Objectives_C_ExecLatentFromSave_11957B8141C612E1A436849363ABDAAE final
{
public:
	struct FLatentActionSaveGameData              SaveInfo;                                          // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(Map_SP_M03_Objectives_C_ExecLatentFromSave_11957B8141C612E1A436849363ABDAAE) == 0x000008, "Wrong alignment on Map_SP_M03_Objectives_C_ExecLatentFromSave_11957B8141C612E1A436849363ABDAAE");
static_assert(sizeof(Map_SP_M03_Objectives_C_ExecLatentFromSave_11957B8141C612E1A436849363ABDAAE) == 0x000020, "Wrong size on Map_SP_M03_Objectives_C_ExecLatentFromSave_11957B8141C612E1A436849363ABDAAE");
static_assert(offsetof(Map_SP_M03_Objectives_C_ExecLatentFromSave_11957B8141C612E1A436849363ABDAAE, SaveInfo) == 0x000000, "Member 'Map_SP_M03_Objectives_C_ExecLatentFromSave_11957B8141C612E1A436849363ABDAAE::SaveInfo' has a wrong offset!");

// Function Map_SP_M03_Objectives.Map_SP_M03_Objectives_C.ExecLatentFromSave_11B39B304AF1E7DC6478F38FF7CFFF4C
// 0x0020 (0x0020 - 0x0000)
struct Map_SP_M03_Objectives_C_ExecLatentFromSave_11B39B304AF1E7DC6478F38FF7CFFF4C final
{
public:
	struct FLatentActionSaveGameData              LatentSaveGameData;                                // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(Map_SP_M03_Objectives_C_ExecLatentFromSave_11B39B304AF1E7DC6478F38FF7CFFF4C) == 0x000008, "Wrong alignment on Map_SP_M03_Objectives_C_ExecLatentFromSave_11B39B304AF1E7DC6478F38FF7CFFF4C");
static_assert(sizeof(Map_SP_M03_Objectives_C_ExecLatentFromSave_11B39B304AF1E7DC6478F38FF7CFFF4C) == 0x000020, "Wrong size on Map_SP_M03_Objectives_C_ExecLatentFromSave_11B39B304AF1E7DC6478F38FF7CFFF4C");
static_assert(offsetof(Map_SP_M03_Objectives_C_ExecLatentFromSave_11B39B304AF1E7DC6478F38FF7CFFF4C, LatentSaveGameData) == 0x000000, "Member 'Map_SP_M03_Objectives_C_ExecLatentFromSave_11B39B304AF1E7DC6478F38FF7CFFF4C::LatentSaveGameData' has a wrong offset!");

// Function Map_SP_M03_Objectives.Map_SP_M03_Objectives_C.ExecLatentFromSave_12558DD54B7B9F3668FAC4B04E241940
// 0x0020 (0x0020 - 0x0000)
struct Map_SP_M03_Objectives_C_ExecLatentFromSave_12558DD54B7B9F3668FAC4B04E241940 final
{
public:
	struct FLatentActionSaveGameData              SaveInfo;                                          // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(Map_SP_M03_Objectives_C_ExecLatentFromSave_12558DD54B7B9F3668FAC4B04E241940) == 0x000008, "Wrong alignment on Map_SP_M03_Objectives_C_ExecLatentFromSave_12558DD54B7B9F3668FAC4B04E241940");
static_assert(sizeof(Map_SP_M03_Objectives_C_ExecLatentFromSave_12558DD54B7B9F3668FAC4B04E241940) == 0x000020, "Wrong size on Map_SP_M03_Objectives_C_ExecLatentFromSave_12558DD54B7B9F3668FAC4B04E241940");
static_assert(offsetof(Map_SP_M03_Objectives_C_ExecLatentFromSave_12558DD54B7B9F3668FAC4B04E241940, SaveInfo) == 0x000000, "Member 'Map_SP_M03_Objectives_C_ExecLatentFromSave_12558DD54B7B9F3668FAC4B04E241940::SaveInfo' has a wrong offset!");

// Function Map_SP_M03_Objectives.Map_SP_M03_Objectives_C.ExecLatentFromSave_12D097E64D2FB9841FEF1BAAC09A5251
// 0x0020 (0x0020 - 0x0000)
struct Map_SP_M03_Objectives_C_ExecLatentFromSave_12D097E64D2FB9841FEF1BAAC09A5251 final
{
public:
	struct FLatentActionSaveGameData              LatentSaveGameData;                                // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(Map_SP_M03_Objectives_C_ExecLatentFromSave_12D097E64D2FB9841FEF1BAAC09A5251) == 0x000008, "Wrong alignment on Map_SP_M03_Objectives_C_ExecLatentFromSave_12D097E64D2FB9841FEF1BAAC09A5251");
static_assert(sizeof(Map_SP_M03_Objectives_C_ExecLatentFromSave_12D097E64D2FB9841FEF1BAAC09A5251) == 0x000020, "Wrong size on Map_SP_M03_Objectives_C_ExecLatentFromSave_12D097E64D2FB9841FEF1BAAC09A5251");
static_assert(offsetof(Map_SP_M03_Objectives_C_ExecLatentFromSave_12D097E64D2FB9841FEF1BAAC09A5251, LatentSaveGameData) == 0x000000, "Member 'Map_SP_M03_Objectives_C_ExecLatentFromSave_12D097E64D2FB9841FEF1BAAC09A5251::LatentSaveGameData' has a wrong offset!");

// Function Map_SP_M03_Objectives.Map_SP_M03_Objectives_C.ExecLatentFromSave_13769EBC4ED83C5AF035158E9ADCA102
// 0x0020 (0x0020 - 0x0000)
struct Map_SP_M03_Objectives_C_ExecLatentFromSave_13769EBC4ED83C5AF035158E9ADCA102 final
{
public:
	struct FLatentActionSaveGameData              SaveInfo;                                          // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(Map_SP_M03_Objectives_C_ExecLatentFromSave_13769EBC4ED83C5AF035158E9ADCA102) == 0x000008, "Wrong alignment on Map_SP_M03_Objectives_C_ExecLatentFromSave_13769EBC4ED83C5AF035158E9ADCA102");
static_assert(sizeof(Map_SP_M03_Objectives_C_ExecLatentFromSave_13769EBC4ED83C5AF035158E9ADCA102) == 0x000020, "Wrong size on Map_SP_M03_Objectives_C_ExecLatentFromSave_13769EBC4ED83C5AF035158E9ADCA102");
static_assert(offsetof(Map_SP_M03_Objectives_C_ExecLatentFromSave_13769EBC4ED83C5AF035158E9ADCA102, SaveInfo) == 0x000000, "Member 'Map_SP_M03_Objectives_C_ExecLatentFromSave_13769EBC4ED83C5AF035158E9ADCA102::SaveInfo' has a wrong offset!");

// Function Map_SP_M03_Objectives.Map_SP_M03_Objectives_C.ExecLatentFromSave_1380A73B40BAE8B090DF8380C4BB32A1
// 0x0020 (0x0020 - 0x0000)
struct Map_SP_M03_Objectives_C_ExecLatentFromSave_1380A73B40BAE8B090DF8380C4BB32A1 final
{
public:
	struct FLatentActionSaveGameData              SaveInfo;                                          // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(Map_SP_M03_Objectives_C_ExecLatentFromSave_1380A73B40BAE8B090DF8380C4BB32A1) == 0x000008, "Wrong alignment on Map_SP_M03_Objectives_C_ExecLatentFromSave_1380A73B40BAE8B090DF8380C4BB32A1");
static_assert(sizeof(Map_SP_M03_Objectives_C_ExecLatentFromSave_1380A73B40BAE8B090DF8380C4BB32A1) == 0x000020, "Wrong size on Map_SP_M03_Objectives_C_ExecLatentFromSave_1380A73B40BAE8B090DF8380C4BB32A1");
static_assert(offsetof(Map_SP_M03_Objectives_C_ExecLatentFromSave_1380A73B40BAE8B090DF8380C4BB32A1, SaveInfo) == 0x000000, "Member 'Map_SP_M03_Objectives_C_ExecLatentFromSave_1380A73B40BAE8B090DF8380C4BB32A1::SaveInfo' has a wrong offset!");

// Function Map_SP_M03_Objectives.Map_SP_M03_Objectives_C.ExecLatentFromSave_139A4A86464B9FE5DE08C7BA73CAB9C1
// 0x0020 (0x0020 - 0x0000)
struct Map_SP_M03_Objectives_C_ExecLatentFromSave_139A4A86464B9FE5DE08C7BA73CAB9C1 final
{
public:
	struct FLatentActionSaveGameData              SaveInfo;                                          // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(Map_SP_M03_Objectives_C_ExecLatentFromSave_139A4A86464B9FE5DE08C7BA73CAB9C1) == 0x000008, "Wrong alignment on Map_SP_M03_Objectives_C_ExecLatentFromSave_139A4A86464B9FE5DE08C7BA73CAB9C1");
static_assert(sizeof(Map_SP_M03_Objectives_C_ExecLatentFromSave_139A4A86464B9FE5DE08C7BA73CAB9C1) == 0x000020, "Wrong size on Map_SP_M03_Objectives_C_ExecLatentFromSave_139A4A86464B9FE5DE08C7BA73CAB9C1");
static_assert(offsetof(Map_SP_M03_Objectives_C_ExecLatentFromSave_139A4A86464B9FE5DE08C7BA73CAB9C1, SaveInfo) == 0x000000, "Member 'Map_SP_M03_Objectives_C_ExecLatentFromSave_139A4A86464B9FE5DE08C7BA73CAB9C1::SaveInfo' has a wrong offset!");

// Function Map_SP_M03_Objectives.Map_SP_M03_Objectives_C.ExecLatentFromSave_1442CD444372E42BAF2976BFC69DD5DC
// 0x0020 (0x0020 - 0x0000)
struct Map_SP_M03_Objectives_C_ExecLatentFromSave_1442CD444372E42BAF2976BFC69DD5DC final
{
public:
	struct FLatentActionSaveGameData              LatentSaveGameData;                                // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(Map_SP_M03_Objectives_C_ExecLatentFromSave_1442CD444372E42BAF2976BFC69DD5DC) == 0x000008, "Wrong alignment on Map_SP_M03_Objectives_C_ExecLatentFromSave_1442CD444372E42BAF2976BFC69DD5DC");
static_assert(sizeof(Map_SP_M03_Objectives_C_ExecLatentFromSave_1442CD444372E42BAF2976BFC69DD5DC) == 0x000020, "Wrong size on Map_SP_M03_Objectives_C_ExecLatentFromSave_1442CD444372E42BAF2976BFC69DD5DC");
static_assert(offsetof(Map_SP_M03_Objectives_C_ExecLatentFromSave_1442CD444372E42BAF2976BFC69DD5DC, LatentSaveGameData) == 0x000000, "Member 'Map_SP_M03_Objectives_C_ExecLatentFromSave_1442CD444372E42BAF2976BFC69DD5DC::LatentSaveGameData' has a wrong offset!");

// Function Map_SP_M03_Objectives.Map_SP_M03_Objectives_C.ExecLatentFromSave_168B954F4F7B4FA997C0ECBD58B06C62
// 0x0020 (0x0020 - 0x0000)
struct Map_SP_M03_Objectives_C_ExecLatentFromSave_168B954F4F7B4FA997C0ECBD58B06C62 final
{
public:
	struct FLatentActionSaveGameData              LatentSaveGameData;                                // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(Map_SP_M03_Objectives_C_ExecLatentFromSave_168B954F4F7B4FA997C0ECBD58B06C62) == 0x000008, "Wrong alignment on Map_SP_M03_Objectives_C_ExecLatentFromSave_168B954F4F7B4FA997C0ECBD58B06C62");
static_assert(sizeof(Map_SP_M03_Objectives_C_ExecLatentFromSave_168B954F4F7B4FA997C0ECBD58B06C62) == 0x000020, "Wrong size on Map_SP_M03_Objectives_C_ExecLatentFromSave_168B954F4F7B4FA997C0ECBD58B06C62");
static_assert(offsetof(Map_SP_M03_Objectives_C_ExecLatentFromSave_168B954F4F7B4FA997C0ECBD58B06C62, LatentSaveGameData) == 0x000000, "Member 'Map_SP_M03_Objectives_C_ExecLatentFromSave_168B954F4F7B4FA997C0ECBD58B06C62::LatentSaveGameData' has a wrong offset!");

// Function Map_SP_M03_Objectives.Map_SP_M03_Objectives_C.ExecLatentFromSave_1748636C460D92EA03576AA512568D64
// 0x0020 (0x0020 - 0x0000)
struct Map_SP_M03_Objectives_C_ExecLatentFromSave_1748636C460D92EA03576AA512568D64 final
{
public:
	struct FLatentActionSaveGameData              LatentSaveGameData;                                // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(Map_SP_M03_Objectives_C_ExecLatentFromSave_1748636C460D92EA03576AA512568D64) == 0x000008, "Wrong alignment on Map_SP_M03_Objectives_C_ExecLatentFromSave_1748636C460D92EA03576AA512568D64");
static_assert(sizeof(Map_SP_M03_Objectives_C_ExecLatentFromSave_1748636C460D92EA03576AA512568D64) == 0x000020, "Wrong size on Map_SP_M03_Objectives_C_ExecLatentFromSave_1748636C460D92EA03576AA512568D64");
static_assert(offsetof(Map_SP_M03_Objectives_C_ExecLatentFromSave_1748636C460D92EA03576AA512568D64, LatentSaveGameData) == 0x000000, "Member 'Map_SP_M03_Objectives_C_ExecLatentFromSave_1748636C460D92EA03576AA512568D64::LatentSaveGameData' has a wrong offset!");

// Function Map_SP_M03_Objectives.Map_SP_M03_Objectives_C.ExecLatentFromSave_17B13F664C2A9157FCCDFE97BD7E8C37
// 0x0020 (0x0020 - 0x0000)
struct Map_SP_M03_Objectives_C_ExecLatentFromSave_17B13F664C2A9157FCCDFE97BD7E8C37 final
{
public:
	struct FLatentActionSaveGameData              SaveInfo;                                          // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(Map_SP_M03_Objectives_C_ExecLatentFromSave_17B13F664C2A9157FCCDFE97BD7E8C37) == 0x000008, "Wrong alignment on Map_SP_M03_Objectives_C_ExecLatentFromSave_17B13F664C2A9157FCCDFE97BD7E8C37");
static_assert(sizeof(Map_SP_M03_Objectives_C_ExecLatentFromSave_17B13F664C2A9157FCCDFE97BD7E8C37) == 0x000020, "Wrong size on Map_SP_M03_Objectives_C_ExecLatentFromSave_17B13F664C2A9157FCCDFE97BD7E8C37");
static_assert(offsetof(Map_SP_M03_Objectives_C_ExecLatentFromSave_17B13F664C2A9157FCCDFE97BD7E8C37, SaveInfo) == 0x000000, "Member 'Map_SP_M03_Objectives_C_ExecLatentFromSave_17B13F664C2A9157FCCDFE97BD7E8C37::SaveInfo' has a wrong offset!");

// Function Map_SP_M03_Objectives.Map_SP_M03_Objectives_C.ExecLatentFromSave_183395EC431CD22852267895D6375326
// 0x0020 (0x0020 - 0x0000)
struct Map_SP_M03_Objectives_C_ExecLatentFromSave_183395EC431CD22852267895D6375326 final
{
public:
	struct FLatentActionSaveGameData              SaveInfo;                                          // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(Map_SP_M03_Objectives_C_ExecLatentFromSave_183395EC431CD22852267895D6375326) == 0x000008, "Wrong alignment on Map_SP_M03_Objectives_C_ExecLatentFromSave_183395EC431CD22852267895D6375326");
static_assert(sizeof(Map_SP_M03_Objectives_C_ExecLatentFromSave_183395EC431CD22852267895D6375326) == 0x000020, "Wrong size on Map_SP_M03_Objectives_C_ExecLatentFromSave_183395EC431CD22852267895D6375326");
static_assert(offsetof(Map_SP_M03_Objectives_C_ExecLatentFromSave_183395EC431CD22852267895D6375326, SaveInfo) == 0x000000, "Member 'Map_SP_M03_Objectives_C_ExecLatentFromSave_183395EC431CD22852267895D6375326::SaveInfo' has a wrong offset!");

// Function Map_SP_M03_Objectives.Map_SP_M03_Objectives_C.ExecLatentFromSave_183E369640FEEB9571AA4B9B504FFD1F
// 0x0020 (0x0020 - 0x0000)
struct Map_SP_M03_Objectives_C_ExecLatentFromSave_183E369640FEEB9571AA4B9B504FFD1F final
{
public:
	struct FLatentActionSaveGameData              SaveInfo;                                          // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(Map_SP_M03_Objectives_C_ExecLatentFromSave_183E369640FEEB9571AA4B9B504FFD1F) == 0x000008, "Wrong alignment on Map_SP_M03_Objectives_C_ExecLatentFromSave_183E369640FEEB9571AA4B9B504FFD1F");
static_assert(sizeof(Map_SP_M03_Objectives_C_ExecLatentFromSave_183E369640FEEB9571AA4B9B504FFD1F) == 0x000020, "Wrong size on Map_SP_M03_Objectives_C_ExecLatentFromSave_183E369640FEEB9571AA4B9B504FFD1F");
static_assert(offsetof(Map_SP_M03_Objectives_C_ExecLatentFromSave_183E369640FEEB9571AA4B9B504FFD1F, SaveInfo) == 0x000000, "Member 'Map_SP_M03_Objectives_C_ExecLatentFromSave_183E369640FEEB9571AA4B9B504FFD1F::SaveInfo' has a wrong offset!");

// Function Map_SP_M03_Objectives.Map_SP_M03_Objectives_C.ExecLatentFromSave_187A7635457B5680A51BB5852D2BA19F
// 0x0020 (0x0020 - 0x0000)
struct Map_SP_M03_Objectives_C_ExecLatentFromSave_187A7635457B5680A51BB5852D2BA19F final
{
public:
	struct FLatentActionSaveGameData              SaveInfo;                                          // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(Map_SP_M03_Objectives_C_ExecLatentFromSave_187A7635457B5680A51BB5852D2BA19F) == 0x000008, "Wrong alignment on Map_SP_M03_Objectives_C_ExecLatentFromSave_187A7635457B5680A51BB5852D2BA19F");
static_assert(sizeof(Map_SP_M03_Objectives_C_ExecLatentFromSave_187A7635457B5680A51BB5852D2BA19F) == 0x000020, "Wrong size on Map_SP_M03_Objectives_C_ExecLatentFromSave_187A7635457B5680A51BB5852D2BA19F");
static_assert(offsetof(Map_SP_M03_Objectives_C_ExecLatentFromSave_187A7635457B5680A51BB5852D2BA19F, SaveInfo) == 0x000000, "Member 'Map_SP_M03_Objectives_C_ExecLatentFromSave_187A7635457B5680A51BB5852D2BA19F::SaveInfo' has a wrong offset!");

// Function Map_SP_M03_Objectives.Map_SP_M03_Objectives_C.ExecLatentFromSave_187A7635457B5680A51BB585676CE1CB
// 0x0020 (0x0020 - 0x0000)
struct Map_SP_M03_Objectives_C_ExecLatentFromSave_187A7635457B5680A51BB585676CE1CB final
{
public:
	struct FLatentActionSaveGameData              SaveInfo;                                          // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(Map_SP_M03_Objectives_C_ExecLatentFromSave_187A7635457B5680A51BB585676CE1CB) == 0x000008, "Wrong alignment on Map_SP_M03_Objectives_C_ExecLatentFromSave_187A7635457B5680A51BB585676CE1CB");
static_assert(sizeof(Map_SP_M03_Objectives_C_ExecLatentFromSave_187A7635457B5680A51BB585676CE1CB) == 0x000020, "Wrong size on Map_SP_M03_Objectives_C_ExecLatentFromSave_187A7635457B5680A51BB585676CE1CB");
static_assert(offsetof(Map_SP_M03_Objectives_C_ExecLatentFromSave_187A7635457B5680A51BB585676CE1CB, SaveInfo) == 0x000000, "Member 'Map_SP_M03_Objectives_C_ExecLatentFromSave_187A7635457B5680A51BB585676CE1CB::SaveInfo' has a wrong offset!");

// Function Map_SP_M03_Objectives.Map_SP_M03_Objectives_C.ExecLatentFromSave_187A7635457B5680A51BB585E3F1A913
// 0x0020 (0x0020 - 0x0000)
struct Map_SP_M03_Objectives_C_ExecLatentFromSave_187A7635457B5680A51BB585E3F1A913 final
{
public:
	struct FLatentActionSaveGameData              SaveInfo;                                          // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(Map_SP_M03_Objectives_C_ExecLatentFromSave_187A7635457B5680A51BB585E3F1A913) == 0x000008, "Wrong alignment on Map_SP_M03_Objectives_C_ExecLatentFromSave_187A7635457B5680A51BB585E3F1A913");
static_assert(sizeof(Map_SP_M03_Objectives_C_ExecLatentFromSave_187A7635457B5680A51BB585E3F1A913) == 0x000020, "Wrong size on Map_SP_M03_Objectives_C_ExecLatentFromSave_187A7635457B5680A51BB585E3F1A913");
static_assert(offsetof(Map_SP_M03_Objectives_C_ExecLatentFromSave_187A7635457B5680A51BB585E3F1A913, SaveInfo) == 0x000000, "Member 'Map_SP_M03_Objectives_C_ExecLatentFromSave_187A7635457B5680A51BB585E3F1A913::SaveInfo' has a wrong offset!");

// Function Map_SP_M03_Objectives.Map_SP_M03_Objectives_C.ExecLatentFromSave_194272AE4A9A12CAF1EFB7B4D4F91A0E
// 0x0020 (0x0020 - 0x0000)
struct Map_SP_M03_Objectives_C_ExecLatentFromSave_194272AE4A9A12CAF1EFB7B4D4F91A0E final
{
public:
	struct FLatentActionSaveGameData              SaveInfo;                                          // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(Map_SP_M03_Objectives_C_ExecLatentFromSave_194272AE4A9A12CAF1EFB7B4D4F91A0E) == 0x000008, "Wrong alignment on Map_SP_M03_Objectives_C_ExecLatentFromSave_194272AE4A9A12CAF1EFB7B4D4F91A0E");
static_assert(sizeof(Map_SP_M03_Objectives_C_ExecLatentFromSave_194272AE4A9A12CAF1EFB7B4D4F91A0E) == 0x000020, "Wrong size on Map_SP_M03_Objectives_C_ExecLatentFromSave_194272AE4A9A12CAF1EFB7B4D4F91A0E");
static_assert(offsetof(Map_SP_M03_Objectives_C_ExecLatentFromSave_194272AE4A9A12CAF1EFB7B4D4F91A0E, SaveInfo) == 0x000000, "Member 'Map_SP_M03_Objectives_C_ExecLatentFromSave_194272AE4A9A12CAF1EFB7B4D4F91A0E::SaveInfo' has a wrong offset!");

// Function Map_SP_M03_Objectives.Map_SP_M03_Objectives_C.ExecLatentFromSave_19A5830E406F9AB5D5FED2941DCC165B
// 0x0020 (0x0020 - 0x0000)
struct Map_SP_M03_Objectives_C_ExecLatentFromSave_19A5830E406F9AB5D5FED2941DCC165B final
{
public:
	struct FLatentActionSaveGameData              SaveInfo;                                          // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(Map_SP_M03_Objectives_C_ExecLatentFromSave_19A5830E406F9AB5D5FED2941DCC165B) == 0x000008, "Wrong alignment on Map_SP_M03_Objectives_C_ExecLatentFromSave_19A5830E406F9AB5D5FED2941DCC165B");
static_assert(sizeof(Map_SP_M03_Objectives_C_ExecLatentFromSave_19A5830E406F9AB5D5FED2941DCC165B) == 0x000020, "Wrong size on Map_SP_M03_Objectives_C_ExecLatentFromSave_19A5830E406F9AB5D5FED2941DCC165B");
static_assert(offsetof(Map_SP_M03_Objectives_C_ExecLatentFromSave_19A5830E406F9AB5D5FED2941DCC165B, SaveInfo) == 0x000000, "Member 'Map_SP_M03_Objectives_C_ExecLatentFromSave_19A5830E406F9AB5D5FED2941DCC165B::SaveInfo' has a wrong offset!");

// Function Map_SP_M03_Objectives.Map_SP_M03_Objectives_C.ExecLatentFromSave_19A5830E406F9AB5D5FED2946F418087
// 0x0020 (0x0020 - 0x0000)
struct Map_SP_M03_Objectives_C_ExecLatentFromSave_19A5830E406F9AB5D5FED2946F418087 final
{
public:
	struct FLatentActionSaveGameData              SaveInfo;                                          // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(Map_SP_M03_Objectives_C_ExecLatentFromSave_19A5830E406F9AB5D5FED2946F418087) == 0x000008, "Wrong alignment on Map_SP_M03_Objectives_C_ExecLatentFromSave_19A5830E406F9AB5D5FED2946F418087");
static_assert(sizeof(Map_SP_M03_Objectives_C_ExecLatentFromSave_19A5830E406F9AB5D5FED2946F418087) == 0x000020, "Wrong size on Map_SP_M03_Objectives_C_ExecLatentFromSave_19A5830E406F9AB5D5FED2946F418087");
static_assert(offsetof(Map_SP_M03_Objectives_C_ExecLatentFromSave_19A5830E406F9AB5D5FED2946F418087, SaveInfo) == 0x000000, "Member 'Map_SP_M03_Objectives_C_ExecLatentFromSave_19A5830E406F9AB5D5FED2946F418087::SaveInfo' has a wrong offset!");

// Function Map_SP_M03_Objectives.Map_SP_M03_Objectives_C.ExecLatentFromSave_19A5830E406F9AB5D5FED29476C8F6BB
// 0x0020 (0x0020 - 0x0000)
struct Map_SP_M03_Objectives_C_ExecLatentFromSave_19A5830E406F9AB5D5FED29476C8F6BB final
{
public:
