#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Map_SP_M03_Objectives

#include "Basic.hpp"

#include "S_AI_AttackWave_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Tempest_structs.hpp"
#include "Tempest_classes.hpp"
#include "SavedGame_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Map_SP_M03_Objectives.Map_SP_M03_Objectives_C
// 0x1990 (0x1CE0 - 0x0350)
class AMap_SP_M03_Objectives_C final : public ATedLevelScriptActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	int32                                         Rescued;                                           // 0x0358(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsConYardCaptured;                                 // 0x035C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SniperEscaped_;                                    // 0x035D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35E[0x2];                                      // 0x035E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTedMarkerHandle                       ConYardMarker;                                     // 0x0360(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, SaveGame, NoDestructor, HasGetValueTypeHash)
	struct FTedMarkerHandle                       Marker_engi1;                                      // 0x0364(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, SaveGame, NoDestructor, HasGetValueTypeHash)
	struct FTedMarkerHandle                       Marker_engi2;                                      // 0x0368(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, SaveGame, NoDestructor, HasGetValueTypeHash)
	struct FTedMarkerHandle                       Marker_engi3;                                      // 0x036C(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, SaveGame, NoDestructor, HasGetValueTypeHash)
	struct FTedMarkerHandle                       Marker_engi4;                                      // 0x0370(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, SaveGame, NoDestructor, HasGetValueTypeHash)
	struct FTedMarkerHandle                       Marker_engi5;                                      // 0x0374(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, SaveGame, NoDestructor, HasGetValueTypeHash)
	struct FTedMarkerHandle                       Marker_engi6;                                      // 0x0378(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, SaveGame, NoDestructor, HasGetValueTypeHash)
	struct FTedMarkerHandle                       EngineersCircle;                                   // 0x037C(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, SaveGame, NoDestructor, HasGetValueTypeHash)
	class ATedStructureBase*                      SpawnedBarracks;                                   // 0x0380(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, SaveGame, NoDestructor, HasGetValueTypeHash)
	class ATedStructureBase*                      SpawnedMachineShop;                                // 0x0388(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, SaveGame, NoDestructor, HasGetValueTypeHash)
	class ATedStructureBase*                      SpawnedRefinery;                                   // 0x0390(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, SaveGame, NoDestructor, HasGetValueTypeHash)
	struct FTedMarkerHandle                       Marker_Rescue;                                     // 0x0398(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, SaveGame, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39C[0x4];                                      // 0x039C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 GDF_03_Autosave_01;                                // 0x03A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, HasGetValueTypeHash)
	bool                                          SO_MachineShopDestroyed;                           // 0x03B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B1[0x7];                                      // 0x03B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAIMission_Patrol*                      AIM_LoopPatrol;                                    // 0x03B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, NoDestructor, HasGetValueTypeHash)
	class UAIMission_Patrol*                      AIM_LoopPatrol2;                                   // 0x03C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, NoDestructor, HasGetValueTypeHash)
	class UAIMission_Patrol*                      AIM_LoopPatrol3;                                   // 0x03C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, NoDestructor, HasGetValueTypeHash)
	class UAIMission_Patrol*                      AIM_LoopPatrol4;                                   // 0x03D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, NoDestructor, HasGetValueTypeHash)
	class UAIMission_Patrol*                      AIM_LoopPatrol5;                                   // 0x03D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, NoDestructor, HasGetValueTypeHash)
	class UAIMission_Scriptable*                  AIM_AttackConYard;                                 // 0x03E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, NoDestructor, HasGetValueTypeHash)
	bool                                          Run_AI_DYN_MainAttackWave_A;                       // 0x03E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E9[0x3];                                      // 0x03E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         AI_DYN_Wave_A;                                     // 0x03EC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AI_DYN_A_WavesSpacing;                             // 0x03F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Run_AI_DYN_MainAttackWave_B;                       // 0x03F4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F5[0x3];                                      // 0x03F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         AI_DYN_Wave_B;                                     // 0x03F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AI_DYN_B_WavesSpacing;                             // 0x03FC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Run_AI_DYN_MainAttackWave_C;                       // 0x0400(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_401[0x3];                                      // 0x0401(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         AI_DYN_Wave_C;                                     // 0x0404(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AI_DYN_C_WavesSpacing;                             // 0x0408(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_40C[0x4];                                      // 0x040C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  FullTechList;                                      // 0x0410(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance, SaveGame)
	struct FTedMarkerHandle                       ExtractionAreaMarker;                              // 0x0430(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, SaveGame, NoDestructor, HasGetValueTypeHash)
	bool                                          DebugTest;                                         // 0x0434(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SquadMemberKilled;                                 // 0x0435(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShowDebug;                                         // 0x0436(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          PlayerLowCredits;                                  // 0x0437(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          PlayerLargeArmy;                                   // 0x0438(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_439[0x3];                                      // 0x0439(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   SaveSlotTest_01;                                   // 0x043C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_444[0x4];                                      // 0x0444(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ATedUnitBase*>                   EvacBuggyIntercept;                                // 0x0448(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance, SaveGame)
	struct FTedMarkerHandle                       MO_01_Marker;                                      // 0x0458(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, SaveGame, NoDestructor, HasGetValueTypeHash)
	struct FFoWAgentHandle                        FOW_Airstrike;                                     // 0x045C(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, SaveGame, NoDestructor, HasGetValueTypeHash)
	struct FFoWAgentHandle                        FOW_Power_03;                                      // 0x0460(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, SaveGame, NoDestructor, HasGetValueTypeHash)
	struct FFoWAgentHandle                        FOW_Power_02;                                      // 0x0464(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, SaveGame, NoDestructor, HasGetValueTypeHash)
	struct FFoWAgentHandle                        FOW_Power_01;                                      // 0x0468(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, SaveGame, NoDestructor, HasGetValueTypeHash)
	struct FFoWAgentHandle                        FOW_Extraction;                                    // 0x046C(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, SaveGame, NoDestructor, HasGetValueTypeHash)
	bool                                          EngiesRescued_;                                    // 0x0470(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Run_AI_DYN_LightAttackWave_C;                      // 0x0471(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Power_03;                                          // 0x0472(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Power_02;                                          // 0x0473(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Power_01;                                          // 0x0474(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Power_04;                                          // 0x0475(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          BridgeDestroyedBefore;                             // 0x0476(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_477[0x1];                                      // 0x0477(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         OldBridgeState;                                    // 0x0478(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47C[0x4];                                      // 0x047C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           BridgeRepairCheckTimer;                            // 0x0480(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, SaveGame, NoDestructor, HasGetValueTypeHash)
	ETedPlayerID                                  Player_2__Red_DYN_;                                // 0x0488(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_489[0x7];                                      // 0x0489(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_AI_AttackWave                       DYN_MainAttackWave_A;                              // 0x0490(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct FS_AI_AttackWave                       DYN_MainAttackWave_B;                              // 0x04B8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct FS_AI_AttackWave                       DYN_MainAttackWave_C;                              // 0x04E0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	double                                        AI_DYN_Trickle_Waves_Spacing;                      // 0x0508(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PatrolRebuildDelay;                                // 0x0510(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Run_AI_DYN_LightAttackWave_A;                      // 0x0514(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_515[0x3];                                      // 0x0515(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_AI_AttackWave                       DYN_LightAttackWave_A;                             // 0x0518(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct FS_AI_AttackWave                       DYN_LightAttackWave_C;                             // 0x0540(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class UTedObjectiveObj*                       MainObjective_SniperSafeWithIntel;                 // 0x0568(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UTedObjectiveObj*                       MainObjective_ReconTheArea;                        // 0x0570(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UTedObjectiveObj*                       MainObjective_CaptureDYNConYard;                   // 0x0578(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UTedObjectiveObj*                       MainObjective_DefendConYard;                       // 0x0580(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UTedObjectiveObj*                       MainObjective_RescueEngineers;                     // 0x0588(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UTedObjectiveObj*                       MainObjective_Extract;                             // 0x0590(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UTedObjectiveObj*                       SecondaryObjective_RescueSquad;                    // 0x0598(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UTedObjectiveObj*                       SecondaryObjective_CaptureMachineShop;             // 0x05A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UTedObjectiveObj*                       HiddenObjective_EngineersSurvive_Neutral;          // 0x05A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UTedObjectiveObj*                       HiddenObjective_EngineersSurvive_Player;           // 0x05B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UTedObjectiveObj*                       HiddenObjective_ArmyGone;                          // 0x05B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          TurretDead_Missile_E;                              // 0x05C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          TurretDead_Flame_E;                                // 0x05C1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          TurretDead_Sam_N;                                  // 0x05C2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          TurretDead_Missile_N;                              // 0x05C3(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          TurretDead_Flame_N;                                // 0x05C4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          TurretDead_Flame_W;                                // 0x05C5(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RadarDead;                                         // 0x05C6(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C7[0x1];                                      // 0x05C7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTedPawnFilter                         PRQ_Sniper;                                        // 0x05C8(0x01C0)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FTedPawnFilter                         PRQ_Matchstick;                                    // 0x0788(0x01C0)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FTedPawnFilter                         PRQ_PlayerTriggerTagsNoSniper;                     // 0x0948(0x01C0)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FTedPawnFilter                         PRQ_PlayerTriggerTags;                             // 0x0B08(0x01C0)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FTedPawnFilter                         PRQ_DYN_TempestRig;                                // 0x0CC8(0x01C0)(Edit, BlueprintVisible, DisableEditOnInstance)
	class ATedUnitBase*                           DYN_Rig;                                           // 0x0E88(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, SaveGame, NoDestructor, HasGetValueTypeHash)
	struct FTedPawnFilter                         PRQ_DYN_BoarTanks;                                 // 0x0E90(0x01C0)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTagContainer                  GDF_SupportLockList_AirstrikeAdded;                // 0x1050(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTagContainer                  GDF_SupportLockList_SpyDronesAdded;                // 0x1070(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UAIMission_Patrol*                      AIM_Main_East_A;                                   // 0x1090(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, NoDestructor, HasGetValueTypeHash)
	class UAIMission_Patrol*                      AIM_Main_North_A;                                  // 0x1098(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, NoDestructor, HasGetValueTypeHash)
	class UAIMission_Patrol*                      AIM_Main_West_A;                                   // 0x10A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, NoDestructor, HasGetValueTypeHash)
	class UAIMission_Patrol*                      AIM_Light_East;                                    // 0x10A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, NoDestructor, HasGetValueTypeHash)
	class UAIMission_Patrol*                      AIM_Light_West;                                    // 0x10B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, NoDestructor, HasGetValueTypeHash)
	class UAIMission_Patrol*                      AIM_DYNBase_Patrol;                                // 0x10B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, NoDestructor, HasGetValueTypeHash)
	class ATedUnitBase*                           DYN_Dropship_01;                                   // 0x10C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, SaveGame, NoDestructor, HasGetValueTypeHash)
	TArray<class ATedPawn*>                       DYN_Dropship_01_Troops;                            // 0x10C8(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance, SaveGame)
	class ATedUnitBase*                           DYN_Dropship_02;                                   // 0x10D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, SaveGame, NoDestructor, HasGetValueTypeHash)
	TArray<class ATedPawn*>                       DYN_Dropship_02_Troops;                            // 0x10E0(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance, SaveGame)
	class ATedUnitBase*                           DYN_Dropship_03;                                   // 0x10F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, SaveGame, NoDestructor, HasGetValueTypeHash)
	TArray<class ATedPawn*>                       DYN_Dropship_03_Troops;                            // 0x10F8(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance, SaveGame)
	class UAIMission_Patrol*                      AIM_ConDef_Havoc_N_Reduced;                        // 0x1108(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, NoDestructor, HasGetValueTypeHash)
	class UAIMission_Patrol*                      AIM_ConDef_Havoc_N;                                // 0x1110(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, NoDestructor, HasGetValueTypeHash)
	class UAIMission_Patrol*                      AIM_ConDef_Havoc_S_Reduced;                        // 0x1118(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, NoDestructor, HasGetValueTypeHash)
	class UAIMission_Patrol*                      AIM_ConDef_Havoc_S;                                // 0x1120(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, NoDestructor, HasGetValueTypeHash)
	class UAIMission_Patrol*                      AIM_ConDef_Boar_N;                                 // 0x1128(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, NoDestructor, HasGetValueTypeHash)
	class UAIMission_Patrol*                      AIM_ConDef_Boar_N_Reduced;                         // 0x1130(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, NoDestructor, HasGetValueTypeHash)
	class UAIMission_Patrol*                      AIM_ConDef_Boar_S;                                 // 0x1138(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, NoDestructor, HasGetValueTypeHash)
	class UAIMission_Patrol*                      AIM_ConDef_Boar_S_Reduced;                         // 0x1140(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, NoDestructor, HasGetValueTypeHash)
	class UAIMission_Patrol*                      AIM_ConDef_HavocAndBoar_N;                         // 0x1148(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, NoDestructor, HasGetValueTypeHash)
	class UAIMission_Patrol*                      AIM_ConDef_HavocAndBoar_S;                         // 0x1150(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, NoDestructor, HasGetValueTypeHash)
	class UTedObjectiveObj*                       HiddenObjective_GDFOwned_ConYardLost;              // 0x1158(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UTedObjectiveObj*                       HiddenObjective_DYNOwned_ConYardDestroyed;         // 0x1160(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAIMission_Patrol*                      AIM_EvacAmbush_1;                                  // 0x1168(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, NoDestructor, HasGetValueTypeHash)
	class UAIMission_Patrol*                      AIM_EvacAmbush_2;                                  // 0x1170(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, NoDestructor, HasGetValueTypeHash)
	class UAIMission_Patrol*                      AIM_TempestRigMove;                                // 0x1178(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, NoDestructor, HasGetValueTypeHash)
	class UTedObjectiveObj*                       HiddenObjective_BuggiesInVol_4;                    // 0x1180(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UTedObjectiveObj*                       HiddenObjective_BuggiesInVol_8;                    // 0x1188(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FString                                 CutsceneName_Extraction;                           // 0x1190(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 CutsceneName_DYNDefences;                          // 0x11A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 CutsceneName_PrisonersAndMachineShop;              // 0x11B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 CutsceneName_DYNBase;                              // 0x11C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 CutsceneName_DeadSniper;                           // 0x11D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 CutsceneName_Intro;                                // 0x11E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class UTedHintsAsset*                         ActorHint_01_Stealth;                              // 0x11F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UTedHintsAsset*                         ActorHint_02_Sensor;                               // 0x11F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UTedHintsAsset*                         ActorHint_03_Vision;                               // 0x1200(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UTedHintsAsset*                         ActorHint_04_SelectionCycling;                     // 0x1208(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UTedHintsAsset*                         WorldHint_01_Bridge;                               // 0x1210(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UTedHintsAsset*                         WorldHint_02_Airstrike;                            // 0x1218(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UTedHintsAsset*                         WorldHint_02_Airstrike_2;                          // 0x1220(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UTedHintsAsset*                         WorldHint_03_MoveTogether;                         // 0x1228(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UTedHintsAsset*                         WorldHint_04_ControlGroups;                        // 0x1230(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          LoopBridgeRepairCheck_;                            // 0x1238(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1239[0x3];                                     // 0x1239(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_77A12C0F48E462CA583E068CA912EE9A_Variable; // 0x123C(0x0004)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_6D1AEEFC4F9115322DE2938ACC3A1D46_Variable; // 0x1240(0x0004)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_6D1AEEFC4F9115322DE2938ACC3A1D46_Variable; // 0x1244(0x0004)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_3AE0A1C94D81C6916E1E00A4B54667AB_Variable; // 0x1248(0x0004)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_3AE0A1C94D81C6916E1E00A4B54667AB_Variable; // 0x124C(0x0004)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_D1C4676E4E3F6B647E911CA2F9F976A0_Variable; // 0x1250(0x0004)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_D1C4676E4E3F6B647E911CA2F9F976A0_Variable; // 0x1254(0x0004)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_DB7A20D7487B75184BBDB6915221BF40_Variable; // 0x1258(0x0004)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_DB7A20D7487B75184BBDB6915221BF40_Variable; // 0x125C(0x0004)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_D32F1338488F78B3B0CF8EB7F9CCC4E7_Variable; // 0x1260(0x0004)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_D32F1338488F78B3B0CF8EB7F9CCC4E7_Variable; // 0x1264(0x0004)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_2C14103145C7055A381AD5BC95278227_Variable; // 0x1268(0x0004)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_2C14103145C7055A381AD5BC95278227_Variable; // 0x126C(0x0004)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_52AAA6AC4F365416A0E3EB9325F5E401_Variable; // 0x1270(0x0004)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_52AAA6AC4F365416A0E3EB9325F5E401_Variable; // 0x1274(0x0004)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_6B44B2C34CB487A6717A30ADF0687F9D_Variable; // 0x1278(0x0004)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_6B44B2C34CB487A6717A30ADF0687F9D_Variable; // 0x127C(0x0004)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_6C4DADAD42318CEFC5CAF0A4579EFE3E_Variable; // 0x1280(0x0004)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_6C4DADAD42318CEFC5CAF0A4579EFE3E_Variable; // 0x1284(0x0004)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_7206B3B64E7F1F7F7A6D57B4DC00307D_Variable; // 0x1288(0x0004)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_7206B3B64E7F1F7F7A6D57B4DC00307D_Variable; // 0x128C(0x0004)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_AB5C857B49E2811EE42E7B98A0341FC2_Variable; // 0x1290(0x0004)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_AB5C857B49E2811EE42E7B98A0341FC2_Variable; // 0x1294(0x0004)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_CE395C3E473ABF9B197E3386D57139F7_Variable; // 0x1298(0x0004)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_CE395C3E473ABF9B197E3386D57139F7_Variable; // 0x129C(0x0004)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_8D7D98964F8E0913E11003803A0BC258_Variable; // 0x12A0(0x0001)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_8D7D98964F8E0913E11003803A0BC258_Variable; // 0x12A1(0x0001)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_9A487CA9494A7DB3913495A6D1C87BB7_Variable; // 0x12A2(0x0001)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_9A487CA9494A7DB3913495A6D1C87BB7_Variable; // 0x12A3(0x0001)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_BC73D85845CFC422EDFC598510B4A09C_Variable; // 0x12A4(0x0001)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_BC73D85845CFC422EDFC598510B4A09C_Variable; // 0x12A5(0x0001)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_FDC483634DCE2B932BEFA2BF6FF888E3_Variable; // 0x12A6(0x0001)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_FDC483634DCE2B932BEFA2BF6FF888E3_Variable; // 0x12A7(0x0001)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_7EAB0C9D438F08337B00F0B79ED0763D_Variable; // 0x12A8(0x0001)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_7EAB0C9D438F08337B00F0B79ED0763D_Variable; // 0x12A9(0x0001)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_1CE44F4A4C09144433EC13AB92A94FAD_Variable; // 0x12AA(0x0001)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_1CE44F4A4C09144433EC13AB92A94FAD_Variable; // 0x12AB(0x0001)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_FA73DE56498A6DA3A06E4A8F143D0E69_Variable; // 0x12AC(0x0001)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_FA73DE56498A6DA3A06E4A8F143D0E69_Variable; // 0x12AD(0x0001)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_4743A2F042EAC4929142B5A7AC3C8C4C_Variable; // 0x12AE(0x0001)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_4743A2F042EAC4929142B5A7AC3C8C4C_Variable; // 0x12AF(0x0001)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_DEE8FA65483A090CDEF52C90D33C793F_Variable; // 0x12B0(0x0001)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_DEE8FA65483A090CDEF52C90D33C793F_Variable; // 0x12B1(0x0001)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_7522D85948F752ABAE6976917B77C039_Variable; // 0x12B2(0x0001)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_7522D85948F752ABAE6976917B77C039_Variable; // 0x12B3(0x0001)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_7DCEBA1D4BC7AC6EC19FD0B4DCB1F145_Variable; // 0x12B4(0x0001)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12B5[0x3];                                     // 0x12B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_4F2428854A3FD045C44CF1AA4015AB92_Variable; // 0x12B8(0x0004)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_7DCEBA1D4BC7AC6EC19FD0B4DCB1F145_Variable; // 0x12BC(0x0001)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Whether_the_gate_is_currently_open_or_close_F11D189249C579C39267E2A7FEBB0AB3_Variable; // 0x12BD(0x0001)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Whether_the_gate_is_currently_open_or_close_FA199D0E4D82910F98E12393DCE769C2_Variable; // 0x12BE(0x0001)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_A0B21DED4416321B49D02DB656D8F99E_Variable; // 0x12BF(0x0001)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_A0B21DED4416321B49D02DB656D8F99E_Variable; // 0x12C0(0x0001)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_C167ABD947F1A98FC218B8B217F27A88_Variable; // 0x12C1(0x0001)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_C167ABD947F1A98FC218B8B217F27A88_Variable; // 0x12C2(0x0001)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Whether_the_gate_is_currently_open_or_close_2889DE5A4718998F663BD3BECF71F4BC_Variable; // 0x12C3(0x0001)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Whether_the_gate_is_currently_open_or_close_F3FA687F44A997DC90DCE285B9F3A429_Variable; // 0x12C4(0x0001)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Whether_the_gate_is_currently_open_or_close_45C6ABB94E48FF186A7AC3B6AF25AA9E_Variable; // 0x12C5(0x0001)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_9112D1304FB4E1D4C3B46987F8BE5A1B_Variable; // 0x12C6(0x0001)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_9112D1304FB4E1D4C3B46987F8BE5A1B_Variable; // 0x12C7(0x0001)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_23773C2D4E4840B0A12155BF282A4AB7_Variable; // 0x12C8(0x0001)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_23773C2D4E4840B0A12155BF282A4AB7_Variable; // 0x12C9(0x0001)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_226EB11048278DB6068B819546FFE3E1_Variable; // 0x12CA(0x0001)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_226EB11048278DB6068B819546FFE3E1_Variable; // 0x12CB(0x0001)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Whether_the_gate_is_currently_open_or_close_FA00CF33448FA387344F7F97C67B81BF_Variable; // 0x12CC(0x0001)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Whether_the_gate_is_currently_open_or_close_B9C742C745960531259693AD8915ACF1_Variable; // 0x12CD(0x0001)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12CE[0x2];                                     // 0x12CE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_861D654C4AFBF8F8B2C114B4F57045A7_Variable; // 0x12D0(0x0004)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_9005DF474C8510D06CFFD79B8084CE66_Variable; // 0x12D4(0x0001)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_9005DF474C8510D06CFFD79B8084CE66_Variable; // 0x12D5(0x0001)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12D6[0x2];                                     // 0x12D6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_30768E02477381F3820D80A6919C6E1F_Variable; // 0x12D8(0x0004)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_30768E02477381F3820D80A6919C6E1F_Variable; // 0x12DC(0x0004)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_081F6C58432550C547DB13AD0016C20C_Variable; // 0x12E0(0x0001)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_081F6C58432550C547DB13AD0016C20C_Variable; // 0x12E1(0x0001)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_A2EC74DA437AC3768BEDBBAF7C854733_Variable; // 0x12E2(0x0001)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_A2EC74DA437AC3768BEDBBAF7C854733_Variable; // 0x12E3(0x0001)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_C4723A47420D52BED2C51197222AB568_Variable; // 0x12E4(0x0001)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_C4723A47420D52BED2C51197222AB568_Variable; // 0x12E5(0x0001)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_836CC6764611307C31973180BED65588_Variable; // 0x12E6(0x0001)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_836CC6764611307C31973180BED65588_Variable; // 0x12E7(0x0001)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_51320C2D47C2391959A4759949FB7B95_Variable; // 0x12E8(0x0001)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_51320C2D47C2391959A4759949FB7B95_Variable; // 0x12E9(0x0001)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_5A2725AC4E70EEDB98C0D9976FB00B0F_Variable; // 0x12EA(0x0001)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_5A2725AC4E70EEDB98C0D9976FB00B0F_Variable; // 0x12EB(0x0001)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_954591D54B3D71A9BA99469D49676EB8_Variable; // 0x12EC(0x0001)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_954591D54B3D71A9BA99469D49676EB8_Variable; // 0x12ED(0x0001)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12EE[0x2];                                     // 0x12EE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_D5051CA74B6575FE8418859D64693A1F_Variable; // 0x12F0(0x0004)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_D5051CA74B6575FE8418859D64693A1F_Variable; // 0x12F4(0x0004)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_D6A505DE49772722E20DC088E4FF7E9D_Variable; // 0x12F8(0x0001)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_D6A505DE49772722E20DC088E4FF7E9D_Variable; // 0x12F9(0x0001)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_D111CFDC4AC172BC8D5323AED88424B5_Variable; // 0x12FA(0x0001)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_D111CFDC4AC172BC8D5323AED88424B5_Variable; // 0x12FB(0x0001)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_55E6D14643A352D8707E42B766A96EE5_Variable; // 0x12FC(0x0004)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_55E6D14643A352D8707E42B766A96EE5_Variable; // 0x1300(0x0004)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_5273283B4CE1972420AE37A2A82FB20F_Variable; // 0x1304(0x0001)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_5273283B4CE1972420AE37A2A82FB20F_Variable; // 0x1305(0x0001)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_8192BF3944E7605F601157A714366FFC_Variable; // 0x1306(0x0001)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_8192BF3944E7605F601157A714366FFC_Variable; // 0x1307(0x0001)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_9EA49C5941B22D4F03936AB8DA0588F7_Variable; // 0x1308(0x0001)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_9EA49C5941B22D4F03936AB8DA0588F7_Variable; // 0x1309(0x0001)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_7261BB444F637BEE5802249B2FFAA7F5_Variable; // 0x130A(0x0001)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_7261BB444F637BEE5802249B2FFAA7F5_Variable; // 0x130B(0x0001)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_0DF5AD354E7690DECEE7B1BE46F44BC9_Variable; // 0x130C(0x0001)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_0DF5AD354E7690DECEE7B1BE46F44BC9_Variable; // 0x130D(0x0001)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Whether_the_gate_is_currently_open_or_close_F9CED0D243E473DB590F7D906D4C5E83_Variable; // 0x130E(0x0001)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_130F[0x1];                                     // 0x130F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_B326393646400CB453CB4D97514222CE_Variable; // 0x1310(0x0004)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_B326393646400CB453CB4D97514222CE_Variable; // 0x1314(0x0004)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_077BB1CB480B9267D1A994979D735DB6_Variable; // 0x1318(0x0001)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_077BB1CB480B9267D1A994979D735DB6_Variable; // 0x1319(0x0001)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_131A[0x2];                                     // 0x131A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_6E8C4C8146C74225F9E4A3878F51E161_Variable; // 0x131C(0x0004)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_6E8C4C8146C74225F9E4A3878F51E161_Variable; // 0x1320(0x0004)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_FECA6D6449FA8016C7CD7F924213216E_Variable; // 0x1324(0x0001)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_FECA6D6449FA8016C7CD7F924213216E_Variable; // 0x1325(0x0001)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1326[0x2];                                     // 0x1326(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_C5CC365348C98D88378254B173DBE947_Variable; // 0x1328(0x0004)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_C5CC365348C98D88378254B173DBE947_Variable; // 0x132C(0x0004)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_7CD9783B4985A2E18593D497F901A378_Variable; // 0x1330(0x0004)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_7CD9783B4985A2E18593D497F901A378_Variable; // 0x1334(0x0004)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_860415BE4B81C76A2E8AF2B1F15A565D_Variable; // 0x1338(0x0001)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_860415BE4B81C76A2E8AF2B1F15A565D_Variable; // 0x1339(0x0001)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_51B699C741CF7CC17A3BC68AA35B6394_Variable; // 0x133A(0x0001)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_51B699C741CF7CC17A3BC68AA35B6394_Variable; // 0x133B(0x0001)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_509E04C9413A0FFA605C4780FA198DA6_Variable; // 0x133C(0x0001)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_509E04C9413A0FFA605C4780FA198DA6_Variable; // 0x133D(0x0001)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_20B81C574B937DB8BF0D0BB6869FE768_Variable; // 0x133E(0x0001)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
