#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Pros

#include "Basic.hpp"

#include "ProsSDK_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// Enum Pros.EProsServiceState
// NumValues: 0x0005
enum class EProsServiceState : uint8
{
	OFFLINE                                  = 0,
	CONNECTING                               = 1,
	ONLINE                                   = 2,
	DISCONNECTING                            = 3,
	EProsServiceState_MAX                    = 4,
};

// Enum Pros.EJsonType
// NumValues: 0x0008
enum class EJsonType : uint8
{
	None                                     = 0,
	Null                                     = 1,
	String                                   = 2,
	Number                                   = 3,
	Boolean                                  = 4,
	Array                                    = 5,
	Object                                   = 6,
	EJsonType_MAX                            = 7,
};

// Enum Pros.EProsLogLevel
// NumValues: 0x0004
enum class EProsLogLevel : uint8
{
	LOGERROR                                 = 0,
	LOGWARNING                               = 1,
	LOGINFO                                  = 2,
	EProsLogLevel_MAX                        = 3,
};

// Enum Pros.EProsSdkLogLevel
// NumValues: 0x0004
enum class EProsSdkLogLevel : uint8
{
	DEFAULT                                  = 0,
	DEBUG                                    = 10,
	VERBOSE                                  = 100,
	EProsSdkLogLevel_MAX                     = 101,
};

// ScriptStruct Pros.ProsLocDesc
// 0x0040 (0x0040 - 0x0000)
struct FProsLocDesc final
{
public:
	class FString                                 LanguageCode;                                      // 0x0000(0x0010)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 CountryCode;                                       // 0x0010(0x0010)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Text;                                              // 0x0020(0x0010)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FProsLocDesc) == 0x000008, "Wrong alignment on FProsLocDesc");
static_assert(sizeof(FProsLocDesc) == 0x000040, "Wrong size on FProsLocDesc");
static_assert(offsetof(FProsLocDesc, LanguageCode) == 0x000000, "Member 'FProsLocDesc::LanguageCode' has a wrong offset!");
static_assert(offsetof(FProsLocDesc, CountryCode) == 0x000010, "Member 'FProsLocDesc::CountryCode' has a wrong offset!");
static_assert(offsetof(FProsLocDesc, Text) == 0x000020, "Member 'FProsLocDesc::Text' has a wrong offset!");

// ScriptStruct Pros.ProsBannerMessage
// 0x0020 (0x0020 - 0x0000)
struct FProsBannerMessage final
{
public:
	class FString                                 ID;                                                // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FProsLocDesc>                   LocDescs;                                          // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FProsBannerMessage) == 0x000008, "Wrong alignment on FProsBannerMessage");
static_assert(sizeof(FProsBannerMessage) == 0x000020, "Wrong size on FProsBannerMessage");
static_assert(offsetof(FProsBannerMessage, ID) == 0x000000, "Member 'FProsBannerMessage::ID' has a wrong offset!");
static_assert(offsetof(FProsBannerMessage, LocDescs) == 0x000010, "Member 'FProsBannerMessage::LocDescs' has a wrong offset!");

// ScriptStruct Pros.ProsBannerSpace
// 0x0018 (0x0018 - 0x0000)
struct FProsBannerSpace final
{
public:
	class FString                                 Name;                                              // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsDefault;                                         // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FProsBannerSpace) == 0x000008, "Wrong alignment on FProsBannerSpace");
static_assert(sizeof(FProsBannerSpace) == 0x000018, "Wrong size on FProsBannerSpace");
static_assert(offsetof(FProsBannerSpace, Name) == 0x000000, "Member 'FProsBannerSpace::Name' has a wrong offset!");
static_assert(offsetof(FProsBannerSpace, IsDefault) == 0x000010, "Member 'FProsBannerSpace::IsDefault' has a wrong offset!");

// ScriptStruct Pros.ProsBanner
// 0x0080 (0x0080 - 0x0000)
struct FProsBanner final
{
public:
	class FString                                 CampaignId;                                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ImageUrl;                                          // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 RedirectUrl;                                       // 0x0020(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EProsdkBannerUrlType                          RedirectUrlType;                                   // 0x0030(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EProsdkBannerType                             Type;                                              // 0x0031(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FProsBannerMessage>             Messages;                                          // 0x0038(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<uint8>                                 LinkContext;                                       // 0x0048(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FString>                         Labels;                                            // 0x0058(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FProsBannerSpace                       Space;                                             // 0x0068(0x0018)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
};
static_assert(alignof(FProsBanner) == 0x000008, "Wrong alignment on FProsBanner");
static_assert(sizeof(FProsBanner) == 0x000080, "Wrong size on FProsBanner");
static_assert(offsetof(FProsBanner, CampaignId) == 0x000000, "Member 'FProsBanner::CampaignId' has a wrong offset!");
static_assert(offsetof(FProsBanner, ImageUrl) == 0x000010, "Member 'FProsBanner::ImageUrl' has a wrong offset!");
static_assert(offsetof(FProsBanner, RedirectUrl) == 0x000020, "Member 'FProsBanner::RedirectUrl' has a wrong offset!");
static_assert(offsetof(FProsBanner, RedirectUrlType) == 0x000030, "Member 'FProsBanner::RedirectUrlType' has a wrong offset!");
static_assert(offsetof(FProsBanner, Type) == 0x000031, "Member 'FProsBanner::Type' has a wrong offset!");
static_assert(offsetof(FProsBanner, Messages) == 0x000038, "Member 'FProsBanner::Messages' has a wrong offset!");
static_assert(offsetof(FProsBanner, LinkContext) == 0x000048, "Member 'FProsBanner::LinkContext' has a wrong offset!");
static_assert(offsetof(FProsBanner, Labels) == 0x000058, "Member 'FProsBanner::Labels' has a wrong offset!");
static_assert(offsetof(FProsBanner, Space) == 0x000068, "Member 'FProsBanner::Space' has a wrong offset!");

// ScriptStruct Pros.ProsModsUserModel
// 0x0030 (0x0030 - 0x0000)
struct FProsModsUserModel final
{
public:
	class FString                                 Name;                                              // 0x0000(0x0010)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Postfix;                                           // 0x0010(0x0010)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_20[0x10];                                      // 0x0020(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FProsModsUserModel) == 0x000008, "Wrong alignment on FProsModsUserModel");
static_assert(sizeof(FProsModsUserModel) == 0x000030, "Wrong size on FProsModsUserModel");
static_assert(offsetof(FProsModsUserModel, Name) == 0x000000, "Member 'FProsModsUserModel::Name' has a wrong offset!");
static_assert(offsetof(FProsModsUserModel, Postfix) == 0x000010, "Member 'FProsModsUserModel::Postfix' has a wrong offset!");

// ScriptStruct Pros.ProsModsGalleryImage
// 0x0050 (0x0050 - 0x0000)
struct FProsModsGalleryImage final
{
public:
	class FString                                 Image;                                             // 0x0000(0x0010)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ThumbnailSmall;                                    // 0x0010(0x0010)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ThumbnailMedium;                                   // 0x0020(0x0010)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ThumbnailLarge;                                    // 0x0030(0x0010)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_40[0x10];                                      // 0x0040(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FProsModsGalleryImage) == 0x000008, "Wrong alignment on FProsModsGalleryImage");
static_assert(sizeof(FProsModsGalleryImage) == 0x000050, "Wrong size on FProsModsGalleryImage");
static_assert(offsetof(FProsModsGalleryImage, Image) == 0x000000, "Member 'FProsModsGalleryImage::Image' has a wrong offset!");
static_assert(offsetof(FProsModsGalleryImage, ThumbnailSmall) == 0x000010, "Member 'FProsModsGalleryImage::ThumbnailSmall' has a wrong offset!");
static_assert(offsetof(FProsModsGalleryImage, ThumbnailMedium) == 0x000020, "Member 'FProsModsGalleryImage::ThumbnailMedium' has a wrong offset!");
static_assert(offsetof(FProsModsGalleryImage, ThumbnailLarge) == 0x000030, "Member 'FProsModsGalleryImage::ThumbnailLarge' has a wrong offset!");

// ScriptStruct Pros.ProsModsModeratorMessage
// 0x0028 (0x0028 - 0x0000)
struct FProsModsModeratorMessage final
{
public:
	class FString                                 ModeratorAccountID;                                // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Message;                                           // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDateTime                              TimestampPostedAt;                                 // 0x0020(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FProsModsModeratorMessage) == 0x000008, "Wrong alignment on FProsModsModeratorMessage");
static_assert(sizeof(FProsModsModeratorMessage) == 0x000028, "Wrong size on FProsModsModeratorMessage");
static_assert(offsetof(FProsModsModeratorMessage, ModeratorAccountID) == 0x000000, "Member 'FProsModsModeratorMessage::ModeratorAccountID' has a wrong offset!");
static_assert(offsetof(FProsModsModeratorMessage, Message) == 0x000010, "Member 'FProsModsModeratorMessage::Message' has a wrong offset!");
static_assert(offsetof(FProsModsModeratorMessage, TimestampPostedAt) == 0x000020, "Member 'FProsModsModeratorMessage::TimestampPostedAt' has a wrong offset!");

// ScriptStruct Pros.ProsModsDescription
// 0x0118 (0x0118 - 0x0000)
struct FProsModsDescription final
{
public:
	struct FProsModsUserModel                     Author;                                            // 0x0000(0x0030)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	class FString                                 Name;                                              // 0x0030(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FProsModsGalleryImage                  LogoImage;                                         // 0x0040(0x0050)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	TArray<struct FProsLocDesc>                   FullDescriptions;                                  // 0x0090(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FProsLocDesc>                   ShortDescriptions;                                 // 0x00A0(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FProsModsGalleryImage>          Images;                                            // 0x00B0(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	class FString                                 Homepage;                                          // 0x00C0(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         YoutubeLinks;                                      // 0x00D0(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FDateTime                              LastUpdateTimestamp;                               // 0x00E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDateTime                              CreatedAtTimestamp;                                // 0x00E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ProfileUrl;                                        // 0x00F0(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDateTime                              DeletedAtTimestamp;                                // 0x0100(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FProsModsModeratorMessage>      ModeratorMessages;                                 // 0x0108(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FProsModsDescription) == 0x000008, "Wrong alignment on FProsModsDescription");
static_assert(sizeof(FProsModsDescription) == 0x000118, "Wrong size on FProsModsDescription");
static_assert(offsetof(FProsModsDescription, Author) == 0x000000, "Member 'FProsModsDescription::Author' has a wrong offset!");
static_assert(offsetof(FProsModsDescription, Name) == 0x000030, "Member 'FProsModsDescription::Name' has a wrong offset!");
static_assert(offsetof(FProsModsDescription, LogoImage) == 0x000040, "Member 'FProsModsDescription::LogoImage' has a wrong offset!");
static_assert(offsetof(FProsModsDescription, FullDescriptions) == 0x000090, "Member 'FProsModsDescription::FullDescriptions' has a wrong offset!");
static_assert(offsetof(FProsModsDescription, ShortDescriptions) == 0x0000A0, "Member 'FProsModsDescription::ShortDescriptions' has a wrong offset!");
static_assert(offsetof(FProsModsDescription, Images) == 0x0000B0, "Member 'FProsModsDescription::Images' has a wrong offset!");
static_assert(offsetof(FProsModsDescription, Homepage) == 0x0000C0, "Member 'FProsModsDescription::Homepage' has a wrong offset!");
static_assert(offsetof(FProsModsDescription, YoutubeLinks) == 0x0000D0, "Member 'FProsModsDescription::YoutubeLinks' has a wrong offset!");
static_assert(offsetof(FProsModsDescription, LastUpdateTimestamp) == 0x0000E0, "Member 'FProsModsDescription::LastUpdateTimestamp' has a wrong offset!");
static_assert(offsetof(FProsModsDescription, CreatedAtTimestamp) == 0x0000E8, "Member 'FProsModsDescription::CreatedAtTimestamp' has a wrong offset!");
static_assert(offsetof(FProsModsDescription, ProfileUrl) == 0x0000F0, "Member 'FProsModsDescription::ProfileUrl' has a wrong offset!");
static_assert(offsetof(FProsModsDescription, DeletedAtTimestamp) == 0x000100, "Member 'FProsModsDescription::DeletedAtTimestamp' has a wrong offset!");
static_assert(offsetof(FProsModsDescription, ModeratorMessages) == 0x000108, "Member 'FProsModsDescription::ModeratorMessages' has a wrong offset!");

// ScriptStruct Pros.ProsContainerChunk
// 0x0038 (0x0038 - 0x0000)
struct FProsContainerChunk final
{
public:
	int64                                         Number;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Key;                                               // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<uint8>                                 Data;                                              // 0x0018(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_28[0x10];                                      // 0x0028(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FProsContainerChunk) == 0x000008, "Wrong alignment on FProsContainerChunk");
static_assert(sizeof(FProsContainerChunk) == 0x000038, "Wrong size on FProsContainerChunk");
static_assert(offsetof(FProsContainerChunk, Number) == 0x000000, "Member 'FProsContainerChunk::Number' has a wrong offset!");
static_assert(offsetof(FProsContainerChunk, Key) == 0x000008, "Member 'FProsContainerChunk::Key' has a wrong offset!");
static_assert(offsetof(FProsContainerChunk, Data) == 0x000018, "Member 'FProsContainerChunk::Data' has a wrong offset!");

// ScriptStruct Pros.ProsContainerDownloadResponse
// 0x0020 (0x0020 - 0x0000)
struct FProsContainerDownloadResponse final
{
public:
	class FString                                 ContainerId;                                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FProsContainerChunk>            Chunks;                                            // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FProsContainerDownloadResponse) == 0x000008, "Wrong alignment on FProsContainerDownloadResponse");
static_assert(sizeof(FProsContainerDownloadResponse) == 0x000020, "Wrong size on FProsContainerDownloadResponse");
static_assert(offsetof(FProsContainerDownloadResponse, ContainerId) == 0x000000, "Member 'FProsContainerDownloadResponse::ContainerId' has a wrong offset!");
static_assert(offsetof(FProsContainerDownloadResponse, Chunks) == 0x000010, "Member 'FProsContainerDownloadResponse::Chunks' has a wrong offset!");

// ScriptStruct Pros.ProsModsType
// 0x0038 (0x0038 - 0x0000)
struct FProsModsType final
{
public:
	class FString                                 ID;                                                // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 LocalizationID;                                    // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FProsLocDesc>                   Localizations;                                     // 0x0020(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                         Order;                                             // 0x0030(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FProsModsType) == 0x000008, "Wrong alignment on FProsModsType");
static_assert(sizeof(FProsModsType) == 0x000038, "Wrong size on FProsModsType");
static_assert(offsetof(FProsModsType, ID) == 0x000000, "Member 'FProsModsType::ID' has a wrong offset!");
static_assert(offsetof(FProsModsType, LocalizationID) == 0x000010, "Member 'FProsModsType::LocalizationID' has a wrong offset!");
static_assert(offsetof(FProsModsType, Localizations) == 0x000020, "Member 'FProsModsType::Localizations' has a wrong offset!");
static_assert(offsetof(FProsModsType, Order) == 0x000030, "Member 'FProsModsType::Order' has a wrong offset!");

// ScriptStruct Pros.ProsModsSocial
// 0x0010 (0x0010 - 0x0000)
struct FProsModsSocial final
{
public:
	int32                                         Likes;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Dislikes;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Downloads;                                         // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Subscribers;                                       // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FProsModsSocial) == 0x000004, "Wrong alignment on FProsModsSocial");
static_assert(sizeof(FProsModsSocial) == 0x000010, "Wrong size on FProsModsSocial");
static_assert(offsetof(FProsModsSocial, Likes) == 0x000000, "Member 'FProsModsSocial::Likes' has a wrong offset!");
static_assert(offsetof(FProsModsSocial, Dislikes) == 0x000004, "Member 'FProsModsSocial::Dislikes' has a wrong offset!");
static_assert(offsetof(FProsModsSocial, Downloads) == 0x000008, "Member 'FProsModsSocial::Downloads' has a wrong offset!");
static_assert(offsetof(FProsModsSocial, Subscribers) == 0x00000C, "Member 'FProsModsSocial::Subscribers' has a wrong offset!");

// ScriptStruct Pros.ProsModsTag
// 0x0038 (0x0038 - 0x0000)
struct FProsModsTag final
{
public:
	class FString                                 ID;                                                // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 LocalizationID;                                    // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FProsLocDesc>                   Localizations;                                     // 0x0020(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                         Order;                                             // 0x0030(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FProsModsTag) == 0x000008, "Wrong alignment on FProsModsTag");
static_assert(sizeof(FProsModsTag) == 0x000038, "Wrong size on FProsModsTag");
static_assert(offsetof(FProsModsTag, ID) == 0x000000, "Member 'FProsModsTag::ID' has a wrong offset!");
static_assert(offsetof(FProsModsTag, LocalizationID) == 0x000010, "Member 'FProsModsTag::LocalizationID' has a wrong offset!");
static_assert(offsetof(FProsModsTag, Localizations) == 0x000020, "Member 'FProsModsTag::Localizations' has a wrong offset!");
static_assert(offsetof(FProsModsTag, Order) == 0x000030, "Member 'FProsModsTag::Order' has a wrong offset!");

// ScriptStruct Pros.ProsModsDataInfo
// 0x0048 (0x0048 - 0x0000)
struct FProsModsDataInfo final
{
public:
	class FString                                 Filename;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 FileId;                                            // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         ModSizeInBytes;                                    // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 FileUrl;                                           // 0x0028(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ValidationHash;                                    // 0x0038(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FProsModsDataInfo) == 0x000008, "Wrong alignment on FProsModsDataInfo");
static_assert(sizeof(FProsModsDataInfo) == 0x000048, "Wrong size on FProsModsDataInfo");
static_assert(offsetof(FProsModsDataInfo, Filename) == 0x000000, "Member 'FProsModsDataInfo::Filename' has a wrong offset!");
static_assert(offsetof(FProsModsDataInfo, FileId) == 0x000010, "Member 'FProsModsDataInfo::FileId' has a wrong offset!");
static_assert(offsetof(FProsModsDataInfo, ModSizeInBytes) == 0x000020, "Member 'FProsModsDataInfo::ModSizeInBytes' has a wrong offset!");
static_assert(offsetof(FProsModsDataInfo, FileUrl) == 0x000028, "Member 'FProsModsDataInfo::FileUrl' has a wrong offset!");
static_assert(offsetof(FProsModsDataInfo, ValidationHash) == 0x000038, "Member 'FProsModsDataInfo::ValidationHash' has a wrong offset!");

// ScriptStruct Pros.ProsModsVersion
// 0x00B8 (0x00B8 - 0x0000)
struct FProsModsVersion final
{
public:
	class FString                                 VersionTag;                                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 PlatformID;                                        // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDateTime                              ApprovedAtTimestamp;                               // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDateTime                              UploadedAtTimestamp;                               // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FProsModsDataInfo                      ModDataInfo;                                       // 0x0030(0x0048)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	class FString                                 ReleaseNotes;                                      // 0x0078(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EProsdkModVersionStatus                       Status;                                            // 0x0088(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FProsModsModeratorMessage>      ModeratorMessages;                                 // 0x0090(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	class FString                                 VersionName;                                       // 0x00A0(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDateTime                              UpdatedAtTimestamp;                                // 0x00B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FProsModsVersion) == 0x000008, "Wrong alignment on FProsModsVersion");
static_assert(sizeof(FProsModsVersion) == 0x0000B8, "Wrong size on FProsModsVersion");
static_assert(offsetof(FProsModsVersion, VersionTag) == 0x000000, "Member 'FProsModsVersion::VersionTag' has a wrong offset!");
static_assert(offsetof(FProsModsVersion, PlatformID) == 0x000010, "Member 'FProsModsVersion::PlatformID' has a wrong offset!");
static_assert(offsetof(FProsModsVersion, ApprovedAtTimestamp) == 0x000020, "Member 'FProsModsVersion::ApprovedAtTimestamp' has a wrong offset!");
static_assert(offsetof(FProsModsVersion, UploadedAtTimestamp) == 0x000028, "Member 'FProsModsVersion::UploadedAtTimestamp' has a wrong offset!");
static_assert(offsetof(FProsModsVersion, ModDataInfo) == 0x000030, "Member 'FProsModsVersion::ModDataInfo' has a wrong offset!");
static_assert(offsetof(FProsModsVersion, ReleaseNotes) == 0x000078, "Member 'FProsModsVersion::ReleaseNotes' has a wrong offset!");
static_assert(offsetof(FProsModsVersion, Status) == 0x000088, "Member 'FProsModsVersion::Status' has a wrong offset!");
static_assert(offsetof(FProsModsVersion, ModeratorMessages) == 0x000090, "Member 'FProsModsVersion::ModeratorMessages' has a wrong offset!");
static_assert(offsetof(FProsModsVersion, VersionName) == 0x0000A0, "Member 'FProsModsVersion::VersionName' has a wrong offset!");
static_assert(offsetof(FProsModsVersion, UpdatedAtTimestamp) == 0x0000B0, "Member 'FProsModsVersion::UpdatedAtTimestamp' has a wrong offset!");

// ScriptStruct Pros.ProsModsAccountInfo
// 0x0018 (0x0018 - 0x0000)
struct FProsModsAccountInfo final
{
public:
	EProsdkModLikeStatus                          Status;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDateTime                              SubscribedAtTimestamp;                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsSubscribed;                                     // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FProsModsAccountInfo) == 0x000008, "Wrong alignment on FProsModsAccountInfo");
static_assert(sizeof(FProsModsAccountInfo) == 0x000018, "Wrong size on FProsModsAccountInfo");
static_assert(offsetof(FProsModsAccountInfo, Status) == 0x000000, "Member 'FProsModsAccountInfo::Status' has a wrong offset!");
static_assert(offsetof(FProsModsAccountInfo, SubscribedAtTimestamp) == 0x000008, "Member 'FProsModsAccountInfo::SubscribedAtTimestamp' has a wrong offset!");
static_assert(offsetof(FProsModsAccountInfo, bIsSubscribed) == 0x000010, "Member 'FProsModsAccountInfo::bIsSubscribed' has a wrong offset!");

// ScriptStruct Pros.ProsModsDependencyInfo
// 0x0028 (0x0028 - 0x0000)
struct FProsModsDependencyInfo final
{
public:
	class FString                                 ID;                                                // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Name;                                              // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EProsdkModStatus                              Status;                                            // 0x0020(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FProsModsDependencyInfo) == 0x000008, "Wrong alignment on FProsModsDependencyInfo");
static_assert(sizeof(FProsModsDependencyInfo) == 0x000028, "Wrong size on FProsModsDependencyInfo");
static_assert(offsetof(FProsModsDependencyInfo, ID) == 0x000000, "Member 'FProsModsDependencyInfo::ID' has a wrong offset!");
static_assert(offsetof(FProsModsDependencyInfo, Name) == 0x000010, "Member 'FProsModsDependencyInfo::Name' has a wrong offset!");
static_assert(offsetof(FProsModsDependencyInfo, Status) == 0x000020, "Member 'FProsModsDependencyInfo::Status' has a wrong offset!");

// ScriptStruct Pros.ProsModsItem
// 0x0288 (0x0288 - 0x0000)
struct FProsModsItem final
{
public:
	class FString                                 ID;                                                // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FProsModsType                          ModType;                                           // 0x0010(0x0038)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FProsModsDescription                   Description;                                       // 0x0048(0x0118)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	EProsdkModStatus                              Status;                                            // 0x0160(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FProsModsTag>                   Tags;                                              // 0x0168(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FProsModsVersion                       Version;                                           // 0x0178(0x00B8)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FProsModsSocial                        Social;                                            // 0x0230(0x0010)(BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	struct FProsModsAccountInfo                   AccountModInfo;                                    // 0x0240(0x0018)(BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	TArray<struct FProsModsDependencyInfo>        ThisDependsOn;                                     // 0x0258(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FProsModsDependencyInfo>        OtherDependsOnThis;                                // 0x0268(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	class FString                                 CollectionID;                                      // 0x0278(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FProsModsItem) == 0x000008, "Wrong alignment on FProsModsItem");
static_assert(sizeof(FProsModsItem) == 0x000288, "Wrong size on FProsModsItem");
static_assert(offsetof(FProsModsItem, ID) == 0x000000, "Member 'FProsModsItem::ID' has a wrong offset!");
static_assert(offsetof(FProsModsItem, ModType) == 0x000010, "Member 'FProsModsItem::ModType' has a wrong offset!");
static_assert(offsetof(FProsModsItem, Description) == 0x000048, "Member 'FProsModsItem::Description' has a wrong offset!");
static_assert(offsetof(FProsModsItem, Status) == 0x000160, "Member 'FProsModsItem::Status' has a wrong offset!");
static_assert(offsetof(FProsModsItem, Tags) == 0x000168, "Member 'FProsModsItem::Tags' has a wrong offset!");
static_assert(offsetof(FProsModsItem, Version) == 0x000178, "Member 'FProsModsItem::Version' has a wrong offset!");
static_assert(offsetof(FProsModsItem, Social) == 0x000230, "Member 'FProsModsItem::Social' has a wrong offset!");
static_assert(offsetof(FProsModsItem, AccountModInfo) == 0x000240, "Member 'FProsModsItem::AccountModInfo' has a wrong offset!");
static_assert(offsetof(FProsModsItem, ThisDependsOn) == 0x000258, "Member 'FProsModsItem::ThisDependsOn' has a wrong offset!");
static_assert(offsetof(FProsModsItem, OtherDependsOnThis) == 0x000268, "Member 'FProsModsItem::OtherDependsOnThis' has a wrong offset!");
static_assert(offsetof(FProsModsItem, CollectionID) == 0x000278, "Member 'FProsModsItem::CollectionID' has a wrong offset!");

// ScriptStruct Pros.ProsBannerConfig
// 0x0018 (0x0018 - 0x0000)
struct FProsBannerConfig final
{
public:
	int32                                         DisplayMs;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EProsdkBannerSystemMode                       Mode;                                              // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FProsBannerSpace>               Spaces;                                            // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FProsBannerConfig) == 0x000008, "Wrong alignment on FProsBannerConfig");
static_assert(sizeof(FProsBannerConfig) == 0x000018, "Wrong size on FProsBannerConfig");
static_assert(offsetof(FProsBannerConfig, DisplayMs) == 0x000000, "Member 'FProsBannerConfig::DisplayMs' has a wrong offset!");
static_assert(offsetof(FProsBannerConfig, Mode) == 0x000004, "Member 'FProsBannerConfig::Mode' has a wrong offset!");
static_assert(offsetof(FProsBannerConfig, Spaces) == 0x000008, "Member 'FProsBannerConfig::Spaces' has a wrong offset!");

// ScriptStruct Pros.ProsModsComplaintType
// 0x0020 (0x0020 - 0x0000)
struct FProsModsComplaintType final
{
public:
	class FString                                 ID;                                                // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FProsLocDesc>                   Messages;                                          // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FProsModsComplaintType) == 0x000008, "Wrong alignment on FProsModsComplaintType");
static_assert(sizeof(FProsModsComplaintType) == 0x000020, "Wrong size on FProsModsComplaintType");
static_assert(offsetof(FProsModsComplaintType, ID) == 0x000000, "Member 'FProsModsComplaintType::ID' has a wrong offset!");
static_assert(offsetof(FProsModsComplaintType, Messages) == 0x000010, "Member 'FProsModsComplaintType::Messages' has a wrong offset!");

// ScriptStruct Pros.ProsModsComplaintTypeArray
// 0x0010 (0x0010 - 0x0000)
struct FProsModsComplaintTypeArray final
{
public:
	TArray<struct FProsModsComplaintType>         ModsComplaints;                                    // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FProsModsComplaintTypeArray) == 0x000008, "Wrong alignment on FProsModsComplaintTypeArray");
static_assert(sizeof(FProsModsComplaintTypeArray) == 0x000010, "Wrong size on FProsModsComplaintTypeArray");
static_assert(offsetof(FProsModsComplaintTypeArray, ModsComplaints) == 0x000000, "Member 'FProsModsComplaintTypeArray::ModsComplaints' has a wrong offset!");

// ScriptStruct Pros.ProsContainerChunkInfo
// 0x0020 (0x0020 - 0x0000)
struct FProsContainerChunkInfo final
{
public:
	int64                                         Number;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Key;                                               // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         DataSize;                                          // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FProsContainerChunkInfo) == 0x000008, "Wrong alignment on FProsContainerChunkInfo");
static_assert(sizeof(FProsContainerChunkInfo) == 0x000020, "Wrong size on FProsContainerChunkInfo");
static_assert(offsetof(FProsContainerChunkInfo, Number) == 0x000000, "Member 'FProsContainerChunkInfo::Number' has a wrong offset!");
static_assert(offsetof(FProsContainerChunkInfo, Key) == 0x000008, "Member 'FProsContainerChunkInfo::Key' has a wrong offset!");
static_assert(offsetof(FProsContainerChunkInfo, DataSize) == 0x000018, "Member 'FProsContainerChunkInfo::DataSize' has a wrong offset!");

// ScriptStruct Pros.ProsContainerInfo
// 0x0020 (0x0020 - 0x0000)
struct FProsContainerInfo final
{
public:
	class FString                                 ContainerId;                                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FProsContainerChunkInfo>        Chunks;                                            // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FProsContainerInfo) == 0x000008, "Wrong alignment on FProsContainerInfo");
static_assert(sizeof(FProsContainerInfo) == 0x000020, "Wrong size on FProsContainerInfo");
static_assert(offsetof(FProsContainerInfo, ContainerId) == 0x000000, "Member 'FProsContainerInfo::ContainerId' has a wrong offset!");
static_assert(offsetof(FProsContainerInfo, Chunks) == 0x000010, "Member 'FProsContainerInfo::Chunks' has a wrong offset!");

// ScriptStruct Pros.ProsModsTagGroup
// 0x0048 (0x0048 - 0x0000)
struct FProsModsTagGroup final
{
public:
	class FString                                 Name;                                              // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 LocalizationID;                                    // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FProsLocDesc>                   Localizations;                                     // 0x0020(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FProsModsTag>                   Tags;                                              // 0x0030(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          MultipleChoice;                                    // 0x0040(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Order;                                             // 0x0044(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FProsModsTagGroup) == 0x000008, "Wrong alignment on FProsModsTagGroup");
static_assert(sizeof(FProsModsTagGroup) == 0x000048, "Wrong size on FProsModsTagGroup");
static_assert(offsetof(FProsModsTagGroup, Name) == 0x000000, "Member 'FProsModsTagGroup::Name' has a wrong offset!");
static_assert(offsetof(FProsModsTagGroup, LocalizationID) == 0x000010, "Member 'FProsModsTagGroup::LocalizationID' has a wrong offset!");
static_assert(offsetof(FProsModsTagGroup, Localizations) == 0x000020, "Member 'FProsModsTagGroup::Localizations' has a wrong offset!");
static_assert(offsetof(FProsModsTagGroup, Tags) == 0x000030, "Member 'FProsModsTagGroup::Tags' has a wrong offset!");
static_assert(offsetof(FProsModsTagGroup, MultipleChoice) == 0x000040, "Member 'FProsModsTagGroup::MultipleChoice' has a wrong offset!");
static_assert(offsetof(FProsModsTagGroup, Order) == 0x000044, "Member 'FProsModsTagGroup::Order' has a wrong offset!");

// ScriptStruct Pros.ProsCrossSaveElement
// 0x0030 (0x0030 - 0x0000)
struct FProsCrossSaveElement final
{
public:
	class FString                                 Key;                                               // 0x0000(0x0010)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<uint8>                                 Data;                                              // 0x0010(0x0010)(BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_20[0x10];                                      // 0x0020(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FProsCrossSaveElement) == 0x000008, "Wrong alignment on FProsCrossSaveElement");
static_assert(sizeof(FProsCrossSaveElement) == 0x000030, "Wrong size on FProsCrossSaveElement");
static_assert(offsetof(FProsCrossSaveElement, Key) == 0x000000, "Member 'FProsCrossSaveElement::Key' has a wrong offset!");
static_assert(offsetof(FProsCrossSaveElement, Data) == 0x000010, "Member 'FProsCrossSaveElement::Data' has a wrong offset!");

// ScriptStruct Pros.ProsCrossSaveSnapshot
// 0x0040 (0x0040 - 0x0000)
struct FProsCrossSaveSnapshot final
{
public:
	class FString                                 ContentType;                                       // 0x0000(0x0010)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Description;                                       // 0x0010(0x0010)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FProsCrossSaveElement>          Elements;                                          // 0x0020(0x0010)(BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FProsCrossSaveSnapshot) == 0x000008, "Wrong alignment on FProsCrossSaveSnapshot");
static_assert(sizeof(FProsCrossSaveSnapshot) == 0x000040, "Wrong size on FProsCrossSaveSnapshot");
static_assert(offsetof(FProsCrossSaveSnapshot, ContentType) == 0x000000, "Member 'FProsCrossSaveSnapshot::ContentType' has a wrong offset!");
static_assert(offsetof(FProsCrossSaveSnapshot, Description) == 0x000010, "Member 'FProsCrossSaveSnapshot::Description' has a wrong offset!");
static_assert(offsetof(FProsCrossSaveSnapshot, Elements) == 0x000020, "Member 'FProsCrossSaveSnapshot::Elements' has a wrong offset!");

// ScriptStruct Pros.ProsCrossSaveSnapshotContainer
// 0x0040 (0x0040 - 0x0000)
struct FProsCrossSaveSnapshotContainer final
{
public:
	class FString                                 ContentType;                                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Description;                                       // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ContainerId;                                       // 0x0020(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FProsCrossSaveSnapshotContainer) == 0x000008, "Wrong alignment on FProsCrossSaveSnapshotContainer");
static_assert(sizeof(FProsCrossSaveSnapshotContainer) == 0x000040, "Wrong size on FProsCrossSaveSnapshotContainer");
static_assert(offsetof(FProsCrossSaveSnapshotContainer, ContentType) == 0x000000, "Member 'FProsCrossSaveSnapshotContainer::ContentType' has a wrong offset!");
static_assert(offsetof(FProsCrossSaveSnapshotContainer, Description) == 0x000010, "Member 'FProsCrossSaveSnapshotContainer::Description' has a wrong offset!");
static_assert(offsetof(FProsCrossSaveSnapshotContainer, ContainerId) == 0x000020, "Member 'FProsCrossSaveSnapshotContainer::ContainerId' has a wrong offset!");

// ScriptStruct Pros.ProsCrossSaveCompleteTransferResult
// 0x0080 (0x0080 - 0x0000)
struct FProsCrossSaveCompleteTransferResult final
{
public:
	struct FProsCrossSaveSnapshot                 Snapshot;                                          // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FProsCrossSaveSnapshotContainer        SnapshotContainer;                                 // 0x0040(0x0040)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
};
static_assert(alignof(FProsCrossSaveCompleteTransferResult) == 0x000008, "Wrong alignment on FProsCrossSaveCompleteTransferResult");
static_assert(sizeof(FProsCrossSaveCompleteTransferResult) == 0x000080, "Wrong size on FProsCrossSaveCompleteTransferResult");
static_assert(offsetof(FProsCrossSaveCompleteTransferResult, Snapshot) == 0x000000, "Member 'FProsCrossSaveCompleteTransferResult::Snapshot' has a wrong offset!");
static_assert(offsetof(FProsCrossSaveCompleteTransferResult, SnapshotContainer) == 0x000040, "Member 'FProsCrossSaveCompleteTransferResult::SnapshotContainer' has a wrong offset!");

// ScriptStruct Pros.ProsModsTypeArray
// 0x0010 (0x0010 - 0x0000)
struct FProsModsTypeArray final
{
public:
	TArray<struct FProsModsType>                  ModsTypes;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FProsModsTypeArray) == 0x000008, "Wrong alignment on FProsModsTypeArray");
static_assert(sizeof(FProsModsTypeArray) == 0x000010, "Wrong size on FProsModsTypeArray");
static_assert(offsetof(FProsModsTypeArray, ModsTypes) == 0x000000, "Member 'FProsModsTypeArray::ModsTypes' has a wrong offset!");

// ScriptStruct Pros.ProsAccountServiceQrCodeExpiration
// 0x0008 (0x0008 - 0x0000)
struct FProsAccountServiceQrCodeExpiration final
{
public:
	bool                                          bIsValid;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ExpirationSec;                                     // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FProsAccountServiceQrCodeExpiration) == 0x000004, "Wrong alignment on FProsAccountServiceQrCodeExpiration");
static_assert(sizeof(FProsAccountServiceQrCodeExpiration) == 0x000008, "Wrong size on FProsAccountServiceQrCodeExpiration");
static_assert(offsetof(FProsAccountServiceQrCodeExpiration, bIsValid) == 0x000000, "Member 'FProsAccountServiceQrCodeExpiration::bIsValid' has a wrong offset!");
static_assert(offsetof(FProsAccountServiceQrCodeExpiration, ExpirationSec) == 0x000004, "Member 'FProsAccountServiceQrCodeExpiration::ExpirationSec' has a wrong offset!");

// ScriptStruct Pros.ProsAccountServiceQrCode
// 0x0030 (0x0030 - 0x0000)
struct FProsAccountServiceQrCode final
{
public:
	bool                                          bIsValid;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Uri;                                               // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<uint8>                                 png;                                               // 0x0018(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FProsAccountServiceQrCodeExpiration    Expiration;                                        // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FProsAccountServiceQrCode) == 0x000008, "Wrong alignment on FProsAccountServiceQrCode");
static_assert(sizeof(FProsAccountServiceQrCode) == 0x000030, "Wrong size on FProsAccountServiceQrCode");
static_assert(offsetof(FProsAccountServiceQrCode, bIsValid) == 0x000000, "Member 'FProsAccountServiceQrCode::bIsValid' has a wrong offset!");
static_assert(offsetof(FProsAccountServiceQrCode, Uri) == 0x000008, "Member 'FProsAccountServiceQrCode::Uri' has a wrong offset!");
static_assert(offsetof(FProsAccountServiceQrCode, png) == 0x000018, "Member 'FProsAccountServiceQrCode::png' has a wrong offset!");
static_assert(offsetof(FProsAccountServiceQrCode, Expiration) == 0x000028, "Member 'FProsAccountServiceQrCode::Expiration' has a wrong offset!");

// ScriptStruct Pros.ProsAccountServiceAccountData
// 0x0038 (0x0038 - 0x0000)
struct FProsAccountServiceAccountData final
{
public:
	bool                                          bIsValid;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Name;                                              // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 NamePostFix;                                       // 0x0018(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 AvatarLink;                                        // 0x0028(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FProsAccountServiceAccountData) == 0x000008, "Wrong alignment on FProsAccountServiceAccountData");
static_assert(sizeof(FProsAccountServiceAccountData) == 0x000038, "Wrong size on FProsAccountServiceAccountData");
static_assert(offsetof(FProsAccountServiceAccountData, bIsValid) == 0x000000, "Member 'FProsAccountServiceAccountData::bIsValid' has a wrong offset!");
static_assert(offsetof(FProsAccountServiceAccountData, Name) == 0x000008, "Member 'FProsAccountServiceAccountData::Name' has a wrong offset!");
static_assert(offsetof(FProsAccountServiceAccountData, NamePostFix) == 0x000018, "Member 'FProsAccountServiceAccountData::NamePostFix' has a wrong offset!");
static_assert(offsetof(FProsAccountServiceAccountData, AvatarLink) == 0x000028, "Member 'FProsAccountServiceAccountData::AvatarLink' has a wrong offset!");

// ScriptStruct Pros.ProsAccountServiceStatus
// 0x0070 (0x0070 - 0x0000)
struct FProsAccountServiceStatus final
{
public:
	EProsAccountLinkStatus                        LinkState;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EProsAccountSystemMode                        SystemMode;                                        // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FProsAccountServiceQrCode              QrCode;                                            // 0x0008(0x0030)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
