#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Pros

#include "Basic.hpp"

#include "ProsSDK_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Pros_structs.hpp"


namespace SDK::Params
{

// Function Pros.ProsAccountService.Get
// 0x0008 (0x0008 - 0x0000)
struct ProsAccountService_Get final
{
public:
	class UProsAccountService*                    ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ProsAccountService_Get) == 0x000008, "Wrong alignment on ProsAccountService_Get");
static_assert(sizeof(ProsAccountService_Get) == 0x000008, "Wrong size on ProsAccountService_Get");
static_assert(offsetof(ProsAccountService_Get, ReturnValue) == 0x000000, "Member 'ProsAccountService_Get::ReturnValue' has a wrong offset!");

// Function Pros.ProsAccountService.TryGet
// 0x0008 (0x0008 - 0x0000)
struct ProsAccountService_TryGet final
{
public:
	class UProsAccountService*                    ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ProsAccountService_TryGet) == 0x000008, "Wrong alignment on ProsAccountService_TryGet");
static_assert(sizeof(ProsAccountService_TryGet) == 0x000008, "Wrong size on ProsAccountService_TryGet");
static_assert(offsetof(ProsAccountService_TryGet, ReturnValue) == 0x000000, "Member 'ProsAccountService_TryGet::ReturnValue' has a wrong offset!");

// Function Pros.ProsAccountService.Connect
// 0x0004 (0x0004 - 0x0000)
struct ProsAccountService_Connect final
{
public:
	int32                                         LocalUserNum;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ProsAccountService_Connect) == 0x000004, "Wrong alignment on ProsAccountService_Connect");
static_assert(sizeof(ProsAccountService_Connect) == 0x000004, "Wrong size on ProsAccountService_Connect");
static_assert(offsetof(ProsAccountService_Connect, LocalUserNum) == 0x000000, "Member 'ProsAccountService_Connect::LocalUserNum' has a wrong offset!");

// Function Pros.ProsAccountService.Disconnect
// 0x0004 (0x0004 - 0x0000)
struct ProsAccountService_Disconnect final
{
public:
	int32                                         LocalUserNum;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ProsAccountService_Disconnect) == 0x000004, "Wrong alignment on ProsAccountService_Disconnect");
static_assert(sizeof(ProsAccountService_Disconnect) == 0x000004, "Wrong size on ProsAccountService_Disconnect");
static_assert(offsetof(ProsAccountService_Disconnect, LocalUserNum) == 0x000000, "Member 'ProsAccountService_Disconnect::LocalUserNum' has a wrong offset!");

// Function Pros.ProsAccountService.ExpiredQrCode
// 0x0004 (0x0004 - 0x0000)
struct ProsAccountService_ExpiredQrCode final
{
public:
	int32                                         LocalUserNum;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ProsAccountService_ExpiredQrCode) == 0x000004, "Wrong alignment on ProsAccountService_ExpiredQrCode");
static_assert(sizeof(ProsAccountService_ExpiredQrCode) == 0x000004, "Wrong size on ProsAccountService_ExpiredQrCode");
static_assert(offsetof(ProsAccountService_ExpiredQrCode, LocalUserNum) == 0x000000, "Member 'ProsAccountService_ExpiredQrCode::LocalUserNum' has a wrong offset!");

// Function Pros.ProsAccountService.GetLink
// 0x0008 (0x0008 - 0x0000)
struct ProsAccountService_GetLink final
{
public:
	int32                                         LocalUserNum;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EProsdkErrorCodeAccount                       ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ProsAccountService_GetLink) == 0x000004, "Wrong alignment on ProsAccountService_GetLink");
static_assert(sizeof(ProsAccountService_GetLink) == 0x000008, "Wrong size on ProsAccountService_GetLink");
static_assert(offsetof(ProsAccountService_GetLink, LocalUserNum) == 0x000000, "Member 'ProsAccountService_GetLink::LocalUserNum' has a wrong offset!");
static_assert(offsetof(ProsAccountService_GetLink, ReturnValue) == 0x000004, "Member 'ProsAccountService_GetLink::ReturnValue' has a wrong offset!");

// Function Pros.ProsAccountService.GetStatus
// 0x0078 (0x0078 - 0x0000)
struct ProsAccountService_GetStatus final
{
public:
	int32                                         LocalUserNum;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FProsAccountServiceStatus              ReturnValue;                                       // 0x0008(0x0070)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ProsAccountService_GetStatus) == 0x000008, "Wrong alignment on ProsAccountService_GetStatus");
static_assert(sizeof(ProsAccountService_GetStatus) == 0x000078, "Wrong size on ProsAccountService_GetStatus");
static_assert(offsetof(ProsAccountService_GetStatus, LocalUserNum) == 0x000000, "Member 'ProsAccountService_GetStatus::LocalUserNum' has a wrong offset!");
static_assert(offsetof(ProsAccountService_GetStatus, ReturnValue) == 0x000008, "Member 'ProsAccountService_GetStatus::ReturnValue' has a wrong offset!");

// Function Pros.ProsAccountService.RequestQRLink
// 0x0008 (0x0008 - 0x0000)
struct ProsAccountService_RequestQRLink final
{
public:
	int32                                         LocalUserNum;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ProsAccountService_RequestQRLink) == 0x000004, "Wrong alignment on ProsAccountService_RequestQRLink");
static_assert(sizeof(ProsAccountService_RequestQRLink) == 0x000008, "Wrong size on ProsAccountService_RequestQRLink");
static_assert(offsetof(ProsAccountService_RequestQRLink, LocalUserNum) == 0x000000, "Member 'ProsAccountService_RequestQRLink::LocalUserNum' has a wrong offset!");
static_assert(offsetof(ProsAccountService_RequestQRLink, ReturnValue) == 0x000004, "Member 'ProsAccountService_RequestQRLink::ReturnValue' has a wrong offset!");

// Function Pros.ProsAccountService.TryToFetchStatus
// 0x0008 (0x0008 - 0x0000)
struct ProsAccountService_TryToFetchStatus final
{
public:
	int32                                         LocalUserNum;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EProsdkErrorCodeAccount                       ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ProsAccountService_TryToFetchStatus) == 0x000004, "Wrong alignment on ProsAccountService_TryToFetchStatus");
static_assert(sizeof(ProsAccountService_TryToFetchStatus) == 0x000008, "Wrong size on ProsAccountService_TryToFetchStatus");
static_assert(offsetof(ProsAccountService_TryToFetchStatus, LocalUserNum) == 0x000000, "Member 'ProsAccountService_TryToFetchStatus::LocalUserNum' has a wrong offset!");
static_assert(offsetof(ProsAccountService_TryToFetchStatus, ReturnValue) == 0x000004, "Member 'ProsAccountService_TryToFetchStatus::ReturnValue' has a wrong offset!");

// Function Pros.ProsAuthorizationService.Get
// 0x0008 (0x0008 - 0x0000)
struct ProsAuthorizationService_Get final
{
public:
	class UProsAuthorizationService*              ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ProsAuthorizationService_Get) == 0x000008, "Wrong alignment on ProsAuthorizationService_Get");
static_assert(sizeof(ProsAuthorizationService_Get) == 0x000008, "Wrong size on ProsAuthorizationService_Get");
static_assert(offsetof(ProsAuthorizationService_Get, ReturnValue) == 0x000000, "Member 'ProsAuthorizationService_Get::ReturnValue' has a wrong offset!");

// Function Pros.ProsAuthorizationService.GetDefaultDeveloperLogin
// 0x0018 (0x0018 - 0x0000)
struct ProsAuthorizationService_GetDefaultDeveloperLogin final
{
public:
	int32                                         LocalUserNum;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ProsAuthorizationService_GetDefaultDeveloperLogin) == 0x000008, "Wrong alignment on ProsAuthorizationService_GetDefaultDeveloperLogin");
static_assert(sizeof(ProsAuthorizationService_GetDefaultDeveloperLogin) == 0x000018, "Wrong size on ProsAuthorizationService_GetDefaultDeveloperLogin");
static_assert(offsetof(ProsAuthorizationService_GetDefaultDeveloperLogin, LocalUserNum) == 0x000000, "Member 'ProsAuthorizationService_GetDefaultDeveloperLogin::LocalUserNum' has a wrong offset!");
static_assert(offsetof(ProsAuthorizationService_GetDefaultDeveloperLogin, ReturnValue) == 0x000008, "Member 'ProsAuthorizationService_GetDefaultDeveloperLogin::ReturnValue' has a wrong offset!");

// Function Pros.ProsAuthorizationService.GetXSTSTokenConf
// 0x0020 (0x0020 - 0x0000)
struct ProsAuthorizationService_GetXSTSTokenConf final
{
public:
	struct FProsXSTSTokenConf                     ReturnValue;                                       // 0x0000(0x0020)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ProsAuthorizationService_GetXSTSTokenConf) == 0x000008, "Wrong alignment on ProsAuthorizationService_GetXSTSTokenConf");
static_assert(sizeof(ProsAuthorizationService_GetXSTSTokenConf) == 0x000020, "Wrong size on ProsAuthorizationService_GetXSTSTokenConf");
static_assert(offsetof(ProsAuthorizationService_GetXSTSTokenConf, ReturnValue) == 0x000000, "Member 'ProsAuthorizationService_GetXSTSTokenConf::ReturnValue' has a wrong offset!");

// Function Pros.ProsAuthorizationService.TryGet
// 0x0008 (0x0008 - 0x0000)
struct ProsAuthorizationService_TryGet final
{
public:
	class UProsAuthorizationService*              ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ProsAuthorizationService_TryGet) == 0x000008, "Wrong alignment on ProsAuthorizationService_TryGet");
static_assert(sizeof(ProsAuthorizationService_TryGet) == 0x000008, "Wrong size on ProsAuthorizationService_TryGet");
static_assert(offsetof(ProsAuthorizationService_TryGet, ReturnValue) == 0x000000, "Member 'ProsAuthorizationService_TryGet::ReturnValue' has a wrong offset!");

// Function Pros.ProsAuthorizationService.ClientConnectAmazonLuna
// 0x0020 (0x0020 - 0x0000)
struct ProsAuthorizationService_ClientConnectAmazonLuna final
{
public:
	int32                                         LocalUserNum;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 IdentityToken;                                     // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EProsdkErrorCodeAuthorization                 ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ProsAuthorizationService_ClientConnectAmazonLuna) == 0x000008, "Wrong alignment on ProsAuthorizationService_ClientConnectAmazonLuna");
static_assert(sizeof(ProsAuthorizationService_ClientConnectAmazonLuna) == 0x000020, "Wrong size on ProsAuthorizationService_ClientConnectAmazonLuna");
static_assert(offsetof(ProsAuthorizationService_ClientConnectAmazonLuna, LocalUserNum) == 0x000000, "Member 'ProsAuthorizationService_ClientConnectAmazonLuna::LocalUserNum' has a wrong offset!");
static_assert(offsetof(ProsAuthorizationService_ClientConnectAmazonLuna, IdentityToken) == 0x000008, "Member 'ProsAuthorizationService_ClientConnectAmazonLuna::IdentityToken' has a wrong offset!");
static_assert(offsetof(ProsAuthorizationService_ClientConnectAmazonLuna, ReturnValue) == 0x000018, "Member 'ProsAuthorizationService_ClientConnectAmazonLuna::ReturnValue' has a wrong offset!");

// Function Pros.ProsAuthorizationService.ClientConnectDeveloper
// 0x0020 (0x0020 - 0x0000)
struct ProsAuthorizationService_ClientConnectDeveloper final
{
public:
	int32                                         LocalUserNum;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 LogIn;                                             // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EProsProvider                                 ProviderOverride;                                  // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EProsdkErrorCodeAuthorization                 ReturnValue;                                       // 0x0019(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ProsAuthorizationService_ClientConnectDeveloper) == 0x000008, "Wrong alignment on ProsAuthorizationService_ClientConnectDeveloper");
static_assert(sizeof(ProsAuthorizationService_ClientConnectDeveloper) == 0x000020, "Wrong size on ProsAuthorizationService_ClientConnectDeveloper");
static_assert(offsetof(ProsAuthorizationService_ClientConnectDeveloper, LocalUserNum) == 0x000000, "Member 'ProsAuthorizationService_ClientConnectDeveloper::LocalUserNum' has a wrong offset!");
static_assert(offsetof(ProsAuthorizationService_ClientConnectDeveloper, LogIn) == 0x000008, "Member 'ProsAuthorizationService_ClientConnectDeveloper::LogIn' has a wrong offset!");
static_assert(offsetof(ProsAuthorizationService_ClientConnectDeveloper, ProviderOverride) == 0x000018, "Member 'ProsAuthorizationService_ClientConnectDeveloper::ProviderOverride' has a wrong offset!");
static_assert(offsetof(ProsAuthorizationService_ClientConnectDeveloper, ReturnValue) == 0x000019, "Member 'ProsAuthorizationService_ClientConnectDeveloper::ReturnValue' has a wrong offset!");

// Function Pros.ProsAuthorizationService.ClientConnectEpicOnlineServices
// 0x0020 (0x0020 - 0x0000)
struct ProsAuthorizationService_ClientConnectEpicOnlineServices final
{
public:
	int32                                         LocalUserNum;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 AuthAccessToken;                                   // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EProsdkErrorCodeAuthorization                 ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ProsAuthorizationService_ClientConnectEpicOnlineServices) == 0x000008, "Wrong alignment on ProsAuthorizationService_ClientConnectEpicOnlineServices");
static_assert(sizeof(ProsAuthorizationService_ClientConnectEpicOnlineServices) == 0x000020, "Wrong size on ProsAuthorizationService_ClientConnectEpicOnlineServices");
static_assert(offsetof(ProsAuthorizationService_ClientConnectEpicOnlineServices, LocalUserNum) == 0x000000, "Member 'ProsAuthorizationService_ClientConnectEpicOnlineServices::LocalUserNum' has a wrong offset!");
static_assert(offsetof(ProsAuthorizationService_ClientConnectEpicOnlineServices, AuthAccessToken) == 0x000008, "Member 'ProsAuthorizationService_ClientConnectEpicOnlineServices::AuthAccessToken' has a wrong offset!");
static_assert(offsetof(ProsAuthorizationService_ClientConnectEpicOnlineServices, ReturnValue) == 0x000018, "Member 'ProsAuthorizationService_ClientConnectEpicOnlineServices::ReturnValue' has a wrong offset!");

// Function Pros.ProsAuthorizationService.ClientConnectNintendo
// 0x0020 (0x0020 - 0x0000)
struct ProsAuthorizationService_ClientConnectNintendo final
{
public:
	int32                                         LocalUserNum;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 IdentityToken;                                     // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EProsdkErrorCodeAuthorization                 ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ProsAuthorizationService_ClientConnectNintendo) == 0x000008, "Wrong alignment on ProsAuthorizationService_ClientConnectNintendo");
static_assert(sizeof(ProsAuthorizationService_ClientConnectNintendo) == 0x000020, "Wrong size on ProsAuthorizationService_ClientConnectNintendo");
static_assert(offsetof(ProsAuthorizationService_ClientConnectNintendo, LocalUserNum) == 0x000000, "Member 'ProsAuthorizationService_ClientConnectNintendo::LocalUserNum' has a wrong offset!");
static_assert(offsetof(ProsAuthorizationService_ClientConnectNintendo, IdentityToken) == 0x000008, "Member 'ProsAuthorizationService_ClientConnectNintendo::IdentityToken' has a wrong offset!");
static_assert(offsetof(ProsAuthorizationService_ClientConnectNintendo, ReturnValue) == 0x000018, "Member 'ProsAuthorizationService_ClientConnectNintendo::ReturnValue' has a wrong offset!");

// Function Pros.ProsAuthorizationService.ClientConnectOculus
// 0x0028 (0x0028 - 0x0000)
struct ProsAuthorizationService_ClientConnectOculus final
{
public:
	int32                                         LocalUserNum;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Nonce;                                             // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         UserId;                                            // 0x0018(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EProsdkErrorCodeAuthorization                 ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ProsAuthorizationService_ClientConnectOculus) == 0x000008, "Wrong alignment on ProsAuthorizationService_ClientConnectOculus");
static_assert(sizeof(ProsAuthorizationService_ClientConnectOculus) == 0x000028, "Wrong size on ProsAuthorizationService_ClientConnectOculus");
static_assert(offsetof(ProsAuthorizationService_ClientConnectOculus, LocalUserNum) == 0x000000, "Member 'ProsAuthorizationService_ClientConnectOculus::LocalUserNum' has a wrong offset!");
static_assert(offsetof(ProsAuthorizationService_ClientConnectOculus, Nonce) == 0x000008, "Member 'ProsAuthorizationService_ClientConnectOculus::Nonce' has a wrong offset!");
static_assert(offsetof(ProsAuthorizationService_ClientConnectOculus, UserId) == 0x000018, "Member 'ProsAuthorizationService_ClientConnectOculus::UserId' has a wrong offset!");
static_assert(offsetof(ProsAuthorizationService_ClientConnectOculus, ReturnValue) == 0x000020, "Member 'ProsAuthorizationService_ClientConnectOculus::ReturnValue' has a wrong offset!");

// Function Pros.ProsAuthorizationService.ClientConnectPsnCode
// 0x0020 (0x0020 - 0x0000)
struct ProsAuthorizationService_ClientConnectPsnCode final
{
public:
	int32                                         LocalUserNum;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 AuthCode;                                          // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         IssuerId;                                          // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EProsdkErrorCodeAuthorization                 ReturnValue;                                       // 0x001C(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ProsAuthorizationService_ClientConnectPsnCode) == 0x000008, "Wrong alignment on ProsAuthorizationService_ClientConnectPsnCode");
static_assert(sizeof(ProsAuthorizationService_ClientConnectPsnCode) == 0x000020, "Wrong size on ProsAuthorizationService_ClientConnectPsnCode");
static_assert(offsetof(ProsAuthorizationService_ClientConnectPsnCode, LocalUserNum) == 0x000000, "Member 'ProsAuthorizationService_ClientConnectPsnCode::LocalUserNum' has a wrong offset!");
static_assert(offsetof(ProsAuthorizationService_ClientConnectPsnCode, AuthCode) == 0x000008, "Member 'ProsAuthorizationService_ClientConnectPsnCode::AuthCode' has a wrong offset!");
static_assert(offsetof(ProsAuthorizationService_ClientConnectPsnCode, IssuerId) == 0x000018, "Member 'ProsAuthorizationService_ClientConnectPsnCode::IssuerId' has a wrong offset!");
static_assert(offsetof(ProsAuthorizationService_ClientConnectPsnCode, ReturnValue) == 0x00001C, "Member 'ProsAuthorizationService_ClientConnectPsnCode::ReturnValue' has a wrong offset!");

// Function Pros.ProsAuthorizationService.ClientConnectPsnToken
// 0x0020 (0x0020 - 0x0000)
struct ProsAuthorizationService_ClientConnectPsnToken final
{
public:
	int32                                         LocalUserNum;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 IdToken;                                           // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EProsdkErrorCodeAuthorization                 ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ProsAuthorizationService_ClientConnectPsnToken) == 0x000008, "Wrong alignment on ProsAuthorizationService_ClientConnectPsnToken");
static_assert(sizeof(ProsAuthorizationService_ClientConnectPsnToken) == 0x000020, "Wrong size on ProsAuthorizationService_ClientConnectPsnToken");
static_assert(offsetof(ProsAuthorizationService_ClientConnectPsnToken, LocalUserNum) == 0x000000, "Member 'ProsAuthorizationService_ClientConnectPsnToken::LocalUserNum' has a wrong offset!");
static_assert(offsetof(ProsAuthorizationService_ClientConnectPsnToken, IdToken) == 0x000008, "Member 'ProsAuthorizationService_ClientConnectPsnToken::IdToken' has a wrong offset!");
static_assert(offsetof(ProsAuthorizationService_ClientConnectPsnToken, ReturnValue) == 0x000018, "Member 'ProsAuthorizationService_ClientConnectPsnToken::ReturnValue' has a wrong offset!");

// Function Pros.ProsAuthorizationService.ClientConnectSecondary
// 0x0020 (0x0020 - 0x0000)
struct ProsAuthorizationService_ClientConnectSecondary final
{
public:
	int32                                         LocalUserNum;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 PrimaryToken;                                      // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EProsdkErrorCodeAuthorization                 ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ProsAuthorizationService_ClientConnectSecondary) == 0x000008, "Wrong alignment on ProsAuthorizationService_ClientConnectSecondary");
static_assert(sizeof(ProsAuthorizationService_ClientConnectSecondary) == 0x000020, "Wrong size on ProsAuthorizationService_ClientConnectSecondary");
static_assert(offsetof(ProsAuthorizationService_ClientConnectSecondary, LocalUserNum) == 0x000000, "Member 'ProsAuthorizationService_ClientConnectSecondary::LocalUserNum' has a wrong offset!");
static_assert(offsetof(ProsAuthorizationService_ClientConnectSecondary, PrimaryToken) == 0x000008, "Member 'ProsAuthorizationService_ClientConnectSecondary::PrimaryToken' has a wrong offset!");
static_assert(offsetof(ProsAuthorizationService_ClientConnectSecondary, ReturnValue) == 0x000018, "Member 'ProsAuthorizationService_ClientConnectSecondary::ReturnValue' has a wrong offset!");

// Function Pros.ProsAuthorizationService.ClientConnectStadia
// 0x0020 (0x0020 - 0x0000)
struct ProsAuthorizationService_ClientConnectStadia final
{
public:
	int32                                         LocalUserNum;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 PlayerJwt;                                         // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EProsdkErrorCodeAuthorization                 ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ProsAuthorizationService_ClientConnectStadia) == 0x000008, "Wrong alignment on ProsAuthorizationService_ClientConnectStadia");
static_assert(sizeof(ProsAuthorizationService_ClientConnectStadia) == 0x000020, "Wrong size on ProsAuthorizationService_ClientConnectStadia");
static_assert(offsetof(ProsAuthorizationService_ClientConnectStadia, LocalUserNum) == 0x000000, "Member 'ProsAuthorizationService_ClientConnectStadia::LocalUserNum' has a wrong offset!");
static_assert(offsetof(ProsAuthorizationService_ClientConnectStadia, PlayerJwt) == 0x000008, "Member 'ProsAuthorizationService_ClientConnectStadia::PlayerJwt' has a wrong offset!");
static_assert(offsetof(ProsAuthorizationService_ClientConnectStadia, ReturnValue) == 0x000018, "Member 'ProsAuthorizationService_ClientConnectStadia::ReturnValue' has a wrong offset!");

// Function Pros.ProsAuthorizationService.ClientConnectSteam
// 0x0020 (0x0020 - 0x0000)
struct ProsAuthorizationService_ClientConnectSteam final
{
public:
	int32                                         LocalUserNum;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 SteamAuthSessionTicket;                            // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EProsdkErrorCodeAuthorization                 ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ProsAuthorizationService_ClientConnectSteam) == 0x000008, "Wrong alignment on ProsAuthorizationService_ClientConnectSteam");
static_assert(sizeof(ProsAuthorizationService_ClientConnectSteam) == 0x000020, "Wrong size on ProsAuthorizationService_ClientConnectSteam");
static_assert(offsetof(ProsAuthorizationService_ClientConnectSteam, LocalUserNum) == 0x000000, "Member 'ProsAuthorizationService_ClientConnectSteam::LocalUserNum' has a wrong offset!");
static_assert(offsetof(ProsAuthorizationService_ClientConnectSteam, SteamAuthSessionTicket) == 0x000008, "Member 'ProsAuthorizationService_ClientConnectSteam::SteamAuthSessionTicket' has a wrong offset!");
static_assert(offsetof(ProsAuthorizationService_ClientConnectSteam, ReturnValue) == 0x000018, "Member 'ProsAuthorizationService_ClientConnectSteam::ReturnValue' has a wrong offset!");

// Function Pros.ProsAuthorizationService.ClientConnectXbox
// 0x0020 (0x0020 - 0x0000)
struct ProsAuthorizationService_ClientConnectXbox final
{
public:
	int32                                         LocalUserNum;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 XboxToken;                                         // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EProsdkErrorCodeAuthorization                 ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ProsAuthorizationService_ClientConnectXbox) == 0x000008, "Wrong alignment on ProsAuthorizationService_ClientConnectXbox");
static_assert(sizeof(ProsAuthorizationService_ClientConnectXbox) == 0x000020, "Wrong size on ProsAuthorizationService_ClientConnectXbox");
static_assert(offsetof(ProsAuthorizationService_ClientConnectXbox, LocalUserNum) == 0x000000, "Member 'ProsAuthorizationService_ClientConnectXbox::LocalUserNum' has a wrong offset!");
static_assert(offsetof(ProsAuthorizationService_ClientConnectXbox, XboxToken) == 0x000008, "Member 'ProsAuthorizationService_ClientConnectXbox::XboxToken' has a wrong offset!");
static_assert(offsetof(ProsAuthorizationService_ClientConnectXbox, ReturnValue) == 0x000018, "Member 'ProsAuthorizationService_ClientConnectXbox::ReturnValue' has a wrong offset!");

// Function Pros.ProsAuthorizationService.ClientConnectXboxXstore
// 0x0030 (0x0030 - 0x0000)
struct ProsAuthorizationService_ClientConnectXboxXstore final
{
public:
	int32                                         LocalUserNum;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 XboxToken;                                         // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 XstoreLicenseToken;                                // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EProsdkErrorCodeAuthorization                 ReturnValue;                                       // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ProsAuthorizationService_ClientConnectXboxXstore) == 0x000008, "Wrong alignment on ProsAuthorizationService_ClientConnectXboxXstore");
static_assert(sizeof(ProsAuthorizationService_ClientConnectXboxXstore) == 0x000030, "Wrong size on ProsAuthorizationService_ClientConnectXboxXstore");
static_assert(offsetof(ProsAuthorizationService_ClientConnectXboxXstore, LocalUserNum) == 0x000000, "Member 'ProsAuthorizationService_ClientConnectXboxXstore::LocalUserNum' has a wrong offset!");
static_assert(offsetof(ProsAuthorizationService_ClientConnectXboxXstore, XboxToken) == 0x000008, "Member 'ProsAuthorizationService_ClientConnectXboxXstore::XboxToken' has a wrong offset!");
static_assert(offsetof(ProsAuthorizationService_ClientConnectXboxXstore, XstoreLicenseToken) == 0x000018, "Member 'ProsAuthorizationService_ClientConnectXboxXstore::XstoreLicenseToken' has a wrong offset!");
static_assert(offsetof(ProsAuthorizationService_ClientConnectXboxXstore, ReturnValue) == 0x000028, "Member 'ProsAuthorizationService_ClientConnectXboxXstore::ReturnValue' has a wrong offset!");

// Function Pros.ProsAuthorizationService.ClientCreate
// 0x0030 (0x0030 - 0x0000)
struct ProsAuthorizationService_ClientCreate final
{
public:
	int32                                         LocalUserNum;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 TitleSecret;                                       // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FPluginVersioned>               Plugins;                                           // 0x0018(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ProsAuthorizationService_ClientCreate) == 0x000008, "Wrong alignment on ProsAuthorizationService_ClientCreate");
static_assert(sizeof(ProsAuthorizationService_ClientCreate) == 0x000030, "Wrong size on ProsAuthorizationService_ClientCreate");
static_assert(offsetof(ProsAuthorizationService_ClientCreate, LocalUserNum) == 0x000000, "Member 'ProsAuthorizationService_ClientCreate::LocalUserNum' has a wrong offset!");
static_assert(offsetof(ProsAuthorizationService_ClientCreate, TitleSecret) == 0x000008, "Member 'ProsAuthorizationService_ClientCreate::TitleSecret' has a wrong offset!");
static_assert(offsetof(ProsAuthorizationService_ClientCreate, Plugins) == 0x000018, "Member 'ProsAuthorizationService_ClientCreate::Plugins' has a wrong offset!");
static_assert(offsetof(ProsAuthorizationService_ClientCreate, ReturnValue) == 0x000028, "Member 'ProsAuthorizationService_ClientCreate::ReturnValue' has a wrong offset!");

// Function Pros.ProsAuthorizationService.ClientCreateFromConfig
// 0x0008 (0x0008 - 0x0000)
struct ProsAuthorizationService_ClientCreateFromConfig final
{
public:
	int32                                         LocalUserNum;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ProsAuthorizationService_ClientCreateFromConfig) == 0x000004, "Wrong alignment on ProsAuthorizationService_ClientCreateFromConfig");
static_assert(sizeof(ProsAuthorizationService_ClientCreateFromConfig) == 0x000008, "Wrong size on ProsAuthorizationService_ClientCreateFromConfig");
static_assert(offsetof(ProsAuthorizationService_ClientCreateFromConfig, LocalUserNum) == 0x000000, "Member 'ProsAuthorizationService_ClientCreateFromConfig::LocalUserNum' has a wrong offset!");
static_assert(offsetof(ProsAuthorizationService_ClientCreateFromConfig, ReturnValue) == 0x000004, "Member 'ProsAuthorizationService_ClientCreateFromConfig::ReturnValue' has a wrong offset!");

// Function Pros.ProsAuthorizationService.ClientCreatePrimaryToken
// 0x0018 (0x0018 - 0x0000)
struct ProsAuthorizationService_ClientCreatePrimaryToken final
{
public:
	int32                                         LocalUserNum;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ProsAuthorizationService_ClientCreatePrimaryToken) == 0x000008, "Wrong alignment on ProsAuthorizationService_ClientCreatePrimaryToken");
static_assert(sizeof(ProsAuthorizationService_ClientCreatePrimaryToken) == 0x000018, "Wrong size on ProsAuthorizationService_ClientCreatePrimaryToken");
static_assert(offsetof(ProsAuthorizationService_ClientCreatePrimaryToken, LocalUserNum) == 0x000000, "Member 'ProsAuthorizationService_ClientCreatePrimaryToken::LocalUserNum' has a wrong offset!");
static_assert(offsetof(ProsAuthorizationService_ClientCreatePrimaryToken, ReturnValue) == 0x000008, "Member 'ProsAuthorizationService_ClientCreatePrimaryToken::ReturnValue' has a wrong offset!");

// Function Pros.ProsAuthorizationService.ClientDisconnect
// 0x0004 (0x0004 - 0x0000)
struct ProsAuthorizationService_ClientDisconnect final
{
public:
	int32                                         LocalUserNum;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ProsAuthorizationService_ClientDisconnect) == 0x000004, "Wrong alignment on ProsAuthorizationService_ClientDisconnect");
static_assert(sizeof(ProsAuthorizationService_ClientDisconnect) == 0x000004, "Wrong size on ProsAuthorizationService_ClientDisconnect");
static_assert(offsetof(ProsAuthorizationService_ClientDisconnect, LocalUserNum) == 0x000000, "Member 'ProsAuthorizationService_ClientDisconnect::LocalUserNum' has a wrong offset!");

// Function Pros.ProsAuthorizationService.ClientGetAccessTokenBare
// 0x0018 (0x0018 - 0x0000)
struct ProsAuthorizationService_ClientGetAccessTokenBare final
{
public:
	int32                                         LocalUserNum;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ProsAuthorizationService_ClientGetAccessTokenBare) == 0x000008, "Wrong alignment on ProsAuthorizationService_ClientGetAccessTokenBare");
static_assert(sizeof(ProsAuthorizationService_ClientGetAccessTokenBare) == 0x000018, "Wrong size on ProsAuthorizationService_ClientGetAccessTokenBare");
static_assert(offsetof(ProsAuthorizationService_ClientGetAccessTokenBare, LocalUserNum) == 0x000000, "Member 'ProsAuthorizationService_ClientGetAccessTokenBare::LocalUserNum' has a wrong offset!");
static_assert(offsetof(ProsAuthorizationService_ClientGetAccessTokenBare, ReturnValue) == 0x000008, "Member 'ProsAuthorizationService_ClientGetAccessTokenBare::ReturnValue' has a wrong offset!");

// Function Pros.ProsAuthorizationService.ClientGetAccessTokenForHeader
// 0x0018 (0x0018 - 0x0000)
struct ProsAuthorizationService_ClientGetAccessTokenForHeader final
{
public:
	int32                                         LocalUserNum;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ProsAuthorizationService_ClientGetAccessTokenForHeader) == 0x000008, "Wrong alignment on ProsAuthorizationService_ClientGetAccessTokenForHeader");
static_assert(sizeof(ProsAuthorizationService_ClientGetAccessTokenForHeader) == 0x000018, "Wrong size on ProsAuthorizationService_ClientGetAccessTokenForHeader");
static_assert(offsetof(ProsAuthorizationService_ClientGetAccessTokenForHeader, LocalUserNum) == 0x000000, "Member 'ProsAuthorizationService_ClientGetAccessTokenForHeader::LocalUserNum' has a wrong offset!");
static_assert(offsetof(ProsAuthorizationService_ClientGetAccessTokenForHeader, ReturnValue) == 0x000008, "Member 'ProsAuthorizationService_ClientGetAccessTokenForHeader::ReturnValue' has a wrong offset!");

// Function Pros.ProsAuthorizationService.ClientGetConnectionState
// 0x0008 (0x0008 - 0x0000)
struct ProsAuthorizationService_ClientGetConnectionState final
{
public:
	int32                                         LocalUserNum;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EProsServiceState                             ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ProsAuthorizationService_ClientGetConnectionState) == 0x000004, "Wrong alignment on ProsAuthorizationService_ClientGetConnectionState");
static_assert(sizeof(ProsAuthorizationService_ClientGetConnectionState) == 0x000008, "Wrong size on ProsAuthorizationService_ClientGetConnectionState");
static_assert(offsetof(ProsAuthorizationService_ClientGetConnectionState, LocalUserNum) == 0x000000, "Member 'ProsAuthorizationService_ClientGetConnectionState::LocalUserNum' has a wrong offset!");
static_assert(offsetof(ProsAuthorizationService_ClientGetConnectionState, ReturnValue) == 0x000004, "Member 'ProsAuthorizationService_ClientGetConnectionState::ReturnValue' has a wrong offset!");

// Function Pros.ProsAuthorizationService.ClientGetDeveloperLogin
// 0x0018 (0x0018 - 0x0000)
struct ProsAuthorizationService_ClientGetDeveloperLogin final
{
public:
	int32                                         LocalUserNum;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ProsAuthorizationService_ClientGetDeveloperLogin) == 0x000008, "Wrong alignment on ProsAuthorizationService_ClientGetDeveloperLogin");
static_assert(sizeof(ProsAuthorizationService_ClientGetDeveloperLogin) == 0x000018, "Wrong size on ProsAuthorizationService_ClientGetDeveloperLogin");
static_assert(offsetof(ProsAuthorizationService_ClientGetDeveloperLogin, LocalUserNum) == 0x000000, "Member 'ProsAuthorizationService_ClientGetDeveloperLogin::LocalUserNum' has a wrong offset!");
static_assert(offsetof(ProsAuthorizationService_ClientGetDeveloperLogin, ReturnValue) == 0x000008, "Member 'ProsAuthorizationService_ClientGetDeveloperLogin::ReturnValue' has a wrong offset!");

// Function Pros.ProsAuthorizationService.ClientGetExternalIdentityToken
// 0x0018 (0x0018 - 0x0000)
struct ProsAuthorizationService_ClientGetExternalIdentityToken final
{
public:
	int32                                         LocalUserNum;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ProsAuthorizationService_ClientGetExternalIdentityToken) == 0x000008, "Wrong alignment on ProsAuthorizationService_ClientGetExternalIdentityToken");
static_assert(sizeof(ProsAuthorizationService_ClientGetExternalIdentityToken) == 0x000018, "Wrong size on ProsAuthorizationService_ClientGetExternalIdentityToken");
static_assert(offsetof(ProsAuthorizationService_ClientGetExternalIdentityToken, LocalUserNum) == 0x000000, "Member 'ProsAuthorizationService_ClientGetExternalIdentityToken::LocalUserNum' has a wrong offset!");
static_assert(offsetof(ProsAuthorizationService_ClientGetExternalIdentityToken, ReturnValue) == 0x000008, "Member 'ProsAuthorizationService_ClientGetExternalIdentityToken::ReturnValue' has a wrong offset!");

// Function Pros.ProsAuthorizationService.ClientGetKernelSessionIdString
// 0x0018 (0x0018 - 0x0000)
struct ProsAuthorizationService_ClientGetKernelSessionIdString final
{
public:
	int32                                         LocalUserNum;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ProsAuthorizationService_ClientGetKernelSessionIdString) == 0x000008, "Wrong alignment on ProsAuthorizationService_ClientGetKernelSessionIdString");
static_assert(sizeof(ProsAuthorizationService_ClientGetKernelSessionIdString) == 0x000018, "Wrong size on ProsAuthorizationService_ClientGetKernelSessionIdString");
static_assert(offsetof(ProsAuthorizationService_ClientGetKernelSessionIdString, LocalUserNum) == 0x000000, "Member 'ProsAuthorizationService_ClientGetKernelSessionIdString::LocalUserNum' has a wrong offset!");
static_assert(offsetof(ProsAuthorizationService_ClientGetKernelSessionIdString, ReturnValue) == 0x000008, "Member 'ProsAuthorizationService_ClientGetKernelSessionIdString::ReturnValue' has a wrong offset!");

// Function Pros.ProsAuthorizationService.ClientGetKernelSessionIdVisualAlias
// 0x0018 (0x0018 - 0x0000)
struct ProsAuthorizationService_ClientGetKernelSessionIdVisualAlias final
{
public:
	int32                                         LocalUserNum;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ProsAuthorizationService_ClientGetKernelSessionIdVisualAlias) == 0x000008, "Wrong alignment on ProsAuthorizationService_ClientGetKernelSessionIdVisualAlias");
static_assert(sizeof(ProsAuthorizationService_ClientGetKernelSessionIdVisualAlias) == 0x000018, "Wrong size on ProsAuthorizationService_ClientGetKernelSessionIdVisualAlias");
static_assert(offsetof(ProsAuthorizationService_ClientGetKernelSessionIdVisualAlias, LocalUserNum) == 0x000000, "Member 'ProsAuthorizationService_ClientGetKernelSessionIdVisualAlias::LocalUserNum' has a wrong offset!");
static_assert(offsetof(ProsAuthorizationService_ClientGetKernelSessionIdVisualAlias, ReturnValue) == 0x000008, "Member 'ProsAuthorizationService_ClientGetKernelSessionIdVisualAlias::ReturnValue' has a wrong offset!");

// Function Pros.ProsAuthorizationService.ClientGetMaintenanceInfo
// 0x0020 (0x0020 - 0x0000)
struct ProsAuthorizationService_ClientGetMaintenanceInfo final
{
public:
	int32                                         LocalUserNum;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FProsMaintInfo                         ReturnValue;                                       // 0x0008(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ProsAuthorizationService_ClientGetMaintenanceInfo) == 0x000008, "Wrong alignment on ProsAuthorizationService_ClientGetMaintenanceInfo");
static_assert(sizeof(ProsAuthorizationService_ClientGetMaintenanceInfo) == 0x000020, "Wrong size on ProsAuthorizationService_ClientGetMaintenanceInfo");
static_assert(offsetof(ProsAuthorizationService_ClientGetMaintenanceInfo, LocalUserNum) == 0x000000, "Member 'ProsAuthorizationService_ClientGetMaintenanceInfo::LocalUserNum' has a wrong offset!");
static_assert(offsetof(ProsAuthorizationService_ClientGetMaintenanceInfo, ReturnValue) == 0x000008, "Member 'ProsAuthorizationService_ClientGetMaintenanceInfo::ReturnValue' has a wrong offset!");

// Function Pros.ProsAuthorizationService.ClientGetPluginEndpoint
// 0x0030 (0x0030 - 0x0000)
struct ProsAuthorizationService_ClientGetPluginEndpoint final
{
public:
	int32                                         LocalUserNum;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 PluginName;                                        // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPluginEndpoint                        ReturnValue;                                       // 0x0018(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ProsAuthorizationService_ClientGetPluginEndpoint) == 0x000008, "Wrong alignment on ProsAuthorizationService_ClientGetPluginEndpoint");
static_assert(sizeof(ProsAuthorizationService_ClientGetPluginEndpoint) == 0x000030, "Wrong size on ProsAuthorizationService_ClientGetPluginEndpoint");
static_assert(offsetof(ProsAuthorizationService_ClientGetPluginEndpoint, LocalUserNum) == 0x000000, "Member 'ProsAuthorizationService_ClientGetPluginEndpoint::LocalUserNum' has a wrong offset!");
static_assert(offsetof(ProsAuthorizationService_ClientGetPluginEndpoint, PluginName) == 0x000008, "Member 'ProsAuthorizationService_ClientGetPluginEndpoint::PluginName' has a wrong offset!");
static_assert(offsetof(ProsAuthorizationService_ClientGetPluginEndpoint, ReturnValue) == 0x000018, "Member 'ProsAuthorizationService_ClientGetPluginEndpoint::ReturnValue' has a wrong offset!");

// Function Pros.ProsAuthorizationService.ClientGetProsServiceState
// 0x0008 (0x0008 - 0x0000)
struct ProsAuthorizationService_ClientGetProsServiceState final
{
public:
	int32                                         LocalUserNum;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EProsServiceState                             ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ProsAuthorizationService_ClientGetProsServiceState) == 0x000004, "Wrong alignment on ProsAuthorizationService_ClientGetProsServiceState");
static_assert(sizeof(ProsAuthorizationService_ClientGetProsServiceState) == 0x000008, "Wrong size on ProsAuthorizationService_ClientGetProsServiceState");
static_assert(offsetof(ProsAuthorizationService_ClientGetProsServiceState, LocalUserNum) == 0x000000, "Member 'ProsAuthorizationService_ClientGetProsServiceState::LocalUserNum' has a wrong offset!");
