#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_AI_AttackWave

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct S_AI_AttackWave.S_AI_AttackWave
// 0x0028 (0x0028 - 0x0000)
struct FS_AI_AttackWave final
{
public:
	TArray<class UAIDefinition_BuildOrder*>       BuildOrders_5_F641766A49DAA0E9459CE3A34A6902E1;    // 0x0000(0x0010)(Edit, BlueprintVisible)
	double                                        AttackCooldown_Easy_11_CBE27ACC41BAF712E6573DB0A625C421; // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        AttackCooldown_Normal_15_387655D84E3E6081742A7FA217F39508; // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        AttackCooldown_Hard_17_5581C1FF4B9C3BB45C5FEE883D2B1309; // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FS_AI_AttackWave) == 0x000008, "Wrong alignment on FS_AI_AttackWave");
static_assert(sizeof(FS_AI_AttackWave) == 0x000028, "Wrong size on FS_AI_AttackWave");
static_assert(offsetof(FS_AI_AttackWave, BuildOrders_5_F641766A49DAA0E9459CE3A34A6902E1) == 0x000000, "Member 'FS_AI_AttackWave::BuildOrders_5_F641766A49DAA0E9459CE3A34A6902E1' has a wrong offset!");
static_assert(offsetof(FS_AI_AttackWave, AttackCooldown_Easy_11_CBE27ACC41BAF712E6573DB0A625C421) == 0x000010, "Member 'FS_AI_AttackWave::AttackCooldown_Easy_11_CBE27ACC41BAF712E6573DB0A625C421' has a wrong offset!");
static_assert(offsetof(FS_AI_AttackWave, AttackCooldown_Normal_15_387655D84E3E6081742A7FA217F39508) == 0x000018, "Member 'FS_AI_AttackWave::AttackCooldown_Normal_15_387655D84E3E6081742A7FA217F39508' has a wrong offset!");
static_assert(offsetof(FS_AI_AttackWave, AttackCooldown_Hard_17_5581C1FF4B9C3BB45C5FEE883D2B1309) == 0x000020, "Member 'FS_AI_AttackWave::AttackCooldown_Hard_17_5581C1FF4B9C3BB45C5FEE883D2B1309' has a wrong offset!");

}

