#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STRUCT_MenuBar_HighlightParams

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct STRUCT_MenuBar_HighlightParams.STRUCT_MenuBar_HighlightParams
// 0x0028 (0x0028 - 0x0000)
struct FSTRUCT_MenuBar_HighlightParams final
{
public:
	struct FVector2D                              Position_4_8E4BC9BE4CAB4EF22478318C5A37051B;       // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Size_5_745D48474F32CBC4D57415878DFB464E;           // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Opacity_8_4ADFE19D4AFDFC168CFBEA98CF259DEC;        // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FSTRUCT_MenuBar_HighlightParams) == 0x000008, "Wrong alignment on FSTRUCT_MenuBar_HighlightParams");
static_assert(sizeof(FSTRUCT_MenuBar_HighlightParams) == 0x000028, "Wrong size on FSTRUCT_MenuBar_HighlightParams");
static_assert(offsetof(FSTRUCT_MenuBar_HighlightParams, Position_4_8E4BC9BE4CAB4EF22478318C5A37051B) == 0x000000, "Member 'FSTRUCT_MenuBar_HighlightParams::Position_4_8E4BC9BE4CAB4EF22478318C5A37051B' has a wrong offset!");
static_assert(offsetof(FSTRUCT_MenuBar_HighlightParams, Size_5_745D48474F32CBC4D57415878DFB464E) == 0x000010, "Member 'FSTRUCT_MenuBar_HighlightParams::Size_5_745D48474F32CBC4D57415878DFB464E' has a wrong offset!");
static_assert(offsetof(FSTRUCT_MenuBar_HighlightParams, Opacity_8_4ADFE19D4AFDFC168CFBEA98CF259DEC) == 0x000020, "Member 'FSTRUCT_MenuBar_HighlightParams::Opacity_8_4ADFE19D4AFDFC168CFBEA98CF259DEC' has a wrong offset!");

}

