#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TedHUD_BP

#include "Basic.hpp"


namespace SDK::Params
{

// Function TedHUD_BP.TedHUD_BP_C.ShowScoreScreen
// 0x0001 (0x0001 - 0x0000)
struct TedHUD_BP_C_ShowScoreScreen final
{
public:
	bool                                          bInWinner;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TedHUD_BP_C_ShowScoreScreen) == 0x000001, "Wrong alignment on TedHUD_BP_C_ShowScoreScreen");
static_assert(sizeof(TedHUD_BP_C_ShowScoreScreen) == 0x000001, "Wrong size on TedHUD_BP_C_ShowScoreScreen");
static_assert(offsetof(TedHUD_BP_C_ShowScoreScreen, bInWinner) == 0x000000, "Member 'TedHUD_BP_C_ShowScoreScreen::bInWinner' has a wrong offset!");

// Function TedHUD_BP.TedHUD_BP_C.ShowEndGameScreen
// 0x0002 (0x0002 - 0x0000)
struct TedHUD_BP_C_ShowEndGameScreen final
{
public:
	bool                                          bWinner;                                           // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TedHUD_BP_C_ShowEndGameScreen) == 0x000001, "Wrong alignment on TedHUD_BP_C_ShowEndGameScreen");
static_assert(sizeof(TedHUD_BP_C_ShowEndGameScreen) == 0x000002, "Wrong size on TedHUD_BP_C_ShowEndGameScreen");
static_assert(offsetof(TedHUD_BP_C_ShowEndGameScreen, bWinner) == 0x000000, "Member 'TedHUD_BP_C_ShowEndGameScreen::bWinner' has a wrong offset!");
static_assert(offsetof(TedHUD_BP_C_ShowEndGameScreen, ReturnValue) == 0x000001, "Member 'TedHUD_BP_C_ShowEndGameScreen::ReturnValue' has a wrong offset!");

// Function TedHUD_BP.TedHUD_BP_C.ExecuteUbergraph_TedHUD_BP
// 0x0018 (0x0018 - 0x0000)
struct TedHUD_BP_C_ExecuteUbergraph_TedHUD_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bInWinner;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTedScoreMenuScreenContextObject*       CallFunc_New_ReturnValue;                          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_OpenMenuScreen_ReturnValue;               // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TedHUD_BP_C_ExecuteUbergraph_TedHUD_BP) == 0x000008, "Wrong alignment on TedHUD_BP_C_ExecuteUbergraph_TedHUD_BP");
static_assert(sizeof(TedHUD_BP_C_ExecuteUbergraph_TedHUD_BP) == 0x000018, "Wrong size on TedHUD_BP_C_ExecuteUbergraph_TedHUD_BP");
static_assert(offsetof(TedHUD_BP_C_ExecuteUbergraph_TedHUD_BP, EntryPoint) == 0x000000, "Member 'TedHUD_BP_C_ExecuteUbergraph_TedHUD_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(TedHUD_BP_C_ExecuteUbergraph_TedHUD_BP, K2Node_CustomEvent_bInWinner) == 0x000004, "Member 'TedHUD_BP_C_ExecuteUbergraph_TedHUD_BP::K2Node_CustomEvent_bInWinner' has a wrong offset!");
static_assert(offsetof(TedHUD_BP_C_ExecuteUbergraph_TedHUD_BP, CallFunc_New_ReturnValue) == 0x000008, "Member 'TedHUD_BP_C_ExecuteUbergraph_TedHUD_BP::CallFunc_New_ReturnValue' has a wrong offset!");
static_assert(offsetof(TedHUD_BP_C_ExecuteUbergraph_TedHUD_BP, CallFunc_OpenMenuScreen_ReturnValue) == 0x000010, "Member 'TedHUD_BP_C_ExecuteUbergraph_TedHUD_BP::CallFunc_OpenMenuScreen_ReturnValue' has a wrong offset!");

}

