#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TedUpgradeLogic_SecurityPlanPowerAdjustement

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Tempest_structs.hpp"


namespace SDK::Params
{

// Function TedUpgradeLogic_SecurityPlanPowerAdjustement.TedUpgradeLogic_SecurityPlanPowerAdjustement_C.K2_ApplyUpgrade
// 0x00B0 (0x00B0 - 0x0000)
struct TedUpgradeLogic_SecurityPlanPowerAdjustement_C_K2_ApplyUpgrade final
{
public:
	struct FTedActiveUpgrade                      InActiveUpgrade;                                   // 0x0000(0x0040)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)
	struct FTedActiveUpgrade                      K2Node_MakeStruct_TedActiveUpgrade;                // 0x0040(0x0040)(HasGetValueTypeHash)
	class UTedPlayerData*                         CallFunc_GetPlayerData_ReturnValue;                // 0x0080(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_GetOwnedTags_ReturnValue;                 // 0x0088(0x0020)(ConstParm)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TedUpgradeLogic_SecurityPlanPowerAdjustement_C_K2_ApplyUpgrade) == 0x000008, "Wrong alignment on TedUpgradeLogic_SecurityPlanPowerAdjustement_C_K2_ApplyUpgrade");
static_assert(sizeof(TedUpgradeLogic_SecurityPlanPowerAdjustement_C_K2_ApplyUpgrade) == 0x0000B0, "Wrong size on TedUpgradeLogic_SecurityPlanPowerAdjustement_C_K2_ApplyUpgrade");
static_assert(offsetof(TedUpgradeLogic_SecurityPlanPowerAdjustement_C_K2_ApplyUpgrade, InActiveUpgrade) == 0x000000, "Member 'TedUpgradeLogic_SecurityPlanPowerAdjustement_C_K2_ApplyUpgrade::InActiveUpgrade' has a wrong offset!");
static_assert(offsetof(TedUpgradeLogic_SecurityPlanPowerAdjustement_C_K2_ApplyUpgrade, K2Node_MakeStruct_TedActiveUpgrade) == 0x000040, "Member 'TedUpgradeLogic_SecurityPlanPowerAdjustement_C_K2_ApplyUpgrade::K2Node_MakeStruct_TedActiveUpgrade' has a wrong offset!");
static_assert(offsetof(TedUpgradeLogic_SecurityPlanPowerAdjustement_C_K2_ApplyUpgrade, CallFunc_GetPlayerData_ReturnValue) == 0x000080, "Member 'TedUpgradeLogic_SecurityPlanPowerAdjustement_C_K2_ApplyUpgrade::CallFunc_GetPlayerData_ReturnValue' has a wrong offset!");
static_assert(offsetof(TedUpgradeLogic_SecurityPlanPowerAdjustement_C_K2_ApplyUpgrade, CallFunc_GetOwnedTags_ReturnValue) == 0x000088, "Member 'TedUpgradeLogic_SecurityPlanPowerAdjustement_C_K2_ApplyUpgrade::CallFunc_GetOwnedTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(TedUpgradeLogic_SecurityPlanPowerAdjustement_C_K2_ApplyUpgrade, CallFunc_IsValid_ReturnValue) == 0x0000A8, "Member 'TedUpgradeLogic_SecurityPlanPowerAdjustement_C_K2_ApplyUpgrade::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(TedUpgradeLogic_SecurityPlanPowerAdjustement_C_K2_ApplyUpgrade, CallFunc_HasTag_ReturnValue) == 0x0000A9, "Member 'TedUpgradeLogic_SecurityPlanPowerAdjustement_C_K2_ApplyUpgrade::CallFunc_HasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(TedUpgradeLogic_SecurityPlanPowerAdjustement_C_K2_ApplyUpgrade, CallFunc_IsValid_ReturnValue_1) == 0x0000AA, "Member 'TedUpgradeLogic_SecurityPlanPowerAdjustement_C_K2_ApplyUpgrade::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

}

