#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Tempest

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "SlateCore_structs.hpp"
#include "SlateCore_classes.hpp"
#include "Tempest_structs.hpp"
#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"
#include "FogOfWar_structs.hpp"
#include "FogOfWar_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "NubAI_structs.hpp"
#include "NubAI_classes.hpp"
#include "NubCore_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameplayAbilities_classes.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "DeveloperSettings_classes.hpp"
#include "Pros_structs.hpp"
#include "EnhancedInput_structs.hpp"
#include "EnhancedInput_classes.hpp"
#include "AnimMontageSet_structs.hpp"
#include "GameplayCommands_structs.hpp"
#include "GameplayCommands_classes.hpp"
#include "CustomizableSequencerTracks_classes.hpp"
#include "PhysicsCore_structs.hpp"
#include "NubAudio_structs.hpp"
#include "InputCore_structs.hpp"
#include "FXSystemAnimNotifies_classes.hpp"
#include "SmartDataAsset_classes.hpp"
#include "ReplicationGraph_classes.hpp"
#include "SlipgateCheats_classes.hpp"
#include "NavGrid_structs.hpp"
#include "NavGrid_classes.hpp"
#include "ProsSDK_structs.hpp"
#include "RTSColor_structs.hpp"
#include "NubECS_classes.hpp"
#include "Hydra5_structs.hpp"
#include "ImgMedia_classes.hpp"
#include "LevelSequence_classes.hpp"
#include "Lobby_classes.hpp"
#include "NavigationSystem_classes.hpp"
#include "StructUtils_structs.hpp"
#include "SavedGame_classes.hpp"


namespace SDK
{

// Class Tempest.AICommander
// 0x0058 (0x0080 - 0x0028)
class UAICommander : public UObject
{
public:
	class ATedPlayerState*                        PlayerStateOwner;                                  // 0x0028(0x0008)(ZeroConstructor, Transient, DuplicateTransient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAIManager_Strategy*                    StrategyManager;                                   // 0x0030(0x0008)(ZeroConstructor, Transient, DuplicateTransient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAIManager_Resource*                    ResourceManager;                                   // 0x0038(0x0008)(ZeroConstructor, Transient, DuplicateTransient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAIManager_Production*                  ProductionManager;                                 // 0x0040(0x0008)(ZeroConstructor, Transient, DuplicateTransient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAIManager_Army*                        ArmyManager;                                       // 0x0048(0x0008)(ZeroConstructor, Transient, DuplicateTransient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAIManager_Mission*                     MissionManager;                                    // 0x0050(0x0008)(ZeroConstructor, Transient, DuplicateTransient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UAIManager_Strategy>        StrategyManagerClass;                              // 0x0058(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UAIManager_Resource>        ResourceManagerClass;                              // 0x0060(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UAIManager_Production>      ProductionManagerClass;                            // 0x0068(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UAIManager_Army>            ArmyManagerClass;                                  // 0x0070(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UAIManager_Mission>         MissionManagerClass;                               // 0x0078(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void ReceiveTick(float DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AICommander">();
	}
	static class UAICommander* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAICommander>();
	}
};
static_assert(alignof(UAICommander) == 0x000008, "Wrong alignment on UAICommander");
static_assert(sizeof(UAICommander) == 0x000080, "Wrong size on UAICommander");
static_assert(offsetof(UAICommander, PlayerStateOwner) == 0x000028, "Member 'UAICommander::PlayerStateOwner' has a wrong offset!");
static_assert(offsetof(UAICommander, StrategyManager) == 0x000030, "Member 'UAICommander::StrategyManager' has a wrong offset!");
static_assert(offsetof(UAICommander, ResourceManager) == 0x000038, "Member 'UAICommander::ResourceManager' has a wrong offset!");
static_assert(offsetof(UAICommander, ProductionManager) == 0x000040, "Member 'UAICommander::ProductionManager' has a wrong offset!");
static_assert(offsetof(UAICommander, ArmyManager) == 0x000048, "Member 'UAICommander::ArmyManager' has a wrong offset!");
static_assert(offsetof(UAICommander, MissionManager) == 0x000050, "Member 'UAICommander::MissionManager' has a wrong offset!");
static_assert(offsetof(UAICommander, StrategyManagerClass) == 0x000058, "Member 'UAICommander::StrategyManagerClass' has a wrong offset!");
static_assert(offsetof(UAICommander, ResourceManagerClass) == 0x000060, "Member 'UAICommander::ResourceManagerClass' has a wrong offset!");
static_assert(offsetof(UAICommander, ProductionManagerClass) == 0x000068, "Member 'UAICommander::ProductionManagerClass' has a wrong offset!");
static_assert(offsetof(UAICommander, ArmyManagerClass) == 0x000070, "Member 'UAICommander::ArmyManagerClass' has a wrong offset!");
static_assert(offsetof(UAICommander, MissionManagerClass) == 0x000078, "Member 'UAICommander::MissionManagerClass' has a wrong offset!");

// Class Tempest.EcsTypeDesc_AoEReceiver
// 0x0000 (0x0028 - 0x0028)
class UEcsTypeDesc_AoEReceiver final : public UEcsTypeDesc
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EcsTypeDesc_AoEReceiver">();
	}
	static class UEcsTypeDesc_AoEReceiver* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEcsTypeDesc_AoEReceiver>();
	}
};
static_assert(alignof(UEcsTypeDesc_AoEReceiver) == 0x000008, "Wrong alignment on UEcsTypeDesc_AoEReceiver");
static_assert(sizeof(UEcsTypeDesc_AoEReceiver) == 0x000028, "Wrong size on UEcsTypeDesc_AoEReceiver");

// Class Tempest.AICommanderFunctionLibrary
// 0x0000 (0x0028 - 0x0028)
class UAICommanderFunctionLibrary final : public UBlueprintFunctionLibrary
{
public:
	static TSubclassOf<class UAISquadOrderType> AISquadOrder_GetOrderType(const struct FAISquadOrder& SquadOrder);
	static class AActor* AISquadOrder_GetTargetActor(const struct FAISquadOrder& SquadOrder);
	static struct FVector2D AISquadOrder_GetTargetLocation(const struct FAISquadOrder& SquadOrder);
	static float AISquadOrder_GetTargetRadius(const struct FAISquadOrder& SquadOrder);
	static bool AISquadOrder_HasOrderType(const struct FAISquadOrder& SquadOrder, const TSubclassOf<class UAISquadOrderType> OrderType);
	static bool AISquadOrder_HasTarget(const struct FAISquadOrder& SquadOrder);
	static bool AISquadOrder_HasTargetActor(const struct FAISquadOrder& SquadOrder);
	static bool AISquadOrder_HasTargetLocation(const struct FAISquadOrder& SquadOrder);
	static bool AISquadOrder_IsValid(const struct FAISquadOrder& SquadOrder);
	static struct FAISquadOrder AISquadOrder_Make(const TSubclassOf<class UAISquadOrderType> OrderType);
	static struct FAISquadOrder AISquadOrder_MakeWithActorLocation(const TSubclassOf<class UAISquadOrderType> OrderType, const class AActor* Actor, const float Radius);
	static struct FAISquadOrder AISquadOrder_MakeWithTargetActor(const TSubclassOf<class UAISquadOrderType> OrderType, const struct FAITargetActor& TargetActor);
	static struct FAISquadOrder AISquadOrder_MakeWithTargetLocation(const TSubclassOf<class UAISquadOrderType> OrderType, const struct FAITargetLocation& TargetLocation);
	static struct FAITarget AITarget_MakeFromAITargetActor(const struct FAITargetActor& AITargetActor);
	static struct FAITarget AITarget_MakeFromAITargetLocation(const struct FAITargetLocation& AITargetLocation);
	static struct FAITarget AITarget_MakeWithActorLocation(const class AActor* Actor, const float Radius);
	static class AActor* AITargetActor_GetActor(const struct FAITargetActor& TargetActor);
	static bool AITargetActor_IsValid(const struct FAITargetActor& TargetActor);
	static struct FAITargetActor AITargetActor_MakeWithActor(class AActor* Actor);
	static struct FAITargetActor AITargetActor_MakeWithActorTag(const class UObject* WorldContextObject, const struct FGameplayTag& ActorTag);
	static struct FVector2D AITargetLocation_GetLocation(const struct FAITargetLocation& TargetLocation);
	static float AITargetLocation_GetRadius(const struct FAITargetLocation& TargetLocation);
	static bool AITargetLocation_IsValid(const struct FAITargetLocation& TargetLocation);
	static struct FAITargetLocation AITargetLocation_Make(const struct FVector2D& Location, const float Radius);
	static struct FAITargetLocation AITargetLocation_MakeWithActorLocation(const class AActor* Actor, const float Radius);
	static class UAIMission* CreateAIMission(const class UObject* WorldContextObject, const ETedPlayerID PlayerID, const TSubclassOf<class UAIMission> MissionClass, const bool bAutoActivate);
	static class UAIMission* FindAIMissionByClass(const class UObject* WorldContextObject, const ETedPlayerID PlayerID, const TSubclassOf<class UAIMission> MissionClass, const bool bExactMatch);
	static class UAIMission* FindAIMissionByHandle(const class UObject* WorldContextObject, const ETedPlayerID PlayerID, const struct FAIMissionHandle& MissionHandle);
	static class UAIMission* FindAIMissionByTag(const class UObject* WorldContextObject, const ETedPlayerID PlayerID, const struct FGameplayTag& MissionTag, const bool bExactMatch);
	static class UAIMission* FindAIMissionByTags(const class UObject* WorldContextObject, const ETedPlayerID PlayerID, const struct FGameplayTagContainer& MissionTags, const EGameplayContainerMatchType MatchType, const bool bExactMatch);
	static TArray<class UAIMission*> FindAIMissions(const class UObject* WorldContextObject, const ETedPlayerID PlayerID, const TSubclassOf<class UAIMission> MissionClass, const bool bExactMatch);
	static TArray<class UAIMission*> FindAIMissionsByTag(const class UObject* WorldContextObject, const ETedPlayerID PlayerID, const struct FGameplayTag& MissionTag, const bool bExactMatch);
	static TArray<class UAIMission*> FindAIMissionsByTags(const class UObject* WorldContextObject, const ETedPlayerID PlayerID, const struct FGameplayTagContainer& MissionTags, const EGameplayContainerMatchType MatchType, const bool bExactMatch);
	static TArray<class UAIMission*> GetAIMissions(const class UObject* WorldContextObject, const ETedPlayerID PlayerID);
	static void RemoveAIMission(const class UObject* WorldContextObject, const ETedPlayerID PlayerID, class UAIMission* Mission);
	static void RemoveAIMissionByHandle(const class UObject* WorldContextObject, const ETedPlayerID PlayerID, const struct FAIMissionHandle& MissionHandle);
	static void RemoveAllAIMissions(const class UObject* WorldContextObject, const ETedPlayerID PlayerID, const TSubclassOf<class UAIMission> MissionClass, const bool bExactMatch);
	static float Skirmish_CalculateWinVal(const TArray<class ATedPawn*>& We, const TArray<class ATedPawn*>& Enemy, int32 Method);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AICommanderFunctionLibrary">();
	}
	static class UAICommanderFunctionLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAICommanderFunctionLibrary>();
	}
};
static_assert(alignof(UAICommanderFunctionLibrary) == 0x000008, "Wrong alignment on UAICommanderFunctionLibrary");
static_assert(sizeof(UAICommanderFunctionLibrary) == 0x000028, "Wrong size on UAICommanderFunctionLibrary");

// Class Tempest.TedUtilityAIConsideration_HasAttackTarget
// 0x0008 (0x0068 - 0x0060)
class UTedUtilityAIConsideration_HasAttackTarget final : public UUtilityAIConsideration
{
public:
	bool                                          bIgnoreTargetOutsideAttackRange;                   // 0x0060(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TedUtilityAIConsideration_HasAttackTarget">();
	}
	static class UTedUtilityAIConsideration_HasAttackTarget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTedUtilityAIConsideration_HasAttackTarget>();
	}
};
static_assert(alignof(UTedUtilityAIConsideration_HasAttackTarget) == 0x000008, "Wrong alignment on UTedUtilityAIConsideration_HasAttackTarget");
static_assert(sizeof(UTedUtilityAIConsideration_HasAttackTarget) == 0x000068, "Wrong size on UTedUtilityAIConsideration_HasAttackTarget");
static_assert(offsetof(UTedUtilityAIConsideration_HasAttackTarget, bIgnoreTargetOutsideAttackRange) == 0x000060, "Member 'UTedUtilityAIConsideration_HasAttackTarget::bIgnoreTargetOutsideAttackRange' has a wrong offset!");

// Class Tempest.AIDefinition_BuildOrder
// 0x0030 (0x0060 - 0x0030)
class UAIDefinition_BuildOrder final : public UDataAsset
{
public:
	ETedFaction                                   Faction;                                           // 0x0030(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAIBuildOrder                          BuildOrder;                                        // 0x0038(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AIDefinition_BuildOrder">();
	}
	static class UAIDefinition_BuildOrder* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAIDefinition_BuildOrder>();
	}
};
static_assert(alignof(UAIDefinition_BuildOrder) == 0x000008, "Wrong alignment on UAIDefinition_BuildOrder");
static_assert(sizeof(UAIDefinition_BuildOrder) == 0x000060, "Wrong size on UAIDefinition_BuildOrder");
static_assert(offsetof(UAIDefinition_BuildOrder, Faction) == 0x000030, "Member 'UAIDefinition_BuildOrder::Faction' has a wrong offset!");
static_assert(offsetof(UAIDefinition_BuildOrder, BuildOrder) == 0x000038, "Member 'UAIDefinition_BuildOrder::BuildOrder' has a wrong offset!");

// Class Tempest.EcsTypeDesc_Pickup
// 0x0000 (0x0028 - 0x0028)
class UEcsTypeDesc_Pickup final : public UEcsTypeDesc
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EcsTypeDesc_Pickup">();
	}
	static class UEcsTypeDesc_Pickup* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEcsTypeDesc_Pickup>();
	}
};
static_assert(alignof(UEcsTypeDesc_Pickup) == 0x000008, "Wrong alignment on UEcsTypeDesc_Pickup");
static_assert(sizeof(UEcsTypeDesc_Pickup) == 0x000028, "Wrong size on UEcsTypeDesc_Pickup");

// Class Tempest.AIDefinition_Strategy
// 0x0090 (0x00C0 - 0x0030)
class UAIDefinition_Strategy final : public UDataAsset
{
public:
	ETedFaction                                   Faction;                                           // 0x0030(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAIDefinition_BuildOrder*               OpeningBook;                                       // 0x0038(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSet<TSubclassOf<class UAIMission>>           Missions;                                          // 0x0040(0x0050)(Edit, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  LockedTech;                                        // 0x0090(0x0020)(Edit, DisableEditOnInstance, EditConst, NativeAccessSpecifierPublic)
	TArray<struct FAIUnitLimit>                   UnitLimits;                                        // 0x00B0(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, EditConst, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AIDefinition_Strategy">();
	}
	static class UAIDefinition_Strategy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAIDefinition_Strategy>();
	}
};
static_assert(alignof(UAIDefinition_Strategy) == 0x000008, "Wrong alignment on UAIDefinition_Strategy");
static_assert(sizeof(UAIDefinition_Strategy) == 0x0000C0, "Wrong size on UAIDefinition_Strategy");
static_assert(offsetof(UAIDefinition_Strategy, Faction) == 0x000030, "Member 'UAIDefinition_Strategy::Faction' has a wrong offset!");
static_assert(offsetof(UAIDefinition_Strategy, OpeningBook) == 0x000038, "Member 'UAIDefinition_Strategy::OpeningBook' has a wrong offset!");
static_assert(offsetof(UAIDefinition_Strategy, Missions) == 0x000040, "Member 'UAIDefinition_Strategy::Missions' has a wrong offset!");
static_assert(offsetof(UAIDefinition_Strategy, LockedTech) == 0x000090, "Member 'UAIDefinition_Strategy::LockedTech' has a wrong offset!");
static_assert(offsetof(UAIDefinition_Strategy, UnitLimits) == 0x0000B0, "Member 'UAIDefinition_Strategy::UnitLimits' has a wrong offset!");

// Class Tempest.AIManager
// 0x0010 (0x0038 - 0x0028)
class UAIManager : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FIntervalCountdown                     TickInterval;                                      // 0x0030(0x0008)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AIManager">();
	}
	static class UAIManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAIManager>();
	}
};
static_assert(alignof(UAIManager) == 0x000008, "Wrong alignment on UAIManager");
static_assert(sizeof(UAIManager) == 0x000038, "Wrong size on UAIManager");
static_assert(offsetof(UAIManager, TickInterval) == 0x000030, "Member 'UAIManager::TickInterval' has a wrong offset!");

// Class Tempest.TedEcsModule
// 0x0000 (0x0030 - 0x0030)
class UTedEcsModule : public UEcsModule
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TedEcsModule">();
	}
	static class UTedEcsModule* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTedEcsModule>();
	}
};
static_assert(alignof(UTedEcsModule) == 0x000008, "Wrong alignment on UTedEcsModule");
static_assert(sizeof(UTedEcsModule) == 0x000030, "Wrong size on UTedEcsModule");

// Class Tempest.TedEcsModule_Triggers
// 0x0000 (0x0030 - 0x0030)
class UTedEcsModule_Triggers final : public UTedEcsModule
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TedEcsModule_Triggers">();
	}
	static class UTedEcsModule_Triggers* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTedEcsModule_Triggers>();
	}
};
static_assert(alignof(UTedEcsModule_Triggers) == 0x000008, "Wrong alignment on UTedEcsModule_Triggers");
static_assert(sizeof(UTedEcsModule_Triggers) == 0x000030, "Wrong size on UTedEcsModule_Triggers");

// Class Tempest.AIManager_Army
// 0x0060 (0x0098 - 0x0038)
class UAIManager_Army final : public UAIManager
{
public:
	TArray<class UAISquad*>                       Squads;                                            // 0x0038(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TSet<class ATedPawn*>                         AIControlledPawns;                                 // 0x0048(0x0050)(Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AIManager_Army">();
	}
	static class UAIManager_Army* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAIManager_Army>();
	}
};
static_assert(alignof(UAIManager_Army) == 0x000008, "Wrong alignment on UAIManager_Army");
static_assert(sizeof(UAIManager_Army) == 0x000098, "Wrong size on UAIManager_Army");
static_assert(offsetof(UAIManager_Army, Squads) == 0x000038, "Member 'UAIManager_Army::Squads' has a wrong offset!");
static_assert(offsetof(UAIManager_Army, AIControlledPawns) == 0x000048, "Member 'UAIManager_Army::AIControlledPawns' has a wrong offset!");

// Class Tempest.TedPawn
// 0x1398 (0x16B0 - 0x0318)
#pragma pack(push, 0x1)
class alignas(0x10) ATedPawn : public APawn
{
public:
	uint8                                         Pad_318[0xA0];                                     // 0x0318(0x00A0)(Fixing Size After Last Property [ Dumper-7 ])
	class UEcsActorComponent*                     EcsActor;                                          // 0x03B8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMeshComponent*                         MeshComp;                                          // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USkeletalMeshComponent*                 SkeletalMeshComp;                                  // 0x03C8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UStaticMeshComponent*                   StaticMeshComp;                                    // 0x03D0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTedAbilityComponent*                   AbilityComponent;                                  // 0x03D8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class ATedAIController*                       MyAIController;                                    // 0x03E0(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTedAttributeSet*                       DefaultAttributeSet;                               // 0x03E8(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UTedAttributeSetBase*>           SpawnedAttributeSets;                              // 0x03F0(0x0010)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	int32                                         SelectionDecalRadius;                              // 0x0400(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_404[0x4];                                      // 0x0404(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                SelectionHitBoxCenterOffset;                       // 0x0408(0x0018)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector2D                              SelectionHitBoxExtent;                             // 0x0420(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         bDisableStatusEffects : 1;                         // 0x0430(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_431[0x7];                                      // 0x0431(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UTedAnnouncement>           UnderAttackAnnouncement;                           // 0x0438(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UTedAnnouncement>           DiedAnnouncement;                                  // 0x0440(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         FogOfWarAgentRadiusMultiplier;                     // 0x0448(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         DestroyActorDelay;                                 // 0x044C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bDontGiveExperience;                               // 0x0450(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_451[0x3];                                      // 0x0451(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   MatParam_Health;                                   // 0x0454(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   FXSystemComponentTag_GunOverheat;                  // 0x045C(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         FXThreshold_GunOverheat;                           // 0x0464(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         ZoomDistanceToLODParticles_GunOverheat;            // 0x0468(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   MatParam_GunOverheat;                              // 0x046C(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         GunOverheatParamIncreasePerShot;                   // 0x0474(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         GunOverheatParamFadeoutTimeSeconds;                // 0x0478(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bUsesPathfinder;                                   // 0x047C(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bRegisterToNavGrid;                                // 0x047D(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_47E[0x2];                                      // 0x047E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UBehaviorTree*                          IdleBehaviorAsset;                                 // 0x0480(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBehaviorTree*                          BaseBehaviorAssetOverride;                         // 0x0488(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBlackboardData*                        BlackboardAssetOverride;                           // 0x0490(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TMap<TSubclassOf<class UTedPawnCommandWithBehavior>, struct FTedCommandWithBehaviorAssetSpec> CommandBehaviorOverrides; // 0x0498(0x0050)(Transient, Protected, NativeAccessSpecifierProtected)
	TSet<TSubclassOf<class UGameplayCommand>>     SupportedCommands;                                 // 0x04E8(0x0050)(Transient, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	uint8                                         bCheckFieldOfViewForVision : 1;                    // 0x0538(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_539[0x7];                                      // 0x0539(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMaterialInstanceDynamic*>       MeshMIDs;                                          // 0x0540(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	bool                                          bAllowPlayAudioInFoW;                              // 0x0550(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_551[0x7];                                      // 0x0551(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  ClientEffectsToTrack;                              // 0x0558(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FGameplayEffectStackContainer          GameplayEffectStack;                               // 0x0578(0x0168)(Net, RepNotify, NativeAccessSpecifierPublic)
	float                                         InitialLifetime;                                   // 0x06E0(0x0004)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LifeTimeStart;                                     // 0x06E4(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6E8[0x18];                                     // 0x06E8(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class UTedPawnContainerComponent*             CachedPawnContainerComponent;                      // 0x0700(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FGameplayTag                           DefinitionId;                                      // 0x0708(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FTedDefinitionRef                      DefinitionRef;                                     // 0x0710(0x0020)(Transient, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_730[0x8];                                      // 0x0730(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 OverriddenOwner;                                   // 0x0738(0x0008)(Net, ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_740[0x28];                                     // 0x0740(0x0028)(Fixing Size After Last Property [ Dumper-7 ])
	ETedPlayerID                                  InitPlayerID;                                      // 0x0768(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_769[0x3F];                                     // 0x0769(0x003F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTedRepAnimMontage                     RepAnimMontageInfo;                                // 0x07A8(0x0018)(Net, Transient, RepNotify, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FTedLocalAnimMontage                   LocalAnimMontageInfo;                              // 0x07C0(0x0028)(Transient, NoDestructor, Protected, NativeAccessSpecifierProtected)
	class UAnimMontageSet*                        AnimMontageSetAsset;                               // 0x07E8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FAnimMontageSetData                    LocalAnimMontageSetData;                           // 0x07F0(0x0050)(Protected, NativeAccessSpecifierProtected)
	TMap<TSubclassOf<class UTedWeapon>, struct FAnimMontageSetData> WeaponAnimMontageSets;           // 0x0840(0x0050)(Protected, NativeAccessSpecifierProtected)
	struct FTedPawnFocusInfo                      FocusInfo;                                         // 0x0890(0x0030)(Net, Transient, RepNotify, NoDestructor, Protected, NativeAccessSpecifierProtected)
	TArray<struct FTedPawnFocusInfo>              CustomFocusInfoArray;                              // 0x08C0(0x0010)(Net, ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	bool                                          bUseCustomFocusInfoArray;                          // 0x08D0(0x0001)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_8D1[0x3];                                      // 0x08D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CurrentCustomFocusInfoArrayIdx;                    // 0x08D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   DefaultPhysicalFireLocSocketName;                  // 0x08D8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_8E0[0x8];                                      // 0x08E0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTedWeaponAimOffsetData                DefaultAimOffsetData;                              // 0x08E8(0x0028)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	TMap<TSubclassOf<class UTedWeapon>, struct FTedWeaponAimData> WeaponAimDataSetup;                // 0x0910(0x0050)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FTedWeaponAimData                      CurrentAimData;                                    // 0x0960(0x0048)(Transient, Protected, NativeAccessSpecifierProtected)
	struct FVector2D                              AimOffsetPct;                                      // 0x09A8(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector2D                              CachedTargetAimOffsetPct;                          // 0x09B8(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_9C8[0x34];                                     // 0x09C8(0x0034)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RootBoneYawAdjustment;                             // 0x09FC(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class USoundCue>               LoadSound;                                         // 0x0A00(0x0028)(Edit, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class USoundCue>               UnloadSound;                                       // 0x0A28(0x0028)(Edit, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class ATedPawn*                               PawnContainerOwner;                                // 0x0A50(0x0008)(Net, ZeroConstructor, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                PhysicalFireStartLocOverride;                      // 0x0A58(0x0018)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_A70[0x68];                                     // 0x0A70(0x0068)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TSubclassOf<class UTedWeapon>>         AvailableWeaponClasses;                            // 0x0AD8(0x0010)(Net, ZeroConstructor, Transient, RepNotify, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TSubclassOf<class UTedWeapon>                 CurrentWeaponClass;                                // 0x0AE8(0x0008)(Net, ZeroConstructor, Transient, RepNotify, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UTedWeapon>                 PendingWeaponClass;                                // 0x0AF0(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UTedWeapon*>                     AvailableWeapons;                                  // 0x0AF8(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	class UTedWeapon*                             CurrentWeapon;                                     // 0x0B08(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FTedWeaponInfo>                 WeaponInfoCache;                                   // 0x0B10(0x0010)(Net, ZeroConstructor, Transient, RepNotify, Protected, NativeAccessSpecifierProtected)
	struct FTedDefinitionRef                      WeaponDefinitionRef;                               // 0x0B20(0x0020)(Transient, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class AActor*                                 CachedFireTarget;                                  // 0x0B40(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_B48[0x20];                                     // 0x0B48(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTedAttackTargetInfo                   AttackTargetInfo;                                  // 0x0B68(0x0040)(Net, Transient, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         bBypassTargetPriority : 1;                         // 0x0BA8(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_BA9[0x12F];                                    // 0x0BA9(0x012F)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(class ATedPawn* Pawn)> OnDeathBlueprintEvent;                      // 0x0CD8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	bool                                          bDisconnectDeath;                                  // 0x0CE8(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_CE9[0x3];                                      // 0x0CE9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TWeakObjectPtr<class ATedPawn>                LastHealedBy;                                      // 0x0CEC(0x0008)(Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_CF4[0x4];                                      // 0x0CF4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTedPawnDamageInfo                     LastDamageInfo;                                    // 0x0CF8(0x0020)(Net, Transient, RepNotify, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FTedPawnDeathInfo                      PawnDeath;                                         // 0x0D18(0x0020)(Net, Transient, RepNotify, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_D38[0x20];                                     // 0x0D38(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UCameraShakeBase>           DeathCameraShakeClass;                             // 0x0D58(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         CameraShakeInnerRadius;                            // 0x0D60(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         CameraShakeOuterRadius;                            // 0x0D64(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         CameraShakeFalloff;                                // 0x0D68(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bOrientShakeTowardsEpicenter;                      // 0x0D6C(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_D6D[0x13];                                     // 0x0D6D(0x0013)(Fixing Size After Last Property [ Dumper-7 ])
	uint8                                         bInteractsWithFoliage : 1;                         // 0x0D80(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_D81[0x7];                                      // 0x0D81(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  IgnoreFoliageTypes;                                // 0x0D88(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TSet<EFoliageChannel>                         InteractableFoliageChannels;                       // 0x0DA8(0x0050)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	uint8                                         FoliageChannelFlag;                                // 0x0DF8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bApplyFullDamageToPawnsInContainer;                // 0x0DF9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_DFA[0x6];                                      // 0x0DFA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(class ATedPawn* ReplacedPawn, class ATedPawn* ReplacedBy)> OnPawnReplaced; // 0x0E00(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_E10[0x18];                                     // 0x0E10(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class ATedPawn*                               ReplacedPawn;                                      // 0x0E28(0x0008)(Net, ZeroConstructor, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsBeingReplaced;                                  // 0x0E30(0x0001)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_E31[0x7];                                      // 0x0E31(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCommandExecutionInfo          CommandExecutionInfo;                              // 0x0E38(0x0060)(Net, Transient, RepNotify, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	uint8                                         Pad_E98[0x18];                                     // 0x0E98(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCommandCooldowns              CommandCooldowns;                                  // 0x0EB0(0x0070)(Net, Transient, NativeAccessSpecifierPrivate)
	struct FTedGameplayTagReplicationContainer    ReplicationTags;                                   // 0x0F20(0x0060)(Net, Transient, RepNotify, ContainsInstancedReference, NativeAccessSpecifierPublic)
	uint8                                         Pad_F80[0x50];                                     // 0x0F80(0x0050)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayCueContainer            ReplicationGameplayCues;                           // 0x0FD0(0x0128)(Net, Transient, ContainsInstancedReference, NativeAccessSpecifierPublic)
	TArray<class ATedGameplayCueNotify_StatusEffect*> StatusGameplayCues;                            // 0x10F8(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_1108[0x18];                                    // 0x1108(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class UDecalComponent*                        SelectionDecal;                                    // 0x1120(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMaterialInterface*                     SelectionDecalMaterial;                            // 0x1128(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bSameTypeSelectable;                               // 0x1130(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bMixedTypeSelectable;                              // 0x1131(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bGroupable;                                        // 0x1132(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bCanEverBeSelected;                                // 0x1133(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1134[0x4];                                     // 0x1134(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   IsSelectionDecalSeenByOwnerParamName;              // 0x1138(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	FMulticastSparseDelegateProperty_             OnVisibilityHasChanged;                            // 0x1140(0x0001)(InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_1141[0x7];                                     // 0x1141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTedVisibility                         Visibility;                                        // 0x1148(0x0038)(Net, Transient, RepNotify, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_1180[0x68];                                    // 0x1180(0x0068)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTedGhostPawnArray                     GhostPawns;                                        // 0x11E8(0x0028)(Net, Transient, Protected, NativeAccessSpecifierProtected)
	TSubclassOf<class ATedGhostPawn>              GhostPawnClass;                                    // 0x1210(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1218[0x1];                                     // 0x1218(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bSupportsFowHighlightPawn;                         // 0x1219(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_121A[0x6];                                     // 0x121A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ATedFoWHighlightPawn*                   FoWHighlightPawn;                                  // 0x1220(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1228[0x8];                                     // 0x1228(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TSet<class FName>                             IgnoredMaterialsForFowHighlight;                   // 0x1230(0x0050)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	class ASquareNavGrid*                         CachedNavGrid;                                     // 0x1280(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class ARecastNavMesh*                         CachedNavMesh;                                     // 0x1288(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                           InitActorTag;                                      // 0x1290(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1298[0x40];                                    // 0x1298(0x0040)(Fixing Size After Last Property [ Dumper-7 ])
	ETedVeterancyLevel                            VeterancyLevel;                                    // 0x12D8(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_12D9[0x3];                                     // 0x12D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         GainedExperience;                                  // 0x12DC(0x0004)(Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_12E0[0x30];                                    // 0x12E0(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	ETedPawnUpgradeTypeFlags                      UpgradeFlags;                                      // 0x1310(0x0001)(Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ETedPawnUpgradeTypeFlags                      InitialUpgradeFlags;                               // 0x1311(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1312[0x6];                                     // 0x1312(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTedPawnUpgradeData                    ResearchedUpgradeData;                             // 0x1318(0x0170)(Transient, Protected, NativeAccessSpecifierProtected)
	struct FTedPawnUpgradeResearchProgress        UpgradeProgress;                                   // 0x1488(0x0038)(Net, Transient, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_14C0[0x8];                                     // 0x14C0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bRegisterInUpgradeSystem;                          // 0x14C8(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_14C9[0x7];                                     // 0x14C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSavedProvidedAoEInfo                  ProvidedAoEInfo;                                   // 0x14D0(0x0050)(NativeAccessSpecifierPrivate)
	struct FSavedReceivedAoEInfo                  ReceivedAoEInfo;                                   // 0x1520(0x0010)(NativeAccessSpecifierPrivate)
	class UTedEntityDefinitionAsset*              CachedDefinitionAsset;                             // 0x1530(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1538[0x10];                                    // 0x1538(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           TrackedSupportPowerTag;                            // 0x1548(0x0008)(Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TMap<ETedStatusType, int32>                   StatusTypeState;                                   // 0x1550(0x0050)(Transient, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_15A0[0xE0];                                    // 0x15A0(0x00E0)(Fixing Size After Last Property [ Dumper-7 ])
	ETedPawnSkinIndex                             SkinOverrideIndex;                                 // 0x1680(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1681[0x7];                                     // 0x1681(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMaterialInterface*>             SkinOverrides;                                     // 0x1688(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	class UMeshComponent*                         SkinOverrideMesh;                                  // 0x1698(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bSkinOverridesEnabled;                             // 0x16A0(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_16A1[0x7];                                     // 0x16A1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AddExperience(const float InGainedExperience);
	void ClearAnimatingAbility(class UGameplayAbility* Ability);
	void Client_R_InterpTo(const struct FTransform& InitLoc, const struct FTransform& TargetLoc, float RotTime, float LocTime, float AlignmentDistanceTolerance);
	void CurrentMontageJumpToSection(class FName SectionName);
	void CurrentMontageSetPlayRate(float InPlayRate);
	void CurrentMontageStop(float OverrideBlendOutTime);
	bool FindPathGoalLocation(const struct FVector& StartPoint, const struct FVector& EndPoint, struct FVector* OutLocation);
	void GiveWeapon(const TSubclassOf<class UTedWeapon> WeaponClass, const bool bSkipNotify);
	void K2_OnWeaponSwitched(class UTedWeapon* NewWeapon, class UTedWeapon* PreviousWeapon);
	void K2_SetCanBeDamaged(const bool bInCanBeDamaged);
	void NetMulticast_Died();
	void NetMulticast_OnLifeTimeExpired();
	void OnDelayedDestroy();
	void OnFirstPlayerStateReplicated(class ATedPlayerController* PlayerController);
	void OnLifeTimeExpired();
	void OnLifeTimeExpiredCosmetic();
	void OnPlayerIDChanged(ETedPlayerID NewPlayerID);
	void OnRep_AvailableWeaponClasses(const TArray<TSubclassOf<class UTedWeapon>>& OldAvailableWeaponClasses);
	void OnRep_CommandExecutionInfo();
	void OnRep_CurrentWeaponClass();
