#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Tempest

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Tempest_structs.hpp"
#include "AIModule_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "NubCore_structs.hpp"
#include "Pros_structs.hpp"
#include "EnhancedInput_structs.hpp"
#include "Slate_structs.hpp"
#include "ProsSDK_structs.hpp"
#include "RTSColor_structs.hpp"
#include "Hydra5_structs.hpp"
#include "GameplayCommands_structs.hpp"
#include "InputCore_structs.hpp"


namespace SDK::Params
{

// Function Tempest.AICommander.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct AICommander_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AICommander_ReceiveTick) == 0x000004, "Wrong alignment on AICommander_ReceiveTick");
static_assert(sizeof(AICommander_ReceiveTick) == 0x000004, "Wrong size on AICommander_ReceiveTick");
static_assert(offsetof(AICommander_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'AICommander_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function Tempest.AICommanderFunctionLibrary.AISquadOrder_GetOrderType
// 0x0060 (0x0060 - 0x0000)
struct AICommanderFunctionLibrary_AISquadOrder_GetOrderType final
{
public:
	struct FAISquadOrder                          SquadOrder;                                        // 0x0000(0x0058)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TSubclassOf<class UAISquadOrderType>          ReturnValue;                                       // 0x0058(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AICommanderFunctionLibrary_AISquadOrder_GetOrderType) == 0x000008, "Wrong alignment on AICommanderFunctionLibrary_AISquadOrder_GetOrderType");
static_assert(sizeof(AICommanderFunctionLibrary_AISquadOrder_GetOrderType) == 0x000060, "Wrong size on AICommanderFunctionLibrary_AISquadOrder_GetOrderType");
static_assert(offsetof(AICommanderFunctionLibrary_AISquadOrder_GetOrderType, SquadOrder) == 0x000000, "Member 'AICommanderFunctionLibrary_AISquadOrder_GetOrderType::SquadOrder' has a wrong offset!");
static_assert(offsetof(AICommanderFunctionLibrary_AISquadOrder_GetOrderType, ReturnValue) == 0x000058, "Member 'AICommanderFunctionLibrary_AISquadOrder_GetOrderType::ReturnValue' has a wrong offset!");

// Function Tempest.AICommanderFunctionLibrary.AISquadOrder_GetTargetActor
// 0x0060 (0x0060 - 0x0000)
struct AICommanderFunctionLibrary_AISquadOrder_GetTargetActor final
{
public:
	struct FAISquadOrder                          SquadOrder;                                        // 0x0000(0x0058)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class AActor*                                 ReturnValue;                                       // 0x0058(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AICommanderFunctionLibrary_AISquadOrder_GetTargetActor) == 0x000008, "Wrong alignment on AICommanderFunctionLibrary_AISquadOrder_GetTargetActor");
static_assert(sizeof(AICommanderFunctionLibrary_AISquadOrder_GetTargetActor) == 0x000060, "Wrong size on AICommanderFunctionLibrary_AISquadOrder_GetTargetActor");
static_assert(offsetof(AICommanderFunctionLibrary_AISquadOrder_GetTargetActor, SquadOrder) == 0x000000, "Member 'AICommanderFunctionLibrary_AISquadOrder_GetTargetActor::SquadOrder' has a wrong offset!");
static_assert(offsetof(AICommanderFunctionLibrary_AISquadOrder_GetTargetActor, ReturnValue) == 0x000058, "Member 'AICommanderFunctionLibrary_AISquadOrder_GetTargetActor::ReturnValue' has a wrong offset!");

// Function Tempest.AICommanderFunctionLibrary.AISquadOrder_GetTargetLocation
// 0x0068 (0x0068 - 0x0000)
struct AICommanderFunctionLibrary_AISquadOrder_GetTargetLocation final
{
public:
	struct FAISquadOrder                          SquadOrder;                                        // 0x0000(0x0058)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FVector2D                              ReturnValue;                                       // 0x0058(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AICommanderFunctionLibrary_AISquadOrder_GetTargetLocation) == 0x000008, "Wrong alignment on AICommanderFunctionLibrary_AISquadOrder_GetTargetLocation");
static_assert(sizeof(AICommanderFunctionLibrary_AISquadOrder_GetTargetLocation) == 0x000068, "Wrong size on AICommanderFunctionLibrary_AISquadOrder_GetTargetLocation");
static_assert(offsetof(AICommanderFunctionLibrary_AISquadOrder_GetTargetLocation, SquadOrder) == 0x000000, "Member 'AICommanderFunctionLibrary_AISquadOrder_GetTargetLocation::SquadOrder' has a wrong offset!");
static_assert(offsetof(AICommanderFunctionLibrary_AISquadOrder_GetTargetLocation, ReturnValue) == 0x000058, "Member 'AICommanderFunctionLibrary_AISquadOrder_GetTargetLocation::ReturnValue' has a wrong offset!");

// Function Tempest.AICommanderFunctionLibrary.AISquadOrder_GetTargetRadius
// 0x0060 (0x0060 - 0x0000)
struct AICommanderFunctionLibrary_AISquadOrder_GetTargetRadius final
{
public:
	struct FAISquadOrder                          SquadOrder;                                        // 0x0000(0x0058)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0058(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AICommanderFunctionLibrary_AISquadOrder_GetTargetRadius) == 0x000008, "Wrong alignment on AICommanderFunctionLibrary_AISquadOrder_GetTargetRadius");
static_assert(sizeof(AICommanderFunctionLibrary_AISquadOrder_GetTargetRadius) == 0x000060, "Wrong size on AICommanderFunctionLibrary_AISquadOrder_GetTargetRadius");
static_assert(offsetof(AICommanderFunctionLibrary_AISquadOrder_GetTargetRadius, SquadOrder) == 0x000000, "Member 'AICommanderFunctionLibrary_AISquadOrder_GetTargetRadius::SquadOrder' has a wrong offset!");
static_assert(offsetof(AICommanderFunctionLibrary_AISquadOrder_GetTargetRadius, ReturnValue) == 0x000058, "Member 'AICommanderFunctionLibrary_AISquadOrder_GetTargetRadius::ReturnValue' has a wrong offset!");

// Function Tempest.AICommanderFunctionLibrary.AISquadOrder_HasOrderType
// 0x0068 (0x0068 - 0x0000)
struct AICommanderFunctionLibrary_AISquadOrder_HasOrderType final
{
public:
	struct FAISquadOrder                          SquadOrder;                                        // 0x0000(0x0058)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TSubclassOf<class UAISquadOrderType>          OrderType;                                         // 0x0058(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0060(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AICommanderFunctionLibrary_AISquadOrder_HasOrderType) == 0x000008, "Wrong alignment on AICommanderFunctionLibrary_AISquadOrder_HasOrderType");
static_assert(sizeof(AICommanderFunctionLibrary_AISquadOrder_HasOrderType) == 0x000068, "Wrong size on AICommanderFunctionLibrary_AISquadOrder_HasOrderType");
static_assert(offsetof(AICommanderFunctionLibrary_AISquadOrder_HasOrderType, SquadOrder) == 0x000000, "Member 'AICommanderFunctionLibrary_AISquadOrder_HasOrderType::SquadOrder' has a wrong offset!");
static_assert(offsetof(AICommanderFunctionLibrary_AISquadOrder_HasOrderType, OrderType) == 0x000058, "Member 'AICommanderFunctionLibrary_AISquadOrder_HasOrderType::OrderType' has a wrong offset!");
static_assert(offsetof(AICommanderFunctionLibrary_AISquadOrder_HasOrderType, ReturnValue) == 0x000060, "Member 'AICommanderFunctionLibrary_AISquadOrder_HasOrderType::ReturnValue' has a wrong offset!");

// Function Tempest.AICommanderFunctionLibrary.AISquadOrder_HasTarget
// 0x0060 (0x0060 - 0x0000)
struct AICommanderFunctionLibrary_AISquadOrder_HasTarget final
{
public:
	struct FAISquadOrder                          SquadOrder;                                        // 0x0000(0x0058)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0058(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AICommanderFunctionLibrary_AISquadOrder_HasTarget) == 0x000008, "Wrong alignment on AICommanderFunctionLibrary_AISquadOrder_HasTarget");
static_assert(sizeof(AICommanderFunctionLibrary_AISquadOrder_HasTarget) == 0x000060, "Wrong size on AICommanderFunctionLibrary_AISquadOrder_HasTarget");
static_assert(offsetof(AICommanderFunctionLibrary_AISquadOrder_HasTarget, SquadOrder) == 0x000000, "Member 'AICommanderFunctionLibrary_AISquadOrder_HasTarget::SquadOrder' has a wrong offset!");
static_assert(offsetof(AICommanderFunctionLibrary_AISquadOrder_HasTarget, ReturnValue) == 0x000058, "Member 'AICommanderFunctionLibrary_AISquadOrder_HasTarget::ReturnValue' has a wrong offset!");

// Function Tempest.AICommanderFunctionLibrary.AISquadOrder_HasTargetActor
// 0x0060 (0x0060 - 0x0000)
struct AICommanderFunctionLibrary_AISquadOrder_HasTargetActor final
{
public:
	struct FAISquadOrder                          SquadOrder;                                        // 0x0000(0x0058)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0058(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AICommanderFunctionLibrary_AISquadOrder_HasTargetActor) == 0x000008, "Wrong alignment on AICommanderFunctionLibrary_AISquadOrder_HasTargetActor");
static_assert(sizeof(AICommanderFunctionLibrary_AISquadOrder_HasTargetActor) == 0x000060, "Wrong size on AICommanderFunctionLibrary_AISquadOrder_HasTargetActor");
static_assert(offsetof(AICommanderFunctionLibrary_AISquadOrder_HasTargetActor, SquadOrder) == 0x000000, "Member 'AICommanderFunctionLibrary_AISquadOrder_HasTargetActor::SquadOrder' has a wrong offset!");
static_assert(offsetof(AICommanderFunctionLibrary_AISquadOrder_HasTargetActor, ReturnValue) == 0x000058, "Member 'AICommanderFunctionLibrary_AISquadOrder_HasTargetActor::ReturnValue' has a wrong offset!");

// Function Tempest.AICommanderFunctionLibrary.AISquadOrder_HasTargetLocation
// 0x0060 (0x0060 - 0x0000)
struct AICommanderFunctionLibrary_AISquadOrder_HasTargetLocation final
{
public:
	struct FAISquadOrder                          SquadOrder;                                        // 0x0000(0x0058)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0058(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AICommanderFunctionLibrary_AISquadOrder_HasTargetLocation) == 0x000008, "Wrong alignment on AICommanderFunctionLibrary_AISquadOrder_HasTargetLocation");
static_assert(sizeof(AICommanderFunctionLibrary_AISquadOrder_HasTargetLocation) == 0x000060, "Wrong size on AICommanderFunctionLibrary_AISquadOrder_HasTargetLocation");
static_assert(offsetof(AICommanderFunctionLibrary_AISquadOrder_HasTargetLocation, SquadOrder) == 0x000000, "Member 'AICommanderFunctionLibrary_AISquadOrder_HasTargetLocation::SquadOrder' has a wrong offset!");
static_assert(offsetof(AICommanderFunctionLibrary_AISquadOrder_HasTargetLocation, ReturnValue) == 0x000058, "Member 'AICommanderFunctionLibrary_AISquadOrder_HasTargetLocation::ReturnValue' has a wrong offset!");

// Function Tempest.AICommanderFunctionLibrary.AISquadOrder_IsValid
// 0x0060 (0x0060 - 0x0000)
struct AICommanderFunctionLibrary_AISquadOrder_IsValid final
{
public:
	struct FAISquadOrder                          SquadOrder;                                        // 0x0000(0x0058)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0058(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AICommanderFunctionLibrary_AISquadOrder_IsValid) == 0x000008, "Wrong alignment on AICommanderFunctionLibrary_AISquadOrder_IsValid");
static_assert(sizeof(AICommanderFunctionLibrary_AISquadOrder_IsValid) == 0x000060, "Wrong size on AICommanderFunctionLibrary_AISquadOrder_IsValid");
static_assert(offsetof(AICommanderFunctionLibrary_AISquadOrder_IsValid, SquadOrder) == 0x000000, "Member 'AICommanderFunctionLibrary_AISquadOrder_IsValid::SquadOrder' has a wrong offset!");
static_assert(offsetof(AICommanderFunctionLibrary_AISquadOrder_IsValid, ReturnValue) == 0x000058, "Member 'AICommanderFunctionLibrary_AISquadOrder_IsValid::ReturnValue' has a wrong offset!");

// Function Tempest.AICommanderFunctionLibrary.AISquadOrder_Make
// 0x0060 (0x0060 - 0x0000)
struct AICommanderFunctionLibrary_AISquadOrder_Make final
{
public:
	TSubclassOf<class UAISquadOrderType>          OrderType;                                         // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAISquadOrder                          ReturnValue;                                       // 0x0008(0x0058)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(AICommanderFunctionLibrary_AISquadOrder_Make) == 0x000008, "Wrong alignment on AICommanderFunctionLibrary_AISquadOrder_Make");
static_assert(sizeof(AICommanderFunctionLibrary_AISquadOrder_Make) == 0x000060, "Wrong size on AICommanderFunctionLibrary_AISquadOrder_Make");
static_assert(offsetof(AICommanderFunctionLibrary_AISquadOrder_Make, OrderType) == 0x000000, "Member 'AICommanderFunctionLibrary_AISquadOrder_Make::OrderType' has a wrong offset!");
static_assert(offsetof(AICommanderFunctionLibrary_AISquadOrder_Make, ReturnValue) == 0x000008, "Member 'AICommanderFunctionLibrary_AISquadOrder_Make::ReturnValue' has a wrong offset!");

// Function Tempest.AICommanderFunctionLibrary.AISquadOrder_MakeWithActorLocation
// 0x0070 (0x0070 - 0x0000)
struct AICommanderFunctionLibrary_AISquadOrder_MakeWithActorLocation final
{
public:
	TSubclassOf<class UAISquadOrderType>          OrderType;                                         // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class AActor*                           Actor;                                             // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Radius;                                            // 0x0010(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAISquadOrder                          ReturnValue;                                       // 0x0018(0x0058)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(AICommanderFunctionLibrary_AISquadOrder_MakeWithActorLocation) == 0x000008, "Wrong alignment on AICommanderFunctionLibrary_AISquadOrder_MakeWithActorLocation");
static_assert(sizeof(AICommanderFunctionLibrary_AISquadOrder_MakeWithActorLocation) == 0x000070, "Wrong size on AICommanderFunctionLibrary_AISquadOrder_MakeWithActorLocation");
static_assert(offsetof(AICommanderFunctionLibrary_AISquadOrder_MakeWithActorLocation, OrderType) == 0x000000, "Member 'AICommanderFunctionLibrary_AISquadOrder_MakeWithActorLocation::OrderType' has a wrong offset!");
static_assert(offsetof(AICommanderFunctionLibrary_AISquadOrder_MakeWithActorLocation, Actor) == 0x000008, "Member 'AICommanderFunctionLibrary_AISquadOrder_MakeWithActorLocation::Actor' has a wrong offset!");
static_assert(offsetof(AICommanderFunctionLibrary_AISquadOrder_MakeWithActorLocation, Radius) == 0x000010, "Member 'AICommanderFunctionLibrary_AISquadOrder_MakeWithActorLocation::Radius' has a wrong offset!");
static_assert(offsetof(AICommanderFunctionLibrary_AISquadOrder_MakeWithActorLocation, ReturnValue) == 0x000018, "Member 'AICommanderFunctionLibrary_AISquadOrder_MakeWithActorLocation::ReturnValue' has a wrong offset!");

// Function Tempest.AICommanderFunctionLibrary.AISquadOrder_MakeWithTargetActor
// 0x0098 (0x0098 - 0x0000)
struct AICommanderFunctionLibrary_AISquadOrder_MakeWithTargetActor final
{
public:
	TSubclassOf<class UAISquadOrderType>          OrderType;                                         // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAITargetActor                         TargetActor;                                       // 0x0008(0x0038)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FAISquadOrder                          ReturnValue;                                       // 0x0040(0x0058)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(AICommanderFunctionLibrary_AISquadOrder_MakeWithTargetActor) == 0x000008, "Wrong alignment on AICommanderFunctionLibrary_AISquadOrder_MakeWithTargetActor");
static_assert(sizeof(AICommanderFunctionLibrary_AISquadOrder_MakeWithTargetActor) == 0x000098, "Wrong size on AICommanderFunctionLibrary_AISquadOrder_MakeWithTargetActor");
static_assert(offsetof(AICommanderFunctionLibrary_AISquadOrder_MakeWithTargetActor, OrderType) == 0x000000, "Member 'AICommanderFunctionLibrary_AISquadOrder_MakeWithTargetActor::OrderType' has a wrong offset!");
static_assert(offsetof(AICommanderFunctionLibrary_AISquadOrder_MakeWithTargetActor, TargetActor) == 0x000008, "Member 'AICommanderFunctionLibrary_AISquadOrder_MakeWithTargetActor::TargetActor' has a wrong offset!");
static_assert(offsetof(AICommanderFunctionLibrary_AISquadOrder_MakeWithTargetActor, ReturnValue) == 0x000040, "Member 'AICommanderFunctionLibrary_AISquadOrder_MakeWithTargetActor::ReturnValue' has a wrong offset!");

// Function Tempest.AICommanderFunctionLibrary.AISquadOrder_MakeWithTargetLocation
// 0x0078 (0x0078 - 0x0000)
struct AICommanderFunctionLibrary_AISquadOrder_MakeWithTargetLocation final
{
public:
	TSubclassOf<class UAISquadOrderType>          OrderType;                                         // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAITargetLocation                      TargetLocation;                                    // 0x0008(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FAISquadOrder                          ReturnValue;                                       // 0x0020(0x0058)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(AICommanderFunctionLibrary_AISquadOrder_MakeWithTargetLocation) == 0x000008, "Wrong alignment on AICommanderFunctionLibrary_AISquadOrder_MakeWithTargetLocation");
static_assert(sizeof(AICommanderFunctionLibrary_AISquadOrder_MakeWithTargetLocation) == 0x000078, "Wrong size on AICommanderFunctionLibrary_AISquadOrder_MakeWithTargetLocation");
static_assert(offsetof(AICommanderFunctionLibrary_AISquadOrder_MakeWithTargetLocation, OrderType) == 0x000000, "Member 'AICommanderFunctionLibrary_AISquadOrder_MakeWithTargetLocation::OrderType' has a wrong offset!");
static_assert(offsetof(AICommanderFunctionLibrary_AISquadOrder_MakeWithTargetLocation, TargetLocation) == 0x000008, "Member 'AICommanderFunctionLibrary_AISquadOrder_MakeWithTargetLocation::TargetLocation' has a wrong offset!");
static_assert(offsetof(AICommanderFunctionLibrary_AISquadOrder_MakeWithTargetLocation, ReturnValue) == 0x000020, "Member 'AICommanderFunctionLibrary_AISquadOrder_MakeWithTargetLocation::ReturnValue' has a wrong offset!");

// Function Tempest.AICommanderFunctionLibrary.AITarget_MakeFromAITargetActor
// 0x0088 (0x0088 - 0x0000)
struct AICommanderFunctionLibrary_AITarget_MakeFromAITargetActor final
{
public:
	struct FAITargetActor                         AITargetActor;                                     // 0x0000(0x0038)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FAITarget                              ReturnValue;                                       // 0x0038(0x0050)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(AICommanderFunctionLibrary_AITarget_MakeFromAITargetActor) == 0x000008, "Wrong alignment on AICommanderFunctionLibrary_AITarget_MakeFromAITargetActor");
static_assert(sizeof(AICommanderFunctionLibrary_AITarget_MakeFromAITargetActor) == 0x000088, "Wrong size on AICommanderFunctionLibrary_AITarget_MakeFromAITargetActor");
static_assert(offsetof(AICommanderFunctionLibrary_AITarget_MakeFromAITargetActor, AITargetActor) == 0x000000, "Member 'AICommanderFunctionLibrary_AITarget_MakeFromAITargetActor::AITargetActor' has a wrong offset!");
static_assert(offsetof(AICommanderFunctionLibrary_AITarget_MakeFromAITargetActor, ReturnValue) == 0x000038, "Member 'AICommanderFunctionLibrary_AITarget_MakeFromAITargetActor::ReturnValue' has a wrong offset!");

// Function Tempest.AICommanderFunctionLibrary.AITarget_MakeFromAITargetLocation
// 0x0068 (0x0068 - 0x0000)
struct AICommanderFunctionLibrary_AITarget_MakeFromAITargetLocation final
{
public:
	struct FAITargetLocation                      AITargetLocation;                                  // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FAITarget                              ReturnValue;                                       // 0x0018(0x0050)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(AICommanderFunctionLibrary_AITarget_MakeFromAITargetLocation) == 0x000008, "Wrong alignment on AICommanderFunctionLibrary_AITarget_MakeFromAITargetLocation");
static_assert(sizeof(AICommanderFunctionLibrary_AITarget_MakeFromAITargetLocation) == 0x000068, "Wrong size on AICommanderFunctionLibrary_AITarget_MakeFromAITargetLocation");
static_assert(offsetof(AICommanderFunctionLibrary_AITarget_MakeFromAITargetLocation, AITargetLocation) == 0x000000, "Member 'AICommanderFunctionLibrary_AITarget_MakeFromAITargetLocation::AITargetLocation' has a wrong offset!");
static_assert(offsetof(AICommanderFunctionLibrary_AITarget_MakeFromAITargetLocation, ReturnValue) == 0x000018, "Member 'AICommanderFunctionLibrary_AITarget_MakeFromAITargetLocation::ReturnValue' has a wrong offset!");

// Function Tempest.AICommanderFunctionLibrary.AITarget_MakeWithActorLocation
// 0x0060 (0x0060 - 0x0000)
struct AICommanderFunctionLibrary_AITarget_MakeWithActorLocation final
{
public:
	const class AActor*                           Actor;                                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Radius;                                            // 0x0008(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAITarget                              ReturnValue;                                       // 0x0010(0x0050)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(AICommanderFunctionLibrary_AITarget_MakeWithActorLocation) == 0x000008, "Wrong alignment on AICommanderFunctionLibrary_AITarget_MakeWithActorLocation");
static_assert(sizeof(AICommanderFunctionLibrary_AITarget_MakeWithActorLocation) == 0x000060, "Wrong size on AICommanderFunctionLibrary_AITarget_MakeWithActorLocation");
static_assert(offsetof(AICommanderFunctionLibrary_AITarget_MakeWithActorLocation, Actor) == 0x000000, "Member 'AICommanderFunctionLibrary_AITarget_MakeWithActorLocation::Actor' has a wrong offset!");
static_assert(offsetof(AICommanderFunctionLibrary_AITarget_MakeWithActorLocation, Radius) == 0x000008, "Member 'AICommanderFunctionLibrary_AITarget_MakeWithActorLocation::Radius' has a wrong offset!");
static_assert(offsetof(AICommanderFunctionLibrary_AITarget_MakeWithActorLocation, ReturnValue) == 0x000010, "Member 'AICommanderFunctionLibrary_AITarget_MakeWithActorLocation::ReturnValue' has a wrong offset!");

// Function Tempest.AICommanderFunctionLibrary.AITargetActor_GetActor
// 0x0040 (0x0040 - 0x0000)
struct AICommanderFunctionLibrary_AITargetActor_GetActor final
{
public:
	struct FAITargetActor                         TargetActor;                                       // 0x0000(0x0038)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class AActor*                                 ReturnValue;                                       // 0x0038(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AICommanderFunctionLibrary_AITargetActor_GetActor) == 0x000008, "Wrong alignment on AICommanderFunctionLibrary_AITargetActor_GetActor");
static_assert(sizeof(AICommanderFunctionLibrary_AITargetActor_GetActor) == 0x000040, "Wrong size on AICommanderFunctionLibrary_AITargetActor_GetActor");
static_assert(offsetof(AICommanderFunctionLibrary_AITargetActor_GetActor, TargetActor) == 0x000000, "Member 'AICommanderFunctionLibrary_AITargetActor_GetActor::TargetActor' has a wrong offset!");
static_assert(offsetof(AICommanderFunctionLibrary_AITargetActor_GetActor, ReturnValue) == 0x000038, "Member 'AICommanderFunctionLibrary_AITargetActor_GetActor::ReturnValue' has a wrong offset!");

// Function Tempest.AICommanderFunctionLibrary.AITargetActor_IsValid
// 0x0040 (0x0040 - 0x0000)
struct AICommanderFunctionLibrary_AITargetActor_IsValid final
{
public:
	struct FAITargetActor                         TargetActor;                                       // 0x0000(0x0038)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0038(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AICommanderFunctionLibrary_AITargetActor_IsValid) == 0x000008, "Wrong alignment on AICommanderFunctionLibrary_AITargetActor_IsValid");
static_assert(sizeof(AICommanderFunctionLibrary_AITargetActor_IsValid) == 0x000040, "Wrong size on AICommanderFunctionLibrary_AITargetActor_IsValid");
static_assert(offsetof(AICommanderFunctionLibrary_AITargetActor_IsValid, TargetActor) == 0x000000, "Member 'AICommanderFunctionLibrary_AITargetActor_IsValid::TargetActor' has a wrong offset!");
static_assert(offsetof(AICommanderFunctionLibrary_AITargetActor_IsValid, ReturnValue) == 0x000038, "Member 'AICommanderFunctionLibrary_AITargetActor_IsValid::ReturnValue' has a wrong offset!");

// Function Tempest.AICommanderFunctionLibrary.AITargetActor_MakeWithActor
// 0x0040 (0x0040 - 0x0000)
struct AICommanderFunctionLibrary_AITargetActor_MakeWithActor final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAITargetActor                         ReturnValue;                                       // 0x0008(0x0038)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(AICommanderFunctionLibrary_AITargetActor_MakeWithActor) == 0x000008, "Wrong alignment on AICommanderFunctionLibrary_AITargetActor_MakeWithActor");
static_assert(sizeof(AICommanderFunctionLibrary_AITargetActor_MakeWithActor) == 0x000040, "Wrong size on AICommanderFunctionLibrary_AITargetActor_MakeWithActor");
static_assert(offsetof(AICommanderFunctionLibrary_AITargetActor_MakeWithActor, Actor) == 0x000000, "Member 'AICommanderFunctionLibrary_AITargetActor_MakeWithActor::Actor' has a wrong offset!");
static_assert(offsetof(AICommanderFunctionLibrary_AITargetActor_MakeWithActor, ReturnValue) == 0x000008, "Member 'AICommanderFunctionLibrary_AITargetActor_MakeWithActor::ReturnValue' has a wrong offset!");

// Function Tempest.AICommanderFunctionLibrary.AITargetActor_MakeWithActorTag
// 0x0048 (0x0048 - 0x0000)
struct AICommanderFunctionLibrary_AITargetActor_MakeWithActorTag final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           ActorTag;                                          // 0x0008(0x0008)(ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAITargetActor                         ReturnValue;                                       // 0x0010(0x0038)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(AICommanderFunctionLibrary_AITargetActor_MakeWithActorTag) == 0x000008, "Wrong alignment on AICommanderFunctionLibrary_AITargetActor_MakeWithActorTag");
static_assert(sizeof(AICommanderFunctionLibrary_AITargetActor_MakeWithActorTag) == 0x000048, "Wrong size on AICommanderFunctionLibrary_AITargetActor_MakeWithActorTag");
static_assert(offsetof(AICommanderFunctionLibrary_AITargetActor_MakeWithActorTag, WorldContextObject) == 0x000000, "Member 'AICommanderFunctionLibrary_AITargetActor_MakeWithActorTag::WorldContextObject' has a wrong offset!");
static_assert(offsetof(AICommanderFunctionLibrary_AITargetActor_MakeWithActorTag, ActorTag) == 0x000008, "Member 'AICommanderFunctionLibrary_AITargetActor_MakeWithActorTag::ActorTag' has a wrong offset!");
static_assert(offsetof(AICommanderFunctionLibrary_AITargetActor_MakeWithActorTag, ReturnValue) == 0x000010, "Member 'AICommanderFunctionLibrary_AITargetActor_MakeWithActorTag::ReturnValue' has a wrong offset!");

// Function Tempest.AICommanderFunctionLibrary.AITargetLocation_GetLocation
// 0x0028 (0x0028 - 0x0000)
struct AICommanderFunctionLibrary_AITargetLocation_GetLocation final
{
public:
	struct FAITargetLocation                      TargetLocation;                                    // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector2D                              ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AICommanderFunctionLibrary_AITargetLocation_GetLocation) == 0x000008, "Wrong alignment on AICommanderFunctionLibrary_AITargetLocation_GetLocation");
static_assert(sizeof(AICommanderFunctionLibrary_AITargetLocation_GetLocation) == 0x000028, "Wrong size on AICommanderFunctionLibrary_AITargetLocation_GetLocation");
static_assert(offsetof(AICommanderFunctionLibrary_AITargetLocation_GetLocation, TargetLocation) == 0x000000, "Member 'AICommanderFunctionLibrary_AITargetLocation_GetLocation::TargetLocation' has a wrong offset!");
static_assert(offsetof(AICommanderFunctionLibrary_AITargetLocation_GetLocation, ReturnValue) == 0x000018, "Member 'AICommanderFunctionLibrary_AITargetLocation_GetLocation::ReturnValue' has a wrong offset!");

// Function Tempest.AICommanderFunctionLibrary.AITargetLocation_GetRadius
// 0x0020 (0x0020 - 0x0000)
struct AICommanderFunctionLibrary_AITargetLocation_GetRadius final
{
public:
	struct FAITargetLocation                      TargetLocation;                                    // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0018(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AICommanderFunctionLibrary_AITargetLocation_GetRadius) == 0x000008, "Wrong alignment on AICommanderFunctionLibrary_AITargetLocation_GetRadius");
static_assert(sizeof(AICommanderFunctionLibrary_AITargetLocation_GetRadius) == 0x000020, "Wrong size on AICommanderFunctionLibrary_AITargetLocation_GetRadius");
static_assert(offsetof(AICommanderFunctionLibrary_AITargetLocation_GetRadius, TargetLocation) == 0x000000, "Member 'AICommanderFunctionLibrary_AITargetLocation_GetRadius::TargetLocation' has a wrong offset!");
static_assert(offsetof(AICommanderFunctionLibrary_AITargetLocation_GetRadius, ReturnValue) == 0x000018, "Member 'AICommanderFunctionLibrary_AITargetLocation_GetRadius::ReturnValue' has a wrong offset!");

// Function Tempest.AICommanderFunctionLibrary.AITargetLocation_IsValid
// 0x0020 (0x0020 - 0x0000)
struct AICommanderFunctionLibrary_AITargetLocation_IsValid final
{
public:
	struct FAITargetLocation                      TargetLocation;                                    // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AICommanderFunctionLibrary_AITargetLocation_IsValid) == 0x000008, "Wrong alignment on AICommanderFunctionLibrary_AITargetLocation_IsValid");
static_assert(sizeof(AICommanderFunctionLibrary_AITargetLocation_IsValid) == 0x000020, "Wrong size on AICommanderFunctionLibrary_AITargetLocation_IsValid");
static_assert(offsetof(AICommanderFunctionLibrary_AITargetLocation_IsValid, TargetLocation) == 0x000000, "Member 'AICommanderFunctionLibrary_AITargetLocation_IsValid::TargetLocation' has a wrong offset!");
static_assert(offsetof(AICommanderFunctionLibrary_AITargetLocation_IsValid, ReturnValue) == 0x000018, "Member 'AICommanderFunctionLibrary_AITargetLocation_IsValid::ReturnValue' has a wrong offset!");

// Function Tempest.AICommanderFunctionLibrary.AITargetLocation_Make
// 0x0030 (0x0030 - 0x0000)
struct AICommanderFunctionLibrary_AITargetLocation_Make final
{
public:
	struct FVector2D                              Location;                                          // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Radius;                                            // 0x0010(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAITargetLocation                      ReturnValue;                                       // 0x0018(0x0018)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(AICommanderFunctionLibrary_AITargetLocation_Make) == 0x000008, "Wrong alignment on AICommanderFunctionLibrary_AITargetLocation_Make");
static_assert(sizeof(AICommanderFunctionLibrary_AITargetLocation_Make) == 0x000030, "Wrong size on AICommanderFunctionLibrary_AITargetLocation_Make");
static_assert(offsetof(AICommanderFunctionLibrary_AITargetLocation_Make, Location) == 0x000000, "Member 'AICommanderFunctionLibrary_AITargetLocation_Make::Location' has a wrong offset!");
static_assert(offsetof(AICommanderFunctionLibrary_AITargetLocation_Make, Radius) == 0x000010, "Member 'AICommanderFunctionLibrary_AITargetLocation_Make::Radius' has a wrong offset!");
static_assert(offsetof(AICommanderFunctionLibrary_AITargetLocation_Make, ReturnValue) == 0x000018, "Member 'AICommanderFunctionLibrary_AITargetLocation_Make::ReturnValue' has a wrong offset!");

// Function Tempest.AICommanderFunctionLibrary.AITargetLocation_MakeWithActorLocation
// 0x0028 (0x0028 - 0x0000)
struct AICommanderFunctionLibrary_AITargetLocation_MakeWithActorLocation final
{
public:
	const class AActor*                           Actor;                                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Radius;                                            // 0x0008(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAITargetLocation                      ReturnValue;                                       // 0x0010(0x0018)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(AICommanderFunctionLibrary_AITargetLocation_MakeWithActorLocation) == 0x000008, "Wrong alignment on AICommanderFunctionLibrary_AITargetLocation_MakeWithActorLocation");
static_assert(sizeof(AICommanderFunctionLibrary_AITargetLocation_MakeWithActorLocation) == 0x000028, "Wrong size on AICommanderFunctionLibrary_AITargetLocation_MakeWithActorLocation");
static_assert(offsetof(AICommanderFunctionLibrary_AITargetLocation_MakeWithActorLocation, Actor) == 0x000000, "Member 'AICommanderFunctionLibrary_AITargetLocation_MakeWithActorLocation::Actor' has a wrong offset!");
static_assert(offsetof(AICommanderFunctionLibrary_AITargetLocation_MakeWithActorLocation, Radius) == 0x000008, "Member 'AICommanderFunctionLibrary_AITargetLocation_MakeWithActorLocation::Radius' has a wrong offset!");
static_assert(offsetof(AICommanderFunctionLibrary_AITargetLocation_MakeWithActorLocation, ReturnValue) == 0x000010, "Member 'AICommanderFunctionLibrary_AITargetLocation_MakeWithActorLocation::ReturnValue' has a wrong offset!");

// Function Tempest.AICommanderFunctionLibrary.CreateAIMission
// 0x0028 (0x0028 - 0x0000)
struct AICommanderFunctionLibrary_CreateAIMission final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETedPlayerID                                  PlayerID;                                          // 0x0008(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UAIMission>                 MissionClass;                                      // 0x0010(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAutoActivate;                                     // 0x0018(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAIMission*                             ReturnValue;                                       // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AICommanderFunctionLibrary_CreateAIMission) == 0x000008, "Wrong alignment on AICommanderFunctionLibrary_CreateAIMission");
static_assert(sizeof(AICommanderFunctionLibrary_CreateAIMission) == 0x000028, "Wrong size on AICommanderFunctionLibrary_CreateAIMission");
static_assert(offsetof(AICommanderFunctionLibrary_CreateAIMission, WorldContextObject) == 0x000000, "Member 'AICommanderFunctionLibrary_CreateAIMission::WorldContextObject' has a wrong offset!");
static_assert(offsetof(AICommanderFunctionLibrary_CreateAIMission, PlayerID) == 0x000008, "Member 'AICommanderFunctionLibrary_CreateAIMission::PlayerID' has a wrong offset!");
static_assert(offsetof(AICommanderFunctionLibrary_CreateAIMission, MissionClass) == 0x000010, "Member 'AICommanderFunctionLibrary_CreateAIMission::MissionClass' has a wrong offset!");
static_assert(offsetof(AICommanderFunctionLibrary_CreateAIMission, bAutoActivate) == 0x000018, "Member 'AICommanderFunctionLibrary_CreateAIMission::bAutoActivate' has a wrong offset!");
static_assert(offsetof(AICommanderFunctionLibrary_CreateAIMission, ReturnValue) == 0x000020, "Member 'AICommanderFunctionLibrary_CreateAIMission::ReturnValue' has a wrong offset!");

// Function Tempest.AICommanderFunctionLibrary.FindAIMissionByClass
// 0x0028 (0x0028 - 0x0000)
struct AICommanderFunctionLibrary_FindAIMissionByClass final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETedPlayerID                                  PlayerID;                                          // 0x0008(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UAIMission>                 MissionClass;                                      // 0x0010(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bExactMatch;                                       // 0x0018(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAIMission*                             ReturnValue;                                       // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AICommanderFunctionLibrary_FindAIMissionByClass) == 0x000008, "Wrong alignment on AICommanderFunctionLibrary_FindAIMissionByClass");
static_assert(sizeof(AICommanderFunctionLibrary_FindAIMissionByClass) == 0x000028, "Wrong size on AICommanderFunctionLibrary_FindAIMissionByClass");
static_assert(offsetof(AICommanderFunctionLibrary_FindAIMissionByClass, WorldContextObject) == 0x000000, "Member 'AICommanderFunctionLibrary_FindAIMissionByClass::WorldContextObject' has a wrong offset!");
static_assert(offsetof(AICommanderFunctionLibrary_FindAIMissionByClass, PlayerID) == 0x000008, "Member 'AICommanderFunctionLibrary_FindAIMissionByClass::PlayerID' has a wrong offset!");
static_assert(offsetof(AICommanderFunctionLibrary_FindAIMissionByClass, MissionClass) == 0x000010, "Member 'AICommanderFunctionLibrary_FindAIMissionByClass::MissionClass' has a wrong offset!");
static_assert(offsetof(AICommanderFunctionLibrary_FindAIMissionByClass, bExactMatch) == 0x000018, "Member 'AICommanderFunctionLibrary_FindAIMissionByClass::bExactMatch' has a wrong offset!");
static_assert(offsetof(AICommanderFunctionLibrary_FindAIMissionByClass, ReturnValue) == 0x000020, "Member 'AICommanderFunctionLibrary_FindAIMissionByClass::ReturnValue' has a wrong offset!");

// Function Tempest.AICommanderFunctionLibrary.FindAIMissionByHandle
// 0x0018 (0x0018 - 0x0000)
struct AICommanderFunctionLibrary_FindAIMissionByHandle final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETedPlayerID                                  PlayerID;                                          // 0x0008(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAIMissionHandle                       MissionHandle;                                     // 0x000C(0x0004)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAIMission*                             ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AICommanderFunctionLibrary_FindAIMissionByHandle) == 0x000008, "Wrong alignment on AICommanderFunctionLibrary_FindAIMissionByHandle");
static_assert(sizeof(AICommanderFunctionLibrary_FindAIMissionByHandle) == 0x000018, "Wrong size on AICommanderFunctionLibrary_FindAIMissionByHandle");
static_assert(offsetof(AICommanderFunctionLibrary_FindAIMissionByHandle, WorldContextObject) == 0x000000, "Member 'AICommanderFunctionLibrary_FindAIMissionByHandle::WorldContextObject' has a wrong offset!");
static_assert(offsetof(AICommanderFunctionLibrary_FindAIMissionByHandle, PlayerID) == 0x000008, "Member 'AICommanderFunctionLibrary_FindAIMissionByHandle::PlayerID' has a wrong offset!");
static_assert(offsetof(AICommanderFunctionLibrary_FindAIMissionByHandle, MissionHandle) == 0x00000C, "Member 'AICommanderFunctionLibrary_FindAIMissionByHandle::MissionHandle' has a wrong offset!");
static_assert(offsetof(AICommanderFunctionLibrary_FindAIMissionByHandle, ReturnValue) == 0x000010, "Member 'AICommanderFunctionLibrary_FindAIMissionByHandle::ReturnValue' has a wrong offset!");

// Function Tempest.AICommanderFunctionLibrary.FindAIMissionByTag
// 0x0020 (0x0020 - 0x0000)
struct AICommanderFunctionLibrary_FindAIMissionByTag final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETedPlayerID                                  PlayerID;                                          // 0x0008(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           MissionTag;                                        // 0x000C(0x0008)(ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bExactMatch;                                       // 0x0014(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAIMission*                             ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AICommanderFunctionLibrary_FindAIMissionByTag) == 0x000008, "Wrong alignment on AICommanderFunctionLibrary_FindAIMissionByTag");
static_assert(sizeof(AICommanderFunctionLibrary_FindAIMissionByTag) == 0x000020, "Wrong size on AICommanderFunctionLibrary_FindAIMissionByTag");
static_assert(offsetof(AICommanderFunctionLibrary_FindAIMissionByTag, WorldContextObject) == 0x000000, "Member 'AICommanderFunctionLibrary_FindAIMissionByTag::WorldContextObject' has a wrong offset!");
static_assert(offsetof(AICommanderFunctionLibrary_FindAIMissionByTag, PlayerID) == 0x000008, "Member 'AICommanderFunctionLibrary_FindAIMissionByTag::PlayerID' has a wrong offset!");
static_assert(offsetof(AICommanderFunctionLibrary_FindAIMissionByTag, MissionTag) == 0x00000C, "Member 'AICommanderFunctionLibrary_FindAIMissionByTag::MissionTag' has a wrong offset!");
static_assert(offsetof(AICommanderFunctionLibrary_FindAIMissionByTag, bExactMatch) == 0x000014, "Member 'AICommanderFunctionLibrary_FindAIMissionByTag::bExactMatch' has a wrong offset!");
static_assert(offsetof(AICommanderFunctionLibrary_FindAIMissionByTag, ReturnValue) == 0x000018, "Member 'AICommanderFunctionLibrary_FindAIMissionByTag::ReturnValue' has a wrong offset!");

// Function Tempest.AICommanderFunctionLibrary.FindAIMissionByTags
// 0x0040 (0x0040 - 0x0000)
struct AICommanderFunctionLibrary_FindAIMissionByTags final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETedPlayerID                                  PlayerID;                                          // 0x0008(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  MissionTags;                                       // 0x0010(0x0020)(ConstParm, Parm, NativeAccessSpecifierPublic)
	EGameplayContainerMatchType                   MatchType;                                         // 0x0030(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bExactMatch;                                       // 0x0031(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAIMission*                             ReturnValue;                                       // 0x0038(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AICommanderFunctionLibrary_FindAIMissionByTags) == 0x000008, "Wrong alignment on AICommanderFunctionLibrary_FindAIMissionByTags");
static_assert(sizeof(AICommanderFunctionLibrary_FindAIMissionByTags) == 0x000040, "Wrong size on AICommanderFunctionLibrary_FindAIMissionByTags");
static_assert(offsetof(AICommanderFunctionLibrary_FindAIMissionByTags, WorldContextObject) == 0x000000, "Member 'AICommanderFunctionLibrary_FindAIMissionByTags::WorldContextObject' has a wrong offset!");
static_assert(offsetof(AICommanderFunctionLibrary_FindAIMissionByTags, PlayerID) == 0x000008, "Member 'AICommanderFunctionLibrary_FindAIMissionByTags::PlayerID' has a wrong offset!");
static_assert(offsetof(AICommanderFunctionLibrary_FindAIMissionByTags, MissionTags) == 0x000010, "Member 'AICommanderFunctionLibrary_FindAIMissionByTags::MissionTags' has a wrong offset!");
static_assert(offsetof(AICommanderFunctionLibrary_FindAIMissionByTags, MatchType) == 0x000030, "Member 'AICommanderFunctionLibrary_FindAIMissionByTags::MatchType' has a wrong offset!");
static_assert(offsetof(AICommanderFunctionLibrary_FindAIMissionByTags, bExactMatch) == 0x000031, "Member 'AICommanderFunctionLibrary_FindAIMissionByTags::bExactMatch' has a wrong offset!");
static_assert(offsetof(AICommanderFunctionLibrary_FindAIMissionByTags, ReturnValue) == 0x000038, "Member 'AICommanderFunctionLibrary_FindAIMissionByTags::ReturnValue' has a wrong offset!");

// Function Tempest.AICommanderFunctionLibrary.FindAIMissions
// 0x0030 (0x0030 - 0x0000)
struct AICommanderFunctionLibrary_FindAIMissions final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETedPlayerID                                  PlayerID;                                          // 0x0008(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UAIMission>                 MissionClass;                                      // 0x0010(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bExactMatch;                                       // 0x0018(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UAIMission*>                     ReturnValue;                                       // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(AICommanderFunctionLibrary_FindAIMissions) == 0x000008, "Wrong alignment on AICommanderFunctionLibrary_FindAIMissions");
static_assert(sizeof(AICommanderFunctionLibrary_FindAIMissions) == 0x000030, "Wrong size on AICommanderFunctionLibrary_FindAIMissions");
static_assert(offsetof(AICommanderFunctionLibrary_FindAIMissions, WorldContextObject) == 0x000000, "Member 'AICommanderFunctionLibrary_FindAIMissions::WorldContextObject' has a wrong offset!");
static_assert(offsetof(AICommanderFunctionLibrary_FindAIMissions, PlayerID) == 0x000008, "Member 'AICommanderFunctionLibrary_FindAIMissions::PlayerID' has a wrong offset!");
static_assert(offsetof(AICommanderFunctionLibrary_FindAIMissions, MissionClass) == 0x000010, "Member 'AICommanderFunctionLibrary_FindAIMissions::MissionClass' has a wrong offset!");
static_assert(offsetof(AICommanderFunctionLibrary_FindAIMissions, bExactMatch) == 0x000018, "Member 'AICommanderFunctionLibrary_FindAIMissions::bExactMatch' has a wrong offset!");
static_assert(offsetof(AICommanderFunctionLibrary_FindAIMissions, ReturnValue) == 0x000020, "Member 'AICommanderFunctionLibrary_FindAIMissions::ReturnValue' has a wrong offset!");

// Function Tempest.AICommanderFunctionLibrary.FindAIMissionsByTag
// 0x0028 (0x0028 - 0x0000)
struct AICommanderFunctionLibrary_FindAIMissionsByTag final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETedPlayerID                                  PlayerID;                                          // 0x0008(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           MissionTag;                                        // 0x000C(0x0008)(ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bExactMatch;                                       // 0x0014(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UAIMission*>                     ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(AICommanderFunctionLibrary_FindAIMissionsByTag) == 0x000008, "Wrong alignment on AICommanderFunctionLibrary_FindAIMissionsByTag");
static_assert(sizeof(AICommanderFunctionLibrary_FindAIMissionsByTag) == 0x000028, "Wrong size on AICommanderFunctionLibrary_FindAIMissionsByTag");
static_assert(offsetof(AICommanderFunctionLibrary_FindAIMissionsByTag, WorldContextObject) == 0x000000, "Member 'AICommanderFunctionLibrary_FindAIMissionsByTag::WorldContextObject' has a wrong offset!");
