#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ScoreScreen_Resources

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_ScoreScreen_Resources.WBP_ScoreScreen_Resources_C.ExecuteUbergraph_WBP_ScoreScreen_Resources
// 0x0018 (0x0018 - 0x0000)
struct WBP_ScoreScreen_Resources_C_ExecuteUbergraph_WBP_ScoreScreen_Resources final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(ESlateVisibility NewVisibility)> K2Node_CreateDelegate_OutputDelegate;            // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_CustomEvent_NewVisibility;                  // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ScoreScreen_Resources_C_ExecuteUbergraph_WBP_ScoreScreen_Resources) == 0x000004, "Wrong alignment on WBP_ScoreScreen_Resources_C_ExecuteUbergraph_WBP_ScoreScreen_Resources");
static_assert(sizeof(WBP_ScoreScreen_Resources_C_ExecuteUbergraph_WBP_ScoreScreen_Resources) == 0x000018, "Wrong size on WBP_ScoreScreen_Resources_C_ExecuteUbergraph_WBP_ScoreScreen_Resources");
static_assert(offsetof(WBP_ScoreScreen_Resources_C_ExecuteUbergraph_WBP_ScoreScreen_Resources, EntryPoint) == 0x000000, "Member 'WBP_ScoreScreen_Resources_C_ExecuteUbergraph_WBP_ScoreScreen_Resources::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_ScoreScreen_Resources_C_ExecuteUbergraph_WBP_ScoreScreen_Resources, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_ScoreScreen_Resources_C_ExecuteUbergraph_WBP_ScoreScreen_Resources::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_ScoreScreen_Resources_C_ExecuteUbergraph_WBP_ScoreScreen_Resources, K2Node_CustomEvent_NewVisibility) == 0x000014, "Member 'WBP_ScoreScreen_Resources_C_ExecuteUbergraph_WBP_ScoreScreen_Resources::K2Node_CustomEvent_NewVisibility' has a wrong offset!");
static_assert(offsetof(WBP_ScoreScreen_Resources_C_ExecuteUbergraph_WBP_ScoreScreen_Resources, K2Node_SwitchEnum_CmpSuccess) == 0x000015, "Member 'WBP_ScoreScreen_Resources_C_ExecuteUbergraph_WBP_ScoreScreen_Resources::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function WBP_ScoreScreen_Resources.WBP_ScoreScreen_Resources_C.OnScrollBarVisibilityChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_ScoreScreen_Resources_C_OnScrollBarVisibilityChanged final
{
public:
	ESlateVisibility                              NewVisibility;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ScoreScreen_Resources_C_OnScrollBarVisibilityChanged) == 0x000001, "Wrong alignment on WBP_ScoreScreen_Resources_C_OnScrollBarVisibilityChanged");
static_assert(sizeof(WBP_ScoreScreen_Resources_C_OnScrollBarVisibilityChanged) == 0x000001, "Wrong size on WBP_ScoreScreen_Resources_C_OnScrollBarVisibilityChanged");
static_assert(offsetof(WBP_ScoreScreen_Resources_C_OnScrollBarVisibilityChanged, NewVisibility) == 0x000000, "Member 'WBP_ScoreScreen_Resources_C_OnScrollBarVisibilityChanged::NewVisibility' has a wrong offset!");

}

