#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Settings

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Tempest_structs.hpp"


namespace SDK::Params
{

// Function WBP_Settings.WBP_Settings_C.SetSize
// 0x0048 (0x0048 - 0x0000)
struct WBP_Settings_C_SetSize final
{
public:
	class UWidget*                                Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        InSize;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetSize_ReturnValue;                      // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X;                          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_C_SetSize) == 0x000008, "Wrong alignment on WBP_Settings_C_SetSize");
static_assert(sizeof(WBP_Settings_C_SetSize) == 0x000048, "Wrong size on WBP_Settings_C_SetSize");
static_assert(offsetof(WBP_Settings_C_SetSize, Widget) == 0x000000, "Member 'WBP_Settings_C_SetSize::Widget' has a wrong offset!");
static_assert(offsetof(WBP_Settings_C_SetSize, InSize) == 0x000008, "Member 'WBP_Settings_C_SetSize::InSize' has a wrong offset!");
static_assert(offsetof(WBP_Settings_C_SetSize, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000010, "Member 'WBP_Settings_C_SetSize::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_C_SetSize, CallFunc_GetSize_ReturnValue) == 0x000018, "Member 'WBP_Settings_C_SetSize::CallFunc_GetSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_C_SetSize, CallFunc_BreakVector2D_X) == 0x000028, "Member 'WBP_Settings_C_SetSize::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(WBP_Settings_C_SetSize, CallFunc_BreakVector2D_Y) == 0x000030, "Member 'WBP_Settings_C_SetSize::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(WBP_Settings_C_SetSize, CallFunc_MakeVector2D_ReturnValue) == 0x000038, "Member 'WBP_Settings_C_SetSize::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");

// Function WBP_Settings.WBP_Settings_C.RefreshLayout
// 0x0040 (0x0040 - 0x0000)
struct WBP_Settings_C_RefreshLayout final
{
public:
	class UCanvasPanelSlot*                       Local_ScrollBoxCanvasSlot;                         // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_Settings_Panel_C*                  K2Node_DynamicCast_AsWBP_Settings_Panel;           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_C_RefreshLayout) == 0x000008, "Wrong alignment on WBP_Settings_C_RefreshLayout");
static_assert(sizeof(WBP_Settings_C_RefreshLayout) == 0x000040, "Wrong size on WBP_Settings_C_RefreshLayout");
static_assert(offsetof(WBP_Settings_C_RefreshLayout, Local_ScrollBoxCanvasSlot) == 0x000000, "Member 'WBP_Settings_C_RefreshLayout::Local_ScrollBoxCanvasSlot' has a wrong offset!");
static_assert(offsetof(WBP_Settings_C_RefreshLayout, CallFunc_GetChildrenCount_ReturnValue) == 0x000008, "Member 'WBP_Settings_C_RefreshLayout::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_C_RefreshLayout, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000010, "Member 'WBP_Settings_C_RefreshLayout::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_C_RefreshLayout, CallFunc_Subtract_IntInt_ReturnValue) == 0x000018, "Member 'WBP_Settings_C_RefreshLayout::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_C_RefreshLayout, Temp_int_Variable) == 0x00001C, "Member 'WBP_Settings_C_RefreshLayout::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Settings_C_RefreshLayout, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'WBP_Settings_C_RefreshLayout::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_C_RefreshLayout, CallFunc_GetChildAt_ReturnValue) == 0x000028, "Member 'WBP_Settings_C_RefreshLayout::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_C_RefreshLayout, K2Node_DynamicCast_AsWBP_Settings_Panel) == 0x000030, "Member 'WBP_Settings_C_RefreshLayout::K2Node_DynamicCast_AsWBP_Settings_Panel' has a wrong offset!");
static_assert(offsetof(WBP_Settings_C_RefreshLayout, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'WBP_Settings_C_RefreshLayout::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Settings_C_RefreshLayout, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000039, "Member 'WBP_Settings_C_RefreshLayout::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_Settings.WBP_Settings_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_Settings_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_Settings_C_PreConstruct");
static_assert(sizeof(WBP_Settings_C_PreConstruct) == 0x000001, "Wrong size on WBP_Settings_C_PreConstruct");
static_assert(offsetof(WBP_Settings_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_Settings_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_Settings.WBP_Settings_C.ExecuteUbergraph_WBP_Settings
// 0x0020 (0x0020 - 0x0000)
struct WBP_Settings_C_ExecuteUbergraph_WBP_Settings final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTedContentPanelBase*                   K2Node_ComponentBoundEvent_InContentPanel;         // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UTedContentPanelSlotBase*               K2Node_ComponentBoundEvent_InContentSlot;          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ETedContentSlotAction                         K2Node_ComponentBoundEvent_InAction;               // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_C_ExecuteUbergraph_WBP_Settings) == 0x000008, "Wrong alignment on WBP_Settings_C_ExecuteUbergraph_WBP_Settings");
static_assert(sizeof(WBP_Settings_C_ExecuteUbergraph_WBP_Settings) == 0x000020, "Wrong size on WBP_Settings_C_ExecuteUbergraph_WBP_Settings");
static_assert(offsetof(WBP_Settings_C_ExecuteUbergraph_WBP_Settings, EntryPoint) == 0x000000, "Member 'WBP_Settings_C_ExecuteUbergraph_WBP_Settings::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Settings_C_ExecuteUbergraph_WBP_Settings, K2Node_ComponentBoundEvent_InContentPanel) == 0x000008, "Member 'WBP_Settings_C_ExecuteUbergraph_WBP_Settings::K2Node_ComponentBoundEvent_InContentPanel' has a wrong offset!");
static_assert(offsetof(WBP_Settings_C_ExecuteUbergraph_WBP_Settings, K2Node_ComponentBoundEvent_InContentSlot) == 0x000010, "Member 'WBP_Settings_C_ExecuteUbergraph_WBP_Settings::K2Node_ComponentBoundEvent_InContentSlot' has a wrong offset!");
static_assert(offsetof(WBP_Settings_C_ExecuteUbergraph_WBP_Settings, K2Node_ComponentBoundEvent_InAction) == 0x000018, "Member 'WBP_Settings_C_ExecuteUbergraph_WBP_Settings::K2Node_ComponentBoundEvent_InAction' has a wrong offset!");
static_assert(offsetof(WBP_Settings_C_ExecuteUbergraph_WBP_Settings, K2Node_Event_IsDesignTime) == 0x000019, "Member 'WBP_Settings_C_ExecuteUbergraph_WBP_Settings::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function WBP_Settings.WBP_Settings_C.BndEvt__WBP_GameSettings_ButtonsPanel_K2Node_ComponentBoundEvent_0_ContentPanelActionDelegateSignature__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct WBP_Settings_C_BndEvt__WBP_GameSettings_ButtonsPanel_K2Node_ComponentBoundEvent_0_ContentPanelActionDelegateSignature__DelegateSignature final
{
public:
	class UTedContentPanelBase*                   InContentPanel;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UTedContentPanelSlotBase*               InContentSlot;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ETedContentSlotAction                         InAction;                                          // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_C_BndEvt__WBP_GameSettings_ButtonsPanel_K2Node_ComponentBoundEvent_0_ContentPanelActionDelegateSignature__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Settings_C_BndEvt__WBP_GameSettings_ButtonsPanel_K2Node_ComponentBoundEvent_0_ContentPanelActionDelegateSignature__DelegateSignature");
static_assert(sizeof(WBP_Settings_C_BndEvt__WBP_GameSettings_ButtonsPanel_K2Node_ComponentBoundEvent_0_ContentPanelActionDelegateSignature__DelegateSignature) == 0x000018, "Wrong size on WBP_Settings_C_BndEvt__WBP_GameSettings_ButtonsPanel_K2Node_ComponentBoundEvent_0_ContentPanelActionDelegateSignature__DelegateSignature");
static_assert(offsetof(WBP_Settings_C_BndEvt__WBP_GameSettings_ButtonsPanel_K2Node_ComponentBoundEvent_0_ContentPanelActionDelegateSignature__DelegateSignature, InContentPanel) == 0x000000, "Member 'WBP_Settings_C_BndEvt__WBP_GameSettings_ButtonsPanel_K2Node_ComponentBoundEvent_0_ContentPanelActionDelegateSignature__DelegateSignature::InContentPanel' has a wrong offset!");
static_assert(offsetof(WBP_Settings_C_BndEvt__WBP_GameSettings_ButtonsPanel_K2Node_ComponentBoundEvent_0_ContentPanelActionDelegateSignature__DelegateSignature, InContentSlot) == 0x000008, "Member 'WBP_Settings_C_BndEvt__WBP_GameSettings_ButtonsPanel_K2Node_ComponentBoundEvent_0_ContentPanelActionDelegateSignature__DelegateSignature::InContentSlot' has a wrong offset!");
static_assert(offsetof(WBP_Settings_C_BndEvt__WBP_GameSettings_ButtonsPanel_K2Node_ComponentBoundEvent_0_ContentPanelActionDelegateSignature__DelegateSignature, InAction) == 0x000010, "Member 'WBP_Settings_C_BndEvt__WBP_GameSettings_ButtonsPanel_K2Node_ComponentBoundEvent_0_ContentPanelActionDelegateSignature__DelegateSignature::InAction' has a wrong offset!");

}

