#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ScoreScreen_Graph_Participants_Slot

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Tempest_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_ScoreScreen_Graph_Participants_Slot.WBP_ScoreScreen_Graph_Participants_Slot_C.GetParticipantAvatar
// 0x0018 (0x0018 - 0x0000)
struct WBP_ScoreScreen_Graph_Participants_Slot_C_GetParticipantAvatar final
{
public:
	class UTexture2D*                             OutValue;                                          // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             CallFunc_K2_GetContentValue_Object_OutValue;       // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_GetContentValue_Object_ReturnValue;    // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ScoreScreen_Graph_Participants_Slot_C_GetParticipantAvatar) == 0x000008, "Wrong alignment on WBP_ScoreScreen_Graph_Participants_Slot_C_GetParticipantAvatar");
static_assert(sizeof(WBP_ScoreScreen_Graph_Participants_Slot_C_GetParticipantAvatar) == 0x000018, "Wrong size on WBP_ScoreScreen_Graph_Participants_Slot_C_GetParticipantAvatar");
static_assert(offsetof(WBP_ScoreScreen_Graph_Participants_Slot_C_GetParticipantAvatar, OutValue) == 0x000000, "Member 'WBP_ScoreScreen_Graph_Participants_Slot_C_GetParticipantAvatar::OutValue' has a wrong offset!");
static_assert(offsetof(WBP_ScoreScreen_Graph_Participants_Slot_C_GetParticipantAvatar, CallFunc_K2_GetContentValue_Object_OutValue) == 0x000008, "Member 'WBP_ScoreScreen_Graph_Participants_Slot_C_GetParticipantAvatar::CallFunc_K2_GetContentValue_Object_OutValue' has a wrong offset!");
static_assert(offsetof(WBP_ScoreScreen_Graph_Participants_Slot_C_GetParticipantAvatar, CallFunc_K2_GetContentValue_Object_ReturnValue) == 0x000010, "Member 'WBP_ScoreScreen_Graph_Participants_Slot_C_GetParticipantAvatar::CallFunc_K2_GetContentValue_Object_ReturnValue' has a wrong offset!");

// Function WBP_ScoreScreen_Graph_Participants_Slot.WBP_ScoreScreen_Graph_Participants_Slot_C.GetParticipantName
// 0x0028 (0x0028 - 0x0000)
struct WBP_ScoreScreen_Graph_Participants_Slot_C_GetParticipantName final
{
public:
	class FText                                   OutValue;                                          // 0x0000(0x0010)(Parm, OutParm)
	class FText                                   CallFunc_K2_GetContentValue_Text_OutValue;         // 0x0010(0x0010)()
	bool                                          CallFunc_K2_GetContentValue_Text_ReturnValue;      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ScoreScreen_Graph_Participants_Slot_C_GetParticipantName) == 0x000008, "Wrong alignment on WBP_ScoreScreen_Graph_Participants_Slot_C_GetParticipantName");
static_assert(sizeof(WBP_ScoreScreen_Graph_Participants_Slot_C_GetParticipantName) == 0x000028, "Wrong size on WBP_ScoreScreen_Graph_Participants_Slot_C_GetParticipantName");
static_assert(offsetof(WBP_ScoreScreen_Graph_Participants_Slot_C_GetParticipantName, OutValue) == 0x000000, "Member 'WBP_ScoreScreen_Graph_Participants_Slot_C_GetParticipantName::OutValue' has a wrong offset!");
static_assert(offsetof(WBP_ScoreScreen_Graph_Participants_Slot_C_GetParticipantName, CallFunc_K2_GetContentValue_Text_OutValue) == 0x000010, "Member 'WBP_ScoreScreen_Graph_Participants_Slot_C_GetParticipantName::CallFunc_K2_GetContentValue_Text_OutValue' has a wrong offset!");
static_assert(offsetof(WBP_ScoreScreen_Graph_Participants_Slot_C_GetParticipantName, CallFunc_K2_GetContentValue_Text_ReturnValue) == 0x000020, "Member 'WBP_ScoreScreen_Graph_Participants_Slot_C_GetParticipantName::CallFunc_K2_GetContentValue_Text_ReturnValue' has a wrong offset!");

// Function WBP_ScoreScreen_Graph_Participants_Slot.WBP_ScoreScreen_Graph_Participants_Slot_C.GetPlayerColor
// 0x0078 (0x0078 - 0x0000)
struct WBP_ScoreScreen_Graph_Participants_Slot_C_GetPlayerColor final
{
public:
	struct FLinearColor                           Output;                                            // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTedGenericDataContainer               CallFunc_GetContent_OutContent;                    // 0x0010(0x0050)()
	bool                                          CallFunc_GetContent_ReturnValue;                   // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetGenericValue_Enum_Value;               // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetGenericValue_Enum_ReturnValue;         // 0x0062(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_63[0x1];                                       // 0x0063(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_GetPerceivedPlayerColor_ReturnValue;      // 0x0064(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ScoreScreen_Graph_Participants_Slot_C_GetPlayerColor) == 0x000008, "Wrong alignment on WBP_ScoreScreen_Graph_Participants_Slot_C_GetPlayerColor");
static_assert(sizeof(WBP_ScoreScreen_Graph_Participants_Slot_C_GetPlayerColor) == 0x000078, "Wrong size on WBP_ScoreScreen_Graph_Participants_Slot_C_GetPlayerColor");
static_assert(offsetof(WBP_ScoreScreen_Graph_Participants_Slot_C_GetPlayerColor, Output) == 0x000000, "Member 'WBP_ScoreScreen_Graph_Participants_Slot_C_GetPlayerColor::Output' has a wrong offset!");
static_assert(offsetof(WBP_ScoreScreen_Graph_Participants_Slot_C_GetPlayerColor, CallFunc_GetContent_OutContent) == 0x000010, "Member 'WBP_ScoreScreen_Graph_Participants_Slot_C_GetPlayerColor::CallFunc_GetContent_OutContent' has a wrong offset!");
static_assert(offsetof(WBP_ScoreScreen_Graph_Participants_Slot_C_GetPlayerColor, CallFunc_GetContent_ReturnValue) == 0x000060, "Member 'WBP_ScoreScreen_Graph_Participants_Slot_C_GetPlayerColor::CallFunc_GetContent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ScoreScreen_Graph_Participants_Slot_C_GetPlayerColor, CallFunc_GetGenericValue_Enum_Value) == 0x000061, "Member 'WBP_ScoreScreen_Graph_Participants_Slot_C_GetPlayerColor::CallFunc_GetGenericValue_Enum_Value' has a wrong offset!");
static_assert(offsetof(WBP_ScoreScreen_Graph_Participants_Slot_C_GetPlayerColor, CallFunc_GetGenericValue_Enum_ReturnValue) == 0x000062, "Member 'WBP_ScoreScreen_Graph_Participants_Slot_C_GetPlayerColor::CallFunc_GetGenericValue_Enum_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ScoreScreen_Graph_Participants_Slot_C_GetPlayerColor, CallFunc_GetPerceivedPlayerColor_ReturnValue) == 0x000064, "Member 'WBP_ScoreScreen_Graph_Participants_Slot_C_GetPlayerColor::CallFunc_GetPerceivedPlayerColor_ReturnValue' has a wrong offset!");

// Function WBP_ScoreScreen_Graph_Participants_Slot.WBP_ScoreScreen_Graph_Participants_Slot_C.OnActivateState
// 0x0003 (0x0003 - 0x0000)
struct WBP_ScoreScreen_Graph_Participants_Slot_C_OnActivateState final
{
public:
	ETedContentSlotState                          InState;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bInActivated;                                      // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ScoreScreen_Graph_Participants_Slot_C_OnActivateState) == 0x000001, "Wrong alignment on WBP_ScoreScreen_Graph_Participants_Slot_C_OnActivateState");
static_assert(sizeof(WBP_ScoreScreen_Graph_Participants_Slot_C_OnActivateState) == 0x000003, "Wrong size on WBP_ScoreScreen_Graph_Participants_Slot_C_OnActivateState");
static_assert(offsetof(WBP_ScoreScreen_Graph_Participants_Slot_C_OnActivateState, InState) == 0x000000, "Member 'WBP_ScoreScreen_Graph_Participants_Slot_C_OnActivateState::InState' has a wrong offset!");
static_assert(offsetof(WBP_ScoreScreen_Graph_Participants_Slot_C_OnActivateState, bInActivated) == 0x000001, "Member 'WBP_ScoreScreen_Graph_Participants_Slot_C_OnActivateState::bInActivated' has a wrong offset!");
static_assert(offsetof(WBP_ScoreScreen_Graph_Participants_Slot_C_OnActivateState, K2Node_SwitchEnum_CmpSuccess) == 0x000002, "Member 'WBP_ScoreScreen_Graph_Participants_Slot_C_OnActivateState::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function WBP_ScoreScreen_Graph_Participants_Slot.WBP_ScoreScreen_Graph_Participants_Slot_C.OnTriggerAction
// 0x0004 (0x0004 - 0x0000)
struct WBP_ScoreScreen_Graph_Participants_Slot_C_OnTriggerAction final
{
public:
	ETedContentSlotAction                         InAction;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsStateActive_ReturnValue;                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ScoreScreen_Graph_Participants_Slot_C_OnTriggerAction) == 0x000001, "Wrong alignment on WBP_ScoreScreen_Graph_Participants_Slot_C_OnTriggerAction");
static_assert(sizeof(WBP_ScoreScreen_Graph_Participants_Slot_C_OnTriggerAction) == 0x000004, "Wrong size on WBP_ScoreScreen_Graph_Participants_Slot_C_OnTriggerAction");
static_assert(offsetof(WBP_ScoreScreen_Graph_Participants_Slot_C_OnTriggerAction, InAction) == 0x000000, "Member 'WBP_ScoreScreen_Graph_Participants_Slot_C_OnTriggerAction::InAction' has a wrong offset!");
static_assert(offsetof(WBP_ScoreScreen_Graph_Participants_Slot_C_OnTriggerAction, CallFunc_IsStateActive_ReturnValue) == 0x000001, "Member 'WBP_ScoreScreen_Graph_Participants_Slot_C_OnTriggerAction::CallFunc_IsStateActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ScoreScreen_Graph_Participants_Slot_C_OnTriggerAction, K2Node_SwitchEnum_CmpSuccess) == 0x000002, "Member 'WBP_ScoreScreen_Graph_Participants_Slot_C_OnTriggerAction::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_ScoreScreen_Graph_Participants_Slot_C_OnTriggerAction, CallFunc_Not_PreBool_ReturnValue) == 0x000003, "Member 'WBP_ScoreScreen_Graph_Participants_Slot_C_OnTriggerAction::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function WBP_ScoreScreen_Graph_Participants_Slot.WBP_ScoreScreen_Graph_Participants_Slot_C.RefreshCheckbox
// 0x0028 (0x0028 - 0x0000)
struct WBP_ScoreScreen_Graph_Participants_Slot_C_RefreshCheckbox final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_1;                            // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsStateActive_ReturnValue;                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     K2Node_Select_Default;                             // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ScoreScreen_Graph_Participants_Slot_C_RefreshCheckbox) == 0x000008, "Wrong alignment on WBP_ScoreScreen_Graph_Participants_Slot_C_RefreshCheckbox");
static_assert(sizeof(WBP_ScoreScreen_Graph_Participants_Slot_C_RefreshCheckbox) == 0x000028, "Wrong size on WBP_ScoreScreen_Graph_Participants_Slot_C_RefreshCheckbox");
static_assert(offsetof(WBP_ScoreScreen_Graph_Participants_Slot_C_RefreshCheckbox, Temp_bool_Variable) == 0x000000, "Member 'WBP_ScoreScreen_Graph_Participants_Slot_C_RefreshCheckbox::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ScoreScreen_Graph_Participants_Slot_C_RefreshCheckbox, Temp_object_Variable) == 0x000008, "Member 'WBP_ScoreScreen_Graph_Participants_Slot_C_RefreshCheckbox::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ScoreScreen_Graph_Participants_Slot_C_RefreshCheckbox, Temp_object_Variable_1) == 0x000010, "Member 'WBP_ScoreScreen_Graph_Participants_Slot_C_RefreshCheckbox::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ScoreScreen_Graph_Participants_Slot_C_RefreshCheckbox, CallFunc_IsStateActive_ReturnValue) == 0x000018, "Member 'WBP_ScoreScreen_Graph_Participants_Slot_C_RefreshCheckbox::CallFunc_IsStateActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ScoreScreen_Graph_Participants_Slot_C_RefreshCheckbox, K2Node_Select_Default) == 0x000020, "Member 'WBP_ScoreScreen_Graph_Participants_Slot_C_RefreshCheckbox::K2Node_Select_Default' has a wrong offset!");

// Function WBP_ScoreScreen_Graph_Participants_Slot.WBP_ScoreScreen_Graph_Participants_Slot_C.RefreshParticipantAvatar
// 0x0010 (0x0010 - 0x0000)
struct WBP_ScoreScreen_Graph_Participants_Slot_C_RefreshParticipantAvatar final
{
public:
	class UTexture2D*                             CallFunc_GetParticipantAvatar_OutValue;            // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ScoreScreen_Graph_Participants_Slot_C_RefreshParticipantAvatar) == 0x000008, "Wrong alignment on WBP_ScoreScreen_Graph_Participants_Slot_C_RefreshParticipantAvatar");
static_assert(sizeof(WBP_ScoreScreen_Graph_Participants_Slot_C_RefreshParticipantAvatar) == 0x000010, "Wrong size on WBP_ScoreScreen_Graph_Participants_Slot_C_RefreshParticipantAvatar");
static_assert(offsetof(WBP_ScoreScreen_Graph_Participants_Slot_C_RefreshParticipantAvatar, CallFunc_GetParticipantAvatar_OutValue) == 0x000000, "Member 'WBP_ScoreScreen_Graph_Participants_Slot_C_RefreshParticipantAvatar::CallFunc_GetParticipantAvatar_OutValue' has a wrong offset!");
static_assert(offsetof(WBP_ScoreScreen_Graph_Participants_Slot_C_RefreshParticipantAvatar, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000008, "Member 'WBP_ScoreScreen_Graph_Participants_Slot_C_RefreshParticipantAvatar::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");

// Function WBP_ScoreScreen_Graph_Participants_Slot.WBP_ScoreScreen_Graph_Participants_Slot_C.RefreshParticipantName
// 0x0038 (0x0038 - 0x0000)
struct WBP_ScoreScreen_Graph_Participants_Slot_C_RefreshParticipantName final
{
public:
	struct FLinearColor                           CallFunc_GetPlayerColor_Output;                    // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0010(0x0014)()
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetParticipantName_OutValue;              // 0x0028(0x0010)()
};
static_assert(alignof(WBP_ScoreScreen_Graph_Participants_Slot_C_RefreshParticipantName) == 0x000008, "Wrong alignment on WBP_ScoreScreen_Graph_Participants_Slot_C_RefreshParticipantName");
static_assert(sizeof(WBP_ScoreScreen_Graph_Participants_Slot_C_RefreshParticipantName) == 0x000038, "Wrong size on WBP_ScoreScreen_Graph_Participants_Slot_C_RefreshParticipantName");
static_assert(offsetof(WBP_ScoreScreen_Graph_Participants_Slot_C_RefreshParticipantName, CallFunc_GetPlayerColor_Output) == 0x000000, "Member 'WBP_ScoreScreen_Graph_Participants_Slot_C_RefreshParticipantName::CallFunc_GetPlayerColor_Output' has a wrong offset!");
static_assert(offsetof(WBP_ScoreScreen_Graph_Participants_Slot_C_RefreshParticipantName, K2Node_MakeStruct_SlateColor) == 0x000010, "Member 'WBP_ScoreScreen_Graph_Participants_Slot_C_RefreshParticipantName::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(WBP_ScoreScreen_Graph_Participants_Slot_C_RefreshParticipantName, CallFunc_GetParticipantName_OutValue) == 0x000028, "Member 'WBP_ScoreScreen_Graph_Participants_Slot_C_RefreshParticipantName::CallFunc_GetParticipantName_OutValue' has a wrong offset!");

// Function WBP_ScoreScreen_Graph_Participants_Slot.WBP_ScoreScreen_Graph_Participants_Slot_C.GetMaterialsSupportingStates
// 0x0028 (0x0028 - 0x0000)
struct WBP_ScoreScreen_Graph_Participants_Slot_C_GetMaterialsSupportingStates final
{
public:
	TArray<class UMaterialInstanceDynamic*>       OutMIDs;                                           // 0x0000(0x0010)(Parm, OutParm)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UMaterialInstanceDynamic*>       K2Node_MakeArray_Array;                            // 0x0018(0x0010)(ReferenceParm)
};
static_assert(alignof(WBP_ScoreScreen_Graph_Participants_Slot_C_GetMaterialsSupportingStates) == 0x000008, "Wrong alignment on WBP_ScoreScreen_Graph_Participants_Slot_C_GetMaterialsSupportingStates");
static_assert(sizeof(WBP_ScoreScreen_Graph_Participants_Slot_C_GetMaterialsSupportingStates) == 0x000028, "Wrong size on WBP_ScoreScreen_Graph_Participants_Slot_C_GetMaterialsSupportingStates");
static_assert(offsetof(WBP_ScoreScreen_Graph_Participants_Slot_C_GetMaterialsSupportingStates, OutMIDs) == 0x000000, "Member 'WBP_ScoreScreen_Graph_Participants_Slot_C_GetMaterialsSupportingStates::OutMIDs' has a wrong offset!");
static_assert(offsetof(WBP_ScoreScreen_Graph_Participants_Slot_C_GetMaterialsSupportingStates, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000010, "Member 'WBP_ScoreScreen_Graph_Participants_Slot_C_GetMaterialsSupportingStates::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ScoreScreen_Graph_Participants_Slot_C_GetMaterialsSupportingStates, K2Node_MakeArray_Array) == 0x000018, "Member 'WBP_ScoreScreen_Graph_Participants_Slot_C_GetMaterialsSupportingStates::K2Node_MakeArray_Array' has a wrong offset!");

}

