#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Settings_Slot_ReadOnly

#include "Basic.hpp"

#include "InputCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_Settings_Slot_ReadOnly.WBP_Settings_Slot_ReadOnly_C.SetKeyBinds
// 0x00C0 (0x00C0 - 0x0000)
struct WBP_Settings_Slot_ReadOnly_C_SetKeyBinds final
{
public:
	TArray<struct FKey>                           Binds;                                             // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<class FString>                         Keys;                                              // 0x0010(0x0010)(Edit, BlueprintVisible)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   CallFunc_Array_Get_Item;                           // 0x0030(0x0018)(HasGetValueTypeHash)
	class FText                                   CallFunc_Key_GetDisplayName_ReturnValue;           // 0x0048(0x0010)()
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Replace_ReturnValue;                      // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Replace_ReturnValue_1;                    // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_JoinStringArray_ReturnValue;              // 0x00A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x00B0(0x0010)()
};
static_assert(alignof(WBP_Settings_Slot_ReadOnly_C_SetKeyBinds) == 0x000008, "Wrong alignment on WBP_Settings_Slot_ReadOnly_C_SetKeyBinds");
static_assert(sizeof(WBP_Settings_Slot_ReadOnly_C_SetKeyBinds) == 0x0000C0, "Wrong size on WBP_Settings_Slot_ReadOnly_C_SetKeyBinds");
static_assert(offsetof(WBP_Settings_Slot_ReadOnly_C_SetKeyBinds, Binds) == 0x000000, "Member 'WBP_Settings_Slot_ReadOnly_C_SetKeyBinds::Binds' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Slot_ReadOnly_C_SetKeyBinds, Keys) == 0x000010, "Member 'WBP_Settings_Slot_ReadOnly_C_SetKeyBinds::Keys' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Slot_ReadOnly_C_SetKeyBinds, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'WBP_Settings_Slot_ReadOnly_C_SetKeyBinds::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Slot_ReadOnly_C_SetKeyBinds, Temp_int_Array_Index_Variable) == 0x000024, "Member 'WBP_Settings_Slot_ReadOnly_C_SetKeyBinds::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Slot_ReadOnly_C_SetKeyBinds, Temp_int_Loop_Counter_Variable) == 0x000028, "Member 'WBP_Settings_Slot_ReadOnly_C_SetKeyBinds::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Slot_ReadOnly_C_SetKeyBinds, CallFunc_Array_Get_Item) == 0x000030, "Member 'WBP_Settings_Slot_ReadOnly_C_SetKeyBinds::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Slot_ReadOnly_C_SetKeyBinds, CallFunc_Key_GetDisplayName_ReturnValue) == 0x000048, "Member 'WBP_Settings_Slot_ReadOnly_C_SetKeyBinds::CallFunc_Key_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Slot_ReadOnly_C_SetKeyBinds, CallFunc_Less_IntInt_ReturnValue) == 0x000058, "Member 'WBP_Settings_Slot_ReadOnly_C_SetKeyBinds::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Slot_ReadOnly_C_SetKeyBinds, CallFunc_Conv_TextToString_ReturnValue) == 0x000060, "Member 'WBP_Settings_Slot_ReadOnly_C_SetKeyBinds::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Slot_ReadOnly_C_SetKeyBinds, CallFunc_Replace_ReturnValue) == 0x000070, "Member 'WBP_Settings_Slot_ReadOnly_C_SetKeyBinds::CallFunc_Replace_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Slot_ReadOnly_C_SetKeyBinds, CallFunc_Add_IntInt_ReturnValue) == 0x000080, "Member 'WBP_Settings_Slot_ReadOnly_C_SetKeyBinds::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Slot_ReadOnly_C_SetKeyBinds, CallFunc_Replace_ReturnValue_1) == 0x000088, "Member 'WBP_Settings_Slot_ReadOnly_C_SetKeyBinds::CallFunc_Replace_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Slot_ReadOnly_C_SetKeyBinds, CallFunc_Array_Add_ReturnValue) == 0x000098, "Member 'WBP_Settings_Slot_ReadOnly_C_SetKeyBinds::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Slot_ReadOnly_C_SetKeyBinds, CallFunc_JoinStringArray_ReturnValue) == 0x0000A0, "Member 'WBP_Settings_Slot_ReadOnly_C_SetKeyBinds::CallFunc_JoinStringArray_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Slot_ReadOnly_C_SetKeyBinds, CallFunc_Conv_StringToText_ReturnValue) == 0x0000B0, "Member 'WBP_Settings_Slot_ReadOnly_C_SetKeyBinds::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

}

