#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MainMenu_FactionSelection_Header

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_MainMenu_FactionSelection_Header.WBP_MainMenu_FactionSelection_Header_C
// 0x0030 (0x0318 - 0x02E8)
class UWBP_MainMenu_FactionSelection_Header_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_HeaderBackground;                            // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Text;                                    // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Text;                                              // 0x0300(0x0010)(Edit, BlueprintVisible)
	bool                                          bUpperCase;                                        // 0x0310(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void PreConstruct(bool IsDesignTime);
	void ExecuteUbergraph_WBP_MainMenu_FactionSelection_Header(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_MainMenu_FactionSelection_Header_C">();
	}
	static class UWBP_MainMenu_FactionSelection_Header_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_MainMenu_FactionSelection_Header_C>();
	}
};
static_assert(alignof(UWBP_MainMenu_FactionSelection_Header_C) == 0x000008, "Wrong alignment on UWBP_MainMenu_FactionSelection_Header_C");
static_assert(sizeof(UWBP_MainMenu_FactionSelection_Header_C) == 0x000318, "Wrong size on UWBP_MainMenu_FactionSelection_Header_C");
static_assert(offsetof(UWBP_MainMenu_FactionSelection_Header_C, UberGraphFrame) == 0x0002E8, "Member 'UWBP_MainMenu_FactionSelection_Header_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_MainMenu_FactionSelection_Header_C, Image_HeaderBackground) == 0x0002F0, "Member 'UWBP_MainMenu_FactionSelection_Header_C::Image_HeaderBackground' has a wrong offset!");
static_assert(offsetof(UWBP_MainMenu_FactionSelection_Header_C, TextBlock_Text) == 0x0002F8, "Member 'UWBP_MainMenu_FactionSelection_Header_C::TextBlock_Text' has a wrong offset!");
static_assert(offsetof(UWBP_MainMenu_FactionSelection_Header_C, Text) == 0x000300, "Member 'UWBP_MainMenu_FactionSelection_Header_C::Text' has a wrong offset!");
static_assert(offsetof(UWBP_MainMenu_FactionSelection_Header_C, bUpperCase) == 0x000310, "Member 'UWBP_MainMenu_FactionSelection_Header_C::bUpperCase' has a wrong offset!");

}

