#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_EndGame_Screen

#include "Basic.hpp"

#include "Tempest_structs.hpp"


namespace SDK::Params
{

// Function WBP_EndGame_Screen.WBP_EndGame_Screen_C.BndEvt__WBP_EndGame_Screen_Button_Continue_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_EndGame_Screen_C_BndEvt__WBP_EndGame_Screen_Button_Continue_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature final
{
public:
	class UTedUserWidget*                         InWidget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_EndGame_Screen_C_BndEvt__WBP_EndGame_Screen_Button_Continue_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_EndGame_Screen_C_BndEvt__WBP_EndGame_Screen_Button_Continue_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature");
static_assert(sizeof(WBP_EndGame_Screen_C_BndEvt__WBP_EndGame_Screen_Button_Continue_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_EndGame_Screen_C_BndEvt__WBP_EndGame_Screen_Button_Continue_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature");
static_assert(offsetof(WBP_EndGame_Screen_C_BndEvt__WBP_EndGame_Screen_Button_Continue_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature, InWidget) == 0x000000, "Member 'WBP_EndGame_Screen_C_BndEvt__WBP_EndGame_Screen_Button_Continue_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature::InWidget' has a wrong offset!");

// Function WBP_EndGame_Screen.WBP_EndGame_Screen_C.BndEvt__WBP_EndGame_Screen_Button_MainMenu_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_EndGame_Screen_C_BndEvt__WBP_EndGame_Screen_Button_MainMenu_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature final
{
public:
	class UTedUserWidget*                         InWidget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_EndGame_Screen_C_BndEvt__WBP_EndGame_Screen_Button_MainMenu_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_EndGame_Screen_C_BndEvt__WBP_EndGame_Screen_Button_MainMenu_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature");
static_assert(sizeof(WBP_EndGame_Screen_C_BndEvt__WBP_EndGame_Screen_Button_MainMenu_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_EndGame_Screen_C_BndEvt__WBP_EndGame_Screen_Button_MainMenu_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature");
static_assert(offsetof(WBP_EndGame_Screen_C_BndEvt__WBP_EndGame_Screen_Button_MainMenu_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature, InWidget) == 0x000000, "Member 'WBP_EndGame_Screen_C_BndEvt__WBP_EndGame_Screen_Button_MainMenu_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature::InWidget' has a wrong offset!");

// Function WBP_EndGame_Screen.WBP_EndGame_Screen_C.BndEvt__WBP_EndGame_Screen_Button_MainMenu_K2Node_ComponentBoundEvent_4_OnClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_EndGame_Screen_C_BndEvt__WBP_EndGame_Screen_Button_MainMenu_K2Node_ComponentBoundEvent_4_OnClicked__DelegateSignature final
{
public:
	class UTedUserWidget*                         InWidget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_EndGame_Screen_C_BndEvt__WBP_EndGame_Screen_Button_MainMenu_K2Node_ComponentBoundEvent_4_OnClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_EndGame_Screen_C_BndEvt__WBP_EndGame_Screen_Button_MainMenu_K2Node_ComponentBoundEvent_4_OnClicked__DelegateSignature");
static_assert(sizeof(WBP_EndGame_Screen_C_BndEvt__WBP_EndGame_Screen_Button_MainMenu_K2Node_ComponentBoundEvent_4_OnClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_EndGame_Screen_C_BndEvt__WBP_EndGame_Screen_Button_MainMenu_K2Node_ComponentBoundEvent_4_OnClicked__DelegateSignature");
static_assert(offsetof(WBP_EndGame_Screen_C_BndEvt__WBP_EndGame_Screen_Button_MainMenu_K2Node_ComponentBoundEvent_4_OnClicked__DelegateSignature, InWidget) == 0x000000, "Member 'WBP_EndGame_Screen_C_BndEvt__WBP_EndGame_Screen_Button_MainMenu_K2Node_ComponentBoundEvent_4_OnClicked__DelegateSignature::InWidget' has a wrong offset!");

// Function WBP_EndGame_Screen.WBP_EndGame_Screen_C.BndEvt__WBP_EndGame_Screen_Button_Retry_1_K2Node_ComponentBoundEvent_5_OnPressed__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_EndGame_Screen_C_BndEvt__WBP_EndGame_Screen_Button_Retry_1_K2Node_ComponentBoundEvent_5_OnPressed__DelegateSignature final
{
public:
	class UTedUserWidget*                         InWidget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_EndGame_Screen_C_BndEvt__WBP_EndGame_Screen_Button_Retry_1_K2Node_ComponentBoundEvent_5_OnPressed__DelegateSignature) == 0x000008, "Wrong alignment on WBP_EndGame_Screen_C_BndEvt__WBP_EndGame_Screen_Button_Retry_1_K2Node_ComponentBoundEvent_5_OnPressed__DelegateSignature");
static_assert(sizeof(WBP_EndGame_Screen_C_BndEvt__WBP_EndGame_Screen_Button_Retry_1_K2Node_ComponentBoundEvent_5_OnPressed__DelegateSignature) == 0x000008, "Wrong size on WBP_EndGame_Screen_C_BndEvt__WBP_EndGame_Screen_Button_Retry_1_K2Node_ComponentBoundEvent_5_OnPressed__DelegateSignature");
static_assert(offsetof(WBP_EndGame_Screen_C_BndEvt__WBP_EndGame_Screen_Button_Retry_1_K2Node_ComponentBoundEvent_5_OnPressed__DelegateSignature, InWidget) == 0x000000, "Member 'WBP_EndGame_Screen_C_BndEvt__WBP_EndGame_Screen_Button_Retry_1_K2Node_ComponentBoundEvent_5_OnPressed__DelegateSignature::InWidget' has a wrong offset!");

// Function WBP_EndGame_Screen.WBP_EndGame_Screen_C.BndEvt__WBP_EndGame_Screen_Button_Retry_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_EndGame_Screen_C_BndEvt__WBP_EndGame_Screen_Button_Retry_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature final
{
public:
	class UTedUserWidget*                         InWidget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_EndGame_Screen_C_BndEvt__WBP_EndGame_Screen_Button_Retry_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_EndGame_Screen_C_BndEvt__WBP_EndGame_Screen_Button_Retry_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature");
static_assert(sizeof(WBP_EndGame_Screen_C_BndEvt__WBP_EndGame_Screen_Button_Retry_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_EndGame_Screen_C_BndEvt__WBP_EndGame_Screen_Button_Retry_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature");
static_assert(offsetof(WBP_EndGame_Screen_C_BndEvt__WBP_EndGame_Screen_Button_Retry_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature, InWidget) == 0x000000, "Member 'WBP_EndGame_Screen_C_BndEvt__WBP_EndGame_Screen_Button_Retry_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature::InWidget' has a wrong offset!");

// Function WBP_EndGame_Screen.WBP_EndGame_Screen_C.BndEvt__WBP_EndGame_Screen_WBP_MoviePlayer_Fill_K2Node_ComponentBoundEvent_3_TedMoviePlayerWidgetEventDelegate__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_EndGame_Screen_C_BndEvt__WBP_EndGame_Screen_WBP_MoviePlayer_Fill_K2Node_ComponentBoundEvent_3_TedMoviePlayerWidgetEventDelegate__DelegateSignature final
{
public:
	class UTedMoviePlayerWidgetV2*                InWidget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	const class UFileMediaSource*                 InSource;                                          // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_EndGame_Screen_C_BndEvt__WBP_EndGame_Screen_WBP_MoviePlayer_Fill_K2Node_ComponentBoundEvent_3_TedMoviePlayerWidgetEventDelegate__DelegateSignature) == 0x000008, "Wrong alignment on WBP_EndGame_Screen_C_BndEvt__WBP_EndGame_Screen_WBP_MoviePlayer_Fill_K2Node_ComponentBoundEvent_3_TedMoviePlayerWidgetEventDelegate__DelegateSignature");
static_assert(sizeof(WBP_EndGame_Screen_C_BndEvt__WBP_EndGame_Screen_WBP_MoviePlayer_Fill_K2Node_ComponentBoundEvent_3_TedMoviePlayerWidgetEventDelegate__DelegateSignature) == 0x000010, "Wrong size on WBP_EndGame_Screen_C_BndEvt__WBP_EndGame_Screen_WBP_MoviePlayer_Fill_K2Node_ComponentBoundEvent_3_TedMoviePlayerWidgetEventDelegate__DelegateSignature");
static_assert(offsetof(WBP_EndGame_Screen_C_BndEvt__WBP_EndGame_Screen_WBP_MoviePlayer_Fill_K2Node_ComponentBoundEvent_3_TedMoviePlayerWidgetEventDelegate__DelegateSignature, InWidget) == 0x000000, "Member 'WBP_EndGame_Screen_C_BndEvt__WBP_EndGame_Screen_WBP_MoviePlayer_Fill_K2Node_ComponentBoundEvent_3_TedMoviePlayerWidgetEventDelegate__DelegateSignature::InWidget' has a wrong offset!");
static_assert(offsetof(WBP_EndGame_Screen_C_BndEvt__WBP_EndGame_Screen_WBP_MoviePlayer_Fill_K2Node_ComponentBoundEvent_3_TedMoviePlayerWidgetEventDelegate__DelegateSignature, InSource) == 0x000008, "Member 'WBP_EndGame_Screen_C_BndEvt__WBP_EndGame_Screen_WBP_MoviePlayer_Fill_K2Node_ComponentBoundEvent_3_TedMoviePlayerWidgetEventDelegate__DelegateSignature::InSource' has a wrong offset!");

// Function WBP_EndGame_Screen.WBP_EndGame_Screen_C.ExecuteUbergraph_WBP_EndGame_Screen
// 0x01B0 (0x01B0 - 0x0000)
struct WBP_EndGame_Screen_C_ExecuteUbergraph_WBP_EndGame_Screen final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTedUserWidget*                         K2Node_ComponentBoundEvent_InWidget_5;             // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UTedUserWidget*                         K2Node_ComponentBoundEvent_InWidget_4;             // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CloseMenuScreen_ReturnValue;              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTedMoviePlayerWidgetV2*                K2Node_ComponentBoundEvent_InWidget_3;             // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	const class UFileMediaSource*                 K2Node_ComponentBoundEvent_InSource;               // 0x0028(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTedUserWidget*                         K2Node_ComponentBoundEvent_InWidget_2;             // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ATedPlayerController*                   K2Node_DynamicCast_AsTed_Player_Controller;        // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTedScoreMenuScreenContextObject*       CallFunc_New_ReturnValue;                          // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_OpenMenuScreen_ReturnValue;               // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATedPlayerState*                        K2Node_DynamicCast_AsTed_Player_State;             // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTedUserWidget*                         K2Node_ComponentBoundEvent_InWidget_1;             // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDefeated_ReturnValue;                   // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSurrendered_ReturnValue;                // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7A[0x6];                                       // 0x007A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_BoolToString_ReturnValue;            // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_BoolToString_ReturnValue_1;          // 0x0098(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UTedMedalsScreenContextObject*          CallFunc_New_ReturnValue_1;                        // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_OpenMenuScreen_ReturnValue_1;             // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETedServerType                                CallFunc_GetCurrentServerType_ReturnValue;         // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMultiplayer_ReturnValue;                // 0x00B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00B3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B5[0x3];                                       // 0x00B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchEnded_ReturnValue;                // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTedUserWidget*                         K2Node_ComponentBoundEvent_InWidget;               // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMultiplayer_ReturnValue_1;              // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x00D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D3[0x5];                                       // 0x00D3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_BoolToString_ReturnValue_2;          // 0x00D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x00F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_BoolToString_ReturnValue_3;          // 0x0100(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0110(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0120(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue_1;               // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x0138(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchEnded_ReturnValue_1;              // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_149[0x7];                                      // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_BoolToString_ReturnValue_4;          // 0x0150(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_4;              // 0x0160(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_5;              // 0x0170(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_6;              // 0x0180(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_7;              // 0x0190(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_8;              // 0x01A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_EndGame_Screen_C_ExecuteUbergraph_WBP_EndGame_Screen) == 0x000008, "Wrong alignment on WBP_EndGame_Screen_C_ExecuteUbergraph_WBP_EndGame_Screen");
static_assert(sizeof(WBP_EndGame_Screen_C_ExecuteUbergraph_WBP_EndGame_Screen) == 0x0001B0, "Wrong size on WBP_EndGame_Screen_C_ExecuteUbergraph_WBP_EndGame_Screen");
static_assert(offsetof(WBP_EndGame_Screen_C_ExecuteUbergraph_WBP_EndGame_Screen, EntryPoint) == 0x000000, "Member 'WBP_EndGame_Screen_C_ExecuteUbergraph_WBP_EndGame_Screen::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_EndGame_Screen_C_ExecuteUbergraph_WBP_EndGame_Screen, K2Node_ComponentBoundEvent_InWidget_5) == 0x000008, "Member 'WBP_EndGame_Screen_C_ExecuteUbergraph_WBP_EndGame_Screen::K2Node_ComponentBoundEvent_InWidget_5' has a wrong offset!");
static_assert(offsetof(WBP_EndGame_Screen_C_ExecuteUbergraph_WBP_EndGame_Screen, K2Node_ComponentBoundEvent_InWidget_4) == 0x000010, "Member 'WBP_EndGame_Screen_C_ExecuteUbergraph_WBP_EndGame_Screen::K2Node_ComponentBoundEvent_InWidget_4' has a wrong offset!");
static_assert(offsetof(WBP_EndGame_Screen_C_ExecuteUbergraph_WBP_EndGame_Screen, CallFunc_CloseMenuScreen_ReturnValue) == 0x000018, "Member 'WBP_EndGame_Screen_C_ExecuteUbergraph_WBP_EndGame_Screen::CallFunc_CloseMenuScreen_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EndGame_Screen_C_ExecuteUbergraph_WBP_EndGame_Screen, K2Node_ComponentBoundEvent_InWidget_3) == 0x000020, "Member 'WBP_EndGame_Screen_C_ExecuteUbergraph_WBP_EndGame_Screen::K2Node_ComponentBoundEvent_InWidget_3' has a wrong offset!");
static_assert(offsetof(WBP_EndGame_Screen_C_ExecuteUbergraph_WBP_EndGame_Screen, K2Node_ComponentBoundEvent_InSource) == 0x000028, "Member 'WBP_EndGame_Screen_C_ExecuteUbergraph_WBP_EndGame_Screen::K2Node_ComponentBoundEvent_InSource' has a wrong offset!");
static_assert(offsetof(WBP_EndGame_Screen_C_ExecuteUbergraph_WBP_EndGame_Screen, K2Node_ComponentBoundEvent_InWidget_2) == 0x000030, "Member 'WBP_EndGame_Screen_C_ExecuteUbergraph_WBP_EndGame_Screen::K2Node_ComponentBoundEvent_InWidget_2' has a wrong offset!");
static_assert(offsetof(WBP_EndGame_Screen_C_ExecuteUbergraph_WBP_EndGame_Screen, CallFunc_GetOwningPlayer_ReturnValue) == 0x000038, "Member 'WBP_EndGame_Screen_C_ExecuteUbergraph_WBP_EndGame_Screen::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EndGame_Screen_C_ExecuteUbergraph_WBP_EndGame_Screen, K2Node_DynamicCast_AsTed_Player_Controller) == 0x000040, "Member 'WBP_EndGame_Screen_C_ExecuteUbergraph_WBP_EndGame_Screen::K2Node_DynamicCast_AsTed_Player_Controller' has a wrong offset!");
static_assert(offsetof(WBP_EndGame_Screen_C_ExecuteUbergraph_WBP_EndGame_Screen, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'WBP_EndGame_Screen_C_ExecuteUbergraph_WBP_EndGame_Screen::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_EndGame_Screen_C_ExecuteUbergraph_WBP_EndGame_Screen, CallFunc_New_ReturnValue) == 0x000050, "Member 'WBP_EndGame_Screen_C_ExecuteUbergraph_WBP_EndGame_Screen::CallFunc_New_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EndGame_Screen_C_ExecuteUbergraph_WBP_EndGame_Screen, CallFunc_OpenMenuScreen_ReturnValue) == 0x000058, "Member 'WBP_EndGame_Screen_C_ExecuteUbergraph_WBP_EndGame_Screen::CallFunc_OpenMenuScreen_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EndGame_Screen_C_ExecuteUbergraph_WBP_EndGame_Screen, K2Node_DynamicCast_AsTed_Player_State) == 0x000060, "Member 'WBP_EndGame_Screen_C_ExecuteUbergraph_WBP_EndGame_Screen::K2Node_DynamicCast_AsTed_Player_State' has a wrong offset!");
static_assert(offsetof(WBP_EndGame_Screen_C_ExecuteUbergraph_WBP_EndGame_Screen, K2Node_DynamicCast_bSuccess_1) == 0x000068, "Member 'WBP_EndGame_Screen_C_ExecuteUbergraph_WBP_EndGame_Screen::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_EndGame_Screen_C_ExecuteUbergraph_WBP_EndGame_Screen, K2Node_ComponentBoundEvent_InWidget_1) == 0x000070, "Member 'WBP_EndGame_Screen_C_ExecuteUbergraph_WBP_EndGame_Screen::K2Node_ComponentBoundEvent_InWidget_1' has a wrong offset!");
static_assert(offsetof(WBP_EndGame_Screen_C_ExecuteUbergraph_WBP_EndGame_Screen, CallFunc_IsDefeated_ReturnValue) == 0x000078, "Member 'WBP_EndGame_Screen_C_ExecuteUbergraph_WBP_EndGame_Screen::CallFunc_IsDefeated_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EndGame_Screen_C_ExecuteUbergraph_WBP_EndGame_Screen, CallFunc_IsSurrendered_ReturnValue) == 0x000079, "Member 'WBP_EndGame_Screen_C_ExecuteUbergraph_WBP_EndGame_Screen::CallFunc_IsSurrendered_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EndGame_Screen_C_ExecuteUbergraph_WBP_EndGame_Screen, CallFunc_Conv_BoolToString_ReturnValue) == 0x000080, "Member 'WBP_EndGame_Screen_C_ExecuteUbergraph_WBP_EndGame_Screen::CallFunc_Conv_BoolToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EndGame_Screen_C_ExecuteUbergraph_WBP_EndGame_Screen, CallFunc_BooleanOR_ReturnValue) == 0x000090, "Member 'WBP_EndGame_Screen_C_ExecuteUbergraph_WBP_EndGame_Screen::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EndGame_Screen_C_ExecuteUbergraph_WBP_EndGame_Screen, CallFunc_Conv_BoolToString_ReturnValue_1) == 0x000098, "Member 'WBP_EndGame_Screen_C_ExecuteUbergraph_WBP_EndGame_Screen::CallFunc_Conv_BoolToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_EndGame_Screen_C_ExecuteUbergraph_WBP_EndGame_Screen, CallFunc_New_ReturnValue_1) == 0x0000A8, "Member 'WBP_EndGame_Screen_C_ExecuteUbergraph_WBP_EndGame_Screen::CallFunc_New_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_EndGame_Screen_C_ExecuteUbergraph_WBP_EndGame_Screen, CallFunc_OpenMenuScreen_ReturnValue_1) == 0x0000B0, "Member 'WBP_EndGame_Screen_C_ExecuteUbergraph_WBP_EndGame_Screen::CallFunc_OpenMenuScreen_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_EndGame_Screen_C_ExecuteUbergraph_WBP_EndGame_Screen, CallFunc_GetCurrentServerType_ReturnValue) == 0x0000B1, "Member 'WBP_EndGame_Screen_C_ExecuteUbergraph_WBP_EndGame_Screen::CallFunc_GetCurrentServerType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EndGame_Screen_C_ExecuteUbergraph_WBP_EndGame_Screen, CallFunc_IsMultiplayer_ReturnValue) == 0x0000B2, "Member 'WBP_EndGame_Screen_C_ExecuteUbergraph_WBP_EndGame_Screen::CallFunc_IsMultiplayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EndGame_Screen_C_ExecuteUbergraph_WBP_EndGame_Screen, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000B3, "Member 'WBP_EndGame_Screen_C_ExecuteUbergraph_WBP_EndGame_Screen::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EndGame_Screen_C_ExecuteUbergraph_WBP_EndGame_Screen, CallFunc_BooleanAND_ReturnValue) == 0x0000B4, "Member 'WBP_EndGame_Screen_C_ExecuteUbergraph_WBP_EndGame_Screen::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EndGame_Screen_C_ExecuteUbergraph_WBP_EndGame_Screen, CallFunc_GetGameState_ReturnValue) == 0x0000B8, "Member 'WBP_EndGame_Screen_C_ExecuteUbergraph_WBP_EndGame_Screen::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EndGame_Screen_C_ExecuteUbergraph_WBP_EndGame_Screen, CallFunc_HasMatchEnded_ReturnValue) == 0x0000C0, "Member 'WBP_EndGame_Screen_C_ExecuteUbergraph_WBP_EndGame_Screen::CallFunc_HasMatchEnded_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EndGame_Screen_C_ExecuteUbergraph_WBP_EndGame_Screen, K2Node_ComponentBoundEvent_InWidget) == 0x0000C8, "Member 'WBP_EndGame_Screen_C_ExecuteUbergraph_WBP_EndGame_Screen::K2Node_ComponentBoundEvent_InWidget' has a wrong offset!");
static_assert(offsetof(WBP_EndGame_Screen_C_ExecuteUbergraph_WBP_EndGame_Screen, CallFunc_Not_PreBool_ReturnValue) == 0x0000D0, "Member 'WBP_EndGame_Screen_C_ExecuteUbergraph_WBP_EndGame_Screen::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EndGame_Screen_C_ExecuteUbergraph_WBP_EndGame_Screen, CallFunc_IsMultiplayer_ReturnValue_1) == 0x0000D1, "Member 'WBP_EndGame_Screen_C_ExecuteUbergraph_WBP_EndGame_Screen::CallFunc_IsMultiplayer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_EndGame_Screen_C_ExecuteUbergraph_WBP_EndGame_Screen, CallFunc_BooleanAND_ReturnValue_1) == 0x0000D2, "Member 'WBP_EndGame_Screen_C_ExecuteUbergraph_WBP_EndGame_Screen::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_EndGame_Screen_C_ExecuteUbergraph_WBP_EndGame_Screen, CallFunc_Conv_BoolToString_ReturnValue_2) == 0x0000D8, "Member 'WBP_EndGame_Screen_C_ExecuteUbergraph_WBP_EndGame_Screen::CallFunc_Conv_BoolToString_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_EndGame_Screen_C_ExecuteUbergraph_WBP_EndGame_Screen, CallFunc_Not_PreBool_ReturnValue_1) == 0x0000E8, "Member 'WBP_EndGame_Screen_C_ExecuteUbergraph_WBP_EndGame_Screen::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_EndGame_Screen_C_ExecuteUbergraph_WBP_EndGame_Screen, CallFunc_Concat_StrStr_ReturnValue) == 0x0000F0, "Member 'WBP_EndGame_Screen_C_ExecuteUbergraph_WBP_EndGame_Screen::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EndGame_Screen_C_ExecuteUbergraph_WBP_EndGame_Screen, CallFunc_Conv_BoolToString_ReturnValue_3) == 0x000100, "Member 'WBP_EndGame_Screen_C_ExecuteUbergraph_WBP_EndGame_Screen::CallFunc_Conv_BoolToString_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_EndGame_Screen_C_ExecuteUbergraph_WBP_EndGame_Screen, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000110, "Member 'WBP_EndGame_Screen_C_ExecuteUbergraph_WBP_EndGame_Screen::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_EndGame_Screen_C_ExecuteUbergraph_WBP_EndGame_Screen, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000120, "Member 'WBP_EndGame_Screen_C_ExecuteUbergraph_WBP_EndGame_Screen::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_EndGame_Screen_C_ExecuteUbergraph_WBP_EndGame_Screen, CallFunc_GetGameState_ReturnValue_1) == 0x000130, "Member 'WBP_EndGame_Screen_C_ExecuteUbergraph_WBP_EndGame_Screen::CallFunc_GetGameState_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_EndGame_Screen_C_ExecuteUbergraph_WBP_EndGame_Screen, CallFunc_Concat_StrStr_ReturnValue_3) == 0x000138, "Member 'WBP_EndGame_Screen_C_ExecuteUbergraph_WBP_EndGame_Screen::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_EndGame_Screen_C_ExecuteUbergraph_WBP_EndGame_Screen, CallFunc_HasMatchEnded_ReturnValue_1) == 0x000148, "Member 'WBP_EndGame_Screen_C_ExecuteUbergraph_WBP_EndGame_Screen::CallFunc_HasMatchEnded_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_EndGame_Screen_C_ExecuteUbergraph_WBP_EndGame_Screen, CallFunc_Conv_BoolToString_ReturnValue_4) == 0x000150, "Member 'WBP_EndGame_Screen_C_ExecuteUbergraph_WBP_EndGame_Screen::CallFunc_Conv_BoolToString_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_EndGame_Screen_C_ExecuteUbergraph_WBP_EndGame_Screen, CallFunc_Concat_StrStr_ReturnValue_4) == 0x000160, "Member 'WBP_EndGame_Screen_C_ExecuteUbergraph_WBP_EndGame_Screen::CallFunc_Concat_StrStr_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_EndGame_Screen_C_ExecuteUbergraph_WBP_EndGame_Screen, CallFunc_Concat_StrStr_ReturnValue_5) == 0x000170, "Member 'WBP_EndGame_Screen_C_ExecuteUbergraph_WBP_EndGame_Screen::CallFunc_Concat_StrStr_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_EndGame_Screen_C_ExecuteUbergraph_WBP_EndGame_Screen, CallFunc_Concat_StrStr_ReturnValue_6) == 0x000180, "Member 'WBP_EndGame_Screen_C_ExecuteUbergraph_WBP_EndGame_Screen::CallFunc_Concat_StrStr_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WBP_EndGame_Screen_C_ExecuteUbergraph_WBP_EndGame_Screen, CallFunc_Concat_StrStr_ReturnValue_7) == 0x000190, "Member 'WBP_EndGame_Screen_C_ExecuteUbergraph_WBP_EndGame_Screen::CallFunc_Concat_StrStr_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WBP_EndGame_Screen_C_ExecuteUbergraph_WBP_EndGame_Screen, CallFunc_Concat_StrStr_ReturnValue_8) == 0x0001A0, "Member 'WBP_EndGame_Screen_C_ExecuteUbergraph_WBP_EndGame_Screen::CallFunc_Concat_StrStr_ReturnValue_8' has a wrong offset!");

// Function WBP_EndGame_Screen.WBP_EndGame_Screen_C.GetWidgetBackPriorities
// 0x00A0 (0x00A0 - 0x0000)
struct WBP_EndGame_Screen_C_GetWidgetBackPriorities final
{
public:
	TMap<class UWidget*, uint8>                   ReturnValue;                                       // 0x0000(0x0050)(Parm, OutParm, ReturnParm, ContainsInstancedReference)
	TMap<class UWidget*, uint8>                   K2Node_MakeMap_Map;                                // 0x0050(0x0050)(ContainsInstancedReference)
};
static_assert(alignof(WBP_EndGame_Screen_C_GetWidgetBackPriorities) == 0x000008, "Wrong alignment on WBP_EndGame_Screen_C_GetWidgetBackPriorities");
static_assert(sizeof(WBP_EndGame_Screen_C_GetWidgetBackPriorities) == 0x0000A0, "Wrong size on WBP_EndGame_Screen_C_GetWidgetBackPriorities");
static_assert(offsetof(WBP_EndGame_Screen_C_GetWidgetBackPriorities, ReturnValue) == 0x000000, "Member 'WBP_EndGame_Screen_C_GetWidgetBackPriorities::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EndGame_Screen_C_GetWidgetBackPriorities, K2Node_MakeMap_Map) == 0x000050, "Member 'WBP_EndGame_Screen_C_GetWidgetBackPriorities::K2Node_MakeMap_Map' has a wrong offset!");

// Function WBP_EndGame_Screen.WBP_EndGame_Screen_C.HideExtraWidgets
// 0x0048 (0x0048 - 0x0000)
struct WBP_EndGame_Screen_C_HideExtraWidgets final
{
public:
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATedHUD*                                CallFunc_K2_GetLocalHUD_ReturnValue;               // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UTedUserWidget*>                 CallFunc_GetStandaloneWidgets_ReturnValue;         // 0x0018(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTedUserWidget*                         CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ClassIsChildOf_ReturnValue;               // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0046(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_EndGame_Screen_C_HideExtraWidgets) == 0x000008, "Wrong alignment on WBP_EndGame_Screen_C_HideExtraWidgets");
static_assert(sizeof(WBP_EndGame_Screen_C_HideExtraWidgets) == 0x000048, "Wrong size on WBP_EndGame_Screen_C_HideExtraWidgets");
static_assert(offsetof(WBP_EndGame_Screen_C_HideExtraWidgets, Temp_bool_True_if_break_was_hit_Variable) == 0x000000, "Member 'WBP_EndGame_Screen_C_HideExtraWidgets::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(WBP_EndGame_Screen_C_HideExtraWidgets, Temp_int_Array_Index_Variable) == 0x000004, "Member 'WBP_EndGame_Screen_C_HideExtraWidgets::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_EndGame_Screen_C_HideExtraWidgets, CallFunc_Not_PreBool_ReturnValue) == 0x000008, "Member 'WBP_EndGame_Screen_C_HideExtraWidgets::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EndGame_Screen_C_HideExtraWidgets, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'WBP_EndGame_Screen_C_HideExtraWidgets::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_EndGame_Screen_C_HideExtraWidgets, CallFunc_K2_GetLocalHUD_ReturnValue) == 0x000010, "Member 'WBP_EndGame_Screen_C_HideExtraWidgets::CallFunc_K2_GetLocalHUD_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EndGame_Screen_C_HideExtraWidgets, CallFunc_GetStandaloneWidgets_ReturnValue) == 0x000018, "Member 'WBP_EndGame_Screen_C_HideExtraWidgets::CallFunc_GetStandaloneWidgets_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EndGame_Screen_C_HideExtraWidgets, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'WBP_EndGame_Screen_C_HideExtraWidgets::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EndGame_Screen_C_HideExtraWidgets, CallFunc_Array_Get_Item) == 0x000030, "Member 'WBP_EndGame_Screen_C_HideExtraWidgets::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_EndGame_Screen_C_HideExtraWidgets, CallFunc_GetObjectClass_ReturnValue) == 0x000038, "Member 'WBP_EndGame_Screen_C_HideExtraWidgets::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EndGame_Screen_C_HideExtraWidgets, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'WBP_EndGame_Screen_C_HideExtraWidgets::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EndGame_Screen_C_HideExtraWidgets, CallFunc_ClassIsChildOf_ReturnValue) == 0x000044, "Member 'WBP_EndGame_Screen_C_HideExtraWidgets::CallFunc_ClassIsChildOf_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EndGame_Screen_C_HideExtraWidgets, CallFunc_Less_IntInt_ReturnValue) == 0x000045, "Member 'WBP_EndGame_Screen_C_HideExtraWidgets::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EndGame_Screen_C_HideExtraWidgets, CallFunc_BooleanAND_ReturnValue) == 0x000046, "Member 'WBP_EndGame_Screen_C_HideExtraWidgets::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function WBP_EndGame_Screen.WBP_EndGame_Screen_C.OnOpen
// 0x0028 (0x0028 - 0x0000)
struct WBP_EndGame_Screen_C_OnOpen final
{
public:
	const class UObject*                          InContext;                                         // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          bInInstant;                                        // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bLocalVictory;                                     // 0x0009(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UTedJukeboxSubsystem*                   CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTedScoreMenuScreenContextObject*       K2Node_DynamicCast_AsTed_Score_Menu_Screen_Context_Object; // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_EndGame_Screen_C_OnOpen) == 0x000008, "Wrong alignment on WBP_EndGame_Screen_C_OnOpen");
static_assert(sizeof(WBP_EndGame_Screen_C_OnOpen) == 0x000028, "Wrong size on WBP_EndGame_Screen_C_OnOpen");
static_assert(offsetof(WBP_EndGame_Screen_C_OnOpen, InContext) == 0x000000, "Member 'WBP_EndGame_Screen_C_OnOpen::InContext' has a wrong offset!");
static_assert(offsetof(WBP_EndGame_Screen_C_OnOpen, bInInstant) == 0x000008, "Member 'WBP_EndGame_Screen_C_OnOpen::bInInstant' has a wrong offset!");
static_assert(offsetof(WBP_EndGame_Screen_C_OnOpen, bLocalVictory) == 0x000009, "Member 'WBP_EndGame_Screen_C_OnOpen::bLocalVictory' has a wrong offset!");
static_assert(offsetof(WBP_EndGame_Screen_C_OnOpen, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000010, "Member 'WBP_EndGame_Screen_C_OnOpen::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EndGame_Screen_C_OnOpen, K2Node_DynamicCast_AsTed_Score_Menu_Screen_Context_Object) == 0x000018, "Member 'WBP_EndGame_Screen_C_OnOpen::K2Node_DynamicCast_AsTed_Score_Menu_Screen_Context_Object' has a wrong offset!");
static_assert(offsetof(WBP_EndGame_Screen_C_OnOpen, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'WBP_EndGame_Screen_C_OnOpen::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WBP_EndGame_Screen.WBP_EndGame_Screen_C.PlaySequence
// 0x0068 (0x0068 - 0x0000)
struct WBP_EndGame_Screen_C_PlaySequence final
{
public:
	class UFileMediaSource*                       MovieToPlay;                                       // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class UFileMediaSource*                 Temp_object_Variable;                              // 0x0010(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class UFileMediaSource*                 Temp_object_Variable_1;                            // 0x0018(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class UFileMediaSource*                 Temp_object_Variable_2;                            // 0x0028(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class UFileMediaSource*                 Temp_object_Variable_3;                            // 0x0030(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ETedFaction                                   CallFunc_BranchUITheme_ReturnValue;                // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_Start_ReturnValue;                     // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_Start_ReturnValue_1;                   // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B[0x5];                                       // 0x004B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	const class UFileMediaSource*                 K2Node_Select_Default;                             // 0x0050(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class UFileMediaSource*                 K2Node_Select_Default_1;                           // 0x0058(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_EndGame_Screen_C_PlaySequence) == 0x000008, "Wrong alignment on WBP_EndGame_Screen_C_PlaySequence");
static_assert(sizeof(WBP_EndGame_Screen_C_PlaySequence) == 0x000068, "Wrong size on WBP_EndGame_Screen_C_PlaySequence");
static_assert(offsetof(WBP_EndGame_Screen_C_PlaySequence, MovieToPlay) == 0x000000, "Member 'WBP_EndGame_Screen_C_PlaySequence::MovieToPlay' has a wrong offset!");
static_assert(offsetof(WBP_EndGame_Screen_C_PlaySequence, Temp_bool_Variable) == 0x000008, "Member 'WBP_EndGame_Screen_C_PlaySequence::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_EndGame_Screen_C_PlaySequence, Temp_object_Variable) == 0x000010, "Member 'WBP_EndGame_Screen_C_PlaySequence::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_EndGame_Screen_C_PlaySequence, Temp_object_Variable_1) == 0x000018, "Member 'WBP_EndGame_Screen_C_PlaySequence::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_EndGame_Screen_C_PlaySequence, Temp_bool_Variable_1) == 0x000020, "Member 'WBP_EndGame_Screen_C_PlaySequence::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_EndGame_Screen_C_PlaySequence, Temp_object_Variable_2) == 0x000028, "Member 'WBP_EndGame_Screen_C_PlaySequence::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_EndGame_Screen_C_PlaySequence, Temp_object_Variable_3) == 0x000030, "Member 'WBP_EndGame_Screen_C_PlaySequence::Temp_object_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_EndGame_Screen_C_PlaySequence, CallFunc_BranchUITheme_ReturnValue) == 0x000038, "Member 'WBP_EndGame_Screen_C_PlaySequence::CallFunc_BranchUITheme_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EndGame_Screen_C_PlaySequence, CallFunc_PlayAnimationForward_ReturnValue) == 0x000040, "Member 'WBP_EndGame_Screen_C_PlaySequence::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EndGame_Screen_C_PlaySequence, K2Node_SwitchEnum_CmpSuccess) == 0x000048, "Member 'WBP_EndGame_Screen_C_PlaySequence::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_EndGame_Screen_C_PlaySequence, CallFunc_K2_Start_ReturnValue) == 0x000049, "Member 'WBP_EndGame_Screen_C_PlaySequence::CallFunc_K2_Start_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EndGame_Screen_C_PlaySequence, CallFunc_K2_Start_ReturnValue_1) == 0x00004A, "Member 'WBP_EndGame_Screen_C_PlaySequence::CallFunc_K2_Start_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_EndGame_Screen_C_PlaySequence, K2Node_Select_Default) == 0x000050, "Member 'WBP_EndGame_Screen_C_PlaySequence::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_EndGame_Screen_C_PlaySequence, K2Node_Select_Default_1) == 0x000058, "Member 'WBP_EndGame_Screen_C_PlaySequence::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_EndGame_Screen_C_PlaySequence, CallFunc_PlayAnimationForward_ReturnValue_1) == 0x000060, "Member 'WBP_EndGame_Screen_C_PlaySequence::CallFunc_PlayAnimationForward_ReturnValue_1' has a wrong offset!");

// Function WBP_EndGame_Screen.WBP_EndGame_Screen_C.UpdateBackground
// 0x0020 (0x0020 - 0x0000)
struct WBP_EndGame_Screen_C_UpdateBackground final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_1;                            // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     K2Node_Select_Default;                             // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_EndGame_Screen_C_UpdateBackground) == 0x000008, "Wrong alignment on WBP_EndGame_Screen_C_UpdateBackground");
static_assert(sizeof(WBP_EndGame_Screen_C_UpdateBackground) == 0x000020, "Wrong size on WBP_EndGame_Screen_C_UpdateBackground");
static_assert(offsetof(WBP_EndGame_Screen_C_UpdateBackground, Temp_bool_Variable) == 0x000000, "Member 'WBP_EndGame_Screen_C_UpdateBackground::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_EndGame_Screen_C_UpdateBackground, Temp_object_Variable) == 0x000008, "Member 'WBP_EndGame_Screen_C_UpdateBackground::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_EndGame_Screen_C_UpdateBackground, Temp_object_Variable_1) == 0x000010, "Member 'WBP_EndGame_Screen_C_UpdateBackground::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_EndGame_Screen_C_UpdateBackground, K2Node_Select_Default) == 0x000018, "Member 'WBP_EndGame_Screen_C_UpdateBackground::K2Node_Select_Default' has a wrong offset!");

// Function WBP_EndGame_Screen.WBP_EndGame_Screen_C.UpdateButtons
// 0x0002 (0x0002 - 0x0000)
struct WBP_EndGame_Screen_C_UpdateButtons final
{
public:
	bool                                          CallFunc_IsMultiplayer_ReturnValue;                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSkirmish_ReturnValue;                   // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_EndGame_Screen_C_UpdateButtons) == 0x000001, "Wrong alignment on WBP_EndGame_Screen_C_UpdateButtons");
static_assert(sizeof(WBP_EndGame_Screen_C_UpdateButtons) == 0x000002, "Wrong size on WBP_EndGame_Screen_C_UpdateButtons");
static_assert(offsetof(WBP_EndGame_Screen_C_UpdateButtons, CallFunc_IsMultiplayer_ReturnValue) == 0x000000, "Member 'WBP_EndGame_Screen_C_UpdateButtons::CallFunc_IsMultiplayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EndGame_Screen_C_UpdateButtons, CallFunc_IsSkirmish_ReturnValue) == 0x000001, "Member 'WBP_EndGame_Screen_C_UpdateButtons::CallFunc_IsSkirmish_ReturnValue' has a wrong offset!");

// Function WBP_EndGame_Screen.WBP_EndGame_Screen_C.Validate Load Button State
// 0x0001 (0x0001 - 0x0000)
struct WBP_EndGame_Screen_C_Validate_Load_Button_State final
{
public:
	bool                                          CallFunc_HasAvailibleSaves_HasSaves;               // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_EndGame_Screen_C_Validate_Load_Button_State) == 0x000001, "Wrong alignment on WBP_EndGame_Screen_C_Validate_Load_Button_State");
static_assert(sizeof(WBP_EndGame_Screen_C_Validate_Load_Button_State) == 0x000001, "Wrong size on WBP_EndGame_Screen_C_Validate_Load_Button_State");
static_assert(offsetof(WBP_EndGame_Screen_C_Validate_Load_Button_State, CallFunc_HasAvailibleSaves_HasSaves) == 0x000000, "Member 'WBP_EndGame_Screen_C_Validate_Load_Button_State::CallFunc_HasAvailibleSaves_HasSaves' has a wrong offset!");

}

