#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SaveGame

#include "Basic.hpp"

#include "Tempest_structs.hpp"
#include "SavedGame_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_SaveGame.WBP_SaveGame_C.WillHandleGoBackEvent
// 0x0006 (0x0006 - 0x0000)
struct WBP_SaveGame_C_WillHandleGoBackEvent final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue_1;                  // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue_2;                  // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SaveGame_C_WillHandleGoBackEvent) == 0x000001, "Wrong alignment on WBP_SaveGame_C_WillHandleGoBackEvent");
static_assert(sizeof(WBP_SaveGame_C_WillHandleGoBackEvent) == 0x000006, "Wrong size on WBP_SaveGame_C_WillHandleGoBackEvent");
static_assert(offsetof(WBP_SaveGame_C_WillHandleGoBackEvent, ReturnValue) == 0x000000, "Member 'WBP_SaveGame_C_WillHandleGoBackEvent::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SaveGame_C_WillHandleGoBackEvent, CallFunc_IsVisible_ReturnValue) == 0x000001, "Member 'WBP_SaveGame_C_WillHandleGoBackEvent::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SaveGame_C_WillHandleGoBackEvent, CallFunc_IsVisible_ReturnValue_1) == 0x000002, "Member 'WBP_SaveGame_C_WillHandleGoBackEvent::CallFunc_IsVisible_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_SaveGame_C_WillHandleGoBackEvent, CallFunc_IsVisible_ReturnValue_2) == 0x000003, "Member 'WBP_SaveGame_C_WillHandleGoBackEvent::CallFunc_IsVisible_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_SaveGame_C_WillHandleGoBackEvent, CallFunc_BooleanOR_ReturnValue) == 0x000004, "Member 'WBP_SaveGame_C_WillHandleGoBackEvent::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SaveGame_C_WillHandleGoBackEvent, CallFunc_BooleanOR_ReturnValue_1) == 0x000005, "Member 'WBP_SaveGame_C_WillHandleGoBackEvent::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");

// Function WBP_SaveGame.WBP_SaveGame_C.GoBack
// 0x0002 (0x0002 - 0x0000)
struct WBP_SaveGame_C_GoBack final
{
public:
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue_1;                  // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SaveGame_C_GoBack) == 0x000001, "Wrong alignment on WBP_SaveGame_C_GoBack");
static_assert(sizeof(WBP_SaveGame_C_GoBack) == 0x000002, "Wrong size on WBP_SaveGame_C_GoBack");
static_assert(offsetof(WBP_SaveGame_C_GoBack, CallFunc_IsVisible_ReturnValue) == 0x000000, "Member 'WBP_SaveGame_C_GoBack::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SaveGame_C_GoBack, CallFunc_IsVisible_ReturnValue_1) == 0x000001, "Member 'WBP_SaveGame_C_GoBack::CallFunc_IsVisible_ReturnValue_1' has a wrong offset!");

// Function WBP_SaveGame.WBP_SaveGame_C.GetSavePanel
// 0x0018 (0x0018 - 0x0000)
struct WBP_SaveGame_C_GetSavePanel final
{
public:
	class UWBP_SaveSlots_List_C*                  Out;                                               // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_SaveSlots_List_C*                  K2Node_DynamicCast_AsWBP_Save_Slots_List;          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SaveGame_C_GetSavePanel) == 0x000008, "Wrong alignment on WBP_SaveGame_C_GetSavePanel");
static_assert(sizeof(WBP_SaveGame_C_GetSavePanel) == 0x000018, "Wrong size on WBP_SaveGame_C_GetSavePanel");
static_assert(offsetof(WBP_SaveGame_C_GetSavePanel, Out) == 0x000000, "Member 'WBP_SaveGame_C_GetSavePanel::Out' has a wrong offset!");
static_assert(offsetof(WBP_SaveGame_C_GetSavePanel, K2Node_DynamicCast_AsWBP_Save_Slots_List) == 0x000008, "Member 'WBP_SaveGame_C_GetSavePanel::K2Node_DynamicCast_AsWBP_Save_Slots_List' has a wrong offset!");
static_assert(offsetof(WBP_SaveGame_C_GetSavePanel, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'WBP_SaveGame_C_GetSavePanel::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WBP_SaveGame.WBP_SaveGame_C.ExecuteUbergraph_WBP_SaveGame
// 0x0328 (0x0328 - 0x0000)
struct WBP_SaveGame_C_ExecuteUbergraph_WBP_SaveGame final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_SaveSlots_List_C*                  CallFunc_GetSavePanel_Out;                         // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x0010(0x0010)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0034(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESavedGameActionResult                        CallFunc_SaveSlot_Result;                          // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x003E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F[0x1];                                       // 0x003F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UTedUserWidget*                         K2Node_ComponentBoundEvent_InWidget;               // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UTedContentPanelBase*                   K2Node_ComponentBoundEvent_InContentPanel_1;       // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UTedContentPanelSlotBase*               K2Node_ComponentBoundEvent_InContentSlot_1;        // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ETedContentSlotState                          K2Node_ComponentBoundEvent_InState;                // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bInActivated;           // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B[0x5];                                       // 0x005B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	const class UTedMapInfo*                      CallFunc_GetSelectedMapInfo_ReturnValue;           // 0x0060(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0068(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0078(0x0048)(HasGetValueTypeHash)
	class USavedGameSlotInfo*                     K2Node_ComponentBoundEvent_SlotInfoToDelete;       // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x00C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	ESavedGameActionResult                        CallFunc_DeleteSlotByInfo_Result;                  // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x00E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_2;                    // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x00F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0108(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0118(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0160(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0170(0x0010)()
	class ATedHUD*                                CallFunc_GetHUD_ReturnValue;                       // 0x0180(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0188(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTedContentPanelBase*                   K2Node_ComponentBoundEvent_InContentPanel;         // 0x0198(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UTedContentPanelSlotBase*               K2Node_ComponentBoundEvent_InContentSlot;          // 0x01A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ETedContentSlotAction                         K2Node_ComponentBoundEvent_InAction;               // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_3;                    // 0x01A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1AA[0x6];                                      // 0x01AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UTedUserWidget*                         K2Node_ComponentBoundEvent_InWidget_1;             // 0x01B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	const class USavedGameSlotInfo*               CallFunc_GetSelectedContent_ReturnValue;           // 0x01B8(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasSaveFileWithName_ReturnValue;          // 0x01C0(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C1[0x7];                                      // 0x01C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue_1;          // 0x01C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_TextIsEmpty_ReturnValue_1;                // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D9[0x7];                                      // 0x01D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayNameFromReserved_ReturnValue;   // 0x01E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F1[0x3];                                      // 0x01F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_1;          // 0x01F4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1FC[0x4];                                      // 0x01FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_NameToText_ReturnValue;              // 0x0200(0x0010)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0210(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetContentSlotsCount_ReturnValue;         // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0224(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_225[0x3];                                      // 0x0225(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	const class UTedMapInfo*                      CallFunc_K2_GetCurrentMapInfo_ReturnValue;         // 0x0228(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class UTedMapInfo*                      CallFunc_K2_GetCurrentMapInfo_ReturnValue_1;       // 0x0230(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0239(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23A[0x6];                                      // 0x023A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x0240(0x0010)()
	class UWBP_SaveSlots_List_C*                  CallFunc_GetSavePanel_Out_1;                       // 0x0250(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_SaveSlots_List_C*                  CallFunc_GetSavePanel_Out_2;                       // 0x0258(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_SaveSlots_List_C*                  CallFunc_GetSavePanel_Out_3;                       // 0x0260(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetText_ReturnValue_1;                    // 0x0268(0x0010)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x0278(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetText_ReturnValue_2;                    // 0x0288(0x0010)()
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_2;          // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x02A0(0x0048)(HasGetValueTypeHash)
	ESavedGameActionResult                        CallFunc_SaveSlot_Result_1;                        // 0x02E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E9[0x7];                                      // 0x02E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x02F0(0x0010)(ReferenceParm)
	bool                                          K2Node_SwitchEnum_CmpSuccess_4;                    // 0x0300(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_301[0x7];                                      // 0x0301(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0308(0x0010)()
	bool                                          CallFunc_TextIsEmpty_ReturnValue_2;                // 0x0318(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0319(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31A[0x6];                                      // 0x031A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_SaveSlots_List_C*                  CallFunc_GetSavePanel_Out_4;                       // 0x0320(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SaveGame_C_ExecuteUbergraph_WBP_SaveGame) == 0x000008, "Wrong alignment on WBP_SaveGame_C_ExecuteUbergraph_WBP_SaveGame");
static_assert(sizeof(WBP_SaveGame_C_ExecuteUbergraph_WBP_SaveGame) == 0x000328, "Wrong size on WBP_SaveGame_C_ExecuteUbergraph_WBP_SaveGame");
static_assert(offsetof(WBP_SaveGame_C_ExecuteUbergraph_WBP_SaveGame, EntryPoint) == 0x000000, "Member 'WBP_SaveGame_C_ExecuteUbergraph_WBP_SaveGame::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_SaveGame_C_ExecuteUbergraph_WBP_SaveGame, CallFunc_GetSavePanel_Out) == 0x000008, "Member 'WBP_SaveGame_C_ExecuteUbergraph_WBP_SaveGame::CallFunc_GetSavePanel_Out' has a wrong offset!");
static_assert(offsetof(WBP_SaveGame_C_ExecuteUbergraph_WBP_SaveGame, CallFunc_GetText_ReturnValue) == 0x000010, "Member 'WBP_SaveGame_C_ExecuteUbergraph_WBP_SaveGame::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SaveGame_C_ExecuteUbergraph_WBP_SaveGame, CallFunc_Conv_TextToString_ReturnValue) == 0x000020, "Member 'WBP_SaveGame_C_ExecuteUbergraph_WBP_SaveGame::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SaveGame_C_ExecuteUbergraph_WBP_SaveGame, CallFunc_TextIsEmpty_ReturnValue) == 0x000030, "Member 'WBP_SaveGame_C_ExecuteUbergraph_WBP_SaveGame::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SaveGame_C_ExecuteUbergraph_WBP_SaveGame, CallFunc_Conv_StringToName_ReturnValue) == 0x000034, "Member 'WBP_SaveGame_C_ExecuteUbergraph_WBP_SaveGame::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SaveGame_C_ExecuteUbergraph_WBP_SaveGame, CallFunc_Not_PreBool_ReturnValue) == 0x00003C, "Member 'WBP_SaveGame_C_ExecuteUbergraph_WBP_SaveGame::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SaveGame_C_ExecuteUbergraph_WBP_SaveGame, CallFunc_SaveSlot_Result) == 0x00003D, "Member 'WBP_SaveGame_C_ExecuteUbergraph_WBP_SaveGame::CallFunc_SaveSlot_Result' has a wrong offset!");
static_assert(offsetof(WBP_SaveGame_C_ExecuteUbergraph_WBP_SaveGame, K2Node_SwitchEnum_CmpSuccess) == 0x00003E, "Member 'WBP_SaveGame_C_ExecuteUbergraph_WBP_SaveGame::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_SaveGame_C_ExecuteUbergraph_WBP_SaveGame, K2Node_ComponentBoundEvent_InWidget) == 0x000040, "Member 'WBP_SaveGame_C_ExecuteUbergraph_WBP_SaveGame::K2Node_ComponentBoundEvent_InWidget' has a wrong offset!");
static_assert(offsetof(WBP_SaveGame_C_ExecuteUbergraph_WBP_SaveGame, K2Node_ComponentBoundEvent_InContentPanel_1) == 0x000048, "Member 'WBP_SaveGame_C_ExecuteUbergraph_WBP_SaveGame::K2Node_ComponentBoundEvent_InContentPanel_1' has a wrong offset!");
static_assert(offsetof(WBP_SaveGame_C_ExecuteUbergraph_WBP_SaveGame, K2Node_ComponentBoundEvent_InContentSlot_1) == 0x000050, "Member 'WBP_SaveGame_C_ExecuteUbergraph_WBP_SaveGame::K2Node_ComponentBoundEvent_InContentSlot_1' has a wrong offset!");
static_assert(offsetof(WBP_SaveGame_C_ExecuteUbergraph_WBP_SaveGame, K2Node_ComponentBoundEvent_InState) == 0x000058, "Member 'WBP_SaveGame_C_ExecuteUbergraph_WBP_SaveGame::K2Node_ComponentBoundEvent_InState' has a wrong offset!");
static_assert(offsetof(WBP_SaveGame_C_ExecuteUbergraph_WBP_SaveGame, K2Node_ComponentBoundEvent_bInActivated) == 0x000059, "Member 'WBP_SaveGame_C_ExecuteUbergraph_WBP_SaveGame::K2Node_ComponentBoundEvent_bInActivated' has a wrong offset!");
static_assert(offsetof(WBP_SaveGame_C_ExecuteUbergraph_WBP_SaveGame, K2Node_SwitchEnum_CmpSuccess_1) == 0x00005A, "Member 'WBP_SaveGame_C_ExecuteUbergraph_WBP_SaveGame::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_SaveGame_C_ExecuteUbergraph_WBP_SaveGame, CallFunc_GetSelectedMapInfo_ReturnValue) == 0x000060, "Member 'WBP_SaveGame_C_ExecuteUbergraph_WBP_SaveGame::CallFunc_GetSelectedMapInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SaveGame_C_ExecuteUbergraph_WBP_SaveGame, CallFunc_MakeLiteralText_ReturnValue) == 0x000068, "Member 'WBP_SaveGame_C_ExecuteUbergraph_WBP_SaveGame::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SaveGame_C_ExecuteUbergraph_WBP_SaveGame, K2Node_MakeStruct_FormatArgumentData) == 0x000078, "Member 'WBP_SaveGame_C_ExecuteUbergraph_WBP_SaveGame::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_SaveGame_C_ExecuteUbergraph_WBP_SaveGame, K2Node_ComponentBoundEvent_SlotInfoToDelete) == 0x0000C0, "Member 'WBP_SaveGame_C_ExecuteUbergraph_WBP_SaveGame::K2Node_ComponentBoundEvent_SlotInfoToDelete' has a wrong offset!");
static_assert(offsetof(WBP_SaveGame_C_ExecuteUbergraph_WBP_SaveGame, CallFunc_Conv_NameToString_ReturnValue) == 0x0000C8, "Member 'WBP_SaveGame_C_ExecuteUbergraph_WBP_SaveGame::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SaveGame_C_ExecuteUbergraph_WBP_SaveGame, CallFunc_DeleteSlotByInfo_Result) == 0x0000D8, "Member 'WBP_SaveGame_C_ExecuteUbergraph_WBP_SaveGame::CallFunc_DeleteSlotByInfo_Result' has a wrong offset!");
static_assert(offsetof(WBP_SaveGame_C_ExecuteUbergraph_WBP_SaveGame, CallFunc_Concat_StrStr_ReturnValue) == 0x0000E0, "Member 'WBP_SaveGame_C_ExecuteUbergraph_WBP_SaveGame::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SaveGame_C_ExecuteUbergraph_WBP_SaveGame, K2Node_SwitchEnum_CmpSuccess_2) == 0x0000F0, "Member 'WBP_SaveGame_C_ExecuteUbergraph_WBP_SaveGame::K2Node_SwitchEnum_CmpSuccess_2' has a wrong offset!");
static_assert(offsetof(WBP_SaveGame_C_ExecuteUbergraph_WBP_SaveGame, CallFunc_Concat_StrStr_ReturnValue_1) == 0x0000F8, "Member 'WBP_SaveGame_C_ExecuteUbergraph_WBP_SaveGame::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_SaveGame_C_ExecuteUbergraph_WBP_SaveGame, CallFunc_Conv_StringToText_ReturnValue) == 0x000108, "Member 'WBP_SaveGame_C_ExecuteUbergraph_WBP_SaveGame::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SaveGame_C_ExecuteUbergraph_WBP_SaveGame, K2Node_MakeStruct_FormatArgumentData_1) == 0x000118, "Member 'WBP_SaveGame_C_ExecuteUbergraph_WBP_SaveGame::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WBP_SaveGame_C_ExecuteUbergraph_WBP_SaveGame, K2Node_MakeArray_Array) == 0x000160, "Member 'WBP_SaveGame_C_ExecuteUbergraph_WBP_SaveGame::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_SaveGame_C_ExecuteUbergraph_WBP_SaveGame, CallFunc_Format_ReturnValue) == 0x000170, "Member 'WBP_SaveGame_C_ExecuteUbergraph_WBP_SaveGame::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SaveGame_C_ExecuteUbergraph_WBP_SaveGame, CallFunc_GetHUD_ReturnValue) == 0x000180, "Member 'WBP_SaveGame_C_ExecuteUbergraph_WBP_SaveGame::CallFunc_GetHUD_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SaveGame_C_ExecuteUbergraph_WBP_SaveGame, K2Node_CreateDelegate_OutputDelegate) == 0x000188, "Member 'WBP_SaveGame_C_ExecuteUbergraph_WBP_SaveGame::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_SaveGame_C_ExecuteUbergraph_WBP_SaveGame, K2Node_ComponentBoundEvent_InContentPanel) == 0x000198, "Member 'WBP_SaveGame_C_ExecuteUbergraph_WBP_SaveGame::K2Node_ComponentBoundEvent_InContentPanel' has a wrong offset!");
static_assert(offsetof(WBP_SaveGame_C_ExecuteUbergraph_WBP_SaveGame, K2Node_ComponentBoundEvent_InContentSlot) == 0x0001A0, "Member 'WBP_SaveGame_C_ExecuteUbergraph_WBP_SaveGame::K2Node_ComponentBoundEvent_InContentSlot' has a wrong offset!");
static_assert(offsetof(WBP_SaveGame_C_ExecuteUbergraph_WBP_SaveGame, K2Node_ComponentBoundEvent_InAction) == 0x0001A8, "Member 'WBP_SaveGame_C_ExecuteUbergraph_WBP_SaveGame::K2Node_ComponentBoundEvent_InAction' has a wrong offset!");
static_assert(offsetof(WBP_SaveGame_C_ExecuteUbergraph_WBP_SaveGame, K2Node_SwitchEnum_CmpSuccess_3) == 0x0001A9, "Member 'WBP_SaveGame_C_ExecuteUbergraph_WBP_SaveGame::K2Node_SwitchEnum_CmpSuccess_3' has a wrong offset!");
static_assert(offsetof(WBP_SaveGame_C_ExecuteUbergraph_WBP_SaveGame, K2Node_ComponentBoundEvent_InWidget_1) == 0x0001B0, "Member 'WBP_SaveGame_C_ExecuteUbergraph_WBP_SaveGame::K2Node_ComponentBoundEvent_InWidget_1' has a wrong offset!");
static_assert(offsetof(WBP_SaveGame_C_ExecuteUbergraph_WBP_SaveGame, CallFunc_GetSelectedContent_ReturnValue) == 0x0001B8, "Member 'WBP_SaveGame_C_ExecuteUbergraph_WBP_SaveGame::CallFunc_GetSelectedContent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SaveGame_C_ExecuteUbergraph_WBP_SaveGame, CallFunc_HasSaveFileWithName_ReturnValue) == 0x0001C0, "Member 'WBP_SaveGame_C_ExecuteUbergraph_WBP_SaveGame::CallFunc_HasSaveFileWithName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SaveGame_C_ExecuteUbergraph_WBP_SaveGame, CallFunc_Conv_NameToString_ReturnValue_1) == 0x0001C8, "Member 'WBP_SaveGame_C_ExecuteUbergraph_WBP_SaveGame::CallFunc_Conv_NameToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_SaveGame_C_ExecuteUbergraph_WBP_SaveGame, CallFunc_TextIsEmpty_ReturnValue_1) == 0x0001D8, "Member 'WBP_SaveGame_C_ExecuteUbergraph_WBP_SaveGame::CallFunc_TextIsEmpty_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_SaveGame_C_ExecuteUbergraph_WBP_SaveGame, CallFunc_GetDisplayNameFromReserved_ReturnValue) == 0x0001E0, "Member 'WBP_SaveGame_C_ExecuteUbergraph_WBP_SaveGame::CallFunc_GetDisplayNameFromReserved_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SaveGame_C_ExecuteUbergraph_WBP_SaveGame, CallFunc_IsValid_ReturnValue) == 0x0001F0, "Member 'WBP_SaveGame_C_ExecuteUbergraph_WBP_SaveGame::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SaveGame_C_ExecuteUbergraph_WBP_SaveGame, CallFunc_Conv_StringToName_ReturnValue_1) == 0x0001F4, "Member 'WBP_SaveGame_C_ExecuteUbergraph_WBP_SaveGame::CallFunc_Conv_StringToName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_SaveGame_C_ExecuteUbergraph_WBP_SaveGame, CallFunc_Conv_NameToText_ReturnValue) == 0x000200, "Member 'WBP_SaveGame_C_ExecuteUbergraph_WBP_SaveGame::CallFunc_Conv_NameToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SaveGame_C_ExecuteUbergraph_WBP_SaveGame, K2Node_CreateDelegate_OutputDelegate_1) == 0x000210, "Member 'WBP_SaveGame_C_ExecuteUbergraph_WBP_SaveGame::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_SaveGame_C_ExecuteUbergraph_WBP_SaveGame, CallFunc_GetContentSlotsCount_ReturnValue) == 0x000220, "Member 'WBP_SaveGame_C_ExecuteUbergraph_WBP_SaveGame::CallFunc_GetContentSlotsCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SaveGame_C_ExecuteUbergraph_WBP_SaveGame, CallFunc_Greater_IntInt_ReturnValue) == 0x000224, "Member 'WBP_SaveGame_C_ExecuteUbergraph_WBP_SaveGame::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SaveGame_C_ExecuteUbergraph_WBP_SaveGame, CallFunc_K2_GetCurrentMapInfo_ReturnValue) == 0x000228, "Member 'WBP_SaveGame_C_ExecuteUbergraph_WBP_SaveGame::CallFunc_K2_GetCurrentMapInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SaveGame_C_ExecuteUbergraph_WBP_SaveGame, CallFunc_K2_GetCurrentMapInfo_ReturnValue_1) == 0x000230, "Member 'WBP_SaveGame_C_ExecuteUbergraph_WBP_SaveGame::CallFunc_K2_GetCurrentMapInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_SaveGame_C_ExecuteUbergraph_WBP_SaveGame, CallFunc_IsValid_ReturnValue_1) == 0x000238, "Member 'WBP_SaveGame_C_ExecuteUbergraph_WBP_SaveGame::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_SaveGame_C_ExecuteUbergraph_WBP_SaveGame, Temp_bool_Variable) == 0x000239, "Member 'WBP_SaveGame_C_ExecuteUbergraph_WBP_SaveGame::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_SaveGame_C_ExecuteUbergraph_WBP_SaveGame, K2Node_Select_Default) == 0x000240, "Member 'WBP_SaveGame_C_ExecuteUbergraph_WBP_SaveGame::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_SaveGame_C_ExecuteUbergraph_WBP_SaveGame, CallFunc_GetSavePanel_Out_1) == 0x000250, "Member 'WBP_SaveGame_C_ExecuteUbergraph_WBP_SaveGame::CallFunc_GetSavePanel_Out_1' has a wrong offset!");
static_assert(offsetof(WBP_SaveGame_C_ExecuteUbergraph_WBP_SaveGame, CallFunc_GetSavePanel_Out_2) == 0x000258, "Member 'WBP_SaveGame_C_ExecuteUbergraph_WBP_SaveGame::CallFunc_GetSavePanel_Out_2' has a wrong offset!");
static_assert(offsetof(WBP_SaveGame_C_ExecuteUbergraph_WBP_SaveGame, CallFunc_GetSavePanel_Out_3) == 0x000260, "Member 'WBP_SaveGame_C_ExecuteUbergraph_WBP_SaveGame::CallFunc_GetSavePanel_Out_3' has a wrong offset!");
static_assert(offsetof(WBP_SaveGame_C_ExecuteUbergraph_WBP_SaveGame, CallFunc_GetText_ReturnValue_1) == 0x000268, "Member 'WBP_SaveGame_C_ExecuteUbergraph_WBP_SaveGame::CallFunc_GetText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_SaveGame_C_ExecuteUbergraph_WBP_SaveGame, CallFunc_Conv_TextToString_ReturnValue_1) == 0x000278, "Member 'WBP_SaveGame_C_ExecuteUbergraph_WBP_SaveGame::CallFunc_Conv_TextToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_SaveGame_C_ExecuteUbergraph_WBP_SaveGame, CallFunc_GetText_ReturnValue_2) == 0x000288, "Member 'WBP_SaveGame_C_ExecuteUbergraph_WBP_SaveGame::CallFunc_GetText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_SaveGame_C_ExecuteUbergraph_WBP_SaveGame, CallFunc_Conv_StringToName_ReturnValue_2) == 0x000298, "Member 'WBP_SaveGame_C_ExecuteUbergraph_WBP_SaveGame::CallFunc_Conv_StringToName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_SaveGame_C_ExecuteUbergraph_WBP_SaveGame, K2Node_MakeStruct_FormatArgumentData_2) == 0x0002A0, "Member 'WBP_SaveGame_C_ExecuteUbergraph_WBP_SaveGame::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(WBP_SaveGame_C_ExecuteUbergraph_WBP_SaveGame, CallFunc_SaveSlot_Result_1) == 0x0002E8, "Member 'WBP_SaveGame_C_ExecuteUbergraph_WBP_SaveGame::CallFunc_SaveSlot_Result_1' has a wrong offset!");
static_assert(offsetof(WBP_SaveGame_C_ExecuteUbergraph_WBP_SaveGame, K2Node_MakeArray_Array_1) == 0x0002F0, "Member 'WBP_SaveGame_C_ExecuteUbergraph_WBP_SaveGame::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(WBP_SaveGame_C_ExecuteUbergraph_WBP_SaveGame, K2Node_SwitchEnum_CmpSuccess_4) == 0x000300, "Member 'WBP_SaveGame_C_ExecuteUbergraph_WBP_SaveGame::K2Node_SwitchEnum_CmpSuccess_4' has a wrong offset!");
static_assert(offsetof(WBP_SaveGame_C_ExecuteUbergraph_WBP_SaveGame, CallFunc_Format_ReturnValue_1) == 0x000308, "Member 'WBP_SaveGame_C_ExecuteUbergraph_WBP_SaveGame::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_SaveGame_C_ExecuteUbergraph_WBP_SaveGame, CallFunc_TextIsEmpty_ReturnValue_2) == 0x000318, "Member 'WBP_SaveGame_C_ExecuteUbergraph_WBP_SaveGame::CallFunc_TextIsEmpty_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_SaveGame_C_ExecuteUbergraph_WBP_SaveGame, CallFunc_Not_PreBool_ReturnValue_1) == 0x000319, "Member 'WBP_SaveGame_C_ExecuteUbergraph_WBP_SaveGame::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_SaveGame_C_ExecuteUbergraph_WBP_SaveGame, CallFunc_GetSavePanel_Out_4) == 0x000320, "Member 'WBP_SaveGame_C_ExecuteUbergraph_WBP_SaveGame::CallFunc_GetSavePanel_Out_4' has a wrong offset!");

// Function WBP_SaveGame.WBP_SaveGame_C.BndEvt__WBP_SaveGame_SaveSlots_List_K2Node_ComponentBoundEvent_8_ContentPanelActionDelegateSignature__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct WBP_SaveGame_C_BndEvt__WBP_SaveGame_SaveSlots_List_K2Node_ComponentBoundEvent_8_ContentPanelActionDelegateSignature__DelegateSignature final
{
public:
	class UTedContentPanelBase*                   InContentPanel;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UTedContentPanelSlotBase*               InContentSlot;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ETedContentSlotAction                         InAction;                                          // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SaveGame_C_BndEvt__WBP_SaveGame_SaveSlots_List_K2Node_ComponentBoundEvent_8_ContentPanelActionDelegateSignature__DelegateSignature) == 0x000008, "Wrong alignment on WBP_SaveGame_C_BndEvt__WBP_SaveGame_SaveSlots_List_K2Node_ComponentBoundEvent_8_ContentPanelActionDelegateSignature__DelegateSignature");
static_assert(sizeof(WBP_SaveGame_C_BndEvt__WBP_SaveGame_SaveSlots_List_K2Node_ComponentBoundEvent_8_ContentPanelActionDelegateSignature__DelegateSignature) == 0x000018, "Wrong size on WBP_SaveGame_C_BndEvt__WBP_SaveGame_SaveSlots_List_K2Node_ComponentBoundEvent_8_ContentPanelActionDelegateSignature__DelegateSignature");
static_assert(offsetof(WBP_SaveGame_C_BndEvt__WBP_SaveGame_SaveSlots_List_K2Node_ComponentBoundEvent_8_ContentPanelActionDelegateSignature__DelegateSignature, InContentPanel) == 0x000000, "Member 'WBP_SaveGame_C_BndEvt__WBP_SaveGame_SaveSlots_List_K2Node_ComponentBoundEvent_8_ContentPanelActionDelegateSignature__DelegateSignature::InContentPanel' has a wrong offset!");
static_assert(offsetof(WBP_SaveGame_C_BndEvt__WBP_SaveGame_SaveSlots_List_K2Node_ComponentBoundEvent_8_ContentPanelActionDelegateSignature__DelegateSignature, InContentSlot) == 0x000008, "Member 'WBP_SaveGame_C_BndEvt__WBP_SaveGame_SaveSlots_List_K2Node_ComponentBoundEvent_8_ContentPanelActionDelegateSignature__DelegateSignature::InContentSlot' has a wrong offset!");
static_assert(offsetof(WBP_SaveGame_C_BndEvt__WBP_SaveGame_SaveSlots_List_K2Node_ComponentBoundEvent_8_ContentPanelActionDelegateSignature__DelegateSignature, InAction) == 0x000010, "Member 'WBP_SaveGame_C_BndEvt__WBP_SaveGame_SaveSlots_List_K2Node_ComponentBoundEvent_8_ContentPanelActionDelegateSignature__DelegateSignature::InAction' has a wrong offset!");

// Function WBP_SaveGame.WBP_SaveGame_C.BndEvt__WBP_SaveGame_SaveSlots_List_K2Node_ComponentBoundEvent_7_OnDeleteSaveSlotRequested__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_SaveGame_C_BndEvt__WBP_SaveGame_SaveSlots_List_K2Node_ComponentBoundEvent_7_OnDeleteSaveSlotRequested__DelegateSignature final
{
public:
	class USavedGameSlotInfo*                     SlotInfoToDelete;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SaveGame_C_BndEvt__WBP_SaveGame_SaveSlots_List_K2Node_ComponentBoundEvent_7_OnDeleteSaveSlotRequested__DelegateSignature) == 0x000008, "Wrong alignment on WBP_SaveGame_C_BndEvt__WBP_SaveGame_SaveSlots_List_K2Node_ComponentBoundEvent_7_OnDeleteSaveSlotRequested__DelegateSignature");
static_assert(sizeof(WBP_SaveGame_C_BndEvt__WBP_SaveGame_SaveSlots_List_K2Node_ComponentBoundEvent_7_OnDeleteSaveSlotRequested__DelegateSignature) == 0x000008, "Wrong size on WBP_SaveGame_C_BndEvt__WBP_SaveGame_SaveSlots_List_K2Node_ComponentBoundEvent_7_OnDeleteSaveSlotRequested__DelegateSignature");
static_assert(offsetof(WBP_SaveGame_C_BndEvt__WBP_SaveGame_SaveSlots_List_K2Node_ComponentBoundEvent_7_OnDeleteSaveSlotRequested__DelegateSignature, SlotInfoToDelete) == 0x000000, "Member 'WBP_SaveGame_C_BndEvt__WBP_SaveGame_SaveSlots_List_K2Node_ComponentBoundEvent_7_OnDeleteSaveSlotRequested__DelegateSignature::SlotInfoToDelete' has a wrong offset!");

// Function WBP_SaveGame.WBP_SaveGame_C.BndEvt__WBP_SaveGame_SaveSlots_List_K2Node_ComponentBoundEvent_4_ContentPanelStateDelegateSignature__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct WBP_SaveGame_C_BndEvt__WBP_SaveGame_SaveSlots_List_K2Node_ComponentBoundEvent_4_ContentPanelStateDelegateSignature__DelegateSignature final
{
public:
	class UTedContentPanelBase*                   InContentPanel;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UTedContentPanelSlotBase*               InContentSlot;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ETedContentSlotState                          InState;                                           // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bInActivated;                                      // 0x0011(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SaveGame_C_BndEvt__WBP_SaveGame_SaveSlots_List_K2Node_ComponentBoundEvent_4_ContentPanelStateDelegateSignature__DelegateSignature) == 0x000008, "Wrong alignment on WBP_SaveGame_C_BndEvt__WBP_SaveGame_SaveSlots_List_K2Node_ComponentBoundEvent_4_ContentPanelStateDelegateSignature__DelegateSignature");
static_assert(sizeof(WBP_SaveGame_C_BndEvt__WBP_SaveGame_SaveSlots_List_K2Node_ComponentBoundEvent_4_ContentPanelStateDelegateSignature__DelegateSignature) == 0x000018, "Wrong size on WBP_SaveGame_C_BndEvt__WBP_SaveGame_SaveSlots_List_K2Node_ComponentBoundEvent_4_ContentPanelStateDelegateSignature__DelegateSignature");
static_assert(offsetof(WBP_SaveGame_C_BndEvt__WBP_SaveGame_SaveSlots_List_K2Node_ComponentBoundEvent_4_ContentPanelStateDelegateSignature__DelegateSignature, InContentPanel) == 0x000000, "Member 'WBP_SaveGame_C_BndEvt__WBP_SaveGame_SaveSlots_List_K2Node_ComponentBoundEvent_4_ContentPanelStateDelegateSignature__DelegateSignature::InContentPanel' has a wrong offset!");
static_assert(offsetof(WBP_SaveGame_C_BndEvt__WBP_SaveGame_SaveSlots_List_K2Node_ComponentBoundEvent_4_ContentPanelStateDelegateSignature__DelegateSignature, InContentSlot) == 0x000008, "Member 'WBP_SaveGame_C_BndEvt__WBP_SaveGame_SaveSlots_List_K2Node_ComponentBoundEvent_4_ContentPanelStateDelegateSignature__DelegateSignature::InContentSlot' has a wrong offset!");
static_assert(offsetof(WBP_SaveGame_C_BndEvt__WBP_SaveGame_SaveSlots_List_K2Node_ComponentBoundEvent_4_ContentPanelStateDelegateSignature__DelegateSignature, InState) == 0x000010, "Member 'WBP_SaveGame_C_BndEvt__WBP_SaveGame_SaveSlots_List_K2Node_ComponentBoundEvent_4_ContentPanelStateDelegateSignature__DelegateSignature::InState' has a wrong offset!");
static_assert(offsetof(WBP_SaveGame_C_BndEvt__WBP_SaveGame_SaveSlots_List_K2Node_ComponentBoundEvent_4_ContentPanelStateDelegateSignature__DelegateSignature, bInActivated) == 0x000011, "Member 'WBP_SaveGame_C_BndEvt__WBP_SaveGame_SaveSlots_List_K2Node_ComponentBoundEvent_4_ContentPanelStateDelegateSignature__DelegateSignature::bInActivated' has a wrong offset!");

// Function WBP_SaveGame.WBP_SaveGame_C.BndEvt__WBP_SaveGame_Button_Save_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_SaveGame_C_BndEvt__WBP_SaveGame_Button_Save_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature final
{
public:
	class UTedUserWidget*                         InWidget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SaveGame_C_BndEvt__WBP_SaveGame_Button_Save_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_SaveGame_C_BndEvt__WBP_SaveGame_Button_Save_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature");
static_assert(sizeof(WBP_SaveGame_C_BndEvt__WBP_SaveGame_Button_Save_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_SaveGame_C_BndEvt__WBP_SaveGame_Button_Save_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature");
static_assert(offsetof(WBP_SaveGame_C_BndEvt__WBP_SaveGame_Button_Save_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature, InWidget) == 0x000000, "Member 'WBP_SaveGame_C_BndEvt__WBP_SaveGame_Button_Save_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature::InWidget' has a wrong offset!");

// Function WBP_SaveGame.WBP_SaveGame_C.BndEvt__WBP_Misc_MapSelector_Button_Back_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_SaveGame_C_BndEvt__WBP_Misc_MapSelector_Button_Back_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature final
{
public:
	class UTedUserWidget*                         InWidget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SaveGame_C_BndEvt__WBP_Misc_MapSelector_Button_Back_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_SaveGame_C_BndEvt__WBP_Misc_MapSelector_Button_Back_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature");
static_assert(sizeof(WBP_SaveGame_C_BndEvt__WBP_Misc_MapSelector_Button_Back_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_SaveGame_C_BndEvt__WBP_Misc_MapSelector_Button_Back_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature");
