#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_BuildingGrid_ModeTabs_Panel

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Tempest_structs.hpp"
#include "Tempest_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_BuildingGrid_ModeTabs_Panel.WBP_BuildingGrid_ModeTabs_Panel_C
// 0x0018 (0x0770 - 0x0758)
class UWBP_BuildingGrid_ModeTabs_Panel_C final : public UTedContentPanelStatic
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0758(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_BuildingGrid_ModeTabs_Slot_C*      Tab_Build;                                         // 0x0760(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_BuildingGrid_ModeTabs_Slot_C*      Tab_Doctrines;                                     // 0x0768(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_BuildingGrid_ModeTabs_Panel(int32 EntryPoint);
	void OnTriggerSlotActionInternal(class UTedContentPanelSlotBase* InContentSlot, ETedContentSlotAction InAction);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_BuildingGrid_ModeTabs_Panel_C">();
	}
	static class UWBP_BuildingGrid_ModeTabs_Panel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_BuildingGrid_ModeTabs_Panel_C>();
	}
};
static_assert(alignof(UWBP_BuildingGrid_ModeTabs_Panel_C) == 0x000008, "Wrong alignment on UWBP_BuildingGrid_ModeTabs_Panel_C");
static_assert(sizeof(UWBP_BuildingGrid_ModeTabs_Panel_C) == 0x000770, "Wrong size on UWBP_BuildingGrid_ModeTabs_Panel_C");
static_assert(offsetof(UWBP_BuildingGrid_ModeTabs_Panel_C, UberGraphFrame) == 0x000758, "Member 'UWBP_BuildingGrid_ModeTabs_Panel_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_BuildingGrid_ModeTabs_Panel_C, Tab_Build) == 0x000760, "Member 'UWBP_BuildingGrid_ModeTabs_Panel_C::Tab_Build' has a wrong offset!");
static_assert(offsetof(UWBP_BuildingGrid_ModeTabs_Panel_C, Tab_Doctrines) == 0x000768, "Member 'UWBP_BuildingGrid_ModeTabs_Panel_C::Tab_Doctrines' has a wrong offset!");

}

