#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ScoreScreen_StatTable_Cell_Player

#include "Basic.hpp"

#include "Tempest_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_ScoreScreen_StatTable_Cell_Player.WBP_ScoreScreen_StatTable_Cell_Player_C.ExecuteUbergraph_WBP_ScoreScreen_StatTable_Cell_Player
// 0x0008 (0x0008 - 0x0000)
struct WBP_ScoreScreen_StatTable_Cell_Player_C_ExecuteUbergraph_WBP_ScoreScreen_StatTable_Cell_Player final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ScoreScreen_StatTable_Cell_Player_C_ExecuteUbergraph_WBP_ScoreScreen_StatTable_Cell_Player) == 0x000004, "Wrong alignment on WBP_ScoreScreen_StatTable_Cell_Player_C_ExecuteUbergraph_WBP_ScoreScreen_StatTable_Cell_Player");
static_assert(sizeof(WBP_ScoreScreen_StatTable_Cell_Player_C_ExecuteUbergraph_WBP_ScoreScreen_StatTable_Cell_Player) == 0x000008, "Wrong size on WBP_ScoreScreen_StatTable_Cell_Player_C_ExecuteUbergraph_WBP_ScoreScreen_StatTable_Cell_Player");
static_assert(offsetof(WBP_ScoreScreen_StatTable_Cell_Player_C_ExecuteUbergraph_WBP_ScoreScreen_StatTable_Cell_Player, EntryPoint) == 0x000000, "Member 'WBP_ScoreScreen_StatTable_Cell_Player_C_ExecuteUbergraph_WBP_ScoreScreen_StatTable_Cell_Player::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_ScoreScreen_StatTable_Cell_Player_C_ExecuteUbergraph_WBP_ScoreScreen_StatTable_Cell_Player, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WBP_ScoreScreen_StatTable_Cell_Player_C_ExecuteUbergraph_WBP_ScoreScreen_StatTable_Cell_Player::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function WBP_ScoreScreen_StatTable_Cell_Player.WBP_ScoreScreen_StatTable_Cell_Player_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_ScoreScreen_StatTable_Cell_Player_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ScoreScreen_StatTable_Cell_Player_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_ScoreScreen_StatTable_Cell_Player_C_PreConstruct");
static_assert(sizeof(WBP_ScoreScreen_StatTable_Cell_Player_C_PreConstruct) == 0x000001, "Wrong size on WBP_ScoreScreen_StatTable_Cell_Player_C_PreConstruct");
static_assert(offsetof(WBP_ScoreScreen_StatTable_Cell_Player_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_ScoreScreen_StatTable_Cell_Player_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_ScoreScreen_StatTable_Cell_Player.WBP_ScoreScreen_StatTable_Cell_Player_C.UpdateFactionIcon
// 0x0010 (0x0010 - 0x0000)
struct WBP_ScoreScreen_StatTable_Cell_Player_C_UpdateFactionIcon final
{
public:
	ETedFaction                                   Faction;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             CallFunc_Array_Get_Item;                           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ScoreScreen_StatTable_Cell_Player_C_UpdateFactionIcon) == 0x000008, "Wrong alignment on WBP_ScoreScreen_StatTable_Cell_Player_C_UpdateFactionIcon");
static_assert(sizeof(WBP_ScoreScreen_StatTable_Cell_Player_C_UpdateFactionIcon) == 0x000010, "Wrong size on WBP_ScoreScreen_StatTable_Cell_Player_C_UpdateFactionIcon");
static_assert(offsetof(WBP_ScoreScreen_StatTable_Cell_Player_C_UpdateFactionIcon, Faction) == 0x000000, "Member 'WBP_ScoreScreen_StatTable_Cell_Player_C_UpdateFactionIcon::Faction' has a wrong offset!");
static_assert(offsetof(WBP_ScoreScreen_StatTable_Cell_Player_C_UpdateFactionIcon, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000004, "Member 'WBP_ScoreScreen_StatTable_Cell_Player_C_UpdateFactionIcon::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ScoreScreen_StatTable_Cell_Player_C_UpdateFactionIcon, CallFunc_Array_Get_Item) == 0x000008, "Member 'WBP_ScoreScreen_StatTable_Cell_Player_C_UpdateFactionIcon::CallFunc_Array_Get_Item' has a wrong offset!");

// Function WBP_ScoreScreen_StatTable_Cell_Player.WBP_ScoreScreen_StatTable_Cell_Player_C.UpdatePlayerAvatar
// 0x0020 (0x0020 - 0x0000)
struct WBP_ScoreScreen_StatTable_Cell_Player_C_UpdatePlayerAvatar final
{
public:
	class UTexture2D*                             AvatarTexture;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ScoreScreen_StatTable_Cell_Player_C_UpdatePlayerAvatar) == 0x000008, "Wrong alignment on WBP_ScoreScreen_StatTable_Cell_Player_C_UpdatePlayerAvatar");
static_assert(sizeof(WBP_ScoreScreen_StatTable_Cell_Player_C_UpdatePlayerAvatar) == 0x000020, "Wrong size on WBP_ScoreScreen_StatTable_Cell_Player_C_UpdatePlayerAvatar");
static_assert(offsetof(WBP_ScoreScreen_StatTable_Cell_Player_C_UpdatePlayerAvatar, AvatarTexture) == 0x000000, "Member 'WBP_ScoreScreen_StatTable_Cell_Player_C_UpdatePlayerAvatar::AvatarTexture' has a wrong offset!");
static_assert(offsetof(WBP_ScoreScreen_StatTable_Cell_Player_C_UpdatePlayerAvatar, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'WBP_ScoreScreen_StatTable_Cell_Player_C_UpdatePlayerAvatar::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ScoreScreen_StatTable_Cell_Player_C_UpdatePlayerAvatar, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000010, "Member 'WBP_ScoreScreen_StatTable_Cell_Player_C_UpdatePlayerAvatar::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ScoreScreen_StatTable_Cell_Player_C_UpdatePlayerAvatar, CallFunc_GetDynamicMaterial_ReturnValue_1) == 0x000018, "Member 'WBP_ScoreScreen_StatTable_Cell_Player_C_UpdatePlayerAvatar::CallFunc_GetDynamicMaterial_ReturnValue_1' has a wrong offset!");

// Function WBP_ScoreScreen_StatTable_Cell_Player.WBP_ScoreScreen_StatTable_Cell_Player_C.UpdatePlayerColor
// 0x0014 (0x0014 - 0x0000)
struct WBP_ScoreScreen_StatTable_Cell_Player_C_UpdatePlayerColor final
{
public:
	struct FSlateColor                            Color;                                             // 0x0000(0x0014)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_ScoreScreen_StatTable_Cell_Player_C_UpdatePlayerColor) == 0x000004, "Wrong alignment on WBP_ScoreScreen_StatTable_Cell_Player_C_UpdatePlayerColor");
static_assert(sizeof(WBP_ScoreScreen_StatTable_Cell_Player_C_UpdatePlayerColor) == 0x000014, "Wrong size on WBP_ScoreScreen_StatTable_Cell_Player_C_UpdatePlayerColor");
static_assert(offsetof(WBP_ScoreScreen_StatTable_Cell_Player_C_UpdatePlayerColor, Color) == 0x000000, "Member 'WBP_ScoreScreen_StatTable_Cell_Player_C_UpdatePlayerColor::Color' has a wrong offset!");

// Function WBP_ScoreScreen_StatTable_Cell_Player.WBP_ScoreScreen_StatTable_Cell_Player_C.UpdatePlayerName
// 0x0010 (0x0010 - 0x0000)
struct WBP_ScoreScreen_StatTable_Cell_Player_C_UpdatePlayerName final
{
public:
	class FText                                   Name_0;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_ScoreScreen_StatTable_Cell_Player_C_UpdatePlayerName) == 0x000008, "Wrong alignment on WBP_ScoreScreen_StatTable_Cell_Player_C_UpdatePlayerName");
static_assert(sizeof(WBP_ScoreScreen_StatTable_Cell_Player_C_UpdatePlayerName) == 0x000010, "Wrong size on WBP_ScoreScreen_StatTable_Cell_Player_C_UpdatePlayerName");
static_assert(offsetof(WBP_ScoreScreen_StatTable_Cell_Player_C_UpdatePlayerName, Name_0) == 0x000000, "Member 'WBP_ScoreScreen_StatTable_Cell_Player_C_UpdatePlayerName::Name_0' has a wrong offset!");

}

