#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ScoreScreen_Graph_Participants_Slot

#include "Basic.hpp"

#include "Tempest_structs.hpp"
#include "Tempest_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ScoreScreen_Graph_Participants_Slot.WBP_ScoreScreen_Graph_Participants_Slot_C
// 0x0020 (0x0450 - 0x0430)
class UWBP_ScoreScreen_Graph_Participants_Slot_C final : public UTedGenericDataContentSlot
{
public:
	class UImage*                                 Image_Checkbox;                                    // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Player_Avatar;                                     // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTedImage*                              TedImage_BG;                                       // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Name;                                    // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void GetParticipantAvatar(class UTexture2D** OutValue);
	void GetParticipantName(class FText* OutValue);
	void GetPlayerColor(struct FLinearColor* Output);
	void OnActivateState(ETedContentSlotState InState, bool bInActivated);
	void OnTriggerAction(ETedContentSlotAction InAction);
	void RefreshCheckbox();
	void RefreshParticipantAvatar();
	void RefreshParticipantName();
	void RefreshUI();

	void GetMaterialsSupportingStates(TArray<class UMaterialInstanceDynamic*>* OutMIDs) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ScoreScreen_Graph_Participants_Slot_C">();
	}
	static class UWBP_ScoreScreen_Graph_Participants_Slot_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ScoreScreen_Graph_Participants_Slot_C>();
	}
};
static_assert(alignof(UWBP_ScoreScreen_Graph_Participants_Slot_C) == 0x000008, "Wrong alignment on UWBP_ScoreScreen_Graph_Participants_Slot_C");
static_assert(sizeof(UWBP_ScoreScreen_Graph_Participants_Slot_C) == 0x000450, "Wrong size on UWBP_ScoreScreen_Graph_Participants_Slot_C");
static_assert(offsetof(UWBP_ScoreScreen_Graph_Participants_Slot_C, Image_Checkbox) == 0x000430, "Member 'UWBP_ScoreScreen_Graph_Participants_Slot_C::Image_Checkbox' has a wrong offset!");
static_assert(offsetof(UWBP_ScoreScreen_Graph_Participants_Slot_C, Player_Avatar) == 0x000438, "Member 'UWBP_ScoreScreen_Graph_Participants_Slot_C::Player_Avatar' has a wrong offset!");
static_assert(offsetof(UWBP_ScoreScreen_Graph_Participants_Slot_C, TedImage_BG) == 0x000440, "Member 'UWBP_ScoreScreen_Graph_Participants_Slot_C::TedImage_BG' has a wrong offset!");
static_assert(offsetof(UWBP_ScoreScreen_Graph_Participants_Slot_C, TextBlock_Name) == 0x000448, "Member 'UWBP_ScoreScreen_Graph_Participants_Slot_C::TextBlock_Name' has a wrong offset!");

}

