#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_HUD_BuildingGridCorner

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Tempest_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_HUD_BuildingGridCorner.WBP_HUD_BuildingGridCorner_C.BndEvt__WBP_HUD_BuildingGridCorner_ModeTabs_K2Node_ComponentBoundEvent_0_ContentPanelStateDelegateSignature__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct WBP_HUD_BuildingGridCorner_C_BndEvt__WBP_HUD_BuildingGridCorner_ModeTabs_K2Node_ComponentBoundEvent_0_ContentPanelStateDelegateSignature__DelegateSignature final
{
public:
	class UTedContentPanelBase*                   InContentPanel;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UTedContentPanelSlotBase*               InContentSlot;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ETedContentSlotState                          InState;                                           // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bInActivated;                                      // 0x0011(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_BuildingGridCorner_C_BndEvt__WBP_HUD_BuildingGridCorner_ModeTabs_K2Node_ComponentBoundEvent_0_ContentPanelStateDelegateSignature__DelegateSignature) == 0x000008, "Wrong alignment on WBP_HUD_BuildingGridCorner_C_BndEvt__WBP_HUD_BuildingGridCorner_ModeTabs_K2Node_ComponentBoundEvent_0_ContentPanelStateDelegateSignature__DelegateSignature");
static_assert(sizeof(WBP_HUD_BuildingGridCorner_C_BndEvt__WBP_HUD_BuildingGridCorner_ModeTabs_K2Node_ComponentBoundEvent_0_ContentPanelStateDelegateSignature__DelegateSignature) == 0x000018, "Wrong size on WBP_HUD_BuildingGridCorner_C_BndEvt__WBP_HUD_BuildingGridCorner_ModeTabs_K2Node_ComponentBoundEvent_0_ContentPanelStateDelegateSignature__DelegateSignature");
static_assert(offsetof(WBP_HUD_BuildingGridCorner_C_BndEvt__WBP_HUD_BuildingGridCorner_ModeTabs_K2Node_ComponentBoundEvent_0_ContentPanelStateDelegateSignature__DelegateSignature, InContentPanel) == 0x000000, "Member 'WBP_HUD_BuildingGridCorner_C_BndEvt__WBP_HUD_BuildingGridCorner_ModeTabs_K2Node_ComponentBoundEvent_0_ContentPanelStateDelegateSignature__DelegateSignature::InContentPanel' has a wrong offset!");
static_assert(offsetof(WBP_HUD_BuildingGridCorner_C_BndEvt__WBP_HUD_BuildingGridCorner_ModeTabs_K2Node_ComponentBoundEvent_0_ContentPanelStateDelegateSignature__DelegateSignature, InContentSlot) == 0x000008, "Member 'WBP_HUD_BuildingGridCorner_C_BndEvt__WBP_HUD_BuildingGridCorner_ModeTabs_K2Node_ComponentBoundEvent_0_ContentPanelStateDelegateSignature__DelegateSignature::InContentSlot' has a wrong offset!");
static_assert(offsetof(WBP_HUD_BuildingGridCorner_C_BndEvt__WBP_HUD_BuildingGridCorner_ModeTabs_K2Node_ComponentBoundEvent_0_ContentPanelStateDelegateSignature__DelegateSignature, InState) == 0x000010, "Member 'WBP_HUD_BuildingGridCorner_C_BndEvt__WBP_HUD_BuildingGridCorner_ModeTabs_K2Node_ComponentBoundEvent_0_ContentPanelStateDelegateSignature__DelegateSignature::InState' has a wrong offset!");
static_assert(offsetof(WBP_HUD_BuildingGridCorner_C_BndEvt__WBP_HUD_BuildingGridCorner_ModeTabs_K2Node_ComponentBoundEvent_0_ContentPanelStateDelegateSignature__DelegateSignature, bInActivated) == 0x000011, "Member 'WBP_HUD_BuildingGridCorner_C_BndEvt__WBP_HUD_BuildingGridCorner_ModeTabs_K2Node_ComponentBoundEvent_0_ContentPanelStateDelegateSignature__DelegateSignature::bInActivated' has a wrong offset!");

// Function WBP_HUD_BuildingGridCorner.WBP_HUD_BuildingGridCorner_C.BndEvt__WBP_HUD_BuildingGridCorner_WBP_MoviePlayer_Fill_K2Node_ComponentBoundEvent_1_TedMoviePlayerWidgetEventDelegate__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_HUD_BuildingGridCorner_C_BndEvt__WBP_HUD_BuildingGridCorner_WBP_MoviePlayer_Fill_K2Node_ComponentBoundEvent_1_TedMoviePlayerWidgetEventDelegate__DelegateSignature final
{
public:
	class UTedMoviePlayerWidgetV2*                InWidget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	const class UFileMediaSource*                 InSource;                                          // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_BuildingGridCorner_C_BndEvt__WBP_HUD_BuildingGridCorner_WBP_MoviePlayer_Fill_K2Node_ComponentBoundEvent_1_TedMoviePlayerWidgetEventDelegate__DelegateSignature) == 0x000008, "Wrong alignment on WBP_HUD_BuildingGridCorner_C_BndEvt__WBP_HUD_BuildingGridCorner_WBP_MoviePlayer_Fill_K2Node_ComponentBoundEvent_1_TedMoviePlayerWidgetEventDelegate__DelegateSignature");
static_assert(sizeof(WBP_HUD_BuildingGridCorner_C_BndEvt__WBP_HUD_BuildingGridCorner_WBP_MoviePlayer_Fill_K2Node_ComponentBoundEvent_1_TedMoviePlayerWidgetEventDelegate__DelegateSignature) == 0x000010, "Wrong size on WBP_HUD_BuildingGridCorner_C_BndEvt__WBP_HUD_BuildingGridCorner_WBP_MoviePlayer_Fill_K2Node_ComponentBoundEvent_1_TedMoviePlayerWidgetEventDelegate__DelegateSignature");
static_assert(offsetof(WBP_HUD_BuildingGridCorner_C_BndEvt__WBP_HUD_BuildingGridCorner_WBP_MoviePlayer_Fill_K2Node_ComponentBoundEvent_1_TedMoviePlayerWidgetEventDelegate__DelegateSignature, InWidget) == 0x000000, "Member 'WBP_HUD_BuildingGridCorner_C_BndEvt__WBP_HUD_BuildingGridCorner_WBP_MoviePlayer_Fill_K2Node_ComponentBoundEvent_1_TedMoviePlayerWidgetEventDelegate__DelegateSignature::InWidget' has a wrong offset!");
static_assert(offsetof(WBP_HUD_BuildingGridCorner_C_BndEvt__WBP_HUD_BuildingGridCorner_WBP_MoviePlayer_Fill_K2Node_ComponentBoundEvent_1_TedMoviePlayerWidgetEventDelegate__DelegateSignature, InSource) == 0x000008, "Member 'WBP_HUD_BuildingGridCorner_C_BndEvt__WBP_HUD_BuildingGridCorner_WBP_MoviePlayer_Fill_K2Node_ComponentBoundEvent_1_TedMoviePlayerWidgetEventDelegate__DelegateSignature::InSource' has a wrong offset!");

// Function WBP_HUD_BuildingGridCorner.WBP_HUD_BuildingGridCorner_C.ExecuteUbergraph_WBP_HUD_BuildingGridCorner
// 0x0030 (0x0030 - 0x0000)
struct WBP_HUD_BuildingGridCorner_C_ExecuteUbergraph_WBP_HUD_BuildingGridCorner final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsWithinBuildTab_ReturnValue;             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsWithinDoctrineTab_ReturnValue;          // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UTedMoviePlayerWidgetV2*                K2Node_ComponentBoundEvent_InWidget;               // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	const class UFileMediaSource*                 K2Node_ComponentBoundEvent_InSource;               // 0x0010(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTedContentPanelBase*                   K2Node_ComponentBoundEvent_InContentPanel;         // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UTedContentPanelSlotBase*               K2Node_ComponentBoundEvent_InContentSlot;          // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ETedContentSlotState                          K2Node_ComponentBoundEvent_InState;                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bInActivated;           // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_BuildingGridCorner_C_ExecuteUbergraph_WBP_HUD_BuildingGridCorner) == 0x000008, "Wrong alignment on WBP_HUD_BuildingGridCorner_C_ExecuteUbergraph_WBP_HUD_BuildingGridCorner");
static_assert(sizeof(WBP_HUD_BuildingGridCorner_C_ExecuteUbergraph_WBP_HUD_BuildingGridCorner) == 0x000030, "Wrong size on WBP_HUD_BuildingGridCorner_C_ExecuteUbergraph_WBP_HUD_BuildingGridCorner");
static_assert(offsetof(WBP_HUD_BuildingGridCorner_C_ExecuteUbergraph_WBP_HUD_BuildingGridCorner, EntryPoint) == 0x000000, "Member 'WBP_HUD_BuildingGridCorner_C_ExecuteUbergraph_WBP_HUD_BuildingGridCorner::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_HUD_BuildingGridCorner_C_ExecuteUbergraph_WBP_HUD_BuildingGridCorner, CallFunc_IsWithinBuildTab_ReturnValue) == 0x000004, "Member 'WBP_HUD_BuildingGridCorner_C_ExecuteUbergraph_WBP_HUD_BuildingGridCorner::CallFunc_IsWithinBuildTab_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_BuildingGridCorner_C_ExecuteUbergraph_WBP_HUD_BuildingGridCorner, CallFunc_IsWithinDoctrineTab_ReturnValue) == 0x000005, "Member 'WBP_HUD_BuildingGridCorner_C_ExecuteUbergraph_WBP_HUD_BuildingGridCorner::CallFunc_IsWithinDoctrineTab_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_BuildingGridCorner_C_ExecuteUbergraph_WBP_HUD_BuildingGridCorner, K2Node_ComponentBoundEvent_InWidget) == 0x000008, "Member 'WBP_HUD_BuildingGridCorner_C_ExecuteUbergraph_WBP_HUD_BuildingGridCorner::K2Node_ComponentBoundEvent_InWidget' has a wrong offset!");
static_assert(offsetof(WBP_HUD_BuildingGridCorner_C_ExecuteUbergraph_WBP_HUD_BuildingGridCorner, K2Node_ComponentBoundEvent_InSource) == 0x000010, "Member 'WBP_HUD_BuildingGridCorner_C_ExecuteUbergraph_WBP_HUD_BuildingGridCorner::K2Node_ComponentBoundEvent_InSource' has a wrong offset!");
static_assert(offsetof(WBP_HUD_BuildingGridCorner_C_ExecuteUbergraph_WBP_HUD_BuildingGridCorner, K2Node_ComponentBoundEvent_InContentPanel) == 0x000018, "Member 'WBP_HUD_BuildingGridCorner_C_ExecuteUbergraph_WBP_HUD_BuildingGridCorner::K2Node_ComponentBoundEvent_InContentPanel' has a wrong offset!");
static_assert(offsetof(WBP_HUD_BuildingGridCorner_C_ExecuteUbergraph_WBP_HUD_BuildingGridCorner, K2Node_ComponentBoundEvent_InContentSlot) == 0x000020, "Member 'WBP_HUD_BuildingGridCorner_C_ExecuteUbergraph_WBP_HUD_BuildingGridCorner::K2Node_ComponentBoundEvent_InContentSlot' has a wrong offset!");
static_assert(offsetof(WBP_HUD_BuildingGridCorner_C_ExecuteUbergraph_WBP_HUD_BuildingGridCorner, K2Node_ComponentBoundEvent_InState) == 0x000028, "Member 'WBP_HUD_BuildingGridCorner_C_ExecuteUbergraph_WBP_HUD_BuildingGridCorner::K2Node_ComponentBoundEvent_InState' has a wrong offset!");
static_assert(offsetof(WBP_HUD_BuildingGridCorner_C_ExecuteUbergraph_WBP_HUD_BuildingGridCorner, K2Node_ComponentBoundEvent_bInActivated) == 0x000029, "Member 'WBP_HUD_BuildingGridCorner_C_ExecuteUbergraph_WBP_HUD_BuildingGridCorner::K2Node_ComponentBoundEvent_bInActivated' has a wrong offset!");

// Function WBP_HUD_BuildingGridCorner.WBP_HUD_BuildingGridCorner_C.K2_OnVisibilityChange
// 0x0002 (0x0002 - 0x0000)
struct WBP_HUD_BuildingGridCorner_C_K2_OnVisibilityChange final
{
public:
	ESlateVisibility                              InFrom;                                            // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              InTo;                                              // 0x0001(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_BuildingGridCorner_C_K2_OnVisibilityChange) == 0x000001, "Wrong alignment on WBP_HUD_BuildingGridCorner_C_K2_OnVisibilityChange");
static_assert(sizeof(WBP_HUD_BuildingGridCorner_C_K2_OnVisibilityChange) == 0x000002, "Wrong size on WBP_HUD_BuildingGridCorner_C_K2_OnVisibilityChange");
static_assert(offsetof(WBP_HUD_BuildingGridCorner_C_K2_OnVisibilityChange, InFrom) == 0x000000, "Member 'WBP_HUD_BuildingGridCorner_C_K2_OnVisibilityChange::InFrom' has a wrong offset!");
static_assert(offsetof(WBP_HUD_BuildingGridCorner_C_K2_OnVisibilityChange, InTo) == 0x000001, "Member 'WBP_HUD_BuildingGridCorner_C_K2_OnVisibilityChange::InTo' has a wrong offset!");

// Function WBP_HUD_BuildingGridCorner.WBP_HUD_BuildingGridCorner_C.OnPlayWidgetAnimation
// 0x0068 (0x0068 - 0x0000)
struct WBP_HUD_BuildingGridCorner_C_OnPlayWidgetAnimation final
{
public:
	struct FGameplayTag                           InAnim;                                            // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	struct FTedThemeMovie                         Anim;                                              // 0x0008(0x0050)(Edit, BlueprintVisible)
	bool                                          GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess;   // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_StartThemed_ReturnValue;               // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A[0x6];                                       // 0x005A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_BuildingGridCorner_C_OnPlayWidgetAnimation) == 0x000008, "Wrong alignment on WBP_HUD_BuildingGridCorner_C_OnPlayWidgetAnimation");
static_assert(sizeof(WBP_HUD_BuildingGridCorner_C_OnPlayWidgetAnimation) == 0x000068, "Wrong size on WBP_HUD_BuildingGridCorner_C_OnPlayWidgetAnimation");
static_assert(offsetof(WBP_HUD_BuildingGridCorner_C_OnPlayWidgetAnimation, InAnim) == 0x000000, "Member 'WBP_HUD_BuildingGridCorner_C_OnPlayWidgetAnimation::InAnim' has a wrong offset!");
static_assert(offsetof(WBP_HUD_BuildingGridCorner_C_OnPlayWidgetAnimation, Anim) == 0x000008, "Member 'WBP_HUD_BuildingGridCorner_C_OnPlayWidgetAnimation::Anim' has a wrong offset!");
static_assert(offsetof(WBP_HUD_BuildingGridCorner_C_OnPlayWidgetAnimation, GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess) == 0x000058, "Member 'WBP_HUD_BuildingGridCorner_C_OnPlayWidgetAnimation::GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_HUD_BuildingGridCorner_C_OnPlayWidgetAnimation, CallFunc_K2_StartThemed_ReturnValue) == 0x000059, "Member 'WBP_HUD_BuildingGridCorner_C_OnPlayWidgetAnimation::CallFunc_K2_StartThemed_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_BuildingGridCorner_C_OnPlayWidgetAnimation, CallFunc_PlayAnimationForward_ReturnValue) == 0x000060, "Member 'WBP_HUD_BuildingGridCorner_C_OnPlayWidgetAnimation::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");

// Function WBP_HUD_BuildingGridCorner.WBP_HUD_BuildingGridCorner_C.RefreshVisibility
// 0x0003 (0x0003 - 0x0000)
struct WBP_HUD_BuildingGridCorner_C_RefreshVisibility final
{
public:
	bool                                          CallFunc_IsStartupSequenceFinished_ReturnValue;    // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_BuildingGridCorner_C_RefreshVisibility) == 0x000001, "Wrong alignment on WBP_HUD_BuildingGridCorner_C_RefreshVisibility");
static_assert(sizeof(WBP_HUD_BuildingGridCorner_C_RefreshVisibility) == 0x000003, "Wrong size on WBP_HUD_BuildingGridCorner_C_RefreshVisibility");
static_assert(offsetof(WBP_HUD_BuildingGridCorner_C_RefreshVisibility, CallFunc_IsStartupSequenceFinished_ReturnValue) == 0x000000, "Member 'WBP_HUD_BuildingGridCorner_C_RefreshVisibility::CallFunc_IsStartupSequenceFinished_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_BuildingGridCorner_C_RefreshVisibility, CallFunc_IsVisible_ReturnValue) == 0x000001, "Member 'WBP_HUD_BuildingGridCorner_C_RefreshVisibility::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_BuildingGridCorner_C_RefreshVisibility, CallFunc_BooleanAND_ReturnValue) == 0x000002, "Member 'WBP_HUD_BuildingGridCorner_C_RefreshVisibility::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function WBP_HUD_BuildingGridCorner.WBP_HUD_BuildingGridCorner_C.OnCanPlayWidgetAnimation
// 0x000C (0x000C - 0x0000)
struct WBP_HUD_BuildingGridCorner_C_OnCanPlayWidgetAnimation final
{
public:
	struct FGameplayTag                           InAnim;                                            // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue;       // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_BuildingGridCorner_C_OnCanPlayWidgetAnimation) == 0x000004, "Wrong alignment on WBP_HUD_BuildingGridCorner_C_OnCanPlayWidgetAnimation");
static_assert(sizeof(WBP_HUD_BuildingGridCorner_C_OnCanPlayWidgetAnimation) == 0x00000C, "Wrong size on WBP_HUD_BuildingGridCorner_C_OnCanPlayWidgetAnimation");
static_assert(offsetof(WBP_HUD_BuildingGridCorner_C_OnCanPlayWidgetAnimation, InAnim) == 0x000000, "Member 'WBP_HUD_BuildingGridCorner_C_OnCanPlayWidgetAnimation::InAnim' has a wrong offset!");
static_assert(offsetof(WBP_HUD_BuildingGridCorner_C_OnCanPlayWidgetAnimation, ReturnValue) == 0x000008, "Member 'WBP_HUD_BuildingGridCorner_C_OnCanPlayWidgetAnimation::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_BuildingGridCorner_C_OnCanPlayWidgetAnimation, CallFunc_IsVisible_ReturnValue) == 0x000009, "Member 'WBP_HUD_BuildingGridCorner_C_OnCanPlayWidgetAnimation::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_BuildingGridCorner_C_OnCanPlayWidgetAnimation, CallFunc_EqualEqual_GameplayTag_ReturnValue) == 0x00000A, "Member 'WBP_HUD_BuildingGridCorner_C_OnCanPlayWidgetAnimation::CallFunc_EqualEqual_GameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_BuildingGridCorner_C_OnCanPlayWidgetAnimation, CallFunc_BooleanAND_ReturnValue) == 0x00000B, "Member 'WBP_HUD_BuildingGridCorner_C_OnCanPlayWidgetAnimation::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function WBP_HUD_BuildingGridCorner.WBP_HUD_BuildingGridCorner_C.OnPaint
// 0x0088 (0x0088 - 0x0000)
struct WBP_HUD_BuildingGridCorner_C_OnPaint final
{
public:
	struct FPaintContext                          Context;                                           // 0x0000(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
	struct FLinearColor                           LocalLineColor;                                    // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTedContentPanelSlotBase*               LocalSelectedFactory;                              // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UTedContentPanelSlotBase*               LocalSeslectedTab;                                 // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRenderOpacity_ReturnValue;             // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_MakeColor_ReturnValue;                    // 0x0054(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsWithinDoctrineTab_ReturnValue;          // 0x0065(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_66[0x2];                                       // 0x0066(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UTedContentPanelSlotBase*               CallFunc_GetContentSlotByState_ReturnValue;        // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsWithinBuildTab_ReturnValue;             // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTedContentPanelSlotBase*               CallFunc_GetContentSlotByState_ReturnValue_1;      // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_BuildingGridCorner_C_OnPaint) == 0x000008, "Wrong alignment on WBP_HUD_BuildingGridCorner_C_OnPaint");
static_assert(sizeof(WBP_HUD_BuildingGridCorner_C_OnPaint) == 0x000088, "Wrong size on WBP_HUD_BuildingGridCorner_C_OnPaint");
static_assert(offsetof(WBP_HUD_BuildingGridCorner_C_OnPaint, Context) == 0x000000, "Member 'WBP_HUD_BuildingGridCorner_C_OnPaint::Context' has a wrong offset!");
static_assert(offsetof(WBP_HUD_BuildingGridCorner_C_OnPaint, LocalLineColor) == 0x000030, "Member 'WBP_HUD_BuildingGridCorner_C_OnPaint::LocalLineColor' has a wrong offset!");
static_assert(offsetof(WBP_HUD_BuildingGridCorner_C_OnPaint, LocalSelectedFactory) == 0x000040, "Member 'WBP_HUD_BuildingGridCorner_C_OnPaint::LocalSelectedFactory' has a wrong offset!");
static_assert(offsetof(WBP_HUD_BuildingGridCorner_C_OnPaint, LocalSeslectedTab) == 0x000048, "Member 'WBP_HUD_BuildingGridCorner_C_OnPaint::LocalSeslectedTab' has a wrong offset!");
static_assert(offsetof(WBP_HUD_BuildingGridCorner_C_OnPaint, CallFunc_GetRenderOpacity_ReturnValue) == 0x000050, "Member 'WBP_HUD_BuildingGridCorner_C_OnPaint::CallFunc_GetRenderOpacity_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_BuildingGridCorner_C_OnPaint, CallFunc_MakeColor_ReturnValue) == 0x000054, "Member 'WBP_HUD_BuildingGridCorner_C_OnPaint::CallFunc_MakeColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_BuildingGridCorner_C_OnPaint, CallFunc_IsValid_ReturnValue) == 0x000064, "Member 'WBP_HUD_BuildingGridCorner_C_OnPaint::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_BuildingGridCorner_C_OnPaint, CallFunc_IsWithinDoctrineTab_ReturnValue) == 0x000065, "Member 'WBP_HUD_BuildingGridCorner_C_OnPaint::CallFunc_IsWithinDoctrineTab_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_BuildingGridCorner_C_OnPaint, CallFunc_GetContentSlotByState_ReturnValue) == 0x000068, "Member 'WBP_HUD_BuildingGridCorner_C_OnPaint::CallFunc_GetContentSlotByState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_BuildingGridCorner_C_OnPaint, CallFunc_IsWithinBuildTab_ReturnValue) == 0x000070, "Member 'WBP_HUD_BuildingGridCorner_C_OnPaint::CallFunc_IsWithinBuildTab_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_BuildingGridCorner_C_OnPaint, CallFunc_GetContentSlotByState_ReturnValue_1) == 0x000078, "Member 'WBP_HUD_BuildingGridCorner_C_OnPaint::CallFunc_GetContentSlotByState_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_HUD_BuildingGridCorner_C_OnPaint, CallFunc_IsValid_ReturnValue_1) == 0x000080, "Member 'WBP_HUD_BuildingGridCorner_C_OnPaint::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function WBP_HUD_BuildingGridCorner.WBP_HUD_BuildingGridCorner_C.PaintConnection
// 0x0318 (0x0318 - 0x0000)
struct WBP_HUD_BuildingGridCorner_C_PaintConnection final
{
public:
	struct FPaintContext                          InPaintContext;                                    // 0x0000(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
	class UWidget*                                InWidgetA;                                         // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                InWidgetB;                                         // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        InMinDiffForSpline;                                // 0x0040(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           InTint;                                            // 0x0048(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        InThickness;                                       // 0x0058(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              InPosMul_A;                                        // 0x0060(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              InPosOffset_A;                                     // 0x0070(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              InPosMul_B;                                        // 0x0080(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              InPosOffset_B;                                     // 0x0090(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              LocalPos_MidPoint_B;                               // 0x00A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              LocalPos_MidPoint_A;                               // 0x00B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              LocalPos_B;                                        // 0x00C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              LocalPos_A;                                        // 0x00D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X;                          // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector2D_X_1;                        // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y_1;                        // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Subtract_Vector2DVector2D_ReturnValue;    // 0x0108(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0118(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Multiply_Vector2DVector2D_ReturnValue;    // 0x0128(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue;         // 0x0138(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Subtract_Vector2DVector2D_ReturnValue_1;  // 0x0148(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              CallFunc_GetCachedGeometry_ReturnValue;            // 0x0158(0x0038)(ConstParm, IsPlainOldData, NoDestructor)
	double                                        CallFunc_BreakVector2D_X_2;                        // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y_2;                        // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetLocalSize_ReturnValue;                 // 0x01A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Abs_ReturnValue;                          // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Multiply_Vector2DVector2D_ReturnValue_1;  // 0x01B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C9[0x7];                                      // 0x01C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue_1;       // 0x01D0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E1[0x7];                                      // 0x01E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_LocalToAbsolute_ReturnValue;              // 0x01E8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              CallFunc_GetCachedGeometry_ReturnValue_1;          // 0x01F8(0x0038)(ConstParm, IsPlainOldData, NoDestructor)
	struct FVector2D                              CallFunc_GetLocalSize_ReturnValue_1;               // 0x0230(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Multiply_Vector2DVector2D_ReturnValue_2;  // 0x0240(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue_2;       // 0x0250(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_261[0x7];                                      // 0x0261(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_LocalToAbsolute_ReturnValue_1;            // 0x0268(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_279[0x7];                                      // 0x0279(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x0288(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_2;               // 0x0298(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              CallFunc_GetCachedGeometry_ReturnValue_2;          // 0x02A8(0x0038)(ConstParm, IsPlainOldData, NoDestructor)
	struct FVector2D                              CallFunc_AbsoluteToLocal_ReturnValue;              // 0x02E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_AbsoluteToLocal_ReturnValue_1;            // 0x02F0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_DrawLine_Thickness_ImplicitCast;          // 0x0300(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_DrawLine_Thickness_ImplicitCast_1;        // 0x0304(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_DrawLine_Thickness_ImplicitCast_2;        // 0x0308(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_DrawLine_Thickness_ImplicitCast_3;        // 0x030C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PaintSpline_InThickness_ImplicitCast;     // 0x0310(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_BuildingGridCorner_C_PaintConnection) == 0x000008, "Wrong alignment on WBP_HUD_BuildingGridCorner_C_PaintConnection");
static_assert(sizeof(WBP_HUD_BuildingGridCorner_C_PaintConnection) == 0x000318, "Wrong size on WBP_HUD_BuildingGridCorner_C_PaintConnection");
static_assert(offsetof(WBP_HUD_BuildingGridCorner_C_PaintConnection, InPaintContext) == 0x000000, "Member 'WBP_HUD_BuildingGridCorner_C_PaintConnection::InPaintContext' has a wrong offset!");
static_assert(offsetof(WBP_HUD_BuildingGridCorner_C_PaintConnection, InWidgetA) == 0x000030, "Member 'WBP_HUD_BuildingGridCorner_C_PaintConnection::InWidgetA' has a wrong offset!");
static_assert(offsetof(WBP_HUD_BuildingGridCorner_C_PaintConnection, InWidgetB) == 0x000038, "Member 'WBP_HUD_BuildingGridCorner_C_PaintConnection::InWidgetB' has a wrong offset!");
