#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_HUD_BuildingGrid_FactoryTypes_Slot

#include "Basic.hpp"

#include "Tempest_structs.hpp"
#include "UMG_structs.hpp"
#include "InputCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_HUD_BuildingGrid_FactoryTypes_Slot.WBP_HUD_BuildingGrid_FactoryTypes_Slot_C.ExecuteUbergraph_WBP_HUD_BuildingGrid_FactoryTypes_Slot
// 0x0048 (0x0048 - 0x0000)
struct WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_ExecuteUbergraph_WBP_HUD_BuildingGrid_FactoryTypes_Slot final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETedContentSlotState                          K2Node_Event_InState;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInActivated;                         // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetContent_ReturnValue;                   // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTedBuildingGridFactoryTypesPanelContent CallFunc_GetContent_OutContent;                  // 0x0008(0x0038)()
	ETedContentSlotAction                         K2Node_Event_InAction;                             // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_ExecuteUbergraph_WBP_HUD_BuildingGrid_FactoryTypes_Slot) == 0x000008, "Wrong alignment on WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_ExecuteUbergraph_WBP_HUD_BuildingGrid_FactoryTypes_Slot");
static_assert(sizeof(WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_ExecuteUbergraph_WBP_HUD_BuildingGrid_FactoryTypes_Slot) == 0x000048, "Wrong size on WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_ExecuteUbergraph_WBP_HUD_BuildingGrid_FactoryTypes_Slot");
static_assert(offsetof(WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_ExecuteUbergraph_WBP_HUD_BuildingGrid_FactoryTypes_Slot, EntryPoint) == 0x000000, "Member 'WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_ExecuteUbergraph_WBP_HUD_BuildingGrid_FactoryTypes_Slot::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_ExecuteUbergraph_WBP_HUD_BuildingGrid_FactoryTypes_Slot, K2Node_Event_InState) == 0x000004, "Member 'WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_ExecuteUbergraph_WBP_HUD_BuildingGrid_FactoryTypes_Slot::K2Node_Event_InState' has a wrong offset!");
static_assert(offsetof(WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_ExecuteUbergraph_WBP_HUD_BuildingGrid_FactoryTypes_Slot, K2Node_Event_bInActivated) == 0x000005, "Member 'WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_ExecuteUbergraph_WBP_HUD_BuildingGrid_FactoryTypes_Slot::K2Node_Event_bInActivated' has a wrong offset!");
static_assert(offsetof(WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_ExecuteUbergraph_WBP_HUD_BuildingGrid_FactoryTypes_Slot, K2Node_SwitchEnum_CmpSuccess) == 0x000006, "Member 'WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_ExecuteUbergraph_WBP_HUD_BuildingGrid_FactoryTypes_Slot::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_ExecuteUbergraph_WBP_HUD_BuildingGrid_FactoryTypes_Slot, CallFunc_GetContent_ReturnValue) == 0x000007, "Member 'WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_ExecuteUbergraph_WBP_HUD_BuildingGrid_FactoryTypes_Slot::CallFunc_GetContent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_ExecuteUbergraph_WBP_HUD_BuildingGrid_FactoryTypes_Slot, CallFunc_GetContent_OutContent) == 0x000008, "Member 'WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_ExecuteUbergraph_WBP_HUD_BuildingGrid_FactoryTypes_Slot::CallFunc_GetContent_OutContent' has a wrong offset!");
static_assert(offsetof(WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_ExecuteUbergraph_WBP_HUD_BuildingGrid_FactoryTypes_Slot, K2Node_Event_InAction) == 0x000040, "Member 'WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_ExecuteUbergraph_WBP_HUD_BuildingGrid_FactoryTypes_Slot::K2Node_Event_InAction' has a wrong offset!");
static_assert(offsetof(WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_ExecuteUbergraph_WBP_HUD_BuildingGrid_FactoryTypes_Slot, K2Node_SwitchEnum_CmpSuccess_1) == 0x000041, "Member 'WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_ExecuteUbergraph_WBP_HUD_BuildingGrid_FactoryTypes_Slot::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");

// Function WBP_HUD_BuildingGrid_FactoryTypes_Slot.WBP_HUD_BuildingGrid_FactoryTypes_Slot_C.OnActivateState
// 0x0002 (0x0002 - 0x0000)
struct WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_OnActivateState final
{
public:
	ETedContentSlotState                          InState;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bInActivated;                                      // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_OnActivateState) == 0x000001, "Wrong alignment on WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_OnActivateState");
static_assert(sizeof(WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_OnActivateState) == 0x000002, "Wrong size on WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_OnActivateState");
static_assert(offsetof(WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_OnActivateState, InState) == 0x000000, "Member 'WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_OnActivateState::InState' has a wrong offset!");
static_assert(offsetof(WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_OnActivateState, bInActivated) == 0x000001, "Member 'WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_OnActivateState::bInActivated' has a wrong offset!");

// Function WBP_HUD_BuildingGrid_FactoryTypes_Slot.WBP_HUD_BuildingGrid_FactoryTypes_Slot_C.OnRefreshControlMappings
// 0x0040 (0x0040 - 0x0000)
struct WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_OnRefreshControlMappings final
{
public:
	bool                                          CallFunc_GetContent_ReturnValue;                   // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTedBuildingGridFactoryTypesPanelContent CallFunc_GetContent_OutContent;                  // 0x0008(0x0038)()
};
static_assert(alignof(WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_OnRefreshControlMappings) == 0x000008, "Wrong alignment on WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_OnRefreshControlMappings");
static_assert(sizeof(WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_OnRefreshControlMappings) == 0x000040, "Wrong size on WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_OnRefreshControlMappings");
static_assert(offsetof(WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_OnRefreshControlMappings, CallFunc_GetContent_ReturnValue) == 0x000000, "Member 'WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_OnRefreshControlMappings::CallFunc_GetContent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_OnRefreshControlMappings, CallFunc_GetContent_OutContent) == 0x000008, "Member 'WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_OnRefreshControlMappings::CallFunc_GetContent_OutContent' has a wrong offset!");

// Function WBP_HUD_BuildingGrid_FactoryTypes_Slot.WBP_HUD_BuildingGrid_FactoryTypes_Slot_C.OnTriggerAction
// 0x0001 (0x0001 - 0x0000)
struct WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_OnTriggerAction final
{
public:
	ETedContentSlotAction                         InAction;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_OnTriggerAction) == 0x000001, "Wrong alignment on WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_OnTriggerAction");
static_assert(sizeof(WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_OnTriggerAction) == 0x000001, "Wrong size on WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_OnTriggerAction");
static_assert(offsetof(WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_OnTriggerAction, InAction) == 0x000000, "Member 'WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_OnTriggerAction::InAction' has a wrong offset!");

// Function WBP_HUD_BuildingGrid_FactoryTypes_Slot.WBP_HUD_BuildingGrid_FactoryTypes_Slot_C.RefreshStateUI
// 0x0048 (0x0048 - 0x0000)
struct WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_RefreshStateUI final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable;                                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1;                              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsStateActive_ReturnValue;                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x0020(0x0010)()
	bool                                          CallFunc_IsStateActive_ReturnValue_1;              // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33[0x5];                                       // 0x0033(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_Select_Default;                             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetRenderOpacity_InOpacity_ImplicitCast;  // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_RefreshStateUI) == 0x000008, "Wrong alignment on WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_RefreshStateUI");
static_assert(sizeof(WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_RefreshStateUI) == 0x000048, "Wrong size on WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_RefreshStateUI");
static_assert(offsetof(WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_RefreshStateUI, Temp_bool_Variable) == 0x000000, "Member 'WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_RefreshStateUI::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_RefreshStateUI, Temp_byte_Variable) == 0x000001, "Member 'WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_RefreshStateUI::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_RefreshStateUI, Temp_byte_Variable_1) == 0x000002, "Member 'WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_RefreshStateUI::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_RefreshStateUI, Temp_bool_Variable_1) == 0x000003, "Member 'WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_RefreshStateUI::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_RefreshStateUI, Temp_real_Variable) == 0x000008, "Member 'WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_RefreshStateUI::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_RefreshStateUI, Temp_real_Variable_1) == 0x000010, "Member 'WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_RefreshStateUI::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_RefreshStateUI, CallFunc_IsStateActive_ReturnValue) == 0x000018, "Member 'WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_RefreshStateUI::CallFunc_IsStateActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_RefreshStateUI, CallFunc_GetText_ReturnValue) == 0x000020, "Member 'WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_RefreshStateUI::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_RefreshStateUI, CallFunc_IsStateActive_ReturnValue_1) == 0x000030, "Member 'WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_RefreshStateUI::CallFunc_IsStateActive_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_RefreshStateUI, CallFunc_TextIsEmpty_ReturnValue) == 0x000031, "Member 'WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_RefreshStateUI::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_RefreshStateUI, CallFunc_BooleanOR_ReturnValue) == 0x000032, "Member 'WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_RefreshStateUI::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_RefreshStateUI, K2Node_Select_Default) == 0x000038, "Member 'WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_RefreshStateUI::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_RefreshStateUI, K2Node_Select_Default_1) == 0x000040, "Member 'WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_RefreshStateUI::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_RefreshStateUI, CallFunc_SetRenderOpacity_InOpacity_ImplicitCast) == 0x000044, "Member 'WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_RefreshStateUI::CallFunc_SetRenderOpacity_InOpacity_ImplicitCast' has a wrong offset!");

// Function WBP_HUD_BuildingGrid_FactoryTypes_Slot.WBP_HUD_BuildingGrid_FactoryTypes_Slot_C.SetupIcon
// 0x0018 (0x0018 - 0x0000)
struct WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_SetupIcon final
{
public:
	class UTexture2DArray*                        InIcon;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_SetupIcon) == 0x000008, "Wrong alignment on WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_SetupIcon");
static_assert(sizeof(WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_SetupIcon) == 0x000018, "Wrong size on WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_SetupIcon");
static_assert(offsetof(WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_SetupIcon, InIcon) == 0x000000, "Member 'WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_SetupIcon::InIcon' has a wrong offset!");
static_assert(offsetof(WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_SetupIcon, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_SetupIcon::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_SetupIcon, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000010, "Member 'WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_SetupIcon::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");

// Function WBP_HUD_BuildingGrid_FactoryTypes_Slot.WBP_HUD_BuildingGrid_FactoryTypes_Slot_C.SetupShortcut
// 0x0058 (0x0058 - 0x0000)
struct WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_SetupShortcut final
{
public:
	class FName                                   InShortcut;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B[0x5];                                        // 0x000B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ULocalPlayer*                           CallFunc_GetOwningLocalPlayer_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsStateActive_ReturnValue;                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   CallFunc_GetInputMappingKey_ReturnValue;           // 0x0020(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetKeyDisplayText_ReturnValue;            // 0x0040(0x0010)()
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0053(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_SetupShortcut) == 0x000008, "Wrong alignment on WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_SetupShortcut");
static_assert(sizeof(WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_SetupShortcut) == 0x000058, "Wrong size on WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_SetupShortcut");
static_assert(offsetof(WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_SetupShortcut, InShortcut) == 0x000000, "Member 'WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_SetupShortcut::InShortcut' has a wrong offset!");
static_assert(offsetof(WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_SetupShortcut, Temp_bool_Variable) == 0x000008, "Member 'WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_SetupShortcut::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_SetupShortcut, Temp_byte_Variable) == 0x000009, "Member 'WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_SetupShortcut::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_SetupShortcut, Temp_byte_Variable_1) == 0x00000A, "Member 'WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_SetupShortcut::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_SetupShortcut, CallFunc_GetOwningLocalPlayer_ReturnValue) == 0x000010, "Member 'WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_SetupShortcut::CallFunc_GetOwningLocalPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_SetupShortcut, CallFunc_IsStateActive_ReturnValue) == 0x000018, "Member 'WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_SetupShortcut::CallFunc_IsStateActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_SetupShortcut, CallFunc_GetInputMappingKey_ReturnValue) == 0x000020, "Member 'WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_SetupShortcut::CallFunc_GetInputMappingKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_SetupShortcut, CallFunc_Not_PreBool_ReturnValue) == 0x000038, "Member 'WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_SetupShortcut::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_SetupShortcut, CallFunc_GetKeyDisplayText_ReturnValue) == 0x000040, "Member 'WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_SetupShortcut::CallFunc_GetKeyDisplayText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_SetupShortcut, CallFunc_TextIsEmpty_ReturnValue) == 0x000050, "Member 'WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_SetupShortcut::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_SetupShortcut, CallFunc_Not_PreBool_ReturnValue_1) == 0x000051, "Member 'WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_SetupShortcut::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_SetupShortcut, CallFunc_BooleanAND_ReturnValue) == 0x000052, "Member 'WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_SetupShortcut::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_SetupShortcut, K2Node_Select_Default) == 0x000053, "Member 'WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_SetupShortcut::K2Node_Select_Default' has a wrong offset!");

// Function WBP_HUD_BuildingGrid_FactoryTypes_Slot.WBP_HUD_BuildingGrid_FactoryTypes_Slot_C.SetupText
// 0x0018 (0x0018 - 0x0000)
struct WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_SetupText final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_SetupText) == 0x000008, "Wrong alignment on WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_SetupText");
static_assert(sizeof(WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_SetupText) == 0x000018, "Wrong size on WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_SetupText");
static_assert(offsetof(WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_SetupText, InText) == 0x000000, "Member 'WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_SetupText::InText' has a wrong offset!");
static_assert(offsetof(WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_SetupText, Temp_bool_Variable) == 0x000010, "Member 'WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_SetupText::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_SetupText, CallFunc_TextIsEmpty_ReturnValue) == 0x000011, "Member 'WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_SetupText::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_SetupText, Temp_byte_Variable) == 0x000012, "Member 'WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_SetupText::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_SetupText, Temp_byte_Variable_1) == 0x000013, "Member 'WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_SetupText::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_SetupText, K2Node_Select_Default) == 0x000014, "Member 'WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_SetupText::K2Node_Select_Default' has a wrong offset!");

// Function WBP_HUD_BuildingGrid_FactoryTypes_Slot.WBP_HUD_BuildingGrid_FactoryTypes_Slot_C.GetContent
// 0x0098 (0x0098 - 0x0000)
struct WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_GetContent final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTedBuildingGridFactoryTypesPanelContent OutContent;                                      // 0x0008(0x0038)(Parm, OutParm)
	class UTedContentPanelBase*                   CallFunc_GetParentContentPanel_ReturnValue;        // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UTedBuildingGridFactoryTypesPanel*      K2Node_DynamicCast_AsTed_Building_Grid_Factory_Types_Panel; // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetSlotIndex_ReturnValue;                 // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTedBuildingGridFactoryTypesPanelContent CallFunc_GetContent_OutContent;                  // 0x0058(0x0038)()
	bool                                          CallFunc_GetContent_ReturnValue;                   // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_GetContent) == 0x000008, "Wrong alignment on WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_GetContent");
static_assert(sizeof(WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_GetContent) == 0x000098, "Wrong size on WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_GetContent");
static_assert(offsetof(WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_GetContent, ReturnValue) == 0x000000, "Member 'WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_GetContent::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_GetContent, OutContent) == 0x000008, "Member 'WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_GetContent::OutContent' has a wrong offset!");
static_assert(offsetof(WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_GetContent, CallFunc_GetParentContentPanel_ReturnValue) == 0x000040, "Member 'WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_GetContent::CallFunc_GetParentContentPanel_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_GetContent, K2Node_DynamicCast_AsTed_Building_Grid_Factory_Types_Panel) == 0x000048, "Member 'WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_GetContent::K2Node_DynamicCast_AsTed_Building_Grid_Factory_Types_Panel' has a wrong offset!");
static_assert(offsetof(WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_GetContent, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_GetContent::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_GetContent, CallFunc_GetSlotIndex_ReturnValue) == 0x000054, "Member 'WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_GetContent::CallFunc_GetSlotIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_GetContent, CallFunc_GetContent_OutContent) == 0x000058, "Member 'WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_GetContent::CallFunc_GetContent_OutContent' has a wrong offset!");
static_assert(offsetof(WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_GetContent, CallFunc_GetContent_ReturnValue) == 0x000090, "Member 'WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_GetContent::CallFunc_GetContent_ReturnValue' has a wrong offset!");

// Function WBP_HUD_BuildingGrid_FactoryTypes_Slot.WBP_HUD_BuildingGrid_FactoryTypes_Slot_C.GetMaterialsSupportingStates
// 0x0030 (0x0030 - 0x0000)
struct WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_GetMaterialsSupportingStates final
{
public:
	TArray<class UMaterialInstanceDynamic*>       OutMIDs;                                           // 0x0000(0x0010)(Parm, OutParm)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UMaterialInstanceDynamic*>       K2Node_MakeArray_Array;                            // 0x0020(0x0010)(ReferenceParm)
};
static_assert(alignof(WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_GetMaterialsSupportingStates) == 0x000008, "Wrong alignment on WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_GetMaterialsSupportingStates");
static_assert(sizeof(WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_GetMaterialsSupportingStates) == 0x000030, "Wrong size on WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_GetMaterialsSupportingStates");
static_assert(offsetof(WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_GetMaterialsSupportingStates, OutMIDs) == 0x000000, "Member 'WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_GetMaterialsSupportingStates::OutMIDs' has a wrong offset!");
static_assert(offsetof(WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_GetMaterialsSupportingStates, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000010, "Member 'WBP_HUD_BuildingGrid_FactoryTypes_Slot_C_GetMaterialsSupportingStates::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
