#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MedalsScreen

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Tempest_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_MedalsScreen.WBP_MedalsScreen_C.ExecuteUbergraph_WBP_MedalsScreen
// 0x0230 (0x0230 - 0x0000)
struct WBP_MedalsScreen_C_ExecuteUbergraph_WBP_MedalsScreen final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetEffectMaterial_ReturnValue;            // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_NewMedalIndex_1;                      // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTedMedalTableRow                      K2Node_Event_DataRow_1;                            // 0x0040(0x0020)(ConstParm)
	bool                                          K2Node_Event_bIsLastMedal_1;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_NewMedalIndex;                        // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTedMedalTableRow                      K2Node_Event_DataRow;                              // 0x0068(0x0020)(ConstParm)
	bool                                          K2Node_Event_bIsLastMedal;                         // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_1;           // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_2;           // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetEffectMaterial_ReturnValue_1;          // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetEffectMaterial_ReturnValue_2;          // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class UObject*                          K2Node_Event_InContext;                            // 0x00B0(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInInstant;                           // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             CallFunc_GetFirstMedalOfType_ReturnValue;          // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             CallFunc_GetFirstMedalOfType_ReturnValue_1;        // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class UTedMapInfo*                      CallFunc_K2_GetCurrentMapInfo_ReturnValue;         // 0x00D0(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class UTedMapInfo*                      CallFunc_K2_GetCurrentMapInfo_ReturnValue_1;       // 0x00D8(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_3;           // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetAmountOfSecondaryObjectives_ReturnValue; // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetAmountOfMainObjectives_ReturnValue;    // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FD[0x3];                                       // 0x00FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetRuntimeObjectivesAmountByState_ReturnValue; // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetRuntimeObjectivesAmountByState_ReturnValue_1; // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_4;           // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_5;           // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_6;           // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12C[0x4];                                      // 0x012C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_7;           // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_8;           // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMax_ReturnValue;                         // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_3;              // 0x0158(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetEffectMaterial_ReturnValue_3;          // 0x0160(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_9;           // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_2;        // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_10;          // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_3;        // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_4;        // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FFloor_ReturnValue;                       // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19C[0x4];                                      // 0x019C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_11;          // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_12;          // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_5;        // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_3;      // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMax_ReturnValue_1;                       // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_13;          // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_6;        // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_4;      // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_14;          // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_7;        // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_8;        // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FFloor_ReturnValue_1;                     // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_204[0x4];                                      // 0x0204(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_15;          // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_5;      // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetMedalAnimationTimerDelay_InDelay_ImplicitCast; // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0224(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetMedalAnimationTimerDelay_InDelay_ImplicitCast_1; // 0x0228(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_1; // 0x022C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MedalsScreen_C_ExecuteUbergraph_WBP_MedalsScreen) == 0x000008, "Wrong alignment on WBP_MedalsScreen_C_ExecuteUbergraph_WBP_MedalsScreen");
static_assert(sizeof(WBP_MedalsScreen_C_ExecuteUbergraph_WBP_MedalsScreen) == 0x000230, "Wrong size on WBP_MedalsScreen_C_ExecuteUbergraph_WBP_MedalsScreen");
static_assert(offsetof(WBP_MedalsScreen_C_ExecuteUbergraph_WBP_MedalsScreen, EntryPoint) == 0x000000, "Member 'WBP_MedalsScreen_C_ExecuteUbergraph_WBP_MedalsScreen::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_MedalsScreen_C_ExecuteUbergraph_WBP_MedalsScreen, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000008, "Member 'WBP_MedalsScreen_C_ExecuteUbergraph_WBP_MedalsScreen::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MedalsScreen_C_ExecuteUbergraph_WBP_MedalsScreen, CallFunc_PlayAnimation_ReturnValue) == 0x000010, "Member 'WBP_MedalsScreen_C_ExecuteUbergraph_WBP_MedalsScreen::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MedalsScreen_C_ExecuteUbergraph_WBP_MedalsScreen, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000018, "Member 'WBP_MedalsScreen_C_ExecuteUbergraph_WBP_MedalsScreen::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MedalsScreen_C_ExecuteUbergraph_WBP_MedalsScreen, CallFunc_GetDynamicMaterial_ReturnValue_1) == 0x000020, "Member 'WBP_MedalsScreen_C_ExecuteUbergraph_WBP_MedalsScreen::CallFunc_GetDynamicMaterial_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MedalsScreen_C_ExecuteUbergraph_WBP_MedalsScreen, CallFunc_GetEffectMaterial_ReturnValue) == 0x000028, "Member 'WBP_MedalsScreen_C_ExecuteUbergraph_WBP_MedalsScreen::CallFunc_GetEffectMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MedalsScreen_C_ExecuteUbergraph_WBP_MedalsScreen, CallFunc_PlayAnimation_ReturnValue_1) == 0x000030, "Member 'WBP_MedalsScreen_C_ExecuteUbergraph_WBP_MedalsScreen::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MedalsScreen_C_ExecuteUbergraph_WBP_MedalsScreen, K2Node_Event_NewMedalIndex_1) == 0x000038, "Member 'WBP_MedalsScreen_C_ExecuteUbergraph_WBP_MedalsScreen::K2Node_Event_NewMedalIndex_1' has a wrong offset!");
static_assert(offsetof(WBP_MedalsScreen_C_ExecuteUbergraph_WBP_MedalsScreen, K2Node_Event_DataRow_1) == 0x000040, "Member 'WBP_MedalsScreen_C_ExecuteUbergraph_WBP_MedalsScreen::K2Node_Event_DataRow_1' has a wrong offset!");
static_assert(offsetof(WBP_MedalsScreen_C_ExecuteUbergraph_WBP_MedalsScreen, K2Node_Event_bIsLastMedal_1) == 0x000060, "Member 'WBP_MedalsScreen_C_ExecuteUbergraph_WBP_MedalsScreen::K2Node_Event_bIsLastMedal_1' has a wrong offset!");
static_assert(offsetof(WBP_MedalsScreen_C_ExecuteUbergraph_WBP_MedalsScreen, K2Node_Event_NewMedalIndex) == 0x000064, "Member 'WBP_MedalsScreen_C_ExecuteUbergraph_WBP_MedalsScreen::K2Node_Event_NewMedalIndex' has a wrong offset!");
static_assert(offsetof(WBP_MedalsScreen_C_ExecuteUbergraph_WBP_MedalsScreen, K2Node_Event_DataRow) == 0x000068, "Member 'WBP_MedalsScreen_C_ExecuteUbergraph_WBP_MedalsScreen::K2Node_Event_DataRow' has a wrong offset!");
static_assert(offsetof(WBP_MedalsScreen_C_ExecuteUbergraph_WBP_MedalsScreen, K2Node_Event_bIsLastMedal) == 0x000088, "Member 'WBP_MedalsScreen_C_ExecuteUbergraph_WBP_MedalsScreen::K2Node_Event_bIsLastMedal' has a wrong offset!");
static_assert(offsetof(WBP_MedalsScreen_C_ExecuteUbergraph_WBP_MedalsScreen, CallFunc_Conv_IntToDouble_ReturnValue_1) == 0x000090, "Member 'WBP_MedalsScreen_C_ExecuteUbergraph_WBP_MedalsScreen::CallFunc_Conv_IntToDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MedalsScreen_C_ExecuteUbergraph_WBP_MedalsScreen, CallFunc_Conv_IntToDouble_ReturnValue_2) == 0x000098, "Member 'WBP_MedalsScreen_C_ExecuteUbergraph_WBP_MedalsScreen::CallFunc_Conv_IntToDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_MedalsScreen_C_ExecuteUbergraph_WBP_MedalsScreen, CallFunc_GetEffectMaterial_ReturnValue_1) == 0x0000A0, "Member 'WBP_MedalsScreen_C_ExecuteUbergraph_WBP_MedalsScreen::CallFunc_GetEffectMaterial_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MedalsScreen_C_ExecuteUbergraph_WBP_MedalsScreen, CallFunc_GetEffectMaterial_ReturnValue_2) == 0x0000A8, "Member 'WBP_MedalsScreen_C_ExecuteUbergraph_WBP_MedalsScreen::CallFunc_GetEffectMaterial_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_MedalsScreen_C_ExecuteUbergraph_WBP_MedalsScreen, K2Node_Event_InContext) == 0x0000B0, "Member 'WBP_MedalsScreen_C_ExecuteUbergraph_WBP_MedalsScreen::K2Node_Event_InContext' has a wrong offset!");
static_assert(offsetof(WBP_MedalsScreen_C_ExecuteUbergraph_WBP_MedalsScreen, K2Node_Event_bInInstant) == 0x0000B8, "Member 'WBP_MedalsScreen_C_ExecuteUbergraph_WBP_MedalsScreen::K2Node_Event_bInInstant' has a wrong offset!");
static_assert(offsetof(WBP_MedalsScreen_C_ExecuteUbergraph_WBP_MedalsScreen, CallFunc_GetFirstMedalOfType_ReturnValue) == 0x0000C0, "Member 'WBP_MedalsScreen_C_ExecuteUbergraph_WBP_MedalsScreen::CallFunc_GetFirstMedalOfType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MedalsScreen_C_ExecuteUbergraph_WBP_MedalsScreen, CallFunc_GetFirstMedalOfType_ReturnValue_1) == 0x0000C8, "Member 'WBP_MedalsScreen_C_ExecuteUbergraph_WBP_MedalsScreen::CallFunc_GetFirstMedalOfType_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MedalsScreen_C_ExecuteUbergraph_WBP_MedalsScreen, CallFunc_K2_GetCurrentMapInfo_ReturnValue) == 0x0000D0, "Member 'WBP_MedalsScreen_C_ExecuteUbergraph_WBP_MedalsScreen::CallFunc_K2_GetCurrentMapInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MedalsScreen_C_ExecuteUbergraph_WBP_MedalsScreen, CallFunc_K2_GetCurrentMapInfo_ReturnValue_1) == 0x0000D8, "Member 'WBP_MedalsScreen_C_ExecuteUbergraph_WBP_MedalsScreen::CallFunc_K2_GetCurrentMapInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MedalsScreen_C_ExecuteUbergraph_WBP_MedalsScreen, CallFunc_Conv_IntToDouble_ReturnValue_3) == 0x0000E0, "Member 'WBP_MedalsScreen_C_ExecuteUbergraph_WBP_MedalsScreen::CallFunc_Conv_IntToDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_MedalsScreen_C_ExecuteUbergraph_WBP_MedalsScreen, CallFunc_GetAmountOfSecondaryObjectives_ReturnValue) == 0x0000E8, "Member 'WBP_MedalsScreen_C_ExecuteUbergraph_WBP_MedalsScreen::CallFunc_GetAmountOfSecondaryObjectives_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MedalsScreen_C_ExecuteUbergraph_WBP_MedalsScreen, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x0000F0, "Member 'WBP_MedalsScreen_C_ExecuteUbergraph_WBP_MedalsScreen::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MedalsScreen_C_ExecuteUbergraph_WBP_MedalsScreen, CallFunc_GetAmountOfMainObjectives_ReturnValue) == 0x0000F8, "Member 'WBP_MedalsScreen_C_ExecuteUbergraph_WBP_MedalsScreen::CallFunc_GetAmountOfMainObjectives_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MedalsScreen_C_ExecuteUbergraph_WBP_MedalsScreen, CallFunc_IsValid_ReturnValue) == 0x0000FC, "Member 'WBP_MedalsScreen_C_ExecuteUbergraph_WBP_MedalsScreen::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MedalsScreen_C_ExecuteUbergraph_WBP_MedalsScreen, CallFunc_GetRuntimeObjectivesAmountByState_ReturnValue) == 0x000100, "Member 'WBP_MedalsScreen_C_ExecuteUbergraph_WBP_MedalsScreen::CallFunc_GetRuntimeObjectivesAmountByState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MedalsScreen_C_ExecuteUbergraph_WBP_MedalsScreen, CallFunc_GetRuntimeObjectivesAmountByState_ReturnValue_1) == 0x000104, "Member 'WBP_MedalsScreen_C_ExecuteUbergraph_WBP_MedalsScreen::CallFunc_GetRuntimeObjectivesAmountByState_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MedalsScreen_C_ExecuteUbergraph_WBP_MedalsScreen, CallFunc_Conv_IntToDouble_ReturnValue_4) == 0x000108, "Member 'WBP_MedalsScreen_C_ExecuteUbergraph_WBP_MedalsScreen::CallFunc_Conv_IntToDouble_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_MedalsScreen_C_ExecuteUbergraph_WBP_MedalsScreen, CallFunc_Conv_IntToDouble_ReturnValue_5) == 0x000110, "Member 'WBP_MedalsScreen_C_ExecuteUbergraph_WBP_MedalsScreen::CallFunc_Conv_IntToDouble_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_MedalsScreen_C_ExecuteUbergraph_WBP_MedalsScreen, CallFunc_PlayAnimation_ReturnValue_2) == 0x000118, "Member 'WBP_MedalsScreen_C_ExecuteUbergraph_WBP_MedalsScreen::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_MedalsScreen_C_ExecuteUbergraph_WBP_MedalsScreen, CallFunc_Conv_IntToDouble_ReturnValue_6) == 0x000120, "Member 'WBP_MedalsScreen_C_ExecuteUbergraph_WBP_MedalsScreen::CallFunc_Conv_IntToDouble_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WBP_MedalsScreen_C_ExecuteUbergraph_WBP_MedalsScreen, CallFunc_Add_IntInt_ReturnValue) == 0x000128, "Member 'WBP_MedalsScreen_C_ExecuteUbergraph_WBP_MedalsScreen::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MedalsScreen_C_ExecuteUbergraph_WBP_MedalsScreen, CallFunc_Conv_IntToDouble_ReturnValue_7) == 0x000130, "Member 'WBP_MedalsScreen_C_ExecuteUbergraph_WBP_MedalsScreen::CallFunc_Conv_IntToDouble_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WBP_MedalsScreen_C_ExecuteUbergraph_WBP_MedalsScreen, CallFunc_Conv_IntToDouble_ReturnValue_8) == 0x000138, "Member 'WBP_MedalsScreen_C_ExecuteUbergraph_WBP_MedalsScreen::CallFunc_Conv_IntToDouble_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(WBP_MedalsScreen_C_ExecuteUbergraph_WBP_MedalsScreen, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000140, "Member 'WBP_MedalsScreen_C_ExecuteUbergraph_WBP_MedalsScreen::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MedalsScreen_C_ExecuteUbergraph_WBP_MedalsScreen, CallFunc_Divide_DoubleDouble_ReturnValue_1) == 0x000148, "Member 'WBP_MedalsScreen_C_ExecuteUbergraph_WBP_MedalsScreen::CallFunc_Divide_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MedalsScreen_C_ExecuteUbergraph_WBP_MedalsScreen, CallFunc_FMax_ReturnValue) == 0x000150, "Member 'WBP_MedalsScreen_C_ExecuteUbergraph_WBP_MedalsScreen::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MedalsScreen_C_ExecuteUbergraph_WBP_MedalsScreen, CallFunc_PlayAnimation_ReturnValue_3) == 0x000158, "Member 'WBP_MedalsScreen_C_ExecuteUbergraph_WBP_MedalsScreen::CallFunc_PlayAnimation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_MedalsScreen_C_ExecuteUbergraph_WBP_MedalsScreen, CallFunc_GetEffectMaterial_ReturnValue_3) == 0x000160, "Member 'WBP_MedalsScreen_C_ExecuteUbergraph_WBP_MedalsScreen::CallFunc_GetEffectMaterial_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_MedalsScreen_C_ExecuteUbergraph_WBP_MedalsScreen, CallFunc_Conv_IntToDouble_ReturnValue_9) == 0x000168, "Member 'WBP_MedalsScreen_C_ExecuteUbergraph_WBP_MedalsScreen::CallFunc_Conv_IntToDouble_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(WBP_MedalsScreen_C_ExecuteUbergraph_WBP_MedalsScreen, CallFunc_Divide_DoubleDouble_ReturnValue_2) == 0x000170, "Member 'WBP_MedalsScreen_C_ExecuteUbergraph_WBP_MedalsScreen::CallFunc_Divide_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_MedalsScreen_C_ExecuteUbergraph_WBP_MedalsScreen, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000178, "Member 'WBP_MedalsScreen_C_ExecuteUbergraph_WBP_MedalsScreen::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MedalsScreen_C_ExecuteUbergraph_WBP_MedalsScreen, CallFunc_Conv_IntToDouble_ReturnValue_10) == 0x000180, "Member 'WBP_MedalsScreen_C_ExecuteUbergraph_WBP_MedalsScreen::CallFunc_Conv_IntToDouble_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(WBP_MedalsScreen_C_ExecuteUbergraph_WBP_MedalsScreen, CallFunc_Divide_DoubleDouble_ReturnValue_3) == 0x000188, "Member 'WBP_MedalsScreen_C_ExecuteUbergraph_WBP_MedalsScreen::CallFunc_Divide_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_MedalsScreen_C_ExecuteUbergraph_WBP_MedalsScreen, CallFunc_Divide_DoubleDouble_ReturnValue_4) == 0x000190, "Member 'WBP_MedalsScreen_C_ExecuteUbergraph_WBP_MedalsScreen::CallFunc_Divide_DoubleDouble_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_MedalsScreen_C_ExecuteUbergraph_WBP_MedalsScreen, CallFunc_FFloor_ReturnValue) == 0x000198, "Member 'WBP_MedalsScreen_C_ExecuteUbergraph_WBP_MedalsScreen::CallFunc_FFloor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MedalsScreen_C_ExecuteUbergraph_WBP_MedalsScreen, CallFunc_Conv_IntToDouble_ReturnValue_11) == 0x0001A0, "Member 'WBP_MedalsScreen_C_ExecuteUbergraph_WBP_MedalsScreen::CallFunc_Conv_IntToDouble_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(WBP_MedalsScreen_C_ExecuteUbergraph_WBP_MedalsScreen, CallFunc_Multiply_DoubleDouble_ReturnValue_2) == 0x0001A8, "Member 'WBP_MedalsScreen_C_ExecuteUbergraph_WBP_MedalsScreen::CallFunc_Multiply_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_MedalsScreen_C_ExecuteUbergraph_WBP_MedalsScreen, CallFunc_Conv_IntToDouble_ReturnValue_12) == 0x0001B0, "Member 'WBP_MedalsScreen_C_ExecuteUbergraph_WBP_MedalsScreen::CallFunc_Conv_IntToDouble_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(WBP_MedalsScreen_C_ExecuteUbergraph_WBP_MedalsScreen, CallFunc_Divide_DoubleDouble_ReturnValue_5) == 0x0001B8, "Member 'WBP_MedalsScreen_C_ExecuteUbergraph_WBP_MedalsScreen::CallFunc_Divide_DoubleDouble_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_MedalsScreen_C_ExecuteUbergraph_WBP_MedalsScreen, CallFunc_Multiply_DoubleDouble_ReturnValue_3) == 0x0001C0, "Member 'WBP_MedalsScreen_C_ExecuteUbergraph_WBP_MedalsScreen::CallFunc_Multiply_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_MedalsScreen_C_ExecuteUbergraph_WBP_MedalsScreen, CallFunc_FMax_ReturnValue_1) == 0x0001C8, "Member 'WBP_MedalsScreen_C_ExecuteUbergraph_WBP_MedalsScreen::CallFunc_FMax_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MedalsScreen_C_ExecuteUbergraph_WBP_MedalsScreen, CallFunc_Conv_IntToDouble_ReturnValue_13) == 0x0001D0, "Member 'WBP_MedalsScreen_C_ExecuteUbergraph_WBP_MedalsScreen::CallFunc_Conv_IntToDouble_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(WBP_MedalsScreen_C_ExecuteUbergraph_WBP_MedalsScreen, CallFunc_Divide_DoubleDouble_ReturnValue_6) == 0x0001D8, "Member 'WBP_MedalsScreen_C_ExecuteUbergraph_WBP_MedalsScreen::CallFunc_Divide_DoubleDouble_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WBP_MedalsScreen_C_ExecuteUbergraph_WBP_MedalsScreen, CallFunc_Multiply_DoubleDouble_ReturnValue_4) == 0x0001E0, "Member 'WBP_MedalsScreen_C_ExecuteUbergraph_WBP_MedalsScreen::CallFunc_Multiply_DoubleDouble_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_MedalsScreen_C_ExecuteUbergraph_WBP_MedalsScreen, CallFunc_Conv_IntToDouble_ReturnValue_14) == 0x0001E8, "Member 'WBP_MedalsScreen_C_ExecuteUbergraph_WBP_MedalsScreen::CallFunc_Conv_IntToDouble_ReturnValue_14' has a wrong offset!");
static_assert(offsetof(WBP_MedalsScreen_C_ExecuteUbergraph_WBP_MedalsScreen, CallFunc_Divide_DoubleDouble_ReturnValue_7) == 0x0001F0, "Member 'WBP_MedalsScreen_C_ExecuteUbergraph_WBP_MedalsScreen::CallFunc_Divide_DoubleDouble_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WBP_MedalsScreen_C_ExecuteUbergraph_WBP_MedalsScreen, CallFunc_Divide_DoubleDouble_ReturnValue_8) == 0x0001F8, "Member 'WBP_MedalsScreen_C_ExecuteUbergraph_WBP_MedalsScreen::CallFunc_Divide_DoubleDouble_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(WBP_MedalsScreen_C_ExecuteUbergraph_WBP_MedalsScreen, CallFunc_FFloor_ReturnValue_1) == 0x000200, "Member 'WBP_MedalsScreen_C_ExecuteUbergraph_WBP_MedalsScreen::CallFunc_FFloor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MedalsScreen_C_ExecuteUbergraph_WBP_MedalsScreen, CallFunc_Conv_IntToDouble_ReturnValue_15) == 0x000208, "Member 'WBP_MedalsScreen_C_ExecuteUbergraph_WBP_MedalsScreen::CallFunc_Conv_IntToDouble_ReturnValue_15' has a wrong offset!");
static_assert(offsetof(WBP_MedalsScreen_C_ExecuteUbergraph_WBP_MedalsScreen, CallFunc_Multiply_DoubleDouble_ReturnValue_5) == 0x000210, "Member 'WBP_MedalsScreen_C_ExecuteUbergraph_WBP_MedalsScreen::CallFunc_Multiply_DoubleDouble_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_MedalsScreen_C_ExecuteUbergraph_WBP_MedalsScreen, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000218, "Member 'WBP_MedalsScreen_C_ExecuteUbergraph_WBP_MedalsScreen::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MedalsScreen_C_ExecuteUbergraph_WBP_MedalsScreen, CallFunc_SetMedalAnimationTimerDelay_InDelay_ImplicitCast) == 0x000220, "Member 'WBP_MedalsScreen_C_ExecuteUbergraph_WBP_MedalsScreen::CallFunc_SetMedalAnimationTimerDelay_InDelay_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_MedalsScreen_C_ExecuteUbergraph_WBP_MedalsScreen, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000224, "Member 'WBP_MedalsScreen_C_ExecuteUbergraph_WBP_MedalsScreen::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_MedalsScreen_C_ExecuteUbergraph_WBP_MedalsScreen, CallFunc_SetMedalAnimationTimerDelay_InDelay_ImplicitCast_1) == 0x000228, "Member 'WBP_MedalsScreen_C_ExecuteUbergraph_WBP_MedalsScreen::CallFunc_SetMedalAnimationTimerDelay_InDelay_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(WBP_MedalsScreen_C_ExecuteUbergraph_WBP_MedalsScreen, CallFunc_SetScalarParameterValue_Value_ImplicitCast_1) == 0x00022C, "Member 'WBP_MedalsScreen_C_ExecuteUbergraph_WBP_MedalsScreen::CallFunc_SetScalarParameterValue_Value_ImplicitCast_1' has a wrong offset!");

// Function WBP_MedalsScreen.WBP_MedalsScreen_C.K2_OnSwitchMainMedal
// 0x0030 (0x0030 - 0x0000)
struct WBP_MedalsScreen_C_K2_OnSwitchMainMedal final
{
public:
	int32                                         NewMedalIndex;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTedMedalTableRow                      DataRow;                                           // 0x0008(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          bIsLastMedal;                                      // 0x0028(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MedalsScreen_C_K2_OnSwitchMainMedal) == 0x000008, "Wrong alignment on WBP_MedalsScreen_C_K2_OnSwitchMainMedal");
static_assert(sizeof(WBP_MedalsScreen_C_K2_OnSwitchMainMedal) == 0x000030, "Wrong size on WBP_MedalsScreen_C_K2_OnSwitchMainMedal");
static_assert(offsetof(WBP_MedalsScreen_C_K2_OnSwitchMainMedal, NewMedalIndex) == 0x000000, "Member 'WBP_MedalsScreen_C_K2_OnSwitchMainMedal::NewMedalIndex' has a wrong offset!");
static_assert(offsetof(WBP_MedalsScreen_C_K2_OnSwitchMainMedal, DataRow) == 0x000008, "Member 'WBP_MedalsScreen_C_K2_OnSwitchMainMedal::DataRow' has a wrong offset!");
static_assert(offsetof(WBP_MedalsScreen_C_K2_OnSwitchMainMedal, bIsLastMedal) == 0x000028, "Member 'WBP_MedalsScreen_C_K2_OnSwitchMainMedal::bIsLastMedal' has a wrong offset!");

// Function WBP_MedalsScreen.WBP_MedalsScreen_C.K2_OnSwitchSideMedal
// 0x0030 (0x0030 - 0x0000)
struct WBP_MedalsScreen_C_K2_OnSwitchSideMedal final
{
public:
	int32                                         NewMedalIndex;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTedMedalTableRow                      DataRow;                                           // 0x0008(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          bIsLastMedal;                                      // 0x0028(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MedalsScreen_C_K2_OnSwitchSideMedal) == 0x000008, "Wrong alignment on WBP_MedalsScreen_C_K2_OnSwitchSideMedal");
static_assert(sizeof(WBP_MedalsScreen_C_K2_OnSwitchSideMedal) == 0x000030, "Wrong size on WBP_MedalsScreen_C_K2_OnSwitchSideMedal");
static_assert(offsetof(WBP_MedalsScreen_C_K2_OnSwitchSideMedal, NewMedalIndex) == 0x000000, "Member 'WBP_MedalsScreen_C_K2_OnSwitchSideMedal::NewMedalIndex' has a wrong offset!");
static_assert(offsetof(WBP_MedalsScreen_C_K2_OnSwitchSideMedal, DataRow) == 0x000008, "Member 'WBP_MedalsScreen_C_K2_OnSwitchSideMedal::DataRow' has a wrong offset!");
static_assert(offsetof(WBP_MedalsScreen_C_K2_OnSwitchSideMedal, bIsLastMedal) == 0x000028, "Member 'WBP_MedalsScreen_C_K2_OnSwitchSideMedal::bIsLastMedal' has a wrong offset!");

// Function WBP_MedalsScreen.WBP_MedalsScreen_C.OnOpen
// 0x0010 (0x0010 - 0x0000)
struct WBP_MedalsScreen_C_OnOpen final
{
public:
	const class UObject*                          InContext;                                         // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          bInInstant;                                        // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MedalsScreen_C_OnOpen) == 0x000008, "Wrong alignment on WBP_MedalsScreen_C_OnOpen");
static_assert(sizeof(WBP_MedalsScreen_C_OnOpen) == 0x000010, "Wrong size on WBP_MedalsScreen_C_OnOpen");
static_assert(offsetof(WBP_MedalsScreen_C_OnOpen, InContext) == 0x000000, "Member 'WBP_MedalsScreen_C_OnOpen::InContext' has a wrong offset!");
static_assert(offsetof(WBP_MedalsScreen_C_OnOpen, bInInstant) == 0x000008, "Member 'WBP_MedalsScreen_C_OnOpen::bInInstant' has a wrong offset!");

// Function WBP_MedalsScreen.WBP_MedalsScreen_C.SetFactionForMedals
// 0x0002 (0x0002 - 0x0000)
struct WBP_MedalsScreen_C_SetFactionForMedals final
{
public:
	ETedFaction                                   Faction;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MedalsScreen_C_SetFactionForMedals) == 0x000001, "Wrong alignment on WBP_MedalsScreen_C_SetFactionForMedals");
static_assert(sizeof(WBP_MedalsScreen_C_SetFactionForMedals) == 0x000002, "Wrong size on WBP_MedalsScreen_C_SetFactionForMedals");
static_assert(offsetof(WBP_MedalsScreen_C_SetFactionForMedals, Faction) == 0x000000, "Member 'WBP_MedalsScreen_C_SetFactionForMedals::Faction' has a wrong offset!");
static_assert(offsetof(WBP_MedalsScreen_C_SetFactionForMedals, K2Node_SwitchEnum_CmpSuccess) == 0x000001, "Member 'WBP_MedalsScreen_C_SetFactionForMedals::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function WBP_MedalsScreen.WBP_MedalsScreen_C.UpdateColors
// 0x0048 (0x0048 - 0x0000)
struct WBP_MedalsScreen_C_UpdateColors final
{
public:
	struct FLinearColor                           ColorToUse;                                        // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0014(0x0014)()
	class UMaterialInstanceDynamic*               CallFunc_GetGlowMaterial_ReturnValue;              // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_BoolToDouble_ReturnValue;            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MedalsScreen_C_UpdateColors) == 0x000008, "Wrong alignment on WBP_MedalsScreen_C_UpdateColors");
static_assert(sizeof(WBP_MedalsScreen_C_UpdateColors) == 0x000048, "Wrong size on WBP_MedalsScreen_C_UpdateColors");
static_assert(offsetof(WBP_MedalsScreen_C_UpdateColors, ColorToUse) == 0x000000, "Member 'WBP_MedalsScreen_C_UpdateColors::ColorToUse' has a wrong offset!");
static_assert(offsetof(WBP_MedalsScreen_C_UpdateColors, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'WBP_MedalsScreen_C_UpdateColors::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MedalsScreen_C_UpdateColors, K2Node_MakeStruct_SlateColor) == 0x000014, "Member 'WBP_MedalsScreen_C_UpdateColors::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(WBP_MedalsScreen_C_UpdateColors, CallFunc_GetGlowMaterial_ReturnValue) == 0x000028, "Member 'WBP_MedalsScreen_C_UpdateColors::CallFunc_GetGlowMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MedalsScreen_C_UpdateColors, CallFunc_Conv_BoolToDouble_ReturnValue) == 0x000030, "Member 'WBP_MedalsScreen_C_UpdateColors::CallFunc_Conv_BoolToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MedalsScreen_C_UpdateColors, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000038, "Member 'WBP_MedalsScreen_C_UpdateColors::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MedalsScreen_C_UpdateColors, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000040, "Member 'WBP_MedalsScreen_C_UpdateColors::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");

// Function WBP_MedalsScreen.WBP_MedalsScreen_C.UpdateCompletionBar
// 0x0018 (0x0018 - 0x0000)
struct WBP_MedalsScreen_C_UpdateCompletionBar final
{
public:
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MedalsScreen_C_UpdateCompletionBar) == 0x000008, "Wrong alignment on WBP_MedalsScreen_C_UpdateCompletionBar");
static_assert(sizeof(WBP_MedalsScreen_C_UpdateCompletionBar) == 0x000018, "Wrong size on WBP_MedalsScreen_C_UpdateCompletionBar");
static_assert(offsetof(WBP_MedalsScreen_C_UpdateCompletionBar, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000000, "Member 'WBP_MedalsScreen_C_UpdateCompletionBar::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MedalsScreen_C_UpdateCompletionBar, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000008, "Member 'WBP_MedalsScreen_C_UpdateCompletionBar::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MedalsScreen_C_UpdateCompletionBar, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000010, "Member 'WBP_MedalsScreen_C_UpdateCompletionBar::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");

// Function WBP_MedalsScreen.WBP_MedalsScreen_C.UpdateCompletionText
// 0x0048 (0x0048 - 0x0000)
struct WBP_MedalsScreen_C_UpdateCompletionText final
{
public:
	double                                        Percent;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue;                        // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_AsPercent_Float_ReturnValue;              // 0x0030(0x0010)()
	float                                         CallFunc_AsPercent_Float_Value_ImplicitCast;       // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MedalsScreen_C_UpdateCompletionText) == 0x000008, "Wrong alignment on WBP_MedalsScreen_C_UpdateCompletionText");
static_assert(sizeof(WBP_MedalsScreen_C_UpdateCompletionText) == 0x000048, "Wrong size on WBP_MedalsScreen_C_UpdateCompletionText");
static_assert(offsetof(WBP_MedalsScreen_C_UpdateCompletionText, Percent) == 0x000000, "Member 'WBP_MedalsScreen_C_UpdateCompletionText::Percent' has a wrong offset!");
static_assert(offsetof(WBP_MedalsScreen_C_UpdateCompletionText, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000008, "Member 'WBP_MedalsScreen_C_UpdateCompletionText::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MedalsScreen_C_UpdateCompletionText, CallFunc_Round_ReturnValue) == 0x000010, "Member 'WBP_MedalsScreen_C_UpdateCompletionText::CallFunc_Round_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MedalsScreen_C_UpdateCompletionText, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000018, "Member 'WBP_MedalsScreen_C_UpdateCompletionText::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MedalsScreen_C_UpdateCompletionText, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000020, "Member 'WBP_MedalsScreen_C_UpdateCompletionText::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MedalsScreen_C_UpdateCompletionText, CallFunc_FClamp_ReturnValue) == 0x000028, "Member 'WBP_MedalsScreen_C_UpdateCompletionText::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MedalsScreen_C_UpdateCompletionText, CallFunc_AsPercent_Float_ReturnValue) == 0x000030, "Member 'WBP_MedalsScreen_C_UpdateCompletionText::CallFunc_AsPercent_Float_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MedalsScreen_C_UpdateCompletionText, CallFunc_AsPercent_Float_Value_ImplicitCast) == 0x000040, "Member 'WBP_MedalsScreen_C_UpdateCompletionText::CallFunc_AsPercent_Float_Value_ImplicitCast' has a wrong offset!");

// Function WBP_MedalsScreen.WBP_MedalsScreen_C.UpdateDifficulty
// 0x0020 (0x0020 - 0x0000)
struct WBP_MedalsScreen_C_UpdateDifficulty final
{
public:
	class FText                                   TextToUse;                                         // 0x0000(0x0010)(Edit, BlueprintVisible)
	class UTedGameProgressSubsystem*              CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ETedGameDifficulty                            CallFunc_GetCampaignDifficulty_ReturnValue;        // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MedalsScreen_C_UpdateDifficulty) == 0x000008, "Wrong alignment on WBP_MedalsScreen_C_UpdateDifficulty");
static_assert(sizeof(WBP_MedalsScreen_C_UpdateDifficulty) == 0x000020, "Wrong size on WBP_MedalsScreen_C_UpdateDifficulty");
static_assert(offsetof(WBP_MedalsScreen_C_UpdateDifficulty, TextToUse) == 0x000000, "Member 'WBP_MedalsScreen_C_UpdateDifficulty::TextToUse' has a wrong offset!");
static_assert(offsetof(WBP_MedalsScreen_C_UpdateDifficulty, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000010, "Member 'WBP_MedalsScreen_C_UpdateDifficulty::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MedalsScreen_C_UpdateDifficulty, CallFunc_GetCampaignDifficulty_ReturnValue) == 0x000018, "Member 'WBP_MedalsScreen_C_UpdateDifficulty::CallFunc_GetCampaignDifficulty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MedalsScreen_C_UpdateDifficulty, K2Node_SwitchEnum_CmpSuccess) == 0x000019, "Member 'WBP_MedalsScreen_C_UpdateDifficulty::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function WBP_MedalsScreen.WBP_MedalsScreen_C.UpdateMissionName
// 0x0030 (0x0030 - 0x0000)
struct WBP_MedalsScreen_C_UpdateMissionName final
{
public:
	const class UTedMapInfo*                      CallFunc_K2_GetCurrentMapInfo_ReturnValue;         // 0x0000(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetDisplayName_ReturnValue;               // 0x0008(0x0010)(ConstParm)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ITedTextWidgetInterface> CallFunc_SetText_Widget_CastInput;               // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MedalsScreen_C_UpdateMissionName) == 0x000008, "Wrong alignment on WBP_MedalsScreen_C_UpdateMissionName");
static_assert(sizeof(WBP_MedalsScreen_C_UpdateMissionName) == 0x000030, "Wrong size on WBP_MedalsScreen_C_UpdateMissionName");
static_assert(offsetof(WBP_MedalsScreen_C_UpdateMissionName, CallFunc_K2_GetCurrentMapInfo_ReturnValue) == 0x000000, "Member 'WBP_MedalsScreen_C_UpdateMissionName::CallFunc_K2_GetCurrentMapInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MedalsScreen_C_UpdateMissionName, CallFunc_GetDisplayName_ReturnValue) == 0x000008, "Member 'WBP_MedalsScreen_C_UpdateMissionName::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MedalsScreen_C_UpdateMissionName, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'WBP_MedalsScreen_C_UpdateMissionName::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MedalsScreen_C_UpdateMissionName, CallFunc_SetText_Widget_CastInput) == 0x000020, "Member 'WBP_MedalsScreen_C_UpdateMissionName::CallFunc_SetText_Widget_CastInput' has a wrong offset!");

// Function WBP_MedalsScreen.WBP_MedalsScreen_C.UpdateNumbers
// 0x0190 (0x0190 - 0x0000)
struct WBP_MedalsScreen_C_UpdateNumbers final
{
public:
	int32                                         NumberOfCompletedMainObjectives_0;                 // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NumberOfMainObjectives_0;                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NumberOfCompletedSideObjectives_0;                 // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NumberOfSideObjectives_0;                          // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0018(0x0048)(HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue_1;            // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0068(0x0048)(HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue_2;            // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00B8(0x0010)(ReferenceParm)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x00C8(0x0048)(HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0110(0x0010)()
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue_3;            // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x0128(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0170(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0180(0x0010)()
};
static_assert(alignof(WBP_MedalsScreen_C_UpdateNumbers) == 0x000008, "Wrong alignment on WBP_MedalsScreen_C_UpdateNumbers");
static_assert(sizeof(WBP_MedalsScreen_C_UpdateNumbers) == 0x000190, "Wrong size on WBP_MedalsScreen_C_UpdateNumbers");
static_assert(offsetof(WBP_MedalsScreen_C_UpdateNumbers, NumberOfCompletedMainObjectives_0) == 0x000000, "Member 'WBP_MedalsScreen_C_UpdateNumbers::NumberOfCompletedMainObjectives_0' has a wrong offset!");
static_assert(offsetof(WBP_MedalsScreen_C_UpdateNumbers, NumberOfMainObjectives_0) == 0x000004, "Member 'WBP_MedalsScreen_C_UpdateNumbers::NumberOfMainObjectives_0' has a wrong offset!");
static_assert(offsetof(WBP_MedalsScreen_C_UpdateNumbers, NumberOfCompletedSideObjectives_0) == 0x000008, "Member 'WBP_MedalsScreen_C_UpdateNumbers::NumberOfCompletedSideObjectives_0' has a wrong offset!");
