#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SaveIndicator

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_SaveIndicator.WBP_SaveIndicator_C.ExecuteUbergraph_WBP_SaveIndicator
// 0x0078 (0x0078 - 0x0000)
struct WBP_SaveIndicator_C_ExecuteUbergraph_WBP_SaveIndicator final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USavedGameSlotInfo*                     K2Node_CustomEvent_SlotInfo_1;                     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USavedGameSlotInfo*                     K2Node_CustomEvent_SlotInfo;                       // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class UWidgetAnimation*                 K2Node_Event_Animation;                            // 0x0028(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTedSavedGameSubsystem*                 CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_1;    // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42[0x2];                                       // 0x0042(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class USavedGameSlotInfo* SlotInfo)> K2Node_CreateDelegate_OutputDelegate;        // 0x0044(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTedSavedGameSubsystem*                 CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class USavedGameSlotInfo* SlotInfo)> K2Node_CreateDelegate_OutputDelegate_1;      // 0x0060(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SaveIndicator_C_ExecuteUbergraph_WBP_SaveIndicator) == 0x000008, "Wrong alignment on WBP_SaveIndicator_C_ExecuteUbergraph_WBP_SaveIndicator");
static_assert(sizeof(WBP_SaveIndicator_C_ExecuteUbergraph_WBP_SaveIndicator) == 0x000078, "Wrong size on WBP_SaveIndicator_C_ExecuteUbergraph_WBP_SaveIndicator");
static_assert(offsetof(WBP_SaveIndicator_C_ExecuteUbergraph_WBP_SaveIndicator, EntryPoint) == 0x000000, "Member 'WBP_SaveIndicator_C_ExecuteUbergraph_WBP_SaveIndicator::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_SaveIndicator_C_ExecuteUbergraph_WBP_SaveIndicator, K2Node_CustomEvent_SlotInfo_1) == 0x000008, "Member 'WBP_SaveIndicator_C_ExecuteUbergraph_WBP_SaveIndicator::K2Node_CustomEvent_SlotInfo_1' has a wrong offset!");
static_assert(offsetof(WBP_SaveIndicator_C_ExecuteUbergraph_WBP_SaveIndicator, CallFunc_IsAnimationPlaying_ReturnValue) == 0x000010, "Member 'WBP_SaveIndicator_C_ExecuteUbergraph_WBP_SaveIndicator::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SaveIndicator_C_ExecuteUbergraph_WBP_SaveIndicator, K2Node_CustomEvent_SlotInfo) == 0x000018, "Member 'WBP_SaveIndicator_C_ExecuteUbergraph_WBP_SaveIndicator::K2Node_CustomEvent_SlotInfo' has a wrong offset!");
static_assert(offsetof(WBP_SaveIndicator_C_ExecuteUbergraph_WBP_SaveIndicator, CallFunc_PlayAnimation_ReturnValue) == 0x000020, "Member 'WBP_SaveIndicator_C_ExecuteUbergraph_WBP_SaveIndicator::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SaveIndicator_C_ExecuteUbergraph_WBP_SaveIndicator, K2Node_Event_Animation) == 0x000028, "Member 'WBP_SaveIndicator_C_ExecuteUbergraph_WBP_SaveIndicator::K2Node_Event_Animation' has a wrong offset!");
static_assert(offsetof(WBP_SaveIndicator_C_ExecuteUbergraph_WBP_SaveIndicator, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000030, "Member 'WBP_SaveIndicator_C_ExecuteUbergraph_WBP_SaveIndicator::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SaveIndicator_C_ExecuteUbergraph_WBP_SaveIndicator, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000038, "Member 'WBP_SaveIndicator_C_ExecuteUbergraph_WBP_SaveIndicator::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SaveIndicator_C_ExecuteUbergraph_WBP_SaveIndicator, CallFunc_BooleanAND_ReturnValue) == 0x000040, "Member 'WBP_SaveIndicator_C_ExecuteUbergraph_WBP_SaveIndicator::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SaveIndicator_C_ExecuteUbergraph_WBP_SaveIndicator, CallFunc_EqualEqual_ObjectObject_ReturnValue_1) == 0x000041, "Member 'WBP_SaveIndicator_C_ExecuteUbergraph_WBP_SaveIndicator::CallFunc_EqualEqual_ObjectObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_SaveIndicator_C_ExecuteUbergraph_WBP_SaveIndicator, K2Node_CreateDelegate_OutputDelegate) == 0x000044, "Member 'WBP_SaveIndicator_C_ExecuteUbergraph_WBP_SaveIndicator::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_SaveIndicator_C_ExecuteUbergraph_WBP_SaveIndicator, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x000058, "Member 'WBP_SaveIndicator_C_ExecuteUbergraph_WBP_SaveIndicator::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_SaveIndicator_C_ExecuteUbergraph_WBP_SaveIndicator, K2Node_CreateDelegate_OutputDelegate_1) == 0x000060, "Member 'WBP_SaveIndicator_C_ExecuteUbergraph_WBP_SaveIndicator::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_SaveIndicator_C_ExecuteUbergraph_WBP_SaveIndicator, CallFunc_PlayAnimation_ReturnValue_1) == 0x000070, "Member 'WBP_SaveIndicator_C_ExecuteUbergraph_WBP_SaveIndicator::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");

// Function WBP_SaveIndicator.WBP_SaveIndicator_C.On Save Begin
// 0x0008 (0x0008 - 0x0000)
struct WBP_SaveIndicator_C_On_Save_Begin final
{
public:
	class USavedGameSlotInfo*                     SlotInfo;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SaveIndicator_C_On_Save_Begin) == 0x000008, "Wrong alignment on WBP_SaveIndicator_C_On_Save_Begin");
static_assert(sizeof(WBP_SaveIndicator_C_On_Save_Begin) == 0x000008, "Wrong size on WBP_SaveIndicator_C_On_Save_Begin");
static_assert(offsetof(WBP_SaveIndicator_C_On_Save_Begin, SlotInfo) == 0x000000, "Member 'WBP_SaveIndicator_C_On_Save_Begin::SlotInfo' has a wrong offset!");

// Function WBP_SaveIndicator.WBP_SaveIndicator_C.On Save End
// 0x0008 (0x0008 - 0x0000)
struct WBP_SaveIndicator_C_On_Save_End final
{
public:
	class USavedGameSlotInfo*                     SlotInfo;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SaveIndicator_C_On_Save_End) == 0x000008, "Wrong alignment on WBP_SaveIndicator_C_On_Save_End");
static_assert(sizeof(WBP_SaveIndicator_C_On_Save_End) == 0x000008, "Wrong size on WBP_SaveIndicator_C_On_Save_End");
static_assert(offsetof(WBP_SaveIndicator_C_On_Save_End, SlotInfo) == 0x000000, "Member 'WBP_SaveIndicator_C_On_Save_End::SlotInfo' has a wrong offset!");

// Function WBP_SaveIndicator.WBP_SaveIndicator_C.OnAnimationFinished
// 0x0008 (0x0008 - 0x0000)
struct WBP_SaveIndicator_C_OnAnimationFinished final
{
public:
	const class UWidgetAnimation*                 Animation;                                         // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SaveIndicator_C_OnAnimationFinished) == 0x000008, "Wrong alignment on WBP_SaveIndicator_C_OnAnimationFinished");
static_assert(sizeof(WBP_SaveIndicator_C_OnAnimationFinished) == 0x000008, "Wrong size on WBP_SaveIndicator_C_OnAnimationFinished");
static_assert(offsetof(WBP_SaveIndicator_C_OnAnimationFinished, Animation) == 0x000000, "Member 'WBP_SaveIndicator_C_OnAnimationFinished::Animation' has a wrong offset!");

}

