#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_HUD_GenericTooltip

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_HUD_GenericTooltip.WBP_HUD_GenericTooltip_C.SetupTextBlock
// 0x0020 (0x0020 - 0x0000)
struct WBP_HUD_GenericTooltip_C_SetupTextBlock final
{
public:
	class UTextBlock*                             InTextBlock;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   InText;                                            // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          Temp_bool_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_GenericTooltip_C_SetupTextBlock) == 0x000008, "Wrong alignment on WBP_HUD_GenericTooltip_C_SetupTextBlock");
static_assert(sizeof(WBP_HUD_GenericTooltip_C_SetupTextBlock) == 0x000020, "Wrong size on WBP_HUD_GenericTooltip_C_SetupTextBlock");
static_assert(offsetof(WBP_HUD_GenericTooltip_C_SetupTextBlock, InTextBlock) == 0x000000, "Member 'WBP_HUD_GenericTooltip_C_SetupTextBlock::InTextBlock' has a wrong offset!");
static_assert(offsetof(WBP_HUD_GenericTooltip_C_SetupTextBlock, InText) == 0x000008, "Member 'WBP_HUD_GenericTooltip_C_SetupTextBlock::InText' has a wrong offset!");
static_assert(offsetof(WBP_HUD_GenericTooltip_C_SetupTextBlock, Temp_bool_Variable) == 0x000018, "Member 'WBP_HUD_GenericTooltip_C_SetupTextBlock::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_HUD_GenericTooltip_C_SetupTextBlock, CallFunc_TextIsEmpty_ReturnValue) == 0x000019, "Member 'WBP_HUD_GenericTooltip_C_SetupTextBlock::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_GenericTooltip_C_SetupTextBlock, Temp_byte_Variable) == 0x00001A, "Member 'WBP_HUD_GenericTooltip_C_SetupTextBlock::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_HUD_GenericTooltip_C_SetupTextBlock, Temp_byte_Variable_1) == 0x00001B, "Member 'WBP_HUD_GenericTooltip_C_SetupTextBlock::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_HUD_GenericTooltip_C_SetupTextBlock, K2Node_Select_Default) == 0x00001C, "Member 'WBP_HUD_GenericTooltip_C_SetupTextBlock::K2Node_Select_Default' has a wrong offset!");

// Function WBP_HUD_GenericTooltip.WBP_HUD_GenericTooltip_C.ExecuteUbergraph_WBP_HUD_GenericTooltip
// 0x00A0 (0x00A0 - 0x0000)
struct WBP_HUD_GenericTooltip_C_ExecuteUbergraph_WBP_HUD_GenericTooltip final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetEmptyText_ReturnValue;                 // 0x0008(0x0010)()
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetInputDisplayText_ReturnValue;          // 0x0020(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0030(0x0048)(HasGetValueTypeHash)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0080(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0090(0x0010)()
};
static_assert(alignof(WBP_HUD_GenericTooltip_C_ExecuteUbergraph_WBP_HUD_GenericTooltip) == 0x000008, "Wrong alignment on WBP_HUD_GenericTooltip_C_ExecuteUbergraph_WBP_HUD_GenericTooltip");
static_assert(sizeof(WBP_HUD_GenericTooltip_C_ExecuteUbergraph_WBP_HUD_GenericTooltip) == 0x0000A0, "Wrong size on WBP_HUD_GenericTooltip_C_ExecuteUbergraph_WBP_HUD_GenericTooltip");
static_assert(offsetof(WBP_HUD_GenericTooltip_C_ExecuteUbergraph_WBP_HUD_GenericTooltip, EntryPoint) == 0x000000, "Member 'WBP_HUD_GenericTooltip_C_ExecuteUbergraph_WBP_HUD_GenericTooltip::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_HUD_GenericTooltip_C_ExecuteUbergraph_WBP_HUD_GenericTooltip, CallFunc_GetEmptyText_ReturnValue) == 0x000008, "Member 'WBP_HUD_GenericTooltip_C_ExecuteUbergraph_WBP_HUD_GenericTooltip::CallFunc_GetEmptyText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_GenericTooltip_C_ExecuteUbergraph_WBP_HUD_GenericTooltip, CallFunc_Not_PreBool_ReturnValue) == 0x000018, "Member 'WBP_HUD_GenericTooltip_C_ExecuteUbergraph_WBP_HUD_GenericTooltip::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_GenericTooltip_C_ExecuteUbergraph_WBP_HUD_GenericTooltip, CallFunc_GetInputDisplayText_ReturnValue) == 0x000020, "Member 'WBP_HUD_GenericTooltip_C_ExecuteUbergraph_WBP_HUD_GenericTooltip::CallFunc_GetInputDisplayText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_GenericTooltip_C_ExecuteUbergraph_WBP_HUD_GenericTooltip, K2Node_MakeStruct_FormatArgumentData) == 0x000030, "Member 'WBP_HUD_GenericTooltip_C_ExecuteUbergraph_WBP_HUD_GenericTooltip::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_HUD_GenericTooltip_C_ExecuteUbergraph_WBP_HUD_GenericTooltip, CallFunc_TextIsEmpty_ReturnValue) == 0x000078, "Member 'WBP_HUD_GenericTooltip_C_ExecuteUbergraph_WBP_HUD_GenericTooltip::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_GenericTooltip_C_ExecuteUbergraph_WBP_HUD_GenericTooltip, K2Node_MakeArray_Array) == 0x000080, "Member 'WBP_HUD_GenericTooltip_C_ExecuteUbergraph_WBP_HUD_GenericTooltip::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_HUD_GenericTooltip_C_ExecuteUbergraph_WBP_HUD_GenericTooltip, CallFunc_Format_ReturnValue) == 0x000090, "Member 'WBP_HUD_GenericTooltip_C_ExecuteUbergraph_WBP_HUD_GenericTooltip::CallFunc_Format_ReturnValue' has a wrong offset!");

}

