#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_HUD_BuildingGrid_FactoryTypes_Panel

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Tempest_structs.hpp"
#include "Tempest_classes.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_HUD_BuildingGrid_FactoryTypes_Panel.WBP_HUD_BuildingGrid_FactoryTypes_Panel_C
// 0x0038 (0x0800 - 0x07C8)
class UWBP_HUD_BuildingGrid_FactoryTypes_Panel_C final : public UTedBuildingGridFactoryTypesPanel
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x07C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FMargin                                SlotPadding_Left;                                  // 0x07D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FMargin                                SlotPadding_Middle;                                // 0x07E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FMargin                                SlotPadding_Right;                                 // 0x07F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_WBP_HUD_BuildingGrid_FactoryTypes_Panel(int32 EntryPoint);
	void GetPaddingForSlot(int32 InSlotIndex, struct FMargin* OutPadding);
	void OnRegisterContentSlot(class UTedContentPanelSlotBase* InContentSlot, ETedContentPanelRegistration InMode);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_HUD_BuildingGrid_FactoryTypes_Panel_C">();
	}
	static class UWBP_HUD_BuildingGrid_FactoryTypes_Panel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_HUD_BuildingGrid_FactoryTypes_Panel_C>();
	}
};
static_assert(alignof(UWBP_HUD_BuildingGrid_FactoryTypes_Panel_C) == 0x000008, "Wrong alignment on UWBP_HUD_BuildingGrid_FactoryTypes_Panel_C");
static_assert(sizeof(UWBP_HUD_BuildingGrid_FactoryTypes_Panel_C) == 0x000800, "Wrong size on UWBP_HUD_BuildingGrid_FactoryTypes_Panel_C");
static_assert(offsetof(UWBP_HUD_BuildingGrid_FactoryTypes_Panel_C, UberGraphFrame) == 0x0007C8, "Member 'UWBP_HUD_BuildingGrid_FactoryTypes_Panel_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_BuildingGrid_FactoryTypes_Panel_C, SlotPadding_Left) == 0x0007D0, "Member 'UWBP_HUD_BuildingGrid_FactoryTypes_Panel_C::SlotPadding_Left' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_BuildingGrid_FactoryTypes_Panel_C, SlotPadding_Middle) == 0x0007E0, "Member 'UWBP_HUD_BuildingGrid_FactoryTypes_Panel_C::SlotPadding_Middle' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_BuildingGrid_FactoryTypes_Panel_C, SlotPadding_Right) == 0x0007F0, "Member 'UWBP_HUD_BuildingGrid_FactoryTypes_Panel_C::SlotPadding_Right' has a wrong offset!");

}

