#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_HUD_SelectionDetails_SelectedPawnDetails

#include "Basic.hpp"

#include "Tempest_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_HUD_SelectionDetails_SelectedPawnDetails.WBP_HUD_SelectionDetails_SelectedPawnDetails_C.ExecuteUbergraph_WBP_HUD_SelectionDetails_SelectedPawnDetails
// 0x0050 (0x0050 - 0x0000)
struct WBP_HUD_SelectionDetails_SelectedPawnDetails_C_ExecuteUbergraph_WBP_HUD_SelectionDetails_SelectedPawnDetails final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ITedUIPresenceAgent>   CallFunc_GetDisplayName_self_CastInput;            // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetDisplayName_ReturnValue;               // 0x0018(0x0010)(ConstParm)
	class ATedHUD*                                CallFunc_GetHUD_ReturnValue;                       // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ATedUnitBase*                           K2Node_DynamicCast_AsTed_Unit_Base;                // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class UTedUnitDefinitionAsset*          CallFunc_GetDefinitionAsset_ReturnValue;           // 0x0040(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_SelectionDetails_SelectedPawnDetails_C_ExecuteUbergraph_WBP_HUD_SelectionDetails_SelectedPawnDetails) == 0x000008, "Wrong alignment on WBP_HUD_SelectionDetails_SelectedPawnDetails_C_ExecuteUbergraph_WBP_HUD_SelectionDetails_SelectedPawnDetails");
static_assert(sizeof(WBP_HUD_SelectionDetails_SelectedPawnDetails_C_ExecuteUbergraph_WBP_HUD_SelectionDetails_SelectedPawnDetails) == 0x000050, "Wrong size on WBP_HUD_SelectionDetails_SelectedPawnDetails_C_ExecuteUbergraph_WBP_HUD_SelectionDetails_SelectedPawnDetails");
static_assert(offsetof(WBP_HUD_SelectionDetails_SelectedPawnDetails_C_ExecuteUbergraph_WBP_HUD_SelectionDetails_SelectedPawnDetails, EntryPoint) == 0x000000, "Member 'WBP_HUD_SelectionDetails_SelectedPawnDetails_C_ExecuteUbergraph_WBP_HUD_SelectionDetails_SelectedPawnDetails::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SelectionDetails_SelectedPawnDetails_C_ExecuteUbergraph_WBP_HUD_SelectionDetails_SelectedPawnDetails, CallFunc_GetDisplayName_self_CastInput) == 0x000008, "Member 'WBP_HUD_SelectionDetails_SelectedPawnDetails_C_ExecuteUbergraph_WBP_HUD_SelectionDetails_SelectedPawnDetails::CallFunc_GetDisplayName_self_CastInput' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SelectionDetails_SelectedPawnDetails_C_ExecuteUbergraph_WBP_HUD_SelectionDetails_SelectedPawnDetails, CallFunc_GetDisplayName_ReturnValue) == 0x000018, "Member 'WBP_HUD_SelectionDetails_SelectedPawnDetails_C_ExecuteUbergraph_WBP_HUD_SelectionDetails_SelectedPawnDetails::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SelectionDetails_SelectedPawnDetails_C_ExecuteUbergraph_WBP_HUD_SelectionDetails_SelectedPawnDetails, CallFunc_GetHUD_ReturnValue) == 0x000028, "Member 'WBP_HUD_SelectionDetails_SelectedPawnDetails_C_ExecuteUbergraph_WBP_HUD_SelectionDetails_SelectedPawnDetails::CallFunc_GetHUD_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SelectionDetails_SelectedPawnDetails_C_ExecuteUbergraph_WBP_HUD_SelectionDetails_SelectedPawnDetails, K2Node_DynamicCast_AsTed_Unit_Base) == 0x000030, "Member 'WBP_HUD_SelectionDetails_SelectedPawnDetails_C_ExecuteUbergraph_WBP_HUD_SelectionDetails_SelectedPawnDetails::K2Node_DynamicCast_AsTed_Unit_Base' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SelectionDetails_SelectedPawnDetails_C_ExecuteUbergraph_WBP_HUD_SelectionDetails_SelectedPawnDetails, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'WBP_HUD_SelectionDetails_SelectedPawnDetails_C_ExecuteUbergraph_WBP_HUD_SelectionDetails_SelectedPawnDetails::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SelectionDetails_SelectedPawnDetails_C_ExecuteUbergraph_WBP_HUD_SelectionDetails_SelectedPawnDetails, CallFunc_GetDefinitionAsset_ReturnValue) == 0x000040, "Member 'WBP_HUD_SelectionDetails_SelectedPawnDetails_C_ExecuteUbergraph_WBP_HUD_SelectionDetails_SelectedPawnDetails::CallFunc_GetDefinitionAsset_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SelectionDetails_SelectedPawnDetails_C_ExecuteUbergraph_WBP_HUD_SelectionDetails_SelectedPawnDetails, K2Node_SwitchEnum_CmpSuccess) == 0x000048, "Member 'WBP_HUD_SelectionDetails_SelectedPawnDetails_C_ExecuteUbergraph_WBP_HUD_SelectionDetails_SelectedPawnDetails::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SelectionDetails_SelectedPawnDetails_C_ExecuteUbergraph_WBP_HUD_SelectionDetails_SelectedPawnDetails, CallFunc_IsValid_ReturnValue) == 0x000049, "Member 'WBP_HUD_SelectionDetails_SelectedPawnDetails_C_ExecuteUbergraph_WBP_HUD_SelectionDetails_SelectedPawnDetails::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WBP_HUD_SelectionDetails_SelectedPawnDetails.WBP_HUD_SelectionDetails_SelectedPawnDetails_C.Get Current Health Text
// 0x0030 (0x0030 - 0x0000)
struct WBP_HUD_SelectionDetails_SelectedPawnDetails_C_Get_Current_Health_Text final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetHealth_ReturnValue;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue;            // 0x0018(0x0010)()
	double                                        CallFunc_Conv_DoubleToText_Value_ImplicitCast;     // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_SelectionDetails_SelectedPawnDetails_C_Get_Current_Health_Text) == 0x000008, "Wrong alignment on WBP_HUD_SelectionDetails_SelectedPawnDetails_C_Get_Current_Health_Text");
static_assert(sizeof(WBP_HUD_SelectionDetails_SelectedPawnDetails_C_Get_Current_Health_Text) == 0x000030, "Wrong size on WBP_HUD_SelectionDetails_SelectedPawnDetails_C_Get_Current_Health_Text");
static_assert(offsetof(WBP_HUD_SelectionDetails_SelectedPawnDetails_C_Get_Current_Health_Text, ReturnValue) == 0x000000, "Member 'WBP_HUD_SelectionDetails_SelectedPawnDetails_C_Get_Current_Health_Text::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SelectionDetails_SelectedPawnDetails_C_Get_Current_Health_Text, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'WBP_HUD_SelectionDetails_SelectedPawnDetails_C_Get_Current_Health_Text::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SelectionDetails_SelectedPawnDetails_C_Get_Current_Health_Text, CallFunc_GetHealth_ReturnValue) == 0x000014, "Member 'WBP_HUD_SelectionDetails_SelectedPawnDetails_C_Get_Current_Health_Text::CallFunc_GetHealth_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SelectionDetails_SelectedPawnDetails_C_Get_Current_Health_Text, CallFunc_Conv_DoubleToText_ReturnValue) == 0x000018, "Member 'WBP_HUD_SelectionDetails_SelectedPawnDetails_C_Get_Current_Health_Text::CallFunc_Conv_DoubleToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SelectionDetails_SelectedPawnDetails_C_Get_Current_Health_Text, CallFunc_Conv_DoubleToText_Value_ImplicitCast) == 0x000028, "Member 'WBP_HUD_SelectionDetails_SelectedPawnDetails_C_Get_Current_Health_Text::CallFunc_Conv_DoubleToText_Value_ImplicitCast' has a wrong offset!");

// Function WBP_HUD_SelectionDetails_SelectedPawnDetails.WBP_HUD_SelectionDetails_SelectedPawnDetails_C.Get Current Health Text Color
// 0x0030 (0x0030 - 0x0000)
struct WBP_HUD_SelectionDetails_SelectedPawnDetails_C_Get_Current_Health_Text_Color final
{
public:
	struct FSlateColor                            ReturnValue;                                       // 0x0000(0x0014)(Parm, OutParm, ReturnParm)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetHealthPercent_ReturnValue;             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetHealthPercent_ReturnValue_1;           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_1;       // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_SelectionDetails_SelectedPawnDetails_C_Get_Current_Health_Text_Color) == 0x000008, "Wrong alignment on WBP_HUD_SelectionDetails_SelectedPawnDetails_C_Get_Current_Health_Text_Color");
static_assert(sizeof(WBP_HUD_SelectionDetails_SelectedPawnDetails_C_Get_Current_Health_Text_Color) == 0x000030, "Wrong size on WBP_HUD_SelectionDetails_SelectedPawnDetails_C_Get_Current_Health_Text_Color");
static_assert(offsetof(WBP_HUD_SelectionDetails_SelectedPawnDetails_C_Get_Current_Health_Text_Color, ReturnValue) == 0x000000, "Member 'WBP_HUD_SelectionDetails_SelectedPawnDetails_C_Get_Current_Health_Text_Color::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SelectionDetails_SelectedPawnDetails_C_Get_Current_Health_Text_Color, CallFunc_GetHealthPercent_ReturnValue) == 0x000018, "Member 'WBP_HUD_SelectionDetails_SelectedPawnDetails_C_Get_Current_Health_Text_Color::CallFunc_GetHealthPercent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SelectionDetails_SelectedPawnDetails_C_Get_Current_Health_Text_Color, CallFunc_GetHealthPercent_ReturnValue_1) == 0x000020, "Member 'WBP_HUD_SelectionDetails_SelectedPawnDetails_C_Get_Current_Health_Text_Color::CallFunc_GetHealthPercent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SelectionDetails_SelectedPawnDetails_C_Get_Current_Health_Text_Color, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000028, "Member 'WBP_HUD_SelectionDetails_SelectedPawnDetails_C_Get_Current_Health_Text_Color::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SelectionDetails_SelectedPawnDetails_C_Get_Current_Health_Text_Color, CallFunc_Greater_DoubleDouble_ReturnValue_1) == 0x000029, "Member 'WBP_HUD_SelectionDetails_SelectedPawnDetails_C_Get_Current_Health_Text_Color::CallFunc_Greater_DoubleDouble_ReturnValue_1' has a wrong offset!");

// Function WBP_HUD_SelectionDetails_SelectedPawnDetails.WBP_HUD_SelectionDetails_SelectedPawnDetails_C.Get Max Health Text
// 0x0038 (0x0038 - 0x0000)
struct WBP_HUD_SelectionDetails_SelectedPawnDetails_C_Get_Max_Health_Text final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm)
	float                                         CallFunc_GetHealthMax_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue;            // 0x0018(0x0010)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_DoubleToText_Value_ImplicitCast;     // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_SelectionDetails_SelectedPawnDetails_C_Get_Max_Health_Text) == 0x000008, "Wrong alignment on WBP_HUD_SelectionDetails_SelectedPawnDetails_C_Get_Max_Health_Text");
static_assert(sizeof(WBP_HUD_SelectionDetails_SelectedPawnDetails_C_Get_Max_Health_Text) == 0x000038, "Wrong size on WBP_HUD_SelectionDetails_SelectedPawnDetails_C_Get_Max_Health_Text");
static_assert(offsetof(WBP_HUD_SelectionDetails_SelectedPawnDetails_C_Get_Max_Health_Text, ReturnValue) == 0x000000, "Member 'WBP_HUD_SelectionDetails_SelectedPawnDetails_C_Get_Max_Health_Text::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SelectionDetails_SelectedPawnDetails_C_Get_Max_Health_Text, CallFunc_GetHealthMax_ReturnValue) == 0x000010, "Member 'WBP_HUD_SelectionDetails_SelectedPawnDetails_C_Get_Max_Health_Text::CallFunc_GetHealthMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SelectionDetails_SelectedPawnDetails_C_Get_Max_Health_Text, CallFunc_Conv_DoubleToText_ReturnValue) == 0x000018, "Member 'WBP_HUD_SelectionDetails_SelectedPawnDetails_C_Get_Max_Health_Text::CallFunc_Conv_DoubleToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SelectionDetails_SelectedPawnDetails_C_Get_Max_Health_Text, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'WBP_HUD_SelectionDetails_SelectedPawnDetails_C_Get_Max_Health_Text::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SelectionDetails_SelectedPawnDetails_C_Get_Max_Health_Text, CallFunc_Conv_DoubleToText_Value_ImplicitCast) == 0x000030, "Member 'WBP_HUD_SelectionDetails_SelectedPawnDetails_C_Get_Max_Health_Text::CallFunc_Conv_DoubleToText_Value_ImplicitCast' has a wrong offset!");

// Function WBP_HUD_SelectionDetails_SelectedPawnDetails.WBP_HUD_SelectionDetails_SelectedPawnDetails_C.GetHealthPercent
// 0x0018 (0x0018 - 0x0000)
struct WBP_HUD_SelectionDetails_SelectedPawnDetails_C_GetHealthPercent final
{
public:
	double                                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetHealthPct_ReturnValue;                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_FunctionResult_ReturnValue_ImplicitCast;    // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_SelectionDetails_SelectedPawnDetails_C_GetHealthPercent) == 0x000008, "Wrong alignment on WBP_HUD_SelectionDetails_SelectedPawnDetails_C_GetHealthPercent");
static_assert(sizeof(WBP_HUD_SelectionDetails_SelectedPawnDetails_C_GetHealthPercent) == 0x000018, "Wrong size on WBP_HUD_SelectionDetails_SelectedPawnDetails_C_GetHealthPercent");
static_assert(offsetof(WBP_HUD_SelectionDetails_SelectedPawnDetails_C_GetHealthPercent, ReturnValue) == 0x000000, "Member 'WBP_HUD_SelectionDetails_SelectedPawnDetails_C_GetHealthPercent::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SelectionDetails_SelectedPawnDetails_C_GetHealthPercent, CallFunc_GetHealthPct_ReturnValue) == 0x000008, "Member 'WBP_HUD_SelectionDetails_SelectedPawnDetails_C_GetHealthPercent::CallFunc_GetHealthPct_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SelectionDetails_SelectedPawnDetails_C_GetHealthPercent, K2Node_FunctionResult_ReturnValue_ImplicitCast) == 0x000010, "Member 'WBP_HUD_SelectionDetails_SelectedPawnDetails_C_GetHealthPercent::K2Node_FunctionResult_ReturnValue_ImplicitCast' has a wrong offset!");

// Function WBP_HUD_SelectionDetails_SelectedPawnDetails.WBP_HUD_SelectionDetails_SelectedPawnDetails_C.MakeAndShowTooltip
// 0x00C0 (0x00C0 - 0x0000)
struct WBP_HUD_SelectionDetails_SelectedPawnDetails_C_MakeAndShowTooltip final
{
public:
	TScriptInterface<class ITedUIPresenceAgent>   CallFunc_GetDisplayName_self_CastInput;            // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetDisplayName_ReturnValue;               // 0x0010(0x0010)(ConstParm)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ITedUIPresenceAgent>   CallFunc_GetDisplayDescription_self_CastInput;     // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetDisplayDescription_ReturnValue;        // 0x0038(0x0010)()
	struct FTedTooltipDisplayParams               K2Node_MakeStruct_TedTooltipDisplayParams;         // 0x0048(0x0070)(ContainsInstancedReference)
	class ATedHUD*                                CallFunc_GetHUD_ReturnValue;                       // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_SelectionDetails_SelectedPawnDetails_C_MakeAndShowTooltip) == 0x000008, "Wrong alignment on WBP_HUD_SelectionDetails_SelectedPawnDetails_C_MakeAndShowTooltip");
static_assert(sizeof(WBP_HUD_SelectionDetails_SelectedPawnDetails_C_MakeAndShowTooltip) == 0x0000C0, "Wrong size on WBP_HUD_SelectionDetails_SelectedPawnDetails_C_MakeAndShowTooltip");
static_assert(offsetof(WBP_HUD_SelectionDetails_SelectedPawnDetails_C_MakeAndShowTooltip, CallFunc_GetDisplayName_self_CastInput) == 0x000000, "Member 'WBP_HUD_SelectionDetails_SelectedPawnDetails_C_MakeAndShowTooltip::CallFunc_GetDisplayName_self_CastInput' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SelectionDetails_SelectedPawnDetails_C_MakeAndShowTooltip, CallFunc_GetDisplayName_ReturnValue) == 0x000010, "Member 'WBP_HUD_SelectionDetails_SelectedPawnDetails_C_MakeAndShowTooltip::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SelectionDetails_SelectedPawnDetails_C_MakeAndShowTooltip, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'WBP_HUD_SelectionDetails_SelectedPawnDetails_C_MakeAndShowTooltip::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SelectionDetails_SelectedPawnDetails_C_MakeAndShowTooltip, CallFunc_GetDisplayDescription_self_CastInput) == 0x000028, "Member 'WBP_HUD_SelectionDetails_SelectedPawnDetails_C_MakeAndShowTooltip::CallFunc_GetDisplayDescription_self_CastInput' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SelectionDetails_SelectedPawnDetails_C_MakeAndShowTooltip, CallFunc_GetDisplayDescription_ReturnValue) == 0x000038, "Member 'WBP_HUD_SelectionDetails_SelectedPawnDetails_C_MakeAndShowTooltip::CallFunc_GetDisplayDescription_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SelectionDetails_SelectedPawnDetails_C_MakeAndShowTooltip, K2Node_MakeStruct_TedTooltipDisplayParams) == 0x000048, "Member 'WBP_HUD_SelectionDetails_SelectedPawnDetails_C_MakeAndShowTooltip::K2Node_MakeStruct_TedTooltipDisplayParams' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SelectionDetails_SelectedPawnDetails_C_MakeAndShowTooltip, CallFunc_GetHUD_ReturnValue) == 0x0000B8, "Member 'WBP_HUD_SelectionDetails_SelectedPawnDetails_C_MakeAndShowTooltip::CallFunc_GetHUD_ReturnValue' has a wrong offset!");

// Function WBP_HUD_SelectionDetails_SelectedPawnDetails.WBP_HUD_SelectionDetails_SelectedPawnDetails_C.RefreshIcon
// 0x0020 (0x0020 - 0x0000)
struct WBP_HUD_SelectionDetails_SelectedPawnDetails_C_RefreshIcon final
{
public:
	TScriptInterface<class ITedUIPresenceAgent>   CallFunc_GetDisplayTexture_self_CastInput;         // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             CallFunc_GetDisplayTexture_ReturnValue;            // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_SelectionDetails_SelectedPawnDetails_C_RefreshIcon) == 0x000008, "Wrong alignment on WBP_HUD_SelectionDetails_SelectedPawnDetails_C_RefreshIcon");
static_assert(sizeof(WBP_HUD_SelectionDetails_SelectedPawnDetails_C_RefreshIcon) == 0x000020, "Wrong size on WBP_HUD_SelectionDetails_SelectedPawnDetails_C_RefreshIcon");
static_assert(offsetof(WBP_HUD_SelectionDetails_SelectedPawnDetails_C_RefreshIcon, CallFunc_GetDisplayTexture_self_CastInput) == 0x000000, "Member 'WBP_HUD_SelectionDetails_SelectedPawnDetails_C_RefreshIcon::CallFunc_GetDisplayTexture_self_CastInput' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SelectionDetails_SelectedPawnDetails_C_RefreshIcon, CallFunc_GetDisplayTexture_ReturnValue) == 0x000010, "Member 'WBP_HUD_SelectionDetails_SelectedPawnDetails_C_RefreshIcon::CallFunc_GetDisplayTexture_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SelectionDetails_SelectedPawnDetails_C_RefreshIcon, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000018, "Member 'WBP_HUD_SelectionDetails_SelectedPawnDetails_C_RefreshIcon::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");

// Function WBP_HUD_SelectionDetails_SelectedPawnDetails.WBP_HUD_SelectionDetails_SelectedPawnDetails_C.SetDisplayedPawn
// 0x0008 (0x0008 - 0x0000)
struct WBP_HUD_SelectionDetails_SelectedPawnDetails_C_SetDisplayedPawn final
{
public:
	class ATedPawn*                               InPawn;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_SelectionDetails_SelectedPawnDetails_C_SetDisplayedPawn) == 0x000008, "Wrong alignment on WBP_HUD_SelectionDetails_SelectedPawnDetails_C_SetDisplayedPawn");
static_assert(sizeof(WBP_HUD_SelectionDetails_SelectedPawnDetails_C_SetDisplayedPawn) == 0x000008, "Wrong size on WBP_HUD_SelectionDetails_SelectedPawnDetails_C_SetDisplayedPawn");
static_assert(offsetof(WBP_HUD_SelectionDetails_SelectedPawnDetails_C_SetDisplayedPawn, InPawn) == 0x000000, "Member 'WBP_HUD_SelectionDetails_SelectedPawnDetails_C_SetDisplayedPawn::InPawn' has a wrong offset!");

// Function WBP_HUD_SelectionDetails_SelectedPawnDetails.WBP_HUD_SelectionDetails_SelectedPawnDetails_C.UpdateHealthBar
// 0x0018 (0x0018 - 0x0000)
struct WBP_HUD_SelectionDetails_SelectedPawnDetails_C_UpdateHealthBar final
{
public:
	class UMaterialInstanceDynamic*               BarDynMat;                                         // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetHealth_ReturnValue;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetHealthMax_ReturnValue;                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_SelectionDetails_SelectedPawnDetails_C_UpdateHealthBar) == 0x000008, "Wrong alignment on WBP_HUD_SelectionDetails_SelectedPawnDetails_C_UpdateHealthBar");
static_assert(sizeof(WBP_HUD_SelectionDetails_SelectedPawnDetails_C_UpdateHealthBar) == 0x000018, "Wrong size on WBP_HUD_SelectionDetails_SelectedPawnDetails_C_UpdateHealthBar");
static_assert(offsetof(WBP_HUD_SelectionDetails_SelectedPawnDetails_C_UpdateHealthBar, BarDynMat) == 0x000000, "Member 'WBP_HUD_SelectionDetails_SelectedPawnDetails_C_UpdateHealthBar::BarDynMat' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SelectionDetails_SelectedPawnDetails_C_UpdateHealthBar, CallFunc_GetHealth_ReturnValue) == 0x000008, "Member 'WBP_HUD_SelectionDetails_SelectedPawnDetails_C_UpdateHealthBar::CallFunc_GetHealth_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SelectionDetails_SelectedPawnDetails_C_UpdateHealthBar, CallFunc_GetHealthMax_ReturnValue) == 0x00000C, "Member 'WBP_HUD_SelectionDetails_SelectedPawnDetails_C_UpdateHealthBar::CallFunc_GetHealthMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SelectionDetails_SelectedPawnDetails_C_UpdateHealthBar, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000010, "Member 'WBP_HUD_SelectionDetails_SelectedPawnDetails_C_UpdateHealthBar::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");

}

