#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_HUD_MinimapCorner

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Tempest_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function WBP_HUD_MinimapCorner.WBP_HUD_MinimapCorner_C.BndEvt__WBP_HUD_MinimapCorner_WBP_MoviePlayer_Fill_K2Node_ComponentBoundEvent_2_TedMoviePlayerWidgetEventDelegate__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_HUD_MinimapCorner_C_BndEvt__WBP_HUD_MinimapCorner_WBP_MoviePlayer_Fill_K2Node_ComponentBoundEvent_2_TedMoviePlayerWidgetEventDelegate__DelegateSignature final
{
public:
	class UTedMoviePlayerWidgetV2*                InWidget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	const class UFileMediaSource*                 InSource;                                          // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_MinimapCorner_C_BndEvt__WBP_HUD_MinimapCorner_WBP_MoviePlayer_Fill_K2Node_ComponentBoundEvent_2_TedMoviePlayerWidgetEventDelegate__DelegateSignature) == 0x000008, "Wrong alignment on WBP_HUD_MinimapCorner_C_BndEvt__WBP_HUD_MinimapCorner_WBP_MoviePlayer_Fill_K2Node_ComponentBoundEvent_2_TedMoviePlayerWidgetEventDelegate__DelegateSignature");
static_assert(sizeof(WBP_HUD_MinimapCorner_C_BndEvt__WBP_HUD_MinimapCorner_WBP_MoviePlayer_Fill_K2Node_ComponentBoundEvent_2_TedMoviePlayerWidgetEventDelegate__DelegateSignature) == 0x000010, "Wrong size on WBP_HUD_MinimapCorner_C_BndEvt__WBP_HUD_MinimapCorner_WBP_MoviePlayer_Fill_K2Node_ComponentBoundEvent_2_TedMoviePlayerWidgetEventDelegate__DelegateSignature");
static_assert(offsetof(WBP_HUD_MinimapCorner_C_BndEvt__WBP_HUD_MinimapCorner_WBP_MoviePlayer_Fill_K2Node_ComponentBoundEvent_2_TedMoviePlayerWidgetEventDelegate__DelegateSignature, InWidget) == 0x000000, "Member 'WBP_HUD_MinimapCorner_C_BndEvt__WBP_HUD_MinimapCorner_WBP_MoviePlayer_Fill_K2Node_ComponentBoundEvent_2_TedMoviePlayerWidgetEventDelegate__DelegateSignature::InWidget' has a wrong offset!");
static_assert(offsetof(WBP_HUD_MinimapCorner_C_BndEvt__WBP_HUD_MinimapCorner_WBP_MoviePlayer_Fill_K2Node_ComponentBoundEvent_2_TedMoviePlayerWidgetEventDelegate__DelegateSignature, InSource) == 0x000008, "Member 'WBP_HUD_MinimapCorner_C_BndEvt__WBP_HUD_MinimapCorner_WBP_MoviePlayer_Fill_K2Node_ComponentBoundEvent_2_TedMoviePlayerWidgetEventDelegate__DelegateSignature::InSource' has a wrong offset!");

// Function WBP_HUD_MinimapCorner.WBP_HUD_MinimapCorner_C.CacheResourceWidgets
// 0x0010 (0x0010 - 0x0000)
struct WBP_HUD_MinimapCorner_C_CacheResourceWidgets final
{
public:
	TArray<class UTedUserWidget*>                 K2Node_MakeArray_Array;                            // 0x0000(0x0010)(ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(WBP_HUD_MinimapCorner_C_CacheResourceWidgets) == 0x000008, "Wrong alignment on WBP_HUD_MinimapCorner_C_CacheResourceWidgets");
static_assert(sizeof(WBP_HUD_MinimapCorner_C_CacheResourceWidgets) == 0x000010, "Wrong size on WBP_HUD_MinimapCorner_C_CacheResourceWidgets");
static_assert(offsetof(WBP_HUD_MinimapCorner_C_CacheResourceWidgets, K2Node_MakeArray_Array) == 0x000000, "Member 'WBP_HUD_MinimapCorner_C_CacheResourceWidgets::K2Node_MakeArray_Array' has a wrong offset!");

// Function WBP_HUD_MinimapCorner.WBP_HUD_MinimapCorner_C.ExecuteUbergraph_WBP_HUD_MinimapCorner
// 0x0060 (0x0060 - 0x0000)
struct WBP_HUD_MinimapCorner_C_ExecuteUbergraph_WBP_HUD_MinimapCorner final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_OpenMenuScreen_ReturnValue;               // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsStartupSequenceEnabled_ReturnValue;     // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UTedMoviePlayerWidgetV2*                K2Node_ComponentBoundEvent_InWidget;               // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	const class UFileMediaSource*                 K2Node_ComponentBoundEvent_InSource;               // 0x0010(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool bWasExpanded, class UTedWorkersWidget* WorkerWidget)> K2Node_CreateDelegate_OutputDelegate; // 0x0018(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bWasExpanded;                   // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTedWorkersWidget*                      K2Node_CustomEvent_WorkerWidget;                   // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTedPlayerData*                         K2Node_Event_InPlayerData;                         // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class ATedStructureBase*>              CallFunc_GetOwnedStructures_OutStructures;         // 0x0048(0x0010)(ReferenceParm)
	bool                                          CallFunc_GetOwnedStructures_ReturnValue;           // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_MinimapCorner_C_ExecuteUbergraph_WBP_HUD_MinimapCorner) == 0x000008, "Wrong alignment on WBP_HUD_MinimapCorner_C_ExecuteUbergraph_WBP_HUD_MinimapCorner");
static_assert(sizeof(WBP_HUD_MinimapCorner_C_ExecuteUbergraph_WBP_HUD_MinimapCorner) == 0x000060, "Wrong size on WBP_HUD_MinimapCorner_C_ExecuteUbergraph_WBP_HUD_MinimapCorner");
static_assert(offsetof(WBP_HUD_MinimapCorner_C_ExecuteUbergraph_WBP_HUD_MinimapCorner, EntryPoint) == 0x000000, "Member 'WBP_HUD_MinimapCorner_C_ExecuteUbergraph_WBP_HUD_MinimapCorner::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_HUD_MinimapCorner_C_ExecuteUbergraph_WBP_HUD_MinimapCorner, CallFunc_OpenMenuScreen_ReturnValue) == 0x000004, "Member 'WBP_HUD_MinimapCorner_C_ExecuteUbergraph_WBP_HUD_MinimapCorner::CallFunc_OpenMenuScreen_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_MinimapCorner_C_ExecuteUbergraph_WBP_HUD_MinimapCorner, CallFunc_IsStartupSequenceEnabled_ReturnValue) == 0x000005, "Member 'WBP_HUD_MinimapCorner_C_ExecuteUbergraph_WBP_HUD_MinimapCorner::CallFunc_IsStartupSequenceEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_MinimapCorner_C_ExecuteUbergraph_WBP_HUD_MinimapCorner, K2Node_ComponentBoundEvent_InWidget) == 0x000008, "Member 'WBP_HUD_MinimapCorner_C_ExecuteUbergraph_WBP_HUD_MinimapCorner::K2Node_ComponentBoundEvent_InWidget' has a wrong offset!");
static_assert(offsetof(WBP_HUD_MinimapCorner_C_ExecuteUbergraph_WBP_HUD_MinimapCorner, K2Node_ComponentBoundEvent_InSource) == 0x000010, "Member 'WBP_HUD_MinimapCorner_C_ExecuteUbergraph_WBP_HUD_MinimapCorner::K2Node_ComponentBoundEvent_InSource' has a wrong offset!");
static_assert(offsetof(WBP_HUD_MinimapCorner_C_ExecuteUbergraph_WBP_HUD_MinimapCorner, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'WBP_HUD_MinimapCorner_C_ExecuteUbergraph_WBP_HUD_MinimapCorner::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_HUD_MinimapCorner_C_ExecuteUbergraph_WBP_HUD_MinimapCorner, K2Node_CustomEvent_bWasExpanded) == 0x000028, "Member 'WBP_HUD_MinimapCorner_C_ExecuteUbergraph_WBP_HUD_MinimapCorner::K2Node_CustomEvent_bWasExpanded' has a wrong offset!");
static_assert(offsetof(WBP_HUD_MinimapCorner_C_ExecuteUbergraph_WBP_HUD_MinimapCorner, K2Node_CustomEvent_WorkerWidget) == 0x000030, "Member 'WBP_HUD_MinimapCorner_C_ExecuteUbergraph_WBP_HUD_MinimapCorner::K2Node_CustomEvent_WorkerWidget' has a wrong offset!");
static_assert(offsetof(WBP_HUD_MinimapCorner_C_ExecuteUbergraph_WBP_HUD_MinimapCorner, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000038, "Member 'WBP_HUD_MinimapCorner_C_ExecuteUbergraph_WBP_HUD_MinimapCorner::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_MinimapCorner_C_ExecuteUbergraph_WBP_HUD_MinimapCorner, K2Node_Event_InPlayerData) == 0x000040, "Member 'WBP_HUD_MinimapCorner_C_ExecuteUbergraph_WBP_HUD_MinimapCorner::K2Node_Event_InPlayerData' has a wrong offset!");
static_assert(offsetof(WBP_HUD_MinimapCorner_C_ExecuteUbergraph_WBP_HUD_MinimapCorner, CallFunc_GetOwnedStructures_OutStructures) == 0x000048, "Member 'WBP_HUD_MinimapCorner_C_ExecuteUbergraph_WBP_HUD_MinimapCorner::CallFunc_GetOwnedStructures_OutStructures' has a wrong offset!");
static_assert(offsetof(WBP_HUD_MinimapCorner_C_ExecuteUbergraph_WBP_HUD_MinimapCorner, CallFunc_GetOwnedStructures_ReturnValue) == 0x000058, "Member 'WBP_HUD_MinimapCorner_C_ExecuteUbergraph_WBP_HUD_MinimapCorner::CallFunc_GetOwnedStructures_ReturnValue' has a wrong offset!");

// Function WBP_HUD_MinimapCorner.WBP_HUD_MinimapCorner_C.Get_HorizontalBox_Resources_Visibility
// 0x0018 (0x0018 - 0x0000)
struct WBP_HUD_MinimapCorner_C_Get_HorizontalBox_Resources_Visibility final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATedHUD*                                CallFunc_GetHUD_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSpectatorModeActive_ReturnValue;        // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_MinimapCorner_C_Get_HorizontalBox_Resources_Visibility) == 0x000008, "Wrong alignment on WBP_HUD_MinimapCorner_C_Get_HorizontalBox_Resources_Visibility");
static_assert(sizeof(WBP_HUD_MinimapCorner_C_Get_HorizontalBox_Resources_Visibility) == 0x000018, "Wrong size on WBP_HUD_MinimapCorner_C_Get_HorizontalBox_Resources_Visibility");
static_assert(offsetof(WBP_HUD_MinimapCorner_C_Get_HorizontalBox_Resources_Visibility, ReturnValue) == 0x000000, "Member 'WBP_HUD_MinimapCorner_C_Get_HorizontalBox_Resources_Visibility::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_MinimapCorner_C_Get_HorizontalBox_Resources_Visibility, CallFunc_GetHUD_ReturnValue) == 0x000008, "Member 'WBP_HUD_MinimapCorner_C_Get_HorizontalBox_Resources_Visibility::CallFunc_GetHUD_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_MinimapCorner_C_Get_HorizontalBox_Resources_Visibility, CallFunc_IsSpectatorModeActive_ReturnValue) == 0x000010, "Member 'WBP_HUD_MinimapCorner_C_Get_HorizontalBox_Resources_Visibility::CallFunc_IsSpectatorModeActive_ReturnValue' has a wrong offset!");

// Function WBP_HUD_MinimapCorner.WBP_HUD_MinimapCorner_C.IsPlayingStartupAnim
// 0x0004 (0x0004 - 0x0000)
struct WBP_HUD_MinimapCorner_C_IsPlayingStartupAnim final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlaying_ReturnValue;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_MinimapCorner_C_IsPlayingStartupAnim) == 0x000001, "Wrong alignment on WBP_HUD_MinimapCorner_C_IsPlayingStartupAnim");
static_assert(sizeof(WBP_HUD_MinimapCorner_C_IsPlayingStartupAnim) == 0x000004, "Wrong size on WBP_HUD_MinimapCorner_C_IsPlayingStartupAnim");
static_assert(offsetof(WBP_HUD_MinimapCorner_C_IsPlayingStartupAnim, ReturnValue) == 0x000000, "Member 'WBP_HUD_MinimapCorner_C_IsPlayingStartupAnim::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_MinimapCorner_C_IsPlayingStartupAnim, CallFunc_IsPlaying_ReturnValue) == 0x000001, "Member 'WBP_HUD_MinimapCorner_C_IsPlayingStartupAnim::CallFunc_IsPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_MinimapCorner_C_IsPlayingStartupAnim, CallFunc_IsAnimationPlaying_ReturnValue) == 0x000002, "Member 'WBP_HUD_MinimapCorner_C_IsPlayingStartupAnim::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_MinimapCorner_C_IsPlayingStartupAnim, CallFunc_BooleanOR_ReturnValue) == 0x000003, "Member 'WBP_HUD_MinimapCorner_C_IsPlayingStartupAnim::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function WBP_HUD_MinimapCorner.WBP_HUD_MinimapCorner_C.OnPlayWidgetAnimation
// 0x0068 (0x0068 - 0x0000)
struct WBP_HUD_MinimapCorner_C_OnPlayWidgetAnimation final
{
public:
	struct FGameplayTag                           InAnim;                                            // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	struct FTedThemeMovie                         LocalAnim;                                         // 0x0008(0x0050)(Edit, BlueprintVisible)
	bool                                          GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess;   // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_StartThemed_ReturnValue;               // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A[0x6];                                       // 0x005A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_MinimapCorner_C_OnPlayWidgetAnimation) == 0x000008, "Wrong alignment on WBP_HUD_MinimapCorner_C_OnPlayWidgetAnimation");
static_assert(sizeof(WBP_HUD_MinimapCorner_C_OnPlayWidgetAnimation) == 0x000068, "Wrong size on WBP_HUD_MinimapCorner_C_OnPlayWidgetAnimation");
static_assert(offsetof(WBP_HUD_MinimapCorner_C_OnPlayWidgetAnimation, InAnim) == 0x000000, "Member 'WBP_HUD_MinimapCorner_C_OnPlayWidgetAnimation::InAnim' has a wrong offset!");
static_assert(offsetof(WBP_HUD_MinimapCorner_C_OnPlayWidgetAnimation, LocalAnim) == 0x000008, "Member 'WBP_HUD_MinimapCorner_C_OnPlayWidgetAnimation::LocalAnim' has a wrong offset!");
static_assert(offsetof(WBP_HUD_MinimapCorner_C_OnPlayWidgetAnimation, GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess) == 0x000058, "Member 'WBP_HUD_MinimapCorner_C_OnPlayWidgetAnimation::GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_HUD_MinimapCorner_C_OnPlayWidgetAnimation, CallFunc_K2_StartThemed_ReturnValue) == 0x000059, "Member 'WBP_HUD_MinimapCorner_C_OnPlayWidgetAnimation::CallFunc_K2_StartThemed_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_MinimapCorner_C_OnPlayWidgetAnimation, CallFunc_PlayAnimationForward_ReturnValue) == 0x000060, "Member 'WBP_HUD_MinimapCorner_C_OnPlayWidgetAnimation::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");

// Function WBP_HUD_MinimapCorner.WBP_HUD_MinimapCorner_C.OnStructuresChange_Handler
// 0x0008 (0x0008 - 0x0000)
struct WBP_HUD_MinimapCorner_C_OnStructuresChange_Handler final
{
public:
	class UTedPlayerData*                         InPlayerData;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_MinimapCorner_C_OnStructuresChange_Handler) == 0x000008, "Wrong alignment on WBP_HUD_MinimapCorner_C_OnStructuresChange_Handler");
static_assert(sizeof(WBP_HUD_MinimapCorner_C_OnStructuresChange_Handler) == 0x000008, "Wrong size on WBP_HUD_MinimapCorner_C_OnStructuresChange_Handler");
static_assert(offsetof(WBP_HUD_MinimapCorner_C_OnStructuresChange_Handler, InPlayerData) == 0x000000, "Member 'WBP_HUD_MinimapCorner_C_OnStructuresChange_Handler::InPlayerData' has a wrong offset!");

// Function WBP_HUD_MinimapCorner.WBP_HUD_MinimapCorner_C.OnWorkerWidgetExpanded
// 0x0010 (0x0010 - 0x0000)
struct WBP_HUD_MinimapCorner_C_OnWorkerWidgetExpanded final
{
public:
	bool                                          bWasExpanded;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTedWorkersWidget*                      WorkerWidget;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_MinimapCorner_C_OnWorkerWidgetExpanded) == 0x000008, "Wrong alignment on WBP_HUD_MinimapCorner_C_OnWorkerWidgetExpanded");
static_assert(sizeof(WBP_HUD_MinimapCorner_C_OnWorkerWidgetExpanded) == 0x000010, "Wrong size on WBP_HUD_MinimapCorner_C_OnWorkerWidgetExpanded");
static_assert(offsetof(WBP_HUD_MinimapCorner_C_OnWorkerWidgetExpanded, bWasExpanded) == 0x000000, "Member 'WBP_HUD_MinimapCorner_C_OnWorkerWidgetExpanded::bWasExpanded' has a wrong offset!");
static_assert(offsetof(WBP_HUD_MinimapCorner_C_OnWorkerWidgetExpanded, WorkerWidget) == 0x000008, "Member 'WBP_HUD_MinimapCorner_C_OnWorkerWidgetExpanded::WorkerWidget' has a wrong offset!");

// Function WBP_HUD_MinimapCorner.WBP_HUD_MinimapCorner_C.PlayResourcesAnim
// 0x0010 (0x0010 - 0x0000)
struct WBP_HUD_MinimapCorner_C_PlayResourcesAnim final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          K2Node_Select_Default;                             // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_MinimapCorner_C_PlayResourcesAnim) == 0x000008, "Wrong alignment on WBP_HUD_MinimapCorner_C_PlayResourcesAnim");
static_assert(sizeof(WBP_HUD_MinimapCorner_C_PlayResourcesAnim) == 0x000010, "Wrong size on WBP_HUD_MinimapCorner_C_PlayResourcesAnim");
static_assert(offsetof(WBP_HUD_MinimapCorner_C_PlayResourcesAnim, Temp_bool_Variable) == 0x000000, "Member 'WBP_HUD_MinimapCorner_C_PlayResourcesAnim::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_HUD_MinimapCorner_C_PlayResourcesAnim, Temp_byte_Variable) == 0x000001, "Member 'WBP_HUD_MinimapCorner_C_PlayResourcesAnim::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_HUD_MinimapCorner_C_PlayResourcesAnim, Temp_byte_Variable_1) == 0x000002, "Member 'WBP_HUD_MinimapCorner_C_PlayResourcesAnim::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_HUD_MinimapCorner_C_PlayResourcesAnim, K2Node_Select_Default) == 0x000003, "Member 'WBP_HUD_MinimapCorner_C_PlayResourcesAnim::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_HUD_MinimapCorner_C_PlayResourcesAnim, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'WBP_HUD_MinimapCorner_C_PlayResourcesAnim::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function WBP_HUD_MinimapCorner.WBP_HUD_MinimapCorner_C.ShowNextRelevantResource
// 0x0030 (0x0030 - 0x0000)
struct WBP_HUD_MinimapCorner_C_ShowNextRelevantResource final
{
public:
	int32                                         LocalIndex;                                        // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTedUserWidget*                         CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanPlayWidgetAnimation_ReturnValue;       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_MinimapCorner_C_ShowNextRelevantResource) == 0x000008, "Wrong alignment on WBP_HUD_MinimapCorner_C_ShowNextRelevantResource");
static_assert(sizeof(WBP_HUD_MinimapCorner_C_ShowNextRelevantResource) == 0x000030, "Wrong size on WBP_HUD_MinimapCorner_C_ShowNextRelevantResource");
static_assert(offsetof(WBP_HUD_MinimapCorner_C_ShowNextRelevantResource, LocalIndex) == 0x000000, "Member 'WBP_HUD_MinimapCorner_C_ShowNextRelevantResource::LocalIndex' has a wrong offset!");
static_assert(offsetof(WBP_HUD_MinimapCorner_C_ShowNextRelevantResource, Temp_bool_Variable) == 0x000004, "Member 'WBP_HUD_MinimapCorner_C_ShowNextRelevantResource::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_HUD_MinimapCorner_C_ShowNextRelevantResource, CallFunc_Not_PreBool_ReturnValue) == 0x000005, "Member 'WBP_HUD_MinimapCorner_C_ShowNextRelevantResource::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_MinimapCorner_C_ShowNextRelevantResource, Temp_int_Variable) == 0x000008, "Member 'WBP_HUD_MinimapCorner_C_ShowNextRelevantResource::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_HUD_MinimapCorner_C_ShowNextRelevantResource, CallFunc_Array_Get_Item) == 0x000010, "Member 'WBP_HUD_MinimapCorner_C_ShowNextRelevantResource::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_HUD_MinimapCorner_C_ShowNextRelevantResource, CallFunc_CanPlayWidgetAnimation_ReturnValue) == 0x000018, "Member 'WBP_HUD_MinimapCorner_C_ShowNextRelevantResource::CallFunc_CanPlayWidgetAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_MinimapCorner_C_ShowNextRelevantResource, CallFunc_Add_IntInt_ReturnValue) == 0x00001C, "Member 'WBP_HUD_MinimapCorner_C_ShowNextRelevantResource::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_MinimapCorner_C_ShowNextRelevantResource, CallFunc_Add_IntInt_ReturnValue_1) == 0x000020, "Member 'WBP_HUD_MinimapCorner_C_ShowNextRelevantResource::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_HUD_MinimapCorner_C_ShowNextRelevantResource, CallFunc_Array_LastIndex_ReturnValue) == 0x000024, "Member 'WBP_HUD_MinimapCorner_C_ShowNextRelevantResource::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_MinimapCorner_C_ShowNextRelevantResource, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000028, "Member 'WBP_HUD_MinimapCorner_C_ShowNextRelevantResource::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_MinimapCorner_C_ShowNextRelevantResource, CallFunc_BooleanAND_ReturnValue) == 0x000029, "Member 'WBP_HUD_MinimapCorner_C_ShowNextRelevantResource::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function WBP_HUD_MinimapCorner.WBP_HUD_MinimapCorner_C.ShowResources
// 0x0003 (0x0003 - 0x0000)
struct WBP_HUD_MinimapCorner_C_ShowResources final
{
public:
	bool                                          bInShow;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsStartupSequenceFinished_ReturnValue;    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_MinimapCorner_C_ShowResources) == 0x000001, "Wrong alignment on WBP_HUD_MinimapCorner_C_ShowResources");
static_assert(sizeof(WBP_HUD_MinimapCorner_C_ShowResources) == 0x000003, "Wrong size on WBP_HUD_MinimapCorner_C_ShowResources");
static_assert(offsetof(WBP_HUD_MinimapCorner_C_ShowResources, bInShow) == 0x000000, "Member 'WBP_HUD_MinimapCorner_C_ShowResources::bInShow' has a wrong offset!");
static_assert(offsetof(WBP_HUD_MinimapCorner_C_ShowResources, CallFunc_IsStartupSequenceFinished_ReturnValue) == 0x000001, "Member 'WBP_HUD_MinimapCorner_C_ShowResources::CallFunc_IsStartupSequenceFinished_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_MinimapCorner_C_ShowResources, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000002, "Member 'WBP_HUD_MinimapCorner_C_ShowResources::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");

// Function WBP_HUD_MinimapCorner.WBP_HUD_MinimapCorner_C.OnCanPlayWidgetAnimation
// 0x000C (0x000C - 0x0000)
struct WBP_HUD_MinimapCorner_C_OnCanPlayWidgetAnimation final
{
public:
	struct FGameplayTag                           InAnim;                                            // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue;       // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_MinimapCorner_C_OnCanPlayWidgetAnimation) == 0x000004, "Wrong alignment on WBP_HUD_MinimapCorner_C_OnCanPlayWidgetAnimation");
static_assert(sizeof(WBP_HUD_MinimapCorner_C_OnCanPlayWidgetAnimation) == 0x00000C, "Wrong size on WBP_HUD_MinimapCorner_C_OnCanPlayWidgetAnimation");
static_assert(offsetof(WBP_HUD_MinimapCorner_C_OnCanPlayWidgetAnimation, InAnim) == 0x000000, "Member 'WBP_HUD_MinimapCorner_C_OnCanPlayWidgetAnimation::InAnim' has a wrong offset!");
static_assert(offsetof(WBP_HUD_MinimapCorner_C_OnCanPlayWidgetAnimation, ReturnValue) == 0x000008, "Member 'WBP_HUD_MinimapCorner_C_OnCanPlayWidgetAnimation::ReturnValue' has a wrong offset!");
