#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_HUD_CursorState_Selection

#include "Basic.hpp"

#include "RTSColor_structs.hpp"


namespace SDK::Params
{

// Function WBP_HUD_CursorState_Selection.WBP_HUD_CursorState_Selection_C.ExecuteUbergraph_WBP_HUD_CursorState_Selection
// 0x0028 (0x0028 - 0x0000)
struct WBP_HUD_CursorState_Selection_C_ExecuteUbergraph_WBP_HUD_CursorState_Selection final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERTSAttitudeType                              Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ERTSAttitudeType                              CallFunc_GetCursorAttitude_Out;                    // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetCursorAttitude_ReturnValue;            // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_Select_Default;                             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_CursorState_Selection_C_ExecuteUbergraph_WBP_HUD_CursorState_Selection) == 0x000008, "Wrong alignment on WBP_HUD_CursorState_Selection_C_ExecuteUbergraph_WBP_HUD_CursorState_Selection");
static_assert(sizeof(WBP_HUD_CursorState_Selection_C_ExecuteUbergraph_WBP_HUD_CursorState_Selection) == 0x000028, "Wrong size on WBP_HUD_CursorState_Selection_C_ExecuteUbergraph_WBP_HUD_CursorState_Selection");
static_assert(offsetof(WBP_HUD_CursorState_Selection_C_ExecuteUbergraph_WBP_HUD_CursorState_Selection, EntryPoint) == 0x000000, "Member 'WBP_HUD_CursorState_Selection_C_ExecuteUbergraph_WBP_HUD_CursorState_Selection::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_HUD_CursorState_Selection_C_ExecuteUbergraph_WBP_HUD_CursorState_Selection, Temp_byte_Variable) == 0x000004, "Member 'WBP_HUD_CursorState_Selection_C_ExecuteUbergraph_WBP_HUD_CursorState_Selection::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_HUD_CursorState_Selection_C_ExecuteUbergraph_WBP_HUD_CursorState_Selection, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000008, "Member 'WBP_HUD_CursorState_Selection_C_ExecuteUbergraph_WBP_HUD_CursorState_Selection::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_CursorState_Selection_C_ExecuteUbergraph_WBP_HUD_CursorState_Selection, CallFunc_GetCursorAttitude_Out) == 0x000010, "Member 'WBP_HUD_CursorState_Selection_C_ExecuteUbergraph_WBP_HUD_CursorState_Selection::CallFunc_GetCursorAttitude_Out' has a wrong offset!");
static_assert(offsetof(WBP_HUD_CursorState_Selection_C_ExecuteUbergraph_WBP_HUD_CursorState_Selection, CallFunc_GetCursorAttitude_ReturnValue) == 0x000011, "Member 'WBP_HUD_CursorState_Selection_C_ExecuteUbergraph_WBP_HUD_CursorState_Selection::CallFunc_GetCursorAttitude_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_CursorState_Selection_C_ExecuteUbergraph_WBP_HUD_CursorState_Selection, K2Node_Select_Default) == 0x000018, "Member 'WBP_HUD_CursorState_Selection_C_ExecuteUbergraph_WBP_HUD_CursorState_Selection::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_HUD_CursorState_Selection_C_ExecuteUbergraph_WBP_HUD_CursorState_Selection, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000020, "Member 'WBP_HUD_CursorState_Selection_C_ExecuteUbergraph_WBP_HUD_CursorState_Selection::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");

}

