#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GenericMenu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "Tempest_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_GenericMenu.WBP_GenericMenu_C.RefreshTitles
// 0x00B0 (0x00B0 - 0x0000)
struct WBP_GenericMenu_C_RefreshTitles final
{
public:
	class FText                                   InPrimary;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FText                                   InSecondary;                                       // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          Temp_bool_Variable;                                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0028(0x0048)(HasGetValueTypeHash)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0078(0x0010)(ReferenceParm)
	bool                                          CallFunc_TextIsEmpty_ReturnValue_1;                // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0090(0x0010)()
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x00A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x00A3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x00A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x00A6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x00A7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x00AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x00AB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue_1;                  // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x00AD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x00AE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GenericMenu_C_RefreshTitles) == 0x000008, "Wrong alignment on WBP_GenericMenu_C_RefreshTitles");
static_assert(sizeof(WBP_GenericMenu_C_RefreshTitles) == 0x0000B0, "Wrong size on WBP_GenericMenu_C_RefreshTitles");
static_assert(offsetof(WBP_GenericMenu_C_RefreshTitles, InPrimary) == 0x000000, "Member 'WBP_GenericMenu_C_RefreshTitles::InPrimary' has a wrong offset!");
static_assert(offsetof(WBP_GenericMenu_C_RefreshTitles, InSecondary) == 0x000010, "Member 'WBP_GenericMenu_C_RefreshTitles::InSecondary' has a wrong offset!");
static_assert(offsetof(WBP_GenericMenu_C_RefreshTitles, Temp_bool_Variable) == 0x000020, "Member 'WBP_GenericMenu_C_RefreshTitles::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GenericMenu_C_RefreshTitles, K2Node_MakeStruct_FormatArgumentData) == 0x000028, "Member 'WBP_GenericMenu_C_RefreshTitles::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_GenericMenu_C_RefreshTitles, CallFunc_TextIsEmpty_ReturnValue) == 0x000070, "Member 'WBP_GenericMenu_C_RefreshTitles::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GenericMenu_C_RefreshTitles, K2Node_MakeArray_Array) == 0x000078, "Member 'WBP_GenericMenu_C_RefreshTitles::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_GenericMenu_C_RefreshTitles, CallFunc_TextIsEmpty_ReturnValue_1) == 0x000088, "Member 'WBP_GenericMenu_C_RefreshTitles::CallFunc_TextIsEmpty_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_GenericMenu_C_RefreshTitles, CallFunc_Format_ReturnValue) == 0x000090, "Member 'WBP_GenericMenu_C_RefreshTitles::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GenericMenu_C_RefreshTitles, CallFunc_BooleanOR_ReturnValue) == 0x0000A0, "Member 'WBP_GenericMenu_C_RefreshTitles::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GenericMenu_C_RefreshTitles, Temp_byte_Variable) == 0x0000A1, "Member 'WBP_GenericMenu_C_RefreshTitles::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GenericMenu_C_RefreshTitles, Temp_byte_Variable_1) == 0x0000A2, "Member 'WBP_GenericMenu_C_RefreshTitles::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_GenericMenu_C_RefreshTitles, Temp_bool_Variable_1) == 0x0000A3, "Member 'WBP_GenericMenu_C_RefreshTitles::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_GenericMenu_C_RefreshTitles, Temp_byte_Variable_2) == 0x0000A4, "Member 'WBP_GenericMenu_C_RefreshTitles::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_GenericMenu_C_RefreshTitles, Temp_byte_Variable_3) == 0x0000A5, "Member 'WBP_GenericMenu_C_RefreshTitles::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_GenericMenu_C_RefreshTitles, Temp_bool_Variable_2) == 0x0000A6, "Member 'WBP_GenericMenu_C_RefreshTitles::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_GenericMenu_C_RefreshTitles, K2Node_Select_Default) == 0x0000A7, "Member 'WBP_GenericMenu_C_RefreshTitles::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_GenericMenu_C_RefreshTitles, Temp_byte_Variable_4) == 0x0000A8, "Member 'WBP_GenericMenu_C_RefreshTitles::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_GenericMenu_C_RefreshTitles, Temp_byte_Variable_5) == 0x0000A9, "Member 'WBP_GenericMenu_C_RefreshTitles::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_GenericMenu_C_RefreshTitles, K2Node_Select_Default_1) == 0x0000AA, "Member 'WBP_GenericMenu_C_RefreshTitles::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_GenericMenu_C_RefreshTitles, CallFunc_IsVisible_ReturnValue) == 0x0000AB, "Member 'WBP_GenericMenu_C_RefreshTitles::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GenericMenu_C_RefreshTitles, CallFunc_IsVisible_ReturnValue_1) == 0x0000AC, "Member 'WBP_GenericMenu_C_RefreshTitles::CallFunc_IsVisible_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_GenericMenu_C_RefreshTitles, CallFunc_BooleanOR_ReturnValue_1) == 0x0000AD, "Member 'WBP_GenericMenu_C_RefreshTitles::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_GenericMenu_C_RefreshTitles, K2Node_Select_Default_2) == 0x0000AE, "Member 'WBP_GenericMenu_C_RefreshTitles::K2Node_Select_Default_2' has a wrong offset!");

// Function WBP_GenericMenu.WBP_GenericMenu_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_GenericMenu_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GenericMenu_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_GenericMenu_C_PreConstruct");
static_assert(sizeof(WBP_GenericMenu_C_PreConstruct) == 0x000001, "Wrong size on WBP_GenericMenu_C_PreConstruct");
static_assert(offsetof(WBP_GenericMenu_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_GenericMenu_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_GenericMenu.WBP_GenericMenu_C.PageSwitched
// 0x0004 (0x0004 - 0x0000)
struct WBP_GenericMenu_C_PageSwitched final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GenericMenu_C_PageSwitched) == 0x000004, "Wrong alignment on WBP_GenericMenu_C_PageSwitched");
static_assert(sizeof(WBP_GenericMenu_C_PageSwitched) == 0x000004, "Wrong size on WBP_GenericMenu_C_PageSwitched");
static_assert(offsetof(WBP_GenericMenu_C_PageSwitched, Index_0) == 0x000000, "Member 'WBP_GenericMenu_C_PageSwitched::Index_0' has a wrong offset!");

// Function WBP_GenericMenu.WBP_GenericMenu_C.OnRefreshBackground
// 0x0008 (0x0008 - 0x0000)
struct WBP_GenericMenu_C_OnRefreshBackground final
{
public:
	const class USlateBrushAsset*                 InBackground;                                      // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GenericMenu_C_OnRefreshBackground) == 0x000008, "Wrong alignment on WBP_GenericMenu_C_OnRefreshBackground");
static_assert(sizeof(WBP_GenericMenu_C_OnRefreshBackground) == 0x000008, "Wrong size on WBP_GenericMenu_C_OnRefreshBackground");
static_assert(offsetof(WBP_GenericMenu_C_OnRefreshBackground, InBackground) == 0x000000, "Member 'WBP_GenericMenu_C_OnRefreshBackground::InBackground' has a wrong offset!");

// Function WBP_GenericMenu.WBP_GenericMenu_C.ExecuteUbergraph_WBP_GenericMenu
// 0x00A0 (0x00A0 - 0x0000)
struct WBP_GenericMenu_C_ExecuteUbergraph_WBP_GenericMenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTedContentPanelBase*                   K2Node_ComponentBoundEvent_InContentPanel;         // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UTedContentPanelSlotBase*               K2Node_ComponentBoundEvent_InContentSlot;          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ETedContentSlotState                          K2Node_ComponentBoundEvent_InState;                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bInActivated;           // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsStateActive_ReturnValue;                // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetTitle_ReturnValue;                     // 0x0020(0x0010)(ConstParm)
	class FText                                   CallFunc_GetTitle_ReturnValue_1;                   // 0x0030(0x0010)(ConstParm)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_Index;                          // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTedContentPanelInstanced*              CallFunc_GetTabsPanel_ReturnValue;                 // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetContentSlotsCount_ReturnValue;         // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class USlateBrushAsset*                 K2Node_Event_InBackground;                         // 0x0058(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetContentSlotsCount_ReturnValue_1;       // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0088(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast; // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GenericMenu_C_ExecuteUbergraph_WBP_GenericMenu) == 0x000008, "Wrong alignment on WBP_GenericMenu_C_ExecuteUbergraph_WBP_GenericMenu");
static_assert(sizeof(WBP_GenericMenu_C_ExecuteUbergraph_WBP_GenericMenu) == 0x0000A0, "Wrong size on WBP_GenericMenu_C_ExecuteUbergraph_WBP_GenericMenu");
static_assert(offsetof(WBP_GenericMenu_C_ExecuteUbergraph_WBP_GenericMenu, EntryPoint) == 0x000000, "Member 'WBP_GenericMenu_C_ExecuteUbergraph_WBP_GenericMenu::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_GenericMenu_C_ExecuteUbergraph_WBP_GenericMenu, K2Node_ComponentBoundEvent_InContentPanel) == 0x000008, "Member 'WBP_GenericMenu_C_ExecuteUbergraph_WBP_GenericMenu::K2Node_ComponentBoundEvent_InContentPanel' has a wrong offset!");
static_assert(offsetof(WBP_GenericMenu_C_ExecuteUbergraph_WBP_GenericMenu, K2Node_ComponentBoundEvent_InContentSlot) == 0x000010, "Member 'WBP_GenericMenu_C_ExecuteUbergraph_WBP_GenericMenu::K2Node_ComponentBoundEvent_InContentSlot' has a wrong offset!");
static_assert(offsetof(WBP_GenericMenu_C_ExecuteUbergraph_WBP_GenericMenu, K2Node_ComponentBoundEvent_InState) == 0x000018, "Member 'WBP_GenericMenu_C_ExecuteUbergraph_WBP_GenericMenu::K2Node_ComponentBoundEvent_InState' has a wrong offset!");
static_assert(offsetof(WBP_GenericMenu_C_ExecuteUbergraph_WBP_GenericMenu, K2Node_ComponentBoundEvent_bInActivated) == 0x000019, "Member 'WBP_GenericMenu_C_ExecuteUbergraph_WBP_GenericMenu::K2Node_ComponentBoundEvent_bInActivated' has a wrong offset!");
static_assert(offsetof(WBP_GenericMenu_C_ExecuteUbergraph_WBP_GenericMenu, CallFunc_Not_PreBool_ReturnValue) == 0x00001A, "Member 'WBP_GenericMenu_C_ExecuteUbergraph_WBP_GenericMenu::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GenericMenu_C_ExecuteUbergraph_WBP_GenericMenu, K2Node_SwitchEnum_CmpSuccess) == 0x00001B, "Member 'WBP_GenericMenu_C_ExecuteUbergraph_WBP_GenericMenu::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_GenericMenu_C_ExecuteUbergraph_WBP_GenericMenu, CallFunc_IsStateActive_ReturnValue) == 0x00001C, "Member 'WBP_GenericMenu_C_ExecuteUbergraph_WBP_GenericMenu::CallFunc_IsStateActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GenericMenu_C_ExecuteUbergraph_WBP_GenericMenu, CallFunc_GetTitle_ReturnValue) == 0x000020, "Member 'WBP_GenericMenu_C_ExecuteUbergraph_WBP_GenericMenu::CallFunc_GetTitle_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GenericMenu_C_ExecuteUbergraph_WBP_GenericMenu, CallFunc_GetTitle_ReturnValue_1) == 0x000030, "Member 'WBP_GenericMenu_C_ExecuteUbergraph_WBP_GenericMenu::CallFunc_GetTitle_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_GenericMenu_C_ExecuteUbergraph_WBP_GenericMenu, K2Node_Event_IsDesignTime) == 0x000040, "Member 'WBP_GenericMenu_C_ExecuteUbergraph_WBP_GenericMenu::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_GenericMenu_C_ExecuteUbergraph_WBP_GenericMenu, K2Node_CustomEvent_Index) == 0x000044, "Member 'WBP_GenericMenu_C_ExecuteUbergraph_WBP_GenericMenu::K2Node_CustomEvent_Index' has a wrong offset!");
static_assert(offsetof(WBP_GenericMenu_C_ExecuteUbergraph_WBP_GenericMenu, CallFunc_GetTabsPanel_ReturnValue) == 0x000048, "Member 'WBP_GenericMenu_C_ExecuteUbergraph_WBP_GenericMenu::CallFunc_GetTabsPanel_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GenericMenu_C_ExecuteUbergraph_WBP_GenericMenu, CallFunc_GetContentSlotsCount_ReturnValue) == 0x000050, "Member 'WBP_GenericMenu_C_ExecuteUbergraph_WBP_GenericMenu::CallFunc_GetContentSlotsCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GenericMenu_C_ExecuteUbergraph_WBP_GenericMenu, K2Node_Event_InBackground) == 0x000058, "Member 'WBP_GenericMenu_C_ExecuteUbergraph_WBP_GenericMenu::K2Node_Event_InBackground' has a wrong offset!");
static_assert(offsetof(WBP_GenericMenu_C_ExecuteUbergraph_WBP_GenericMenu, CallFunc_Greater_IntInt_ReturnValue) == 0x000060, "Member 'WBP_GenericMenu_C_ExecuteUbergraph_WBP_GenericMenu::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GenericMenu_C_ExecuteUbergraph_WBP_GenericMenu, CallFunc_GetContentSlotsCount_ReturnValue_1) == 0x000064, "Member 'WBP_GenericMenu_C_ExecuteUbergraph_WBP_GenericMenu::CallFunc_GetContentSlotsCount_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_GenericMenu_C_ExecuteUbergraph_WBP_GenericMenu, CallFunc_Subtract_IntInt_ReturnValue) == 0x000068, "Member 'WBP_GenericMenu_C_ExecuteUbergraph_WBP_GenericMenu::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GenericMenu_C_ExecuteUbergraph_WBP_GenericMenu, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000070, "Member 'WBP_GenericMenu_C_ExecuteUbergraph_WBP_GenericMenu::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GenericMenu_C_ExecuteUbergraph_WBP_GenericMenu, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000078, "Member 'WBP_GenericMenu_C_ExecuteUbergraph_WBP_GenericMenu::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GenericMenu_C_ExecuteUbergraph_WBP_GenericMenu, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000080, "Member 'WBP_GenericMenu_C_ExecuteUbergraph_WBP_GenericMenu::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GenericMenu_C_ExecuteUbergraph_WBP_GenericMenu, CallFunc_MakeVector2D_ReturnValue) == 0x000088, "Member 'WBP_GenericMenu_C_ExecuteUbergraph_WBP_GenericMenu::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GenericMenu_C_ExecuteUbergraph_WBP_GenericMenu, CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast) == 0x000098, "Member 'WBP_GenericMenu_C_ExecuteUbergraph_WBP_GenericMenu::CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast' has a wrong offset!");

// Function WBP_GenericMenu.WBP_GenericMenu_C.BndEvt__WBP_Misc_MenuScreenPage_TabsPanel_K2Node_ComponentBoundEvent_0_ContentPanelStateDelegateSignature__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct WBP_GenericMenu_C_BndEvt__WBP_Misc_MenuScreenPage_TabsPanel_K2Node_ComponentBoundEvent_0_ContentPanelStateDelegateSignature__DelegateSignature final
{
public:
	class UTedContentPanelBase*                   InContentPanel;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UTedContentPanelSlotBase*               InContentSlot;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ETedContentSlotState                          InState;                                           // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bInActivated;                                      // 0x0011(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GenericMenu_C_BndEvt__WBP_Misc_MenuScreenPage_TabsPanel_K2Node_ComponentBoundEvent_0_ContentPanelStateDelegateSignature__DelegateSignature) == 0x000008, "Wrong alignment on WBP_GenericMenu_C_BndEvt__WBP_Misc_MenuScreenPage_TabsPanel_K2Node_ComponentBoundEvent_0_ContentPanelStateDelegateSignature__DelegateSignature");
static_assert(sizeof(WBP_GenericMenu_C_BndEvt__WBP_Misc_MenuScreenPage_TabsPanel_K2Node_ComponentBoundEvent_0_ContentPanelStateDelegateSignature__DelegateSignature) == 0x000018, "Wrong size on WBP_GenericMenu_C_BndEvt__WBP_Misc_MenuScreenPage_TabsPanel_K2Node_ComponentBoundEvent_0_ContentPanelStateDelegateSignature__DelegateSignature");
static_assert(offsetof(WBP_GenericMenu_C_BndEvt__WBP_Misc_MenuScreenPage_TabsPanel_K2Node_ComponentBoundEvent_0_ContentPanelStateDelegateSignature__DelegateSignature, InContentPanel) == 0x000000, "Member 'WBP_GenericMenu_C_BndEvt__WBP_Misc_MenuScreenPage_TabsPanel_K2Node_ComponentBoundEvent_0_ContentPanelStateDelegateSignature__DelegateSignature::InContentPanel' has a wrong offset!");
static_assert(offsetof(WBP_GenericMenu_C_BndEvt__WBP_Misc_MenuScreenPage_TabsPanel_K2Node_ComponentBoundEvent_0_ContentPanelStateDelegateSignature__DelegateSignature, InContentSlot) == 0x000008, "Member 'WBP_GenericMenu_C_BndEvt__WBP_Misc_MenuScreenPage_TabsPanel_K2Node_ComponentBoundEvent_0_ContentPanelStateDelegateSignature__DelegateSignature::InContentSlot' has a wrong offset!");
static_assert(offsetof(WBP_GenericMenu_C_BndEvt__WBP_Misc_MenuScreenPage_TabsPanel_K2Node_ComponentBoundEvent_0_ContentPanelStateDelegateSignature__DelegateSignature, InState) == 0x000010, "Member 'WBP_GenericMenu_C_BndEvt__WBP_Misc_MenuScreenPage_TabsPanel_K2Node_ComponentBoundEvent_0_ContentPanelStateDelegateSignature__DelegateSignature::InState' has a wrong offset!");
static_assert(offsetof(WBP_GenericMenu_C_BndEvt__WBP_Misc_MenuScreenPage_TabsPanel_K2Node_ComponentBoundEvent_0_ContentPanelStateDelegateSignature__DelegateSignature, bInActivated) == 0x000011, "Member 'WBP_GenericMenu_C_BndEvt__WBP_Misc_MenuScreenPage_TabsPanel_K2Node_ComponentBoundEvent_0_ContentPanelStateDelegateSignature__DelegateSignature::bInActivated' has a wrong offset!");

}

