#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ScoreScreen_Achievements_Slot

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Tempest_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ScoreScreen_Achievements_Slot.WBP_ScoreScreen_Achievements_Slot_C
// 0x0028 (0x0458 - 0x0430)
class UWBP_ScoreScreen_Achievements_Slot_C final : public UTedContentPanelSlotButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0430(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Intro;                                             // 0x0438(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_BG;                                          // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Frame;                                       // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MoviePlayer_Fill_C*                IntroAnim;                                         // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BndEvt__WBP_ScoreScreen_Achievements_Slot_IntroAnim_K2Node_ComponentBoundEvent_0_OnVisibilityChangedEvent__DelegateSignature(ESlateVisibility InVisibility);
	void Construct();
	void ExecuteUbergraph_WBP_ScoreScreen_Achievements_Slot(int32 EntryPoint);
	void PlayIntroAnim();
	void SequenceEvent__ENTRYPOINTWBP_ScoreScreen_Achievements_Slot();
	void Show();

	void GetMaterialsSupportingStates(TArray<class UMaterialInstanceDynamic*>* OutMIDs) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ScoreScreen_Achievements_Slot_C">();
	}
	static class UWBP_ScoreScreen_Achievements_Slot_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ScoreScreen_Achievements_Slot_C>();
	}
};
static_assert(alignof(UWBP_ScoreScreen_Achievements_Slot_C) == 0x000008, "Wrong alignment on UWBP_ScoreScreen_Achievements_Slot_C");
static_assert(sizeof(UWBP_ScoreScreen_Achievements_Slot_C) == 0x000458, "Wrong size on UWBP_ScoreScreen_Achievements_Slot_C");
static_assert(offsetof(UWBP_ScoreScreen_Achievements_Slot_C, UberGraphFrame) == 0x000430, "Member 'UWBP_ScoreScreen_Achievements_Slot_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ScoreScreen_Achievements_Slot_C, Intro) == 0x000438, "Member 'UWBP_ScoreScreen_Achievements_Slot_C::Intro' has a wrong offset!");
static_assert(offsetof(UWBP_ScoreScreen_Achievements_Slot_C, Image_BG) == 0x000440, "Member 'UWBP_ScoreScreen_Achievements_Slot_C::Image_BG' has a wrong offset!");
static_assert(offsetof(UWBP_ScoreScreen_Achievements_Slot_C, Image_Frame) == 0x000448, "Member 'UWBP_ScoreScreen_Achievements_Slot_C::Image_Frame' has a wrong offset!");
static_assert(offsetof(UWBP_ScoreScreen_Achievements_Slot_C, IntroAnim) == 0x000450, "Member 'UWBP_ScoreScreen_Achievements_Slot_C::IntroAnim' has a wrong offset!");

}

