#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_HUD_MinimapCorner

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Tempest_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_HUD_MinimapCorner.WBP_HUD_MinimapCorner_C
// 0x0098 (0x04A8 - 0x0410)
class UWBP_HUD_MinimapCorner_C final : public UTedPlayerDataWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0410(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anim_ShowResources;                                // 0x0418(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_StartupSequence;                              // 0x0420(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UButton*                                Button_Options;                                    // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_HUD_Resources_Credits_C*           Credits;                                           // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_Resources;                           // 0x0438(0x0008)(ExportObject, ZeroConstructor, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_HUD_Resources_Intel_C*             Intel;                                             // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MoviePlayer_Fill_C*                IntroAnim;                                         // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Minimap;                                   // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_HUD_Resources_Placeholder_C*       Placeholder;                                       // 0x0458(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_HUD_Resources_Population_C*        Population;                                        // 0x0460(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_HUD_Resources_Power_C*             Power;                                             // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SpecialistsCard_C*                 SpecialistsWidget;                                 // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_HUD_StructureControls_Panel_C*     StructureControls;                                 // 0x0478(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_HarvestersCard_C*                  WorkersWidget;                                     // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bShowResourcesWithNoBuildings;                     // 0x0488(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bShowResources;                                    // 0x0489(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_48A[0x6];                                      // 0x048A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UTedUserWidget*>                 ResourceWidgets;                                   // 0x0490(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	int32                                         LastShownResource;                                 // 0x04A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_HUD_MinimapCorner_Button_Options_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_HUD_MinimapCorner_WBP_MoviePlayer_Fill_K2Node_ComponentBoundEvent_2_TedMoviePlayerWidgetEventDelegate__DelegateSignature(class UTedMoviePlayerWidgetV2* InWidget, const class UFileMediaSource* InSource);
	void CacheResourceWidgets();
	void Construct();
	void ExecuteUbergraph_WBP_HUD_MinimapCorner(int32 EntryPoint);
	ESlateVisibility Get_HorizontalBox_Resources_Visibility();
	bool IsPlayingStartupAnim();
	void OnInitialized();
	void OnPlayWidgetAnimation(const struct FGameplayTag& InAnim);
	void OnStructuresChange_Handler(class UTedPlayerData* InPlayerData);
	void OnWorkerWidgetExpanded(bool bWasExpanded, class UTedWorkersWidget* WorkerWidget);
	void PlayResourcesAnim();
	void PlayShowResourcesAnimIfNeeded();
	void SequenceEvent__ENTRYPOINTWBP_HUD_MinimapCorner();
	void SequenceEvent__ENTRYPOINTWBP_HUD_MinimapCorner_0();
	void SequenceEvent__ENTRYPOINTWBP_HUD_MinimapCorner_1();
	void SequenceEvent__ENTRYPOINTWBP_HUD_MinimapCorner_2();
	void SequenceEvent__ENTRYPOINTWBP_HUD_MinimapCorner_3();
	void ShowNextRelevantResource();
	void ShowResources(bool bInShow);

	bool OnCanPlayWidgetAnimation(const struct FGameplayTag& InAnim) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_HUD_MinimapCorner_C">();
	}
	static class UWBP_HUD_MinimapCorner_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_HUD_MinimapCorner_C>();
	}
};
static_assert(alignof(UWBP_HUD_MinimapCorner_C) == 0x000008, "Wrong alignment on UWBP_HUD_MinimapCorner_C");
static_assert(sizeof(UWBP_HUD_MinimapCorner_C) == 0x0004A8, "Wrong size on UWBP_HUD_MinimapCorner_C");
static_assert(offsetof(UWBP_HUD_MinimapCorner_C, UberGraphFrame) == 0x000410, "Member 'UWBP_HUD_MinimapCorner_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_MinimapCorner_C, Anim_ShowResources) == 0x000418, "Member 'UWBP_HUD_MinimapCorner_C::Anim_ShowResources' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_MinimapCorner_C, Anim_StartupSequence) == 0x000420, "Member 'UWBP_HUD_MinimapCorner_C::Anim_StartupSequence' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_MinimapCorner_C, Button_Options) == 0x000428, "Member 'UWBP_HUD_MinimapCorner_C::Button_Options' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_MinimapCorner_C, Credits) == 0x000430, "Member 'UWBP_HUD_MinimapCorner_C::Credits' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_MinimapCorner_C, HorizontalBox_Resources) == 0x000438, "Member 'UWBP_HUD_MinimapCorner_C::HorizontalBox_Resources' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_MinimapCorner_C, Intel) == 0x000440, "Member 'UWBP_HUD_MinimapCorner_C::Intel' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_MinimapCorner_C, IntroAnim) == 0x000448, "Member 'UWBP_HUD_MinimapCorner_C::IntroAnim' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_MinimapCorner_C, Overlay_Minimap) == 0x000450, "Member 'UWBP_HUD_MinimapCorner_C::Overlay_Minimap' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_MinimapCorner_C, Placeholder) == 0x000458, "Member 'UWBP_HUD_MinimapCorner_C::Placeholder' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_MinimapCorner_C, Population) == 0x000460, "Member 'UWBP_HUD_MinimapCorner_C::Population' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_MinimapCorner_C, Power) == 0x000468, "Member 'UWBP_HUD_MinimapCorner_C::Power' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_MinimapCorner_C, SpecialistsWidget) == 0x000470, "Member 'UWBP_HUD_MinimapCorner_C::SpecialistsWidget' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_MinimapCorner_C, StructureControls) == 0x000478, "Member 'UWBP_HUD_MinimapCorner_C::StructureControls' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_MinimapCorner_C, WorkersWidget) == 0x000480, "Member 'UWBP_HUD_MinimapCorner_C::WorkersWidget' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_MinimapCorner_C, bShowResourcesWithNoBuildings) == 0x000488, "Member 'UWBP_HUD_MinimapCorner_C::bShowResourcesWithNoBuildings' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_MinimapCorner_C, bShowResources) == 0x000489, "Member 'UWBP_HUD_MinimapCorner_C::bShowResources' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_MinimapCorner_C, ResourceWidgets) == 0x000490, "Member 'UWBP_HUD_MinimapCorner_C::ResourceWidgets' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_MinimapCorner_C, LastShownResource) == 0x0004A0, "Member 'UWBP_HUD_MinimapCorner_C::LastShownResource' has a wrong offset!");

}

