#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SpecialistsCard

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_SpecialistsCard.WBP_SpecialistsCard_C.ExecuteUbergraph_WBP_SpecialistsCard
// 0x0018 (0x0018 - 0x0000)
struct WBP_SpecialistsCard_C_ExecuteUbergraph_WBP_SpecialistsCard final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_SpecialistsCard_Button_C*          K2Node_DynamicCast_AsWBP_Specialists_Card_Button;  // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SpecialistsCard_C_ExecuteUbergraph_WBP_SpecialistsCard) == 0x000008, "Wrong alignment on WBP_SpecialistsCard_C_ExecuteUbergraph_WBP_SpecialistsCard");
static_assert(sizeof(WBP_SpecialistsCard_C_ExecuteUbergraph_WBP_SpecialistsCard) == 0x000018, "Wrong size on WBP_SpecialistsCard_C_ExecuteUbergraph_WBP_SpecialistsCard");
static_assert(offsetof(WBP_SpecialistsCard_C_ExecuteUbergraph_WBP_SpecialistsCard, EntryPoint) == 0x000000, "Member 'WBP_SpecialistsCard_C_ExecuteUbergraph_WBP_SpecialistsCard::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_SpecialistsCard_C_ExecuteUbergraph_WBP_SpecialistsCard, K2Node_DynamicCast_AsWBP_Specialists_Card_Button) == 0x000008, "Member 'WBP_SpecialistsCard_C_ExecuteUbergraph_WBP_SpecialistsCard::K2Node_DynamicCast_AsWBP_Specialists_Card_Button' has a wrong offset!");
static_assert(offsetof(WBP_SpecialistsCard_C_ExecuteUbergraph_WBP_SpecialistsCard, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'WBP_SpecialistsCard_C_ExecuteUbergraph_WBP_SpecialistsCard::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

