#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ScoreScreen_StatTable_Cell_Pawn

#include "Basic.hpp"

#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ScoreScreen_StatTable_Cell_Pawn.WBP_ScoreScreen_StatTable_Cell_Pawn_C
// 0x0020 (0x0308 - 0x02E8)
class UWBP_ScoreScreen_StatTable_Cell_Pawn_C final : public UUserWidget
{
public:
	class UImage*                                 Image_Icon;                                        // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Name;                                         // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UTexture2D*>                     FactionIcons;                                      // 0x02F8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void DisplayPawn(class UTexture2D* InIcon, const class FText& InName);
	void UpdateUnitIcon(class UTexture2D* Icon);
	void UpdateUnitName(const class FText& Name_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ScoreScreen_StatTable_Cell_Pawn_C">();
	}
	static class UWBP_ScoreScreen_StatTable_Cell_Pawn_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ScoreScreen_StatTable_Cell_Pawn_C>();
	}
};
static_assert(alignof(UWBP_ScoreScreen_StatTable_Cell_Pawn_C) == 0x000008, "Wrong alignment on UWBP_ScoreScreen_StatTable_Cell_Pawn_C");
static_assert(sizeof(UWBP_ScoreScreen_StatTable_Cell_Pawn_C) == 0x000308, "Wrong size on UWBP_ScoreScreen_StatTable_Cell_Pawn_C");
static_assert(offsetof(UWBP_ScoreScreen_StatTable_Cell_Pawn_C, Image_Icon) == 0x0002E8, "Member 'UWBP_ScoreScreen_StatTable_Cell_Pawn_C::Image_Icon' has a wrong offset!");
static_assert(offsetof(UWBP_ScoreScreen_StatTable_Cell_Pawn_C, Text_Name) == 0x0002F0, "Member 'UWBP_ScoreScreen_StatTable_Cell_Pawn_C::Text_Name' has a wrong offset!");
static_assert(offsetof(UWBP_ScoreScreen_StatTable_Cell_Pawn_C, FactionIcons) == 0x0002F8, "Member 'UWBP_ScoreScreen_StatTable_Cell_Pawn_C::FactionIcons' has a wrong offset!");

}

