#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ScoreScreen_StatTable_Headers_Slot

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Slate_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Tempest_structs.hpp"


namespace SDK::Params
{

// Function WBP_ScoreScreen_StatTable_Headers_Slot.WBP_ScoreScreen_StatTable_Headers_Slot_C.ExecuteUbergraph_WBP_ScoreScreen_StatTable_Headers_Slot
// 0x0050 (0x0050 - 0x0000)
struct WBP_ScoreScreen_StatTable_Headers_Slot_C_ExecuteUbergraph_WBP_ScoreScreen_StatTable_Headers_Slot final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTedTableHeaderContent                 CallFunc_GetContent_OutContent;                    // 0x0008(0x0028)()
	bool                                          CallFunc_GetContent_bOutFound;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETedContentSlotState                          K2Node_Event_InState;                              // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInActivated;                         // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0038(0x0014)()
};
static_assert(alignof(WBP_ScoreScreen_StatTable_Headers_Slot_C_ExecuteUbergraph_WBP_ScoreScreen_StatTable_Headers_Slot) == 0x000008, "Wrong alignment on WBP_ScoreScreen_StatTable_Headers_Slot_C_ExecuteUbergraph_WBP_ScoreScreen_StatTable_Headers_Slot");
static_assert(sizeof(WBP_ScoreScreen_StatTable_Headers_Slot_C_ExecuteUbergraph_WBP_ScoreScreen_StatTable_Headers_Slot) == 0x000050, "Wrong size on WBP_ScoreScreen_StatTable_Headers_Slot_C_ExecuteUbergraph_WBP_ScoreScreen_StatTable_Headers_Slot");
static_assert(offsetof(WBP_ScoreScreen_StatTable_Headers_Slot_C_ExecuteUbergraph_WBP_ScoreScreen_StatTable_Headers_Slot, EntryPoint) == 0x000000, "Member 'WBP_ScoreScreen_StatTable_Headers_Slot_C_ExecuteUbergraph_WBP_ScoreScreen_StatTable_Headers_Slot::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_ScoreScreen_StatTable_Headers_Slot_C_ExecuteUbergraph_WBP_ScoreScreen_StatTable_Headers_Slot, CallFunc_GetContent_OutContent) == 0x000008, "Member 'WBP_ScoreScreen_StatTable_Headers_Slot_C_ExecuteUbergraph_WBP_ScoreScreen_StatTable_Headers_Slot::CallFunc_GetContent_OutContent' has a wrong offset!");
static_assert(offsetof(WBP_ScoreScreen_StatTable_Headers_Slot_C_ExecuteUbergraph_WBP_ScoreScreen_StatTable_Headers_Slot, CallFunc_GetContent_bOutFound) == 0x000030, "Member 'WBP_ScoreScreen_StatTable_Headers_Slot_C_ExecuteUbergraph_WBP_ScoreScreen_StatTable_Headers_Slot::CallFunc_GetContent_bOutFound' has a wrong offset!");
static_assert(offsetof(WBP_ScoreScreen_StatTable_Headers_Slot_C_ExecuteUbergraph_WBP_ScoreScreen_StatTable_Headers_Slot, K2Node_Event_InState) == 0x000031, "Member 'WBP_ScoreScreen_StatTable_Headers_Slot_C_ExecuteUbergraph_WBP_ScoreScreen_StatTable_Headers_Slot::K2Node_Event_InState' has a wrong offset!");
static_assert(offsetof(WBP_ScoreScreen_StatTable_Headers_Slot_C_ExecuteUbergraph_WBP_ScoreScreen_StatTable_Headers_Slot, K2Node_Event_bInActivated) == 0x000032, "Member 'WBP_ScoreScreen_StatTable_Headers_Slot_C_ExecuteUbergraph_WBP_ScoreScreen_StatTable_Headers_Slot::K2Node_Event_bInActivated' has a wrong offset!");
static_assert(offsetof(WBP_ScoreScreen_StatTable_Headers_Slot_C_ExecuteUbergraph_WBP_ScoreScreen_StatTable_Headers_Slot, K2Node_SwitchEnum_CmpSuccess) == 0x000033, "Member 'WBP_ScoreScreen_StatTable_Headers_Slot_C_ExecuteUbergraph_WBP_ScoreScreen_StatTable_Headers_Slot::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_ScoreScreen_StatTable_Headers_Slot_C_ExecuteUbergraph_WBP_ScoreScreen_StatTable_Headers_Slot, K2Node_Event_IsDesignTime) == 0x000034, "Member 'WBP_ScoreScreen_StatTable_Headers_Slot_C_ExecuteUbergraph_WBP_ScoreScreen_StatTable_Headers_Slot::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_ScoreScreen_StatTable_Headers_Slot_C_ExecuteUbergraph_WBP_ScoreScreen_StatTable_Headers_Slot, K2Node_MakeStruct_SlateColor) == 0x000038, "Member 'WBP_ScoreScreen_StatTable_Headers_Slot_C_ExecuteUbergraph_WBP_ScoreScreen_StatTable_Headers_Slot::K2Node_MakeStruct_SlateColor' has a wrong offset!");

// Function WBP_ScoreScreen_StatTable_Headers_Slot.WBP_ScoreScreen_StatTable_Headers_Slot_C.GetContent
// 0x0070 (0x0070 - 0x0000)
struct WBP_ScoreScreen_StatTable_Headers_Slot_C_GetContent final
{
public:
	struct FTedTableHeaderContent                 OutContent;                                        // 0x0000(0x0028)(Parm, OutParm)
	bool                                          bOutFound;                                         // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTedScoreScreenHeadersPanel*            CallFunc_GetHeadersPanel_OutPanel;                 // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSlotIndex_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTedTableHeaderContent                 CallFunc_GetContent_OutContent;                    // 0x0040(0x0028)()
	bool                                          CallFunc_GetContent_ReturnValue;                   // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ScoreScreen_StatTable_Headers_Slot_C_GetContent) == 0x000008, "Wrong alignment on WBP_ScoreScreen_StatTable_Headers_Slot_C_GetContent");
static_assert(sizeof(WBP_ScoreScreen_StatTable_Headers_Slot_C_GetContent) == 0x000070, "Wrong size on WBP_ScoreScreen_StatTable_Headers_Slot_C_GetContent");
static_assert(offsetof(WBP_ScoreScreen_StatTable_Headers_Slot_C_GetContent, OutContent) == 0x000000, "Member 'WBP_ScoreScreen_StatTable_Headers_Slot_C_GetContent::OutContent' has a wrong offset!");
static_assert(offsetof(WBP_ScoreScreen_StatTable_Headers_Slot_C_GetContent, bOutFound) == 0x000028, "Member 'WBP_ScoreScreen_StatTable_Headers_Slot_C_GetContent::bOutFound' has a wrong offset!");
static_assert(offsetof(WBP_ScoreScreen_StatTable_Headers_Slot_C_GetContent, CallFunc_GetHeadersPanel_OutPanel) == 0x000030, "Member 'WBP_ScoreScreen_StatTable_Headers_Slot_C_GetContent::CallFunc_GetHeadersPanel_OutPanel' has a wrong offset!");
static_assert(offsetof(WBP_ScoreScreen_StatTable_Headers_Slot_C_GetContent, CallFunc_GetSlotIndex_ReturnValue) == 0x000038, "Member 'WBP_ScoreScreen_StatTable_Headers_Slot_C_GetContent::CallFunc_GetSlotIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ScoreScreen_StatTable_Headers_Slot_C_GetContent, CallFunc_GetContent_OutContent) == 0x000040, "Member 'WBP_ScoreScreen_StatTable_Headers_Slot_C_GetContent::CallFunc_GetContent_OutContent' has a wrong offset!");
static_assert(offsetof(WBP_ScoreScreen_StatTable_Headers_Slot_C_GetContent, CallFunc_GetContent_ReturnValue) == 0x000068, "Member 'WBP_ScoreScreen_StatTable_Headers_Slot_C_GetContent::CallFunc_GetContent_ReturnValue' has a wrong offset!");

// Function WBP_ScoreScreen_StatTable_Headers_Slot.WBP_ScoreScreen_StatTable_Headers_Slot_C.GetHeadersPanel
// 0x0020 (0x0020 - 0x0000)
struct WBP_ScoreScreen_StatTable_Headers_Slot_C_GetHeadersPanel final
{
public:
	class UTedScoreScreenHeadersPanel*            OutPanel;                                          // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UTedContentPanelBase*                   CallFunc_GetParentContentPanel_ReturnValue;        // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UTedScoreScreenHeadersPanel*            K2Node_DynamicCast_AsTed_Score_Screen_Headers_Panel; // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ScoreScreen_StatTable_Headers_Slot_C_GetHeadersPanel) == 0x000008, "Wrong alignment on WBP_ScoreScreen_StatTable_Headers_Slot_C_GetHeadersPanel");
static_assert(sizeof(WBP_ScoreScreen_StatTable_Headers_Slot_C_GetHeadersPanel) == 0x000020, "Wrong size on WBP_ScoreScreen_StatTable_Headers_Slot_C_GetHeadersPanel");
static_assert(offsetof(WBP_ScoreScreen_StatTable_Headers_Slot_C_GetHeadersPanel, OutPanel) == 0x000000, "Member 'WBP_ScoreScreen_StatTable_Headers_Slot_C_GetHeadersPanel::OutPanel' has a wrong offset!");
static_assert(offsetof(WBP_ScoreScreen_StatTable_Headers_Slot_C_GetHeadersPanel, CallFunc_GetParentContentPanel_ReturnValue) == 0x000008, "Member 'WBP_ScoreScreen_StatTable_Headers_Slot_C_GetHeadersPanel::CallFunc_GetParentContentPanel_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ScoreScreen_StatTable_Headers_Slot_C_GetHeadersPanel, K2Node_DynamicCast_AsTed_Score_Screen_Headers_Panel) == 0x000010, "Member 'WBP_ScoreScreen_StatTable_Headers_Slot_C_GetHeadersPanel::K2Node_DynamicCast_AsTed_Score_Screen_Headers_Panel' has a wrong offset!");
static_assert(offsetof(WBP_ScoreScreen_StatTable_Headers_Slot_C_GetHeadersPanel, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WBP_ScoreScreen_StatTable_Headers_Slot_C_GetHeadersPanel::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WBP_ScoreScreen_StatTable_Headers_Slot.WBP_ScoreScreen_StatTable_Headers_Slot_C.OnActivateState
// 0x0002 (0x0002 - 0x0000)
struct WBP_ScoreScreen_StatTable_Headers_Slot_C_OnActivateState final
{
public:
	ETedContentSlotState                          InState;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bInActivated;                                      // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ScoreScreen_StatTable_Headers_Slot_C_OnActivateState) == 0x000001, "Wrong alignment on WBP_ScoreScreen_StatTable_Headers_Slot_C_OnActivateState");
static_assert(sizeof(WBP_ScoreScreen_StatTable_Headers_Slot_C_OnActivateState) == 0x000002, "Wrong size on WBP_ScoreScreen_StatTable_Headers_Slot_C_OnActivateState");
static_assert(offsetof(WBP_ScoreScreen_StatTable_Headers_Slot_C_OnActivateState, InState) == 0x000000, "Member 'WBP_ScoreScreen_StatTable_Headers_Slot_C_OnActivateState::InState' has a wrong offset!");
static_assert(offsetof(WBP_ScoreScreen_StatTable_Headers_Slot_C_OnActivateState, bInActivated) == 0x000001, "Member 'WBP_ScoreScreen_StatTable_Headers_Slot_C_OnActivateState::bInActivated' has a wrong offset!");

// Function WBP_ScoreScreen_StatTable_Headers_Slot.WBP_ScoreScreen_StatTable_Headers_Slot_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_ScoreScreen_StatTable_Headers_Slot_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ScoreScreen_StatTable_Headers_Slot_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_ScoreScreen_StatTable_Headers_Slot_C_PreConstruct");
static_assert(sizeof(WBP_ScoreScreen_StatTable_Headers_Slot_C_PreConstruct) == 0x000001, "Wrong size on WBP_ScoreScreen_StatTable_Headers_Slot_C_PreConstruct");
static_assert(offsetof(WBP_ScoreScreen_StatTable_Headers_Slot_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_ScoreScreen_StatTable_Headers_Slot_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_ScoreScreen_StatTable_Headers_Slot.WBP_ScoreScreen_StatTable_Headers_Slot_C.RefreshAscendingIcon
// 0x0038 (0x0038 - 0x0000)
struct WBP_ScoreScreen_StatTable_Headers_Slot_C_RefreshAscendingIcon final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable;                                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1;                              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTedScoreScreenHeadersPanel*            CallFunc_GetHeadersPanel_OutPanel;                 // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSortingEnabled_ReturnValue;             // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsStateActive_ReturnValue;                // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsStateActive_ReturnValue_1;              // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_Select_Default;                             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetRenderTransformAngle_Angle_ImplicitCast; // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ScoreScreen_StatTable_Headers_Slot_C_RefreshAscendingIcon) == 0x000008, "Wrong alignment on WBP_ScoreScreen_StatTable_Headers_Slot_C_RefreshAscendingIcon");
static_assert(sizeof(WBP_ScoreScreen_StatTable_Headers_Slot_C_RefreshAscendingIcon) == 0x000038, "Wrong size on WBP_ScoreScreen_StatTable_Headers_Slot_C_RefreshAscendingIcon");
static_assert(offsetof(WBP_ScoreScreen_StatTable_Headers_Slot_C_RefreshAscendingIcon, Temp_bool_Variable) == 0x000000, "Member 'WBP_ScoreScreen_StatTable_Headers_Slot_C_RefreshAscendingIcon::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ScoreScreen_StatTable_Headers_Slot_C_RefreshAscendingIcon, Temp_byte_Variable) == 0x000001, "Member 'WBP_ScoreScreen_StatTable_Headers_Slot_C_RefreshAscendingIcon::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ScoreScreen_StatTable_Headers_Slot_C_RefreshAscendingIcon, Temp_byte_Variable_1) == 0x000002, "Member 'WBP_ScoreScreen_StatTable_Headers_Slot_C_RefreshAscendingIcon::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ScoreScreen_StatTable_Headers_Slot_C_RefreshAscendingIcon, Temp_bool_Variable_1) == 0x000003, "Member 'WBP_ScoreScreen_StatTable_Headers_Slot_C_RefreshAscendingIcon::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ScoreScreen_StatTable_Headers_Slot_C_RefreshAscendingIcon, Temp_real_Variable) == 0x000008, "Member 'WBP_ScoreScreen_StatTable_Headers_Slot_C_RefreshAscendingIcon::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ScoreScreen_StatTable_Headers_Slot_C_RefreshAscendingIcon, Temp_real_Variable_1) == 0x000010, "Member 'WBP_ScoreScreen_StatTable_Headers_Slot_C_RefreshAscendingIcon::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ScoreScreen_StatTable_Headers_Slot_C_RefreshAscendingIcon, CallFunc_GetHeadersPanel_OutPanel) == 0x000018, "Member 'WBP_ScoreScreen_StatTable_Headers_Slot_C_RefreshAscendingIcon::CallFunc_GetHeadersPanel_OutPanel' has a wrong offset!");
static_assert(offsetof(WBP_ScoreScreen_StatTable_Headers_Slot_C_RefreshAscendingIcon, CallFunc_IsSortingEnabled_ReturnValue) == 0x000020, "Member 'WBP_ScoreScreen_StatTable_Headers_Slot_C_RefreshAscendingIcon::CallFunc_IsSortingEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ScoreScreen_StatTable_Headers_Slot_C_RefreshAscendingIcon, CallFunc_IsStateActive_ReturnValue) == 0x000021, "Member 'WBP_ScoreScreen_StatTable_Headers_Slot_C_RefreshAscendingIcon::CallFunc_IsStateActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ScoreScreen_StatTable_Headers_Slot_C_RefreshAscendingIcon, CallFunc_IsStateActive_ReturnValue_1) == 0x000022, "Member 'WBP_ScoreScreen_StatTable_Headers_Slot_C_RefreshAscendingIcon::CallFunc_IsStateActive_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ScoreScreen_StatTable_Headers_Slot_C_RefreshAscendingIcon, CallFunc_BooleanAND_ReturnValue) == 0x000023, "Member 'WBP_ScoreScreen_StatTable_Headers_Slot_C_RefreshAscendingIcon::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ScoreScreen_StatTable_Headers_Slot_C_RefreshAscendingIcon, K2Node_Select_Default) == 0x000028, "Member 'WBP_ScoreScreen_StatTable_Headers_Slot_C_RefreshAscendingIcon::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_ScoreScreen_StatTable_Headers_Slot_C_RefreshAscendingIcon, K2Node_Select_Default_1) == 0x000030, "Member 'WBP_ScoreScreen_StatTable_Headers_Slot_C_RefreshAscendingIcon::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_ScoreScreen_StatTable_Headers_Slot_C_RefreshAscendingIcon, CallFunc_SetRenderTransformAngle_Angle_ImplicitCast) == 0x000034, "Member 'WBP_ScoreScreen_StatTable_Headers_Slot_C_RefreshAscendingIcon::CallFunc_SetRenderTransformAngle_Angle_ImplicitCast' has a wrong offset!");

// Function WBP_ScoreScreen_StatTable_Headers_Slot.WBP_ScoreScreen_StatTable_Headers_Slot_C.Set Font Material
// 0x0008 (0x0008 - 0x0000)
struct WBP_ScoreScreen_StatTable_Headers_Slot_C_Set_Font_Material final
{
public:
	class UMaterialInterface*                     InMaterial;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ScoreScreen_StatTable_Headers_Slot_C_Set_Font_Material) == 0x000008, "Wrong alignment on WBP_ScoreScreen_StatTable_Headers_Slot_C_Set_Font_Material");
static_assert(sizeof(WBP_ScoreScreen_StatTable_Headers_Slot_C_Set_Font_Material) == 0x000008, "Wrong size on WBP_ScoreScreen_StatTable_Headers_Slot_C_Set_Font_Material");
static_assert(offsetof(WBP_ScoreScreen_StatTable_Headers_Slot_C_Set_Font_Material, InMaterial) == 0x000000, "Member 'WBP_ScoreScreen_StatTable_Headers_Slot_C_Set_Font_Material::InMaterial' has a wrong offset!");

// Function WBP_ScoreScreen_StatTable_Headers_Slot.WBP_ScoreScreen_StatTable_Headers_Slot_C.Set Justification
// 0x0001 (0x0001 - 0x0000)
struct WBP_ScoreScreen_StatTable_Headers_Slot_C_Set_Justification final
{
public:
	ETextJustify                                  Justification;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ScoreScreen_StatTable_Headers_Slot_C_Set_Justification) == 0x000001, "Wrong alignment on WBP_ScoreScreen_StatTable_Headers_Slot_C_Set_Justification");
static_assert(sizeof(WBP_ScoreScreen_StatTable_Headers_Slot_C_Set_Justification) == 0x000001, "Wrong size on WBP_ScoreScreen_StatTable_Headers_Slot_C_Set_Justification");
static_assert(offsetof(WBP_ScoreScreen_StatTable_Headers_Slot_C_Set_Justification, Justification) == 0x000000, "Member 'WBP_ScoreScreen_StatTable_Headers_Slot_C_Set_Justification::Justification' has a wrong offset!");

}

