#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MenuButtonBar_Slot

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Tempest_structs.hpp"
#include "Tempest_classes.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_MenuButtonBar_Slot.WBP_MenuButtonBar_Slot_C
// 0x0090 (0x04C0 - 0x0430)
class UWBP_MenuButtonBar_Slot_C final : public UTedContentPanelSlotButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0430(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_GlowingWidget_Text_Fill_C*         GlowingText;                                       // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Notification_Image;                                // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FSlateColor                            TextColor_Default;                                 // 0x0448(0x0014)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateColor                            TextColor_Selected;                                // 0x045C(0x0014)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateColor                            TextColor_Hovered;                                 // 0x0470(0x0014)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateColor                            TextColor_Disabled;                                // 0x0484(0x0014)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   DisplayText;                                       // 0x0498(0x0010)(Edit, BlueprintVisible)
	class FText                                   Description;                                       // 0x04A8(0x0010)(Edit, BlueprintVisible)
	bool                                          bAutoHildeNotificationImage;                       // 0x04B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void SetSelectedEffect(bool bInSelected, bool bInInstant);
	void RefreshUI();
	void PreConstruct(bool IsDesignTime);
	void OnTriggerAction(ETedContentSlotAction InAction);
	void OnActivateState(ETedContentSlotState InState, bool bInActivated);
	void HandleNotificationStatus(bool bInActivated);
	void ExecuteUbergraph_WBP_MenuButtonBar_Slot(int32 EntryPoint);

	void GetTextColor(struct FSlateColor* TextColor_Disabled_0) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_MenuButtonBar_Slot_C">();
	}
	static class UWBP_MenuButtonBar_Slot_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_MenuButtonBar_Slot_C>();
	}
};
static_assert(alignof(UWBP_MenuButtonBar_Slot_C) == 0x000008, "Wrong alignment on UWBP_MenuButtonBar_Slot_C");
static_assert(sizeof(UWBP_MenuButtonBar_Slot_C) == 0x0004C0, "Wrong size on UWBP_MenuButtonBar_Slot_C");
static_assert(offsetof(UWBP_MenuButtonBar_Slot_C, UberGraphFrame) == 0x000430, "Member 'UWBP_MenuButtonBar_Slot_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_MenuButtonBar_Slot_C, GlowingText) == 0x000438, "Member 'UWBP_MenuButtonBar_Slot_C::GlowingText' has a wrong offset!");
static_assert(offsetof(UWBP_MenuButtonBar_Slot_C, Notification_Image) == 0x000440, "Member 'UWBP_MenuButtonBar_Slot_C::Notification_Image' has a wrong offset!");
static_assert(offsetof(UWBP_MenuButtonBar_Slot_C, TextColor_Default) == 0x000448, "Member 'UWBP_MenuButtonBar_Slot_C::TextColor_Default' has a wrong offset!");
static_assert(offsetof(UWBP_MenuButtonBar_Slot_C, TextColor_Selected) == 0x00045C, "Member 'UWBP_MenuButtonBar_Slot_C::TextColor_Selected' has a wrong offset!");
static_assert(offsetof(UWBP_MenuButtonBar_Slot_C, TextColor_Hovered) == 0x000470, "Member 'UWBP_MenuButtonBar_Slot_C::TextColor_Hovered' has a wrong offset!");
static_assert(offsetof(UWBP_MenuButtonBar_Slot_C, TextColor_Disabled) == 0x000484, "Member 'UWBP_MenuButtonBar_Slot_C::TextColor_Disabled' has a wrong offset!");
static_assert(offsetof(UWBP_MenuButtonBar_Slot_C, DisplayText) == 0x000498, "Member 'UWBP_MenuButtonBar_Slot_C::DisplayText' has a wrong offset!");
static_assert(offsetof(UWBP_MenuButtonBar_Slot_C, Description) == 0x0004A8, "Member 'UWBP_MenuButtonBar_Slot_C::Description' has a wrong offset!");
static_assert(offsetof(UWBP_MenuButtonBar_Slot_C, bAutoHildeNotificationImage) == 0x0004B8, "Member 'UWBP_MenuButtonBar_Slot_C::bAutoHildeNotificationImage' has a wrong offset!");

}

