#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Button_w_Text

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "Tempest_classes.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Button_w_Text.WBP_Button_w_Text_C
// 0x08C0 (0x0CC0 - 0x0400)
class UWBP_Button_w_Text_C final : public UTedUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0400(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                Button;                                            // 0x0408(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_BG;                                          // 0x0410(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Button;                                  // 0x0418(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Text;                                              // 0x0420(0x0010)(Edit, BlueprintVisible)
	bool                                          bUpperCase;                                        // 0x0430(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_431[0x7];                                      // 0x0431(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     GlowMaterial;                                      // 0x0438(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(class UTedUserWidget* InWidget)> OnPressed;                        // 0x0440(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(class UTedUserWidget* InWidget)> OnReleased;                       // 0x0450(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(class UTedUserWidget* InWidget)> OnClicked;                        // 0x0460(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(class UTedUserWidget* InWidget)> OnHover;                          // 0x0470(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(class UTedUserWidget* InWidget)> OnUnhover;                        // 0x0480(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          bEnabled;                                          // 0x0490(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_491[0x7];                                      // 0x0491(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     BackgroundMaterialOverride;                        // 0x0498(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FWidgetTransform                       BackgroundRenderTransformOverride;                 // 0x04A0(0x0038)(Edit, BlueprintVisible, NoDestructor)
	bool                                          bCustomizeButtonStyle;                             // 0x04D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D9[0x7];                                      // 0x04D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FButtonStyle                           CustomButtonStyle;                                 // 0x04E0(0x03F0)(Edit, BlueprintVisible)
	struct FButtonStyle                           NewVar;                                            // 0x08D0(0x03F0)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void TryApplyCustomButtonStyle();
	void SetText(const class FText& InText, bool bInUpperCase);
	void SetBackgroundRenderTransformOverride(const struct FWidgetTransform& BacgroundRenderTransformOverride);
	void SetBackgroundMaterial(class UMaterialInterface* NewMaterial);
	void PreConstruct(bool IsDesignTime);
	void ExecuteUbergraph_WBP_Button_w_Text(int32 EntryPoint);
	void Enable(bool bInEnable);
	void BndEvt__Button_K2Node_ComponentBoundEvent_5_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__Button_K2Node_ComponentBoundEvent_4_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__Button_K2Node_ComponentBoundEvent_3_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__Button_K2Node_ComponentBoundEvent_1_OnButtonReleasedEvent__DelegateSignature();
	void BndEvt__Button_K2Node_ComponentBoundEvent_0_OnButtonPressedEvent__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Button_w_Text_C">();
	}
	static class UWBP_Button_w_Text_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Button_w_Text_C>();
	}
};
static_assert(alignof(UWBP_Button_w_Text_C) == 0x000010, "Wrong alignment on UWBP_Button_w_Text_C");
static_assert(sizeof(UWBP_Button_w_Text_C) == 0x000CC0, "Wrong size on UWBP_Button_w_Text_C");
static_assert(offsetof(UWBP_Button_w_Text_C, UberGraphFrame) == 0x000400, "Member 'UWBP_Button_w_Text_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Button_w_Text_C, Button) == 0x000408, "Member 'UWBP_Button_w_Text_C::Button' has a wrong offset!");
static_assert(offsetof(UWBP_Button_w_Text_C, Image_BG) == 0x000410, "Member 'UWBP_Button_w_Text_C::Image_BG' has a wrong offset!");
static_assert(offsetof(UWBP_Button_w_Text_C, TextBlock_Button) == 0x000418, "Member 'UWBP_Button_w_Text_C::TextBlock_Button' has a wrong offset!");
static_assert(offsetof(UWBP_Button_w_Text_C, Text) == 0x000420, "Member 'UWBP_Button_w_Text_C::Text' has a wrong offset!");
static_assert(offsetof(UWBP_Button_w_Text_C, bUpperCase) == 0x000430, "Member 'UWBP_Button_w_Text_C::bUpperCase' has a wrong offset!");
static_assert(offsetof(UWBP_Button_w_Text_C, GlowMaterial) == 0x000438, "Member 'UWBP_Button_w_Text_C::GlowMaterial' has a wrong offset!");
static_assert(offsetof(UWBP_Button_w_Text_C, OnPressed) == 0x000440, "Member 'UWBP_Button_w_Text_C::OnPressed' has a wrong offset!");
static_assert(offsetof(UWBP_Button_w_Text_C, OnReleased) == 0x000450, "Member 'UWBP_Button_w_Text_C::OnReleased' has a wrong offset!");
static_assert(offsetof(UWBP_Button_w_Text_C, OnClicked) == 0x000460, "Member 'UWBP_Button_w_Text_C::OnClicked' has a wrong offset!");
static_assert(offsetof(UWBP_Button_w_Text_C, OnHover) == 0x000470, "Member 'UWBP_Button_w_Text_C::OnHover' has a wrong offset!");
static_assert(offsetof(UWBP_Button_w_Text_C, OnUnhover) == 0x000480, "Member 'UWBP_Button_w_Text_C::OnUnhover' has a wrong offset!");
static_assert(offsetof(UWBP_Button_w_Text_C, bEnabled) == 0x000490, "Member 'UWBP_Button_w_Text_C::bEnabled' has a wrong offset!");
static_assert(offsetof(UWBP_Button_w_Text_C, BackgroundMaterialOverride) == 0x000498, "Member 'UWBP_Button_w_Text_C::BackgroundMaterialOverride' has a wrong offset!");
static_assert(offsetof(UWBP_Button_w_Text_C, BackgroundRenderTransformOverride) == 0x0004A0, "Member 'UWBP_Button_w_Text_C::BackgroundRenderTransformOverride' has a wrong offset!");
static_assert(offsetof(UWBP_Button_w_Text_C, bCustomizeButtonStyle) == 0x0004D8, "Member 'UWBP_Button_w_Text_C::bCustomizeButtonStyle' has a wrong offset!");
static_assert(offsetof(UWBP_Button_w_Text_C, CustomButtonStyle) == 0x0004E0, "Member 'UWBP_Button_w_Text_C::CustomButtonStyle' has a wrong offset!");
static_assert(offsetof(UWBP_Button_w_Text_C, NewVar) == 0x0008D0, "Member 'UWBP_Button_w_Text_C::NewVar' has a wrong offset!");

}

