#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_LoadSlots_List

#include "Basic.hpp"

#include "Tempest_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_LoadSlots_List.WBP_LoadSlots_List_C.UpdateLabelPaddings
// 0x0038 (0x0038 - 0x0000)
struct WBP_LoadSlots_List_C_UpdateLabelPaddings final
{
public:
	bool                                          IsScrollbarVisible;                                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FMargin                                K2Node_MakeStruct_Margin_1;                        // 0x0014(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVerticalBoxSlot*                       CallFunc_SlotAsVerticalBoxSlot_ReturnValue;        // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UVerticalBoxSlot*                       CallFunc_SlotAsVerticalBoxSlot_ReturnValue_1;      // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LoadSlots_List_C_UpdateLabelPaddings) == 0x000008, "Wrong alignment on WBP_LoadSlots_List_C_UpdateLabelPaddings");
static_assert(sizeof(WBP_LoadSlots_List_C_UpdateLabelPaddings) == 0x000038, "Wrong size on WBP_LoadSlots_List_C_UpdateLabelPaddings");
static_assert(offsetof(WBP_LoadSlots_List_C_UpdateLabelPaddings, IsScrollbarVisible) == 0x000000, "Member 'WBP_LoadSlots_List_C_UpdateLabelPaddings::IsScrollbarVisible' has a wrong offset!");
static_assert(offsetof(WBP_LoadSlots_List_C_UpdateLabelPaddings, K2Node_MakeStruct_Margin) == 0x000004, "Member 'WBP_LoadSlots_List_C_UpdateLabelPaddings::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(WBP_LoadSlots_List_C_UpdateLabelPaddings, K2Node_MakeStruct_Margin_1) == 0x000014, "Member 'WBP_LoadSlots_List_C_UpdateLabelPaddings::K2Node_MakeStruct_Margin_1' has a wrong offset!");
static_assert(offsetof(WBP_LoadSlots_List_C_UpdateLabelPaddings, CallFunc_SlotAsVerticalBoxSlot_ReturnValue) == 0x000028, "Member 'WBP_LoadSlots_List_C_UpdateLabelPaddings::CallFunc_SlotAsVerticalBoxSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoadSlots_List_C_UpdateLabelPaddings, CallFunc_SlotAsVerticalBoxSlot_ReturnValue_1) == 0x000030, "Member 'WBP_LoadSlots_List_C_UpdateLabelPaddings::CallFunc_SlotAsVerticalBoxSlot_ReturnValue_1' has a wrong offset!");

// Function WBP_LoadSlots_List.WBP_LoadSlots_List_C.OnRegisterContentSlot
// 0x0010 (0x0010 - 0x0000)
struct WBP_LoadSlots_List_C_OnRegisterContentSlot final
{
public:
	class UTedContentPanelSlotBase*               InContentSlot;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ETedContentPanelRegistration                  InMode;                                            // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LoadSlots_List_C_OnRegisterContentSlot) == 0x000008, "Wrong alignment on WBP_LoadSlots_List_C_OnRegisterContentSlot");
static_assert(sizeof(WBP_LoadSlots_List_C_OnRegisterContentSlot) == 0x000010, "Wrong size on WBP_LoadSlots_List_C_OnRegisterContentSlot");
static_assert(offsetof(WBP_LoadSlots_List_C_OnRegisterContentSlot, InContentSlot) == 0x000000, "Member 'WBP_LoadSlots_List_C_OnRegisterContentSlot::InContentSlot' has a wrong offset!");
static_assert(offsetof(WBP_LoadSlots_List_C_OnRegisterContentSlot, InMode) == 0x000008, "Member 'WBP_LoadSlots_List_C_OnRegisterContentSlot::InMode' has a wrong offset!");

// Function WBP_LoadSlots_List.WBP_LoadSlots_List_C.ExecuteUbergraph_WBP_LoadSlots_List
// 0x0040 (0x0040 - 0x0000)
struct WBP_LoadSlots_List_C_ExecuteUbergraph_WBP_LoadSlots_List final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UTedContentPanelSlotBase*               K2Node_Event_InContentSlot;                        // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ETedContentPanelRegistration                  K2Node_Event_InMode;                               // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0014(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UScrollBoxSlot*                         CallFunc_SlotAsScrollBoxSlot_ReturnValue;          // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetContentSlotsCount_ReturnValue;         // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0036(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_ComponentBoundEvent_NewVisibility;          // 0x0037(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LoadSlots_List_C_ExecuteUbergraph_WBP_LoadSlots_List) == 0x000008, "Wrong alignment on WBP_LoadSlots_List_C_ExecuteUbergraph_WBP_LoadSlots_List");
static_assert(sizeof(WBP_LoadSlots_List_C_ExecuteUbergraph_WBP_LoadSlots_List) == 0x000040, "Wrong size on WBP_LoadSlots_List_C_ExecuteUbergraph_WBP_LoadSlots_List");
static_assert(offsetof(WBP_LoadSlots_List_C_ExecuteUbergraph_WBP_LoadSlots_List, EntryPoint) == 0x000000, "Member 'WBP_LoadSlots_List_C_ExecuteUbergraph_WBP_LoadSlots_List::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_LoadSlots_List_C_ExecuteUbergraph_WBP_LoadSlots_List, Temp_bool_Variable) == 0x000004, "Member 'WBP_LoadSlots_List_C_ExecuteUbergraph_WBP_LoadSlots_List::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_LoadSlots_List_C_ExecuteUbergraph_WBP_LoadSlots_List, Temp_byte_Variable) == 0x000005, "Member 'WBP_LoadSlots_List_C_ExecuteUbergraph_WBP_LoadSlots_List::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_LoadSlots_List_C_ExecuteUbergraph_WBP_LoadSlots_List, Temp_byte_Variable_1) == 0x000006, "Member 'WBP_LoadSlots_List_C_ExecuteUbergraph_WBP_LoadSlots_List::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_LoadSlots_List_C_ExecuteUbergraph_WBP_LoadSlots_List, K2Node_Event_InContentSlot) == 0x000008, "Member 'WBP_LoadSlots_List_C_ExecuteUbergraph_WBP_LoadSlots_List::K2Node_Event_InContentSlot' has a wrong offset!");
static_assert(offsetof(WBP_LoadSlots_List_C_ExecuteUbergraph_WBP_LoadSlots_List, K2Node_Event_InMode) == 0x000010, "Member 'WBP_LoadSlots_List_C_ExecuteUbergraph_WBP_LoadSlots_List::K2Node_Event_InMode' has a wrong offset!");
static_assert(offsetof(WBP_LoadSlots_List_C_ExecuteUbergraph_WBP_LoadSlots_List, K2Node_MakeStruct_Margin) == 0x000014, "Member 'WBP_LoadSlots_List_C_ExecuteUbergraph_WBP_LoadSlots_List::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(WBP_LoadSlots_List_C_ExecuteUbergraph_WBP_LoadSlots_List, CallFunc_SlotAsScrollBoxSlot_ReturnValue) == 0x000028, "Member 'WBP_LoadSlots_List_C_ExecuteUbergraph_WBP_LoadSlots_List::CallFunc_SlotAsScrollBoxSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoadSlots_List_C_ExecuteUbergraph_WBP_LoadSlots_List, CallFunc_GetContentSlotsCount_ReturnValue) == 0x000030, "Member 'WBP_LoadSlots_List_C_ExecuteUbergraph_WBP_LoadSlots_List::CallFunc_GetContentSlotsCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoadSlots_List_C_ExecuteUbergraph_WBP_LoadSlots_List, Temp_byte_Variable_2) == 0x000034, "Member 'WBP_LoadSlots_List_C_ExecuteUbergraph_WBP_LoadSlots_List::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_LoadSlots_List_C_ExecuteUbergraph_WBP_LoadSlots_List, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000035, "Member 'WBP_LoadSlots_List_C_ExecuteUbergraph_WBP_LoadSlots_List::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoadSlots_List_C_ExecuteUbergraph_WBP_LoadSlots_List, CallFunc_Not_PreBool_ReturnValue) == 0x000036, "Member 'WBP_LoadSlots_List_C_ExecuteUbergraph_WBP_LoadSlots_List::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoadSlots_List_C_ExecuteUbergraph_WBP_LoadSlots_List, K2Node_ComponentBoundEvent_NewVisibility) == 0x000037, "Member 'WBP_LoadSlots_List_C_ExecuteUbergraph_WBP_LoadSlots_List::K2Node_ComponentBoundEvent_NewVisibility' has a wrong offset!");
static_assert(offsetof(WBP_LoadSlots_List_C_ExecuteUbergraph_WBP_LoadSlots_List, K2Node_Select_Default) == 0x000038, "Member 'WBP_LoadSlots_List_C_ExecuteUbergraph_WBP_LoadSlots_List::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_LoadSlots_List_C_ExecuteUbergraph_WBP_LoadSlots_List, K2Node_SwitchEnum_CmpSuccess) == 0x000039, "Member 'WBP_LoadSlots_List_C_ExecuteUbergraph_WBP_LoadSlots_List::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_LoadSlots_List_C_ExecuteUbergraph_WBP_LoadSlots_List, Temp_byte_Variable_3) == 0x00003A, "Member 'WBP_LoadSlots_List_C_ExecuteUbergraph_WBP_LoadSlots_List::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_LoadSlots_List_C_ExecuteUbergraph_WBP_LoadSlots_List, Temp_bool_Variable_1) == 0x00003B, "Member 'WBP_LoadSlots_List_C_ExecuteUbergraph_WBP_LoadSlots_List::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_LoadSlots_List_C_ExecuteUbergraph_WBP_LoadSlots_List, K2Node_Select_Default_1) == 0x00003C, "Member 'WBP_LoadSlots_List_C_ExecuteUbergraph_WBP_LoadSlots_List::K2Node_Select_Default_1' has a wrong offset!");

// Function WBP_LoadSlots_List.WBP_LoadSlots_List_C.BndEvt__WBP_LoadSlots_List_InnerContentPanel_K2Node_ComponentBoundEvent_0_OnScrollBarVisibilityChangedEvent__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WBP_LoadSlots_List_C_BndEvt__WBP_LoadSlots_List_InnerContentPanel_K2Node_ComponentBoundEvent_0_OnScrollBarVisibilityChangedEvent__DelegateSignature final
{
public:
	ESlateVisibility                              NewVisibility;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LoadSlots_List_C_BndEvt__WBP_LoadSlots_List_InnerContentPanel_K2Node_ComponentBoundEvent_0_OnScrollBarVisibilityChangedEvent__DelegateSignature) == 0x000001, "Wrong alignment on WBP_LoadSlots_List_C_BndEvt__WBP_LoadSlots_List_InnerContentPanel_K2Node_ComponentBoundEvent_0_OnScrollBarVisibilityChangedEvent__DelegateSignature");
static_assert(sizeof(WBP_LoadSlots_List_C_BndEvt__WBP_LoadSlots_List_InnerContentPanel_K2Node_ComponentBoundEvent_0_OnScrollBarVisibilityChangedEvent__DelegateSignature) == 0x000001, "Wrong size on WBP_LoadSlots_List_C_BndEvt__WBP_LoadSlots_List_InnerContentPanel_K2Node_ComponentBoundEvent_0_OnScrollBarVisibilityChangedEvent__DelegateSignature");
static_assert(offsetof(WBP_LoadSlots_List_C_BndEvt__WBP_LoadSlots_List_InnerContentPanel_K2Node_ComponentBoundEvent_0_OnScrollBarVisibilityChangedEvent__DelegateSignature, NewVisibility) == 0x000000, "Member 'WBP_LoadSlots_List_C_BndEvt__WBP_LoadSlots_List_InnerContentPanel_K2Node_ComponentBoundEvent_0_OnScrollBarVisibilityChangedEvent__DelegateSignature::NewVisibility' has a wrong offset!");

}

