#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MissionDialogue_Subtitles

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_MissionDialogue_Subtitles.WBP_MissionDialogue_Subtitles_C.ExecuteUbergraph_WBP_MissionDialogue_Subtitles
// 0x0008 (0x0008 - 0x0000)
struct WBP_MissionDialogue_Subtitles_C_ExecuteUbergraph_WBP_MissionDialogue_Subtitles final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MissionDialogue_Subtitles_C_ExecuteUbergraph_WBP_MissionDialogue_Subtitles) == 0x000004, "Wrong alignment on WBP_MissionDialogue_Subtitles_C_ExecuteUbergraph_WBP_MissionDialogue_Subtitles");
static_assert(sizeof(WBP_MissionDialogue_Subtitles_C_ExecuteUbergraph_WBP_MissionDialogue_Subtitles) == 0x000008, "Wrong size on WBP_MissionDialogue_Subtitles_C_ExecuteUbergraph_WBP_MissionDialogue_Subtitles");
static_assert(offsetof(WBP_MissionDialogue_Subtitles_C_ExecuteUbergraph_WBP_MissionDialogue_Subtitles, EntryPoint) == 0x000000, "Member 'WBP_MissionDialogue_Subtitles_C_ExecuteUbergraph_WBP_MissionDialogue_Subtitles::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_MissionDialogue_Subtitles_C_ExecuteUbergraph_WBP_MissionDialogue_Subtitles, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WBP_MissionDialogue_Subtitles_C_ExecuteUbergraph_WBP_MissionDialogue_Subtitles::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function WBP_MissionDialogue_Subtitles.WBP_MissionDialogue_Subtitles_C.K2_DisplaySubtitle
// 0x0010 (0x0010 - 0x0000)
struct WBP_MissionDialogue_Subtitles_C_K2_DisplaySubtitle final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_MissionDialogue_Subtitles_C_K2_DisplaySubtitle) == 0x000008, "Wrong alignment on WBP_MissionDialogue_Subtitles_C_K2_DisplaySubtitle");
static_assert(sizeof(WBP_MissionDialogue_Subtitles_C_K2_DisplaySubtitle) == 0x000010, "Wrong size on WBP_MissionDialogue_Subtitles_C_K2_DisplaySubtitle");
static_assert(offsetof(WBP_MissionDialogue_Subtitles_C_K2_DisplaySubtitle, InText) == 0x000000, "Member 'WBP_MissionDialogue_Subtitles_C_K2_DisplaySubtitle::InText' has a wrong offset!");

// Function WBP_MissionDialogue_Subtitles.WBP_MissionDialogue_Subtitles_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_MissionDialogue_Subtitles_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MissionDialogue_Subtitles_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_MissionDialogue_Subtitles_C_PreConstruct");
static_assert(sizeof(WBP_MissionDialogue_Subtitles_C_PreConstruct) == 0x000001, "Wrong size on WBP_MissionDialogue_Subtitles_C_PreConstruct");
static_assert(offsetof(WBP_MissionDialogue_Subtitles_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_MissionDialogue_Subtitles_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_MissionDialogue_Subtitles.WBP_MissionDialogue_Subtitles_C.Set_WrappingWidth
// 0x0010 (0x0010 - 0x0000)
struct WBP_MissionDialogue_Subtitles_C_Set_WrappingWidth final
{
public:
	double                                        Width;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_VariableSet_WrapTextAt_ImplicitCast;        // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MissionDialogue_Subtitles_C_Set_WrappingWidth) == 0x000008, "Wrong alignment on WBP_MissionDialogue_Subtitles_C_Set_WrappingWidth");
static_assert(sizeof(WBP_MissionDialogue_Subtitles_C_Set_WrappingWidth) == 0x000010, "Wrong size on WBP_MissionDialogue_Subtitles_C_Set_WrappingWidth");
static_assert(offsetof(WBP_MissionDialogue_Subtitles_C_Set_WrappingWidth, Width) == 0x000000, "Member 'WBP_MissionDialogue_Subtitles_C_Set_WrappingWidth::Width' has a wrong offset!");
static_assert(offsetof(WBP_MissionDialogue_Subtitles_C_Set_WrappingWidth, K2Node_VariableSet_WrapTextAt_ImplicitCast) == 0x000008, "Member 'WBP_MissionDialogue_Subtitles_C_Set_WrappingWidth::K2Node_VariableSet_WrapTextAt_ImplicitCast' has a wrong offset!");

}

