#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_HUD_PlayerCommands

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Tempest_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_HUD_PlayerCommands.WBP_HUD_PlayerCommands_C
// 0x0020 (0x0450 - 0x0430)
class UWBP_HUD_PlayerCommands_C final : public UTedPlayerCommandsWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0430(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anim_StartupSequence;                              // 0x0438(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel_AnimRoot;                              // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MoviePlayer_Fill_C*                IntroAnim;                                         // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BndEvt__WBP_HUD_PlayerCommands_CommandsPanel_K2Node_ComponentBoundEvent_0_OnVisibilityChangedEvent__DelegateSignature(ESlateVisibility InVisibility);
	void BndEvt__WBP_HUD_PlayerCommands_WBP_MoviePlayer_Fill_K2Node_ComponentBoundEvent_2_TedMoviePlayerWidgetEventDelegate__DelegateSignature(class UTedMoviePlayerWidgetV2* InWidget, const class UFileMediaSource* InSource);
	void Construct();
	void ExecuteUbergraph_WBP_HUD_PlayerCommands(int32 EntryPoint);
	void Hide();
	void OnOwnedTagsChange_Handler(class UTedPlayerData* InPlayerData);
	void OnPlayWidgetAnimation(const struct FGameplayTag& InAnim);
	void OnTargetPlayerDataChange(class UTedPlayerData* InPrevious, class UTedPlayerData* InCurrent);
	void RefreshVisibility();
	void SequenceEvent__ENTRYPOINTWBP_HUD_PlayerCommands();
	void SequenceEvent__ENTRYPOINTWBP_HUD_PlayerCommands_0();
	void SetShown(bool bInShown);
	void Show();

	bool OnCanPlayWidgetAnimation(const struct FGameplayTag& InAnim) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_HUD_PlayerCommands_C">();
	}
	static class UWBP_HUD_PlayerCommands_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_HUD_PlayerCommands_C>();
	}
};
static_assert(alignof(UWBP_HUD_PlayerCommands_C) == 0x000008, "Wrong alignment on UWBP_HUD_PlayerCommands_C");
static_assert(sizeof(UWBP_HUD_PlayerCommands_C) == 0x000450, "Wrong size on UWBP_HUD_PlayerCommands_C");
static_assert(offsetof(UWBP_HUD_PlayerCommands_C, UberGraphFrame) == 0x000430, "Member 'UWBP_HUD_PlayerCommands_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_PlayerCommands_C, Anim_StartupSequence) == 0x000438, "Member 'UWBP_HUD_PlayerCommands_C::Anim_StartupSequence' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_PlayerCommands_C, CanvasPanel_AnimRoot) == 0x000440, "Member 'UWBP_HUD_PlayerCommands_C::CanvasPanel_AnimRoot' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_PlayerCommands_C, IntroAnim) == 0x000448, "Member 'UWBP_HUD_PlayerCommands_C::IntroAnim' has a wrong offset!");

}

