#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PerfStat

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Tempest_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_PerfStat.WBP_PerfStat_C
// 0x0028 (0x0460 - 0x0438)
class UWBP_PerfStat_C final : public UTedPerfStatWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0438(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             StatNameWidget;                                    // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               StatValueSizer;                                    // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             StatValueWidget;                                   // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	double                                        StatValueWidth;                                    // 0x0458(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_PerfStat(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_PerfStat_C">();
	}
	static class UWBP_PerfStat_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_PerfStat_C>();
	}
};
static_assert(alignof(UWBP_PerfStat_C) == 0x000008, "Wrong alignment on UWBP_PerfStat_C");
static_assert(sizeof(UWBP_PerfStat_C) == 0x000460, "Wrong size on UWBP_PerfStat_C");
static_assert(offsetof(UWBP_PerfStat_C, UberGraphFrame) == 0x000438, "Member 'UWBP_PerfStat_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_PerfStat_C, StatNameWidget) == 0x000440, "Member 'UWBP_PerfStat_C::StatNameWidget' has a wrong offset!");
static_assert(offsetof(UWBP_PerfStat_C, StatValueSizer) == 0x000448, "Member 'UWBP_PerfStat_C::StatValueSizer' has a wrong offset!");
static_assert(offsetof(UWBP_PerfStat_C, StatValueWidget) == 0x000450, "Member 'UWBP_PerfStat_C::StatValueWidget' has a wrong offset!");
static_assert(offsetof(UWBP_PerfStat_C, StatValueWidth) == 0x000458, "Member 'UWBP_PerfStat_C::StatValueWidth' has a wrong offset!");

}

