#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SelectionDetails_InfoSlots_Perks_Slot

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_SelectionDetails_InfoSlots_Perks_Slot.WBP_SelectionDetails_InfoSlots_Perks_Slot_C.ExecuteUbergraph_WBP_SelectionDetails_InfoSlots_Perks_Slot
// 0x0130 (0x0130 - 0x0000)
struct WBP_SelectionDetails_InfoSlots_Perks_Slot_C_ExecuteUbergraph_WBP_SelectionDetails_InfoSlots_Perks_Slot final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0004(0x0038)(IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerEvent                          K2Node_Event_MouseEvent_1;                         // 0x0040(0x0078)(ConstParm)
	struct FPointerEvent                          K2Node_Event_MouseEvent;                           // 0x00B8(0x0078)(ConstParm)
};
static_assert(alignof(WBP_SelectionDetails_InfoSlots_Perks_Slot_C_ExecuteUbergraph_WBP_SelectionDetails_InfoSlots_Perks_Slot) == 0x000008, "Wrong alignment on WBP_SelectionDetails_InfoSlots_Perks_Slot_C_ExecuteUbergraph_WBP_SelectionDetails_InfoSlots_Perks_Slot");
static_assert(sizeof(WBP_SelectionDetails_InfoSlots_Perks_Slot_C_ExecuteUbergraph_WBP_SelectionDetails_InfoSlots_Perks_Slot) == 0x000130, "Wrong size on WBP_SelectionDetails_InfoSlots_Perks_Slot_C_ExecuteUbergraph_WBP_SelectionDetails_InfoSlots_Perks_Slot");
static_assert(offsetof(WBP_SelectionDetails_InfoSlots_Perks_Slot_C_ExecuteUbergraph_WBP_SelectionDetails_InfoSlots_Perks_Slot, EntryPoint) == 0x000000, "Member 'WBP_SelectionDetails_InfoSlots_Perks_Slot_C_ExecuteUbergraph_WBP_SelectionDetails_InfoSlots_Perks_Slot::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_SelectionDetails_InfoSlots_Perks_Slot_C_ExecuteUbergraph_WBP_SelectionDetails_InfoSlots_Perks_Slot, K2Node_Event_MyGeometry) == 0x000004, "Member 'WBP_SelectionDetails_InfoSlots_Perks_Slot_C_ExecuteUbergraph_WBP_SelectionDetails_InfoSlots_Perks_Slot::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_SelectionDetails_InfoSlots_Perks_Slot_C_ExecuteUbergraph_WBP_SelectionDetails_InfoSlots_Perks_Slot, K2Node_Event_MouseEvent_1) == 0x000040, "Member 'WBP_SelectionDetails_InfoSlots_Perks_Slot_C_ExecuteUbergraph_WBP_SelectionDetails_InfoSlots_Perks_Slot::K2Node_Event_MouseEvent_1' has a wrong offset!");
static_assert(offsetof(WBP_SelectionDetails_InfoSlots_Perks_Slot_C_ExecuteUbergraph_WBP_SelectionDetails_InfoSlots_Perks_Slot, K2Node_Event_MouseEvent) == 0x0000B8, "Member 'WBP_SelectionDetails_InfoSlots_Perks_Slot_C_ExecuteUbergraph_WBP_SelectionDetails_InfoSlots_Perks_Slot::K2Node_Event_MouseEvent' has a wrong offset!");

// Function WBP_SelectionDetails_InfoSlots_Perks_Slot.WBP_SelectionDetails_InfoSlots_Perks_Slot_C.HandleHovered
// 0x00C0 (0x00C0 - 0x0000)
struct WBP_SelectionDetails_InfoSlots_Perks_Slot_C_HandleHovered final
{
public:
	bool                                          bInActive;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTedRangeDecalComponent*                RangeComp;                                         // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ATedPlayerController*                   CallFunc_GetTedPlayerController_ReturnValue;       // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSet<class ATedPawn*>                         CallFunc_GetSelectedPawns_ReturnValue;             // 0x0028(0x0050)(ConstParm)
	TArray<class ATedPawn*>                       CallFunc_Set_ToArray_Result;                       // 0x0078(0x0010)(ReferenceParm)
	bool                                          CallFunc_Set_IsNotEmpty_ReturnValue;               // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATedPawn*                               CallFunc_Array_Get_Item;                           // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UTedRangeDecalComponent*>        CallFunc_K2_GetComponentsByClass_ReturnValue;      // 0x0098(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTedRangeDecalComponent*                CallFunc_Array_Get_Item_1;                         // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SelectionDetails_InfoSlots_Perks_Slot_C_HandleHovered) == 0x000008, "Wrong alignment on WBP_SelectionDetails_InfoSlots_Perks_Slot_C_HandleHovered");
static_assert(sizeof(WBP_SelectionDetails_InfoSlots_Perks_Slot_C_HandleHovered) == 0x0000C0, "Wrong size on WBP_SelectionDetails_InfoSlots_Perks_Slot_C_HandleHovered");
static_assert(offsetof(WBP_SelectionDetails_InfoSlots_Perks_Slot_C_HandleHovered, bInActive) == 0x000000, "Member 'WBP_SelectionDetails_InfoSlots_Perks_Slot_C_HandleHovered::bInActive' has a wrong offset!");
static_assert(offsetof(WBP_SelectionDetails_InfoSlots_Perks_Slot_C_HandleHovered, RangeComp) == 0x000008, "Member 'WBP_SelectionDetails_InfoSlots_Perks_Slot_C_HandleHovered::RangeComp' has a wrong offset!");
static_assert(offsetof(WBP_SelectionDetails_InfoSlots_Perks_Slot_C_HandleHovered, Temp_int_Array_Index_Variable) == 0x000010, "Member 'WBP_SelectionDetails_InfoSlots_Perks_Slot_C_HandleHovered::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_SelectionDetails_InfoSlots_Perks_Slot_C_HandleHovered, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'WBP_SelectionDetails_InfoSlots_Perks_Slot_C_HandleHovered::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_SelectionDetails_InfoSlots_Perks_Slot_C_HandleHovered, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'WBP_SelectionDetails_InfoSlots_Perks_Slot_C_HandleHovered::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SelectionDetails_InfoSlots_Perks_Slot_C_HandleHovered, CallFunc_IsValid_ReturnValue) == 0x00001C, "Member 'WBP_SelectionDetails_InfoSlots_Perks_Slot_C_HandleHovered::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SelectionDetails_InfoSlots_Perks_Slot_C_HandleHovered, CallFunc_GetTedPlayerController_ReturnValue) == 0x000020, "Member 'WBP_SelectionDetails_InfoSlots_Perks_Slot_C_HandleHovered::CallFunc_GetTedPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SelectionDetails_InfoSlots_Perks_Slot_C_HandleHovered, CallFunc_GetSelectedPawns_ReturnValue) == 0x000028, "Member 'WBP_SelectionDetails_InfoSlots_Perks_Slot_C_HandleHovered::CallFunc_GetSelectedPawns_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SelectionDetails_InfoSlots_Perks_Slot_C_HandleHovered, CallFunc_Set_ToArray_Result) == 0x000078, "Member 'WBP_SelectionDetails_InfoSlots_Perks_Slot_C_HandleHovered::CallFunc_Set_ToArray_Result' has a wrong offset!");
static_assert(offsetof(WBP_SelectionDetails_InfoSlots_Perks_Slot_C_HandleHovered, CallFunc_Set_IsNotEmpty_ReturnValue) == 0x000088, "Member 'WBP_SelectionDetails_InfoSlots_Perks_Slot_C_HandleHovered::CallFunc_Set_IsNotEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SelectionDetails_InfoSlots_Perks_Slot_C_HandleHovered, CallFunc_Array_Get_Item) == 0x000090, "Member 'WBP_SelectionDetails_InfoSlots_Perks_Slot_C_HandleHovered::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_SelectionDetails_InfoSlots_Perks_Slot_C_HandleHovered, CallFunc_K2_GetComponentsByClass_ReturnValue) == 0x000098, "Member 'WBP_SelectionDetails_InfoSlots_Perks_Slot_C_HandleHovered::CallFunc_K2_GetComponentsByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SelectionDetails_InfoSlots_Perks_Slot_C_HandleHovered, CallFunc_Array_Length_ReturnValue) == 0x0000A8, "Member 'WBP_SelectionDetails_InfoSlots_Perks_Slot_C_HandleHovered::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SelectionDetails_InfoSlots_Perks_Slot_C_HandleHovered, CallFunc_Array_Get_Item_1) == 0x0000B0, "Member 'WBP_SelectionDetails_InfoSlots_Perks_Slot_C_HandleHovered::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_SelectionDetails_InfoSlots_Perks_Slot_C_HandleHovered, CallFunc_Less_IntInt_ReturnValue) == 0x0000B8, "Member 'WBP_SelectionDetails_InfoSlots_Perks_Slot_C_HandleHovered::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_SelectionDetails_InfoSlots_Perks_Slot.WBP_SelectionDetails_InfoSlots_Perks_Slot_C.OnMouseEnter
// 0x00B0 (0x00B0 - 0x0000)
struct WBP_SelectionDetails_InfoSlots_Perks_Slot_C_OnMouseEnter final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_SelectionDetails_InfoSlots_Perks_Slot_C_OnMouseEnter) == 0x000008, "Wrong alignment on WBP_SelectionDetails_InfoSlots_Perks_Slot_C_OnMouseEnter");
static_assert(sizeof(WBP_SelectionDetails_InfoSlots_Perks_Slot_C_OnMouseEnter) == 0x0000B0, "Wrong size on WBP_SelectionDetails_InfoSlots_Perks_Slot_C_OnMouseEnter");
static_assert(offsetof(WBP_SelectionDetails_InfoSlots_Perks_Slot_C_OnMouseEnter, MyGeometry) == 0x000000, "Member 'WBP_SelectionDetails_InfoSlots_Perks_Slot_C_OnMouseEnter::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_SelectionDetails_InfoSlots_Perks_Slot_C_OnMouseEnter, MouseEvent) == 0x000038, "Member 'WBP_SelectionDetails_InfoSlots_Perks_Slot_C_OnMouseEnter::MouseEvent' has a wrong offset!");

// Function WBP_SelectionDetails_InfoSlots_Perks_Slot.WBP_SelectionDetails_InfoSlots_Perks_Slot_C.OnMouseLeave
// 0x0078 (0x0078 - 0x0000)
struct WBP_SelectionDetails_InfoSlots_Perks_Slot_C_OnMouseLeave final
{
public:
	struct FPointerEvent                          MouseEvent;                                        // 0x0000(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_SelectionDetails_InfoSlots_Perks_Slot_C_OnMouseLeave) == 0x000008, "Wrong alignment on WBP_SelectionDetails_InfoSlots_Perks_Slot_C_OnMouseLeave");
static_assert(sizeof(WBP_SelectionDetails_InfoSlots_Perks_Slot_C_OnMouseLeave) == 0x000078, "Wrong size on WBP_SelectionDetails_InfoSlots_Perks_Slot_C_OnMouseLeave");
static_assert(offsetof(WBP_SelectionDetails_InfoSlots_Perks_Slot_C_OnMouseLeave, MouseEvent) == 0x000000, "Member 'WBP_SelectionDetails_InfoSlots_Perks_Slot_C_OnMouseLeave::MouseEvent' has a wrong offset!");

// Function WBP_SelectionDetails_InfoSlots_Perks_Slot.WBP_SelectionDetails_InfoSlots_Perks_Slot_C.GetMaterialsSupportingStates
// 0x0028 (0x0028 - 0x0000)
struct WBP_SelectionDetails_InfoSlots_Perks_Slot_C_GetMaterialsSupportingStates final
{
public:
	TArray<class UMaterialInstanceDynamic*>       OutMIDs;                                           // 0x0000(0x0010)(Parm, OutParm)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UMaterialInstanceDynamic*>       K2Node_MakeArray_Array;                            // 0x0018(0x0010)(ReferenceParm)
};
static_assert(alignof(WBP_SelectionDetails_InfoSlots_Perks_Slot_C_GetMaterialsSupportingStates) == 0x000008, "Wrong alignment on WBP_SelectionDetails_InfoSlots_Perks_Slot_C_GetMaterialsSupportingStates");
static_assert(sizeof(WBP_SelectionDetails_InfoSlots_Perks_Slot_C_GetMaterialsSupportingStates) == 0x000028, "Wrong size on WBP_SelectionDetails_InfoSlots_Perks_Slot_C_GetMaterialsSupportingStates");
static_assert(offsetof(WBP_SelectionDetails_InfoSlots_Perks_Slot_C_GetMaterialsSupportingStates, OutMIDs) == 0x000000, "Member 'WBP_SelectionDetails_InfoSlots_Perks_Slot_C_GetMaterialsSupportingStates::OutMIDs' has a wrong offset!");
static_assert(offsetof(WBP_SelectionDetails_InfoSlots_Perks_Slot_C_GetMaterialsSupportingStates, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000010, "Member 'WBP_SelectionDetails_InfoSlots_Perks_Slot_C_GetMaterialsSupportingStates::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SelectionDetails_InfoSlots_Perks_Slot_C_GetMaterialsSupportingStates, K2Node_MakeArray_Array) == 0x000018, "Member 'WBP_SelectionDetails_InfoSlots_Perks_Slot_C_GetMaterialsSupportingStates::K2Node_MakeArray_Array' has a wrong offset!");

}

