#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_HUD_CursorState_Selection

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Tempest_classes.hpp"
#include "RTSColor_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_HUD_CursorState_Selection.WBP_HUD_CursorState_Selection_C
// 0x0040 (0x0460 - 0x0420)
class UWBP_HUD_CursorState_Selection_C final : public UTedCursorState
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0420(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_Icon;                                        // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               IconDMI;                                           // 0x0430(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             flipbook;                                          // 0x0438(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        FriendlyHueShift;                                  // 0x0440(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        HostileHueShift;                                   // 0x0448(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        NeutralHueShift;                                   // 0x0450(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        SelfHueShift;                                      // 0x0458(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_HUD_CursorState_Selection(int32 EntryPoint);
	void RefreshUI();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_HUD_CursorState_Selection_C">();
	}
	static class UWBP_HUD_CursorState_Selection_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_HUD_CursorState_Selection_C>();
	}
};
static_assert(alignof(UWBP_HUD_CursorState_Selection_C) == 0x000008, "Wrong alignment on UWBP_HUD_CursorState_Selection_C");
static_assert(sizeof(UWBP_HUD_CursorState_Selection_C) == 0x000460, "Wrong size on UWBP_HUD_CursorState_Selection_C");
static_assert(offsetof(UWBP_HUD_CursorState_Selection_C, UberGraphFrame) == 0x000420, "Member 'UWBP_HUD_CursorState_Selection_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_CursorState_Selection_C, Image_Icon) == 0x000428, "Member 'UWBP_HUD_CursorState_Selection_C::Image_Icon' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_CursorState_Selection_C, IconDMI) == 0x000430, "Member 'UWBP_HUD_CursorState_Selection_C::IconDMI' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_CursorState_Selection_C, flipbook) == 0x000438, "Member 'UWBP_HUD_CursorState_Selection_C::flipbook' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_CursorState_Selection_C, FriendlyHueShift) == 0x000440, "Member 'UWBP_HUD_CursorState_Selection_C::FriendlyHueShift' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_CursorState_Selection_C, HostileHueShift) == 0x000448, "Member 'UWBP_HUD_CursorState_Selection_C::HostileHueShift' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_CursorState_Selection_C, NeutralHueShift) == 0x000450, "Member 'UWBP_HUD_CursorState_Selection_C::NeutralHueShift' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_CursorState_Selection_C, SelfHueShift) == 0x000458, "Member 'UWBP_HUD_CursorState_Selection_C::SelfHueShift' has a wrong offset!");

}

