#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_HUD_SelectionDetailsCorner

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Tempest_structs.hpp"
#include "Tempest_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_HUD_SelectionDetailsCorner.WBP_HUD_SelectionDetailsCorner_C
// 0x0068 (0x0480 - 0x0418)
class UWBP_HUD_SelectionDetailsCorner_C final : public UTedSelectionDetailsController
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0418(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_Commands_Panel_C*                  Commands_Common;                                   // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Commands_Panel_C*                  Commands_PawnSpecific;                             // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SelectionDetails_GarrisonedPawns_C* Extension_GarrisonedPawns;                        // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                Extension_None;                                    // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_HUD_SelectionDetails_UnitScrolling_Panel_C* Extension_UnitScrolling;                  // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SelectionDetails_Upgrades_C*       Extension_Upgrades;                                // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_CommonCmds_Root;                           // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_PawnSpecific_Root;                         // 0x0458(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_HUD_SelectionDetails_SelectedPawnDetails_C* SelectedPawnDetails;                      // 0x0460(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_HUD_SelectionDetails_SelectedPawnsPanel_C* SelectedPawnsPanel;                        // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_Extension;                          // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_SelectionInfo;                      // 0x0478(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BndEvt__CommonCommands_K2Node_ComponentBoundEvent_0_OnVisibilityChangedEvent__DelegateSignature(ESlateVisibility InVisibility);
	void BndEvt__PawnSpecificCommands_K2Node_ComponentBoundEvent_1_OnVisibilityChangedEvent__DelegateSignature(ESlateVisibility InVisibility);
	void BndEvt__WBP_HUD_SelectionDetailsCorner_Extension_Upgrades_K2Node_ComponentBoundEvent_4_OnVisibilityChangedEvent__DelegateSignature(ESlateVisibility InVisibility);
	void BndEvt__WBP_HUD_SelectionDetailsCorner_SelectedPawnsPanel_K2Node_ComponentBoundEvent_3_DynamicContentPanelDelegateSignature__DelegateSignature(class UTedContentPanelDynamic* InContentPanel);
	void BndEvt__WBP_HUD_SelectionDetailsCorner_UnitScrolling_Panel_K2Node_ComponentBoundEvent_2_ContentPanelActionDelegateSignature__DelegateSignature(class UTedContentPanelBase* InContentPanel, class UTedContentPanelSlotBase* InContentSlot, ETedContentSlotAction InAction);
	void Construct();
	void ExecuteUbergraph_WBP_HUD_SelectionDetailsCorner(int32 EntryPoint);
	void GetOwningPC(class ATedPlayerController** OutTedPC);
	void HandleUnitRotationAction(class UTedContentPanelBase* InContentPanel, class UTedContentPanelSlotBase* InContentSlot, ETedContentSlotAction InAction);
	void HandleUnitScrollingAction(class UTedContentPanelSlotBase* InSlot, ETedContentSlotAction InAction);
	bool IsMyPawn(class ATedPawn* InPawn);
	void K2_OnSelectionChange();
	void K2_OnSingleSelectionOwnershipChange(class ATedPawn* InSelectedPawn);
	void RefreshUI();
	void ShowSelectionInfo(const TArray<class ATedPawn*>& InSelectedPawns);
	void UpdateUnitScrollingState();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_HUD_SelectionDetailsCorner_C">();
	}
	static class UWBP_HUD_SelectionDetailsCorner_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_HUD_SelectionDetailsCorner_C>();
	}
};
static_assert(alignof(UWBP_HUD_SelectionDetailsCorner_C) == 0x000008, "Wrong alignment on UWBP_HUD_SelectionDetailsCorner_C");
static_assert(sizeof(UWBP_HUD_SelectionDetailsCorner_C) == 0x000480, "Wrong size on UWBP_HUD_SelectionDetailsCorner_C");
static_assert(offsetof(UWBP_HUD_SelectionDetailsCorner_C, UberGraphFrame) == 0x000418, "Member 'UWBP_HUD_SelectionDetailsCorner_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_SelectionDetailsCorner_C, Commands_Common) == 0x000420, "Member 'UWBP_HUD_SelectionDetailsCorner_C::Commands_Common' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_SelectionDetailsCorner_C, Commands_PawnSpecific) == 0x000428, "Member 'UWBP_HUD_SelectionDetailsCorner_C::Commands_PawnSpecific' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_SelectionDetailsCorner_C, Extension_GarrisonedPawns) == 0x000430, "Member 'UWBP_HUD_SelectionDetailsCorner_C::Extension_GarrisonedPawns' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_SelectionDetailsCorner_C, Extension_None) == 0x000438, "Member 'UWBP_HUD_SelectionDetailsCorner_C::Extension_None' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_SelectionDetailsCorner_C, Extension_UnitScrolling) == 0x000440, "Member 'UWBP_HUD_SelectionDetailsCorner_C::Extension_UnitScrolling' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_SelectionDetailsCorner_C, Extension_Upgrades) == 0x000448, "Member 'UWBP_HUD_SelectionDetailsCorner_C::Extension_Upgrades' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_SelectionDetailsCorner_C, Overlay_CommonCmds_Root) == 0x000450, "Member 'UWBP_HUD_SelectionDetailsCorner_C::Overlay_CommonCmds_Root' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_SelectionDetailsCorner_C, Overlay_PawnSpecific_Root) == 0x000458, "Member 'UWBP_HUD_SelectionDetailsCorner_C::Overlay_PawnSpecific_Root' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_SelectionDetailsCorner_C, SelectedPawnDetails) == 0x000460, "Member 'UWBP_HUD_SelectionDetailsCorner_C::SelectedPawnDetails' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_SelectionDetailsCorner_C, SelectedPawnsPanel) == 0x000468, "Member 'UWBP_HUD_SelectionDetailsCorner_C::SelectedPawnsPanel' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_SelectionDetailsCorner_C, WidgetSwitcher_Extension) == 0x000470, "Member 'UWBP_HUD_SelectionDetailsCorner_C::WidgetSwitcher_Extension' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_SelectionDetailsCorner_C, WidgetSwitcher_SelectionInfo) == 0x000478, "Member 'UWBP_HUD_SelectionDetailsCorner_C::WidgetSwitcher_SelectionInfo' has a wrong offset!");

}

