#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_HUD_SelectionGroups_Slot

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Tempest_structs.hpp"
#include "Tempest_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_HUD_SelectionGroups_Slot.WBP_HUD_SelectionGroups_Slot_C
// 0x0030 (0x0460 - 0x0430)
class UWBP_HUD_SelectionGroups_Slot_C final : public UTedContentPanelSlotButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0430(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_Background;                                  // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Hover;                                       // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_GroupNumber;                             // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_GroupSize;                               // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bEnableSizeDisplay;                                // 0x0458(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_HUD_SelectionGroups_Slot(int32 EntryPoint);
	void FocusCameraOnGroup();
	void OnActivateState(ETedContentSlotState InState, bool bInActivated);
	void OnTriggerAction(ETedContentSlotAction InAction);
	void RefreshUI();
	void UpdateHoverEffectVisibility();
	void UpdateSize(int32 InSize);
	void UpdateTextColor();

	void GetMaterialsSupportingStates(TArray<class UMaterialInstanceDynamic*>* OutMIDs) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_HUD_SelectionGroups_Slot_C">();
	}
	static class UWBP_HUD_SelectionGroups_Slot_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_HUD_SelectionGroups_Slot_C>();
	}
};
static_assert(alignof(UWBP_HUD_SelectionGroups_Slot_C) == 0x000008, "Wrong alignment on UWBP_HUD_SelectionGroups_Slot_C");
static_assert(sizeof(UWBP_HUD_SelectionGroups_Slot_C) == 0x000460, "Wrong size on UWBP_HUD_SelectionGroups_Slot_C");
static_assert(offsetof(UWBP_HUD_SelectionGroups_Slot_C, UberGraphFrame) == 0x000430, "Member 'UWBP_HUD_SelectionGroups_Slot_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_SelectionGroups_Slot_C, Image_Background) == 0x000438, "Member 'UWBP_HUD_SelectionGroups_Slot_C::Image_Background' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_SelectionGroups_Slot_C, Image_Hover) == 0x000440, "Member 'UWBP_HUD_SelectionGroups_Slot_C::Image_Hover' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_SelectionGroups_Slot_C, TextBlock_GroupNumber) == 0x000448, "Member 'UWBP_HUD_SelectionGroups_Slot_C::TextBlock_GroupNumber' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_SelectionGroups_Slot_C, TextBlock_GroupSize) == 0x000450, "Member 'UWBP_HUD_SelectionGroups_Slot_C::TextBlock_GroupSize' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_SelectionGroups_Slot_C, bEnableSizeDisplay) == 0x000458, "Member 'UWBP_HUD_SelectionGroups_Slot_C::bEnableSizeDisplay' has a wrong offset!");

}

