#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MoviePlayer_Fill_Overlay

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_MoviePlayer_Fill_Overlay.WBP_MoviePlayer_Fill_Overlay_C.K2_OnStart
// 0x0008 (0x0008 - 0x0000)
struct WBP_MoviePlayer_Fill_Overlay_C_K2_OnStart final
{
public:
	const class UFileMediaSource*                 InMovie;                                           // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MoviePlayer_Fill_Overlay_C_K2_OnStart) == 0x000008, "Wrong alignment on WBP_MoviePlayer_Fill_Overlay_C_K2_OnStart");
static_assert(sizeof(WBP_MoviePlayer_Fill_Overlay_C_K2_OnStart) == 0x000008, "Wrong size on WBP_MoviePlayer_Fill_Overlay_C_K2_OnStart");
static_assert(offsetof(WBP_MoviePlayer_Fill_Overlay_C_K2_OnStart, InMovie) == 0x000000, "Member 'WBP_MoviePlayer_Fill_Overlay_C_K2_OnStart::InMovie' has a wrong offset!");

// Function WBP_MoviePlayer_Fill_Overlay.WBP_MoviePlayer_Fill_Overlay_C.ExecuteUbergraph_WBP_MoviePlayer_Fill_Overlay
// 0x00E0 (0x00E0 - 0x0000)
struct WBP_MoviePlayer_Fill_Overlay_C_ExecuteUbergraph_WBP_MoviePlayer_Fill_Overlay final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayingEditorPreview_ReturnValue;       // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	const class UFileMediaSource*                 K2Node_Event_InMovie;                              // 0x0008(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FSlateBrush                            CallFunc_DetermineBrush_ReturnValue;               // 0x0010(0x00D0)()
};
static_assert(alignof(WBP_MoviePlayer_Fill_Overlay_C_ExecuteUbergraph_WBP_MoviePlayer_Fill_Overlay) == 0x000010, "Wrong alignment on WBP_MoviePlayer_Fill_Overlay_C_ExecuteUbergraph_WBP_MoviePlayer_Fill_Overlay");
static_assert(sizeof(WBP_MoviePlayer_Fill_Overlay_C_ExecuteUbergraph_WBP_MoviePlayer_Fill_Overlay) == 0x0000E0, "Wrong size on WBP_MoviePlayer_Fill_Overlay_C_ExecuteUbergraph_WBP_MoviePlayer_Fill_Overlay");
static_assert(offsetof(WBP_MoviePlayer_Fill_Overlay_C_ExecuteUbergraph_WBP_MoviePlayer_Fill_Overlay, EntryPoint) == 0x000000, "Member 'WBP_MoviePlayer_Fill_Overlay_C_ExecuteUbergraph_WBP_MoviePlayer_Fill_Overlay::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_MoviePlayer_Fill_Overlay_C_ExecuteUbergraph_WBP_MoviePlayer_Fill_Overlay, CallFunc_IsPlayingEditorPreview_ReturnValue) == 0x000004, "Member 'WBP_MoviePlayer_Fill_Overlay_C_ExecuteUbergraph_WBP_MoviePlayer_Fill_Overlay::CallFunc_IsPlayingEditorPreview_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MoviePlayer_Fill_Overlay_C_ExecuteUbergraph_WBP_MoviePlayer_Fill_Overlay, K2Node_Event_InMovie) == 0x000008, "Member 'WBP_MoviePlayer_Fill_Overlay_C_ExecuteUbergraph_WBP_MoviePlayer_Fill_Overlay::K2Node_Event_InMovie' has a wrong offset!");
static_assert(offsetof(WBP_MoviePlayer_Fill_Overlay_C_ExecuteUbergraph_WBP_MoviePlayer_Fill_Overlay, CallFunc_DetermineBrush_ReturnValue) == 0x000010, "Member 'WBP_MoviePlayer_Fill_Overlay_C_ExecuteUbergraph_WBP_MoviePlayer_Fill_Overlay::CallFunc_DetermineBrush_ReturnValue' has a wrong offset!");

}

