#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_HarvestersCard_Slot

#include "Basic.hpp"

#include "Tempest_structs.hpp"
#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_HarvestersCard_Slot.WBP_HarvestersCard_Slot_C.ExecuteUbergraph_WBP_HarvestersCard_Slot
// 0x0140 (0x0140 - 0x0000)
struct WBP_HarvestersCard_Slot_C_ExecuteUbergraph_WBP_HarvestersCard_Slot final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetSlotIndex_ReturnValue;                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATedPawn*                               CallFunc_GetContent_ReturnValue;                   // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetHealthMax_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetHealth_ReturnValue;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETedContentSlotState                          K2Node_Event_InState;                              // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInActivated;                         // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_OldValue;                             // 0x0040(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_NewValue;                             // 0x0044(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATedPawn*                               CallFunc_GetContent_ReturnValue_1;                 // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_BD_DYN_RefineryV2_C*                K2Node_DynamicCast_AsBP_BD_DYN_Refinery_V2;        // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ITedMobileRefineryInterface> CallFunc_K2_GetHarvesters_self_CastInput;    // 0x0070(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ATedUnitBase*>                   CallFunc_K2_GetHarvesters_ReturnValue;             // 0x0080(0x0010)(ReferenceParm)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTedContentPanelBase*                   CallFunc_K2_GetParentContentPanel_ReturnValue;     // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UTedWorkersWidget*                      CallFunc_GetParentWorkerWidget_ReturnValue;        // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_HarvestersCard_Panel_C*            K2Node_DynamicCast_AsWBP_Harvesters_Card_Panel;    // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATedPawn*                               CallFunc_GetSlotContent_ReturnValue;               // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_HarvestersCard_Button_C*           K2Node_DynamicCast_AsWBP_Harvesters_Card_Button;   // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetOwningPlayerPawn_ReturnValue;          // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_TeleportTo_ReturnValue;                // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETedContentSlotAction                         K2Node_Event_InAction;                             // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x010A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x010B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETedContentSlotState                          CallFunc_GetState_TempestWorkerIdle_ReturnValue;   // 0x010C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x010D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x010E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10F[0x1];                                      // 0x010F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_B_ImplicitCast;       // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_A_ImplicitCast;       // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_124[0x4];                                      // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_B_ImplicitCast;      // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_1; // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HarvestersCard_Slot_C_ExecuteUbergraph_WBP_HarvestersCard_Slot) == 0x000008, "Wrong alignment on WBP_HarvestersCard_Slot_C_ExecuteUbergraph_WBP_HarvestersCard_Slot");
static_assert(sizeof(WBP_HarvestersCard_Slot_C_ExecuteUbergraph_WBP_HarvestersCard_Slot) == 0x000140, "Wrong size on WBP_HarvestersCard_Slot_C_ExecuteUbergraph_WBP_HarvestersCard_Slot");
static_assert(offsetof(WBP_HarvestersCard_Slot_C_ExecuteUbergraph_WBP_HarvestersCard_Slot, EntryPoint) == 0x000000, "Member 'WBP_HarvestersCard_Slot_C_ExecuteUbergraph_WBP_HarvestersCard_Slot::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_HarvestersCard_Slot_C_ExecuteUbergraph_WBP_HarvestersCard_Slot, Temp_byte_Variable) == 0x000004, "Member 'WBP_HarvestersCard_Slot_C_ExecuteUbergraph_WBP_HarvestersCard_Slot::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_HarvestersCard_Slot_C_ExecuteUbergraph_WBP_HarvestersCard_Slot, CallFunc_GetSlotIndex_ReturnValue) == 0x000008, "Member 'WBP_HarvestersCard_Slot_C_ExecuteUbergraph_WBP_HarvestersCard_Slot::CallFunc_GetSlotIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HarvestersCard_Slot_C_ExecuteUbergraph_WBP_HarvestersCard_Slot, CallFunc_GetContent_ReturnValue) == 0x000010, "Member 'WBP_HarvestersCard_Slot_C_ExecuteUbergraph_WBP_HarvestersCard_Slot::CallFunc_GetContent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HarvestersCard_Slot_C_ExecuteUbergraph_WBP_HarvestersCard_Slot, CallFunc_GetHealthMax_ReturnValue) == 0x000018, "Member 'WBP_HarvestersCard_Slot_C_ExecuteUbergraph_WBP_HarvestersCard_Slot::CallFunc_GetHealthMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HarvestersCard_Slot_C_ExecuteUbergraph_WBP_HarvestersCard_Slot, CallFunc_GetHealth_ReturnValue) == 0x00001C, "Member 'WBP_HarvestersCard_Slot_C_ExecuteUbergraph_WBP_HarvestersCard_Slot::CallFunc_GetHealth_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HarvestersCard_Slot_C_ExecuteUbergraph_WBP_HarvestersCard_Slot, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'WBP_HarvestersCard_Slot_C_ExecuteUbergraph_WBP_HarvestersCard_Slot::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HarvestersCard_Slot_C_ExecuteUbergraph_WBP_HarvestersCard_Slot, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000028, "Member 'WBP_HarvestersCard_Slot_C_ExecuteUbergraph_WBP_HarvestersCard_Slot::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HarvestersCard_Slot_C_ExecuteUbergraph_WBP_HarvestersCard_Slot, K2Node_Event_InState) == 0x000030, "Member 'WBP_HarvestersCard_Slot_C_ExecuteUbergraph_WBP_HarvestersCard_Slot::K2Node_Event_InState' has a wrong offset!");
static_assert(offsetof(WBP_HarvestersCard_Slot_C_ExecuteUbergraph_WBP_HarvestersCard_Slot, K2Node_Event_bInActivated) == 0x000031, "Member 'WBP_HarvestersCard_Slot_C_ExecuteUbergraph_WBP_HarvestersCard_Slot::K2Node_Event_bInActivated' has a wrong offset!");
static_assert(offsetof(WBP_HarvestersCard_Slot_C_ExecuteUbergraph_WBP_HarvestersCard_Slot, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000038, "Member 'WBP_HarvestersCard_Slot_C_ExecuteUbergraph_WBP_HarvestersCard_Slot::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HarvestersCard_Slot_C_ExecuteUbergraph_WBP_HarvestersCard_Slot, K2Node_Event_OldValue) == 0x000040, "Member 'WBP_HarvestersCard_Slot_C_ExecuteUbergraph_WBP_HarvestersCard_Slot::K2Node_Event_OldValue' has a wrong offset!");
static_assert(offsetof(WBP_HarvestersCard_Slot_C_ExecuteUbergraph_WBP_HarvestersCard_Slot, K2Node_Event_NewValue) == 0x000044, "Member 'WBP_HarvestersCard_Slot_C_ExecuteUbergraph_WBP_HarvestersCard_Slot::K2Node_Event_NewValue' has a wrong offset!");
static_assert(offsetof(WBP_HarvestersCard_Slot_C_ExecuteUbergraph_WBP_HarvestersCard_Slot, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000048, "Member 'WBP_HarvestersCard_Slot_C_ExecuteUbergraph_WBP_HarvestersCard_Slot::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HarvestersCard_Slot_C_ExecuteUbergraph_WBP_HarvestersCard_Slot, CallFunc_GetContent_ReturnValue_1) == 0x000050, "Member 'WBP_HarvestersCard_Slot_C_ExecuteUbergraph_WBP_HarvestersCard_Slot::CallFunc_GetContent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_HarvestersCard_Slot_C_ExecuteUbergraph_WBP_HarvestersCard_Slot, Temp_bool_Variable) == 0x000058, "Member 'WBP_HarvestersCard_Slot_C_ExecuteUbergraph_WBP_HarvestersCard_Slot::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_HarvestersCard_Slot_C_ExecuteUbergraph_WBP_HarvestersCard_Slot, K2Node_DynamicCast_AsBP_BD_DYN_Refinery_V2) == 0x000060, "Member 'WBP_HarvestersCard_Slot_C_ExecuteUbergraph_WBP_HarvestersCard_Slot::K2Node_DynamicCast_AsBP_BD_DYN_Refinery_V2' has a wrong offset!");
static_assert(offsetof(WBP_HarvestersCard_Slot_C_ExecuteUbergraph_WBP_HarvestersCard_Slot, K2Node_DynamicCast_bSuccess) == 0x000068, "Member 'WBP_HarvestersCard_Slot_C_ExecuteUbergraph_WBP_HarvestersCard_Slot::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_HarvestersCard_Slot_C_ExecuteUbergraph_WBP_HarvestersCard_Slot, CallFunc_K2_GetHarvesters_self_CastInput) == 0x000070, "Member 'WBP_HarvestersCard_Slot_C_ExecuteUbergraph_WBP_HarvestersCard_Slot::CallFunc_K2_GetHarvesters_self_CastInput' has a wrong offset!");
static_assert(offsetof(WBP_HarvestersCard_Slot_C_ExecuteUbergraph_WBP_HarvestersCard_Slot, CallFunc_K2_GetHarvesters_ReturnValue) == 0x000080, "Member 'WBP_HarvestersCard_Slot_C_ExecuteUbergraph_WBP_HarvestersCard_Slot::CallFunc_K2_GetHarvesters_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HarvestersCard_Slot_C_ExecuteUbergraph_WBP_HarvestersCard_Slot, CallFunc_IsValid_ReturnValue_1) == 0x000090, "Member 'WBP_HarvestersCard_Slot_C_ExecuteUbergraph_WBP_HarvestersCard_Slot::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_HarvestersCard_Slot_C_ExecuteUbergraph_WBP_HarvestersCard_Slot, CallFunc_Array_Length_ReturnValue) == 0x000094, "Member 'WBP_HarvestersCard_Slot_C_ExecuteUbergraph_WBP_HarvestersCard_Slot::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HarvestersCard_Slot_C_ExecuteUbergraph_WBP_HarvestersCard_Slot, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000098, "Member 'WBP_HarvestersCard_Slot_C_ExecuteUbergraph_WBP_HarvestersCard_Slot::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HarvestersCard_Slot_C_ExecuteUbergraph_WBP_HarvestersCard_Slot, CallFunc_GetDynamicMaterial_ReturnValue_1) == 0x0000A0, "Member 'WBP_HarvestersCard_Slot_C_ExecuteUbergraph_WBP_HarvestersCard_Slot::CallFunc_GetDynamicMaterial_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_HarvestersCard_Slot_C_ExecuteUbergraph_WBP_HarvestersCard_Slot, CallFunc_K2_GetParentContentPanel_ReturnValue) == 0x0000A8, "Member 'WBP_HarvestersCard_Slot_C_ExecuteUbergraph_WBP_HarvestersCard_Slot::CallFunc_K2_GetParentContentPanel_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HarvestersCard_Slot_C_ExecuteUbergraph_WBP_HarvestersCard_Slot, CallFunc_GetParentWorkerWidget_ReturnValue) == 0x0000B0, "Member 'WBP_HarvestersCard_Slot_C_ExecuteUbergraph_WBP_HarvestersCard_Slot::CallFunc_GetParentWorkerWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HarvestersCard_Slot_C_ExecuteUbergraph_WBP_HarvestersCard_Slot, K2Node_DynamicCast_AsWBP_Harvesters_Card_Panel) == 0x0000B8, "Member 'WBP_HarvestersCard_Slot_C_ExecuteUbergraph_WBP_HarvestersCard_Slot::K2Node_DynamicCast_AsWBP_Harvesters_Card_Panel' has a wrong offset!");
static_assert(offsetof(WBP_HarvestersCard_Slot_C_ExecuteUbergraph_WBP_HarvestersCard_Slot, K2Node_DynamicCast_bSuccess_1) == 0x0000C0, "Member 'WBP_HarvestersCard_Slot_C_ExecuteUbergraph_WBP_HarvestersCard_Slot::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_HarvestersCard_Slot_C_ExecuteUbergraph_WBP_HarvestersCard_Slot, CallFunc_GetSlotContent_ReturnValue) == 0x0000C8, "Member 'WBP_HarvestersCard_Slot_C_ExecuteUbergraph_WBP_HarvestersCard_Slot::CallFunc_GetSlotContent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HarvestersCard_Slot_C_ExecuteUbergraph_WBP_HarvestersCard_Slot, K2Node_DynamicCast_AsWBP_Harvesters_Card_Button) == 0x0000D0, "Member 'WBP_HarvestersCard_Slot_C_ExecuteUbergraph_WBP_HarvestersCard_Slot::K2Node_DynamicCast_AsWBP_Harvesters_Card_Button' has a wrong offset!");
static_assert(offsetof(WBP_HarvestersCard_Slot_C_ExecuteUbergraph_WBP_HarvestersCard_Slot, K2Node_DynamicCast_bSuccess_2) == 0x0000D8, "Member 'WBP_HarvestersCard_Slot_C_ExecuteUbergraph_WBP_HarvestersCard_Slot::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WBP_HarvestersCard_Slot_C_ExecuteUbergraph_WBP_HarvestersCard_Slot, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0000E0, "Member 'WBP_HarvestersCard_Slot_C_ExecuteUbergraph_WBP_HarvestersCard_Slot::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HarvestersCard_Slot_C_ExecuteUbergraph_WBP_HarvestersCard_Slot, CallFunc_IsValid_ReturnValue_2) == 0x0000F8, "Member 'WBP_HarvestersCard_Slot_C_ExecuteUbergraph_WBP_HarvestersCard_Slot::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_HarvestersCard_Slot_C_ExecuteUbergraph_WBP_HarvestersCard_Slot, CallFunc_GetOwningPlayerPawn_ReturnValue) == 0x000100, "Member 'WBP_HarvestersCard_Slot_C_ExecuteUbergraph_WBP_HarvestersCard_Slot::CallFunc_GetOwningPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HarvestersCard_Slot_C_ExecuteUbergraph_WBP_HarvestersCard_Slot, CallFunc_K2_TeleportTo_ReturnValue) == 0x000108, "Member 'WBP_HarvestersCard_Slot_C_ExecuteUbergraph_WBP_HarvestersCard_Slot::CallFunc_K2_TeleportTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HarvestersCard_Slot_C_ExecuteUbergraph_WBP_HarvestersCard_Slot, K2Node_Event_InAction) == 0x000109, "Member 'WBP_HarvestersCard_Slot_C_ExecuteUbergraph_WBP_HarvestersCard_Slot::K2Node_Event_InAction' has a wrong offset!");
static_assert(offsetof(WBP_HarvestersCard_Slot_C_ExecuteUbergraph_WBP_HarvestersCard_Slot, K2Node_SwitchEnum_CmpSuccess) == 0x00010A, "Member 'WBP_HarvestersCard_Slot_C_ExecuteUbergraph_WBP_HarvestersCard_Slot::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_HarvestersCard_Slot_C_ExecuteUbergraph_WBP_HarvestersCard_Slot, Temp_byte_Variable_1) == 0x00010B, "Member 'WBP_HarvestersCard_Slot_C_ExecuteUbergraph_WBP_HarvestersCard_Slot::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_HarvestersCard_Slot_C_ExecuteUbergraph_WBP_HarvestersCard_Slot, CallFunc_GetState_TempestWorkerIdle_ReturnValue) == 0x00010C, "Member 'WBP_HarvestersCard_Slot_C_ExecuteUbergraph_WBP_HarvestersCard_Slot::CallFunc_GetState_TempestWorkerIdle_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HarvestersCard_Slot_C_ExecuteUbergraph_WBP_HarvestersCard_Slot, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00010D, "Member 'WBP_HarvestersCard_Slot_C_ExecuteUbergraph_WBP_HarvestersCard_Slot::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HarvestersCard_Slot_C_ExecuteUbergraph_WBP_HarvestersCard_Slot, K2Node_Select_Default) == 0x00010E, "Member 'WBP_HarvestersCard_Slot_C_ExecuteUbergraph_WBP_HarvestersCard_Slot::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_HarvestersCard_Slot_C_ExecuteUbergraph_WBP_HarvestersCard_Slot, CallFunc_Divide_DoubleDouble_B_ImplicitCast) == 0x000110, "Member 'WBP_HarvestersCard_Slot_C_ExecuteUbergraph_WBP_HarvestersCard_Slot::CallFunc_Divide_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_HarvestersCard_Slot_C_ExecuteUbergraph_WBP_HarvestersCard_Slot, CallFunc_Divide_DoubleDouble_A_ImplicitCast) == 0x000118, "Member 'WBP_HarvestersCard_Slot_C_ExecuteUbergraph_WBP_HarvestersCard_Slot::CallFunc_Divide_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_HarvestersCard_Slot_C_ExecuteUbergraph_WBP_HarvestersCard_Slot, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000120, "Member 'WBP_HarvestersCard_Slot_C_ExecuteUbergraph_WBP_HarvestersCard_Slot::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_HarvestersCard_Slot_C_ExecuteUbergraph_WBP_HarvestersCard_Slot, CallFunc_Greater_DoubleDouble_A_ImplicitCast) == 0x000128, "Member 'WBP_HarvestersCard_Slot_C_ExecuteUbergraph_WBP_HarvestersCard_Slot::CallFunc_Greater_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_HarvestersCard_Slot_C_ExecuteUbergraph_WBP_HarvestersCard_Slot, CallFunc_Greater_DoubleDouble_B_ImplicitCast) == 0x000130, "Member 'WBP_HarvestersCard_Slot_C_ExecuteUbergraph_WBP_HarvestersCard_Slot::CallFunc_Greater_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_HarvestersCard_Slot_C_ExecuteUbergraph_WBP_HarvestersCard_Slot, CallFunc_SetScalarParameterValue_Value_ImplicitCast_1) == 0x000138, "Member 'WBP_HarvestersCard_Slot_C_ExecuteUbergraph_WBP_HarvestersCard_Slot::CallFunc_SetScalarParameterValue_Value_ImplicitCast_1' has a wrong offset!");

// Function WBP_HarvestersCard_Slot.WBP_HarvestersCard_Slot_C.OnActivateState
// 0x0002 (0x0002 - 0x0000)
struct WBP_HarvestersCard_Slot_C_OnActivateState final
{
public:
	ETedContentSlotState                          InState;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bInActivated;                                      // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HarvestersCard_Slot_C_OnActivateState) == 0x000001, "Wrong alignment on WBP_HarvestersCard_Slot_C_OnActivateState");
static_assert(sizeof(WBP_HarvestersCard_Slot_C_OnActivateState) == 0x000002, "Wrong size on WBP_HarvestersCard_Slot_C_OnActivateState");
static_assert(offsetof(WBP_HarvestersCard_Slot_C_OnActivateState, InState) == 0x000000, "Member 'WBP_HarvestersCard_Slot_C_OnActivateState::InState' has a wrong offset!");
static_assert(offsetof(WBP_HarvestersCard_Slot_C_OnActivateState, bInActivated) == 0x000001, "Member 'WBP_HarvestersCard_Slot_C_OnActivateState::bInActivated' has a wrong offset!");

// Function WBP_HarvestersCard_Slot.WBP_HarvestersCard_Slot_C.OnTriggerAction
// 0x0001 (0x0001 - 0x0000)
struct WBP_HarvestersCard_Slot_C_OnTriggerAction final
{
public:
	ETedContentSlotAction                         InAction;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HarvestersCard_Slot_C_OnTriggerAction) == 0x000001, "Wrong alignment on WBP_HarvestersCard_Slot_C_OnTriggerAction");
static_assert(sizeof(WBP_HarvestersCard_Slot_C_OnTriggerAction) == 0x000001, "Wrong size on WBP_HarvestersCard_Slot_C_OnTriggerAction");
static_assert(offsetof(WBP_HarvestersCard_Slot_C_OnTriggerAction, InAction) == 0x000000, "Member 'WBP_HarvestersCard_Slot_C_OnTriggerAction::InAction' has a wrong offset!");

// Function WBP_HarvestersCard_Slot.WBP_HarvestersCard_Slot_C.OnWorkerHealthChanged
// 0x0008 (0x0008 - 0x0000)
struct WBP_HarvestersCard_Slot_C_OnWorkerHealthChanged final
{
public:
	float                                         OldValue;                                          // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         NewValue;                                          // 0x0004(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HarvestersCard_Slot_C_OnWorkerHealthChanged) == 0x000004, "Wrong alignment on WBP_HarvestersCard_Slot_C_OnWorkerHealthChanged");
static_assert(sizeof(WBP_HarvestersCard_Slot_C_OnWorkerHealthChanged) == 0x000008, "Wrong size on WBP_HarvestersCard_Slot_C_OnWorkerHealthChanged");
static_assert(offsetof(WBP_HarvestersCard_Slot_C_OnWorkerHealthChanged, OldValue) == 0x000000, "Member 'WBP_HarvestersCard_Slot_C_OnWorkerHealthChanged::OldValue' has a wrong offset!");
static_assert(offsetof(WBP_HarvestersCard_Slot_C_OnWorkerHealthChanged, NewValue) == 0x000004, "Member 'WBP_HarvestersCard_Slot_C_OnWorkerHealthChanged::NewValue' has a wrong offset!");

// Function WBP_HarvestersCard_Slot.WBP_HarvestersCard_Slot_C.GetMaterialsSupportingStates
// 0x0028 (0x0028 - 0x0000)
struct WBP_HarvestersCard_Slot_C_GetMaterialsSupportingStates final
{
public:
	TArray<class UMaterialInstanceDynamic*>       OutMIDs;                                           // 0x0000(0x0010)(Parm, OutParm)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UMaterialInstanceDynamic*>       K2Node_MakeArray_Array;                            // 0x0018(0x0010)(ReferenceParm)
};
static_assert(alignof(WBP_HarvestersCard_Slot_C_GetMaterialsSupportingStates) == 0x000008, "Wrong alignment on WBP_HarvestersCard_Slot_C_GetMaterialsSupportingStates");
static_assert(sizeof(WBP_HarvestersCard_Slot_C_GetMaterialsSupportingStates) == 0x000028, "Wrong size on WBP_HarvestersCard_Slot_C_GetMaterialsSupportingStates");
static_assert(offsetof(WBP_HarvestersCard_Slot_C_GetMaterialsSupportingStates, OutMIDs) == 0x000000, "Member 'WBP_HarvestersCard_Slot_C_GetMaterialsSupportingStates::OutMIDs' has a wrong offset!");
static_assert(offsetof(WBP_HarvestersCard_Slot_C_GetMaterialsSupportingStates, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000010, "Member 'WBP_HarvestersCard_Slot_C_GetMaterialsSupportingStates::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HarvestersCard_Slot_C_GetMaterialsSupportingStates, K2Node_MakeArray_Array) == 0x000018, "Member 'WBP_HarvestersCard_Slot_C_GetMaterialsSupportingStates::K2Node_MakeArray_Array' has a wrong offset!");

}

