#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ButtonsPanel

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Tempest_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_ButtonsPanel.WBP_ButtonsPanel_C.OnRegisterContentSlot
// 0x0010 (0x0010 - 0x0000)
struct WBP_ButtonsPanel_C_OnRegisterContentSlot final
{
public:
	class UTedContentPanelSlotBase*               InContentSlot;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ETedContentPanelRegistration                  InMode;                                            // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ButtonsPanel_C_OnRegisterContentSlot) == 0x000008, "Wrong alignment on WBP_ButtonsPanel_C_OnRegisterContentSlot");
static_assert(sizeof(WBP_ButtonsPanel_C_OnRegisterContentSlot) == 0x000010, "Wrong size on WBP_ButtonsPanel_C_OnRegisterContentSlot");
static_assert(offsetof(WBP_ButtonsPanel_C_OnRegisterContentSlot, InContentSlot) == 0x000000, "Member 'WBP_ButtonsPanel_C_OnRegisterContentSlot::InContentSlot' has a wrong offset!");
static_assert(offsetof(WBP_ButtonsPanel_C_OnRegisterContentSlot, InMode) == 0x000008, "Member 'WBP_ButtonsPanel_C_OnRegisterContentSlot::InMode' has a wrong offset!");

// Function WBP_ButtonsPanel.WBP_ButtonsPanel_C.ExecuteUbergraph_WBP_ButtonsPanel
// 0x0088 (0x0088 - 0x0000)
struct WBP_ButtonsPanel_C_ExecuteUbergraph_WBP_ButtonsPanel final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetContentSlotsCount_ReturnValue;         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTedContentPanelSlotBase*               K2Node_Event_InContentSlot;                        // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ETedContentPanelRegistration                  K2Node_Event_InMode;                               // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetSlotIndex_ReturnValue;                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMargin                                K2Node_MakeStruct_Margin_1;                        // 0x0034(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMargin                                K2Node_MakeStruct_Margin_2;                        // 0x0048(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FSlateChildSize                        K2Node_MakeStruct_SlateChildSize;                  // 0x0058(0x0008)(NoDestructor)
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBoxSlot*                     CallFunc_SlotAsHorizontalBoxSlot_ReturnValue;      // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_MakeStruct_Left_ImplicitCast;               // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_Right_ImplicitCast;              // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_Left_ImplicitCast_1;             // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_Right_ImplicitCast_1;            // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ButtonsPanel_C_ExecuteUbergraph_WBP_ButtonsPanel) == 0x000008, "Wrong alignment on WBP_ButtonsPanel_C_ExecuteUbergraph_WBP_ButtonsPanel");
static_assert(sizeof(WBP_ButtonsPanel_C_ExecuteUbergraph_WBP_ButtonsPanel) == 0x000088, "Wrong size on WBP_ButtonsPanel_C_ExecuteUbergraph_WBP_ButtonsPanel");
static_assert(offsetof(WBP_ButtonsPanel_C_ExecuteUbergraph_WBP_ButtonsPanel, EntryPoint) == 0x000000, "Member 'WBP_ButtonsPanel_C_ExecuteUbergraph_WBP_ButtonsPanel::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_ButtonsPanel_C_ExecuteUbergraph_WBP_ButtonsPanel, CallFunc_GetContentSlotsCount_ReturnValue) == 0x000004, "Member 'WBP_ButtonsPanel_C_ExecuteUbergraph_WBP_ButtonsPanel::CallFunc_GetContentSlotsCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ButtonsPanel_C_ExecuteUbergraph_WBP_ButtonsPanel, K2Node_MakeStruct_Margin) == 0x000008, "Member 'WBP_ButtonsPanel_C_ExecuteUbergraph_WBP_ButtonsPanel::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(WBP_ButtonsPanel_C_ExecuteUbergraph_WBP_ButtonsPanel, CallFunc_Greater_IntInt_ReturnValue) == 0x000018, "Member 'WBP_ButtonsPanel_C_ExecuteUbergraph_WBP_ButtonsPanel::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ButtonsPanel_C_ExecuteUbergraph_WBP_ButtonsPanel, CallFunc_Subtract_IntInt_ReturnValue) == 0x00001C, "Member 'WBP_ButtonsPanel_C_ExecuteUbergraph_WBP_ButtonsPanel::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ButtonsPanel_C_ExecuteUbergraph_WBP_ButtonsPanel, K2Node_Event_InContentSlot) == 0x000020, "Member 'WBP_ButtonsPanel_C_ExecuteUbergraph_WBP_ButtonsPanel::K2Node_Event_InContentSlot' has a wrong offset!");
static_assert(offsetof(WBP_ButtonsPanel_C_ExecuteUbergraph_WBP_ButtonsPanel, K2Node_Event_InMode) == 0x000028, "Member 'WBP_ButtonsPanel_C_ExecuteUbergraph_WBP_ButtonsPanel::K2Node_Event_InMode' has a wrong offset!");
static_assert(offsetof(WBP_ButtonsPanel_C_ExecuteUbergraph_WBP_ButtonsPanel, CallFunc_GetSlotIndex_ReturnValue) == 0x00002C, "Member 'WBP_ButtonsPanel_C_ExecuteUbergraph_WBP_ButtonsPanel::CallFunc_GetSlotIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ButtonsPanel_C_ExecuteUbergraph_WBP_ButtonsPanel, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000030, "Member 'WBP_ButtonsPanel_C_ExecuteUbergraph_WBP_ButtonsPanel::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ButtonsPanel_C_ExecuteUbergraph_WBP_ButtonsPanel, K2Node_MakeStruct_Margin_1) == 0x000034, "Member 'WBP_ButtonsPanel_C_ExecuteUbergraph_WBP_ButtonsPanel::K2Node_MakeStruct_Margin_1' has a wrong offset!");
static_assert(offsetof(WBP_ButtonsPanel_C_ExecuteUbergraph_WBP_ButtonsPanel, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000044, "Member 'WBP_ButtonsPanel_C_ExecuteUbergraph_WBP_ButtonsPanel::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ButtonsPanel_C_ExecuteUbergraph_WBP_ButtonsPanel, K2Node_MakeStruct_Margin_2) == 0x000048, "Member 'WBP_ButtonsPanel_C_ExecuteUbergraph_WBP_ButtonsPanel::K2Node_MakeStruct_Margin_2' has a wrong offset!");
static_assert(offsetof(WBP_ButtonsPanel_C_ExecuteUbergraph_WBP_ButtonsPanel, K2Node_MakeStruct_SlateChildSize) == 0x000058, "Member 'WBP_ButtonsPanel_C_ExecuteUbergraph_WBP_ButtonsPanel::K2Node_MakeStruct_SlateChildSize' has a wrong offset!");
static_assert(offsetof(WBP_ButtonsPanel_C_ExecuteUbergraph_WBP_ButtonsPanel, CallFunc_GetChildAt_ReturnValue) == 0x000060, "Member 'WBP_ButtonsPanel_C_ExecuteUbergraph_WBP_ButtonsPanel::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ButtonsPanel_C_ExecuteUbergraph_WBP_ButtonsPanel, CallFunc_SlotAsHorizontalBoxSlot_ReturnValue) == 0x000068, "Member 'WBP_ButtonsPanel_C_ExecuteUbergraph_WBP_ButtonsPanel::CallFunc_SlotAsHorizontalBoxSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ButtonsPanel_C_ExecuteUbergraph_WBP_ButtonsPanel, CallFunc_IsValid_ReturnValue) == 0x000070, "Member 'WBP_ButtonsPanel_C_ExecuteUbergraph_WBP_ButtonsPanel::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ButtonsPanel_C_ExecuteUbergraph_WBP_ButtonsPanel, K2Node_MakeStruct_Left_ImplicitCast) == 0x000074, "Member 'WBP_ButtonsPanel_C_ExecuteUbergraph_WBP_ButtonsPanel::K2Node_MakeStruct_Left_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_ButtonsPanel_C_ExecuteUbergraph_WBP_ButtonsPanel, K2Node_MakeStruct_Right_ImplicitCast) == 0x000078, "Member 'WBP_ButtonsPanel_C_ExecuteUbergraph_WBP_ButtonsPanel::K2Node_MakeStruct_Right_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_ButtonsPanel_C_ExecuteUbergraph_WBP_ButtonsPanel, K2Node_MakeStruct_Left_ImplicitCast_1) == 0x00007C, "Member 'WBP_ButtonsPanel_C_ExecuteUbergraph_WBP_ButtonsPanel::K2Node_MakeStruct_Left_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(WBP_ButtonsPanel_C_ExecuteUbergraph_WBP_ButtonsPanel, K2Node_MakeStruct_Right_ImplicitCast_1) == 0x000080, "Member 'WBP_ButtonsPanel_C_ExecuteUbergraph_WBP_ButtonsPanel::K2Node_MakeStruct_Right_ImplicitCast_1' has a wrong offset!");

// Function WBP_ButtonsPanel.WBP_ButtonsPanel_C.GetSlotCustomTooltipDisplayParams
// 0x0170 (0x0170 - 0x0000)
struct WBP_ButtonsPanel_C_GetSlotCustomTooltipDisplayParams final
{
public:
	int32                                         InSlotIndex;                                       // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTedTooltipDisplayParams               OutParams;                                         // 0x0008(0x0070)(Parm, OutParm, ContainsInstancedReference)
	struct FTedTooltipDisplayParams               Params_0;                                          // 0x0078(0x0070)(Edit, BlueprintVisible, ContainsInstancedReference)
	class UTedContentPanelSlotBase*               CallFunc_GetContentSlot_ReturnValue;               // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_MenuButtonBar_Slot_C*              K2Node_DynamicCast_AsWBP_Menu_Button_Bar_Slot;     // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTedTooltipDisplayParams               CallFunc_GetSlotCustomTooltipDisplayParams_OutParams; // 0x0100(0x0070)(ContainsInstancedReference)
};
static_assert(alignof(WBP_ButtonsPanel_C_GetSlotCustomTooltipDisplayParams) == 0x000008, "Wrong alignment on WBP_ButtonsPanel_C_GetSlotCustomTooltipDisplayParams");
static_assert(sizeof(WBP_ButtonsPanel_C_GetSlotCustomTooltipDisplayParams) == 0x000170, "Wrong size on WBP_ButtonsPanel_C_GetSlotCustomTooltipDisplayParams");
static_assert(offsetof(WBP_ButtonsPanel_C_GetSlotCustomTooltipDisplayParams, InSlotIndex) == 0x000000, "Member 'WBP_ButtonsPanel_C_GetSlotCustomTooltipDisplayParams::InSlotIndex' has a wrong offset!");
static_assert(offsetof(WBP_ButtonsPanel_C_GetSlotCustomTooltipDisplayParams, OutParams) == 0x000008, "Member 'WBP_ButtonsPanel_C_GetSlotCustomTooltipDisplayParams::OutParams' has a wrong offset!");
static_assert(offsetof(WBP_ButtonsPanel_C_GetSlotCustomTooltipDisplayParams, Params_0) == 0x000078, "Member 'WBP_ButtonsPanel_C_GetSlotCustomTooltipDisplayParams::Params_0' has a wrong offset!");
static_assert(offsetof(WBP_ButtonsPanel_C_GetSlotCustomTooltipDisplayParams, CallFunc_GetContentSlot_ReturnValue) == 0x0000E8, "Member 'WBP_ButtonsPanel_C_GetSlotCustomTooltipDisplayParams::CallFunc_GetContentSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ButtonsPanel_C_GetSlotCustomTooltipDisplayParams, K2Node_DynamicCast_AsWBP_Menu_Button_Bar_Slot) == 0x0000F0, "Member 'WBP_ButtonsPanel_C_GetSlotCustomTooltipDisplayParams::K2Node_DynamicCast_AsWBP_Menu_Button_Bar_Slot' has a wrong offset!");
static_assert(offsetof(WBP_ButtonsPanel_C_GetSlotCustomTooltipDisplayParams, K2Node_DynamicCast_bSuccess) == 0x0000F8, "Member 'WBP_ButtonsPanel_C_GetSlotCustomTooltipDisplayParams::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_ButtonsPanel_C_GetSlotCustomTooltipDisplayParams, CallFunc_GetSlotCustomTooltipDisplayParams_OutParams) == 0x000100, "Member 'WBP_ButtonsPanel_C_GetSlotCustomTooltipDisplayParams::CallFunc_GetSlotCustomTooltipDisplayParams_OutParams' has a wrong offset!");

}

