#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Button_GlowingText_Minimal

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Tempest_classes.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Button_GlowingText_Minimal.WBP_Button_GlowingText_Minimal_C
// 0x00B8 (0x04D8 - 0x0420)
class UWBP_Button_GlowingText_Minimal_C final : public UTedGlowingButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0420(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_Frame;                                       // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FSlateColor                            TextColor_Default;                                 // 0x0430(0x0014)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateColor                            TextColor_Selected;                                // 0x0444(0x0014)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateColor                            TextColor_Hovered;                                 // 0x0458(0x0014)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateColor                            TextColor_Disabled;                                // 0x046C(0x0014)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMulticastInlineDelegate<void(class UTedUserWidget* InWidget)> OnPressed;                        // 0x0480(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(class UTedUserWidget* InWidget)> OnReleased;                       // 0x0490(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(class UTedUserWidget* InWidget)> OnClicked;                        // 0x04A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(class UTedUserWidget* InWidget)> OnHover;                          // 0x04B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(class UTedUserWidget* InWidget)> OnUnhover;                        // 0x04C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          bEnabled;                                          // 0x04D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void SetGlowingTextColor(const struct FSlateColor& Color);
	void PreConstruct(bool IsDesignTime);
	void ExecuteUbergraph_WBP_Button_GlowingText_Minimal(int32 EntryPoint);
	void BndEvt__WBP_Button_GlowingText_Minimal_Value_Button_K2Node_ComponentBoundEvent_9_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__WBP_Button_GlowingText_Minimal_Value_Button_K2Node_ComponentBoundEvent_8_OnButtonReleasedEvent__DelegateSignature();
	void BndEvt__WBP_Button_GlowingText_Minimal_Value_Button_K2Node_ComponentBoundEvent_7_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_Button_GlowingText_Minimal_Value_Button_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_Button_GlowingText_Minimal_Value_Button_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Button_GlowingText_Minimal_C">();
	}
	static class UWBP_Button_GlowingText_Minimal_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Button_GlowingText_Minimal_C>();
	}
};
static_assert(alignof(UWBP_Button_GlowingText_Minimal_C) == 0x000008, "Wrong alignment on UWBP_Button_GlowingText_Minimal_C");
static_assert(sizeof(UWBP_Button_GlowingText_Minimal_C) == 0x0004D8, "Wrong size on UWBP_Button_GlowingText_Minimal_C");
static_assert(offsetof(UWBP_Button_GlowingText_Minimal_C, UberGraphFrame) == 0x000420, "Member 'UWBP_Button_GlowingText_Minimal_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Button_GlowingText_Minimal_C, Image_Frame) == 0x000428, "Member 'UWBP_Button_GlowingText_Minimal_C::Image_Frame' has a wrong offset!");
static_assert(offsetof(UWBP_Button_GlowingText_Minimal_C, TextColor_Default) == 0x000430, "Member 'UWBP_Button_GlowingText_Minimal_C::TextColor_Default' has a wrong offset!");
static_assert(offsetof(UWBP_Button_GlowingText_Minimal_C, TextColor_Selected) == 0x000444, "Member 'UWBP_Button_GlowingText_Minimal_C::TextColor_Selected' has a wrong offset!");
static_assert(offsetof(UWBP_Button_GlowingText_Minimal_C, TextColor_Hovered) == 0x000458, "Member 'UWBP_Button_GlowingText_Minimal_C::TextColor_Hovered' has a wrong offset!");
static_assert(offsetof(UWBP_Button_GlowingText_Minimal_C, TextColor_Disabled) == 0x00046C, "Member 'UWBP_Button_GlowingText_Minimal_C::TextColor_Disabled' has a wrong offset!");
static_assert(offsetof(UWBP_Button_GlowingText_Minimal_C, OnPressed) == 0x000480, "Member 'UWBP_Button_GlowingText_Minimal_C::OnPressed' has a wrong offset!");
static_assert(offsetof(UWBP_Button_GlowingText_Minimal_C, OnReleased) == 0x000490, "Member 'UWBP_Button_GlowingText_Minimal_C::OnReleased' has a wrong offset!");
static_assert(offsetof(UWBP_Button_GlowingText_Minimal_C, OnClicked) == 0x0004A0, "Member 'UWBP_Button_GlowingText_Minimal_C::OnClicked' has a wrong offset!");
static_assert(offsetof(UWBP_Button_GlowingText_Minimal_C, OnHover) == 0x0004B0, "Member 'UWBP_Button_GlowingText_Minimal_C::OnHover' has a wrong offset!");
static_assert(offsetof(UWBP_Button_GlowingText_Minimal_C, OnUnhover) == 0x0004C0, "Member 'UWBP_Button_GlowingText_Minimal_C::OnUnhover' has a wrong offset!");
static_assert(offsetof(UWBP_Button_GlowingText_Minimal_C, bEnabled) == 0x0004D0, "Member 'UWBP_Button_GlowingText_Minimal_C::bEnabled' has a wrong offset!");

}

