#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SpecialistsCard_Slot

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Tempest_structs.hpp"
#include "Tempest_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_SpecialistsCard_Slot.WBP_SpecialistsCard_Slot_C
// 0x0018 (0x0498 - 0x0480)
class UWBP_SpecialistsCard_Slot_C final : public UTedWorkerSlot
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0480(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_BG;                                          // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_HealthBar;                                   // 0x0490(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_SpecialistsCard_Slot(int32 EntryPoint);
	void OnTriggerAction(ETedContentSlotAction InAction);
	void OnWorkerHealthChanged(const float OldValue, const float NewValue);

	void GetMaterialsSupportingStates(TArray<class UMaterialInstanceDynamic*>* OutMIDs) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_SpecialistsCard_Slot_C">();
	}
	static class UWBP_SpecialistsCard_Slot_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_SpecialistsCard_Slot_C>();
	}
};
static_assert(alignof(UWBP_SpecialistsCard_Slot_C) == 0x000008, "Wrong alignment on UWBP_SpecialistsCard_Slot_C");
static_assert(sizeof(UWBP_SpecialistsCard_Slot_C) == 0x000498, "Wrong size on UWBP_SpecialistsCard_Slot_C");
static_assert(offsetof(UWBP_SpecialistsCard_Slot_C, UberGraphFrame) == 0x000480, "Member 'UWBP_SpecialistsCard_Slot_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_SpecialistsCard_Slot_C, Image_BG) == 0x000488, "Member 'UWBP_SpecialistsCard_Slot_C::Image_BG' has a wrong offset!");
static_assert(offsetof(UWBP_SpecialistsCard_Slot_C, Image_HealthBar) == 0x000490, "Member 'UWBP_SpecialistsCard_Slot_C::Image_HealthBar' has a wrong offset!");

}

