#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ScoreScreen_Resources

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Tempest_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ScoreScreen_Resources.WBP_ScoreScreen_Resources_C
// 0x0020 (0x0520 - 0x0500)
class UWBP_ScoreScreen_Resources_C final : public UTedScoreScreenStatsTableTab
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0500(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USpacer*                                HeadersScrollbarPadding;                           // 0x0508(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTedScrollBox*                          TedScrollBox_1;                                    // 0x0510(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidget*                                NewVar;                                            // 0x0518(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_ScoreScreen_Resources(int32 EntryPoint);
	void OnScrollBarVisibilityChanged(ESlateVisibility NewVisibility);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ScoreScreen_Resources_C">();
	}
	static class UWBP_ScoreScreen_Resources_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ScoreScreen_Resources_C>();
	}
};
static_assert(alignof(UWBP_ScoreScreen_Resources_C) == 0x000008, "Wrong alignment on UWBP_ScoreScreen_Resources_C");
static_assert(sizeof(UWBP_ScoreScreen_Resources_C) == 0x000520, "Wrong size on UWBP_ScoreScreen_Resources_C");
static_assert(offsetof(UWBP_ScoreScreen_Resources_C, UberGraphFrame) == 0x000500, "Member 'UWBP_ScoreScreen_Resources_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ScoreScreen_Resources_C, HeadersScrollbarPadding) == 0x000508, "Member 'UWBP_ScoreScreen_Resources_C::HeadersScrollbarPadding' has a wrong offset!");
static_assert(offsetof(UWBP_ScoreScreen_Resources_C, TedScrollBox_1) == 0x000510, "Member 'UWBP_ScoreScreen_Resources_C::TedScrollBox_1' has a wrong offset!");
static_assert(offsetof(UWBP_ScoreScreen_Resources_C, NewVar) == 0x000518, "Member 'UWBP_ScoreScreen_Resources_C::NewVar' has a wrong offset!");

}

