#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ScoreScreen_Achievements_Panel

#include "Basic.hpp"

#include "Tempest_structs.hpp"


namespace SDK::Params
{

// Function WBP_ScoreScreen_Achievements_Panel.WBP_ScoreScreen_Achievements_Panel_C.ExecuteUbergraph_WBP_ScoreScreen_Achievements_Panel
// 0x0060 (0x0060 - 0x0000)
struct WBP_ScoreScreen_Achievements_Panel_C_ExecuteUbergraph_WBP_ScoreScreen_Achievements_Panel final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTedContentPanelSlotBase*               K2Node_Event_InContentSlot;                        // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ETedContentPanelRegistration                  K2Node_Event_InMode;                               // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHorizontalBoxSlot*                     CallFunc_SlotAsHorizontalBoxSlot_ReturnValue;      // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UTedContentPanelSlotBase*>       CallFunc_GetContentSlots_OutSlots;                 // 0x0028(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_GetContentSlots_ReturnValue;              // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTedContentPanelSlotBase*               CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_ScoreScreen_Achievements_Slot_C*   K2Node_DynamicCast_AsWBP_Score_Screen_Achievements_Slot; // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ScoreScreen_Achievements_Panel_C_ExecuteUbergraph_WBP_ScoreScreen_Achievements_Panel) == 0x000008, "Wrong alignment on WBP_ScoreScreen_Achievements_Panel_C_ExecuteUbergraph_WBP_ScoreScreen_Achievements_Panel");
static_assert(sizeof(WBP_ScoreScreen_Achievements_Panel_C_ExecuteUbergraph_WBP_ScoreScreen_Achievements_Panel) == 0x000060, "Wrong size on WBP_ScoreScreen_Achievements_Panel_C_ExecuteUbergraph_WBP_ScoreScreen_Achievements_Panel");
static_assert(offsetof(WBP_ScoreScreen_Achievements_Panel_C_ExecuteUbergraph_WBP_ScoreScreen_Achievements_Panel, EntryPoint) == 0x000000, "Member 'WBP_ScoreScreen_Achievements_Panel_C_ExecuteUbergraph_WBP_ScoreScreen_Achievements_Panel::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_ScoreScreen_Achievements_Panel_C_ExecuteUbergraph_WBP_ScoreScreen_Achievements_Panel, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'WBP_ScoreScreen_Achievements_Panel_C_ExecuteUbergraph_WBP_ScoreScreen_Achievements_Panel::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ScoreScreen_Achievements_Panel_C_ExecuteUbergraph_WBP_ScoreScreen_Achievements_Panel, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'WBP_ScoreScreen_Achievements_Panel_C_ExecuteUbergraph_WBP_ScoreScreen_Achievements_Panel::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ScoreScreen_Achievements_Panel_C_ExecuteUbergraph_WBP_ScoreScreen_Achievements_Panel, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'WBP_ScoreScreen_Achievements_Panel_C_ExecuteUbergraph_WBP_ScoreScreen_Achievements_Panel::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ScoreScreen_Achievements_Panel_C_ExecuteUbergraph_WBP_ScoreScreen_Achievements_Panel, K2Node_Event_InContentSlot) == 0x000010, "Member 'WBP_ScoreScreen_Achievements_Panel_C_ExecuteUbergraph_WBP_ScoreScreen_Achievements_Panel::K2Node_Event_InContentSlot' has a wrong offset!");
static_assert(offsetof(WBP_ScoreScreen_Achievements_Panel_C_ExecuteUbergraph_WBP_ScoreScreen_Achievements_Panel, K2Node_Event_InMode) == 0x000018, "Member 'WBP_ScoreScreen_Achievements_Panel_C_ExecuteUbergraph_WBP_ScoreScreen_Achievements_Panel::K2Node_Event_InMode' has a wrong offset!");
static_assert(offsetof(WBP_ScoreScreen_Achievements_Panel_C_ExecuteUbergraph_WBP_ScoreScreen_Achievements_Panel, CallFunc_SlotAsHorizontalBoxSlot_ReturnValue) == 0x000020, "Member 'WBP_ScoreScreen_Achievements_Panel_C_ExecuteUbergraph_WBP_ScoreScreen_Achievements_Panel::CallFunc_SlotAsHorizontalBoxSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ScoreScreen_Achievements_Panel_C_ExecuteUbergraph_WBP_ScoreScreen_Achievements_Panel, CallFunc_GetContentSlots_OutSlots) == 0x000028, "Member 'WBP_ScoreScreen_Achievements_Panel_C_ExecuteUbergraph_WBP_ScoreScreen_Achievements_Panel::CallFunc_GetContentSlots_OutSlots' has a wrong offset!");
static_assert(offsetof(WBP_ScoreScreen_Achievements_Panel_C_ExecuteUbergraph_WBP_ScoreScreen_Achievements_Panel, CallFunc_GetContentSlots_ReturnValue) == 0x000038, "Member 'WBP_ScoreScreen_Achievements_Panel_C_ExecuteUbergraph_WBP_ScoreScreen_Achievements_Panel::CallFunc_GetContentSlots_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ScoreScreen_Achievements_Panel_C_ExecuteUbergraph_WBP_ScoreScreen_Achievements_Panel, CallFunc_Array_Length_ReturnValue) == 0x00003C, "Member 'WBP_ScoreScreen_Achievements_Panel_C_ExecuteUbergraph_WBP_ScoreScreen_Achievements_Panel::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ScoreScreen_Achievements_Panel_C_ExecuteUbergraph_WBP_ScoreScreen_Achievements_Panel, CallFunc_Array_Get_Item) == 0x000040, "Member 'WBP_ScoreScreen_Achievements_Panel_C_ExecuteUbergraph_WBP_ScoreScreen_Achievements_Panel::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_ScoreScreen_Achievements_Panel_C_ExecuteUbergraph_WBP_ScoreScreen_Achievements_Panel, CallFunc_Less_IntInt_ReturnValue) == 0x000048, "Member 'WBP_ScoreScreen_Achievements_Panel_C_ExecuteUbergraph_WBP_ScoreScreen_Achievements_Panel::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ScoreScreen_Achievements_Panel_C_ExecuteUbergraph_WBP_ScoreScreen_Achievements_Panel, CallFunc_IsValid_ReturnValue) == 0x000049, "Member 'WBP_ScoreScreen_Achievements_Panel_C_ExecuteUbergraph_WBP_ScoreScreen_Achievements_Panel::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ScoreScreen_Achievements_Panel_C_ExecuteUbergraph_WBP_ScoreScreen_Achievements_Panel, K2Node_DynamicCast_AsWBP_Score_Screen_Achievements_Slot) == 0x000050, "Member 'WBP_ScoreScreen_Achievements_Panel_C_ExecuteUbergraph_WBP_ScoreScreen_Achievements_Panel::K2Node_DynamicCast_AsWBP_Score_Screen_Achievements_Slot' has a wrong offset!");
static_assert(offsetof(WBP_ScoreScreen_Achievements_Panel_C_ExecuteUbergraph_WBP_ScoreScreen_Achievements_Panel, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'WBP_ScoreScreen_Achievements_Panel_C_ExecuteUbergraph_WBP_ScoreScreen_Achievements_Panel::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_ScoreScreen_Achievements_Panel_C_ExecuteUbergraph_WBP_ScoreScreen_Achievements_Panel, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000059, "Member 'WBP_ScoreScreen_Achievements_Panel_C_ExecuteUbergraph_WBP_ScoreScreen_Achievements_Panel::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");

// Function WBP_ScoreScreen_Achievements_Panel.WBP_ScoreScreen_Achievements_Panel_C.OnCacheContent
// 0x0004 (0x0004 - 0x0000)
struct WBP_ScoreScreen_Achievements_Panel_C_OnCacheContent final
{
public:
	int32                                         OutExpectedSlotsCount;                             // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ScoreScreen_Achievements_Panel_C_OnCacheContent) == 0x000004, "Wrong alignment on WBP_ScoreScreen_Achievements_Panel_C_OnCacheContent");
static_assert(sizeof(WBP_ScoreScreen_Achievements_Panel_C_OnCacheContent) == 0x000004, "Wrong size on WBP_ScoreScreen_Achievements_Panel_C_OnCacheContent");
static_assert(offsetof(WBP_ScoreScreen_Achievements_Panel_C_OnCacheContent, OutExpectedSlotsCount) == 0x000000, "Member 'WBP_ScoreScreen_Achievements_Panel_C_OnCacheContent::OutExpectedSlotsCount' has a wrong offset!");

// Function WBP_ScoreScreen_Achievements_Panel.WBP_ScoreScreen_Achievements_Panel_C.OnRegisterContentSlot
// 0x0010 (0x0010 - 0x0000)
struct WBP_ScoreScreen_Achievements_Panel_C_OnRegisterContentSlot final
{
public:
	class UTedContentPanelSlotBase*               InContentSlot;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ETedContentPanelRegistration                  InMode;                                            // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ScoreScreen_Achievements_Panel_C_OnRegisterContentSlot) == 0x000008, "Wrong alignment on WBP_ScoreScreen_Achievements_Panel_C_OnRegisterContentSlot");
static_assert(sizeof(WBP_ScoreScreen_Achievements_Panel_C_OnRegisterContentSlot) == 0x000010, "Wrong size on WBP_ScoreScreen_Achievements_Panel_C_OnRegisterContentSlot");
static_assert(offsetof(WBP_ScoreScreen_Achievements_Panel_C_OnRegisterContentSlot, InContentSlot) == 0x000000, "Member 'WBP_ScoreScreen_Achievements_Panel_C_OnRegisterContentSlot::InContentSlot' has a wrong offset!");
static_assert(offsetof(WBP_ScoreScreen_Achievements_Panel_C_OnRegisterContentSlot, InMode) == 0x000008, "Member 'WBP_ScoreScreen_Achievements_Panel_C_OnRegisterContentSlot::InMode' has a wrong offset!");

}

