#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_HUD_ObjectivesWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Tempest_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_HUD_ObjectivesWidget.WBP_HUD_ObjectivesWidget_C
// 0x0028 (0x0428 - 0x0400)
class UWBP_HUD_ObjectivesWidget_C final : public UTedUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0400(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_HUD_ObjectivePanel_C*              Objectives_Main;                                   // 0x0408(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_HUD_ObjectivePanel_C*              Objectives_Side;                                   // 0x0410(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Header_Main;                             // 0x0418(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Header_Side;                             // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BndEvt__Objectives_Main_K2Node_ComponentBoundEvent_0_OnVisibilityChangedEvent__DelegateSignature(ESlateVisibility InVisibility);
	void BndEvt__Objectives_Side_K2Node_ComponentBoundEvent_1_OnVisibilityChangedEvent__DelegateSignature(ESlateVisibility InVisibility);
	void Construct();
	void ExecuteUbergraph_WBP_HUD_ObjectivesWidget(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_HUD_ObjectivesWidget_C">();
	}
	static class UWBP_HUD_ObjectivesWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_HUD_ObjectivesWidget_C>();
	}
};
static_assert(alignof(UWBP_HUD_ObjectivesWidget_C) == 0x000008, "Wrong alignment on UWBP_HUD_ObjectivesWidget_C");
static_assert(sizeof(UWBP_HUD_ObjectivesWidget_C) == 0x000428, "Wrong size on UWBP_HUD_ObjectivesWidget_C");
static_assert(offsetof(UWBP_HUD_ObjectivesWidget_C, UberGraphFrame) == 0x000400, "Member 'UWBP_HUD_ObjectivesWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_ObjectivesWidget_C, Objectives_Main) == 0x000408, "Member 'UWBP_HUD_ObjectivesWidget_C::Objectives_Main' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_ObjectivesWidget_C, Objectives_Side) == 0x000410, "Member 'UWBP_HUD_ObjectivesWidget_C::Objectives_Side' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_ObjectivesWidget_C, TextBlock_Header_Main) == 0x000418, "Member 'UWBP_HUD_ObjectivesWidget_C::TextBlock_Header_Main' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_ObjectivesWidget_C, TextBlock_Header_Side) == 0x000420, "Member 'UWBP_HUD_ObjectivesWidget_C::TextBlock_Header_Side' has a wrong offset!");

}

