#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_HUD_BuildingGrid_Factories_Panel

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Tempest_structs.hpp"
#include "Tempest_classes.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_HUD_BuildingGrid_Factories_Panel.WBP_HUD_BuildingGrid_Factories_Panel_C
// 0x0030 (0x0810 - 0x07E0)
class UWBP_HUD_BuildingGrid_Factories_Panel_C final : public UTedStructuresPanel
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x07E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_HUD_BuildingGrid_NavigationButton_C* Button_Next;                                     // 0x07E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_HUD_BuildingGrid_NavigationButton_C* Button_Previous;                                 // 0x07F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FMargin                                SlotPadding;                                       // 0x07F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Page;                                              // 0x0808(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_HUD_BuildingGrid_Factories_Panel_Button_Next_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature(bool bInForward);
	void BndEvt__WBP_HUD_BuildingGrid_Factories_Panel_Button_Previous_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature(bool bInForward);
	void ExecuteUbergraph_WBP_HUD_BuildingGrid_Factories_Panel(int32 EntryPoint);
	void OnRegisterContentSlot(class UTedContentPanelSlotBase* InContentSlot, ETedContentPanelRegistration InMode);
	void RefreshUI();
	void UpdateScrollButtons();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_HUD_BuildingGrid_Factories_Panel_C">();
	}
	static class UWBP_HUD_BuildingGrid_Factories_Panel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_HUD_BuildingGrid_Factories_Panel_C>();
	}
};
static_assert(alignof(UWBP_HUD_BuildingGrid_Factories_Panel_C) == 0x000008, "Wrong alignment on UWBP_HUD_BuildingGrid_Factories_Panel_C");
static_assert(sizeof(UWBP_HUD_BuildingGrid_Factories_Panel_C) == 0x000810, "Wrong size on UWBP_HUD_BuildingGrid_Factories_Panel_C");
static_assert(offsetof(UWBP_HUD_BuildingGrid_Factories_Panel_C, UberGraphFrame) == 0x0007E0, "Member 'UWBP_HUD_BuildingGrid_Factories_Panel_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_BuildingGrid_Factories_Panel_C, Button_Next) == 0x0007E8, "Member 'UWBP_HUD_BuildingGrid_Factories_Panel_C::Button_Next' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_BuildingGrid_Factories_Panel_C, Button_Previous) == 0x0007F0, "Member 'UWBP_HUD_BuildingGrid_Factories_Panel_C::Button_Previous' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_BuildingGrid_Factories_Panel_C, SlotPadding) == 0x0007F8, "Member 'UWBP_HUD_BuildingGrid_Factories_Panel_C::SlotPadding' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_BuildingGrid_Factories_Panel_C, Page) == 0x000808, "Member 'UWBP_HUD_BuildingGrid_Factories_Panel_C::Page' has a wrong offset!");

}

