#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_HUD_SelectionDetails_SelectedPawnDetails

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Tempest_classes.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_HUD_SelectionDetails_SelectedPawnDetails.WBP_HUD_SelectionDetails_SelectedPawnDetails_C
// 0x00A8 (0x04A8 - 0x0400)
class UWBP_HUD_SelectionDetails_SelectedPawnDetails_C final : public UTedUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0400(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_HealthBar;                                   // 0x0408(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Icon;                                        // 0x0410(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SelectionDetails_InfoSlots_C*      InfoSlots;                                         // 0x0418(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SelectionDetails_SpecialUnitIndicator_C* Specialist_Indicator;                        // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SelectionDetails_StatusEffects_List_Panel_C* StatusEffects;                           // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Health_Current;                          // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Health_Max;                              // 0x0438(0x0008)(ExportObject, ZeroConstructor, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Name;                                    // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Tooltip_Trigger;                                   // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UnitVeterancy_Progress_C*          Veterancy_Progress;                                // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UnitVeterancy_Icon_C*              Veterancy_Rank;                                    // 0x0458(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ATedPawn*                               DisplayedPawn;                                     // 0x0460(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            HealthColorGreen;                                  // 0x0468(0x0014)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateColor                            HealthColorYellow;                                 // 0x047C(0x0014)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateColor                            HealthColorRed;                                    // 0x0490(0x0014)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void BndEvt__WBP_HUD_SelectionDetails_SelectedPawnDetails_Tooltip_Trigger_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_HUD_SelectionDetails_SelectedPawnDetails_Tooltip_Trigger_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void ExecuteUbergraph_WBP_HUD_SelectionDetails_SelectedPawnDetails(int32 EntryPoint);
	class FText Get_Current_Health_Text();
	struct FSlateColor Get_Current_Health_Text_Color();
	class FText Get_Max_Health_Text();
	double GetHealthPercent();
	void MakeAndShowTooltip();
	void RefreshIcon();
	void RefreshUI();
	void SetDisplayedPawn(class ATedPawn* InPawn);
	void UpdateHealthBar();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_HUD_SelectionDetails_SelectedPawnDetails_C">();
	}
	static class UWBP_HUD_SelectionDetails_SelectedPawnDetails_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_HUD_SelectionDetails_SelectedPawnDetails_C>();
	}
};
static_assert(alignof(UWBP_HUD_SelectionDetails_SelectedPawnDetails_C) == 0x000008, "Wrong alignment on UWBP_HUD_SelectionDetails_SelectedPawnDetails_C");
static_assert(sizeof(UWBP_HUD_SelectionDetails_SelectedPawnDetails_C) == 0x0004A8, "Wrong size on UWBP_HUD_SelectionDetails_SelectedPawnDetails_C");
static_assert(offsetof(UWBP_HUD_SelectionDetails_SelectedPawnDetails_C, UberGraphFrame) == 0x000400, "Member 'UWBP_HUD_SelectionDetails_SelectedPawnDetails_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_SelectionDetails_SelectedPawnDetails_C, Image_HealthBar) == 0x000408, "Member 'UWBP_HUD_SelectionDetails_SelectedPawnDetails_C::Image_HealthBar' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_SelectionDetails_SelectedPawnDetails_C, Image_Icon) == 0x000410, "Member 'UWBP_HUD_SelectionDetails_SelectedPawnDetails_C::Image_Icon' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_SelectionDetails_SelectedPawnDetails_C, InfoSlots) == 0x000418, "Member 'UWBP_HUD_SelectionDetails_SelectedPawnDetails_C::InfoSlots' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_SelectionDetails_SelectedPawnDetails_C, Specialist_Indicator) == 0x000420, "Member 'UWBP_HUD_SelectionDetails_SelectedPawnDetails_C::Specialist_Indicator' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_SelectionDetails_SelectedPawnDetails_C, StatusEffects) == 0x000428, "Member 'UWBP_HUD_SelectionDetails_SelectedPawnDetails_C::StatusEffects' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_SelectionDetails_SelectedPawnDetails_C, TextBlock_Health_Current) == 0x000430, "Member 'UWBP_HUD_SelectionDetails_SelectedPawnDetails_C::TextBlock_Health_Current' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_SelectionDetails_SelectedPawnDetails_C, TextBlock_Health_Max) == 0x000438, "Member 'UWBP_HUD_SelectionDetails_SelectedPawnDetails_C::TextBlock_Health_Max' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_SelectionDetails_SelectedPawnDetails_C, TextBlock_Name) == 0x000440, "Member 'UWBP_HUD_SelectionDetails_SelectedPawnDetails_C::TextBlock_Name' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_SelectionDetails_SelectedPawnDetails_C, Tooltip_Trigger) == 0x000448, "Member 'UWBP_HUD_SelectionDetails_SelectedPawnDetails_C::Tooltip_Trigger' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_SelectionDetails_SelectedPawnDetails_C, Veterancy_Progress) == 0x000450, "Member 'UWBP_HUD_SelectionDetails_SelectedPawnDetails_C::Veterancy_Progress' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_SelectionDetails_SelectedPawnDetails_C, Veterancy_Rank) == 0x000458, "Member 'UWBP_HUD_SelectionDetails_SelectedPawnDetails_C::Veterancy_Rank' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_SelectionDetails_SelectedPawnDetails_C, DisplayedPawn) == 0x000460, "Member 'UWBP_HUD_SelectionDetails_SelectedPawnDetails_C::DisplayedPawn' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_SelectionDetails_SelectedPawnDetails_C, HealthColorGreen) == 0x000468, "Member 'UWBP_HUD_SelectionDetails_SelectedPawnDetails_C::HealthColorGreen' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_SelectionDetails_SelectedPawnDetails_C, HealthColorYellow) == 0x00047C, "Member 'UWBP_HUD_SelectionDetails_SelectedPawnDetails_C::HealthColorYellow' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_SelectionDetails_SelectedPawnDetails_C, HealthColorRed) == 0x000490, "Member 'UWBP_HUD_SelectionDetails_SelectedPawnDetails_C::HealthColorRed' has a wrong offset!");

}

