#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_HarvestersCard

#include "Basic.hpp"

#include "Tempest_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_HarvestersCard.WBP_HarvestersCard_C.BndEvt__WBP_WorkersWidget_WorkersPanel_K2Node_ComponentBoundEvent_0_ContentPanelStateDelegateSignature__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct WBP_HarvestersCard_C_BndEvt__WBP_WorkersWidget_WorkersPanel_K2Node_ComponentBoundEvent_0_ContentPanelStateDelegateSignature__DelegateSignature final
{
public:
	class UTedContentPanelBase*                   InContentPanel;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UTedContentPanelSlotBase*               InContentSlot;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ETedContentSlotState                          InState;                                           // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bInActivated;                                      // 0x0011(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HarvestersCard_C_BndEvt__WBP_WorkersWidget_WorkersPanel_K2Node_ComponentBoundEvent_0_ContentPanelStateDelegateSignature__DelegateSignature) == 0x000008, "Wrong alignment on WBP_HarvestersCard_C_BndEvt__WBP_WorkersWidget_WorkersPanel_K2Node_ComponentBoundEvent_0_ContentPanelStateDelegateSignature__DelegateSignature");
static_assert(sizeof(WBP_HarvestersCard_C_BndEvt__WBP_WorkersWidget_WorkersPanel_K2Node_ComponentBoundEvent_0_ContentPanelStateDelegateSignature__DelegateSignature) == 0x000018, "Wrong size on WBP_HarvestersCard_C_BndEvt__WBP_WorkersWidget_WorkersPanel_K2Node_ComponentBoundEvent_0_ContentPanelStateDelegateSignature__DelegateSignature");
static_assert(offsetof(WBP_HarvestersCard_C_BndEvt__WBP_WorkersWidget_WorkersPanel_K2Node_ComponentBoundEvent_0_ContentPanelStateDelegateSignature__DelegateSignature, InContentPanel) == 0x000000, "Member 'WBP_HarvestersCard_C_BndEvt__WBP_WorkersWidget_WorkersPanel_K2Node_ComponentBoundEvent_0_ContentPanelStateDelegateSignature__DelegateSignature::InContentPanel' has a wrong offset!");
static_assert(offsetof(WBP_HarvestersCard_C_BndEvt__WBP_WorkersWidget_WorkersPanel_K2Node_ComponentBoundEvent_0_ContentPanelStateDelegateSignature__DelegateSignature, InContentSlot) == 0x000008, "Member 'WBP_HarvestersCard_C_BndEvt__WBP_WorkersWidget_WorkersPanel_K2Node_ComponentBoundEvent_0_ContentPanelStateDelegateSignature__DelegateSignature::InContentSlot' has a wrong offset!");
static_assert(offsetof(WBP_HarvestersCard_C_BndEvt__WBP_WorkersWidget_WorkersPanel_K2Node_ComponentBoundEvent_0_ContentPanelStateDelegateSignature__DelegateSignature, InState) == 0x000010, "Member 'WBP_HarvestersCard_C_BndEvt__WBP_WorkersWidget_WorkersPanel_K2Node_ComponentBoundEvent_0_ContentPanelStateDelegateSignature__DelegateSignature::InState' has a wrong offset!");
static_assert(offsetof(WBP_HarvestersCard_C_BndEvt__WBP_WorkersWidget_WorkersPanel_K2Node_ComponentBoundEvent_0_ContentPanelStateDelegateSignature__DelegateSignature, bInActivated) == 0x000011, "Member 'WBP_HarvestersCard_C_BndEvt__WBP_WorkersWidget_WorkersPanel_K2Node_ComponentBoundEvent_0_ContentPanelStateDelegateSignature__DelegateSignature::bInActivated' has a wrong offset!");

// Function WBP_HarvestersCard.WBP_HarvestersCard_C.ExecuteUbergraph_WBP_HarvestersCard
// 0x0048 (0x0048 - 0x0000)
struct WBP_HarvestersCard_C_ExecuteUbergraph_WBP_HarvestersCard final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UTedContentPanelBase*                   K2Node_ComponentBoundEvent_InContentPanel;         // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UTedContentPanelSlotBase*               K2Node_ComponentBoundEvent_InContentSlot;          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ETedContentSlotState                          K2Node_ComponentBoundEvent_InState;                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bInActivated;           // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B[0x1];                                       // 0x001B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetContentSlotsCount_ReturnValue;         // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTedContentPanelSlotBase*               CallFunc_GetContentSlotByState_ReturnValue;        // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_HarvestersCard_Button_C*           K2Node_DynamicCast_AsWBP_Harvesters_Card_Button;   // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HarvestersCard_C_ExecuteUbergraph_WBP_HarvestersCard) == 0x000008, "Wrong alignment on WBP_HarvestersCard_C_ExecuteUbergraph_WBP_HarvestersCard");
static_assert(sizeof(WBP_HarvestersCard_C_ExecuteUbergraph_WBP_HarvestersCard) == 0x000048, "Wrong size on WBP_HarvestersCard_C_ExecuteUbergraph_WBP_HarvestersCard");
static_assert(offsetof(WBP_HarvestersCard_C_ExecuteUbergraph_WBP_HarvestersCard, EntryPoint) == 0x000000, "Member 'WBP_HarvestersCard_C_ExecuteUbergraph_WBP_HarvestersCard::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_HarvestersCard_C_ExecuteUbergraph_WBP_HarvestersCard, Temp_bool_Variable) == 0x000004, "Member 'WBP_HarvestersCard_C_ExecuteUbergraph_WBP_HarvestersCard::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_HarvestersCard_C_ExecuteUbergraph_WBP_HarvestersCard, Temp_byte_Variable) == 0x000005, "Member 'WBP_HarvestersCard_C_ExecuteUbergraph_WBP_HarvestersCard::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_HarvestersCard_C_ExecuteUbergraph_WBP_HarvestersCard, K2Node_ComponentBoundEvent_InContentPanel) == 0x000008, "Member 'WBP_HarvestersCard_C_ExecuteUbergraph_WBP_HarvestersCard::K2Node_ComponentBoundEvent_InContentPanel' has a wrong offset!");
static_assert(offsetof(WBP_HarvestersCard_C_ExecuteUbergraph_WBP_HarvestersCard, K2Node_ComponentBoundEvent_InContentSlot) == 0x000010, "Member 'WBP_HarvestersCard_C_ExecuteUbergraph_WBP_HarvestersCard::K2Node_ComponentBoundEvent_InContentSlot' has a wrong offset!");
static_assert(offsetof(WBP_HarvestersCard_C_ExecuteUbergraph_WBP_HarvestersCard, K2Node_ComponentBoundEvent_InState) == 0x000018, "Member 'WBP_HarvestersCard_C_ExecuteUbergraph_WBP_HarvestersCard::K2Node_ComponentBoundEvent_InState' has a wrong offset!");
static_assert(offsetof(WBP_HarvestersCard_C_ExecuteUbergraph_WBP_HarvestersCard, K2Node_ComponentBoundEvent_bInActivated) == 0x000019, "Member 'WBP_HarvestersCard_C_ExecuteUbergraph_WBP_HarvestersCard::K2Node_ComponentBoundEvent_bInActivated' has a wrong offset!");
static_assert(offsetof(WBP_HarvestersCard_C_ExecuteUbergraph_WBP_HarvestersCard, Temp_byte_Variable_1) == 0x00001A, "Member 'WBP_HarvestersCard_C_ExecuteUbergraph_WBP_HarvestersCard::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_HarvestersCard_C_ExecuteUbergraph_WBP_HarvestersCard, CallFunc_GetContentSlotsCount_ReturnValue) == 0x00001C, "Member 'WBP_HarvestersCard_C_ExecuteUbergraph_WBP_HarvestersCard::CallFunc_GetContentSlotsCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HarvestersCard_C_ExecuteUbergraph_WBP_HarvestersCard, CallFunc_Greater_IntInt_ReturnValue) == 0x000020, "Member 'WBP_HarvestersCard_C_ExecuteUbergraph_WBP_HarvestersCard::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HarvestersCard_C_ExecuteUbergraph_WBP_HarvestersCard, CallFunc_GetContentSlotByState_ReturnValue) == 0x000028, "Member 'WBP_HarvestersCard_C_ExecuteUbergraph_WBP_HarvestersCard::CallFunc_GetContentSlotByState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HarvestersCard_C_ExecuteUbergraph_WBP_HarvestersCard, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'WBP_HarvestersCard_C_ExecuteUbergraph_WBP_HarvestersCard::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HarvestersCard_C_ExecuteUbergraph_WBP_HarvestersCard, K2Node_DynamicCast_AsWBP_Harvesters_Card_Button) == 0x000038, "Member 'WBP_HarvestersCard_C_ExecuteUbergraph_WBP_HarvestersCard::K2Node_DynamicCast_AsWBP_Harvesters_Card_Button' has a wrong offset!");
static_assert(offsetof(WBP_HarvestersCard_C_ExecuteUbergraph_WBP_HarvestersCard, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'WBP_HarvestersCard_C_ExecuteUbergraph_WBP_HarvestersCard::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_HarvestersCard_C_ExecuteUbergraph_WBP_HarvestersCard, CallFunc_BooleanAND_ReturnValue) == 0x000041, "Member 'WBP_HarvestersCard_C_ExecuteUbergraph_WBP_HarvestersCard::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HarvestersCard_C_ExecuteUbergraph_WBP_HarvestersCard, K2Node_Select_Default) == 0x000042, "Member 'WBP_HarvestersCard_C_ExecuteUbergraph_WBP_HarvestersCard::K2Node_Select_Default' has a wrong offset!");

}

