#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TedJukeboxMain

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Tempest_structs.hpp"
#include "Tempest_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_TedJukeboxMain.WBP_TedJukeboxMain_C
// 0x0050 (0x0518 - 0x04C8)
class UWBP_TedJukeboxMain_C final : public UTedJukeboxWidgetMain
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             AuthorText;                                        // 0x04D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             CurrentPlayTime;                                   // 0x04D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             NameText;                                          // 0x04E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USlider*                                Scrubber;                                          // 0x04E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           ScrubberBackgroundBar;                             // 0x04F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TotalTimeText;                                     // 0x04F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MainMenu_FactionSelection_Header_C* WBP_MainMenu_FactionSelection_Header;             // 0x0500(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GenericMenu_C*                     WBP_Misc_MenuScreenPage;                           // 0x0508(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bIsScrubbing;                                      // 0x0510(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CanUpdate;                                         // 0x0511(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UpdateSlotFocus(class UTedJukeboxTrackAsset* NewTrack);
	void UpdateFocus();
	void OnPlaybackPercentageChanged(float NewPercentage);
	void ExecuteUbergraph_WBP_TedJukeboxMain(int32 EntryPoint);
	void Construct();
	void BndEvt__WBP_TedJukeboxMain_WBP_Misc_MenuScreenPage_K2Node_ComponentBoundEvent_1_ContentPanelStateDelegateSignature__DelegateSignature(class UTedContentPanelBase* InContentPanel, class UTedContentPanelSlotBase* InContentSlot, ETedContentSlotState InState, bool bInActivated);
	void BndEvt__WBP_TedJukeboxMain_Slider_53_K2Node_ComponentBoundEvent_2_OnMouseCaptureEndEvent__DelegateSignature();
	void BndEvt__WBP_TedJukeboxMain_Slider_53_K2Node_ComponentBoundEvent_0_OnMouseCaptureBeginEvent__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_TedJukeboxMain_C">();
	}
	static class UWBP_TedJukeboxMain_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_TedJukeboxMain_C>();
	}
};
static_assert(alignof(UWBP_TedJukeboxMain_C) == 0x000008, "Wrong alignment on UWBP_TedJukeboxMain_C");
static_assert(sizeof(UWBP_TedJukeboxMain_C) == 0x000518, "Wrong size on UWBP_TedJukeboxMain_C");
static_assert(offsetof(UWBP_TedJukeboxMain_C, UberGraphFrame) == 0x0004C8, "Member 'UWBP_TedJukeboxMain_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_TedJukeboxMain_C, AuthorText) == 0x0004D0, "Member 'UWBP_TedJukeboxMain_C::AuthorText' has a wrong offset!");
static_assert(offsetof(UWBP_TedJukeboxMain_C, CurrentPlayTime) == 0x0004D8, "Member 'UWBP_TedJukeboxMain_C::CurrentPlayTime' has a wrong offset!");
static_assert(offsetof(UWBP_TedJukeboxMain_C, NameText) == 0x0004E0, "Member 'UWBP_TedJukeboxMain_C::NameText' has a wrong offset!");
static_assert(offsetof(UWBP_TedJukeboxMain_C, Scrubber) == 0x0004E8, "Member 'UWBP_TedJukeboxMain_C::Scrubber' has a wrong offset!");
static_assert(offsetof(UWBP_TedJukeboxMain_C, ScrubberBackgroundBar) == 0x0004F0, "Member 'UWBP_TedJukeboxMain_C::ScrubberBackgroundBar' has a wrong offset!");
static_assert(offsetof(UWBP_TedJukeboxMain_C, TotalTimeText) == 0x0004F8, "Member 'UWBP_TedJukeboxMain_C::TotalTimeText' has a wrong offset!");
static_assert(offsetof(UWBP_TedJukeboxMain_C, WBP_MainMenu_FactionSelection_Header) == 0x000500, "Member 'UWBP_TedJukeboxMain_C::WBP_MainMenu_FactionSelection_Header' has a wrong offset!");
static_assert(offsetof(UWBP_TedJukeboxMain_C, WBP_Misc_MenuScreenPage) == 0x000508, "Member 'UWBP_TedJukeboxMain_C::WBP_Misc_MenuScreenPage' has a wrong offset!");
static_assert(offsetof(UWBP_TedJukeboxMain_C, bIsScrubbing) == 0x000510, "Member 'UWBP_TedJukeboxMain_C::bIsScrubbing' has a wrong offset!");
static_assert(offsetof(UWBP_TedJukeboxMain_C, CanUpdate) == 0x000511, "Member 'UWBP_TedJukeboxMain_C::CanUpdate' has a wrong offset!");

}

