#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PauseMenu

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Tempest_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_PauseMenu.WBP_PauseMenu_C.ShowSettings
// 0x0005 (0x0005 - 0x0000)
struct WBP_PauseMenu_C_ShowSettings final
{
public:
	bool                                          bInShow;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PauseMenu_C_ShowSettings) == 0x000001, "Wrong alignment on WBP_PauseMenu_C_ShowSettings");
static_assert(sizeof(WBP_PauseMenu_C_ShowSettings) == 0x000005, "Wrong size on WBP_PauseMenu_C_ShowSettings");
static_assert(offsetof(WBP_PauseMenu_C_ShowSettings, bInShow) == 0x000000, "Member 'WBP_PauseMenu_C_ShowSettings::bInShow' has a wrong offset!");
static_assert(offsetof(WBP_PauseMenu_C_ShowSettings, Temp_byte_Variable) == 0x000001, "Member 'WBP_PauseMenu_C_ShowSettings::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PauseMenu_C_ShowSettings, Temp_byte_Variable_1) == 0x000002, "Member 'WBP_PauseMenu_C_ShowSettings::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_PauseMenu_C_ShowSettings, Temp_bool_Variable) == 0x000003, "Member 'WBP_PauseMenu_C_ShowSettings::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PauseMenu_C_ShowSettings, K2Node_Select_Default) == 0x000004, "Member 'WBP_PauseMenu_C_ShowSettings::K2Node_Select_Default' has a wrong offset!");

// Function WBP_PauseMenu.WBP_PauseMenu_C.Refresh Buttons State
// 0x0060 (0x0060 - 0x0000)
struct WBP_PauseMenu_C_Refresh_Buttons_State final
{
public:
	bool                                          CallFunc_IsStandalone_ReturnValue;                 // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_SelectText_ReturnValue;                   // 0x0010(0x0010)()
	class ATedPlayerState*                        K2Node_DynamicCast_AsTed_Player_State;             // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDefeated_ReturnValue;                   // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSurrendered_ReturnValue;                // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_PauseMenu_Slot_C*                  K2Node_DynamicCast_AsWBP_Pause_Menu_Slot;          // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsStandalone_ReturnValue_1;               // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USavedGameSlotInfo*>             CallFunc_GetLoadedSlotInfos_SlotInfos;             // 0x0040(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanLoadGame_ReturnValue;                  // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0055(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0056(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanSaveGame_ReturnValue;                  // 0x0057(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PauseMenu_C_Refresh_Buttons_State) == 0x000008, "Wrong alignment on WBP_PauseMenu_C_Refresh_Buttons_State");
static_assert(sizeof(WBP_PauseMenu_C_Refresh_Buttons_State) == 0x000060, "Wrong size on WBP_PauseMenu_C_Refresh_Buttons_State");
static_assert(offsetof(WBP_PauseMenu_C_Refresh_Buttons_State, CallFunc_IsStandalone_ReturnValue) == 0x000000, "Member 'WBP_PauseMenu_C_Refresh_Buttons_State::CallFunc_IsStandalone_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PauseMenu_C_Refresh_Buttons_State, CallFunc_GetOwningPlayer_ReturnValue) == 0x000008, "Member 'WBP_PauseMenu_C_Refresh_Buttons_State::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PauseMenu_C_Refresh_Buttons_State, CallFunc_SelectText_ReturnValue) == 0x000010, "Member 'WBP_PauseMenu_C_Refresh_Buttons_State::CallFunc_SelectText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PauseMenu_C_Refresh_Buttons_State, K2Node_DynamicCast_AsTed_Player_State) == 0x000020, "Member 'WBP_PauseMenu_C_Refresh_Buttons_State::K2Node_DynamicCast_AsTed_Player_State' has a wrong offset!");
static_assert(offsetof(WBP_PauseMenu_C_Refresh_Buttons_State, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'WBP_PauseMenu_C_Refresh_Buttons_State::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_PauseMenu_C_Refresh_Buttons_State, CallFunc_IsDefeated_ReturnValue) == 0x000029, "Member 'WBP_PauseMenu_C_Refresh_Buttons_State::CallFunc_IsDefeated_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PauseMenu_C_Refresh_Buttons_State, CallFunc_IsSurrendered_ReturnValue) == 0x00002A, "Member 'WBP_PauseMenu_C_Refresh_Buttons_State::CallFunc_IsSurrendered_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PauseMenu_C_Refresh_Buttons_State, CallFunc_BooleanOR_ReturnValue) == 0x00002B, "Member 'WBP_PauseMenu_C_Refresh_Buttons_State::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PauseMenu_C_Refresh_Buttons_State, K2Node_DynamicCast_AsWBP_Pause_Menu_Slot) == 0x000030, "Member 'WBP_PauseMenu_C_Refresh_Buttons_State::K2Node_DynamicCast_AsWBP_Pause_Menu_Slot' has a wrong offset!");
static_assert(offsetof(WBP_PauseMenu_C_Refresh_Buttons_State, K2Node_DynamicCast_bSuccess_1) == 0x000038, "Member 'WBP_PauseMenu_C_Refresh_Buttons_State::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_PauseMenu_C_Refresh_Buttons_State, CallFunc_IsStandalone_ReturnValue_1) == 0x000039, "Member 'WBP_PauseMenu_C_Refresh_Buttons_State::CallFunc_IsStandalone_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PauseMenu_C_Refresh_Buttons_State, CallFunc_GetLoadedSlotInfos_SlotInfos) == 0x000040, "Member 'WBP_PauseMenu_C_Refresh_Buttons_State::CallFunc_GetLoadedSlotInfos_SlotInfos' has a wrong offset!");
static_assert(offsetof(WBP_PauseMenu_C_Refresh_Buttons_State, CallFunc_Array_Length_ReturnValue) == 0x000050, "Member 'WBP_PauseMenu_C_Refresh_Buttons_State::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PauseMenu_C_Refresh_Buttons_State, CallFunc_CanLoadGame_ReturnValue) == 0x000054, "Member 'WBP_PauseMenu_C_Refresh_Buttons_State::CallFunc_CanLoadGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PauseMenu_C_Refresh_Buttons_State, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000055, "Member 'WBP_PauseMenu_C_Refresh_Buttons_State::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PauseMenu_C_Refresh_Buttons_State, CallFunc_Not_PreBool_ReturnValue) == 0x000056, "Member 'WBP_PauseMenu_C_Refresh_Buttons_State::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PauseMenu_C_Refresh_Buttons_State, CallFunc_CanSaveGame_ReturnValue) == 0x000057, "Member 'WBP_PauseMenu_C_Refresh_Buttons_State::CallFunc_CanSaveGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PauseMenu_C_Refresh_Buttons_State, CallFunc_BooleanOR_ReturnValue_1) == 0x000058, "Member 'WBP_PauseMenu_C_Refresh_Buttons_State::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PauseMenu_C_Refresh_Buttons_State, CallFunc_Not_PreBool_ReturnValue_1) == 0x000059, "Member 'WBP_PauseMenu_C_Refresh_Buttons_State::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");

// Function WBP_PauseMenu.WBP_PauseMenu_C.OnWidgetHiddenOnGoBack
// 0x0010 (0x0010 - 0x0000)
struct WBP_PauseMenu_C_OnWidgetHiddenOnGoBack final
{
public:
	class UWidget*                                InWidget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         InPriority;                                        // 0x0008(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PauseMenu_C_OnWidgetHiddenOnGoBack) == 0x000008, "Wrong alignment on WBP_PauseMenu_C_OnWidgetHiddenOnGoBack");
static_assert(sizeof(WBP_PauseMenu_C_OnWidgetHiddenOnGoBack) == 0x000010, "Wrong size on WBP_PauseMenu_C_OnWidgetHiddenOnGoBack");
static_assert(offsetof(WBP_PauseMenu_C_OnWidgetHiddenOnGoBack, InWidget) == 0x000000, "Member 'WBP_PauseMenu_C_OnWidgetHiddenOnGoBack::InWidget' has a wrong offset!");
static_assert(offsetof(WBP_PauseMenu_C_OnWidgetHiddenOnGoBack, InPriority) == 0x000008, "Member 'WBP_PauseMenu_C_OnWidgetHiddenOnGoBack::InPriority' has a wrong offset!");
static_assert(offsetof(WBP_PauseMenu_C_OnWidgetHiddenOnGoBack, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000009, "Member 'WBP_PauseMenu_C_OnWidgetHiddenOnGoBack::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");

// Function WBP_PauseMenu.WBP_PauseMenu_C.OnVisibilityChanged_Event
// 0x0001 (0x0001 - 0x0000)
struct WBP_PauseMenu_C_OnVisibilityChanged_Event final
{
public:
	ESlateVisibility                              InVisibility;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PauseMenu_C_OnVisibilityChanged_Event) == 0x000001, "Wrong alignment on WBP_PauseMenu_C_OnVisibilityChanged_Event");
static_assert(sizeof(WBP_PauseMenu_C_OnVisibilityChanged_Event) == 0x000001, "Wrong size on WBP_PauseMenu_C_OnVisibilityChanged_Event");
static_assert(offsetof(WBP_PauseMenu_C_OnVisibilityChanged_Event, InVisibility) == 0x000000, "Member 'WBP_PauseMenu_C_OnVisibilityChanged_Event::InVisibility' has a wrong offset!");

// Function WBP_PauseMenu.WBP_PauseMenu_C.OnOpen
// 0x0010 (0x0010 - 0x0000)
struct WBP_PauseMenu_C_OnOpen final
{
public:
	const class UObject*                          InContext;                                         // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          bInInstant;                                        // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PauseMenu_C_OnOpen) == 0x000008, "Wrong alignment on WBP_PauseMenu_C_OnOpen");
static_assert(sizeof(WBP_PauseMenu_C_OnOpen) == 0x000010, "Wrong size on WBP_PauseMenu_C_OnOpen");
static_assert(offsetof(WBP_PauseMenu_C_OnOpen, InContext) == 0x000000, "Member 'WBP_PauseMenu_C_OnOpen::InContext' has a wrong offset!");
static_assert(offsetof(WBP_PauseMenu_C_OnOpen, bInInstant) == 0x000008, "Member 'WBP_PauseMenu_C_OnOpen::bInInstant' has a wrong offset!");

// Function WBP_PauseMenu.WBP_PauseMenu_C.HandleStats
// 0x0001 (0x0001 - 0x0000)
struct WBP_PauseMenu_C_HandleStats final
{
public:
	bool                                          CallFunc_OpenMenuScreen_ReturnValue;               // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PauseMenu_C_HandleStats) == 0x000001, "Wrong alignment on WBP_PauseMenu_C_HandleStats");
static_assert(sizeof(WBP_PauseMenu_C_HandleStats) == 0x000001, "Wrong size on WBP_PauseMenu_C_HandleStats");
static_assert(offsetof(WBP_PauseMenu_C_HandleStats, CallFunc_OpenMenuScreen_ReturnValue) == 0x000000, "Member 'WBP_PauseMenu_C_HandleStats::CallFunc_OpenMenuScreen_ReturnValue' has a wrong offset!");

// Function WBP_PauseMenu.WBP_PauseMenu_C.HandleResume
// 0x0001 (0x0001 - 0x0000)
struct WBP_PauseMenu_C_HandleResume final
{
public:
	bool                                          CallFunc_CloseMenuScreen_ReturnValue;              // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PauseMenu_C_HandleResume) == 0x000001, "Wrong alignment on WBP_PauseMenu_C_HandleResume");
static_assert(sizeof(WBP_PauseMenu_C_HandleResume) == 0x000001, "Wrong size on WBP_PauseMenu_C_HandleResume");
static_assert(offsetof(WBP_PauseMenu_C_HandleResume, CallFunc_CloseMenuScreen_ReturnValue) == 0x000000, "Member 'WBP_PauseMenu_C_HandleResume::CallFunc_CloseMenuScreen_ReturnValue' has a wrong offset!");

// Function WBP_PauseMenu.WBP_PauseMenu_C.GetWidgetBackPriorities
// 0x00A8 (0x00A8 - 0x0000)
struct WBP_PauseMenu_C_GetWidgetBackPriorities final
{
public:
	TMap<class UWidget*, uint8>                   ReturnValue;                                       // 0x0000(0x0050)(Parm, OutParm, ReturnParm, ContainsInstancedReference)
	class UTedPopup*                              CallFunc_GetPauseMenuPopup_ReturnValue;            // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TMap<class UWidget*, uint8>                   K2Node_MakeMap_Map;                                // 0x0058(0x0050)(ContainsInstancedReference)
};
static_assert(alignof(WBP_PauseMenu_C_GetWidgetBackPriorities) == 0x000008, "Wrong alignment on WBP_PauseMenu_C_GetWidgetBackPriorities");
static_assert(sizeof(WBP_PauseMenu_C_GetWidgetBackPriorities) == 0x0000A8, "Wrong size on WBP_PauseMenu_C_GetWidgetBackPriorities");
static_assert(offsetof(WBP_PauseMenu_C_GetWidgetBackPriorities, ReturnValue) == 0x000000, "Member 'WBP_PauseMenu_C_GetWidgetBackPriorities::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PauseMenu_C_GetWidgetBackPriorities, CallFunc_GetPauseMenuPopup_ReturnValue) == 0x000050, "Member 'WBP_PauseMenu_C_GetWidgetBackPriorities::CallFunc_GetPauseMenuPopup_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PauseMenu_C_GetWidgetBackPriorities, K2Node_MakeMap_Map) == 0x000058, "Member 'WBP_PauseMenu_C_GetWidgetBackPriorities::K2Node_MakeMap_Map' has a wrong offset!");

// Function WBP_PauseMenu.WBP_PauseMenu_C.ExecuteUbergraph_WBP_PauseMenu
// 0x00E0 (0x00E0 - 0x0000)
struct WBP_PauseMenu_C_ExecuteUbergraph_WBP_PauseMenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(ESlateVisibility InVisibility)> K2Node_CreateDelegate_OutputDelegate;             // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTedContentPanelBase*                   K2Node_ComponentBoundEvent_InContentPanel;         // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UTedContentPanelSlotBase*               K2Node_ComponentBoundEvent_InContentSlot;          // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ETedContentSlotAction                         K2Node_ComponentBoundEvent_InAction;               // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_1;    // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_2;    // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_ObjectToString_ReturnValue;          // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0040(0x0010)()
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_3;    // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0058(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00A0(0x0010)(ReferenceParm)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_4;    // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00B8(0x0010)()
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_5;    // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_6;    // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_7;    // 0x00CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CB[0x5];                                       // 0x00CB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UTedSettingsScreen*                     K2Node_ComponentBoundEvent_InSettingsScreen;       // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_CustomEvent_InVisibility;                   // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_ComponentBoundEvent_InVisibility_1;         // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_ComponentBoundEvent_InVisibility;           // 0x00DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PauseMenu_C_ExecuteUbergraph_WBP_PauseMenu) == 0x000008, "Wrong alignment on WBP_PauseMenu_C_ExecuteUbergraph_WBP_PauseMenu");
static_assert(sizeof(WBP_PauseMenu_C_ExecuteUbergraph_WBP_PauseMenu) == 0x0000E0, "Wrong size on WBP_PauseMenu_C_ExecuteUbergraph_WBP_PauseMenu");
static_assert(offsetof(WBP_PauseMenu_C_ExecuteUbergraph_WBP_PauseMenu, EntryPoint) == 0x000000, "Member 'WBP_PauseMenu_C_ExecuteUbergraph_WBP_PauseMenu::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_PauseMenu_C_ExecuteUbergraph_WBP_PauseMenu, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_PauseMenu_C_ExecuteUbergraph_WBP_PauseMenu::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_PauseMenu_C_ExecuteUbergraph_WBP_PauseMenu, K2Node_ComponentBoundEvent_InContentPanel) == 0x000018, "Member 'WBP_PauseMenu_C_ExecuteUbergraph_WBP_PauseMenu::K2Node_ComponentBoundEvent_InContentPanel' has a wrong offset!");
static_assert(offsetof(WBP_PauseMenu_C_ExecuteUbergraph_WBP_PauseMenu, K2Node_ComponentBoundEvent_InContentSlot) == 0x000020, "Member 'WBP_PauseMenu_C_ExecuteUbergraph_WBP_PauseMenu::K2Node_ComponentBoundEvent_InContentSlot' has a wrong offset!");
static_assert(offsetof(WBP_PauseMenu_C_ExecuteUbergraph_WBP_PauseMenu, K2Node_ComponentBoundEvent_InAction) == 0x000028, "Member 'WBP_PauseMenu_C_ExecuteUbergraph_WBP_PauseMenu::K2Node_ComponentBoundEvent_InAction' has a wrong offset!");
static_assert(offsetof(WBP_PauseMenu_C_ExecuteUbergraph_WBP_PauseMenu, K2Node_SwitchEnum_CmpSuccess) == 0x000029, "Member 'WBP_PauseMenu_C_ExecuteUbergraph_WBP_PauseMenu::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_PauseMenu_C_ExecuteUbergraph_WBP_PauseMenu, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x00002A, "Member 'WBP_PauseMenu_C_ExecuteUbergraph_WBP_PauseMenu::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PauseMenu_C_ExecuteUbergraph_WBP_PauseMenu, CallFunc_EqualEqual_ObjectObject_ReturnValue_1) == 0x00002B, "Member 'WBP_PauseMenu_C_ExecuteUbergraph_WBP_PauseMenu::CallFunc_EqualEqual_ObjectObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PauseMenu_C_ExecuteUbergraph_WBP_PauseMenu, CallFunc_EqualEqual_ObjectObject_ReturnValue_2) == 0x00002C, "Member 'WBP_PauseMenu_C_ExecuteUbergraph_WBP_PauseMenu::CallFunc_EqualEqual_ObjectObject_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_PauseMenu_C_ExecuteUbergraph_WBP_PauseMenu, CallFunc_Conv_ObjectToString_ReturnValue) == 0x000030, "Member 'WBP_PauseMenu_C_ExecuteUbergraph_WBP_PauseMenu::CallFunc_Conv_ObjectToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PauseMenu_C_ExecuteUbergraph_WBP_PauseMenu, CallFunc_Conv_StringToText_ReturnValue) == 0x000040, "Member 'WBP_PauseMenu_C_ExecuteUbergraph_WBP_PauseMenu::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PauseMenu_C_ExecuteUbergraph_WBP_PauseMenu, CallFunc_EqualEqual_ObjectObject_ReturnValue_3) == 0x000050, "Member 'WBP_PauseMenu_C_ExecuteUbergraph_WBP_PauseMenu::CallFunc_EqualEqual_ObjectObject_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_PauseMenu_C_ExecuteUbergraph_WBP_PauseMenu, K2Node_MakeStruct_FormatArgumentData) == 0x000058, "Member 'WBP_PauseMenu_C_ExecuteUbergraph_WBP_PauseMenu::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_PauseMenu_C_ExecuteUbergraph_WBP_PauseMenu, K2Node_MakeArray_Array) == 0x0000A0, "Member 'WBP_PauseMenu_C_ExecuteUbergraph_WBP_PauseMenu::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_PauseMenu_C_ExecuteUbergraph_WBP_PauseMenu, CallFunc_EqualEqual_ObjectObject_ReturnValue_4) == 0x0000B0, "Member 'WBP_PauseMenu_C_ExecuteUbergraph_WBP_PauseMenu::CallFunc_EqualEqual_ObjectObject_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_PauseMenu_C_ExecuteUbergraph_WBP_PauseMenu, CallFunc_Format_ReturnValue) == 0x0000B8, "Member 'WBP_PauseMenu_C_ExecuteUbergraph_WBP_PauseMenu::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PauseMenu_C_ExecuteUbergraph_WBP_PauseMenu, CallFunc_EqualEqual_ObjectObject_ReturnValue_5) == 0x0000C8, "Member 'WBP_PauseMenu_C_ExecuteUbergraph_WBP_PauseMenu::CallFunc_EqualEqual_ObjectObject_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_PauseMenu_C_ExecuteUbergraph_WBP_PauseMenu, CallFunc_EqualEqual_ObjectObject_ReturnValue_6) == 0x0000C9, "Member 'WBP_PauseMenu_C_ExecuteUbergraph_WBP_PauseMenu::CallFunc_EqualEqual_ObjectObject_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WBP_PauseMenu_C_ExecuteUbergraph_WBP_PauseMenu, CallFunc_EqualEqual_ObjectObject_ReturnValue_7) == 0x0000CA, "Member 'WBP_PauseMenu_C_ExecuteUbergraph_WBP_PauseMenu::CallFunc_EqualEqual_ObjectObject_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WBP_PauseMenu_C_ExecuteUbergraph_WBP_PauseMenu, K2Node_ComponentBoundEvent_InSettingsScreen) == 0x0000D0, "Member 'WBP_PauseMenu_C_ExecuteUbergraph_WBP_PauseMenu::K2Node_ComponentBoundEvent_InSettingsScreen' has a wrong offset!");
static_assert(offsetof(WBP_PauseMenu_C_ExecuteUbergraph_WBP_PauseMenu, K2Node_CustomEvent_InVisibility) == 0x0000D8, "Member 'WBP_PauseMenu_C_ExecuteUbergraph_WBP_PauseMenu::K2Node_CustomEvent_InVisibility' has a wrong offset!");
static_assert(offsetof(WBP_PauseMenu_C_ExecuteUbergraph_WBP_PauseMenu, K2Node_ComponentBoundEvent_InVisibility_1) == 0x0000D9, "Member 'WBP_PauseMenu_C_ExecuteUbergraph_WBP_PauseMenu::K2Node_ComponentBoundEvent_InVisibility_1' has a wrong offset!");
static_assert(offsetof(WBP_PauseMenu_C_ExecuteUbergraph_WBP_PauseMenu, K2Node_ComponentBoundEvent_InVisibility) == 0x0000DA, "Member 'WBP_PauseMenu_C_ExecuteUbergraph_WBP_PauseMenu::K2Node_ComponentBoundEvent_InVisibility' has a wrong offset!");

// Function WBP_PauseMenu.WBP_PauseMenu_C.BndEvt__WBP_GameMenu_MenuScreen_Settings_K2Node_ComponentBoundEvent_0_TedSettingsScreenGoBack__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_PauseMenu_C_BndEvt__WBP_GameMenu_MenuScreen_Settings_K2Node_ComponentBoundEvent_0_TedSettingsScreenGoBack__DelegateSignature final
{
public:
	class UTedSettingsScreen*                     InSettingsScreen;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PauseMenu_C_BndEvt__WBP_GameMenu_MenuScreen_Settings_K2Node_ComponentBoundEvent_0_TedSettingsScreenGoBack__DelegateSignature) == 0x000008, "Wrong alignment on WBP_PauseMenu_C_BndEvt__WBP_GameMenu_MenuScreen_Settings_K2Node_ComponentBoundEvent_0_TedSettingsScreenGoBack__DelegateSignature");
static_assert(sizeof(WBP_PauseMenu_C_BndEvt__WBP_GameMenu_MenuScreen_Settings_K2Node_ComponentBoundEvent_0_TedSettingsScreenGoBack__DelegateSignature) == 0x000008, "Wrong size on WBP_PauseMenu_C_BndEvt__WBP_GameMenu_MenuScreen_Settings_K2Node_ComponentBoundEvent_0_TedSettingsScreenGoBack__DelegateSignature");
static_assert(offsetof(WBP_PauseMenu_C_BndEvt__WBP_GameMenu_MenuScreen_Settings_K2Node_ComponentBoundEvent_0_TedSettingsScreenGoBack__DelegateSignature, InSettingsScreen) == 0x000000, "Member 'WBP_PauseMenu_C_BndEvt__WBP_GameMenu_MenuScreen_Settings_K2Node_ComponentBoundEvent_0_TedSettingsScreenGoBack__DelegateSignature::InSettingsScreen' has a wrong offset!");

// Function WBP_PauseMenu.WBP_PauseMenu_C.BndEvt__WBP_GameMenu_MenuScreen_SaveGame_K2Node_ComponentBoundEvent_3_OnVisibilityChangedEvent__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WBP_PauseMenu_C_BndEvt__WBP_GameMenu_MenuScreen_SaveGame_K2Node_ComponentBoundEvent_3_OnVisibilityChangedEvent__DelegateSignature final
{
public:
	ESlateVisibility                              InVisibility;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PauseMenu_C_BndEvt__WBP_GameMenu_MenuScreen_SaveGame_K2Node_ComponentBoundEvent_3_OnVisibilityChangedEvent__DelegateSignature) == 0x000001, "Wrong alignment on WBP_PauseMenu_C_BndEvt__WBP_GameMenu_MenuScreen_SaveGame_K2Node_ComponentBoundEvent_3_OnVisibilityChangedEvent__DelegateSignature");
static_assert(sizeof(WBP_PauseMenu_C_BndEvt__WBP_GameMenu_MenuScreen_SaveGame_K2Node_ComponentBoundEvent_3_OnVisibilityChangedEvent__DelegateSignature) == 0x000001, "Wrong size on WBP_PauseMenu_C_BndEvt__WBP_GameMenu_MenuScreen_SaveGame_K2Node_ComponentBoundEvent_3_OnVisibilityChangedEvent__DelegateSignature");
static_assert(offsetof(WBP_PauseMenu_C_BndEvt__WBP_GameMenu_MenuScreen_SaveGame_K2Node_ComponentBoundEvent_3_OnVisibilityChangedEvent__DelegateSignature, InVisibility) == 0x000000, "Member 'WBP_PauseMenu_C_BndEvt__WBP_GameMenu_MenuScreen_SaveGame_K2Node_ComponentBoundEvent_3_OnVisibilityChangedEvent__DelegateSignature::InVisibility' has a wrong offset!");

// Function WBP_PauseMenu.WBP_PauseMenu_C.BndEvt__WBP_GameMenu_MenuScreen_LoadGame_K2Node_ComponentBoundEvent_4_OnVisibilityChangedEvent__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WBP_PauseMenu_C_BndEvt__WBP_GameMenu_MenuScreen_LoadGame_K2Node_ComponentBoundEvent_4_OnVisibilityChangedEvent__DelegateSignature final
{
public:
	ESlateVisibility                              InVisibility;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PauseMenu_C_BndEvt__WBP_GameMenu_MenuScreen_LoadGame_K2Node_ComponentBoundEvent_4_OnVisibilityChangedEvent__DelegateSignature) == 0x000001, "Wrong alignment on WBP_PauseMenu_C_BndEvt__WBP_GameMenu_MenuScreen_LoadGame_K2Node_ComponentBoundEvent_4_OnVisibilityChangedEvent__DelegateSignature");
static_assert(sizeof(WBP_PauseMenu_C_BndEvt__WBP_GameMenu_MenuScreen_LoadGame_K2Node_ComponentBoundEvent_4_OnVisibilityChangedEvent__DelegateSignature) == 0x000001, "Wrong size on WBP_PauseMenu_C_BndEvt__WBP_GameMenu_MenuScreen_LoadGame_K2Node_ComponentBoundEvent_4_OnVisibilityChangedEvent__DelegateSignature");
static_assert(offsetof(WBP_PauseMenu_C_BndEvt__WBP_GameMenu_MenuScreen_LoadGame_K2Node_ComponentBoundEvent_4_OnVisibilityChangedEvent__DelegateSignature, InVisibility) == 0x000000, "Member 'WBP_PauseMenu_C_BndEvt__WBP_GameMenu_MenuScreen_LoadGame_K2Node_ComponentBoundEvent_4_OnVisibilityChangedEvent__DelegateSignature::InVisibility' has a wrong offset!");

// Function WBP_PauseMenu.WBP_PauseMenu_C.BndEvt__WBP_GameMenu_MenuScreen_ButtonsPanel_K2Node_ComponentBoundEvent_6_ContentPanelActionDelegateSignature__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct WBP_PauseMenu_C_BndEvt__WBP_GameMenu_MenuScreen_ButtonsPanel_K2Node_ComponentBoundEvent_6_ContentPanelActionDelegateSignature__DelegateSignature final
{
public:
	class UTedContentPanelBase*                   InContentPanel;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UTedContentPanelSlotBase*               InContentSlot;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ETedContentSlotAction                         InAction;                                          // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PauseMenu_C_BndEvt__WBP_GameMenu_MenuScreen_ButtonsPanel_K2Node_ComponentBoundEvent_6_ContentPanelActionDelegateSignature__DelegateSignature) == 0x000008, "Wrong alignment on WBP_PauseMenu_C_BndEvt__WBP_GameMenu_MenuScreen_ButtonsPanel_K2Node_ComponentBoundEvent_6_ContentPanelActionDelegateSignature__DelegateSignature");
static_assert(sizeof(WBP_PauseMenu_C_BndEvt__WBP_GameMenu_MenuScreen_ButtonsPanel_K2Node_ComponentBoundEvent_6_ContentPanelActionDelegateSignature__DelegateSignature) == 0x000018, "Wrong size on WBP_PauseMenu_C_BndEvt__WBP_GameMenu_MenuScreen_ButtonsPanel_K2Node_ComponentBoundEvent_6_ContentPanelActionDelegateSignature__DelegateSignature");
