#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GenericMenu_Tabs_Slot

#include "Basic.hpp"

#include "Tempest_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_GenericMenu_Tabs_Slot.WBP_GenericMenu_Tabs_Slot_C.SetSelectedEffect
// 0x0068 (0x0068 - 0x0000)
struct WBP_GenericMenu_Tabs_Slot_C_SetSelectedEffect final
{
public:
	bool                                          bInSelected;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bInInstant;                                        // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               LocalMID;                                          // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable;                                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_1;                              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_2;                              // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetGlowMaterial_ReturnValue;              // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTimeForUIMaterials_ReturnValue;        // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_Select_Default;                             // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Select_Default_1;                           // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Select_Option_0_ImplicitCast;               // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_1; // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GenericMenu_Tabs_Slot_C_SetSelectedEffect) == 0x000008, "Wrong alignment on WBP_GenericMenu_Tabs_Slot_C_SetSelectedEffect");
static_assert(sizeof(WBP_GenericMenu_Tabs_Slot_C_SetSelectedEffect) == 0x000068, "Wrong size on WBP_GenericMenu_Tabs_Slot_C_SetSelectedEffect");
static_assert(offsetof(WBP_GenericMenu_Tabs_Slot_C_SetSelectedEffect, bInSelected) == 0x000000, "Member 'WBP_GenericMenu_Tabs_Slot_C_SetSelectedEffect::bInSelected' has a wrong offset!");
static_assert(offsetof(WBP_GenericMenu_Tabs_Slot_C_SetSelectedEffect, bInInstant) == 0x000001, "Member 'WBP_GenericMenu_Tabs_Slot_C_SetSelectedEffect::bInInstant' has a wrong offset!");
static_assert(offsetof(WBP_GenericMenu_Tabs_Slot_C_SetSelectedEffect, LocalMID) == 0x000008, "Member 'WBP_GenericMenu_Tabs_Slot_C_SetSelectedEffect::LocalMID' has a wrong offset!");
static_assert(offsetof(WBP_GenericMenu_Tabs_Slot_C_SetSelectedEffect, Temp_bool_Variable) == 0x000010, "Member 'WBP_GenericMenu_Tabs_Slot_C_SetSelectedEffect::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GenericMenu_Tabs_Slot_C_SetSelectedEffect, Temp_real_Variable) == 0x000018, "Member 'WBP_GenericMenu_Tabs_Slot_C_SetSelectedEffect::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GenericMenu_Tabs_Slot_C_SetSelectedEffect, Temp_bool_Variable_1) == 0x000020, "Member 'WBP_GenericMenu_Tabs_Slot_C_SetSelectedEffect::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_GenericMenu_Tabs_Slot_C_SetSelectedEffect, Temp_real_Variable_1) == 0x000028, "Member 'WBP_GenericMenu_Tabs_Slot_C_SetSelectedEffect::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_GenericMenu_Tabs_Slot_C_SetSelectedEffect, Temp_real_Variable_2) == 0x000030, "Member 'WBP_GenericMenu_Tabs_Slot_C_SetSelectedEffect::Temp_real_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_GenericMenu_Tabs_Slot_C_SetSelectedEffect, CallFunc_GetGlowMaterial_ReturnValue) == 0x000038, "Member 'WBP_GenericMenu_Tabs_Slot_C_SetSelectedEffect::CallFunc_GetGlowMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GenericMenu_Tabs_Slot_C_SetSelectedEffect, CallFunc_GetTimeForUIMaterials_ReturnValue) == 0x000040, "Member 'WBP_GenericMenu_Tabs_Slot_C_SetSelectedEffect::CallFunc_GetTimeForUIMaterials_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GenericMenu_Tabs_Slot_C_SetSelectedEffect, K2Node_Select_Default) == 0x000048, "Member 'WBP_GenericMenu_Tabs_Slot_C_SetSelectedEffect::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_GenericMenu_Tabs_Slot_C_SetSelectedEffect, K2Node_Select_Default_1) == 0x000050, "Member 'WBP_GenericMenu_Tabs_Slot_C_SetSelectedEffect::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_GenericMenu_Tabs_Slot_C_SetSelectedEffect, K2Node_Select_Option_0_ImplicitCast) == 0x000058, "Member 'WBP_GenericMenu_Tabs_Slot_C_SetSelectedEffect::K2Node_Select_Option_0_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_GenericMenu_Tabs_Slot_C_SetSelectedEffect, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000060, "Member 'WBP_GenericMenu_Tabs_Slot_C_SetSelectedEffect::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_GenericMenu_Tabs_Slot_C_SetSelectedEffect, CallFunc_SetScalarParameterValue_Value_ImplicitCast_1) == 0x000064, "Member 'WBP_GenericMenu_Tabs_Slot_C_SetSelectedEffect::CallFunc_SetScalarParameterValue_Value_ImplicitCast_1' has a wrong offset!");

// Function WBP_GenericMenu_Tabs_Slot.WBP_GenericMenu_Tabs_Slot_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_GenericMenu_Tabs_Slot_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GenericMenu_Tabs_Slot_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_GenericMenu_Tabs_Slot_C_PreConstruct");
static_assert(sizeof(WBP_GenericMenu_Tabs_Slot_C_PreConstruct) == 0x000001, "Wrong size on WBP_GenericMenu_Tabs_Slot_C_PreConstruct");
static_assert(offsetof(WBP_GenericMenu_Tabs_Slot_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_GenericMenu_Tabs_Slot_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_GenericMenu_Tabs_Slot.WBP_GenericMenu_Tabs_Slot_C.OnActivateState
// 0x0002 (0x0002 - 0x0000)
struct WBP_GenericMenu_Tabs_Slot_C_OnActivateState final
{
public:
	ETedContentSlotState                          InState;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bInActivated;                                      // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GenericMenu_Tabs_Slot_C_OnActivateState) == 0x000001, "Wrong alignment on WBP_GenericMenu_Tabs_Slot_C_OnActivateState");
static_assert(sizeof(WBP_GenericMenu_Tabs_Slot_C_OnActivateState) == 0x000002, "Wrong size on WBP_GenericMenu_Tabs_Slot_C_OnActivateState");
static_assert(offsetof(WBP_GenericMenu_Tabs_Slot_C_OnActivateState, InState) == 0x000000, "Member 'WBP_GenericMenu_Tabs_Slot_C_OnActivateState::InState' has a wrong offset!");
static_assert(offsetof(WBP_GenericMenu_Tabs_Slot_C_OnActivateState, bInActivated) == 0x000001, "Member 'WBP_GenericMenu_Tabs_Slot_C_OnActivateState::bInActivated' has a wrong offset!");

// Function WBP_GenericMenu_Tabs_Slot.WBP_GenericMenu_Tabs_Slot_C.GetContentPanel
// 0x0020 (0x0020 - 0x0000)
struct WBP_GenericMenu_Tabs_Slot_C_GetContentPanel final
{
public:
	class UTedContentPanelInstanced*              Out;                                               // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UTedContentPanelBase*                   CallFunc_GetParentContentPanel_ReturnValue;        // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UTedContentPanelInstanced*              K2Node_DynamicCast_AsTed_Content_Panel_Instanced;  // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GenericMenu_Tabs_Slot_C_GetContentPanel) == 0x000008, "Wrong alignment on WBP_GenericMenu_Tabs_Slot_C_GetContentPanel");
static_assert(sizeof(WBP_GenericMenu_Tabs_Slot_C_GetContentPanel) == 0x000020, "Wrong size on WBP_GenericMenu_Tabs_Slot_C_GetContentPanel");
static_assert(offsetof(WBP_GenericMenu_Tabs_Slot_C_GetContentPanel, Out) == 0x000000, "Member 'WBP_GenericMenu_Tabs_Slot_C_GetContentPanel::Out' has a wrong offset!");
static_assert(offsetof(WBP_GenericMenu_Tabs_Slot_C_GetContentPanel, CallFunc_GetParentContentPanel_ReturnValue) == 0x000008, "Member 'WBP_GenericMenu_Tabs_Slot_C_GetContentPanel::CallFunc_GetParentContentPanel_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GenericMenu_Tabs_Slot_C_GetContentPanel, K2Node_DynamicCast_AsTed_Content_Panel_Instanced) == 0x000010, "Member 'WBP_GenericMenu_Tabs_Slot_C_GetContentPanel::K2Node_DynamicCast_AsTed_Content_Panel_Instanced' has a wrong offset!");
static_assert(offsetof(WBP_GenericMenu_Tabs_Slot_C_GetContentPanel, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WBP_GenericMenu_Tabs_Slot_C_GetContentPanel::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WBP_GenericMenu_Tabs_Slot.WBP_GenericMenu_Tabs_Slot_C.GetContent
// 0x0020 (0x0020 - 0x0000)
struct WBP_GenericMenu_Tabs_Slot_C_GetContent final
{
public:
	class UTedUI_InstancedContent*                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSlotIndex_ReturnValue;                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTedContentPanelInstanced*              CallFunc_GetContentPanel_Out;                      // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	const class UTedUI_InstancedContent*          CallFunc_GetContent_ReturnValue;                   // 0x0018(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GenericMenu_Tabs_Slot_C_GetContent) == 0x000008, "Wrong alignment on WBP_GenericMenu_Tabs_Slot_C_GetContent");
static_assert(sizeof(WBP_GenericMenu_Tabs_Slot_C_GetContent) == 0x000020, "Wrong size on WBP_GenericMenu_Tabs_Slot_C_GetContent");
static_assert(offsetof(WBP_GenericMenu_Tabs_Slot_C_GetContent, ReturnValue) == 0x000000, "Member 'WBP_GenericMenu_Tabs_Slot_C_GetContent::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GenericMenu_Tabs_Slot_C_GetContent, CallFunc_GetSlotIndex_ReturnValue) == 0x000008, "Member 'WBP_GenericMenu_Tabs_Slot_C_GetContent::CallFunc_GetSlotIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GenericMenu_Tabs_Slot_C_GetContent, CallFunc_GetContentPanel_Out) == 0x000010, "Member 'WBP_GenericMenu_Tabs_Slot_C_GetContent::CallFunc_GetContentPanel_Out' has a wrong offset!");
static_assert(offsetof(WBP_GenericMenu_Tabs_Slot_C_GetContent, CallFunc_GetContent_ReturnValue) == 0x000018, "Member 'WBP_GenericMenu_Tabs_Slot_C_GetContent::CallFunc_GetContent_ReturnValue' has a wrong offset!");

// Function WBP_GenericMenu_Tabs_Slot.WBP_GenericMenu_Tabs_Slot_C.ExecuteUbergraph_WBP_GenericMenu_Tabs_Slot
// 0x0030 (0x0030 - 0x0000)
struct WBP_GenericMenu_Tabs_Slot_C_ExecuteUbergraph_WBP_GenericMenu_Tabs_Slot final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTedUI_InstancedContent*                CallFunc_GetContent_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ETedContentSlotState                          K2Node_Event_InState;                              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInActivated;                         // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            CallFunc_GetTextColor_TextColor_Disabled;          // 0x0014(0x0014)()
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GenericMenu_Tabs_Slot_C_ExecuteUbergraph_WBP_GenericMenu_Tabs_Slot) == 0x000008, "Wrong alignment on WBP_GenericMenu_Tabs_Slot_C_ExecuteUbergraph_WBP_GenericMenu_Tabs_Slot");
static_assert(sizeof(WBP_GenericMenu_Tabs_Slot_C_ExecuteUbergraph_WBP_GenericMenu_Tabs_Slot) == 0x000030, "Wrong size on WBP_GenericMenu_Tabs_Slot_C_ExecuteUbergraph_WBP_GenericMenu_Tabs_Slot");
static_assert(offsetof(WBP_GenericMenu_Tabs_Slot_C_ExecuteUbergraph_WBP_GenericMenu_Tabs_Slot, EntryPoint) == 0x000000, "Member 'WBP_GenericMenu_Tabs_Slot_C_ExecuteUbergraph_WBP_GenericMenu_Tabs_Slot::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_GenericMenu_Tabs_Slot_C_ExecuteUbergraph_WBP_GenericMenu_Tabs_Slot, CallFunc_GetContent_ReturnValue) == 0x000008, "Member 'WBP_GenericMenu_Tabs_Slot_C_ExecuteUbergraph_WBP_GenericMenu_Tabs_Slot::CallFunc_GetContent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GenericMenu_Tabs_Slot_C_ExecuteUbergraph_WBP_GenericMenu_Tabs_Slot, K2Node_Event_InState) == 0x000010, "Member 'WBP_GenericMenu_Tabs_Slot_C_ExecuteUbergraph_WBP_GenericMenu_Tabs_Slot::K2Node_Event_InState' has a wrong offset!");
static_assert(offsetof(WBP_GenericMenu_Tabs_Slot_C_ExecuteUbergraph_WBP_GenericMenu_Tabs_Slot, K2Node_Event_bInActivated) == 0x000011, "Member 'WBP_GenericMenu_Tabs_Slot_C_ExecuteUbergraph_WBP_GenericMenu_Tabs_Slot::K2Node_Event_bInActivated' has a wrong offset!");
static_assert(offsetof(WBP_GenericMenu_Tabs_Slot_C_ExecuteUbergraph_WBP_GenericMenu_Tabs_Slot, CallFunc_GetTextColor_TextColor_Disabled) == 0x000014, "Member 'WBP_GenericMenu_Tabs_Slot_C_ExecuteUbergraph_WBP_GenericMenu_Tabs_Slot::CallFunc_GetTextColor_TextColor_Disabled' has a wrong offset!");
static_assert(offsetof(WBP_GenericMenu_Tabs_Slot_C_ExecuteUbergraph_WBP_GenericMenu_Tabs_Slot, CallFunc_Not_PreBool_ReturnValue) == 0x000028, "Member 'WBP_GenericMenu_Tabs_Slot_C_ExecuteUbergraph_WBP_GenericMenu_Tabs_Slot::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GenericMenu_Tabs_Slot_C_ExecuteUbergraph_WBP_GenericMenu_Tabs_Slot, K2Node_SwitchEnum_CmpSuccess) == 0x000029, "Member 'WBP_GenericMenu_Tabs_Slot_C_ExecuteUbergraph_WBP_GenericMenu_Tabs_Slot::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_GenericMenu_Tabs_Slot_C_ExecuteUbergraph_WBP_GenericMenu_Tabs_Slot, K2Node_Event_IsDesignTime) == 0x00002A, "Member 'WBP_GenericMenu_Tabs_Slot_C_ExecuteUbergraph_WBP_GenericMenu_Tabs_Slot::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function WBP_GenericMenu_Tabs_Slot.WBP_GenericMenu_Tabs_Slot_C.GetTextColor
// 0x001C (0x001C - 0x0000)
struct WBP_GenericMenu_Tabs_Slot_C_GetTextColor final
{
public:
	struct FSlateColor                            TextColor_Disabled_0;                              // 0x0000(0x0014)(Parm, OutParm)
	bool                                          CallFunc_IsStateActive_ReturnValue;                // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsStateActive_ReturnValue_1;              // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsStateActive_ReturnValue_2;              // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsStateActive_ReturnValue_3;              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GenericMenu_Tabs_Slot_C_GetTextColor) == 0x000004, "Wrong alignment on WBP_GenericMenu_Tabs_Slot_C_GetTextColor");
static_assert(sizeof(WBP_GenericMenu_Tabs_Slot_C_GetTextColor) == 0x00001C, "Wrong size on WBP_GenericMenu_Tabs_Slot_C_GetTextColor");
static_assert(offsetof(WBP_GenericMenu_Tabs_Slot_C_GetTextColor, TextColor_Disabled_0) == 0x000000, "Member 'WBP_GenericMenu_Tabs_Slot_C_GetTextColor::TextColor_Disabled_0' has a wrong offset!");
static_assert(offsetof(WBP_GenericMenu_Tabs_Slot_C_GetTextColor, CallFunc_IsStateActive_ReturnValue) == 0x000014, "Member 'WBP_GenericMenu_Tabs_Slot_C_GetTextColor::CallFunc_IsStateActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GenericMenu_Tabs_Slot_C_GetTextColor, CallFunc_IsStateActive_ReturnValue_1) == 0x000015, "Member 'WBP_GenericMenu_Tabs_Slot_C_GetTextColor::CallFunc_IsStateActive_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_GenericMenu_Tabs_Slot_C_GetTextColor, CallFunc_BooleanOR_ReturnValue) == 0x000016, "Member 'WBP_GenericMenu_Tabs_Slot_C_GetTextColor::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GenericMenu_Tabs_Slot_C_GetTextColor, CallFunc_IsStateActive_ReturnValue_2) == 0x000017, "Member 'WBP_GenericMenu_Tabs_Slot_C_GetTextColor::CallFunc_IsStateActive_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_GenericMenu_Tabs_Slot_C_GetTextColor, CallFunc_IsStateActive_ReturnValue_3) == 0x000018, "Member 'WBP_GenericMenu_Tabs_Slot_C_GetTextColor::CallFunc_IsStateActive_ReturnValue_3' has a wrong offset!");

}

