#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_HUD_BuildingGrid_Slot_TooltipDisplay

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_HUD_BuildingGrid_Slot_TooltipDisplay.WBP_HUD_BuildingGrid_Slot_TooltipDisplay_C.ExecuteUbergraph_WBP_HUD_BuildingGrid_Slot_TooltipDisplay
// 0x0004 (0x0004 - 0x0000)
struct WBP_HUD_BuildingGrid_Slot_TooltipDisplay_C_ExecuteUbergraph_WBP_HUD_BuildingGrid_Slot_TooltipDisplay final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_BuildingGrid_Slot_TooltipDisplay_C_ExecuteUbergraph_WBP_HUD_BuildingGrid_Slot_TooltipDisplay) == 0x000004, "Wrong alignment on WBP_HUD_BuildingGrid_Slot_TooltipDisplay_C_ExecuteUbergraph_WBP_HUD_BuildingGrid_Slot_TooltipDisplay");
static_assert(sizeof(WBP_HUD_BuildingGrid_Slot_TooltipDisplay_C_ExecuteUbergraph_WBP_HUD_BuildingGrid_Slot_TooltipDisplay) == 0x000004, "Wrong size on WBP_HUD_BuildingGrid_Slot_TooltipDisplay_C_ExecuteUbergraph_WBP_HUD_BuildingGrid_Slot_TooltipDisplay");
static_assert(offsetof(WBP_HUD_BuildingGrid_Slot_TooltipDisplay_C_ExecuteUbergraph_WBP_HUD_BuildingGrid_Slot_TooltipDisplay, EntryPoint) == 0x000000, "Member 'WBP_HUD_BuildingGrid_Slot_TooltipDisplay_C_ExecuteUbergraph_WBP_HUD_BuildingGrid_Slot_TooltipDisplay::EntryPoint' has a wrong offset!");

// Function WBP_HUD_BuildingGrid_Slot_TooltipDisplay.WBP_HUD_BuildingGrid_Slot_TooltipDisplay_C.Get Additional Build Time Color
// 0x0028 (0x0028 - 0x0000)
struct WBP_HUD_BuildingGrid_Slot_TooltipDisplay_C_Get_Additional_Build_Time_Color final
{
public:
	struct FSlateColor                            ReturnValue;                                       // 0x0000(0x0014)(Parm, OutParm, ReturnParm)
	float                                         CallFunc_GetCostValue_AdditionalTime_ReturnValue;  // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_BuildingGrid_Slot_TooltipDisplay_C_Get_Additional_Build_Time_Color) == 0x000008, "Wrong alignment on WBP_HUD_BuildingGrid_Slot_TooltipDisplay_C_Get_Additional_Build_Time_Color");
static_assert(sizeof(WBP_HUD_BuildingGrid_Slot_TooltipDisplay_C_Get_Additional_Build_Time_Color) == 0x000028, "Wrong size on WBP_HUD_BuildingGrid_Slot_TooltipDisplay_C_Get_Additional_Build_Time_Color");
static_assert(offsetof(WBP_HUD_BuildingGrid_Slot_TooltipDisplay_C_Get_Additional_Build_Time_Color, ReturnValue) == 0x000000, "Member 'WBP_HUD_BuildingGrid_Slot_TooltipDisplay_C_Get_Additional_Build_Time_Color::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_BuildingGrid_Slot_TooltipDisplay_C_Get_Additional_Build_Time_Color, CallFunc_GetCostValue_AdditionalTime_ReturnValue) == 0x000014, "Member 'WBP_HUD_BuildingGrid_Slot_TooltipDisplay_C_Get_Additional_Build_Time_Color::CallFunc_GetCostValue_AdditionalTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_BuildingGrid_Slot_TooltipDisplay_C_Get_Additional_Build_Time_Color, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000018, "Member 'WBP_HUD_BuildingGrid_Slot_TooltipDisplay_C_Get_Additional_Build_Time_Color::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_BuildingGrid_Slot_TooltipDisplay_C_Get_Additional_Build_Time_Color, CallFunc_Greater_DoubleDouble_A_ImplicitCast) == 0x000020, "Member 'WBP_HUD_BuildingGrid_Slot_TooltipDisplay_C_Get_Additional_Build_Time_Color::CallFunc_Greater_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function WBP_HUD_BuildingGrid_Slot_TooltipDisplay.WBP_HUD_BuildingGrid_Slot_TooltipDisplay_C.Get Formatted Shortcut Text
// 0x0088 (0x0088 - 0x0000)
struct WBP_HUD_BuildingGrid_Slot_TooltipDisplay_C_Get_Formatted_Shortcut_Text final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm)
	class FText                                   CallFunc_GetShortcutText_ReturnValue;              // 0x0010(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0020(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0068(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0078(0x0010)()
};
static_assert(alignof(WBP_HUD_BuildingGrid_Slot_TooltipDisplay_C_Get_Formatted_Shortcut_Text) == 0x000008, "Wrong alignment on WBP_HUD_BuildingGrid_Slot_TooltipDisplay_C_Get_Formatted_Shortcut_Text");
static_assert(sizeof(WBP_HUD_BuildingGrid_Slot_TooltipDisplay_C_Get_Formatted_Shortcut_Text) == 0x000088, "Wrong size on WBP_HUD_BuildingGrid_Slot_TooltipDisplay_C_Get_Formatted_Shortcut_Text");
static_assert(offsetof(WBP_HUD_BuildingGrid_Slot_TooltipDisplay_C_Get_Formatted_Shortcut_Text, ReturnValue) == 0x000000, "Member 'WBP_HUD_BuildingGrid_Slot_TooltipDisplay_C_Get_Formatted_Shortcut_Text::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_BuildingGrid_Slot_TooltipDisplay_C_Get_Formatted_Shortcut_Text, CallFunc_GetShortcutText_ReturnValue) == 0x000010, "Member 'WBP_HUD_BuildingGrid_Slot_TooltipDisplay_C_Get_Formatted_Shortcut_Text::CallFunc_GetShortcutText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_BuildingGrid_Slot_TooltipDisplay_C_Get_Formatted_Shortcut_Text, K2Node_MakeStruct_FormatArgumentData) == 0x000020, "Member 'WBP_HUD_BuildingGrid_Slot_TooltipDisplay_C_Get_Formatted_Shortcut_Text::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_HUD_BuildingGrid_Slot_TooltipDisplay_C_Get_Formatted_Shortcut_Text, K2Node_MakeArray_Array) == 0x000068, "Member 'WBP_HUD_BuildingGrid_Slot_TooltipDisplay_C_Get_Formatted_Shortcut_Text::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_HUD_BuildingGrid_Slot_TooltipDisplay_C_Get_Formatted_Shortcut_Text, CallFunc_Format_ReturnValue) == 0x000078, "Member 'WBP_HUD_BuildingGrid_Slot_TooltipDisplay_C_Get_Formatted_Shortcut_Text::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function WBP_HUD_BuildingGrid_Slot_TooltipDisplay.WBP_HUD_BuildingGrid_Slot_TooltipDisplay_C.Get Section Visibility (Cost)
// 0x0006 (0x0006 - 0x0000)
struct WBP_HUD_BuildingGrid_Slot_TooltipDisplay_C_Get_Section_Visibility__Cost_ final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldAnyChildrenBeVisible_ReturnValue;   // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_BuildingGrid_Slot_TooltipDisplay_C_Get_Section_Visibility__Cost_) == 0x000001, "Wrong alignment on WBP_HUD_BuildingGrid_Slot_TooltipDisplay_C_Get_Section_Visibility__Cost_");
static_assert(sizeof(WBP_HUD_BuildingGrid_Slot_TooltipDisplay_C_Get_Section_Visibility__Cost_) == 0x000006, "Wrong size on WBP_HUD_BuildingGrid_Slot_TooltipDisplay_C_Get_Section_Visibility__Cost_");
static_assert(offsetof(WBP_HUD_BuildingGrid_Slot_TooltipDisplay_C_Get_Section_Visibility__Cost_, ReturnValue) == 0x000000, "Member 'WBP_HUD_BuildingGrid_Slot_TooltipDisplay_C_Get_Section_Visibility__Cost_::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_BuildingGrid_Slot_TooltipDisplay_C_Get_Section_Visibility__Cost_, Temp_bool_Variable) == 0x000001, "Member 'WBP_HUD_BuildingGrid_Slot_TooltipDisplay_C_Get_Section_Visibility__Cost_::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_HUD_BuildingGrid_Slot_TooltipDisplay_C_Get_Section_Visibility__Cost_, Temp_byte_Variable) == 0x000002, "Member 'WBP_HUD_BuildingGrid_Slot_TooltipDisplay_C_Get_Section_Visibility__Cost_::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_HUD_BuildingGrid_Slot_TooltipDisplay_C_Get_Section_Visibility__Cost_, Temp_byte_Variable_1) == 0x000003, "Member 'WBP_HUD_BuildingGrid_Slot_TooltipDisplay_C_Get_Section_Visibility__Cost_::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_HUD_BuildingGrid_Slot_TooltipDisplay_C_Get_Section_Visibility__Cost_, CallFunc_ShouldAnyChildrenBeVisible_ReturnValue) == 0x000004, "Member 'WBP_HUD_BuildingGrid_Slot_TooltipDisplay_C_Get_Section_Visibility__Cost_::CallFunc_ShouldAnyChildrenBeVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_BuildingGrid_Slot_TooltipDisplay_C_Get_Section_Visibility__Cost_, K2Node_Select_Default) == 0x000005, "Member 'WBP_HUD_BuildingGrid_Slot_TooltipDisplay_C_Get_Section_Visibility__Cost_::K2Node_Select_Default' has a wrong offset!");

// Function WBP_HUD_BuildingGrid_Slot_TooltipDisplay.WBP_HUD_BuildingGrid_Slot_TooltipDisplay_C.Get Section Visibility (Issues)
// 0x0006 (0x0006 - 0x0000)
struct WBP_HUD_BuildingGrid_Slot_TooltipDisplay_C_Get_Section_Visibility__Issues_ final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldAnyChildrenBeVisible_ReturnValue;   // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_BuildingGrid_Slot_TooltipDisplay_C_Get_Section_Visibility__Issues_) == 0x000001, "Wrong alignment on WBP_HUD_BuildingGrid_Slot_TooltipDisplay_C_Get_Section_Visibility__Issues_");
static_assert(sizeof(WBP_HUD_BuildingGrid_Slot_TooltipDisplay_C_Get_Section_Visibility__Issues_) == 0x000006, "Wrong size on WBP_HUD_BuildingGrid_Slot_TooltipDisplay_C_Get_Section_Visibility__Issues_");
static_assert(offsetof(WBP_HUD_BuildingGrid_Slot_TooltipDisplay_C_Get_Section_Visibility__Issues_, ReturnValue) == 0x000000, "Member 'WBP_HUD_BuildingGrid_Slot_TooltipDisplay_C_Get_Section_Visibility__Issues_::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_BuildingGrid_Slot_TooltipDisplay_C_Get_Section_Visibility__Issues_, Temp_bool_Variable) == 0x000001, "Member 'WBP_HUD_BuildingGrid_Slot_TooltipDisplay_C_Get_Section_Visibility__Issues_::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_HUD_BuildingGrid_Slot_TooltipDisplay_C_Get_Section_Visibility__Issues_, Temp_byte_Variable) == 0x000002, "Member 'WBP_HUD_BuildingGrid_Slot_TooltipDisplay_C_Get_Section_Visibility__Issues_::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_HUD_BuildingGrid_Slot_TooltipDisplay_C_Get_Section_Visibility__Issues_, Temp_byte_Variable_1) == 0x000003, "Member 'WBP_HUD_BuildingGrid_Slot_TooltipDisplay_C_Get_Section_Visibility__Issues_::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_HUD_BuildingGrid_Slot_TooltipDisplay_C_Get_Section_Visibility__Issues_, CallFunc_ShouldAnyChildrenBeVisible_ReturnValue) == 0x000004, "Member 'WBP_HUD_BuildingGrid_Slot_TooltipDisplay_C_Get_Section_Visibility__Issues_::CallFunc_ShouldAnyChildrenBeVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_BuildingGrid_Slot_TooltipDisplay_C_Get_Section_Visibility__Issues_, K2Node_Select_Default) == 0x000005, "Member 'WBP_HUD_BuildingGrid_Slot_TooltipDisplay_C_Get_Section_Visibility__Issues_::K2Node_Select_Default' has a wrong offset!");

// Function WBP_HUD_BuildingGrid_Slot_TooltipDisplay.WBP_HUD_BuildingGrid_Slot_TooltipDisplay_C.InitPrerequisites
// 0x0050 (0x0050 - 0x0000)
struct WBP_HUD_BuildingGrid_Slot_TooltipDisplay_C_InitPrerequisites final
{
public:
	TArray<class UWidget*>                        LocalPrerequisites;                                // 0x0000(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_HUD_BuildingGrid_Slot_Tooltip_Prerequisite_C* K2Node_DynamicCast_AsWBP_HUD_Building_Grid_Slot_Tooltip_Prerequisite; // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0040(0x0010)(ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(WBP_HUD_BuildingGrid_Slot_TooltipDisplay_C_InitPrerequisites) == 0x000008, "Wrong alignment on WBP_HUD_BuildingGrid_Slot_TooltipDisplay_C_InitPrerequisites");
static_assert(sizeof(WBP_HUD_BuildingGrid_Slot_TooltipDisplay_C_InitPrerequisites) == 0x000050, "Wrong size on WBP_HUD_BuildingGrid_Slot_TooltipDisplay_C_InitPrerequisites");
static_assert(offsetof(WBP_HUD_BuildingGrid_Slot_TooltipDisplay_C_InitPrerequisites, LocalPrerequisites) == 0x000000, "Member 'WBP_HUD_BuildingGrid_Slot_TooltipDisplay_C_InitPrerequisites::LocalPrerequisites' has a wrong offset!");
static_assert(offsetof(WBP_HUD_BuildingGrid_Slot_TooltipDisplay_C_InitPrerequisites, Temp_int_Array_Index_Variable) == 0x000010, "Member 'WBP_HUD_BuildingGrid_Slot_TooltipDisplay_C_InitPrerequisites::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_HUD_BuildingGrid_Slot_TooltipDisplay_C_InitPrerequisites, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'WBP_HUD_BuildingGrid_Slot_TooltipDisplay_C_InitPrerequisites::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_HUD_BuildingGrid_Slot_TooltipDisplay_C_InitPrerequisites, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'WBP_HUD_BuildingGrid_Slot_TooltipDisplay_C_InitPrerequisites::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_BuildingGrid_Slot_TooltipDisplay_C_InitPrerequisites, CallFunc_Array_Get_Item) == 0x000020, "Member 'WBP_HUD_BuildingGrid_Slot_TooltipDisplay_C_InitPrerequisites::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_HUD_BuildingGrid_Slot_TooltipDisplay_C_InitPrerequisites, K2Node_DynamicCast_AsWBP_HUD_Building_Grid_Slot_Tooltip_Prerequisite) == 0x000028, "Member 'WBP_HUD_BuildingGrid_Slot_TooltipDisplay_C_InitPrerequisites::K2Node_DynamicCast_AsWBP_HUD_Building_Grid_Slot_Tooltip_Prerequisite' has a wrong offset!");
static_assert(offsetof(WBP_HUD_BuildingGrid_Slot_TooltipDisplay_C_InitPrerequisites, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'WBP_HUD_BuildingGrid_Slot_TooltipDisplay_C_InitPrerequisites::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_HUD_BuildingGrid_Slot_TooltipDisplay_C_InitPrerequisites, CallFunc_Array_Length_ReturnValue) == 0x000034, "Member 'WBP_HUD_BuildingGrid_Slot_TooltipDisplay_C_InitPrerequisites::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_BuildingGrid_Slot_TooltipDisplay_C_InitPrerequisites, CallFunc_Less_IntInt_ReturnValue) == 0x000038, "Member 'WBP_HUD_BuildingGrid_Slot_TooltipDisplay_C_InitPrerequisites::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_BuildingGrid_Slot_TooltipDisplay_C_InitPrerequisites, CallFunc_Array_Add_ReturnValue) == 0x00003C, "Member 'WBP_HUD_BuildingGrid_Slot_TooltipDisplay_C_InitPrerequisites::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_BuildingGrid_Slot_TooltipDisplay_C_InitPrerequisites, CallFunc_GetAllChildren_ReturnValue) == 0x000040, "Member 'WBP_HUD_BuildingGrid_Slot_TooltipDisplay_C_InitPrerequisites::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");

// Function WBP_HUD_BuildingGrid_Slot_TooltipDisplay.WBP_HUD_BuildingGrid_Slot_TooltipDisplay_C.OnRefreshPrerequisites
// 0x00B8 (0x00B8 - 0x0000)
struct WBP_HUD_BuildingGrid_Slot_TooltipDisplay_C_OnRefreshPrerequisites final
{
public:
	TArray<class FText>                           InNotOwnedPrerequisites;                           // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<class FText>                           InOwnedPrerequisites;                              // 0x0010(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         LocalTotalNum;                                     // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LocalOwnedNum;                                     // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LocalNotOwnedNum;                                  // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Array_Get_Item;                           // 0x0048(0x0010)()
	class FText                                   CallFunc_Array_Get_Item_1;                         // 0x0058(0x0010)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8D[0x3];                                       // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_HUD_BuildingGrid_Slot_Tooltip_Prerequisite_C* CallFunc_Array_Get_Item_2;              // 0x0098(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A5[0x3];                                       // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_HUD_BuildingGrid_Slot_Tooltip_Prerequisite_C* CallFunc_Array_Get_Item_3;              // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_HUD_BuildingGrid_Slot_Tooltip_Prerequisite_C* CallFunc_Array_Get_Item_4;              // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_BuildingGrid_Slot_TooltipDisplay_C_OnRefreshPrerequisites) == 0x000008, "Wrong alignment on WBP_HUD_BuildingGrid_Slot_TooltipDisplay_C_OnRefreshPrerequisites");
static_assert(sizeof(WBP_HUD_BuildingGrid_Slot_TooltipDisplay_C_OnRefreshPrerequisites) == 0x0000B8, "Wrong size on WBP_HUD_BuildingGrid_Slot_TooltipDisplay_C_OnRefreshPrerequisites");
static_assert(offsetof(WBP_HUD_BuildingGrid_Slot_TooltipDisplay_C_OnRefreshPrerequisites, InNotOwnedPrerequisites) == 0x000000, "Member 'WBP_HUD_BuildingGrid_Slot_TooltipDisplay_C_OnRefreshPrerequisites::InNotOwnedPrerequisites' has a wrong offset!");
static_assert(offsetof(WBP_HUD_BuildingGrid_Slot_TooltipDisplay_C_OnRefreshPrerequisites, InOwnedPrerequisites) == 0x000010, "Member 'WBP_HUD_BuildingGrid_Slot_TooltipDisplay_C_OnRefreshPrerequisites::InOwnedPrerequisites' has a wrong offset!");
