#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_InputMapping_Panel

#include "Basic.hpp"

#include "Tempest_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_InputMapping_Panel.WBP_InputMapping_Panel_C.OnRegisterContentSlot
// 0x0010 (0x0010 - 0x0000)
struct WBP_InputMapping_Panel_C_OnRegisterContentSlot final
{
public:
	class UTedContentPanelSlotBase*               InContentSlot;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ETedContentPanelRegistration                  InMode;                                            // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_InputMapping_Panel_C_OnRegisterContentSlot) == 0x000008, "Wrong alignment on WBP_InputMapping_Panel_C_OnRegisterContentSlot");
static_assert(sizeof(WBP_InputMapping_Panel_C_OnRegisterContentSlot) == 0x000010, "Wrong size on WBP_InputMapping_Panel_C_OnRegisterContentSlot");
static_assert(offsetof(WBP_InputMapping_Panel_C_OnRegisterContentSlot, InContentSlot) == 0x000000, "Member 'WBP_InputMapping_Panel_C_OnRegisterContentSlot::InContentSlot' has a wrong offset!");
static_assert(offsetof(WBP_InputMapping_Panel_C_OnRegisterContentSlot, InMode) == 0x000008, "Member 'WBP_InputMapping_Panel_C_OnRegisterContentSlot::InMode' has a wrong offset!");

// Function WBP_InputMapping_Panel.WBP_InputMapping_Panel_C.ExecuteUbergraph_WBP_InputMapping_Panel
// 0x0028 (0x0028 - 0x0000)
struct WBP_InputMapping_Panel_C_ExecuteUbergraph_WBP_InputMapping_Panel final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateChildSize                        K2Node_MakeStruct_SlateChildSize;                  // 0x0004(0x0008)(NoDestructor)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTedContentPanelSlotBase*               K2Node_Event_InContentSlot;                        // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ETedContentPanelRegistration                  K2Node_Event_InMode;                               // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHorizontalBoxSlot*                     CallFunc_SlotAsHorizontalBoxSlot_ReturnValue;      // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_InputMapping_Panel_C_ExecuteUbergraph_WBP_InputMapping_Panel) == 0x000008, "Wrong alignment on WBP_InputMapping_Panel_C_ExecuteUbergraph_WBP_InputMapping_Panel");
static_assert(sizeof(WBP_InputMapping_Panel_C_ExecuteUbergraph_WBP_InputMapping_Panel) == 0x000028, "Wrong size on WBP_InputMapping_Panel_C_ExecuteUbergraph_WBP_InputMapping_Panel");
static_assert(offsetof(WBP_InputMapping_Panel_C_ExecuteUbergraph_WBP_InputMapping_Panel, EntryPoint) == 0x000000, "Member 'WBP_InputMapping_Panel_C_ExecuteUbergraph_WBP_InputMapping_Panel::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_InputMapping_Panel_C_ExecuteUbergraph_WBP_InputMapping_Panel, K2Node_MakeStruct_SlateChildSize) == 0x000004, "Member 'WBP_InputMapping_Panel_C_ExecuteUbergraph_WBP_InputMapping_Panel::K2Node_MakeStruct_SlateChildSize' has a wrong offset!");
static_assert(offsetof(WBP_InputMapping_Panel_C_ExecuteUbergraph_WBP_InputMapping_Panel, K2Node_Event_InContentSlot) == 0x000010, "Member 'WBP_InputMapping_Panel_C_ExecuteUbergraph_WBP_InputMapping_Panel::K2Node_Event_InContentSlot' has a wrong offset!");
static_assert(offsetof(WBP_InputMapping_Panel_C_ExecuteUbergraph_WBP_InputMapping_Panel, K2Node_Event_InMode) == 0x000018, "Member 'WBP_InputMapping_Panel_C_ExecuteUbergraph_WBP_InputMapping_Panel::K2Node_Event_InMode' has a wrong offset!");
static_assert(offsetof(WBP_InputMapping_Panel_C_ExecuteUbergraph_WBP_InputMapping_Panel, CallFunc_SlotAsHorizontalBoxSlot_ReturnValue) == 0x000020, "Member 'WBP_InputMapping_Panel_C_ExecuteUbergraph_WBP_InputMapping_Panel::CallFunc_SlotAsHorizontalBoxSlot_ReturnValue' has a wrong offset!");

}

