#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_HUD_Doctrines_Slot

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_HUD_Doctrines_Slot.WBP_HUD_Doctrines_Slot_C.ExecuteUbergraph_WBP_HUD_Doctrines_Slot
// 0x0020 (0x0020 - 0x0000)
struct WBP_HUD_Doctrines_Slot_C_ExecuteUbergraph_WBP_HUD_Doctrines_Slot final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInPaused;                            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInRunning;                           // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInIsQueued;                          // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13[0x1];                                       // 0x0013(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_InProgress;                           // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SetProgress_Value_ImplicitCast;           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_Doctrines_Slot_C_ExecuteUbergraph_WBP_HUD_Doctrines_Slot) == 0x000008, "Wrong alignment on WBP_HUD_Doctrines_Slot_C_ExecuteUbergraph_WBP_HUD_Doctrines_Slot");
static_assert(sizeof(WBP_HUD_Doctrines_Slot_C_ExecuteUbergraph_WBP_HUD_Doctrines_Slot) == 0x000020, "Wrong size on WBP_HUD_Doctrines_Slot_C_ExecuteUbergraph_WBP_HUD_Doctrines_Slot");
static_assert(offsetof(WBP_HUD_Doctrines_Slot_C_ExecuteUbergraph_WBP_HUD_Doctrines_Slot, EntryPoint) == 0x000000, "Member 'WBP_HUD_Doctrines_Slot_C_ExecuteUbergraph_WBP_HUD_Doctrines_Slot::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_HUD_Doctrines_Slot_C_ExecuteUbergraph_WBP_HUD_Doctrines_Slot, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000008, "Member 'WBP_HUD_Doctrines_Slot_C_ExecuteUbergraph_WBP_HUD_Doctrines_Slot::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_Doctrines_Slot_C_ExecuteUbergraph_WBP_HUD_Doctrines_Slot, K2Node_Event_bInPaused) == 0x000010, "Member 'WBP_HUD_Doctrines_Slot_C_ExecuteUbergraph_WBP_HUD_Doctrines_Slot::K2Node_Event_bInPaused' has a wrong offset!");
static_assert(offsetof(WBP_HUD_Doctrines_Slot_C_ExecuteUbergraph_WBP_HUD_Doctrines_Slot, K2Node_Event_bInRunning) == 0x000011, "Member 'WBP_HUD_Doctrines_Slot_C_ExecuteUbergraph_WBP_HUD_Doctrines_Slot::K2Node_Event_bInRunning' has a wrong offset!");
static_assert(offsetof(WBP_HUD_Doctrines_Slot_C_ExecuteUbergraph_WBP_HUD_Doctrines_Slot, K2Node_Event_bInIsQueued) == 0x000012, "Member 'WBP_HUD_Doctrines_Slot_C_ExecuteUbergraph_WBP_HUD_Doctrines_Slot::K2Node_Event_bInIsQueued' has a wrong offset!");
static_assert(offsetof(WBP_HUD_Doctrines_Slot_C_ExecuteUbergraph_WBP_HUD_Doctrines_Slot, K2Node_Event_InProgress) == 0x000014, "Member 'WBP_HUD_Doctrines_Slot_C_ExecuteUbergraph_WBP_HUD_Doctrines_Slot::K2Node_Event_InProgress' has a wrong offset!");
static_assert(offsetof(WBP_HUD_Doctrines_Slot_C_ExecuteUbergraph_WBP_HUD_Doctrines_Slot, CallFunc_SetProgress_Value_ImplicitCast) == 0x000018, "Member 'WBP_HUD_Doctrines_Slot_C_ExecuteUbergraph_WBP_HUD_Doctrines_Slot::CallFunc_SetProgress_Value_ImplicitCast' has a wrong offset!");

// Function WBP_HUD_Doctrines_Slot.WBP_HUD_Doctrines_Slot_C.OnRefresh_Progress
// 0x0008 (0x0008 - 0x0000)
struct WBP_HUD_Doctrines_Slot_C_OnRefresh_Progress final
{
public:
	bool                                          bInPaused;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bInRunning;                                        // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bInIsQueued;                                       // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x1];                                        // 0x0003(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         InProgress;                                        // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_Doctrines_Slot_C_OnRefresh_Progress) == 0x000004, "Wrong alignment on WBP_HUD_Doctrines_Slot_C_OnRefresh_Progress");
static_assert(sizeof(WBP_HUD_Doctrines_Slot_C_OnRefresh_Progress) == 0x000008, "Wrong size on WBP_HUD_Doctrines_Slot_C_OnRefresh_Progress");
static_assert(offsetof(WBP_HUD_Doctrines_Slot_C_OnRefresh_Progress, bInPaused) == 0x000000, "Member 'WBP_HUD_Doctrines_Slot_C_OnRefresh_Progress::bInPaused' has a wrong offset!");
static_assert(offsetof(WBP_HUD_Doctrines_Slot_C_OnRefresh_Progress, bInRunning) == 0x000001, "Member 'WBP_HUD_Doctrines_Slot_C_OnRefresh_Progress::bInRunning' has a wrong offset!");
static_assert(offsetof(WBP_HUD_Doctrines_Slot_C_OnRefresh_Progress, bInIsQueued) == 0x000002, "Member 'WBP_HUD_Doctrines_Slot_C_OnRefresh_Progress::bInIsQueued' has a wrong offset!");
static_assert(offsetof(WBP_HUD_Doctrines_Slot_C_OnRefresh_Progress, InProgress) == 0x000004, "Member 'WBP_HUD_Doctrines_Slot_C_OnRefresh_Progress::InProgress' has a wrong offset!");

// Function WBP_HUD_Doctrines_Slot.WBP_HUD_Doctrines_Slot_C.RefreshConnector
// 0x0001 (0x0001 - 0x0000)
struct WBP_HUD_Doctrines_Slot_C_RefreshConnector final
{
public:
	bool                                          CallFunc_IsLast_ReturnValue;                       // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_Doctrines_Slot_C_RefreshConnector) == 0x000001, "Wrong alignment on WBP_HUD_Doctrines_Slot_C_RefreshConnector");
static_assert(sizeof(WBP_HUD_Doctrines_Slot_C_RefreshConnector) == 0x000001, "Wrong size on WBP_HUD_Doctrines_Slot_C_RefreshConnector");
static_assert(offsetof(WBP_HUD_Doctrines_Slot_C_RefreshConnector, CallFunc_IsLast_ReturnValue) == 0x000000, "Member 'WBP_HUD_Doctrines_Slot_C_RefreshConnector::CallFunc_IsLast_ReturnValue' has a wrong offset!");

// Function WBP_HUD_Doctrines_Slot.WBP_HUD_Doctrines_Slot_C.RefreshIcon
// 0x0010 (0x0010 - 0x0000)
struct WBP_HUD_Doctrines_Slot_C_RefreshIcon final
{
public:
	class UTexture2D*                             CallFunc_GetIcon_ReturnValue;                      // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_Doctrines_Slot_C_RefreshIcon) == 0x000008, "Wrong alignment on WBP_HUD_Doctrines_Slot_C_RefreshIcon");
static_assert(sizeof(WBP_HUD_Doctrines_Slot_C_RefreshIcon) == 0x000010, "Wrong size on WBP_HUD_Doctrines_Slot_C_RefreshIcon");
static_assert(offsetof(WBP_HUD_Doctrines_Slot_C_RefreshIcon, CallFunc_GetIcon_ReturnValue) == 0x000000, "Member 'WBP_HUD_Doctrines_Slot_C_RefreshIcon::CallFunc_GetIcon_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_Doctrines_Slot_C_RefreshIcon, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000008, "Member 'WBP_HUD_Doctrines_Slot_C_RefreshIcon::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");

// Function WBP_HUD_Doctrines_Slot.WBP_HUD_Doctrines_Slot_C.SetProgress
// 0x0030 (0x0030 - 0x0000)
struct WBP_HUD_Doctrines_Slot_C_SetProgress final
{
public:
	bool                                          bPaused;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bRunning;                                          // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsQueued;                                         // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Value;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_Doctrines_Slot_C_SetProgress) == 0x000008, "Wrong alignment on WBP_HUD_Doctrines_Slot_C_SetProgress");
static_assert(sizeof(WBP_HUD_Doctrines_Slot_C_SetProgress) == 0x000030, "Wrong size on WBP_HUD_Doctrines_Slot_C_SetProgress");
static_assert(offsetof(WBP_HUD_Doctrines_Slot_C_SetProgress, bPaused) == 0x000000, "Member 'WBP_HUD_Doctrines_Slot_C_SetProgress::bPaused' has a wrong offset!");
static_assert(offsetof(WBP_HUD_Doctrines_Slot_C_SetProgress, bRunning) == 0x000001, "Member 'WBP_HUD_Doctrines_Slot_C_SetProgress::bRunning' has a wrong offset!");
static_assert(offsetof(WBP_HUD_Doctrines_Slot_C_SetProgress, bIsQueued) == 0x000002, "Member 'WBP_HUD_Doctrines_Slot_C_SetProgress::bIsQueued' has a wrong offset!");
static_assert(offsetof(WBP_HUD_Doctrines_Slot_C_SetProgress, Value) == 0x000008, "Member 'WBP_HUD_Doctrines_Slot_C_SetProgress::Value' has a wrong offset!");
static_assert(offsetof(WBP_HUD_Doctrines_Slot_C_SetProgress, Temp_bool_Variable) == 0x000010, "Member 'WBP_HUD_Doctrines_Slot_C_SetProgress::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_HUD_Doctrines_Slot_C_SetProgress, CallFunc_FClamp_ReturnValue) == 0x000018, "Member 'WBP_HUD_Doctrines_Slot_C_SetProgress::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_Doctrines_Slot_C_SetProgress, Temp_byte_Variable) == 0x000020, "Member 'WBP_HUD_Doctrines_Slot_C_SetProgress::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_HUD_Doctrines_Slot_C_SetProgress, Temp_byte_Variable_1) == 0x000021, "Member 'WBP_HUD_Doctrines_Slot_C_SetProgress::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_HUD_Doctrines_Slot_C_SetProgress, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000022, "Member 'WBP_HUD_Doctrines_Slot_C_SetProgress::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_Doctrines_Slot_C_SetProgress, CallFunc_BooleanOR_ReturnValue) == 0x000023, "Member 'WBP_HUD_Doctrines_Slot_C_SetProgress::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_Doctrines_Slot_C_SetProgress, K2Node_Select_Default) == 0x000024, "Member 'WBP_HUD_Doctrines_Slot_C_SetProgress::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_HUD_Doctrines_Slot_C_SetProgress, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000028, "Member 'WBP_HUD_Doctrines_Slot_C_SetProgress::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");

// Function WBP_HUD_Doctrines_Slot.WBP_HUD_Doctrines_Slot_C.GetMaterialsSupportingStates
// 0x0038 (0x0038 - 0x0000)
struct WBP_HUD_Doctrines_Slot_C_GetMaterialsSupportingStates final
{
public:
	TArray<class UMaterialInstanceDynamic*>       OutMIDs;                                           // 0x0000(0x0010)(Parm, OutParm)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_2;         // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UMaterialInstanceDynamic*>       K2Node_MakeArray_Array;                            // 0x0028(0x0010)(ReferenceParm)
};
static_assert(alignof(WBP_HUD_Doctrines_Slot_C_GetMaterialsSupportingStates) == 0x000008, "Wrong alignment on WBP_HUD_Doctrines_Slot_C_GetMaterialsSupportingStates");
static_assert(sizeof(WBP_HUD_Doctrines_Slot_C_GetMaterialsSupportingStates) == 0x000038, "Wrong size on WBP_HUD_Doctrines_Slot_C_GetMaterialsSupportingStates");
static_assert(offsetof(WBP_HUD_Doctrines_Slot_C_GetMaterialsSupportingStates, OutMIDs) == 0x000000, "Member 'WBP_HUD_Doctrines_Slot_C_GetMaterialsSupportingStates::OutMIDs' has a wrong offset!");
static_assert(offsetof(WBP_HUD_Doctrines_Slot_C_GetMaterialsSupportingStates, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000010, "Member 'WBP_HUD_Doctrines_Slot_C_GetMaterialsSupportingStates::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_Doctrines_Slot_C_GetMaterialsSupportingStates, CallFunc_GetDynamicMaterial_ReturnValue_1) == 0x000018, "Member 'WBP_HUD_Doctrines_Slot_C_GetMaterialsSupportingStates::CallFunc_GetDynamicMaterial_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_HUD_Doctrines_Slot_C_GetMaterialsSupportingStates, CallFunc_GetDynamicMaterial_ReturnValue_2) == 0x000020, "Member 'WBP_HUD_Doctrines_Slot_C_GetMaterialsSupportingStates::CallFunc_GetDynamicMaterial_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_HUD_Doctrines_Slot_C_GetMaterialsSupportingStates, K2Node_MakeArray_Array) == 0x000028, "Member 'WBP_HUD_Doctrines_Slot_C_GetMaterialsSupportingStates::K2Node_MakeArray_Array' has a wrong offset!");

}

