#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Generic_Popup

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Tempest_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Generic_Popup.WBP_Generic_Popup_C
// 0x0060 (0x04E8 - 0x0488)
class UWBP_Generic_Popup_C final : public UTedPopup
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0488(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USpacer*                                Spacer_Body;                                       // 0x0490(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                Spacer_DropDown;                                   // 0x0498(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                Spacer_ImageWorking;                               // 0x04A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                Spacer_TextBox;                                    // 0x04A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnClicked_Back;                                    // 0x04B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TArray<class FString>                         TempBannedChars;                                   // 0x04C0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMulticastInlineDelegate<void()>              OnClicked_Confirm;                                 // 0x04D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          bFilterText;                                       // 0x04E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_Generic_Popup_TextBox_K2Node_ComponentBoundEvent_0_OnEditableTextBoxChangedEvent__DelegateSignature(const class FText& Text);
	void CollapseAllSpacerWidgets();
	void ExecuteUbergraph_WBP_Generic_Popup(int32 EntryPoint);
	void K2_OnErrorShown(const class FText& ErrorMessage);
	void K2_OnShow();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Generic_Popup_C">();
	}
	static class UWBP_Generic_Popup_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Generic_Popup_C>();
	}
};
static_assert(alignof(UWBP_Generic_Popup_C) == 0x000008, "Wrong alignment on UWBP_Generic_Popup_C");
static_assert(sizeof(UWBP_Generic_Popup_C) == 0x0004E8, "Wrong size on UWBP_Generic_Popup_C");
static_assert(offsetof(UWBP_Generic_Popup_C, UberGraphFrame) == 0x000488, "Member 'UWBP_Generic_Popup_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Generic_Popup_C, Spacer_Body) == 0x000490, "Member 'UWBP_Generic_Popup_C::Spacer_Body' has a wrong offset!");
static_assert(offsetof(UWBP_Generic_Popup_C, Spacer_DropDown) == 0x000498, "Member 'UWBP_Generic_Popup_C::Spacer_DropDown' has a wrong offset!");
static_assert(offsetof(UWBP_Generic_Popup_C, Spacer_ImageWorking) == 0x0004A0, "Member 'UWBP_Generic_Popup_C::Spacer_ImageWorking' has a wrong offset!");
static_assert(offsetof(UWBP_Generic_Popup_C, Spacer_TextBox) == 0x0004A8, "Member 'UWBP_Generic_Popup_C::Spacer_TextBox' has a wrong offset!");
static_assert(offsetof(UWBP_Generic_Popup_C, OnClicked_Back) == 0x0004B0, "Member 'UWBP_Generic_Popup_C::OnClicked_Back' has a wrong offset!");
static_assert(offsetof(UWBP_Generic_Popup_C, TempBannedChars) == 0x0004C0, "Member 'UWBP_Generic_Popup_C::TempBannedChars' has a wrong offset!");
static_assert(offsetof(UWBP_Generic_Popup_C, OnClicked_Confirm) == 0x0004D0, "Member 'UWBP_Generic_Popup_C::OnClicked_Confirm' has a wrong offset!");
static_assert(offsetof(UWBP_Generic_Popup_C, bFilterText) == 0x0004E0, "Member 'UWBP_Generic_Popup_C::bFilterText' has a wrong offset!");

}

