#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TedJukeboxMain

#include "Basic.hpp"

#include "Tempest_structs.hpp"


namespace SDK::Params
{

// Function WBP_TedJukeboxMain.WBP_TedJukeboxMain_C.UpdateSlotFocus
// 0x0008 (0x0008 - 0x0000)
struct WBP_TedJukeboxMain_C_UpdateSlotFocus final
{
public:
	class UTedJukeboxTrackAsset*                  NewTrack;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TedJukeboxMain_C_UpdateSlotFocus) == 0x000008, "Wrong alignment on WBP_TedJukeboxMain_C_UpdateSlotFocus");
static_assert(sizeof(WBP_TedJukeboxMain_C_UpdateSlotFocus) == 0x000008, "Wrong size on WBP_TedJukeboxMain_C_UpdateSlotFocus");
static_assert(offsetof(WBP_TedJukeboxMain_C_UpdateSlotFocus, NewTrack) == 0x000000, "Member 'WBP_TedJukeboxMain_C_UpdateSlotFocus::NewTrack' has a wrong offset!");

// Function WBP_TedJukeboxMain.WBP_TedJukeboxMain_C.OnPlaybackPercentageChanged
// 0x0004 (0x0004 - 0x0000)
struct WBP_TedJukeboxMain_C_OnPlaybackPercentageChanged final
{
public:
	float                                         NewPercentage;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TedJukeboxMain_C_OnPlaybackPercentageChanged) == 0x000004, "Wrong alignment on WBP_TedJukeboxMain_C_OnPlaybackPercentageChanged");
static_assert(sizeof(WBP_TedJukeboxMain_C_OnPlaybackPercentageChanged) == 0x000004, "Wrong size on WBP_TedJukeboxMain_C_OnPlaybackPercentageChanged");
static_assert(offsetof(WBP_TedJukeboxMain_C_OnPlaybackPercentageChanged, NewPercentage) == 0x000000, "Member 'WBP_TedJukeboxMain_C_OnPlaybackPercentageChanged::NewPercentage' has a wrong offset!");

// Function WBP_TedJukeboxMain.WBP_TedJukeboxMain_C.ExecuteUbergraph_WBP_TedJukeboxMain
// 0x0138 (0x0138 - 0x0000)
struct WBP_TedJukeboxMain_C_ExecuteUbergraph_WBP_TedJukeboxMain final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTedJukeboxSubsystem*                   CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UTedJukeboxTrackAsset*>          CallFunc_GetAllTracks_ReturnValue;                 // 0x0010(0x0010)(ConstParm, ReferenceParm)
	class UTedJukeboxTrackAsset*                  K2Node_CustomEvent_NewTrack;                       // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetValue_ReturnValue;                     // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UTedJukeboxTrackAsset* NewTrack)> K2Node_CreateDelegate_OutputDelegate;     // 0x0034(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(float NewPercentage)>          K2Node_CreateDelegate_OutputDelegate_1;            // 0x0044(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_NewPercentage;                  // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValue_ReturnValue_1;                   // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTedContentPanelBase*                   K2Node_ComponentBoundEvent_InContentPanel;         // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UTedContentPanelSlotBase*               K2Node_ComponentBoundEvent_InContentSlot;          // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ETedContentSlotState                          K2Node_ComponentBoundEvent_InState;                // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bInActivated;           // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_73[0x5];                                       // 0x0073(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UTedContentPanelInstanced*              K2Node_DynamicCast_AsTed_Content_Panel_Instanced;  // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetContentID_ReturnValue;                 // 0x0084(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8D[0x3];                                       // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UScrollBox*                             K2Node_DynamicCast_AsScroll_Box;                   // 0x0090(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTedJukeboxSubsystem*                   CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTedContentPanelSlotBase*               CallFunc_GetContentSlot_ReturnValue;               // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UTedJukeboxTrackAsset*                  CallFunc_GetCurrentPlayedTrack_ReturnValue;        // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTedJukeboxSubsystem*                   CallFunc_GetGameInstanceSubsystem_ReturnValue_2;   // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UTedJukeboxTrackAsset*>          CallFunc_GetAllTracks_ReturnValue_1;               // 0x00C8(0x0010)(ConstParm, ReferenceParm)
	class UTedJukeboxSubsystem*                   CallFunc_GetGameInstanceSubsystem_ReturnValue_3;   // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Find_ReturnValue_1;                 // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTedJukeboxSubsystem*                   CallFunc_GetGameInstanceSubsystem_ReturnValue_4;   // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UScrollBox*                             K2Node_DynamicCast_AsScroll_Box_1;                 // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTedContentPanelSlotBase*               CallFunc_GetContentSlot_ReturnValue_1;             // 0x0100(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UTedJukeboxSubsystem*                   CallFunc_GetGameInstanceSubsystem_ReturnValue_5;   // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTedJukeboxSubsystem*                   CallFunc_GetGameInstanceSubsystem_ReturnValue_6;   // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTedJukeboxSubsystem*                   CallFunc_GetGameInstanceSubsystem_ReturnValue_7;   // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTedJukeboxSubsystem*                   CallFunc_GetGameInstanceSubsystem_ReturnValue_8;   // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetPlaytimeText_ReturnValue;              // 0x0128(0x0010)()
};
static_assert(alignof(WBP_TedJukeboxMain_C_ExecuteUbergraph_WBP_TedJukeboxMain) == 0x000008, "Wrong alignment on WBP_TedJukeboxMain_C_ExecuteUbergraph_WBP_TedJukeboxMain");
static_assert(sizeof(WBP_TedJukeboxMain_C_ExecuteUbergraph_WBP_TedJukeboxMain) == 0x000138, "Wrong size on WBP_TedJukeboxMain_C_ExecuteUbergraph_WBP_TedJukeboxMain");
static_assert(offsetof(WBP_TedJukeboxMain_C_ExecuteUbergraph_WBP_TedJukeboxMain, EntryPoint) == 0x000000, "Member 'WBP_TedJukeboxMain_C_ExecuteUbergraph_WBP_TedJukeboxMain::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_TedJukeboxMain_C_ExecuteUbergraph_WBP_TedJukeboxMain, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000008, "Member 'WBP_TedJukeboxMain_C_ExecuteUbergraph_WBP_TedJukeboxMain::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TedJukeboxMain_C_ExecuteUbergraph_WBP_TedJukeboxMain, CallFunc_GetAllTracks_ReturnValue) == 0x000010, "Member 'WBP_TedJukeboxMain_C_ExecuteUbergraph_WBP_TedJukeboxMain::CallFunc_GetAllTracks_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TedJukeboxMain_C_ExecuteUbergraph_WBP_TedJukeboxMain, K2Node_CustomEvent_NewTrack) == 0x000020, "Member 'WBP_TedJukeboxMain_C_ExecuteUbergraph_WBP_TedJukeboxMain::K2Node_CustomEvent_NewTrack' has a wrong offset!");
static_assert(offsetof(WBP_TedJukeboxMain_C_ExecuteUbergraph_WBP_TedJukeboxMain, CallFunc_Array_Find_ReturnValue) == 0x000028, "Member 'WBP_TedJukeboxMain_C_ExecuteUbergraph_WBP_TedJukeboxMain::CallFunc_Array_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TedJukeboxMain_C_ExecuteUbergraph_WBP_TedJukeboxMain, CallFunc_IsValid_ReturnValue) == 0x00002C, "Member 'WBP_TedJukeboxMain_C_ExecuteUbergraph_WBP_TedJukeboxMain::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TedJukeboxMain_C_ExecuteUbergraph_WBP_TedJukeboxMain, CallFunc_GetValue_ReturnValue) == 0x000030, "Member 'WBP_TedJukeboxMain_C_ExecuteUbergraph_WBP_TedJukeboxMain::CallFunc_GetValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TedJukeboxMain_C_ExecuteUbergraph_WBP_TedJukeboxMain, K2Node_CreateDelegate_OutputDelegate) == 0x000034, "Member 'WBP_TedJukeboxMain_C_ExecuteUbergraph_WBP_TedJukeboxMain::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_TedJukeboxMain_C_ExecuteUbergraph_WBP_TedJukeboxMain, K2Node_CreateDelegate_OutputDelegate_1) == 0x000044, "Member 'WBP_TedJukeboxMain_C_ExecuteUbergraph_WBP_TedJukeboxMain::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_TedJukeboxMain_C_ExecuteUbergraph_WBP_TedJukeboxMain, K2Node_CustomEvent_NewPercentage) == 0x000054, "Member 'WBP_TedJukeboxMain_C_ExecuteUbergraph_WBP_TedJukeboxMain::K2Node_CustomEvent_NewPercentage' has a wrong offset!");
static_assert(offsetof(WBP_TedJukeboxMain_C_ExecuteUbergraph_WBP_TedJukeboxMain, CallFunc_GetValue_ReturnValue_1) == 0x000058, "Member 'WBP_TedJukeboxMain_C_ExecuteUbergraph_WBP_TedJukeboxMain::CallFunc_GetValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TedJukeboxMain_C_ExecuteUbergraph_WBP_TedJukeboxMain, K2Node_ComponentBoundEvent_InContentPanel) == 0x000060, "Member 'WBP_TedJukeboxMain_C_ExecuteUbergraph_WBP_TedJukeboxMain::K2Node_ComponentBoundEvent_InContentPanel' has a wrong offset!");
static_assert(offsetof(WBP_TedJukeboxMain_C_ExecuteUbergraph_WBP_TedJukeboxMain, K2Node_ComponentBoundEvent_InContentSlot) == 0x000068, "Member 'WBP_TedJukeboxMain_C_ExecuteUbergraph_WBP_TedJukeboxMain::K2Node_ComponentBoundEvent_InContentSlot' has a wrong offset!");
static_assert(offsetof(WBP_TedJukeboxMain_C_ExecuteUbergraph_WBP_TedJukeboxMain, K2Node_ComponentBoundEvent_InState) == 0x000070, "Member 'WBP_TedJukeboxMain_C_ExecuteUbergraph_WBP_TedJukeboxMain::K2Node_ComponentBoundEvent_InState' has a wrong offset!");
static_assert(offsetof(WBP_TedJukeboxMain_C_ExecuteUbergraph_WBP_TedJukeboxMain, K2Node_ComponentBoundEvent_bInActivated) == 0x000071, "Member 'WBP_TedJukeboxMain_C_ExecuteUbergraph_WBP_TedJukeboxMain::K2Node_ComponentBoundEvent_bInActivated' has a wrong offset!");
static_assert(offsetof(WBP_TedJukeboxMain_C_ExecuteUbergraph_WBP_TedJukeboxMain, K2Node_SwitchEnum_CmpSuccess) == 0x000072, "Member 'WBP_TedJukeboxMain_C_ExecuteUbergraph_WBP_TedJukeboxMain::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_TedJukeboxMain_C_ExecuteUbergraph_WBP_TedJukeboxMain, K2Node_DynamicCast_AsTed_Content_Panel_Instanced) == 0x000078, "Member 'WBP_TedJukeboxMain_C_ExecuteUbergraph_WBP_TedJukeboxMain::K2Node_DynamicCast_AsTed_Content_Panel_Instanced' has a wrong offset!");
static_assert(offsetof(WBP_TedJukeboxMain_C_ExecuteUbergraph_WBP_TedJukeboxMain, K2Node_DynamicCast_bSuccess) == 0x000080, "Member 'WBP_TedJukeboxMain_C_ExecuteUbergraph_WBP_TedJukeboxMain::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_TedJukeboxMain_C_ExecuteUbergraph_WBP_TedJukeboxMain, CallFunc_GetContentID_ReturnValue) == 0x000084, "Member 'WBP_TedJukeboxMain_C_ExecuteUbergraph_WBP_TedJukeboxMain::CallFunc_GetContentID_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TedJukeboxMain_C_ExecuteUbergraph_WBP_TedJukeboxMain, CallFunc_EqualEqual_NameName_ReturnValue) == 0x00008C, "Member 'WBP_TedJukeboxMain_C_ExecuteUbergraph_WBP_TedJukeboxMain::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TedJukeboxMain_C_ExecuteUbergraph_WBP_TedJukeboxMain, K2Node_DynamicCast_AsScroll_Box) == 0x000090, "Member 'WBP_TedJukeboxMain_C_ExecuteUbergraph_WBP_TedJukeboxMain::K2Node_DynamicCast_AsScroll_Box' has a wrong offset!");
static_assert(offsetof(WBP_TedJukeboxMain_C_ExecuteUbergraph_WBP_TedJukeboxMain, K2Node_DynamicCast_bSuccess_1) == 0x000098, "Member 'WBP_TedJukeboxMain_C_ExecuteUbergraph_WBP_TedJukeboxMain::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_TedJukeboxMain_C_ExecuteUbergraph_WBP_TedJukeboxMain, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x0000A0, "Member 'WBP_TedJukeboxMain_C_ExecuteUbergraph_WBP_TedJukeboxMain::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TedJukeboxMain_C_ExecuteUbergraph_WBP_TedJukeboxMain, CallFunc_GetContentSlot_ReturnValue) == 0x0000A8, "Member 'WBP_TedJukeboxMain_C_ExecuteUbergraph_WBP_TedJukeboxMain::CallFunc_GetContentSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TedJukeboxMain_C_ExecuteUbergraph_WBP_TedJukeboxMain, CallFunc_GetCurrentPlayedTrack_ReturnValue) == 0x0000B0, "Member 'WBP_TedJukeboxMain_C_ExecuteUbergraph_WBP_TedJukeboxMain::CallFunc_GetCurrentPlayedTrack_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TedJukeboxMain_C_ExecuteUbergraph_WBP_TedJukeboxMain, CallFunc_IsValid_ReturnValue_1) == 0x0000B8, "Member 'WBP_TedJukeboxMain_C_ExecuteUbergraph_WBP_TedJukeboxMain::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TedJukeboxMain_C_ExecuteUbergraph_WBP_TedJukeboxMain, CallFunc_GetGameInstanceSubsystem_ReturnValue_2) == 0x0000C0, "Member 'WBP_TedJukeboxMain_C_ExecuteUbergraph_WBP_TedJukeboxMain::CallFunc_GetGameInstanceSubsystem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_TedJukeboxMain_C_ExecuteUbergraph_WBP_TedJukeboxMain, CallFunc_GetAllTracks_ReturnValue_1) == 0x0000C8, "Member 'WBP_TedJukeboxMain_C_ExecuteUbergraph_WBP_TedJukeboxMain::CallFunc_GetAllTracks_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TedJukeboxMain_C_ExecuteUbergraph_WBP_TedJukeboxMain, CallFunc_GetGameInstanceSubsystem_ReturnValue_3) == 0x0000D8, "Member 'WBP_TedJukeboxMain_C_ExecuteUbergraph_WBP_TedJukeboxMain::CallFunc_GetGameInstanceSubsystem_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_TedJukeboxMain_C_ExecuteUbergraph_WBP_TedJukeboxMain, CallFunc_Array_Find_ReturnValue_1) == 0x0000E0, "Member 'WBP_TedJukeboxMain_C_ExecuteUbergraph_WBP_TedJukeboxMain::CallFunc_Array_Find_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TedJukeboxMain_C_ExecuteUbergraph_WBP_TedJukeboxMain, CallFunc_GetGameInstanceSubsystem_ReturnValue_4) == 0x0000E8, "Member 'WBP_TedJukeboxMain_C_ExecuteUbergraph_WBP_TedJukeboxMain::CallFunc_GetGameInstanceSubsystem_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_TedJukeboxMain_C_ExecuteUbergraph_WBP_TedJukeboxMain, K2Node_DynamicCast_AsScroll_Box_1) == 0x0000F0, "Member 'WBP_TedJukeboxMain_C_ExecuteUbergraph_WBP_TedJukeboxMain::K2Node_DynamicCast_AsScroll_Box_1' has a wrong offset!");
static_assert(offsetof(WBP_TedJukeboxMain_C_ExecuteUbergraph_WBP_TedJukeboxMain, K2Node_DynamicCast_bSuccess_2) == 0x0000F8, "Member 'WBP_TedJukeboxMain_C_ExecuteUbergraph_WBP_TedJukeboxMain::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WBP_TedJukeboxMain_C_ExecuteUbergraph_WBP_TedJukeboxMain, CallFunc_GetContentSlot_ReturnValue_1) == 0x000100, "Member 'WBP_TedJukeboxMain_C_ExecuteUbergraph_WBP_TedJukeboxMain::CallFunc_GetContentSlot_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TedJukeboxMain_C_ExecuteUbergraph_WBP_TedJukeboxMain, CallFunc_GetGameInstanceSubsystem_ReturnValue_5) == 0x000108, "Member 'WBP_TedJukeboxMain_C_ExecuteUbergraph_WBP_TedJukeboxMain::CallFunc_GetGameInstanceSubsystem_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_TedJukeboxMain_C_ExecuteUbergraph_WBP_TedJukeboxMain, CallFunc_GetGameInstanceSubsystem_ReturnValue_6) == 0x000110, "Member 'WBP_TedJukeboxMain_C_ExecuteUbergraph_WBP_TedJukeboxMain::CallFunc_GetGameInstanceSubsystem_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WBP_TedJukeboxMain_C_ExecuteUbergraph_WBP_TedJukeboxMain, CallFunc_GetGameInstanceSubsystem_ReturnValue_7) == 0x000118, "Member 'WBP_TedJukeboxMain_C_ExecuteUbergraph_WBP_TedJukeboxMain::CallFunc_GetGameInstanceSubsystem_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WBP_TedJukeboxMain_C_ExecuteUbergraph_WBP_TedJukeboxMain, CallFunc_GetGameInstanceSubsystem_ReturnValue_8) == 0x000120, "Member 'WBP_TedJukeboxMain_C_ExecuteUbergraph_WBP_TedJukeboxMain::CallFunc_GetGameInstanceSubsystem_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(WBP_TedJukeboxMain_C_ExecuteUbergraph_WBP_TedJukeboxMain, CallFunc_GetPlaytimeText_ReturnValue) == 0x000128, "Member 'WBP_TedJukeboxMain_C_ExecuteUbergraph_WBP_TedJukeboxMain::CallFunc_GetPlaytimeText_ReturnValue' has a wrong offset!");

// Function WBP_TedJukeboxMain.WBP_TedJukeboxMain_C.BndEvt__WBP_TedJukeboxMain_WBP_Misc_MenuScreenPage_K2Node_ComponentBoundEvent_1_ContentPanelStateDelegateSignature__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct WBP_TedJukeboxMain_C_BndEvt__WBP_TedJukeboxMain_WBP_Misc_MenuScreenPage_K2Node_ComponentBoundEvent_1_ContentPanelStateDelegateSignature__DelegateSignature final
{
public:
	class UTedContentPanelBase*                   InContentPanel;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UTedContentPanelSlotBase*               InContentSlot;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ETedContentSlotState                          InState;                                           // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bInActivated;                                      // 0x0011(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TedJukeboxMain_C_BndEvt__WBP_TedJukeboxMain_WBP_Misc_MenuScreenPage_K2Node_ComponentBoundEvent_1_ContentPanelStateDelegateSignature__DelegateSignature) == 0x000008, "Wrong alignment on WBP_TedJukeboxMain_C_BndEvt__WBP_TedJukeboxMain_WBP_Misc_MenuScreenPage_K2Node_ComponentBoundEvent_1_ContentPanelStateDelegateSignature__DelegateSignature");
static_assert(sizeof(WBP_TedJukeboxMain_C_BndEvt__WBP_TedJukeboxMain_WBP_Misc_MenuScreenPage_K2Node_ComponentBoundEvent_1_ContentPanelStateDelegateSignature__DelegateSignature) == 0x000018, "Wrong size on WBP_TedJukeboxMain_C_BndEvt__WBP_TedJukeboxMain_WBP_Misc_MenuScreenPage_K2Node_ComponentBoundEvent_1_ContentPanelStateDelegateSignature__DelegateSignature");
static_assert(offsetof(WBP_TedJukeboxMain_C_BndEvt__WBP_TedJukeboxMain_WBP_Misc_MenuScreenPage_K2Node_ComponentBoundEvent_1_ContentPanelStateDelegateSignature__DelegateSignature, InContentPanel) == 0x000000, "Member 'WBP_TedJukeboxMain_C_BndEvt__WBP_TedJukeboxMain_WBP_Misc_MenuScreenPage_K2Node_ComponentBoundEvent_1_ContentPanelStateDelegateSignature__DelegateSignature::InContentPanel' has a wrong offset!");
static_assert(offsetof(WBP_TedJukeboxMain_C_BndEvt__WBP_TedJukeboxMain_WBP_Misc_MenuScreenPage_K2Node_ComponentBoundEvent_1_ContentPanelStateDelegateSignature__DelegateSignature, InContentSlot) == 0x000008, "Member 'WBP_TedJukeboxMain_C_BndEvt__WBP_TedJukeboxMain_WBP_Misc_MenuScreenPage_K2Node_ComponentBoundEvent_1_ContentPanelStateDelegateSignature__DelegateSignature::InContentSlot' has a wrong offset!");
static_assert(offsetof(WBP_TedJukeboxMain_C_BndEvt__WBP_TedJukeboxMain_WBP_Misc_MenuScreenPage_K2Node_ComponentBoundEvent_1_ContentPanelStateDelegateSignature__DelegateSignature, InState) == 0x000010, "Member 'WBP_TedJukeboxMain_C_BndEvt__WBP_TedJukeboxMain_WBP_Misc_MenuScreenPage_K2Node_ComponentBoundEvent_1_ContentPanelStateDelegateSignature__DelegateSignature::InState' has a wrong offset!");
static_assert(offsetof(WBP_TedJukeboxMain_C_BndEvt__WBP_TedJukeboxMain_WBP_Misc_MenuScreenPage_K2Node_ComponentBoundEvent_1_ContentPanelStateDelegateSignature__DelegateSignature, bInActivated) == 0x000011, "Member 'WBP_TedJukeboxMain_C_BndEvt__WBP_TedJukeboxMain_WBP_Misc_MenuScreenPage_K2Node_ComponentBoundEvent_1_ContentPanelStateDelegateSignature__DelegateSignature::bInActivated' has a wrong offset!");

}

