#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ChatParty_Badge

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Tempest_structs.hpp"
#include "Tempest_classes.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ChatParty_Badge.WBP_ChatParty_Badge_C
// 0x0040 (0x0440 - 0x0400)
class UWBP_ChatParty_Badge_C final : public UTedChatPartyPlayerBadge
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0400(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTedImage*                              Background;                                        // 0x0408(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon;                                              // 0x0410(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Name_0;                                            // 0x0418(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USlateBrushAsset*                       BackgroundBrushAsset;                              // 0x0420(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            NameColor;                                         // 0x0428(0x0014)(Edit, BlueprintVisible)

public:
	void ExecuteUbergraph_WBP_ChatParty_Badge(int32 EntryPoint);
	void K2_DescribePreorder(const bool bPreorder);
	void K2_DescribeSameTeam(const bool bIsSameTeam);
	void K2_DescribeSender(const EChatMessageSender& Sender);
	void K2_DescribeSenderName(const class FString& Param_Name_0);
	void PreConstruct(bool IsDesignTime);
	void SetBackgroundBrush(class USlateBrushAsset* Asset);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ChatParty_Badge_C">();
	}
	static class UWBP_ChatParty_Badge_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ChatParty_Badge_C>();
	}
};
static_assert(alignof(UWBP_ChatParty_Badge_C) == 0x000008, "Wrong alignment on UWBP_ChatParty_Badge_C");
static_assert(sizeof(UWBP_ChatParty_Badge_C) == 0x000440, "Wrong size on UWBP_ChatParty_Badge_C");
static_assert(offsetof(UWBP_ChatParty_Badge_C, UberGraphFrame) == 0x000400, "Member 'UWBP_ChatParty_Badge_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ChatParty_Badge_C, Background) == 0x000408, "Member 'UWBP_ChatParty_Badge_C::Background' has a wrong offset!");
static_assert(offsetof(UWBP_ChatParty_Badge_C, Icon) == 0x000410, "Member 'UWBP_ChatParty_Badge_C::Icon' has a wrong offset!");
static_assert(offsetof(UWBP_ChatParty_Badge_C, Name_0) == 0x000418, "Member 'UWBP_ChatParty_Badge_C::Name_0' has a wrong offset!");
static_assert(offsetof(UWBP_ChatParty_Badge_C, BackgroundBrushAsset) == 0x000420, "Member 'UWBP_ChatParty_Badge_C::BackgroundBrushAsset' has a wrong offset!");
static_assert(offsetof(UWBP_ChatParty_Badge_C, NameColor) == 0x000428, "Member 'UWBP_ChatParty_Badge_C::NameColor' has a wrong offset!");

}

