#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Shortcuts_Slot

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Tempest_structs.hpp"


namespace SDK::Params
{

// Function WBP_Shortcuts_Slot.WBP_Shortcuts_Slot_C.UpdatePreviewForDesignTime
// 0x0128 (0x0128 - 0x0000)
struct WBP_Shortcuts_Slot_C_UpdatePreviewForDesignTime final
{
public:
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0000(0x0010)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_1;            // 0x0010(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0020(0x0048)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0068(0x0048)(HasGetValueTypeHash)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_2;            // 0x00B0(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x00C0(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0108(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0118(0x0010)()
};
static_assert(alignof(WBP_Shortcuts_Slot_C_UpdatePreviewForDesignTime) == 0x000008, "Wrong alignment on WBP_Shortcuts_Slot_C_UpdatePreviewForDesignTime");
static_assert(sizeof(WBP_Shortcuts_Slot_C_UpdatePreviewForDesignTime) == 0x000128, "Wrong size on WBP_Shortcuts_Slot_C_UpdatePreviewForDesignTime");
static_assert(offsetof(WBP_Shortcuts_Slot_C_UpdatePreviewForDesignTime, CallFunc_MakeLiteralText_ReturnValue) == 0x000000, "Member 'WBP_Shortcuts_Slot_C_UpdatePreviewForDesignTime::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Shortcuts_Slot_C_UpdatePreviewForDesignTime, CallFunc_MakeLiteralText_ReturnValue_1) == 0x000010, "Member 'WBP_Shortcuts_Slot_C_UpdatePreviewForDesignTime::CallFunc_MakeLiteralText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Shortcuts_Slot_C_UpdatePreviewForDesignTime, K2Node_MakeStruct_FormatArgumentData) == 0x000020, "Member 'WBP_Shortcuts_Slot_C_UpdatePreviewForDesignTime::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_Shortcuts_Slot_C_UpdatePreviewForDesignTime, K2Node_MakeStruct_FormatArgumentData_1) == 0x000068, "Member 'WBP_Shortcuts_Slot_C_UpdatePreviewForDesignTime::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WBP_Shortcuts_Slot_C_UpdatePreviewForDesignTime, CallFunc_MakeLiteralText_ReturnValue_2) == 0x0000B0, "Member 'WBP_Shortcuts_Slot_C_UpdatePreviewForDesignTime::CallFunc_MakeLiteralText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Shortcuts_Slot_C_UpdatePreviewForDesignTime, K2Node_MakeStruct_FormatArgumentData_2) == 0x0000C0, "Member 'WBP_Shortcuts_Slot_C_UpdatePreviewForDesignTime::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(WBP_Shortcuts_Slot_C_UpdatePreviewForDesignTime, K2Node_MakeArray_Array) == 0x000108, "Member 'WBP_Shortcuts_Slot_C_UpdatePreviewForDesignTime::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_Shortcuts_Slot_C_UpdatePreviewForDesignTime, CallFunc_Format_ReturnValue) == 0x000118, "Member 'WBP_Shortcuts_Slot_C_UpdatePreviewForDesignTime::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function WBP_Shortcuts_Slot.WBP_Shortcuts_Slot_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_Shortcuts_Slot_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Shortcuts_Slot_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_Shortcuts_Slot_C_PreConstruct");
static_assert(sizeof(WBP_Shortcuts_Slot_C_PreConstruct) == 0x000001, "Wrong size on WBP_Shortcuts_Slot_C_PreConstruct");
static_assert(offsetof(WBP_Shortcuts_Slot_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_Shortcuts_Slot_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_Shortcuts_Slot.WBP_Shortcuts_Slot_C.ExecuteUbergraph_WBP_Shortcuts_Slot
// 0x00D8 (0x00D8 - 0x0000)
struct WBP_Shortcuts_Slot_C_ExecuteUbergraph_WBP_Shortcuts_Slot final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTedShortcutChordUI                    CallFunc_GetContent_OutContent;                    // 0x0008(0x0048)(HasGetValueTypeHash)
	bool                                          CallFunc_GetContent_ReturnValue;                   // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetShortcutChordDisplayText_ReturnValue;  // 0x0058(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0068(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00B0(0x0010)(ReferenceParm)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00C8(0x0010)()
};
static_assert(alignof(WBP_Shortcuts_Slot_C_ExecuteUbergraph_WBP_Shortcuts_Slot) == 0x000008, "Wrong alignment on WBP_Shortcuts_Slot_C_ExecuteUbergraph_WBP_Shortcuts_Slot");
static_assert(sizeof(WBP_Shortcuts_Slot_C_ExecuteUbergraph_WBP_Shortcuts_Slot) == 0x0000D8, "Wrong size on WBP_Shortcuts_Slot_C_ExecuteUbergraph_WBP_Shortcuts_Slot");
static_assert(offsetof(WBP_Shortcuts_Slot_C_ExecuteUbergraph_WBP_Shortcuts_Slot, EntryPoint) == 0x000000, "Member 'WBP_Shortcuts_Slot_C_ExecuteUbergraph_WBP_Shortcuts_Slot::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Shortcuts_Slot_C_ExecuteUbergraph_WBP_Shortcuts_Slot, CallFunc_GetContent_OutContent) == 0x000008, "Member 'WBP_Shortcuts_Slot_C_ExecuteUbergraph_WBP_Shortcuts_Slot::CallFunc_GetContent_OutContent' has a wrong offset!");
static_assert(offsetof(WBP_Shortcuts_Slot_C_ExecuteUbergraph_WBP_Shortcuts_Slot, CallFunc_GetContent_ReturnValue) == 0x000050, "Member 'WBP_Shortcuts_Slot_C_ExecuteUbergraph_WBP_Shortcuts_Slot::CallFunc_GetContent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Shortcuts_Slot_C_ExecuteUbergraph_WBP_Shortcuts_Slot, CallFunc_GetShortcutChordDisplayText_ReturnValue) == 0x000058, "Member 'WBP_Shortcuts_Slot_C_ExecuteUbergraph_WBP_Shortcuts_Slot::CallFunc_GetShortcutChordDisplayText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Shortcuts_Slot_C_ExecuteUbergraph_WBP_Shortcuts_Slot, K2Node_MakeStruct_FormatArgumentData) == 0x000068, "Member 'WBP_Shortcuts_Slot_C_ExecuteUbergraph_WBP_Shortcuts_Slot::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_Shortcuts_Slot_C_ExecuteUbergraph_WBP_Shortcuts_Slot, K2Node_MakeArray_Array) == 0x0000B0, "Member 'WBP_Shortcuts_Slot_C_ExecuteUbergraph_WBP_Shortcuts_Slot::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_Shortcuts_Slot_C_ExecuteUbergraph_WBP_Shortcuts_Slot, K2Node_Event_IsDesignTime) == 0x0000C0, "Member 'WBP_Shortcuts_Slot_C_ExecuteUbergraph_WBP_Shortcuts_Slot::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_Shortcuts_Slot_C_ExecuteUbergraph_WBP_Shortcuts_Slot, CallFunc_Format_ReturnValue) == 0x0000C8, "Member 'WBP_Shortcuts_Slot_C_ExecuteUbergraph_WBP_Shortcuts_Slot::CallFunc_Format_ReturnValue' has a wrong offset!");

}

