#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PauseMenu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Tempest_structs.hpp"
#include "Tempest_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_PauseMenu.WBP_PauseMenu_C
// 0x0060 (0x04F0 - 0x0490)
class UWBP_PauseMenu_C final : public UTedPauseMenuScreen
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0490(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_BG;                                          // 0x0498(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_TedJukeboxMain_C*                  JukeBox;                                           // 0x04A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_LoadGame_C*                        LoadGame;                                          // 0x04A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Menu_Light_Bottom;                                 // 0x04B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Menu_Light_Top;                                    // 0x04B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Menu;                                      // 0x04C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SaveGame_C*                        SaveGame;                                          // 0x04C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Settings_C*                        Settings;                                          // 0x04D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PauseMenu_Slot_C*                  Slot_Load;                                         // 0x04D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PauseMenu_Slot_C*                  Slot_Save;                                         // 0x04E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PauseMenu_Slot_C*                  Slot_Settings;                                     // 0x04E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ShowSettings(bool bInShow);
	void ResetMenu();
	void Refresh_Buttons_State();
	void OnWidgetHiddenOnGoBack(class UWidget* InWidget, const uint8 InPriority);
	void OnVisibilityChanged_Event(ESlateVisibility InVisibility);
	void OnOpen(const class UObject* InContext, bool bInInstant);
	void HandleStats();
	void HandleSettings();
	void HandleSave();
	void HandleResume();
	void HandleRestart();
	void HandleQuit();
	void HandleMainMenu();
	void HandleLoad();
	void HandleJukebox();
	TMap<class UWidget*, uint8> GetWidgetBackPriorities();
	void ExecuteUbergraph_WBP_PauseMenu(int32 EntryPoint);
	void Construct();
	void BndEvt__WBP_GameMenu_MenuScreen_Settings_K2Node_ComponentBoundEvent_0_TedSettingsScreenGoBack__DelegateSignature(class UTedSettingsScreen* InSettingsScreen);
	void BndEvt__WBP_GameMenu_MenuScreen_SaveGame_K2Node_ComponentBoundEvent_3_OnVisibilityChangedEvent__DelegateSignature(ESlateVisibility InVisibility);
	void BndEvt__WBP_GameMenu_MenuScreen_LoadGame_K2Node_ComponentBoundEvent_4_OnVisibilityChangedEvent__DelegateSignature(ESlateVisibility InVisibility);
	void BndEvt__WBP_GameMenu_MenuScreen_ButtonsPanel_K2Node_ComponentBoundEvent_6_ContentPanelActionDelegateSignature__DelegateSignature(class UTedContentPanelBase* InContentPanel, class UTedContentPanelSlotBase* InContentSlot, ETedContentSlotAction InAction);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_PauseMenu_C">();
	}
	static class UWBP_PauseMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_PauseMenu_C>();
	}
};
static_assert(alignof(UWBP_PauseMenu_C) == 0x000008, "Wrong alignment on UWBP_PauseMenu_C");
static_assert(sizeof(UWBP_PauseMenu_C) == 0x0004F0, "Wrong size on UWBP_PauseMenu_C");
static_assert(offsetof(UWBP_PauseMenu_C, UberGraphFrame) == 0x000490, "Member 'UWBP_PauseMenu_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_PauseMenu_C, Image_BG) == 0x000498, "Member 'UWBP_PauseMenu_C::Image_BG' has a wrong offset!");
static_assert(offsetof(UWBP_PauseMenu_C, JukeBox) == 0x0004A0, "Member 'UWBP_PauseMenu_C::JukeBox' has a wrong offset!");
static_assert(offsetof(UWBP_PauseMenu_C, LoadGame) == 0x0004A8, "Member 'UWBP_PauseMenu_C::LoadGame' has a wrong offset!");
static_assert(offsetof(UWBP_PauseMenu_C, Menu_Light_Bottom) == 0x0004B0, "Member 'UWBP_PauseMenu_C::Menu_Light_Bottom' has a wrong offset!");
static_assert(offsetof(UWBP_PauseMenu_C, Menu_Light_Top) == 0x0004B8, "Member 'UWBP_PauseMenu_C::Menu_Light_Top' has a wrong offset!");
static_assert(offsetof(UWBP_PauseMenu_C, Overlay_Menu) == 0x0004C0, "Member 'UWBP_PauseMenu_C::Overlay_Menu' has a wrong offset!");
static_assert(offsetof(UWBP_PauseMenu_C, SaveGame) == 0x0004C8, "Member 'UWBP_PauseMenu_C::SaveGame' has a wrong offset!");
static_assert(offsetof(UWBP_PauseMenu_C, Settings) == 0x0004D0, "Member 'UWBP_PauseMenu_C::Settings' has a wrong offset!");
static_assert(offsetof(UWBP_PauseMenu_C, Slot_Load) == 0x0004D8, "Member 'UWBP_PauseMenu_C::Slot_Load' has a wrong offset!");
static_assert(offsetof(UWBP_PauseMenu_C, Slot_Save) == 0x0004E0, "Member 'UWBP_PauseMenu_C::Slot_Save' has a wrong offset!");
static_assert(offsetof(UWBP_PauseMenu_C, Slot_Settings) == 0x0004E8, "Member 'UWBP_PauseMenu_C::Slot_Settings' has a wrong offset!");

}

