#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SelectionDetails_Upgrades

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_SelectionDetails_Upgrades.WBP_SelectionDetails_Upgrades_C.BndEvt__WBP_SelectionDetails_Upgrades_Commands_2_K2Node_ComponentBoundEvent_2_DynamicContentPanelDelegateSignature__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_SelectionDetails_Upgrades_C_BndEvt__WBP_SelectionDetails_Upgrades_Commands_2_K2Node_ComponentBoundEvent_2_DynamicContentPanelDelegateSignature__DelegateSignature final
{
public:
	class UTedContentPanelDynamic*                InContentPanel;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SelectionDetails_Upgrades_C_BndEvt__WBP_SelectionDetails_Upgrades_Commands_2_K2Node_ComponentBoundEvent_2_DynamicContentPanelDelegateSignature__DelegateSignature) == 0x000008, "Wrong alignment on WBP_SelectionDetails_Upgrades_C_BndEvt__WBP_SelectionDetails_Upgrades_Commands_2_K2Node_ComponentBoundEvent_2_DynamicContentPanelDelegateSignature__DelegateSignature");
static_assert(sizeof(WBP_SelectionDetails_Upgrades_C_BndEvt__WBP_SelectionDetails_Upgrades_Commands_2_K2Node_ComponentBoundEvent_2_DynamicContentPanelDelegateSignature__DelegateSignature) == 0x000008, "Wrong size on WBP_SelectionDetails_Upgrades_C_BndEvt__WBP_SelectionDetails_Upgrades_Commands_2_K2Node_ComponentBoundEvent_2_DynamicContentPanelDelegateSignature__DelegateSignature");
static_assert(offsetof(WBP_SelectionDetails_Upgrades_C_BndEvt__WBP_SelectionDetails_Upgrades_Commands_2_K2Node_ComponentBoundEvent_2_DynamicContentPanelDelegateSignature__DelegateSignature, InContentPanel) == 0x000000, "Member 'WBP_SelectionDetails_Upgrades_C_BndEvt__WBP_SelectionDetails_Upgrades_Commands_2_K2Node_ComponentBoundEvent_2_DynamicContentPanelDelegateSignature__DelegateSignature::InContentPanel' has a wrong offset!");

// Function WBP_SelectionDetails_Upgrades.WBP_SelectionDetails_Upgrades_C.BndEvt__WBP_SelectionDetails_Upgrades_Commands_2_K2Node_ComponentBoundEvent_3_OnVisibilityChangedEvent__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WBP_SelectionDetails_Upgrades_C_BndEvt__WBP_SelectionDetails_Upgrades_Commands_2_K2Node_ComponentBoundEvent_3_OnVisibilityChangedEvent__DelegateSignature final
{
public:
	ESlateVisibility                              InVisibility;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SelectionDetails_Upgrades_C_BndEvt__WBP_SelectionDetails_Upgrades_Commands_2_K2Node_ComponentBoundEvent_3_OnVisibilityChangedEvent__DelegateSignature) == 0x000001, "Wrong alignment on WBP_SelectionDetails_Upgrades_C_BndEvt__WBP_SelectionDetails_Upgrades_Commands_2_K2Node_ComponentBoundEvent_3_OnVisibilityChangedEvent__DelegateSignature");
static_assert(sizeof(WBP_SelectionDetails_Upgrades_C_BndEvt__WBP_SelectionDetails_Upgrades_Commands_2_K2Node_ComponentBoundEvent_3_OnVisibilityChangedEvent__DelegateSignature) == 0x000001, "Wrong size on WBP_SelectionDetails_Upgrades_C_BndEvt__WBP_SelectionDetails_Upgrades_Commands_2_K2Node_ComponentBoundEvent_3_OnVisibilityChangedEvent__DelegateSignature");
static_assert(offsetof(WBP_SelectionDetails_Upgrades_C_BndEvt__WBP_SelectionDetails_Upgrades_Commands_2_K2Node_ComponentBoundEvent_3_OnVisibilityChangedEvent__DelegateSignature, InVisibility) == 0x000000, "Member 'WBP_SelectionDetails_Upgrades_C_BndEvt__WBP_SelectionDetails_Upgrades_Commands_2_K2Node_ComponentBoundEvent_3_OnVisibilityChangedEvent__DelegateSignature::InVisibility' has a wrong offset!");

// Function WBP_SelectionDetails_Upgrades.WBP_SelectionDetails_Upgrades_C.ExecuteUbergraph_WBP_SelectionDetails_Upgrades
// 0x0018 (0x0018 - 0x0000)
struct WBP_SelectionDetails_Upgrades_C_ExecuteUbergraph_WBP_SelectionDetails_Upgrades final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTedContentPanelDynamic*                K2Node_ComponentBoundEvent_InContentPanel;         // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_ComponentBoundEvent_InVisibility;           // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SelectionDetails_Upgrades_C_ExecuteUbergraph_WBP_SelectionDetails_Upgrades) == 0x000008, "Wrong alignment on WBP_SelectionDetails_Upgrades_C_ExecuteUbergraph_WBP_SelectionDetails_Upgrades");
static_assert(sizeof(WBP_SelectionDetails_Upgrades_C_ExecuteUbergraph_WBP_SelectionDetails_Upgrades) == 0x000018, "Wrong size on WBP_SelectionDetails_Upgrades_C_ExecuteUbergraph_WBP_SelectionDetails_Upgrades");
static_assert(offsetof(WBP_SelectionDetails_Upgrades_C_ExecuteUbergraph_WBP_SelectionDetails_Upgrades, EntryPoint) == 0x000000, "Member 'WBP_SelectionDetails_Upgrades_C_ExecuteUbergraph_WBP_SelectionDetails_Upgrades::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_SelectionDetails_Upgrades_C_ExecuteUbergraph_WBP_SelectionDetails_Upgrades, K2Node_ComponentBoundEvent_InContentPanel) == 0x000008, "Member 'WBP_SelectionDetails_Upgrades_C_ExecuteUbergraph_WBP_SelectionDetails_Upgrades::K2Node_ComponentBoundEvent_InContentPanel' has a wrong offset!");
static_assert(offsetof(WBP_SelectionDetails_Upgrades_C_ExecuteUbergraph_WBP_SelectionDetails_Upgrades, K2Node_ComponentBoundEvent_InVisibility) == 0x000010, "Member 'WBP_SelectionDetails_Upgrades_C_ExecuteUbergraph_WBP_SelectionDetails_Upgrades::K2Node_ComponentBoundEvent_InVisibility' has a wrong offset!");

// Function WBP_SelectionDetails_Upgrades.WBP_SelectionDetails_Upgrades_C.HasContent
// 0x000C (0x000C - 0x0000)
struct WBP_SelectionDetails_Upgrades_C_HasContent final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetContentSlotsCount_ReturnValue;         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SelectionDetails_Upgrades_C_HasContent) == 0x000004, "Wrong alignment on WBP_SelectionDetails_Upgrades_C_HasContent");
static_assert(sizeof(WBP_SelectionDetails_Upgrades_C_HasContent) == 0x00000C, "Wrong size on WBP_SelectionDetails_Upgrades_C_HasContent");
static_assert(offsetof(WBP_SelectionDetails_Upgrades_C_HasContent, ReturnValue) == 0x000000, "Member 'WBP_SelectionDetails_Upgrades_C_HasContent::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SelectionDetails_Upgrades_C_HasContent, CallFunc_GetContentSlotsCount_ReturnValue) == 0x000004, "Member 'WBP_SelectionDetails_Upgrades_C_HasContent::CallFunc_GetContentSlotsCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SelectionDetails_Upgrades_C_HasContent, CallFunc_Greater_IntInt_ReturnValue) == 0x000008, "Member 'WBP_SelectionDetails_Upgrades_C_HasContent::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_SelectionDetails_Upgrades.WBP_SelectionDetails_Upgrades_C.RefreshFrame
// 0x0018 (0x0018 - 0x0000)
struct WBP_SelectionDetails_Upgrades_C_RefreshFrame final
{
public:
	int32                                         Local_CommandsCount;                               // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasContent_ReturnValue;                   // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetContentSlotsCountByState_ReturnValue;  // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetContentSlotsCount_ReturnValue;         // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SelectionDetails_Upgrades_C_RefreshFrame) == 0x000004, "Wrong alignment on WBP_SelectionDetails_Upgrades_C_RefreshFrame");
static_assert(sizeof(WBP_SelectionDetails_Upgrades_C_RefreshFrame) == 0x000018, "Wrong size on WBP_SelectionDetails_Upgrades_C_RefreshFrame");
static_assert(offsetof(WBP_SelectionDetails_Upgrades_C_RefreshFrame, Local_CommandsCount) == 0x000000, "Member 'WBP_SelectionDetails_Upgrades_C_RefreshFrame::Local_CommandsCount' has a wrong offset!");
static_assert(offsetof(WBP_SelectionDetails_Upgrades_C_RefreshFrame, CallFunc_HasContent_ReturnValue) == 0x000004, "Member 'WBP_SelectionDetails_Upgrades_C_RefreshFrame::CallFunc_HasContent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SelectionDetails_Upgrades_C_RefreshFrame, CallFunc_GetContentSlotsCountByState_ReturnValue) == 0x000008, "Member 'WBP_SelectionDetails_Upgrades_C_RefreshFrame::CallFunc_GetContentSlotsCountByState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SelectionDetails_Upgrades_C_RefreshFrame, CallFunc_GetContentSlotsCount_ReturnValue) == 0x00000C, "Member 'WBP_SelectionDetails_Upgrades_C_RefreshFrame::CallFunc_GetContentSlotsCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SelectionDetails_Upgrades_C_RefreshFrame, CallFunc_Subtract_IntInt_ReturnValue) == 0x000010, "Member 'WBP_SelectionDetails_Upgrades_C_RefreshFrame::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SelectionDetails_Upgrades_C_RefreshFrame, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000014, "Member 'WBP_SelectionDetails_Upgrades_C_RefreshFrame::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");

}

