#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SelectionDetails_InfoSlots_Defense_Resistances_Panel

#include "Basic.hpp"

#include "Tempest_structs.hpp"


namespace SDK::Params
{

// Function WBP_SelectionDetails_InfoSlots_Defense_Resistances_Panel.WBP_SelectionDetails_InfoSlots_Defense_Resistances_Panel_C.OnRegisterContentSlot
// 0x0038 (0x0038 - 0x0000)
struct WBP_SelectionDetails_InfoSlots_Defense_Resistances_Panel_C_OnRegisterContentSlot final
{
public:
	class UTedContentPanelSlotBase*               InContentSlot;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ETedContentPanelRegistration                  InMode;                                            // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Local_Columns;                                     // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Local_SlotIndex;                                   // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGridSlot*                              Local_Slot;                                        // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSlotIndex_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGridSlot*                              CallFunc_SlotAsGridSlot_ReturnValue;               // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SelectionDetails_InfoSlots_Defense_Resistances_Panel_C_OnRegisterContentSlot) == 0x000008, "Wrong alignment on WBP_SelectionDetails_InfoSlots_Defense_Resistances_Panel_C_OnRegisterContentSlot");
static_assert(sizeof(WBP_SelectionDetails_InfoSlots_Defense_Resistances_Panel_C_OnRegisterContentSlot) == 0x000038, "Wrong size on WBP_SelectionDetails_InfoSlots_Defense_Resistances_Panel_C_OnRegisterContentSlot");
static_assert(offsetof(WBP_SelectionDetails_InfoSlots_Defense_Resistances_Panel_C_OnRegisterContentSlot, InContentSlot) == 0x000000, "Member 'WBP_SelectionDetails_InfoSlots_Defense_Resistances_Panel_C_OnRegisterContentSlot::InContentSlot' has a wrong offset!");
static_assert(offsetof(WBP_SelectionDetails_InfoSlots_Defense_Resistances_Panel_C_OnRegisterContentSlot, InMode) == 0x000008, "Member 'WBP_SelectionDetails_InfoSlots_Defense_Resistances_Panel_C_OnRegisterContentSlot::InMode' has a wrong offset!");
static_assert(offsetof(WBP_SelectionDetails_InfoSlots_Defense_Resistances_Panel_C_OnRegisterContentSlot, Local_Columns) == 0x00000C, "Member 'WBP_SelectionDetails_InfoSlots_Defense_Resistances_Panel_C_OnRegisterContentSlot::Local_Columns' has a wrong offset!");
static_assert(offsetof(WBP_SelectionDetails_InfoSlots_Defense_Resistances_Panel_C_OnRegisterContentSlot, Local_SlotIndex) == 0x000010, "Member 'WBP_SelectionDetails_InfoSlots_Defense_Resistances_Panel_C_OnRegisterContentSlot::Local_SlotIndex' has a wrong offset!");
static_assert(offsetof(WBP_SelectionDetails_InfoSlots_Defense_Resistances_Panel_C_OnRegisterContentSlot, Local_Slot) == 0x000018, "Member 'WBP_SelectionDetails_InfoSlots_Defense_Resistances_Panel_C_OnRegisterContentSlot::Local_Slot' has a wrong offset!");
static_assert(offsetof(WBP_SelectionDetails_InfoSlots_Defense_Resistances_Panel_C_OnRegisterContentSlot, CallFunc_Divide_IntInt_ReturnValue) == 0x000020, "Member 'WBP_SelectionDetails_InfoSlots_Defense_Resistances_Panel_C_OnRegisterContentSlot::CallFunc_Divide_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SelectionDetails_InfoSlots_Defense_Resistances_Panel_C_OnRegisterContentSlot, CallFunc_Percent_IntInt_ReturnValue) == 0x000024, "Member 'WBP_SelectionDetails_InfoSlots_Defense_Resistances_Panel_C_OnRegisterContentSlot::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SelectionDetails_InfoSlots_Defense_Resistances_Panel_C_OnRegisterContentSlot, CallFunc_GetSlotIndex_ReturnValue) == 0x000028, "Member 'WBP_SelectionDetails_InfoSlots_Defense_Resistances_Panel_C_OnRegisterContentSlot::CallFunc_GetSlotIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SelectionDetails_InfoSlots_Defense_Resistances_Panel_C_OnRegisterContentSlot, CallFunc_SlotAsGridSlot_ReturnValue) == 0x000030, "Member 'WBP_SelectionDetails_InfoSlots_Defense_Resistances_Panel_C_OnRegisterContentSlot::CallFunc_SlotAsGridSlot_ReturnValue' has a wrong offset!");

}

