#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SpecialistsCard_Button

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_SpecialistsCard_Button.WBP_SpecialistsCard_Button_C.ExecuteUbergraph_WBP_SpecialistsCard_Button
// 0x0198 (0x0198 - 0x0000)
struct WBP_SpecialistsCard_Button_C_ExecuteUbergraph_WBP_SpecialistsCard_Button final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_SetVisible;                     // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHovered_ReturnValue;                    // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_OldValue;                             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_NewValue;                             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATedPawn*                               K2Node_Event_WorkerPawn;                           // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0024(0x0038)(IsPlainOldData, NoDestructor)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerEvent                          K2Node_Event_MouseEvent_1;                         // 0x0060(0x0078)(ConstParm)
	struct FPointerEvent                          K2Node_Event_MouseEvent;                           // 0x00D8(0x0078)(ConstParm)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0158(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetHealthMax_ReturnValue;                 // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetHealth_ReturnValue;                    // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_B_ImplicitCast;      // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_B_ImplicitCast;       // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_A_ImplicitCast;       // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SpecialistsCard_Button_C_ExecuteUbergraph_WBP_SpecialistsCard_Button) == 0x000008, "Wrong alignment on WBP_SpecialistsCard_Button_C_ExecuteUbergraph_WBP_SpecialistsCard_Button");
static_assert(sizeof(WBP_SpecialistsCard_Button_C_ExecuteUbergraph_WBP_SpecialistsCard_Button) == 0x000198, "Wrong size on WBP_SpecialistsCard_Button_C_ExecuteUbergraph_WBP_SpecialistsCard_Button");
static_assert(offsetof(WBP_SpecialistsCard_Button_C_ExecuteUbergraph_WBP_SpecialistsCard_Button, EntryPoint) == 0x000000, "Member 'WBP_SpecialistsCard_Button_C_ExecuteUbergraph_WBP_SpecialistsCard_Button::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_SpecialistsCard_Button_C_ExecuteUbergraph_WBP_SpecialistsCard_Button, K2Node_CustomEvent_SetVisible) == 0x000004, "Member 'WBP_SpecialistsCard_Button_C_ExecuteUbergraph_WBP_SpecialistsCard_Button::K2Node_CustomEvent_SetVisible' has a wrong offset!");
static_assert(offsetof(WBP_SpecialistsCard_Button_C_ExecuteUbergraph_WBP_SpecialistsCard_Button, CallFunc_IsHovered_ReturnValue) == 0x000005, "Member 'WBP_SpecialistsCard_Button_C_ExecuteUbergraph_WBP_SpecialistsCard_Button::CallFunc_IsHovered_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SpecialistsCard_Button_C_ExecuteUbergraph_WBP_SpecialistsCard_Button, K2Node_Event_OldValue) == 0x000008, "Member 'WBP_SpecialistsCard_Button_C_ExecuteUbergraph_WBP_SpecialistsCard_Button::K2Node_Event_OldValue' has a wrong offset!");
static_assert(offsetof(WBP_SpecialistsCard_Button_C_ExecuteUbergraph_WBP_SpecialistsCard_Button, K2Node_Event_NewValue) == 0x00000C, "Member 'WBP_SpecialistsCard_Button_C_ExecuteUbergraph_WBP_SpecialistsCard_Button::K2Node_Event_NewValue' has a wrong offset!");
static_assert(offsetof(WBP_SpecialistsCard_Button_C_ExecuteUbergraph_WBP_SpecialistsCard_Button, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000010, "Member 'WBP_SpecialistsCard_Button_C_ExecuteUbergraph_WBP_SpecialistsCard_Button::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SpecialistsCard_Button_C_ExecuteUbergraph_WBP_SpecialistsCard_Button, K2Node_Event_WorkerPawn) == 0x000018, "Member 'WBP_SpecialistsCard_Button_C_ExecuteUbergraph_WBP_SpecialistsCard_Button::K2Node_Event_WorkerPawn' has a wrong offset!");
static_assert(offsetof(WBP_SpecialistsCard_Button_C_ExecuteUbergraph_WBP_SpecialistsCard_Button, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'WBP_SpecialistsCard_Button_C_ExecuteUbergraph_WBP_SpecialistsCard_Button::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SpecialistsCard_Button_C_ExecuteUbergraph_WBP_SpecialistsCard_Button, K2Node_Event_MyGeometry) == 0x000024, "Member 'WBP_SpecialistsCard_Button_C_ExecuteUbergraph_WBP_SpecialistsCard_Button::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_SpecialistsCard_Button_C_ExecuteUbergraph_WBP_SpecialistsCard_Button, K2Node_Event_MouseEvent_1) == 0x000060, "Member 'WBP_SpecialistsCard_Button_C_ExecuteUbergraph_WBP_SpecialistsCard_Button::K2Node_Event_MouseEvent_1' has a wrong offset!");
static_assert(offsetof(WBP_SpecialistsCard_Button_C_ExecuteUbergraph_WBP_SpecialistsCard_Button, K2Node_Event_MouseEvent) == 0x0000D8, "Member 'WBP_SpecialistsCard_Button_C_ExecuteUbergraph_WBP_SpecialistsCard_Button::K2Node_Event_MouseEvent' has a wrong offset!");
static_assert(offsetof(WBP_SpecialistsCard_Button_C_ExecuteUbergraph_WBP_SpecialistsCard_Button, CallFunc_IsValid_ReturnValue_1) == 0x000150, "Member 'WBP_SpecialistsCard_Button_C_ExecuteUbergraph_WBP_SpecialistsCard_Button::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_SpecialistsCard_Button_C_ExecuteUbergraph_WBP_SpecialistsCard_Button, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000158, "Member 'WBP_SpecialistsCard_Button_C_ExecuteUbergraph_WBP_SpecialistsCard_Button::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SpecialistsCard_Button_C_ExecuteUbergraph_WBP_SpecialistsCard_Button, CallFunc_GetHealthMax_ReturnValue) == 0x000160, "Member 'WBP_SpecialistsCard_Button_C_ExecuteUbergraph_WBP_SpecialistsCard_Button::CallFunc_GetHealthMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SpecialistsCard_Button_C_ExecuteUbergraph_WBP_SpecialistsCard_Button, CallFunc_GetHealth_ReturnValue) == 0x000164, "Member 'WBP_SpecialistsCard_Button_C_ExecuteUbergraph_WBP_SpecialistsCard_Button::CallFunc_GetHealth_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SpecialistsCard_Button_C_ExecuteUbergraph_WBP_SpecialistsCard_Button, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000168, "Member 'WBP_SpecialistsCard_Button_C_ExecuteUbergraph_WBP_SpecialistsCard_Button::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SpecialistsCard_Button_C_ExecuteUbergraph_WBP_SpecialistsCard_Button, CallFunc_Greater_DoubleDouble_A_ImplicitCast) == 0x000170, "Member 'WBP_SpecialistsCard_Button_C_ExecuteUbergraph_WBP_SpecialistsCard_Button::CallFunc_Greater_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_SpecialistsCard_Button_C_ExecuteUbergraph_WBP_SpecialistsCard_Button, CallFunc_Greater_DoubleDouble_B_ImplicitCast) == 0x000178, "Member 'WBP_SpecialistsCard_Button_C_ExecuteUbergraph_WBP_SpecialistsCard_Button::CallFunc_Greater_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_SpecialistsCard_Button_C_ExecuteUbergraph_WBP_SpecialistsCard_Button, CallFunc_Divide_DoubleDouble_B_ImplicitCast) == 0x000180, "Member 'WBP_SpecialistsCard_Button_C_ExecuteUbergraph_WBP_SpecialistsCard_Button::CallFunc_Divide_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_SpecialistsCard_Button_C_ExecuteUbergraph_WBP_SpecialistsCard_Button, CallFunc_Divide_DoubleDouble_A_ImplicitCast) == 0x000188, "Member 'WBP_SpecialistsCard_Button_C_ExecuteUbergraph_WBP_SpecialistsCard_Button::CallFunc_Divide_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_SpecialistsCard_Button_C_ExecuteUbergraph_WBP_SpecialistsCard_Button, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000190, "Member 'WBP_SpecialistsCard_Button_C_ExecuteUbergraph_WBP_SpecialistsCard_Button::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");

// Function WBP_SpecialistsCard_Button.WBP_SpecialistsCard_Button_C.K2_OnSingleWorkerHealthChanged
// 0x0008 (0x0008 - 0x0000)
struct WBP_SpecialistsCard_Button_C_K2_OnSingleWorkerHealthChanged final
{
public:
	float                                         OldValue;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         NewValue;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SpecialistsCard_Button_C_K2_OnSingleWorkerHealthChanged) == 0x000004, "Wrong alignment on WBP_SpecialistsCard_Button_C_K2_OnSingleWorkerHealthChanged");
static_assert(sizeof(WBP_SpecialistsCard_Button_C_K2_OnSingleWorkerHealthChanged) == 0x000008, "Wrong size on WBP_SpecialistsCard_Button_C_K2_OnSingleWorkerHealthChanged");
static_assert(offsetof(WBP_SpecialistsCard_Button_C_K2_OnSingleWorkerHealthChanged, OldValue) == 0x000000, "Member 'WBP_SpecialistsCard_Button_C_K2_OnSingleWorkerHealthChanged::OldValue' has a wrong offset!");
static_assert(offsetof(WBP_SpecialistsCard_Button_C_K2_OnSingleWorkerHealthChanged, NewValue) == 0x000004, "Member 'WBP_SpecialistsCard_Button_C_K2_OnSingleWorkerHealthChanged::NewValue' has a wrong offset!");

// Function WBP_SpecialistsCard_Button.WBP_SpecialistsCard_Button_C.OnMouseEnter
// 0x00B0 (0x00B0 - 0x0000)
struct WBP_SpecialistsCard_Button_C_OnMouseEnter final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_SpecialistsCard_Button_C_OnMouseEnter) == 0x000008, "Wrong alignment on WBP_SpecialistsCard_Button_C_OnMouseEnter");
static_assert(sizeof(WBP_SpecialistsCard_Button_C_OnMouseEnter) == 0x0000B0, "Wrong size on WBP_SpecialistsCard_Button_C_OnMouseEnter");
static_assert(offsetof(WBP_SpecialistsCard_Button_C_OnMouseEnter, MyGeometry) == 0x000000, "Member 'WBP_SpecialistsCard_Button_C_OnMouseEnter::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_SpecialistsCard_Button_C_OnMouseEnter, MouseEvent) == 0x000038, "Member 'WBP_SpecialistsCard_Button_C_OnMouseEnter::MouseEvent' has a wrong offset!");

// Function WBP_SpecialistsCard_Button.WBP_SpecialistsCard_Button_C.OnMouseLeave
// 0x0078 (0x0078 - 0x0000)
struct WBP_SpecialistsCard_Button_C_OnMouseLeave final
{
public:
	struct FPointerEvent                          MouseEvent;                                        // 0x0000(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_SpecialistsCard_Button_C_OnMouseLeave) == 0x000008, "Wrong alignment on WBP_SpecialistsCard_Button_C_OnMouseLeave");
static_assert(sizeof(WBP_SpecialistsCard_Button_C_OnMouseLeave) == 0x000078, "Wrong size on WBP_SpecialistsCard_Button_C_OnMouseLeave");
static_assert(offsetof(WBP_SpecialistsCard_Button_C_OnMouseLeave, MouseEvent) == 0x000000, "Member 'WBP_SpecialistsCard_Button_C_OnMouseLeave::MouseEvent' has a wrong offset!");

// Function WBP_SpecialistsCard_Button.WBP_SpecialistsCard_Button_C.SetWorkerData
// 0x0008 (0x0008 - 0x0000)
struct WBP_SpecialistsCard_Button_C_SetWorkerData final
{
public:
	class ATedPawn*                               WorkerPawn_0;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SpecialistsCard_Button_C_SetWorkerData) == 0x000008, "Wrong alignment on WBP_SpecialistsCard_Button_C_SetWorkerData");
static_assert(sizeof(WBP_SpecialistsCard_Button_C_SetWorkerData) == 0x000008, "Wrong size on WBP_SpecialistsCard_Button_C_SetWorkerData");
static_assert(offsetof(WBP_SpecialistsCard_Button_C_SetWorkerData, WorkerPawn_0) == 0x000000, "Member 'WBP_SpecialistsCard_Button_C_SetWorkerData::WorkerPawn_0' has a wrong offset!");

// Function WBP_SpecialistsCard_Button.WBP_SpecialistsCard_Button_C.UpdateHealthBar
// 0x0001 (0x0001 - 0x0000)
struct WBP_SpecialistsCard_Button_C_UpdateHealthBar final
{
public:
	bool                                          SetVisible;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SpecialistsCard_Button_C_UpdateHealthBar) == 0x000001, "Wrong alignment on WBP_SpecialistsCard_Button_C_UpdateHealthBar");
static_assert(sizeof(WBP_SpecialistsCard_Button_C_UpdateHealthBar) == 0x000001, "Wrong size on WBP_SpecialistsCard_Button_C_UpdateHealthBar");
static_assert(offsetof(WBP_SpecialistsCard_Button_C_UpdateHealthBar, SetVisible) == 0x000000, "Member 'WBP_SpecialistsCard_Button_C_UpdateHealthBar::SetVisible' has a wrong offset!");

// Function WBP_SpecialistsCard_Button.WBP_SpecialistsCard_Button_C.UpdateIcon
// 0x0050 (0x0050 - 0x0000)
struct WBP_SpecialistsCard_Button_C_UpdateIcon final
{
public:
	bool                                          bHasCommando;                                      // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bHasSpecialist;                                    // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ATedPlayerController*                   K2Node_DynamicCast_AsTed_Player_Controller;        // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTedPlayerData*                         CallFunc_GetPlayerData_ReturnValue;                // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class ATedUnitBase*>                   CallFunc_GetSpecialistRefs_OutSpecialistRefs;      // 0x0028(0x0010)(ReferenceParm)
	TArray<class ATedUnitBase*>                   CallFunc_GetCommandoRefs_OutCommandoRefs;          // 0x0038(0x0010)(ReferenceParm)
	bool                                          CallFunc_Array_IsNotEmpty_ReturnValue;             // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsNotEmpty_ReturnValue_1;           // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x004B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SpecialistsCard_Button_C_UpdateIcon) == 0x000008, "Wrong alignment on WBP_SpecialistsCard_Button_C_UpdateIcon");
static_assert(sizeof(WBP_SpecialistsCard_Button_C_UpdateIcon) == 0x000050, "Wrong size on WBP_SpecialistsCard_Button_C_UpdateIcon");
static_assert(offsetof(WBP_SpecialistsCard_Button_C_UpdateIcon, bHasCommando) == 0x000000, "Member 'WBP_SpecialistsCard_Button_C_UpdateIcon::bHasCommando' has a wrong offset!");
static_assert(offsetof(WBP_SpecialistsCard_Button_C_UpdateIcon, bHasSpecialist) == 0x000001, "Member 'WBP_SpecialistsCard_Button_C_UpdateIcon::bHasSpecialist' has a wrong offset!");
static_assert(offsetof(WBP_SpecialistsCard_Button_C_UpdateIcon, CallFunc_GetOwningPlayer_ReturnValue) == 0x000008, "Member 'WBP_SpecialistsCard_Button_C_UpdateIcon::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SpecialistsCard_Button_C_UpdateIcon, K2Node_DynamicCast_AsTed_Player_Controller) == 0x000010, "Member 'WBP_SpecialistsCard_Button_C_UpdateIcon::K2Node_DynamicCast_AsTed_Player_Controller' has a wrong offset!");
static_assert(offsetof(WBP_SpecialistsCard_Button_C_UpdateIcon, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WBP_SpecialistsCard_Button_C_UpdateIcon::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_SpecialistsCard_Button_C_UpdateIcon, CallFunc_GetPlayerData_ReturnValue) == 0x000020, "Member 'WBP_SpecialistsCard_Button_C_UpdateIcon::CallFunc_GetPlayerData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SpecialistsCard_Button_C_UpdateIcon, CallFunc_GetSpecialistRefs_OutSpecialistRefs) == 0x000028, "Member 'WBP_SpecialistsCard_Button_C_UpdateIcon::CallFunc_GetSpecialistRefs_OutSpecialistRefs' has a wrong offset!");
static_assert(offsetof(WBP_SpecialistsCard_Button_C_UpdateIcon, CallFunc_GetCommandoRefs_OutCommandoRefs) == 0x000038, "Member 'WBP_SpecialistsCard_Button_C_UpdateIcon::CallFunc_GetCommandoRefs_OutCommandoRefs' has a wrong offset!");
static_assert(offsetof(WBP_SpecialistsCard_Button_C_UpdateIcon, CallFunc_Array_IsNotEmpty_ReturnValue) == 0x000048, "Member 'WBP_SpecialistsCard_Button_C_UpdateIcon::CallFunc_Array_IsNotEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SpecialistsCard_Button_C_UpdateIcon, CallFunc_Array_IsNotEmpty_ReturnValue_1) == 0x000049, "Member 'WBP_SpecialistsCard_Button_C_UpdateIcon::CallFunc_Array_IsNotEmpty_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_SpecialistsCard_Button_C_UpdateIcon, CallFunc_IsValid_ReturnValue) == 0x00004A, "Member 'WBP_SpecialistsCard_Button_C_UpdateIcon::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SpecialistsCard_Button_C_UpdateIcon, CallFunc_BooleanAND_ReturnValue) == 0x00004B, "Member 'WBP_SpecialistsCard_Button_C_UpdateIcon::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

}

