#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SelectionDetails_InfoSlots

#include "Basic.hpp"

#include "Tempest_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_SelectionDetails_InfoSlots.WBP_SelectionDetails_InfoSlots_C
// 0x0018 (0x0770 - 0x0758)
class UWBP_SelectionDetails_InfoSlots_C final : public UTedContentPanelStatic
{
public:
	class UWBP_SelectionDetails_InfoSlots_Defense_Slot_C* Slot_Defense;                              // 0x0758(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SelectionDetails_InfoSlots_Perks_Slot_C* Slot_PassiveAbilities;                       // 0x0760(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SelectionDetails_InfoSlots_Attack_Slot_C* Slot_Weapons;                               // 0x0768(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_SelectionDetails_InfoSlots_C">();
	}
	static class UWBP_SelectionDetails_InfoSlots_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_SelectionDetails_InfoSlots_C>();
	}
};
static_assert(alignof(UWBP_SelectionDetails_InfoSlots_C) == 0x000008, "Wrong alignment on UWBP_SelectionDetails_InfoSlots_C");
static_assert(sizeof(UWBP_SelectionDetails_InfoSlots_C) == 0x000770, "Wrong size on UWBP_SelectionDetails_InfoSlots_C");
static_assert(offsetof(UWBP_SelectionDetails_InfoSlots_C, Slot_Defense) == 0x000758, "Member 'UWBP_SelectionDetails_InfoSlots_C::Slot_Defense' has a wrong offset!");
static_assert(offsetof(UWBP_SelectionDetails_InfoSlots_C, Slot_PassiveAbilities) == 0x000760, "Member 'UWBP_SelectionDetails_InfoSlots_C::Slot_PassiveAbilities' has a wrong offset!");
static_assert(offsetof(UWBP_SelectionDetails_InfoSlots_C, Slot_Weapons) == 0x000768, "Member 'UWBP_SelectionDetails_InfoSlots_C::Slot_Weapons' has a wrong offset!");

}

