#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MissionClock

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Tempest_structs.hpp"
#include "Tempest_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_MissionClock.WBP_MissionClock_C
// 0x00A8 (0x05C0 - 0x0518)
class UWBP_MissionClock_C final : public UTedMissionClock
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0518(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ShowAnimClock;                                     // 0x0520(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UTedImage*                              DigitImage_Colon;                                  // 0x0528(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTedImage*                              DigitImage_L1;                                     // 0x0530(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTedImage*                              DigitImage_L2;                                     // 0x0538(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTedImage*                              DigitImage_R1;                                     // 0x0540(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTedImage*                              DigitImage_R2;                                     // 0x0548(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MoviePlayer_Fill_C*                MovieAnimPlayer_Center;                            // 0x0550(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Content;                                   // 0x0558(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FTedThemeMovie                         InitMovies;                                        // 0x0560(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UMaterialInterface*>             Digits;                                            // 0x05B0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void DisplayCentralTimerNotification(const struct FTimespan& InTime);
	void ExecuteUbergraph_WBP_MissionClock(int32 EntryPoint);
	void GetDigitBrush(int32 Digit, struct FSlateBrush* NewBrush);
	void RefreshUI();
	void SequenceEvent__ENTRYPOINTWBP_MissionClock();
	void StartFrameVid();
	void UpdateDigits(const struct FTimespan& Time_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_MissionClock_C">();
	}
	static class UWBP_MissionClock_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_MissionClock_C>();
	}
};
static_assert(alignof(UWBP_MissionClock_C) == 0x000008, "Wrong alignment on UWBP_MissionClock_C");
static_assert(sizeof(UWBP_MissionClock_C) == 0x0005C0, "Wrong size on UWBP_MissionClock_C");
static_assert(offsetof(UWBP_MissionClock_C, UberGraphFrame) == 0x000518, "Member 'UWBP_MissionClock_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_MissionClock_C, ShowAnimClock) == 0x000520, "Member 'UWBP_MissionClock_C::ShowAnimClock' has a wrong offset!");
static_assert(offsetof(UWBP_MissionClock_C, DigitImage_Colon) == 0x000528, "Member 'UWBP_MissionClock_C::DigitImage_Colon' has a wrong offset!");
static_assert(offsetof(UWBP_MissionClock_C, DigitImage_L1) == 0x000530, "Member 'UWBP_MissionClock_C::DigitImage_L1' has a wrong offset!");
static_assert(offsetof(UWBP_MissionClock_C, DigitImage_L2) == 0x000538, "Member 'UWBP_MissionClock_C::DigitImage_L2' has a wrong offset!");
static_assert(offsetof(UWBP_MissionClock_C, DigitImage_R1) == 0x000540, "Member 'UWBP_MissionClock_C::DigitImage_R1' has a wrong offset!");
static_assert(offsetof(UWBP_MissionClock_C, DigitImage_R2) == 0x000548, "Member 'UWBP_MissionClock_C::DigitImage_R2' has a wrong offset!");
static_assert(offsetof(UWBP_MissionClock_C, MovieAnimPlayer_Center) == 0x000550, "Member 'UWBP_MissionClock_C::MovieAnimPlayer_Center' has a wrong offset!");
static_assert(offsetof(UWBP_MissionClock_C, Overlay_Content) == 0x000558, "Member 'UWBP_MissionClock_C::Overlay_Content' has a wrong offset!");
static_assert(offsetof(UWBP_MissionClock_C, InitMovies) == 0x000560, "Member 'UWBP_MissionClock_C::InitMovies' has a wrong offset!");
static_assert(offsetof(UWBP_MissionClock_C, Digits) == 0x0005B0, "Member 'UWBP_MissionClock_C::Digits' has a wrong offset!");

}

