#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_HUD_GenericTooltip_Minimal

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_HUD_GenericTooltip_Minimal.WBP_HUD_GenericTooltip_Minimal_C.SetupTextBlock
// 0x0020 (0x0020 - 0x0000)
struct WBP_HUD_GenericTooltip_Minimal_C_SetupTextBlock final
{
public:
	class UTextBlock*                             InTextBlock;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   InText;                                            // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          Temp_bool_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_GenericTooltip_Minimal_C_SetupTextBlock) == 0x000008, "Wrong alignment on WBP_HUD_GenericTooltip_Minimal_C_SetupTextBlock");
static_assert(sizeof(WBP_HUD_GenericTooltip_Minimal_C_SetupTextBlock) == 0x000020, "Wrong size on WBP_HUD_GenericTooltip_Minimal_C_SetupTextBlock");
static_assert(offsetof(WBP_HUD_GenericTooltip_Minimal_C_SetupTextBlock, InTextBlock) == 0x000000, "Member 'WBP_HUD_GenericTooltip_Minimal_C_SetupTextBlock::InTextBlock' has a wrong offset!");
static_assert(offsetof(WBP_HUD_GenericTooltip_Minimal_C_SetupTextBlock, InText) == 0x000008, "Member 'WBP_HUD_GenericTooltip_Minimal_C_SetupTextBlock::InText' has a wrong offset!");
static_assert(offsetof(WBP_HUD_GenericTooltip_Minimal_C_SetupTextBlock, Temp_bool_Variable) == 0x000018, "Member 'WBP_HUD_GenericTooltip_Minimal_C_SetupTextBlock::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_HUD_GenericTooltip_Minimal_C_SetupTextBlock, CallFunc_TextIsEmpty_ReturnValue) == 0x000019, "Member 'WBP_HUD_GenericTooltip_Minimal_C_SetupTextBlock::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_GenericTooltip_Minimal_C_SetupTextBlock, Temp_byte_Variable) == 0x00001A, "Member 'WBP_HUD_GenericTooltip_Minimal_C_SetupTextBlock::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_HUD_GenericTooltip_Minimal_C_SetupTextBlock, Temp_byte_Variable_1) == 0x00001B, "Member 'WBP_HUD_GenericTooltip_Minimal_C_SetupTextBlock::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_HUD_GenericTooltip_Minimal_C_SetupTextBlock, K2Node_Select_Default) == 0x00001C, "Member 'WBP_HUD_GenericTooltip_Minimal_C_SetupTextBlock::K2Node_Select_Default' has a wrong offset!");

// Function WBP_HUD_GenericTooltip_Minimal.WBP_HUD_GenericTooltip_Minimal_C.ExecuteUbergraph_WBP_HUD_GenericTooltip_Minimal
// 0x0004 (0x0004 - 0x0000)
struct WBP_HUD_GenericTooltip_Minimal_C_ExecuteUbergraph_WBP_HUD_GenericTooltip_Minimal final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_GenericTooltip_Minimal_C_ExecuteUbergraph_WBP_HUD_GenericTooltip_Minimal) == 0x000004, "Wrong alignment on WBP_HUD_GenericTooltip_Minimal_C_ExecuteUbergraph_WBP_HUD_GenericTooltip_Minimal");
static_assert(sizeof(WBP_HUD_GenericTooltip_Minimal_C_ExecuteUbergraph_WBP_HUD_GenericTooltip_Minimal) == 0x000004, "Wrong size on WBP_HUD_GenericTooltip_Minimal_C_ExecuteUbergraph_WBP_HUD_GenericTooltip_Minimal");
static_assert(offsetof(WBP_HUD_GenericTooltip_Minimal_C_ExecuteUbergraph_WBP_HUD_GenericTooltip_Minimal, EntryPoint) == 0x000000, "Member 'WBP_HUD_GenericTooltip_Minimal_C_ExecuteUbergraph_WBP_HUD_GenericTooltip_Minimal::EntryPoint' has a wrong offset!");

}

