#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_HarvestersCard_Button

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Tempest_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_HarvestersCard_Button.WBP_HarvestersCard_Button_C
// 0x0038 (0x0470 - 0x0438)
class UWBP_HarvestersCard_Button_C final : public UTedWorkerButton_TempestWorkers
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0438(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_BG;                                          // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_CapacityBar;                                 // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_HealthBar;                                   // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Widget_DamageIcon;                                 // 0x0458(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Widget_IdleIcon;                                   // 0x0460(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ATedPawn*                               WorkerPawn;                                        // 0x0468(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_HarvestersCard_Button(int32 EntryPoint);
	void K2_OnSingleWorkerHealthChanged(float OldValue, float NewValue);
	void OnInitialized();
	void OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void OnMouseLeave(const struct FPointerEvent& MouseEvent);
	void OnUpdateIdleState(bool NewIdleState);
	void SetWorkerData(class ATedPawn* WorkerPawn_0);
	void ShowDamageIconOnButton();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void UpdateHealthBar(bool SetVisible);
	void UpdateWheels(bool SetVisible, class ATedStructureRefinery_DYN_V2* Refinery);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_HarvestersCard_Button_C">();
	}
	static class UWBP_HarvestersCard_Button_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_HarvestersCard_Button_C>();
	}
};
static_assert(alignof(UWBP_HarvestersCard_Button_C) == 0x000008, "Wrong alignment on UWBP_HarvestersCard_Button_C");
static_assert(sizeof(UWBP_HarvestersCard_Button_C) == 0x000470, "Wrong size on UWBP_HarvestersCard_Button_C");
static_assert(offsetof(UWBP_HarvestersCard_Button_C, UberGraphFrame) == 0x000438, "Member 'UWBP_HarvestersCard_Button_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_HarvestersCard_Button_C, Image_BG) == 0x000440, "Member 'UWBP_HarvestersCard_Button_C::Image_BG' has a wrong offset!");
static_assert(offsetof(UWBP_HarvestersCard_Button_C, Image_CapacityBar) == 0x000448, "Member 'UWBP_HarvestersCard_Button_C::Image_CapacityBar' has a wrong offset!");
static_assert(offsetof(UWBP_HarvestersCard_Button_C, Image_HealthBar) == 0x000450, "Member 'UWBP_HarvestersCard_Button_C::Image_HealthBar' has a wrong offset!");
static_assert(offsetof(UWBP_HarvestersCard_Button_C, Widget_DamageIcon) == 0x000458, "Member 'UWBP_HarvestersCard_Button_C::Widget_DamageIcon' has a wrong offset!");
static_assert(offsetof(UWBP_HarvestersCard_Button_C, Widget_IdleIcon) == 0x000460, "Member 'UWBP_HarvestersCard_Button_C::Widget_IdleIcon' has a wrong offset!");
static_assert(offsetof(UWBP_HarvestersCard_Button_C, WorkerPawn) == 0x000468, "Member 'UWBP_HarvestersCard_Button_C::WorkerPawn' has a wrong offset!");

}

