#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ScoreScreen_SP

#include "Basic.hpp"

#include "Tempest_structs.hpp"


namespace SDK::Params
{

// Function WBP_ScoreScreen_SP.WBP_ScoreScreen_SP_C.BndEvt__WBP_ScoreScreen_SP_DataIntroAnim_K2Node_ComponentBoundEvent_0_TedMoviePlayerWidgetEventDelegate__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_ScoreScreen_SP_C_BndEvt__WBP_ScoreScreen_SP_DataIntroAnim_K2Node_ComponentBoundEvent_0_TedMoviePlayerWidgetEventDelegate__DelegateSignature final
{
public:
	class UTedMoviePlayerWidgetV2*                InWidget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	const class UFileMediaSource*                 InSource;                                          // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ScoreScreen_SP_C_BndEvt__WBP_ScoreScreen_SP_DataIntroAnim_K2Node_ComponentBoundEvent_0_TedMoviePlayerWidgetEventDelegate__DelegateSignature) == 0x000008, "Wrong alignment on WBP_ScoreScreen_SP_C_BndEvt__WBP_ScoreScreen_SP_DataIntroAnim_K2Node_ComponentBoundEvent_0_TedMoviePlayerWidgetEventDelegate__DelegateSignature");
static_assert(sizeof(WBP_ScoreScreen_SP_C_BndEvt__WBP_ScoreScreen_SP_DataIntroAnim_K2Node_ComponentBoundEvent_0_TedMoviePlayerWidgetEventDelegate__DelegateSignature) == 0x000010, "Wrong size on WBP_ScoreScreen_SP_C_BndEvt__WBP_ScoreScreen_SP_DataIntroAnim_K2Node_ComponentBoundEvent_0_TedMoviePlayerWidgetEventDelegate__DelegateSignature");
static_assert(offsetof(WBP_ScoreScreen_SP_C_BndEvt__WBP_ScoreScreen_SP_DataIntroAnim_K2Node_ComponentBoundEvent_0_TedMoviePlayerWidgetEventDelegate__DelegateSignature, InWidget) == 0x000000, "Member 'WBP_ScoreScreen_SP_C_BndEvt__WBP_ScoreScreen_SP_DataIntroAnim_K2Node_ComponentBoundEvent_0_TedMoviePlayerWidgetEventDelegate__DelegateSignature::InWidget' has a wrong offset!");
static_assert(offsetof(WBP_ScoreScreen_SP_C_BndEvt__WBP_ScoreScreen_SP_DataIntroAnim_K2Node_ComponentBoundEvent_0_TedMoviePlayerWidgetEventDelegate__DelegateSignature, InSource) == 0x000008, "Member 'WBP_ScoreScreen_SP_C_BndEvt__WBP_ScoreScreen_SP_DataIntroAnim_K2Node_ComponentBoundEvent_0_TedMoviePlayerWidgetEventDelegate__DelegateSignature::InSource' has a wrong offset!");

// Function WBP_ScoreScreen_SP.WBP_ScoreScreen_SP_C.BndEvt__WBP_ScoreScreen_SP_LogoAnim_K2Node_ComponentBoundEvent_4_TedMoviePlayerWidgetEventDelegate__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_ScoreScreen_SP_C_BndEvt__WBP_ScoreScreen_SP_LogoAnim_K2Node_ComponentBoundEvent_4_TedMoviePlayerWidgetEventDelegate__DelegateSignature final
{
public:
	class UTedMoviePlayerWidgetV2*                InWidget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	const class UFileMediaSource*                 InSource;                                          // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ScoreScreen_SP_C_BndEvt__WBP_ScoreScreen_SP_LogoAnim_K2Node_ComponentBoundEvent_4_TedMoviePlayerWidgetEventDelegate__DelegateSignature) == 0x000008, "Wrong alignment on WBP_ScoreScreen_SP_C_BndEvt__WBP_ScoreScreen_SP_LogoAnim_K2Node_ComponentBoundEvent_4_TedMoviePlayerWidgetEventDelegate__DelegateSignature");
static_assert(sizeof(WBP_ScoreScreen_SP_C_BndEvt__WBP_ScoreScreen_SP_LogoAnim_K2Node_ComponentBoundEvent_4_TedMoviePlayerWidgetEventDelegate__DelegateSignature) == 0x000010, "Wrong size on WBP_ScoreScreen_SP_C_BndEvt__WBP_ScoreScreen_SP_LogoAnim_K2Node_ComponentBoundEvent_4_TedMoviePlayerWidgetEventDelegate__DelegateSignature");
static_assert(offsetof(WBP_ScoreScreen_SP_C_BndEvt__WBP_ScoreScreen_SP_LogoAnim_K2Node_ComponentBoundEvent_4_TedMoviePlayerWidgetEventDelegate__DelegateSignature, InWidget) == 0x000000, "Member 'WBP_ScoreScreen_SP_C_BndEvt__WBP_ScoreScreen_SP_LogoAnim_K2Node_ComponentBoundEvent_4_TedMoviePlayerWidgetEventDelegate__DelegateSignature::InWidget' has a wrong offset!");
static_assert(offsetof(WBP_ScoreScreen_SP_C_BndEvt__WBP_ScoreScreen_SP_LogoAnim_K2Node_ComponentBoundEvent_4_TedMoviePlayerWidgetEventDelegate__DelegateSignature, InSource) == 0x000008, "Member 'WBP_ScoreScreen_SP_C_BndEvt__WBP_ScoreScreen_SP_LogoAnim_K2Node_ComponentBoundEvent_4_TedMoviePlayerWidgetEventDelegate__DelegateSignature::InSource' has a wrong offset!");

// Function WBP_ScoreScreen_SP.WBP_ScoreScreen_SP_C.ExecuteUbergraph_WBP_ScoreScreen_SP
// 0x0168 (0x0168 - 0x0000)
struct WBP_ScoreScreen_SP_C_ExecuteUbergraph_WBP_ScoreScreen_SP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_ScoreScreen_Objective_Panel_C*     K2Node_DynamicCast_AsWBP_Score_Screen_Objective_Panel; // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_ScoreScreen_Objective_Panel_C*     K2Node_DynamicCast_AsWBP_Score_Screen_Objective_Panel_1; // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVictoryScreen_ReturnValue;              // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_StartThemed_ReturnValue;               // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23[0x5];                                       // 0x0023(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UTedMoviePlayerWidgetV2*                K2Node_ComponentBoundEvent_InWidget;               // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	const class UFileMediaSource*                 K2Node_ComponentBoundEvent_InSource;               // 0x0030(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Finish_ReturnValue;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetActiveWidgetIndex_ReturnValue;         // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UTedContentPanelBase* InContentPanel, class UTedContentPanelSlotBase* InContentSlot, ETedContentSlotState InState, bool bInActivated)> K2Node_CreateDelegate_OutputDelegate; // 0x0044(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTedContentPanelBase*                   K2Node_CustomEvent_InContentPanel;                 // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UTedContentPanelSlotBase*               K2Node_CustomEvent_InContentSlot;                  // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ETedContentSlotState                          K2Node_CustomEvent_InState;                        // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bInActivated;                   // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6B[0x5];                                       // 0x006B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	const class UTedMapInfo*                      CallFunc_K2_GetCurrentMapInfo_ReturnValue;         // 0x0070(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetDescription_ReturnValue;               // 0x0078(0x0010)(ConstParm)
	class FText                                   CallFunc_GetLocation_ReturnValue;                  // 0x0088(0x0010)(ConstParm)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x00A0(0x0010)()
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x3];                                       // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x00B4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_1;            // 0x00C8(0x0010)()
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTedObjectiveCauseOfFailureData        CallFunc_GetObjectiveCauseOfFailureData_ReturnValue; // 0x00E0(0x0018)()
	bool                                          CallFunc_K2_StartThemed_ReturnValue_1;             // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FA[0x6];                                       // 0x00FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetDescriptiveCauseOfFailure_ReturnValue; // 0x0100(0x0010)(ConstParm)
	class FText                                   CallFunc_TryGetDisplayTitle_ReturnValue;           // 0x0110(0x0010)()
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x0128(0x0010)()
	bool                                          CallFunc_K2_Start_ReturnValue;                     // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTedMoviePlayerWidgetV2*                K2Node_ComponentBoundEvent_InWidget_1;             // 0x0140(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	const class UFileMediaSource*                 K2Node_ComponentBoundEvent_InSource_1;             // 0x0148(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_Start_ReturnValue_1;                   // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETedFaction                                   CallFunc_BranchUITheme_ReturnValue;                // 0x0151(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_Start_ReturnValue_2;                   // 0x0152(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0153(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_154[0x4];                                      // 0x0154(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetActiveWidget_ReturnValue;              // 0x0158(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0161(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0162(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ScoreScreen_SP_C_ExecuteUbergraph_WBP_ScoreScreen_SP) == 0x000008, "Wrong alignment on WBP_ScoreScreen_SP_C_ExecuteUbergraph_WBP_ScoreScreen_SP");
static_assert(sizeof(WBP_ScoreScreen_SP_C_ExecuteUbergraph_WBP_ScoreScreen_SP) == 0x000168, "Wrong size on WBP_ScoreScreen_SP_C_ExecuteUbergraph_WBP_ScoreScreen_SP");
static_assert(offsetof(WBP_ScoreScreen_SP_C_ExecuteUbergraph_WBP_ScoreScreen_SP, EntryPoint) == 0x000000, "Member 'WBP_ScoreScreen_SP_C_ExecuteUbergraph_WBP_ScoreScreen_SP::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_ScoreScreen_SP_C_ExecuteUbergraph_WBP_ScoreScreen_SP, Temp_bool_Variable) == 0x000004, "Member 'WBP_ScoreScreen_SP_C_ExecuteUbergraph_WBP_ScoreScreen_SP::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ScoreScreen_SP_C_ExecuteUbergraph_WBP_ScoreScreen_SP, K2Node_DynamicCast_AsWBP_Score_Screen_Objective_Panel) == 0x000008, "Member 'WBP_ScoreScreen_SP_C_ExecuteUbergraph_WBP_ScoreScreen_SP::K2Node_DynamicCast_AsWBP_Score_Screen_Objective_Panel' has a wrong offset!");
static_assert(offsetof(WBP_ScoreScreen_SP_C_ExecuteUbergraph_WBP_ScoreScreen_SP, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'WBP_ScoreScreen_SP_C_ExecuteUbergraph_WBP_ScoreScreen_SP::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_ScoreScreen_SP_C_ExecuteUbergraph_WBP_ScoreScreen_SP, K2Node_DynamicCast_AsWBP_Score_Screen_Objective_Panel_1) == 0x000018, "Member 'WBP_ScoreScreen_SP_C_ExecuteUbergraph_WBP_ScoreScreen_SP::K2Node_DynamicCast_AsWBP_Score_Screen_Objective_Panel_1' has a wrong offset!");
static_assert(offsetof(WBP_ScoreScreen_SP_C_ExecuteUbergraph_WBP_ScoreScreen_SP, K2Node_DynamicCast_bSuccess_1) == 0x000020, "Member 'WBP_ScoreScreen_SP_C_ExecuteUbergraph_WBP_ScoreScreen_SP::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_ScoreScreen_SP_C_ExecuteUbergraph_WBP_ScoreScreen_SP, CallFunc_IsVictoryScreen_ReturnValue) == 0x000021, "Member 'WBP_ScoreScreen_SP_C_ExecuteUbergraph_WBP_ScoreScreen_SP::CallFunc_IsVictoryScreen_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ScoreScreen_SP_C_ExecuteUbergraph_WBP_ScoreScreen_SP, CallFunc_K2_StartThemed_ReturnValue) == 0x000022, "Member 'WBP_ScoreScreen_SP_C_ExecuteUbergraph_WBP_ScoreScreen_SP::CallFunc_K2_StartThemed_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ScoreScreen_SP_C_ExecuteUbergraph_WBP_ScoreScreen_SP, K2Node_ComponentBoundEvent_InWidget) == 0x000028, "Member 'WBP_ScoreScreen_SP_C_ExecuteUbergraph_WBP_ScoreScreen_SP::K2Node_ComponentBoundEvent_InWidget' has a wrong offset!");
static_assert(offsetof(WBP_ScoreScreen_SP_C_ExecuteUbergraph_WBP_ScoreScreen_SP, K2Node_ComponentBoundEvent_InSource) == 0x000030, "Member 'WBP_ScoreScreen_SP_C_ExecuteUbergraph_WBP_ScoreScreen_SP::K2Node_ComponentBoundEvent_InSource' has a wrong offset!");
static_assert(offsetof(WBP_ScoreScreen_SP_C_ExecuteUbergraph_WBP_ScoreScreen_SP, CallFunc_Finish_ReturnValue) == 0x000038, "Member 'WBP_ScoreScreen_SP_C_ExecuteUbergraph_WBP_ScoreScreen_SP::CallFunc_Finish_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ScoreScreen_SP_C_ExecuteUbergraph_WBP_ScoreScreen_SP, CallFunc_GetActiveWidgetIndex_ReturnValue) == 0x00003C, "Member 'WBP_ScoreScreen_SP_C_ExecuteUbergraph_WBP_ScoreScreen_SP::CallFunc_GetActiveWidgetIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ScoreScreen_SP_C_ExecuteUbergraph_WBP_ScoreScreen_SP, K2Node_SwitchInteger_CmpSuccess) == 0x000040, "Member 'WBP_ScoreScreen_SP_C_ExecuteUbergraph_WBP_ScoreScreen_SP::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_ScoreScreen_SP_C_ExecuteUbergraph_WBP_ScoreScreen_SP, K2Node_CreateDelegate_OutputDelegate) == 0x000044, "Member 'WBP_ScoreScreen_SP_C_ExecuteUbergraph_WBP_ScoreScreen_SP::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_ScoreScreen_SP_C_ExecuteUbergraph_WBP_ScoreScreen_SP, K2Node_CustomEvent_InContentPanel) == 0x000058, "Member 'WBP_ScoreScreen_SP_C_ExecuteUbergraph_WBP_ScoreScreen_SP::K2Node_CustomEvent_InContentPanel' has a wrong offset!");
static_assert(offsetof(WBP_ScoreScreen_SP_C_ExecuteUbergraph_WBP_ScoreScreen_SP, K2Node_CustomEvent_InContentSlot) == 0x000060, "Member 'WBP_ScoreScreen_SP_C_ExecuteUbergraph_WBP_ScoreScreen_SP::K2Node_CustomEvent_InContentSlot' has a wrong offset!");
static_assert(offsetof(WBP_ScoreScreen_SP_C_ExecuteUbergraph_WBP_ScoreScreen_SP, K2Node_CustomEvent_InState) == 0x000068, "Member 'WBP_ScoreScreen_SP_C_ExecuteUbergraph_WBP_ScoreScreen_SP::K2Node_CustomEvent_InState' has a wrong offset!");
static_assert(offsetof(WBP_ScoreScreen_SP_C_ExecuteUbergraph_WBP_ScoreScreen_SP, K2Node_CustomEvent_bInActivated) == 0x000069, "Member 'WBP_ScoreScreen_SP_C_ExecuteUbergraph_WBP_ScoreScreen_SP::K2Node_CustomEvent_bInActivated' has a wrong offset!");
static_assert(offsetof(WBP_ScoreScreen_SP_C_ExecuteUbergraph_WBP_ScoreScreen_SP, K2Node_SwitchEnum_CmpSuccess) == 0x00006A, "Member 'WBP_ScoreScreen_SP_C_ExecuteUbergraph_WBP_ScoreScreen_SP::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_ScoreScreen_SP_C_ExecuteUbergraph_WBP_ScoreScreen_SP, CallFunc_K2_GetCurrentMapInfo_ReturnValue) == 0x000070, "Member 'WBP_ScoreScreen_SP_C_ExecuteUbergraph_WBP_ScoreScreen_SP::CallFunc_K2_GetCurrentMapInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ScoreScreen_SP_C_ExecuteUbergraph_WBP_ScoreScreen_SP, CallFunc_GetDescription_ReturnValue) == 0x000078, "Member 'WBP_ScoreScreen_SP_C_ExecuteUbergraph_WBP_ScoreScreen_SP::CallFunc_GetDescription_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ScoreScreen_SP_C_ExecuteUbergraph_WBP_ScoreScreen_SP, CallFunc_GetLocation_ReturnValue) == 0x000088, "Member 'WBP_ScoreScreen_SP_C_ExecuteUbergraph_WBP_ScoreScreen_SP::CallFunc_GetLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ScoreScreen_SP_C_ExecuteUbergraph_WBP_ScoreScreen_SP, CallFunc_IsValid_ReturnValue) == 0x000098, "Member 'WBP_ScoreScreen_SP_C_ExecuteUbergraph_WBP_ScoreScreen_SP::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ScoreScreen_SP_C_ExecuteUbergraph_WBP_ScoreScreen_SP, CallFunc_MakeLiteralText_ReturnValue) == 0x0000A0, "Member 'WBP_ScoreScreen_SP_C_ExecuteUbergraph_WBP_ScoreScreen_SP::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ScoreScreen_SP_C_ExecuteUbergraph_WBP_ScoreScreen_SP, Temp_bool_IsClosed_Variable) == 0x0000B0, "Member 'WBP_ScoreScreen_SP_C_ExecuteUbergraph_WBP_ScoreScreen_SP::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ScoreScreen_SP_C_ExecuteUbergraph_WBP_ScoreScreen_SP, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000B4, "Member 'WBP_ScoreScreen_SP_C_ExecuteUbergraph_WBP_ScoreScreen_SP::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_ScoreScreen_SP_C_ExecuteUbergraph_WBP_ScoreScreen_SP, CallFunc_MakeLiteralText_ReturnValue_1) == 0x0000C8, "Member 'WBP_ScoreScreen_SP_C_ExecuteUbergraph_WBP_ScoreScreen_SP::CallFunc_MakeLiteralText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ScoreScreen_SP_C_ExecuteUbergraph_WBP_ScoreScreen_SP, CallFunc_PlayAnimation_ReturnValue) == 0x0000D8, "Member 'WBP_ScoreScreen_SP_C_ExecuteUbergraph_WBP_ScoreScreen_SP::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ScoreScreen_SP_C_ExecuteUbergraph_WBP_ScoreScreen_SP, CallFunc_GetObjectiveCauseOfFailureData_ReturnValue) == 0x0000E0, "Member 'WBP_ScoreScreen_SP_C_ExecuteUbergraph_WBP_ScoreScreen_SP::CallFunc_GetObjectiveCauseOfFailureData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ScoreScreen_SP_C_ExecuteUbergraph_WBP_ScoreScreen_SP, CallFunc_K2_StartThemed_ReturnValue_1) == 0x0000F8, "Member 'WBP_ScoreScreen_SP_C_ExecuteUbergraph_WBP_ScoreScreen_SP::CallFunc_K2_StartThemed_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ScoreScreen_SP_C_ExecuteUbergraph_WBP_ScoreScreen_SP, CallFunc_TextIsEmpty_ReturnValue) == 0x0000F9, "Member 'WBP_ScoreScreen_SP_C_ExecuteUbergraph_WBP_ScoreScreen_SP::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ScoreScreen_SP_C_ExecuteUbergraph_WBP_ScoreScreen_SP, CallFunc_GetDescriptiveCauseOfFailure_ReturnValue) == 0x000100, "Member 'WBP_ScoreScreen_SP_C_ExecuteUbergraph_WBP_ScoreScreen_SP::CallFunc_GetDescriptiveCauseOfFailure_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ScoreScreen_SP_C_ExecuteUbergraph_WBP_ScoreScreen_SP, CallFunc_TryGetDisplayTitle_ReturnValue) == 0x000110, "Member 'WBP_ScoreScreen_SP_C_ExecuteUbergraph_WBP_ScoreScreen_SP::CallFunc_TryGetDisplayTitle_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ScoreScreen_SP_C_ExecuteUbergraph_WBP_ScoreScreen_SP, CallFunc_IsValid_ReturnValue_1) == 0x000120, "Member 'WBP_ScoreScreen_SP_C_ExecuteUbergraph_WBP_ScoreScreen_SP::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ScoreScreen_SP_C_ExecuteUbergraph_WBP_ScoreScreen_SP, K2Node_Select_Default) == 0x000128, "Member 'WBP_ScoreScreen_SP_C_ExecuteUbergraph_WBP_ScoreScreen_SP::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_ScoreScreen_SP_C_ExecuteUbergraph_WBP_ScoreScreen_SP, CallFunc_K2_Start_ReturnValue) == 0x000138, "Member 'WBP_ScoreScreen_SP_C_ExecuteUbergraph_WBP_ScoreScreen_SP::CallFunc_K2_Start_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ScoreScreen_SP_C_ExecuteUbergraph_WBP_ScoreScreen_SP, K2Node_ComponentBoundEvent_InWidget_1) == 0x000140, "Member 'WBP_ScoreScreen_SP_C_ExecuteUbergraph_WBP_ScoreScreen_SP::K2Node_ComponentBoundEvent_InWidget_1' has a wrong offset!");
static_assert(offsetof(WBP_ScoreScreen_SP_C_ExecuteUbergraph_WBP_ScoreScreen_SP, K2Node_ComponentBoundEvent_InSource_1) == 0x000148, "Member 'WBP_ScoreScreen_SP_C_ExecuteUbergraph_WBP_ScoreScreen_SP::K2Node_ComponentBoundEvent_InSource_1' has a wrong offset!");
static_assert(offsetof(WBP_ScoreScreen_SP_C_ExecuteUbergraph_WBP_ScoreScreen_SP, CallFunc_K2_Start_ReturnValue_1) == 0x000150, "Member 'WBP_ScoreScreen_SP_C_ExecuteUbergraph_WBP_ScoreScreen_SP::CallFunc_K2_Start_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ScoreScreen_SP_C_ExecuteUbergraph_WBP_ScoreScreen_SP, CallFunc_BranchUITheme_ReturnValue) == 0x000151, "Member 'WBP_ScoreScreen_SP_C_ExecuteUbergraph_WBP_ScoreScreen_SP::CallFunc_BranchUITheme_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ScoreScreen_SP_C_ExecuteUbergraph_WBP_ScoreScreen_SP, CallFunc_K2_Start_ReturnValue_2) == 0x000152, "Member 'WBP_ScoreScreen_SP_C_ExecuteUbergraph_WBP_ScoreScreen_SP::CallFunc_K2_Start_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ScoreScreen_SP_C_ExecuteUbergraph_WBP_ScoreScreen_SP, K2Node_SwitchEnum_CmpSuccess_1) == 0x000153, "Member 'WBP_ScoreScreen_SP_C_ExecuteUbergraph_WBP_ScoreScreen_SP::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_ScoreScreen_SP_C_ExecuteUbergraph_WBP_ScoreScreen_SP, CallFunc_GetActiveWidget_ReturnValue) == 0x000158, "Member 'WBP_ScoreScreen_SP_C_ExecuteUbergraph_WBP_ScoreScreen_SP::CallFunc_GetActiveWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ScoreScreen_SP_C_ExecuteUbergraph_WBP_ScoreScreen_SP, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000160, "Member 'WBP_ScoreScreen_SP_C_ExecuteUbergraph_WBP_ScoreScreen_SP::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ScoreScreen_SP_C_ExecuteUbergraph_WBP_ScoreScreen_SP, Temp_bool_Has_Been_Initd_Variable) == 0x000161, "Member 'WBP_ScoreScreen_SP_C_ExecuteUbergraph_WBP_ScoreScreen_SP::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ScoreScreen_SP_C_ExecuteUbergraph_WBP_ScoreScreen_SP, CallFunc_IsValid_ReturnValue_2) == 0x000162, "Member 'WBP_ScoreScreen_SP_C_ExecuteUbergraph_WBP_ScoreScreen_SP::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");

// Function WBP_ScoreScreen_SP.WBP_ScoreScreen_SP_C.OnOpen
// 0x0090 (0x0090 - 0x0000)
struct WBP_ScoreScreen_SP_C_OnOpen final
{
public:
	const class UObject*                          InContext;                                         // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          bInInstant;                                        // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UTedContentPanelSlotBase*>       CallFunc_GetContentSlots_OutSlots;                 // 0x0020(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_GetContentSlots_ReturnValue;              // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTedContentPanelSlotBase*               CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_ScoreScreen_Objective_Slot_C*      K2Node_DynamicCast_AsWBP_Score_Screen_Objective_Slot; // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52[0x2];                                       // 0x0052(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UTedContentPanelSlotBase*>       CallFunc_GetContentSlots_OutSlots_1;               // 0x0058(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_GetContentSlots_ReturnValue_1;            // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTedContentPanelSlotBase*               CallFunc_Array_Get_Item_1;                         // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_ScoreScreen_Objective_Slot_C*      K2Node_DynamicCast_AsWBP_Score_Screen_Objective_Slot_1; // 0x0080(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ScoreScreen_SP_C_OnOpen) == 0x000008, "Wrong alignment on WBP_ScoreScreen_SP_C_OnOpen");
static_assert(sizeof(WBP_ScoreScreen_SP_C_OnOpen) == 0x000090, "Wrong size on WBP_ScoreScreen_SP_C_OnOpen");
static_assert(offsetof(WBP_ScoreScreen_SP_C_OnOpen, InContext) == 0x000000, "Member 'WBP_ScoreScreen_SP_C_OnOpen::InContext' has a wrong offset!");
static_assert(offsetof(WBP_ScoreScreen_SP_C_OnOpen, bInInstant) == 0x000008, "Member 'WBP_ScoreScreen_SP_C_OnOpen::bInInstant' has a wrong offset!");
static_assert(offsetof(WBP_ScoreScreen_SP_C_OnOpen, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'WBP_ScoreScreen_SP_C_OnOpen::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ScoreScreen_SP_C_OnOpen, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'WBP_ScoreScreen_SP_C_OnOpen::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ScoreScreen_SP_C_OnOpen, Temp_int_Array_Index_Variable) == 0x000014, "Member 'WBP_ScoreScreen_SP_C_OnOpen::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ScoreScreen_SP_C_OnOpen, Temp_int_Array_Index_Variable_1) == 0x000018, "Member 'WBP_ScoreScreen_SP_C_OnOpen::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ScoreScreen_SP_C_OnOpen, Temp_int_Loop_Counter_Variable_1) == 0x00001C, "Member 'WBP_ScoreScreen_SP_C_OnOpen::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ScoreScreen_SP_C_OnOpen, CallFunc_GetContentSlots_OutSlots) == 0x000020, "Member 'WBP_ScoreScreen_SP_C_OnOpen::CallFunc_GetContentSlots_OutSlots' has a wrong offset!");
static_assert(offsetof(WBP_ScoreScreen_SP_C_OnOpen, CallFunc_GetContentSlots_ReturnValue) == 0x000030, "Member 'WBP_ScoreScreen_SP_C_OnOpen::CallFunc_GetContentSlots_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ScoreScreen_SP_C_OnOpen, CallFunc_Array_Get_Item) == 0x000038, "Member 'WBP_ScoreScreen_SP_C_OnOpen::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_ScoreScreen_SP_C_OnOpen, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'WBP_ScoreScreen_SP_C_OnOpen::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ScoreScreen_SP_C_OnOpen, K2Node_DynamicCast_AsWBP_Score_Screen_Objective_Slot) == 0x000048, "Member 'WBP_ScoreScreen_SP_C_OnOpen::K2Node_DynamicCast_AsWBP_Score_Screen_Objective_Slot' has a wrong offset!");
static_assert(offsetof(WBP_ScoreScreen_SP_C_OnOpen, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'WBP_ScoreScreen_SP_C_OnOpen::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_ScoreScreen_SP_C_OnOpen, CallFunc_Less_IntInt_ReturnValue) == 0x000051, "Member 'WBP_ScoreScreen_SP_C_OnOpen::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ScoreScreen_SP_C_OnOpen, CallFunc_Add_IntInt_ReturnValue_1) == 0x000054, "Member 'WBP_ScoreScreen_SP_C_OnOpen::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ScoreScreen_SP_C_OnOpen, CallFunc_GetContentSlots_OutSlots_1) == 0x000058, "Member 'WBP_ScoreScreen_SP_C_OnOpen::CallFunc_GetContentSlots_OutSlots_1' has a wrong offset!");
static_assert(offsetof(WBP_ScoreScreen_SP_C_OnOpen, CallFunc_GetContentSlots_ReturnValue_1) == 0x000068, "Member 'WBP_ScoreScreen_SP_C_OnOpen::CallFunc_GetContentSlots_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ScoreScreen_SP_C_OnOpen, CallFunc_Array_Length_ReturnValue_1) == 0x00006C, "Member 'WBP_ScoreScreen_SP_C_OnOpen::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ScoreScreen_SP_C_OnOpen, CallFunc_Array_Get_Item_1) == 0x000070, "Member 'WBP_ScoreScreen_SP_C_OnOpen::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_ScoreScreen_SP_C_OnOpen, CallFunc_Less_IntInt_ReturnValue_1) == 0x000078, "Member 'WBP_ScoreScreen_SP_C_OnOpen::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ScoreScreen_SP_C_OnOpen, K2Node_DynamicCast_AsWBP_Score_Screen_Objective_Slot_1) == 0x000080, "Member 'WBP_ScoreScreen_SP_C_OnOpen::K2Node_DynamicCast_AsWBP_Score_Screen_Objective_Slot_1' has a wrong offset!");
static_assert(offsetof(WBP_ScoreScreen_SP_C_OnOpen, K2Node_DynamicCast_bSuccess_1) == 0x000088, "Member 'WBP_ScoreScreen_SP_C_OnOpen::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function WBP_ScoreScreen_SP.WBP_ScoreScreen_SP_C.OnTabChanged
// 0x0018 (0x0018 - 0x0000)
struct WBP_ScoreScreen_SP_C_OnTabChanged final
{
public:
	class UTedContentPanelBase*                   InContentPanel;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UTedContentPanelSlotBase*               InContentSlot;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ETedContentSlotState                          InState;                                           // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bInActivated;                                      // 0x0011(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ScoreScreen_SP_C_OnTabChanged) == 0x000008, "Wrong alignment on WBP_ScoreScreen_SP_C_OnTabChanged");
static_assert(sizeof(WBP_ScoreScreen_SP_C_OnTabChanged) == 0x000018, "Wrong size on WBP_ScoreScreen_SP_C_OnTabChanged");
static_assert(offsetof(WBP_ScoreScreen_SP_C_OnTabChanged, InContentPanel) == 0x000000, "Member 'WBP_ScoreScreen_SP_C_OnTabChanged::InContentPanel' has a wrong offset!");
static_assert(offsetof(WBP_ScoreScreen_SP_C_OnTabChanged, InContentSlot) == 0x000008, "Member 'WBP_ScoreScreen_SP_C_OnTabChanged::InContentSlot' has a wrong offset!");
static_assert(offsetof(WBP_ScoreScreen_SP_C_OnTabChanged, InState) == 0x000010, "Member 'WBP_ScoreScreen_SP_C_OnTabChanged::InState' has a wrong offset!");
