#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MissionDialogue

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Tempest_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_MissionDialogue.WBP_MissionDialogue_C
// 0x0038 (0x0510 - 0x04D8)
class UWBP_MissionDialogue_C final : public UTedMissionDialogueWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       WidgetAnim_Outro;                                  // 0x04E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       WidgetAnim_Intro;                                  // 0x04E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel_Anim;                                  // 0x04F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Frame;                                       // 0x04F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Movie;                                       // 0x0500(0x0008)(ExportObject, ZeroConstructor, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_Subtitles;                                 // 0x0508(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BndEvt__WBP_MissionDialogue_WBP_MissionDialogue_Subtitles_K2Node_ComponentBoundEvent_1_OnVisibilityChangedEvent__DelegateSignature(ESlateVisibility InVisibility);
	void Construct();
	void ExecuteUbergraph_WBP_MissionDialogue(int32 EntryPoint);
	void K2_OnIntroStarted();
	void K2_OnOutroStarted();
	void PlayIntroAfterOutroFinished();
	void SyncSubtitlesVisibility();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void TryPlayIntroAnim();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_MissionDialogue_C">();
	}
	static class UWBP_MissionDialogue_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_MissionDialogue_C>();
	}
};
static_assert(alignof(UWBP_MissionDialogue_C) == 0x000008, "Wrong alignment on UWBP_MissionDialogue_C");
static_assert(sizeof(UWBP_MissionDialogue_C) == 0x000510, "Wrong size on UWBP_MissionDialogue_C");
static_assert(offsetof(UWBP_MissionDialogue_C, UberGraphFrame) == 0x0004D8, "Member 'UWBP_MissionDialogue_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_MissionDialogue_C, WidgetAnim_Outro) == 0x0004E0, "Member 'UWBP_MissionDialogue_C::WidgetAnim_Outro' has a wrong offset!");
static_assert(offsetof(UWBP_MissionDialogue_C, WidgetAnim_Intro) == 0x0004E8, "Member 'UWBP_MissionDialogue_C::WidgetAnim_Intro' has a wrong offset!");
static_assert(offsetof(UWBP_MissionDialogue_C, CanvasPanel_Anim) == 0x0004F0, "Member 'UWBP_MissionDialogue_C::CanvasPanel_Anim' has a wrong offset!");
static_assert(offsetof(UWBP_MissionDialogue_C, Image_Frame) == 0x0004F8, "Member 'UWBP_MissionDialogue_C::Image_Frame' has a wrong offset!");
static_assert(offsetof(UWBP_MissionDialogue_C, Image_Movie) == 0x000500, "Member 'UWBP_MissionDialogue_C::Image_Movie' has a wrong offset!");
static_assert(offsetof(UWBP_MissionDialogue_C, SizeBox_Subtitles) == 0x000508, "Member 'UWBP_MissionDialogue_C::SizeBox_Subtitles' has a wrong offset!");

}

