#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SelectionDetails_InfoSlots_Attack_WeaponsList_Slot

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Tempest_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_SelectionDetails_InfoSlots_Attack_WeaponsList_Slot.WBP_SelectionDetails_InfoSlots_Attack_WeaponsList_Slot_C
// 0x0068 (0x04D0 - 0x0468)
class UWBP_SelectionDetails_InfoSlots_Attack_WeaponsList_Slot_C final : public UTedDefinitionSlot_Weapon
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0468(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USizeBox*                               SizeBox_Root;                                      // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Slot_Separator;                                    // 0x0478(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SelectionDetails_InfoSlots_Attack_WeaponsList_Slot_StatRow_C* StatRow_Ammo;           // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SelectionDetails_InfoSlots_Attack_WeaponsList_Slot_StatRow_C* StatRow_Damage;         // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SelectionDetails_InfoSlots_Attack_WeaponsList_Slot_StatRow_C* StatRow_DamageType;     // 0x0490(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SelectionDetails_InfoSlots_Attack_WeaponsList_Slot_StatRow_C* StatRow_Range;          // 0x0498(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SelectionDetails_InfoSlots_Attack_WeaponsList_Slot_StatRow_C* StatRow_RechargeTime;   // 0x04A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SelectionDetails_InfoSlots_Attack_WeaponsList_Slot_StatRow_C* StatRow_Speed;          // 0x04A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SelectionDetails_InfoSlots_Attack_WeaponsList_Slot_StatRow_C* StatRow_Targets;        // 0x04B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SelectionDetails_InfoSlots_Attack_WeaponsList_Slot_StatRow_C* StatRow_Volley;         // 0x04B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Parameters_Format;                                 // 0x04C0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void Construct();
	void ExecuteUbergraph_WBP_SelectionDetails_InfoSlots_Attack_WeaponsList_Slot(int32 EntryPoint);
	void Refresh_Parameters();
	void RefreshUI();
	void RefreshVerticalSeparator();
	void SetMaxDesiredWidth(float Value);
	void SetMinDesiredWidth(float Value);
	void SetWidthOverride(float Value);
	void UpdateSizeBox();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_SelectionDetails_InfoSlots_Attack_WeaponsList_Slot_C">();
	}
	static class UWBP_SelectionDetails_InfoSlots_Attack_WeaponsList_Slot_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_SelectionDetails_InfoSlots_Attack_WeaponsList_Slot_C>();
	}
};
static_assert(alignof(UWBP_SelectionDetails_InfoSlots_Attack_WeaponsList_Slot_C) == 0x000008, "Wrong alignment on UWBP_SelectionDetails_InfoSlots_Attack_WeaponsList_Slot_C");
static_assert(sizeof(UWBP_SelectionDetails_InfoSlots_Attack_WeaponsList_Slot_C) == 0x0004D0, "Wrong size on UWBP_SelectionDetails_InfoSlots_Attack_WeaponsList_Slot_C");
static_assert(offsetof(UWBP_SelectionDetails_InfoSlots_Attack_WeaponsList_Slot_C, UberGraphFrame) == 0x000468, "Member 'UWBP_SelectionDetails_InfoSlots_Attack_WeaponsList_Slot_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_SelectionDetails_InfoSlots_Attack_WeaponsList_Slot_C, SizeBox_Root) == 0x000470, "Member 'UWBP_SelectionDetails_InfoSlots_Attack_WeaponsList_Slot_C::SizeBox_Root' has a wrong offset!");
static_assert(offsetof(UWBP_SelectionDetails_InfoSlots_Attack_WeaponsList_Slot_C, Slot_Separator) == 0x000478, "Member 'UWBP_SelectionDetails_InfoSlots_Attack_WeaponsList_Slot_C::Slot_Separator' has a wrong offset!");
static_assert(offsetof(UWBP_SelectionDetails_InfoSlots_Attack_WeaponsList_Slot_C, StatRow_Ammo) == 0x000480, "Member 'UWBP_SelectionDetails_InfoSlots_Attack_WeaponsList_Slot_C::StatRow_Ammo' has a wrong offset!");
static_assert(offsetof(UWBP_SelectionDetails_InfoSlots_Attack_WeaponsList_Slot_C, StatRow_Damage) == 0x000488, "Member 'UWBP_SelectionDetails_InfoSlots_Attack_WeaponsList_Slot_C::StatRow_Damage' has a wrong offset!");
static_assert(offsetof(UWBP_SelectionDetails_InfoSlots_Attack_WeaponsList_Slot_C, StatRow_DamageType) == 0x000490, "Member 'UWBP_SelectionDetails_InfoSlots_Attack_WeaponsList_Slot_C::StatRow_DamageType' has a wrong offset!");
static_assert(offsetof(UWBP_SelectionDetails_InfoSlots_Attack_WeaponsList_Slot_C, StatRow_Range) == 0x000498, "Member 'UWBP_SelectionDetails_InfoSlots_Attack_WeaponsList_Slot_C::StatRow_Range' has a wrong offset!");
static_assert(offsetof(UWBP_SelectionDetails_InfoSlots_Attack_WeaponsList_Slot_C, StatRow_RechargeTime) == 0x0004A0, "Member 'UWBP_SelectionDetails_InfoSlots_Attack_WeaponsList_Slot_C::StatRow_RechargeTime' has a wrong offset!");
static_assert(offsetof(UWBP_SelectionDetails_InfoSlots_Attack_WeaponsList_Slot_C, StatRow_Speed) == 0x0004A8, "Member 'UWBP_SelectionDetails_InfoSlots_Attack_WeaponsList_Slot_C::StatRow_Speed' has a wrong offset!");
static_assert(offsetof(UWBP_SelectionDetails_InfoSlots_Attack_WeaponsList_Slot_C, StatRow_Targets) == 0x0004B0, "Member 'UWBP_SelectionDetails_InfoSlots_Attack_WeaponsList_Slot_C::StatRow_Targets' has a wrong offset!");
static_assert(offsetof(UWBP_SelectionDetails_InfoSlots_Attack_WeaponsList_Slot_C, StatRow_Volley) == 0x0004B8, "Member 'UWBP_SelectionDetails_InfoSlots_Attack_WeaponsList_Slot_C::StatRow_Volley' has a wrong offset!");
static_assert(offsetof(UWBP_SelectionDetails_InfoSlots_Attack_WeaponsList_Slot_C, Parameters_Format) == 0x0004C0, "Member 'UWBP_SelectionDetails_InfoSlots_Attack_WeaponsList_Slot_C::Parameters_Format' has a wrong offset!");

}

