#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Commands_Slot_Glowing

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Tempest_structs.hpp"
#include "UMG_structs.hpp"
#include "Slate_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_Commands_Slot_Glowing.WBP_Commands_Slot_Glowing_C.CheckForHighlight
// 0x0030 (0x0030 - 0x0000)
struct WBP_Commands_Slot_Glowing_C_CheckForHighlight final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UTedHintsSubsystem*                     CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSlotIndex_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTedCommandsPanel*                      CallFunc_GetCommandsPanel_ReturnValue;             // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TSubclassOf<class UTedCommand>                CallFunc_GetSlotContent_ReturnValue;               // 0x0020(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldAbilityBeHighlighted_ReturnValue;   // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Commands_Slot_Glowing_C_CheckForHighlight) == 0x000008, "Wrong alignment on WBP_Commands_Slot_Glowing_C_CheckForHighlight");
static_assert(sizeof(WBP_Commands_Slot_Glowing_C_CheckForHighlight) == 0x000030, "Wrong size on WBP_Commands_Slot_Glowing_C_CheckForHighlight");
static_assert(offsetof(WBP_Commands_Slot_Glowing_C_CheckForHighlight, Temp_bool_Variable) == 0x000000, "Member 'WBP_Commands_Slot_Glowing_C_CheckForHighlight::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_C_CheckForHighlight, Temp_byte_Variable) == 0x000001, "Member 'WBP_Commands_Slot_Glowing_C_CheckForHighlight::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_C_CheckForHighlight, Temp_byte_Variable_1) == 0x000002, "Member 'WBP_Commands_Slot_Glowing_C_CheckForHighlight::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_C_CheckForHighlight, CallFunc_GetWorldSubsystem_ReturnValue) == 0x000008, "Member 'WBP_Commands_Slot_Glowing_C_CheckForHighlight::CallFunc_GetWorldSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_C_CheckForHighlight, CallFunc_GetSlotIndex_ReturnValue) == 0x000010, "Member 'WBP_Commands_Slot_Glowing_C_CheckForHighlight::CallFunc_GetSlotIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_C_CheckForHighlight, CallFunc_GetCommandsPanel_ReturnValue) == 0x000018, "Member 'WBP_Commands_Slot_Glowing_C_CheckForHighlight::CallFunc_GetCommandsPanel_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_C_CheckForHighlight, CallFunc_GetSlotContent_ReturnValue) == 0x000020, "Member 'WBP_Commands_Slot_Glowing_C_CheckForHighlight::CallFunc_GetSlotContent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_C_CheckForHighlight, CallFunc_ShouldAbilityBeHighlighted_ReturnValue) == 0x000028, "Member 'WBP_Commands_Slot_Glowing_C_CheckForHighlight::CallFunc_ShouldAbilityBeHighlighted_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_C_CheckForHighlight, K2Node_Select_Default) == 0x000029, "Member 'WBP_Commands_Slot_Glowing_C_CheckForHighlight::K2Node_Select_Default' has a wrong offset!");

// Function WBP_Commands_Slot_Glowing.WBP_Commands_Slot_Glowing_C.EvaluateIconOpacity
// 0x0028 (0x0028 - 0x0000)
struct WBP_Commands_Slot_Glowing_C_EvaluateIconOpacity final
{
public:
	double                                        Return_Value;                                      // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Local_Opacity_Default;                             // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Local_Opacity_Disabled;                            // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Local_Opacity_MissingPrerequisites;                // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsStateActive_ReturnValue;                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETedContentSlotState                          CallFunc_GetMissingPrerequisitesSlotState_ReturnValue; // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsStateActive_ReturnValue_1;              // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Commands_Slot_Glowing_C_EvaluateIconOpacity) == 0x000008, "Wrong alignment on WBP_Commands_Slot_Glowing_C_EvaluateIconOpacity");
static_assert(sizeof(WBP_Commands_Slot_Glowing_C_EvaluateIconOpacity) == 0x000028, "Wrong size on WBP_Commands_Slot_Glowing_C_EvaluateIconOpacity");
static_assert(offsetof(WBP_Commands_Slot_Glowing_C_EvaluateIconOpacity, Return_Value) == 0x000000, "Member 'WBP_Commands_Slot_Glowing_C_EvaluateIconOpacity::Return_Value' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_C_EvaluateIconOpacity, Local_Opacity_Default) == 0x000008, "Member 'WBP_Commands_Slot_Glowing_C_EvaluateIconOpacity::Local_Opacity_Default' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_C_EvaluateIconOpacity, Local_Opacity_Disabled) == 0x000010, "Member 'WBP_Commands_Slot_Glowing_C_EvaluateIconOpacity::Local_Opacity_Disabled' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_C_EvaluateIconOpacity, Local_Opacity_MissingPrerequisites) == 0x000018, "Member 'WBP_Commands_Slot_Glowing_C_EvaluateIconOpacity::Local_Opacity_MissingPrerequisites' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_C_EvaluateIconOpacity, CallFunc_IsStateActive_ReturnValue) == 0x000020, "Member 'WBP_Commands_Slot_Glowing_C_EvaluateIconOpacity::CallFunc_IsStateActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_C_EvaluateIconOpacity, CallFunc_GetMissingPrerequisitesSlotState_ReturnValue) == 0x000021, "Member 'WBP_Commands_Slot_Glowing_C_EvaluateIconOpacity::CallFunc_GetMissingPrerequisitesSlotState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_C_EvaluateIconOpacity, CallFunc_IsStateActive_ReturnValue_1) == 0x000022, "Member 'WBP_Commands_Slot_Glowing_C_EvaluateIconOpacity::CallFunc_IsStateActive_ReturnValue_1' has a wrong offset!");

// Function WBP_Commands_Slot_Glowing.WBP_Commands_Slot_Glowing_C.ExecuteUbergraph_WBP_Commands_Slot_Glowing
// 0x0290 (0x0290 - 0x0000)
struct WBP_Commands_Slot_Glowing_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSlotIndex_ReturnValue;                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry_1;                         // 0x0010(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTedCommandsPanel*                      CallFunc_GetCommandsPanel_ReturnValue;             // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSlotIndex_ReturnValue_1;               // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCooldown_OutCooldownAlpha;             // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCooldown_OutDuration;                  // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetCooldown_ReturnValue;                  // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_DoubleDouble_ReturnValue;        // 0x0065(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_66[0x2];                                       // 0x0066(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bToggle;                        // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UImage*                                 K2Node_CustomEvent_ImageToToggle;                  // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UTedCommandsPanel*                      CallFunc_GetCommandsPanel_ReturnValue_1;           // 0x0080(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             CallFunc_GetSlotContentUIData_OutIcon;             // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetSlotContentUIData_OutName;             // 0x0090(0x0010)()
	class FText                                   CallFunc_GetSlotContentUIData_OutDescription;      // 0x00A0(0x0010)()
	bool                                          CallFunc_GetSlotContentUIData_ReturnValue;         // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETedContentSlotState                          K2Node_Event_InState;                              // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInActivated;                         // 0x00B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B3[0x5];                                       // 0x00B3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_BoolToString_ReturnValue;            // 0x00B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x00C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x3];                                       // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x00DC(0x0038)(IsPlainOldData, NoDestructor)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerEvent                          K2Node_Event_MouseEvent_1;                         // 0x0118(0x0078)(ConstParm)
	struct FPointerEvent                          K2Node_Event_MouseEvent;                           // 0x0190(0x0078)(ConstParm)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETedContentSlotState                          CallFunc_GetDurationActiveSlotState_ReturnValue;   // 0x0209(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x020A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETedContentSlotState                          CallFunc_GetAlternatingActiveSlotState_ReturnValue; // 0x020B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x020C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x020D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x020E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x020F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_211[0x7];                                      // 0x0211(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetPathName_ReturnValue;                  // 0x0218(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0228(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0238(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0248(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x0258(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_4;              // 0x0268(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_B_ImplicitCast;     // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_NotEqual_DoubleDouble_A_ImplicitCast;     // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0288(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Commands_Slot_Glowing_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing) == 0x000008, "Wrong alignment on WBP_Commands_Slot_Glowing_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing");
static_assert(sizeof(WBP_Commands_Slot_Glowing_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing) == 0x000290, "Wrong size on WBP_Commands_Slot_Glowing_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing");
static_assert(offsetof(WBP_Commands_Slot_Glowing_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing, EntryPoint) == 0x000000, "Member 'WBP_Commands_Slot_Glowing_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing, CallFunc_GetSlotIndex_ReturnValue) == 0x000004, "Member 'WBP_Commands_Slot_Glowing_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing::CallFunc_GetSlotIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000008, "Member 'WBP_Commands_Slot_Glowing_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing, K2Node_Event_MyGeometry_1) == 0x000010, "Member 'WBP_Commands_Slot_Glowing_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing::K2Node_Event_MyGeometry_1' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing, K2Node_Event_InDeltaTime) == 0x000048, "Member 'WBP_Commands_Slot_Glowing_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing, CallFunc_GetCommandsPanel_ReturnValue) == 0x000050, "Member 'WBP_Commands_Slot_Glowing_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing::CallFunc_GetCommandsPanel_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing, CallFunc_GetSlotIndex_ReturnValue_1) == 0x000058, "Member 'WBP_Commands_Slot_Glowing_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing::CallFunc_GetSlotIndex_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing, CallFunc_GetCooldown_OutCooldownAlpha) == 0x00005C, "Member 'WBP_Commands_Slot_Glowing_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing::CallFunc_GetCooldown_OutCooldownAlpha' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing, CallFunc_GetCooldown_OutDuration) == 0x000060, "Member 'WBP_Commands_Slot_Glowing_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing::CallFunc_GetCooldown_OutDuration' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing, CallFunc_GetCooldown_ReturnValue) == 0x000064, "Member 'WBP_Commands_Slot_Glowing_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing::CallFunc_GetCooldown_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing, CallFunc_NotEqual_DoubleDouble_ReturnValue) == 0x000065, "Member 'WBP_Commands_Slot_Glowing_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing::CallFunc_NotEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000068, "Member 'WBP_Commands_Slot_Glowing_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing, K2Node_CustomEvent_bToggle) == 0x000070, "Member 'WBP_Commands_Slot_Glowing_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing::K2Node_CustomEvent_bToggle' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing, K2Node_CustomEvent_ImageToToggle) == 0x000078, "Member 'WBP_Commands_Slot_Glowing_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing::K2Node_CustomEvent_ImageToToggle' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing, CallFunc_GetCommandsPanel_ReturnValue_1) == 0x000080, "Member 'WBP_Commands_Slot_Glowing_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing::CallFunc_GetCommandsPanel_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing, CallFunc_GetSlotContentUIData_OutIcon) == 0x000088, "Member 'WBP_Commands_Slot_Glowing_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing::CallFunc_GetSlotContentUIData_OutIcon' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing, CallFunc_GetSlotContentUIData_OutName) == 0x000090, "Member 'WBP_Commands_Slot_Glowing_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing::CallFunc_GetSlotContentUIData_OutName' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing, CallFunc_GetSlotContentUIData_OutDescription) == 0x0000A0, "Member 'WBP_Commands_Slot_Glowing_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing::CallFunc_GetSlotContentUIData_OutDescription' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing, CallFunc_GetSlotContentUIData_ReturnValue) == 0x0000B0, "Member 'WBP_Commands_Slot_Glowing_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing::CallFunc_GetSlotContentUIData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing, K2Node_Event_InState) == 0x0000B1, "Member 'WBP_Commands_Slot_Glowing_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing::K2Node_Event_InState' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing, K2Node_Event_bInActivated) == 0x0000B2, "Member 'WBP_Commands_Slot_Glowing_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing::K2Node_Event_bInActivated' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing, CallFunc_Conv_BoolToString_ReturnValue) == 0x0000B8, "Member 'WBP_Commands_Slot_Glowing_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing::CallFunc_Conv_BoolToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x0000C8, "Member 'WBP_Commands_Slot_Glowing_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing, K2Node_SwitchEnum_CmpSuccess) == 0x0000D8, "Member 'WBP_Commands_Slot_Glowing_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing, K2Node_Event_MyGeometry) == 0x0000DC, "Member 'WBP_Commands_Slot_Glowing_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing, K2Node_Event_MouseEvent_1) == 0x000118, "Member 'WBP_Commands_Slot_Glowing_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing::K2Node_Event_MouseEvent_1' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing, K2Node_Event_MouseEvent) == 0x000190, "Member 'WBP_Commands_Slot_Glowing_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing::K2Node_Event_MouseEvent' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing, Temp_byte_Variable) == 0x000208, "Member 'WBP_Commands_Slot_Glowing_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing, CallFunc_GetDurationActiveSlotState_ReturnValue) == 0x000209, "Member 'WBP_Commands_Slot_Glowing_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing::CallFunc_GetDurationActiveSlotState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00020A, "Member 'WBP_Commands_Slot_Glowing_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing, CallFunc_GetAlternatingActiveSlotState_ReturnValue) == 0x00020B, "Member 'WBP_Commands_Slot_Glowing_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing::CallFunc_GetAlternatingActiveSlotState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x00020C, "Member 'WBP_Commands_Slot_Glowing_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing, K2Node_Event_IsDesignTime) == 0x00020D, "Member 'WBP_Commands_Slot_Glowing_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing, Temp_bool_Variable) == 0x00020E, "Member 'WBP_Commands_Slot_Glowing_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing, Temp_byte_Variable_1) == 0x00020F, "Member 'WBP_Commands_Slot_Glowing_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing, K2Node_Select_Default) == 0x000210, "Member 'WBP_Commands_Slot_Glowing_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing, CallFunc_GetPathName_ReturnValue) == 0x000218, "Member 'WBP_Commands_Slot_Glowing_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing::CallFunc_GetPathName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing, CallFunc_Concat_StrStr_ReturnValue) == 0x000228, "Member 'WBP_Commands_Slot_Glowing_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000238, "Member 'WBP_Commands_Slot_Glowing_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000248, "Member 'WBP_Commands_Slot_Glowing_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing, CallFunc_Concat_StrStr_ReturnValue_3) == 0x000258, "Member 'WBP_Commands_Slot_Glowing_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing, CallFunc_Concat_StrStr_ReturnValue_4) == 0x000268, "Member 'WBP_Commands_Slot_Glowing_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing::CallFunc_Concat_StrStr_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing, CallFunc_Subtract_DoubleDouble_B_ImplicitCast) == 0x000278, "Member 'WBP_Commands_Slot_Glowing_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing::CallFunc_Subtract_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing, CallFunc_NotEqual_DoubleDouble_A_ImplicitCast) == 0x000280, "Member 'WBP_Commands_Slot_Glowing_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing::CallFunc_NotEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000288, "Member 'WBP_Commands_Slot_Glowing_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");

// Function WBP_Commands_Slot_Glowing.WBP_Commands_Slot_Glowing_C.GetCommandsPanel
// 0x0020 (0x0020 - 0x0000)
struct WBP_Commands_Slot_Glowing_C_GetCommandsPanel final
{
public:
	class UTedCommandsPanel*                      ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UTedContentPanelBase*                   CallFunc_GetParentContentPanel_ReturnValue;        // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UTedCommandsPanel*                      K2Node_DynamicCast_AsTed_Commands_Panel;           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Commands_Slot_Glowing_C_GetCommandsPanel) == 0x000008, "Wrong alignment on WBP_Commands_Slot_Glowing_C_GetCommandsPanel");
static_assert(sizeof(WBP_Commands_Slot_Glowing_C_GetCommandsPanel) == 0x000020, "Wrong size on WBP_Commands_Slot_Glowing_C_GetCommandsPanel");
static_assert(offsetof(WBP_Commands_Slot_Glowing_C_GetCommandsPanel, ReturnValue) == 0x000000, "Member 'WBP_Commands_Slot_Glowing_C_GetCommandsPanel::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_C_GetCommandsPanel, CallFunc_GetParentContentPanel_ReturnValue) == 0x000008, "Member 'WBP_Commands_Slot_Glowing_C_GetCommandsPanel::CallFunc_GetParentContentPanel_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_C_GetCommandsPanel, K2Node_DynamicCast_AsTed_Commands_Panel) == 0x000010, "Member 'WBP_Commands_Slot_Glowing_C_GetCommandsPanel::K2Node_DynamicCast_AsTed_Commands_Panel' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_C_GetCommandsPanel, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WBP_Commands_Slot_Glowing_C_GetCommandsPanel::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WBP_Commands_Slot_Glowing.WBP_Commands_Slot_Glowing_C.GetSlotCDO
// 0x0020 (0x0020 - 0x0000)
struct WBP_Commands_Slot_Glowing_C_GetSlotCDO final
{
public:
	const class UTedCommand*                      ReturnValue;                                       // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSlotIndex_ReturnValue;                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTedCommandsPanel*                      CallFunc_GetCommandsPanel_ReturnValue;             // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	const class UTedCommand*                      CallFunc_GetSlotContentCDO_ReturnValue;            // 0x0018(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Commands_Slot_Glowing_C_GetSlotCDO) == 0x000008, "Wrong alignment on WBP_Commands_Slot_Glowing_C_GetSlotCDO");
static_assert(sizeof(WBP_Commands_Slot_Glowing_C_GetSlotCDO) == 0x000020, "Wrong size on WBP_Commands_Slot_Glowing_C_GetSlotCDO");
static_assert(offsetof(WBP_Commands_Slot_Glowing_C_GetSlotCDO, ReturnValue) == 0x000000, "Member 'WBP_Commands_Slot_Glowing_C_GetSlotCDO::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_C_GetSlotCDO, CallFunc_GetSlotIndex_ReturnValue) == 0x000008, "Member 'WBP_Commands_Slot_Glowing_C_GetSlotCDO::CallFunc_GetSlotIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_C_GetSlotCDO, CallFunc_GetCommandsPanel_ReturnValue) == 0x000010, "Member 'WBP_Commands_Slot_Glowing_C_GetSlotCDO::CallFunc_GetCommandsPanel_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_C_GetSlotCDO, CallFunc_GetSlotContentCDO_ReturnValue) == 0x000018, "Member 'WBP_Commands_Slot_Glowing_C_GetSlotCDO::CallFunc_GetSlotContentCDO_ReturnValue' has a wrong offset!");

// Function WBP_Commands_Slot_Glowing.WBP_Commands_Slot_Glowing_C.HandleHovered
// 0x0098 (0x0098 - 0x0000)
struct WBP_Commands_Slot_Glowing_C_HandleHovered final
{
public:
	bool                                          bInActive;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTedRangeDecalComponent*                RangeComp;                                         // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSlotIndex_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsStateActive_ReturnValue;                // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class ATedPlayerController*                   CallFunc_GetTedPlayerController_ReturnValue;       // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSet<class ATedPawn*>                         CallFunc_GetSelectedPawns_ReturnValue;             // 0x0020(0x0050)(ConstParm)
	TArray<class ATedPawn*>                       CallFunc_Set_ToArray_Result;                       // 0x0070(0x0010)(ReferenceParm)
	bool                                          CallFunc_Set_IsNotEmpty_ReturnValue;               // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATedPawn*                               CallFunc_Array_Get_Item;                           // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTedRangeDecalComponent*                CallFunc_GetComponentByClass_ReturnValue;          // 0x0090(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Commands_Slot_Glowing_C_HandleHovered) == 0x000008, "Wrong alignment on WBP_Commands_Slot_Glowing_C_HandleHovered");
static_assert(sizeof(WBP_Commands_Slot_Glowing_C_HandleHovered) == 0x000098, "Wrong size on WBP_Commands_Slot_Glowing_C_HandleHovered");
static_assert(offsetof(WBP_Commands_Slot_Glowing_C_HandleHovered, bInActive) == 0x000000, "Member 'WBP_Commands_Slot_Glowing_C_HandleHovered::bInActive' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_C_HandleHovered, RangeComp) == 0x000008, "Member 'WBP_Commands_Slot_Glowing_C_HandleHovered::RangeComp' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_C_HandleHovered, CallFunc_GetSlotIndex_ReturnValue) == 0x000010, "Member 'WBP_Commands_Slot_Glowing_C_HandleHovered::CallFunc_GetSlotIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_C_HandleHovered, CallFunc_IsStateActive_ReturnValue) == 0x000014, "Member 'WBP_Commands_Slot_Glowing_C_HandleHovered::CallFunc_IsStateActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_C_HandleHovered, CallFunc_IsValid_ReturnValue) == 0x000015, "Member 'WBP_Commands_Slot_Glowing_C_HandleHovered::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_C_HandleHovered, CallFunc_GetTedPlayerController_ReturnValue) == 0x000018, "Member 'WBP_Commands_Slot_Glowing_C_HandleHovered::CallFunc_GetTedPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_C_HandleHovered, CallFunc_GetSelectedPawns_ReturnValue) == 0x000020, "Member 'WBP_Commands_Slot_Glowing_C_HandleHovered::CallFunc_GetSelectedPawns_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_C_HandleHovered, CallFunc_Set_ToArray_Result) == 0x000070, "Member 'WBP_Commands_Slot_Glowing_C_HandleHovered::CallFunc_Set_ToArray_Result' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_C_HandleHovered, CallFunc_Set_IsNotEmpty_ReturnValue) == 0x000080, "Member 'WBP_Commands_Slot_Glowing_C_HandleHovered::CallFunc_Set_IsNotEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_C_HandleHovered, CallFunc_Array_Get_Item) == 0x000088, "Member 'WBP_Commands_Slot_Glowing_C_HandleHovered::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_C_HandleHovered, CallFunc_GetComponentByClass_ReturnValue) == 0x000090, "Member 'WBP_Commands_Slot_Glowing_C_HandleHovered::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");

// Function WBP_Commands_Slot_Glowing.WBP_Commands_Slot_Glowing_C.HandleSelected
// 0x0098 (0x0098 - 0x0000)
struct WBP_Commands_Slot_Glowing_C_HandleSelected final
{
public:
	bool                                          bInActive;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTedRangeDecalComponent*                RangeComp;                                         // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsStateActive_ReturnValue;                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ATedPlayerController*                   CallFunc_GetTedPlayerController_ReturnValue;       // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSet<class ATedPawn*>                         CallFunc_GetSelectedPawns_ReturnValue;             // 0x0020(0x0050)(ConstParm)
	TArray<class ATedPawn*>                       CallFunc_Set_ToArray_Result;                       // 0x0070(0x0010)(ReferenceParm)
	bool                                          CallFunc_Set_IsNotEmpty_ReturnValue;               // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATedPawn*                               CallFunc_Array_Get_Item;                           // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTedRangeDecalComponent*                CallFunc_GetComponentByClass_ReturnValue;          // 0x0090(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Commands_Slot_Glowing_C_HandleSelected) == 0x000008, "Wrong alignment on WBP_Commands_Slot_Glowing_C_HandleSelected");
static_assert(sizeof(WBP_Commands_Slot_Glowing_C_HandleSelected) == 0x000098, "Wrong size on WBP_Commands_Slot_Glowing_C_HandleSelected");
static_assert(offsetof(WBP_Commands_Slot_Glowing_C_HandleSelected, bInActive) == 0x000000, "Member 'WBP_Commands_Slot_Glowing_C_HandleSelected::bInActive' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_C_HandleSelected, RangeComp) == 0x000008, "Member 'WBP_Commands_Slot_Glowing_C_HandleSelected::RangeComp' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_C_HandleSelected, CallFunc_IsStateActive_ReturnValue) == 0x000010, "Member 'WBP_Commands_Slot_Glowing_C_HandleSelected::CallFunc_IsStateActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_C_HandleSelected, CallFunc_IsValid_ReturnValue) == 0x000011, "Member 'WBP_Commands_Slot_Glowing_C_HandleSelected::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_C_HandleSelected, CallFunc_GetTedPlayerController_ReturnValue) == 0x000018, "Member 'WBP_Commands_Slot_Glowing_C_HandleSelected::CallFunc_GetTedPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_C_HandleSelected, CallFunc_GetSelectedPawns_ReturnValue) == 0x000020, "Member 'WBP_Commands_Slot_Glowing_C_HandleSelected::CallFunc_GetSelectedPawns_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_C_HandleSelected, CallFunc_Set_ToArray_Result) == 0x000070, "Member 'WBP_Commands_Slot_Glowing_C_HandleSelected::CallFunc_Set_ToArray_Result' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_C_HandleSelected, CallFunc_Set_IsNotEmpty_ReturnValue) == 0x000080, "Member 'WBP_Commands_Slot_Glowing_C_HandleSelected::CallFunc_Set_IsNotEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_C_HandleSelected, CallFunc_Array_Get_Item) == 0x000088, "Member 'WBP_Commands_Slot_Glowing_C_HandleSelected::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_C_HandleSelected, CallFunc_GetComponentByClass_ReturnValue) == 0x000090, "Member 'WBP_Commands_Slot_Glowing_C_HandleSelected::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");

// Function WBP_Commands_Slot_Glowing.WBP_Commands_Slot_Glowing_C.OnActivateState
// 0x0002 (0x0002 - 0x0000)
struct WBP_Commands_Slot_Glowing_C_OnActivateState final
{
public:
	ETedContentSlotState                          InState;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bInActivated;                                      // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Commands_Slot_Glowing_C_OnActivateState) == 0x000001, "Wrong alignment on WBP_Commands_Slot_Glowing_C_OnActivateState");
static_assert(sizeof(WBP_Commands_Slot_Glowing_C_OnActivateState) == 0x000002, "Wrong size on WBP_Commands_Slot_Glowing_C_OnActivateState");
static_assert(offsetof(WBP_Commands_Slot_Glowing_C_OnActivateState, InState) == 0x000000, "Member 'WBP_Commands_Slot_Glowing_C_OnActivateState::InState' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_C_OnActivateState, bInActivated) == 0x000001, "Member 'WBP_Commands_Slot_Glowing_C_OnActivateState::bInActivated' has a wrong offset!");

// Function WBP_Commands_Slot_Glowing.WBP_Commands_Slot_Glowing_C.OnMouseEnter
// 0x00B0 (0x00B0 - 0x0000)
struct WBP_Commands_Slot_Glowing_C_OnMouseEnter final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_Commands_Slot_Glowing_C_OnMouseEnter) == 0x000008, "Wrong alignment on WBP_Commands_Slot_Glowing_C_OnMouseEnter");
static_assert(sizeof(WBP_Commands_Slot_Glowing_C_OnMouseEnter) == 0x0000B0, "Wrong size on WBP_Commands_Slot_Glowing_C_OnMouseEnter");
static_assert(offsetof(WBP_Commands_Slot_Glowing_C_OnMouseEnter, MyGeometry) == 0x000000, "Member 'WBP_Commands_Slot_Glowing_C_OnMouseEnter::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_C_OnMouseEnter, MouseEvent) == 0x000038, "Member 'WBP_Commands_Slot_Glowing_C_OnMouseEnter::MouseEvent' has a wrong offset!");

// Function WBP_Commands_Slot_Glowing.WBP_Commands_Slot_Glowing_C.OnMouseLeave
// 0x0078 (0x0078 - 0x0000)
struct WBP_Commands_Slot_Glowing_C_OnMouseLeave final
{
public:
	struct FPointerEvent                          MouseEvent;                                        // 0x0000(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_Commands_Slot_Glowing_C_OnMouseLeave) == 0x000008, "Wrong alignment on WBP_Commands_Slot_Glowing_C_OnMouseLeave");
static_assert(sizeof(WBP_Commands_Slot_Glowing_C_OnMouseLeave) == 0x000078, "Wrong size on WBP_Commands_Slot_Glowing_C_OnMouseLeave");
static_assert(offsetof(WBP_Commands_Slot_Glowing_C_OnMouseLeave, MouseEvent) == 0x000000, "Member 'WBP_Commands_Slot_Glowing_C_OnMouseLeave::MouseEvent' has a wrong offset!");

// Function WBP_Commands_Slot_Glowing.WBP_Commands_Slot_Glowing_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_Commands_Slot_Glowing_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Commands_Slot_Glowing_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_Commands_Slot_Glowing_C_PreConstruct");
static_assert(sizeof(WBP_Commands_Slot_Glowing_C_PreConstruct) == 0x000001, "Wrong size on WBP_Commands_Slot_Glowing_C_PreConstruct");
static_assert(offsetof(WBP_Commands_Slot_Glowing_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_Commands_Slot_Glowing_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_Commands_Slot_Glowing.WBP_Commands_Slot_Glowing_C.RefreshIconOpacity
// 0x0010 (0x0010 - 0x0000)
struct WBP_Commands_Slot_Glowing_C_RefreshIconOpacity final
{
public:
	double                                        CallFunc_EvaluateIconOpacity_Return_Value;         // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetOpacity_InOpacity_ImplicitCast;        // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Commands_Slot_Glowing_C_RefreshIconOpacity) == 0x000008, "Wrong alignment on WBP_Commands_Slot_Glowing_C_RefreshIconOpacity");
static_assert(sizeof(WBP_Commands_Slot_Glowing_C_RefreshIconOpacity) == 0x000010, "Wrong size on WBP_Commands_Slot_Glowing_C_RefreshIconOpacity");
static_assert(offsetof(WBP_Commands_Slot_Glowing_C_RefreshIconOpacity, CallFunc_EvaluateIconOpacity_Return_Value) == 0x000000, "Member 'WBP_Commands_Slot_Glowing_C_RefreshIconOpacity::CallFunc_EvaluateIconOpacity_Return_Value' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_C_RefreshIconOpacity, CallFunc_SetOpacity_InOpacity_ImplicitCast) == 0x000008, "Member 'WBP_Commands_Slot_Glowing_C_RefreshIconOpacity::CallFunc_SetOpacity_InOpacity_ImplicitCast' has a wrong offset!");

// Function WBP_Commands_Slot_Glowing.WBP_Commands_Slot_Glowing_C.RefreshShortcut
// 0x0048 (0x0048 - 0x0000)
struct WBP_Commands_Slot_Glowing_C_RefreshShortcut final
{
public:
	bool                                          CallFunc_IsStateActive_ReturnValue;                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetSlotIndex_ReturnValue;                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTedCommandsPanel*                      CallFunc_GetCommandsPanel_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FInputChord                            CallFunc_GetShortcut_OutShortcut;                  // 0x0010(0x0020)(HasGetValueTypeHash)
	bool                                          CallFunc_GetShortcut_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetChordDisplayText_ReturnValue;          // 0x0038(0x0010)()
};
static_assert(alignof(WBP_Commands_Slot_Glowing_C_RefreshShortcut) == 0x000008, "Wrong alignment on WBP_Commands_Slot_Glowing_C_RefreshShortcut");
static_assert(sizeof(WBP_Commands_Slot_Glowing_C_RefreshShortcut) == 0x000048, "Wrong size on WBP_Commands_Slot_Glowing_C_RefreshShortcut");
static_assert(offsetof(WBP_Commands_Slot_Glowing_C_RefreshShortcut, CallFunc_IsStateActive_ReturnValue) == 0x000000, "Member 'WBP_Commands_Slot_Glowing_C_RefreshShortcut::CallFunc_IsStateActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_C_RefreshShortcut, CallFunc_Not_PreBool_ReturnValue) == 0x000001, "Member 'WBP_Commands_Slot_Glowing_C_RefreshShortcut::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_C_RefreshShortcut, CallFunc_GetSlotIndex_ReturnValue) == 0x000004, "Member 'WBP_Commands_Slot_Glowing_C_RefreshShortcut::CallFunc_GetSlotIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_C_RefreshShortcut, CallFunc_GetCommandsPanel_ReturnValue) == 0x000008, "Member 'WBP_Commands_Slot_Glowing_C_RefreshShortcut::CallFunc_GetCommandsPanel_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_C_RefreshShortcut, CallFunc_GetShortcut_OutShortcut) == 0x000010, "Member 'WBP_Commands_Slot_Glowing_C_RefreshShortcut::CallFunc_GetShortcut_OutShortcut' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_C_RefreshShortcut, CallFunc_GetShortcut_ReturnValue) == 0x000030, "Member 'WBP_Commands_Slot_Glowing_C_RefreshShortcut::CallFunc_GetShortcut_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_C_RefreshShortcut, CallFunc_GetChordDisplayText_ReturnValue) == 0x000038, "Member 'WBP_Commands_Slot_Glowing_C_RefreshShortcut::CallFunc_GetChordDisplayText_ReturnValue' has a wrong offset!");

// Function WBP_Commands_Slot_Glowing.WBP_Commands_Slot_Glowing_C.SetActiveEffectColor
// 0x0040 (0x0040 - 0x0000)
struct WBP_Commands_Slot_Glowing_C_SetActiveEffectColor final
{
public:
	bool                                          Condition;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Commands_Slot_Glowing_C_SetActiveEffectColor) == 0x000008, "Wrong alignment on WBP_Commands_Slot_Glowing_C_SetActiveEffectColor");
static_assert(sizeof(WBP_Commands_Slot_Glowing_C_SetActiveEffectColor) == 0x000040, "Wrong size on WBP_Commands_Slot_Glowing_C_SetActiveEffectColor");
static_assert(offsetof(WBP_Commands_Slot_Glowing_C_SetActiveEffectColor, Condition) == 0x000000, "Member 'WBP_Commands_Slot_Glowing_C_SetActiveEffectColor::Condition' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_C_SetActiveEffectColor, Temp_int_Array_Index_Variable) == 0x000004, "Member 'WBP_Commands_Slot_Glowing_C_SetActiveEffectColor::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_C_SetActiveEffectColor, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'WBP_Commands_Slot_Glowing_C_SetActiveEffectColor::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_C_SetActiveEffectColor, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'WBP_Commands_Slot_Glowing_C_SetActiveEffectColor::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_C_SetActiveEffectColor, K2Node_MakeStruct_LinearColor) == 0x000010, "Member 'WBP_Commands_Slot_Glowing_C_SetActiveEffectColor::K2Node_MakeStruct_LinearColor' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_C_SetActiveEffectColor, CallFunc_Array_Get_Item) == 0x000020, "Member 'WBP_Commands_Slot_Glowing_C_SetActiveEffectColor::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_C_SetActiveEffectColor, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'WBP_Commands_Slot_Glowing_C_SetActiveEffectColor::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_C_SetActiveEffectColor, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000030, "Member 'WBP_Commands_Slot_Glowing_C_SetActiveEffectColor::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_C_SetActiveEffectColor, CallFunc_Less_IntInt_ReturnValue) == 0x000038, "Member 'WBP_Commands_Slot_Glowing_C_SetActiveEffectColor::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_Commands_Slot_Glowing.WBP_Commands_Slot_Glowing_C.SetupCooldownImage
// 0x0008 (0x0008 - 0x0000)
struct WBP_Commands_Slot_Glowing_C_SetupCooldownImage final
{
public:
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Commands_Slot_Glowing_C_SetupCooldownImage) == 0x000008, "Wrong alignment on WBP_Commands_Slot_Glowing_C_SetupCooldownImage");
static_assert(sizeof(WBP_Commands_Slot_Glowing_C_SetupCooldownImage) == 0x000008, "Wrong size on WBP_Commands_Slot_Glowing_C_SetupCooldownImage");
static_assert(offsetof(WBP_Commands_Slot_Glowing_C_SetupCooldownImage, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000000, "Member 'WBP_Commands_Slot_Glowing_C_SetupCooldownImage::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");

// Function WBP_Commands_Slot_Glowing.WBP_Commands_Slot_Glowing_C.Tick
// 0x003C (0x003C - 0x0000)
struct WBP_Commands_Slot_Glowing_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
