#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Popup_Working_1Button

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_Popup_Working_1Button.WBP_Popup_Working_1Button_C.BndEvt__WBP_Popup_Working_1Button_Button_One_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Popup_Working_1Button_C_BndEvt__WBP_Popup_Working_1Button_Button_One_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature final
{
public:
	class UTedUserWidget*                         InWidget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Popup_Working_1Button_C_BndEvt__WBP_Popup_Working_1Button_Button_One_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Popup_Working_1Button_C_BndEvt__WBP_Popup_Working_1Button_Button_One_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature");
static_assert(sizeof(WBP_Popup_Working_1Button_C_BndEvt__WBP_Popup_Working_1Button_Button_One_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_Popup_Working_1Button_C_BndEvt__WBP_Popup_Working_1Button_Button_One_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature");
static_assert(offsetof(WBP_Popup_Working_1Button_C_BndEvt__WBP_Popup_Working_1Button_Button_One_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature, InWidget) == 0x000000, "Member 'WBP_Popup_Working_1Button_C_BndEvt__WBP_Popup_Working_1Button_Button_One_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature::InWidget' has a wrong offset!");

// Function WBP_Popup_Working_1Button.WBP_Popup_Working_1Button_C.ExecuteUbergraph_WBP_Popup_Working_1Button
// 0x0010 (0x0010 - 0x0000)
struct WBP_Popup_Working_1Button_C_ExecuteUbergraph_WBP_Popup_Working_1Button final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTedUserWidget*                         K2Node_ComponentBoundEvent_InWidget;               // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Popup_Working_1Button_C_ExecuteUbergraph_WBP_Popup_Working_1Button) == 0x000008, "Wrong alignment on WBP_Popup_Working_1Button_C_ExecuteUbergraph_WBP_Popup_Working_1Button");
static_assert(sizeof(WBP_Popup_Working_1Button_C_ExecuteUbergraph_WBP_Popup_Working_1Button) == 0x000010, "Wrong size on WBP_Popup_Working_1Button_C_ExecuteUbergraph_WBP_Popup_Working_1Button");
static_assert(offsetof(WBP_Popup_Working_1Button_C_ExecuteUbergraph_WBP_Popup_Working_1Button, EntryPoint) == 0x000000, "Member 'WBP_Popup_Working_1Button_C_ExecuteUbergraph_WBP_Popup_Working_1Button::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Working_1Button_C_ExecuteUbergraph_WBP_Popup_Working_1Button, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000004, "Member 'WBP_Popup_Working_1Button_C_ExecuteUbergraph_WBP_Popup_Working_1Button::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Working_1Button_C_ExecuteUbergraph_WBP_Popup_Working_1Button, K2Node_ComponentBoundEvent_InWidget) == 0x000008, "Member 'WBP_Popup_Working_1Button_C_ExecuteUbergraph_WBP_Popup_Working_1Button::K2Node_ComponentBoundEvent_InWidget' has a wrong offset!");

// Function WBP_Popup_Working_1Button.WBP_Popup_Working_1Button_C.RefreshUI
// 0x0020 (0x0020 - 0x0000)
struct WBP_Popup_Working_1Button_C_RefreshUI final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetHeaderText_ReturnValue;                // 0x0008(0x0010)(ConstParm)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Popup_Working_1Button_C_RefreshUI) == 0x000008, "Wrong alignment on WBP_Popup_Working_1Button_C_RefreshUI");
static_assert(sizeof(WBP_Popup_Working_1Button_C_RefreshUI) == 0x000020, "Wrong size on WBP_Popup_Working_1Button_C_RefreshUI");
static_assert(offsetof(WBP_Popup_Working_1Button_C_RefreshUI, Temp_bool_Variable) == 0x000000, "Member 'WBP_Popup_Working_1Button_C_RefreshUI::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Working_1Button_C_RefreshUI, Temp_byte_Variable) == 0x000001, "Member 'WBP_Popup_Working_1Button_C_RefreshUI::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Working_1Button_C_RefreshUI, Temp_byte_Variable_1) == 0x000002, "Member 'WBP_Popup_Working_1Button_C_RefreshUI::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Working_1Button_C_RefreshUI, CallFunc_GetHeaderText_ReturnValue) == 0x000008, "Member 'WBP_Popup_Working_1Button_C_RefreshUI::CallFunc_GetHeaderText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Working_1Button_C_RefreshUI, CallFunc_TextIsEmpty_ReturnValue) == 0x000018, "Member 'WBP_Popup_Working_1Button_C_RefreshUI::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Working_1Button_C_RefreshUI, K2Node_Select_Default) == 0x000019, "Member 'WBP_Popup_Working_1Button_C_RefreshUI::K2Node_Select_Default' has a wrong offset!");

}

