#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_HUD_StructureControls_Slot

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Tempest_structs.hpp"


namespace SDK::Params
{

// Function WBP_HUD_StructureControls_Slot.WBP_HUD_StructureControls_Slot_C.ExecuteUbergraph_WBP_HUD_StructureControls_Slot
// 0x0008 (0x0008 - 0x0000)
struct WBP_HUD_StructureControls_Slot_C_ExecuteUbergraph_WBP_HUD_StructureControls_Slot final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETedContentSlotState                          K2Node_Event_InState;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInActivated;                         // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_StructureControls_Slot_C_ExecuteUbergraph_WBP_HUD_StructureControls_Slot) == 0x000004, "Wrong alignment on WBP_HUD_StructureControls_Slot_C_ExecuteUbergraph_WBP_HUD_StructureControls_Slot");
static_assert(sizeof(WBP_HUD_StructureControls_Slot_C_ExecuteUbergraph_WBP_HUD_StructureControls_Slot) == 0x000008, "Wrong size on WBP_HUD_StructureControls_Slot_C_ExecuteUbergraph_WBP_HUD_StructureControls_Slot");
static_assert(offsetof(WBP_HUD_StructureControls_Slot_C_ExecuteUbergraph_WBP_HUD_StructureControls_Slot, EntryPoint) == 0x000000, "Member 'WBP_HUD_StructureControls_Slot_C_ExecuteUbergraph_WBP_HUD_StructureControls_Slot::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_HUD_StructureControls_Slot_C_ExecuteUbergraph_WBP_HUD_StructureControls_Slot, K2Node_Event_InState) == 0x000004, "Member 'WBP_HUD_StructureControls_Slot_C_ExecuteUbergraph_WBP_HUD_StructureControls_Slot::K2Node_Event_InState' has a wrong offset!");
static_assert(offsetof(WBP_HUD_StructureControls_Slot_C_ExecuteUbergraph_WBP_HUD_StructureControls_Slot, K2Node_Event_bInActivated) == 0x000005, "Member 'WBP_HUD_StructureControls_Slot_C_ExecuteUbergraph_WBP_HUD_StructureControls_Slot::K2Node_Event_bInActivated' has a wrong offset!");
static_assert(offsetof(WBP_HUD_StructureControls_Slot_C_ExecuteUbergraph_WBP_HUD_StructureControls_Slot, K2Node_SwitchEnum_CmpSuccess) == 0x000006, "Member 'WBP_HUD_StructureControls_Slot_C_ExecuteUbergraph_WBP_HUD_StructureControls_Slot::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function WBP_HUD_StructureControls_Slot.WBP_HUD_StructureControls_Slot_C.OnActivateState
// 0x0002 (0x0002 - 0x0000)
struct WBP_HUD_StructureControls_Slot_C_OnActivateState final
{
public:
	ETedContentSlotState                          InState;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bInActivated;                                      // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_StructureControls_Slot_C_OnActivateState) == 0x000001, "Wrong alignment on WBP_HUD_StructureControls_Slot_C_OnActivateState");
static_assert(sizeof(WBP_HUD_StructureControls_Slot_C_OnActivateState) == 0x000002, "Wrong size on WBP_HUD_StructureControls_Slot_C_OnActivateState");
static_assert(offsetof(WBP_HUD_StructureControls_Slot_C_OnActivateState, InState) == 0x000000, "Member 'WBP_HUD_StructureControls_Slot_C_OnActivateState::InState' has a wrong offset!");
static_assert(offsetof(WBP_HUD_StructureControls_Slot_C_OnActivateState, bInActivated) == 0x000001, "Member 'WBP_HUD_StructureControls_Slot_C_OnActivateState::bInActivated' has a wrong offset!");

// Function WBP_HUD_StructureControls_Slot.WBP_HUD_StructureControls_Slot_C.RefreshHoverVisibility
// 0x0005 (0x0005 - 0x0000)
struct WBP_HUD_StructureControls_Slot_C_RefreshHoverVisibility final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsStateActive_ReturnValue;                // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_StructureControls_Slot_C_RefreshHoverVisibility) == 0x000001, "Wrong alignment on WBP_HUD_StructureControls_Slot_C_RefreshHoverVisibility");
static_assert(sizeof(WBP_HUD_StructureControls_Slot_C_RefreshHoverVisibility) == 0x000005, "Wrong size on WBP_HUD_StructureControls_Slot_C_RefreshHoverVisibility");
static_assert(offsetof(WBP_HUD_StructureControls_Slot_C_RefreshHoverVisibility, Temp_bool_Variable) == 0x000000, "Member 'WBP_HUD_StructureControls_Slot_C_RefreshHoverVisibility::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_HUD_StructureControls_Slot_C_RefreshHoverVisibility, Temp_byte_Variable) == 0x000001, "Member 'WBP_HUD_StructureControls_Slot_C_RefreshHoverVisibility::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_HUD_StructureControls_Slot_C_RefreshHoverVisibility, Temp_byte_Variable_1) == 0x000002, "Member 'WBP_HUD_StructureControls_Slot_C_RefreshHoverVisibility::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_HUD_StructureControls_Slot_C_RefreshHoverVisibility, CallFunc_IsStateActive_ReturnValue) == 0x000003, "Member 'WBP_HUD_StructureControls_Slot_C_RefreshHoverVisibility::CallFunc_IsStateActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_StructureControls_Slot_C_RefreshHoverVisibility, K2Node_Select_Default) == 0x000004, "Member 'WBP_HUD_StructureControls_Slot_C_RefreshHoverVisibility::K2Node_Select_Default' has a wrong offset!");

// Function WBP_HUD_StructureControls_Slot.WBP_HUD_StructureControls_Slot_C.RefreshIcon
// 0x0040 (0x0040 - 0x0000)
struct WBP_HUD_StructureControls_Slot_C_RefreshIcon final
{
public:
	class UTexture2D*                             CallFunc_GetCommandUIData_OutIcon;                 // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             CallFunc_GetCommandUIData_OutCursor;               // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetCommandUIData_OutName;                 // 0x0010(0x0010)()
	class FText                                   CallFunc_GetCommandUIData_OutDescription;          // 0x0020(0x0010)()
	bool                                          CallFunc_GetCommandUIData_ReturnValue;             // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_StructureControls_Slot_C_RefreshIcon) == 0x000008, "Wrong alignment on WBP_HUD_StructureControls_Slot_C_RefreshIcon");
static_assert(sizeof(WBP_HUD_StructureControls_Slot_C_RefreshIcon) == 0x000040, "Wrong size on WBP_HUD_StructureControls_Slot_C_RefreshIcon");
static_assert(offsetof(WBP_HUD_StructureControls_Slot_C_RefreshIcon, CallFunc_GetCommandUIData_OutIcon) == 0x000000, "Member 'WBP_HUD_StructureControls_Slot_C_RefreshIcon::CallFunc_GetCommandUIData_OutIcon' has a wrong offset!");
static_assert(offsetof(WBP_HUD_StructureControls_Slot_C_RefreshIcon, CallFunc_GetCommandUIData_OutCursor) == 0x000008, "Member 'WBP_HUD_StructureControls_Slot_C_RefreshIcon::CallFunc_GetCommandUIData_OutCursor' has a wrong offset!");
static_assert(offsetof(WBP_HUD_StructureControls_Slot_C_RefreshIcon, CallFunc_GetCommandUIData_OutName) == 0x000010, "Member 'WBP_HUD_StructureControls_Slot_C_RefreshIcon::CallFunc_GetCommandUIData_OutName' has a wrong offset!");
static_assert(offsetof(WBP_HUD_StructureControls_Slot_C_RefreshIcon, CallFunc_GetCommandUIData_OutDescription) == 0x000020, "Member 'WBP_HUD_StructureControls_Slot_C_RefreshIcon::CallFunc_GetCommandUIData_OutDescription' has a wrong offset!");
static_assert(offsetof(WBP_HUD_StructureControls_Slot_C_RefreshIcon, CallFunc_GetCommandUIData_ReturnValue) == 0x000030, "Member 'WBP_HUD_StructureControls_Slot_C_RefreshIcon::CallFunc_GetCommandUIData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_StructureControls_Slot_C_RefreshIcon, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000038, "Member 'WBP_HUD_StructureControls_Slot_C_RefreshIcon::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");

// Function WBP_HUD_StructureControls_Slot.WBP_HUD_StructureControls_Slot_C.GetMaterialsSupportingStates
// 0x0030 (0x0030 - 0x0000)
struct WBP_HUD_StructureControls_Slot_C_GetMaterialsSupportingStates final
{
public:
	TArray<class UMaterialInstanceDynamic*>       OutMIDs;                                           // 0x0000(0x0010)(Parm, OutParm)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UMaterialInstanceDynamic*>       K2Node_MakeArray_Array;                            // 0x0020(0x0010)(ReferenceParm)
};
static_assert(alignof(WBP_HUD_StructureControls_Slot_C_GetMaterialsSupportingStates) == 0x000008, "Wrong alignment on WBP_HUD_StructureControls_Slot_C_GetMaterialsSupportingStates");
static_assert(sizeof(WBP_HUD_StructureControls_Slot_C_GetMaterialsSupportingStates) == 0x000030, "Wrong size on WBP_HUD_StructureControls_Slot_C_GetMaterialsSupportingStates");
static_assert(offsetof(WBP_HUD_StructureControls_Slot_C_GetMaterialsSupportingStates, OutMIDs) == 0x000000, "Member 'WBP_HUD_StructureControls_Slot_C_GetMaterialsSupportingStates::OutMIDs' has a wrong offset!");
static_assert(offsetof(WBP_HUD_StructureControls_Slot_C_GetMaterialsSupportingStates, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000010, "Member 'WBP_HUD_StructureControls_Slot_C_GetMaterialsSupportingStates::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_StructureControls_Slot_C_GetMaterialsSupportingStates, CallFunc_GetDynamicMaterial_ReturnValue_1) == 0x000018, "Member 'WBP_HUD_StructureControls_Slot_C_GetMaterialsSupportingStates::CallFunc_GetDynamicMaterial_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_HUD_StructureControls_Slot_C_GetMaterialsSupportingStates, K2Node_MakeArray_Array) == 0x000020, "Member 'WBP_HUD_StructureControls_Slot_C_GetMaterialsSupportingStates::K2Node_MakeArray_Array' has a wrong offset!");

}

