#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_InputMapping_Slot

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Tempest_structs.hpp"
#include "Tempest_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_InputMapping_Slot.WBP_InputMapping_Slot_C
// 0x0018 (0x0448 - 0x0430)
class UWBP_InputMapping_Slot_C final : public UTedContentPanelSlotButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0430(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTedImage*                              Image_BG;                                          // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Label;                                   // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void SetButtonState(const class FString& NewState);
	void RefreshUI();
	void RefreshText();
	void RefreshBackground();
	void OnActivateState(ETedContentSlotState InState, bool bInActivated);
	void GetPanel(class UTedInputMappingPanel** Out);
	void ExecuteUbergraph_WBP_InputMapping_Slot(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_InputMapping_Slot_C">();
	}
	static class UWBP_InputMapping_Slot_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_InputMapping_Slot_C>();
	}
};
static_assert(alignof(UWBP_InputMapping_Slot_C) == 0x000008, "Wrong alignment on UWBP_InputMapping_Slot_C");
static_assert(sizeof(UWBP_InputMapping_Slot_C) == 0x000448, "Wrong size on UWBP_InputMapping_Slot_C");
static_assert(offsetof(UWBP_InputMapping_Slot_C, UberGraphFrame) == 0x000430, "Member 'UWBP_InputMapping_Slot_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_InputMapping_Slot_C, Image_BG) == 0x000438, "Member 'UWBP_InputMapping_Slot_C::Image_BG' has a wrong offset!");
static_assert(offsetof(UWBP_InputMapping_Slot_C, TextBlock_Label) == 0x000440, "Member 'UWBP_InputMapping_Slot_C::TextBlock_Label' has a wrong offset!");

}

