#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Settings_Slot_Button

#include "Basic.hpp"

#include "Tempest_classes.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Settings_Slot_Button.WBP_Settings_Slot_Button_C
// 0x0050 (0x04F8 - 0x04A8)
class UWBP_Settings_Slot_Button_C final : public UTedSettingsSlot_Button
{
public:
	struct FSlateColor                            TextColor_Default;                                 // 0x04A8(0x0014)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateColor                            TextColor_Selected;                                // 0x04BC(0x0014)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateColor                            TextColor_Hovered;                                 // 0x04D0(0x0014)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateColor                            TextColor_Disabled;                                // 0x04E4(0x0014)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Settings_Slot_Button_C">();
	}
	static class UWBP_Settings_Slot_Button_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Settings_Slot_Button_C>();
	}
};
static_assert(alignof(UWBP_Settings_Slot_Button_C) == 0x000008, "Wrong alignment on UWBP_Settings_Slot_Button_C");
static_assert(sizeof(UWBP_Settings_Slot_Button_C) == 0x0004F8, "Wrong size on UWBP_Settings_Slot_Button_C");
static_assert(offsetof(UWBP_Settings_Slot_Button_C, TextColor_Default) == 0x0004A8, "Member 'UWBP_Settings_Slot_Button_C::TextColor_Default' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_Slot_Button_C, TextColor_Selected) == 0x0004BC, "Member 'UWBP_Settings_Slot_Button_C::TextColor_Selected' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_Slot_Button_C, TextColor_Hovered) == 0x0004D0, "Member 'UWBP_Settings_Slot_Button_C::TextColor_Hovered' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_Slot_Button_C, TextColor_Disabled) == 0x0004E4, "Member 'UWBP_Settings_Slot_Button_C::TextColor_Disabled' has a wrong offset!");

}

