#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_HarvestersCard_Panel

#include "Basic.hpp"

#include "Tempest_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_HarvestersCard_Panel.WBP_HarvestersCard_Panel_C.OnRegisterContentSlot
// 0x0040 (0x0040 - 0x0000)
struct WBP_HarvestersCard_Panel_C_OnRegisterContentSlot final
{
public:
	class UTedContentPanelSlotBase*               InContentSlot;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ETedContentPanelRegistration                  InMode;                                            // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMargin                                SlotPadding;                                       // 0x000C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGridSlot*                              CallFunc_SlotAsGridSlot_ReturnValue;               // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UGridSlot*                              CallFunc_SlotAsGridSlot_ReturnValue_1;             // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSlotIndex_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_EvaluateRowAndColumn_Columns_OutRow;      // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_EvaluateRowAndColumn_Columns_OutColumn;   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HarvestersCard_Panel_C_OnRegisterContentSlot) == 0x000008, "Wrong alignment on WBP_HarvestersCard_Panel_C_OnRegisterContentSlot");
static_assert(sizeof(WBP_HarvestersCard_Panel_C_OnRegisterContentSlot) == 0x000040, "Wrong size on WBP_HarvestersCard_Panel_C_OnRegisterContentSlot");
static_assert(offsetof(WBP_HarvestersCard_Panel_C_OnRegisterContentSlot, InContentSlot) == 0x000000, "Member 'WBP_HarvestersCard_Panel_C_OnRegisterContentSlot::InContentSlot' has a wrong offset!");
static_assert(offsetof(WBP_HarvestersCard_Panel_C_OnRegisterContentSlot, InMode) == 0x000008, "Member 'WBP_HarvestersCard_Panel_C_OnRegisterContentSlot::InMode' has a wrong offset!");
static_assert(offsetof(WBP_HarvestersCard_Panel_C_OnRegisterContentSlot, SlotPadding) == 0x00000C, "Member 'WBP_HarvestersCard_Panel_C_OnRegisterContentSlot::SlotPadding' has a wrong offset!");
static_assert(offsetof(WBP_HarvestersCard_Panel_C_OnRegisterContentSlot, CallFunc_SlotAsGridSlot_ReturnValue) == 0x000020, "Member 'WBP_HarvestersCard_Panel_C_OnRegisterContentSlot::CallFunc_SlotAsGridSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HarvestersCard_Panel_C_OnRegisterContentSlot, CallFunc_SlotAsGridSlot_ReturnValue_1) == 0x000028, "Member 'WBP_HarvestersCard_Panel_C_OnRegisterContentSlot::CallFunc_SlotAsGridSlot_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_HarvestersCard_Panel_C_OnRegisterContentSlot, CallFunc_GetSlotIndex_ReturnValue) == 0x000030, "Member 'WBP_HarvestersCard_Panel_C_OnRegisterContentSlot::CallFunc_GetSlotIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HarvestersCard_Panel_C_OnRegisterContentSlot, CallFunc_EvaluateRowAndColumn_Columns_OutRow) == 0x000034, "Member 'WBP_HarvestersCard_Panel_C_OnRegisterContentSlot::CallFunc_EvaluateRowAndColumn_Columns_OutRow' has a wrong offset!");
static_assert(offsetof(WBP_HarvestersCard_Panel_C_OnRegisterContentSlot, CallFunc_EvaluateRowAndColumn_Columns_OutColumn) == 0x000038, "Member 'WBP_HarvestersCard_Panel_C_OnRegisterContentSlot::CallFunc_EvaluateRowAndColumn_Columns_OutColumn' has a wrong offset!");

}

