#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_HUD_Popup

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_HUD_Popup.WBP_HUD_Popup_C.ExecuteUbergraph_WBP_HUD_Popup
// 0x0028 (0x0028 - 0x0000)
struct WBP_HUD_Popup_C_ExecuteUbergraph_WBP_HUD_Popup final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Popup_Working_1Button_C*           K2Node_DynamicCast_AsWBP_Popup_Working_1Button;    // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Popup_Working_1Button_C*           K2Node_DynamicCast_AsWBP_Popup_Working_1Button_1;  // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_Popup_C_ExecuteUbergraph_WBP_HUD_Popup) == 0x000008, "Wrong alignment on WBP_HUD_Popup_C_ExecuteUbergraph_WBP_HUD_Popup");
static_assert(sizeof(WBP_HUD_Popup_C_ExecuteUbergraph_WBP_HUD_Popup) == 0x000028, "Wrong size on WBP_HUD_Popup_C_ExecuteUbergraph_WBP_HUD_Popup");
static_assert(offsetof(WBP_HUD_Popup_C_ExecuteUbergraph_WBP_HUD_Popup, EntryPoint) == 0x000000, "Member 'WBP_HUD_Popup_C_ExecuteUbergraph_WBP_HUD_Popup::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_HUD_Popup_C_ExecuteUbergraph_WBP_HUD_Popup, K2Node_DynamicCast_AsWBP_Popup_Working_1Button) == 0x000008, "Member 'WBP_HUD_Popup_C_ExecuteUbergraph_WBP_HUD_Popup::K2Node_DynamicCast_AsWBP_Popup_Working_1Button' has a wrong offset!");
static_assert(offsetof(WBP_HUD_Popup_C_ExecuteUbergraph_WBP_HUD_Popup, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'WBP_HUD_Popup_C_ExecuteUbergraph_WBP_HUD_Popup::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_HUD_Popup_C_ExecuteUbergraph_WBP_HUD_Popup, K2Node_DynamicCast_AsWBP_Popup_Working_1Button_1) == 0x000018, "Member 'WBP_HUD_Popup_C_ExecuteUbergraph_WBP_HUD_Popup::K2Node_DynamicCast_AsWBP_Popup_Working_1Button_1' has a wrong offset!");
static_assert(offsetof(WBP_HUD_Popup_C_ExecuteUbergraph_WBP_HUD_Popup, K2Node_DynamicCast_bSuccess_1) == 0x000020, "Member 'WBP_HUD_Popup_C_ExecuteUbergraph_WBP_HUD_Popup::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

}

