#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_InputMapping_Slot

#include "Basic.hpp"

#include "Tempest_structs.hpp"


namespace SDK::Params
{

// Function WBP_InputMapping_Slot.WBP_InputMapping_Slot_C.SetButtonState
// 0x0028 (0x0028 - 0x0000)
struct WBP_InputMapping_Slot_C_SetButtonState final
{
public:
	class FString                                 NewState;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               DynMat;                                            // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StriStri_ReturnValue;          // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StriStri_ReturnValue_1;        // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StriStri_ReturnValue_2;        // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StriStri_ReturnValue_3;        // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StriStri_ReturnValue_4;        // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StriStri_ReturnValue_5;        // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StriStri_ReturnValue_6;        // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F[0x1];                                       // 0x001F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_InputMapping_Slot_C_SetButtonState) == 0x000008, "Wrong alignment on WBP_InputMapping_Slot_C_SetButtonState");
static_assert(sizeof(WBP_InputMapping_Slot_C_SetButtonState) == 0x000028, "Wrong size on WBP_InputMapping_Slot_C_SetButtonState");
static_assert(offsetof(WBP_InputMapping_Slot_C_SetButtonState, NewState) == 0x000000, "Member 'WBP_InputMapping_Slot_C_SetButtonState::NewState' has a wrong offset!");
static_assert(offsetof(WBP_InputMapping_Slot_C_SetButtonState, DynMat) == 0x000010, "Member 'WBP_InputMapping_Slot_C_SetButtonState::DynMat' has a wrong offset!");
static_assert(offsetof(WBP_InputMapping_Slot_C_SetButtonState, CallFunc_EqualEqual_StriStri_ReturnValue) == 0x000018, "Member 'WBP_InputMapping_Slot_C_SetButtonState::CallFunc_EqualEqual_StriStri_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InputMapping_Slot_C_SetButtonState, CallFunc_EqualEqual_StriStri_ReturnValue_1) == 0x000019, "Member 'WBP_InputMapping_Slot_C_SetButtonState::CallFunc_EqualEqual_StriStri_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_InputMapping_Slot_C_SetButtonState, CallFunc_EqualEqual_StriStri_ReturnValue_2) == 0x00001A, "Member 'WBP_InputMapping_Slot_C_SetButtonState::CallFunc_EqualEqual_StriStri_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_InputMapping_Slot_C_SetButtonState, CallFunc_EqualEqual_StriStri_ReturnValue_3) == 0x00001B, "Member 'WBP_InputMapping_Slot_C_SetButtonState::CallFunc_EqualEqual_StriStri_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_InputMapping_Slot_C_SetButtonState, CallFunc_EqualEqual_StriStri_ReturnValue_4) == 0x00001C, "Member 'WBP_InputMapping_Slot_C_SetButtonState::CallFunc_EqualEqual_StriStri_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_InputMapping_Slot_C_SetButtonState, CallFunc_EqualEqual_StriStri_ReturnValue_5) == 0x00001D, "Member 'WBP_InputMapping_Slot_C_SetButtonState::CallFunc_EqualEqual_StriStri_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_InputMapping_Slot_C_SetButtonState, CallFunc_EqualEqual_StriStri_ReturnValue_6) == 0x00001E, "Member 'WBP_InputMapping_Slot_C_SetButtonState::CallFunc_EqualEqual_StriStri_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WBP_InputMapping_Slot_C_SetButtonState, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000020, "Member 'WBP_InputMapping_Slot_C_SetButtonState::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");

// Function WBP_InputMapping_Slot.WBP_InputMapping_Slot_C.RefreshText
// 0x0050 (0x0050 - 0x0000)
struct WBP_InputMapping_Slot_C_RefreshText final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0008(0x0010)()
	int32                                         CallFunc_GetSlotIndex_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTedInputMappingPanel*                  CallFunc_GetPanel_Out;                             // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetContentDisplayText_ReturnValue;        // 0x0028(0x0010)()
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x0040(0x0010)()
};
static_assert(alignof(WBP_InputMapping_Slot_C_RefreshText) == 0x000008, "Wrong alignment on WBP_InputMapping_Slot_C_RefreshText");
static_assert(sizeof(WBP_InputMapping_Slot_C_RefreshText) == 0x000050, "Wrong size on WBP_InputMapping_Slot_C_RefreshText");
static_assert(offsetof(WBP_InputMapping_Slot_C_RefreshText, Temp_bool_Variable) == 0x000000, "Member 'WBP_InputMapping_Slot_C_RefreshText::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_InputMapping_Slot_C_RefreshText, Temp_text_Variable) == 0x000008, "Member 'WBP_InputMapping_Slot_C_RefreshText::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(WBP_InputMapping_Slot_C_RefreshText, CallFunc_GetSlotIndex_ReturnValue) == 0x000018, "Member 'WBP_InputMapping_Slot_C_RefreshText::CallFunc_GetSlotIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InputMapping_Slot_C_RefreshText, CallFunc_GetPanel_Out) == 0x000020, "Member 'WBP_InputMapping_Slot_C_RefreshText::CallFunc_GetPanel_Out' has a wrong offset!");
static_assert(offsetof(WBP_InputMapping_Slot_C_RefreshText, CallFunc_GetContentDisplayText_ReturnValue) == 0x000028, "Member 'WBP_InputMapping_Slot_C_RefreshText::CallFunc_GetContentDisplayText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InputMapping_Slot_C_RefreshText, CallFunc_TextIsEmpty_ReturnValue) == 0x000038, "Member 'WBP_InputMapping_Slot_C_RefreshText::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InputMapping_Slot_C_RefreshText, K2Node_Select_Default) == 0x000040, "Member 'WBP_InputMapping_Slot_C_RefreshText::K2Node_Select_Default' has a wrong offset!");

// Function WBP_InputMapping_Slot.WBP_InputMapping_Slot_C.RefreshBackground
// 0x0028 (0x0028 - 0x0000)
struct WBP_InputMapping_Slot_C_RefreshBackground final
{
public:
	struct FTedContentSlotStateAssetSelector      CallFunc_K2_GetAssetSelector_Out;                  // 0x0000(0x0018)()
	bool                                          CallFunc_K2_GetAssetSelector_ReturnValue;          // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USlateBrushAsset*                       CallFunc_GetBrushFromSelector_ContentSlot_ReturnValue; // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_InputMapping_Slot_C_RefreshBackground) == 0x000008, "Wrong alignment on WBP_InputMapping_Slot_C_RefreshBackground");
static_assert(sizeof(WBP_InputMapping_Slot_C_RefreshBackground) == 0x000028, "Wrong size on WBP_InputMapping_Slot_C_RefreshBackground");
static_assert(offsetof(WBP_InputMapping_Slot_C_RefreshBackground, CallFunc_K2_GetAssetSelector_Out) == 0x000000, "Member 'WBP_InputMapping_Slot_C_RefreshBackground::CallFunc_K2_GetAssetSelector_Out' has a wrong offset!");
static_assert(offsetof(WBP_InputMapping_Slot_C_RefreshBackground, CallFunc_K2_GetAssetSelector_ReturnValue) == 0x000018, "Member 'WBP_InputMapping_Slot_C_RefreshBackground::CallFunc_K2_GetAssetSelector_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InputMapping_Slot_C_RefreshBackground, CallFunc_GetBrushFromSelector_ContentSlot_ReturnValue) == 0x000020, "Member 'WBP_InputMapping_Slot_C_RefreshBackground::CallFunc_GetBrushFromSelector_ContentSlot_ReturnValue' has a wrong offset!");

// Function WBP_InputMapping_Slot.WBP_InputMapping_Slot_C.OnActivateState
// 0x0002 (0x0002 - 0x0000)
struct WBP_InputMapping_Slot_C_OnActivateState final
{
public:
	ETedContentSlotState                          InState;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bInActivated;                                      // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_InputMapping_Slot_C_OnActivateState) == 0x000001, "Wrong alignment on WBP_InputMapping_Slot_C_OnActivateState");
static_assert(sizeof(WBP_InputMapping_Slot_C_OnActivateState) == 0x000002, "Wrong size on WBP_InputMapping_Slot_C_OnActivateState");
static_assert(offsetof(WBP_InputMapping_Slot_C_OnActivateState, InState) == 0x000000, "Member 'WBP_InputMapping_Slot_C_OnActivateState::InState' has a wrong offset!");
static_assert(offsetof(WBP_InputMapping_Slot_C_OnActivateState, bInActivated) == 0x000001, "Member 'WBP_InputMapping_Slot_C_OnActivateState::bInActivated' has a wrong offset!");

// Function WBP_InputMapping_Slot.WBP_InputMapping_Slot_C.GetPanel
// 0x0020 (0x0020 - 0x0000)
struct WBP_InputMapping_Slot_C_GetPanel final
{
public:
	class UTedInputMappingPanel*                  Out;                                               // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UTedContentPanelBase*                   CallFunc_GetParentContentPanel_ReturnValue;        // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UTedInputMappingPanel*                  K2Node_DynamicCast_AsTed_Input_Mapping_Panel;      // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_InputMapping_Slot_C_GetPanel) == 0x000008, "Wrong alignment on WBP_InputMapping_Slot_C_GetPanel");
static_assert(sizeof(WBP_InputMapping_Slot_C_GetPanel) == 0x000020, "Wrong size on WBP_InputMapping_Slot_C_GetPanel");
static_assert(offsetof(WBP_InputMapping_Slot_C_GetPanel, Out) == 0x000000, "Member 'WBP_InputMapping_Slot_C_GetPanel::Out' has a wrong offset!");
static_assert(offsetof(WBP_InputMapping_Slot_C_GetPanel, CallFunc_GetParentContentPanel_ReturnValue) == 0x000008, "Member 'WBP_InputMapping_Slot_C_GetPanel::CallFunc_GetParentContentPanel_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InputMapping_Slot_C_GetPanel, K2Node_DynamicCast_AsTed_Input_Mapping_Panel) == 0x000010, "Member 'WBP_InputMapping_Slot_C_GetPanel::K2Node_DynamicCast_AsTed_Input_Mapping_Panel' has a wrong offset!");
static_assert(offsetof(WBP_InputMapping_Slot_C_GetPanel, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WBP_InputMapping_Slot_C_GetPanel::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WBP_InputMapping_Slot.WBP_InputMapping_Slot_C.ExecuteUbergraph_WBP_InputMapping_Slot
// 0x0008 (0x0008 - 0x0000)
struct WBP_InputMapping_Slot_C_ExecuteUbergraph_WBP_InputMapping_Slot final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETedContentSlotState                          K2Node_Event_InState;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInActivated;                         // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_InputMapping_Slot_C_ExecuteUbergraph_WBP_InputMapping_Slot) == 0x000004, "Wrong alignment on WBP_InputMapping_Slot_C_ExecuteUbergraph_WBP_InputMapping_Slot");
static_assert(sizeof(WBP_InputMapping_Slot_C_ExecuteUbergraph_WBP_InputMapping_Slot) == 0x000008, "Wrong size on WBP_InputMapping_Slot_C_ExecuteUbergraph_WBP_InputMapping_Slot");
static_assert(offsetof(WBP_InputMapping_Slot_C_ExecuteUbergraph_WBP_InputMapping_Slot, EntryPoint) == 0x000000, "Member 'WBP_InputMapping_Slot_C_ExecuteUbergraph_WBP_InputMapping_Slot::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_InputMapping_Slot_C_ExecuteUbergraph_WBP_InputMapping_Slot, K2Node_Event_InState) == 0x000004, "Member 'WBP_InputMapping_Slot_C_ExecuteUbergraph_WBP_InputMapping_Slot::K2Node_Event_InState' has a wrong offset!");
static_assert(offsetof(WBP_InputMapping_Slot_C_ExecuteUbergraph_WBP_InputMapping_Slot, K2Node_Event_bInActivated) == 0x000005, "Member 'WBP_InputMapping_Slot_C_ExecuteUbergraph_WBP_InputMapping_Slot::K2Node_Event_bInActivated' has a wrong offset!");
static_assert(offsetof(WBP_InputMapping_Slot_C_ExecuteUbergraph_WBP_InputMapping_Slot, K2Node_SwitchEnum_CmpSuccess) == 0x000006, "Member 'WBP_InputMapping_Slot_C_ExecuteUbergraph_WBP_InputMapping_Slot::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

}

