#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SaveLoad_SaveSlot

#include "Basic.hpp"

#include "Tempest_structs.hpp"


namespace SDK::Params
{

// Function WBP_SaveLoad_SaveSlot.WBP_SaveLoad_SaveSlot_C.OnTriggerAction
// 0x0001 (0x0001 - 0x0000)
struct WBP_SaveLoad_SaveSlot_C_OnTriggerAction final
{
public:
	ETedContentSlotAction                         InAction;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SaveLoad_SaveSlot_C_OnTriggerAction) == 0x000001, "Wrong alignment on WBP_SaveLoad_SaveSlot_C_OnTriggerAction");
static_assert(sizeof(WBP_SaveLoad_SaveSlot_C_OnTriggerAction) == 0x000001, "Wrong size on WBP_SaveLoad_SaveSlot_C_OnTriggerAction");
static_assert(offsetof(WBP_SaveLoad_SaveSlot_C_OnTriggerAction, InAction) == 0x000000, "Member 'WBP_SaveLoad_SaveSlot_C_OnTriggerAction::InAction' has a wrong offset!");

// Function WBP_SaveLoad_SaveSlot.WBP_SaveLoad_SaveSlot_C.OnActivateState
// 0x0002 (0x0002 - 0x0000)
struct WBP_SaveLoad_SaveSlot_C_OnActivateState final
{
public:
	ETedContentSlotState                          InState;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bInActivated;                                      // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SaveLoad_SaveSlot_C_OnActivateState) == 0x000001, "Wrong alignment on WBP_SaveLoad_SaveSlot_C_OnActivateState");
static_assert(sizeof(WBP_SaveLoad_SaveSlot_C_OnActivateState) == 0x000002, "Wrong size on WBP_SaveLoad_SaveSlot_C_OnActivateState");
static_assert(offsetof(WBP_SaveLoad_SaveSlot_C_OnActivateState, InState) == 0x000000, "Member 'WBP_SaveLoad_SaveSlot_C_OnActivateState::InState' has a wrong offset!");
static_assert(offsetof(WBP_SaveLoad_SaveSlot_C_OnActivateState, bInActivated) == 0x000001, "Member 'WBP_SaveLoad_SaveSlot_C_OnActivateState::bInActivated' has a wrong offset!");

// Function WBP_SaveLoad_SaveSlot.WBP_SaveLoad_SaveSlot_C.GetDebugNameToolTipText
// 0x0010 (0x0010 - 0x0000)
struct WBP_SaveLoad_SaveSlot_C_GetDebugNameToolTipText final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm)
};
static_assert(alignof(WBP_SaveLoad_SaveSlot_C_GetDebugNameToolTipText) == 0x000008, "Wrong alignment on WBP_SaveLoad_SaveSlot_C_GetDebugNameToolTipText");
static_assert(sizeof(WBP_SaveLoad_SaveSlot_C_GetDebugNameToolTipText) == 0x000010, "Wrong size on WBP_SaveLoad_SaveSlot_C_GetDebugNameToolTipText");
static_assert(offsetof(WBP_SaveLoad_SaveSlot_C_GetDebugNameToolTipText, ReturnValue) == 0x000000, "Member 'WBP_SaveLoad_SaveSlot_C_GetDebugNameToolTipText::ReturnValue' has a wrong offset!");

// Function WBP_SaveLoad_SaveSlot.WBP_SaveLoad_SaveSlot_C.GetContent
// 0x0030 (0x0030 - 0x0000)
struct WBP_SaveLoad_SaveSlot_C_GetContent final
{
public:
	const class USavedGameSlotInfo*               ReturnValue;                                       // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSlotIndex_ReturnValue;                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTedContentPanelBase*                   CallFunc_GetParentContentPanel_ReturnValue;        // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UTedSaveLoadContentPanel*               K2Node_DynamicCast_AsTed_Save_Load_Content_Panel;  // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class UTedSavedGameSlotInfo*            CallFunc_GetContent_ReturnValue;                   // 0x0028(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SaveLoad_SaveSlot_C_GetContent) == 0x000008, "Wrong alignment on WBP_SaveLoad_SaveSlot_C_GetContent");
static_assert(sizeof(WBP_SaveLoad_SaveSlot_C_GetContent) == 0x000030, "Wrong size on WBP_SaveLoad_SaveSlot_C_GetContent");
static_assert(offsetof(WBP_SaveLoad_SaveSlot_C_GetContent, ReturnValue) == 0x000000, "Member 'WBP_SaveLoad_SaveSlot_C_GetContent::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SaveLoad_SaveSlot_C_GetContent, CallFunc_GetSlotIndex_ReturnValue) == 0x000008, "Member 'WBP_SaveLoad_SaveSlot_C_GetContent::CallFunc_GetSlotIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SaveLoad_SaveSlot_C_GetContent, CallFunc_GetParentContentPanel_ReturnValue) == 0x000010, "Member 'WBP_SaveLoad_SaveSlot_C_GetContent::CallFunc_GetParentContentPanel_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SaveLoad_SaveSlot_C_GetContent, K2Node_DynamicCast_AsTed_Save_Load_Content_Panel) == 0x000018, "Member 'WBP_SaveLoad_SaveSlot_C_GetContent::K2Node_DynamicCast_AsTed_Save_Load_Content_Panel' has a wrong offset!");
static_assert(offsetof(WBP_SaveLoad_SaveSlot_C_GetContent, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'WBP_SaveLoad_SaveSlot_C_GetContent::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_SaveLoad_SaveSlot_C_GetContent, CallFunc_GetContent_ReturnValue) == 0x000028, "Member 'WBP_SaveLoad_SaveSlot_C_GetContent::CallFunc_GetContent_ReturnValue' has a wrong offset!");

// Function WBP_SaveLoad_SaveSlot.WBP_SaveLoad_SaveSlot_C.Get Save Name
// 0x0048 (0x0048 - 0x0000)
struct WBP_SaveLoad_SaveSlot_C_Get_Save_Name final
{
public:
	class USavedGameSlotInfo*                     SaveFileData;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ReturnParm)
	bool                                          Temp_bool_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_NameToText_ReturnValue;              // 0x0020(0x0010)()
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x0038(0x0010)()
};
static_assert(alignof(WBP_SaveLoad_SaveSlot_C_Get_Save_Name) == 0x000008, "Wrong alignment on WBP_SaveLoad_SaveSlot_C_Get_Save_Name");
static_assert(sizeof(WBP_SaveLoad_SaveSlot_C_Get_Save_Name) == 0x000048, "Wrong size on WBP_SaveLoad_SaveSlot_C_Get_Save_Name");
static_assert(offsetof(WBP_SaveLoad_SaveSlot_C_Get_Save_Name, SaveFileData) == 0x000000, "Member 'WBP_SaveLoad_SaveSlot_C_Get_Save_Name::SaveFileData' has a wrong offset!");
static_assert(offsetof(WBP_SaveLoad_SaveSlot_C_Get_Save_Name, ReturnValue) == 0x000008, "Member 'WBP_SaveLoad_SaveSlot_C_Get_Save_Name::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SaveLoad_SaveSlot_C_Get_Save_Name, Temp_bool_Variable) == 0x000018, "Member 'WBP_SaveLoad_SaveSlot_C_Get_Save_Name::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_SaveLoad_SaveSlot_C_Get_Save_Name, CallFunc_Conv_NameToText_ReturnValue) == 0x000020, "Member 'WBP_SaveLoad_SaveSlot_C_Get_Save_Name::CallFunc_Conv_NameToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SaveLoad_SaveSlot_C_Get_Save_Name, CallFunc_TextIsEmpty_ReturnValue) == 0x000030, "Member 'WBP_SaveLoad_SaveSlot_C_Get_Save_Name::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SaveLoad_SaveSlot_C_Get_Save_Name, K2Node_Select_Default) == 0x000038, "Member 'WBP_SaveLoad_SaveSlot_C_Get_Save_Name::K2Node_Select_Default' has a wrong offset!");

// Function WBP_SaveLoad_SaveSlot.WBP_SaveLoad_SaveSlot_C.ExecuteUbergraph_WBP_SaveLoad_SaveSlot
// 0x00C8 (0x00C8 - 0x0000)
struct WBP_SaveLoad_SaveSlot_C_ExecuteUbergraph_WBP_SaveLoad_SaveSlot final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETedSavedSlotGamemodeType                     Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETedContentSlotAction                         K2Node_Event_InAction;                             // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class USavedGameSlotInfo*                     CallFunc_GetContent_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ETedContentSlotState                          K2Node_Event_InState;                              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInActivated;                         // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetDateTimeShort_ReturnValue;             // 0x0018(0x0010)()
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTedSavedGameSlotInfo*                  K2Node_DynamicCast_AsTed_Saved_Game_Slot_Info;     // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetSaveDisplayName_ReturnValue;           // 0x0040(0x0010)()
	bool                                          CallFunc_IsStateActive_ReturnValue;                // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0058(0x0010)()
	class USavedGameSlotInfo*                     CallFunc_GetContent_ReturnValue_1;                 // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTedContentPanelBase*                   CallFunc_GetParentContentPanel_ReturnValue;        // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UTedSaveLoadContentPanel*               K2Node_DynamicCast_AsTed_Save_Load_Content_Panel;  // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_1;                              // 0x0088(0x0010)()
	class FText                                   CallFunc_GetEmptyText_ReturnValue;                 // 0x0098(0x0010)()
	class FText                                   Temp_text_Variable_2;                              // 0x00A8(0x0010)()
	class FText                                   K2Node_Select_Default;                             // 0x00B8(0x0010)()
};
static_assert(alignof(WBP_SaveLoad_SaveSlot_C_ExecuteUbergraph_WBP_SaveLoad_SaveSlot) == 0x000008, "Wrong alignment on WBP_SaveLoad_SaveSlot_C_ExecuteUbergraph_WBP_SaveLoad_SaveSlot");
static_assert(sizeof(WBP_SaveLoad_SaveSlot_C_ExecuteUbergraph_WBP_SaveLoad_SaveSlot) == 0x0000C8, "Wrong size on WBP_SaveLoad_SaveSlot_C_ExecuteUbergraph_WBP_SaveLoad_SaveSlot");
static_assert(offsetof(WBP_SaveLoad_SaveSlot_C_ExecuteUbergraph_WBP_SaveLoad_SaveSlot, EntryPoint) == 0x000000, "Member 'WBP_SaveLoad_SaveSlot_C_ExecuteUbergraph_WBP_SaveLoad_SaveSlot::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_SaveLoad_SaveSlot_C_ExecuteUbergraph_WBP_SaveLoad_SaveSlot, Temp_byte_Variable) == 0x000004, "Member 'WBP_SaveLoad_SaveSlot_C_ExecuteUbergraph_WBP_SaveLoad_SaveSlot::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_SaveLoad_SaveSlot_C_ExecuteUbergraph_WBP_SaveLoad_SaveSlot, K2Node_Event_InAction) == 0x000005, "Member 'WBP_SaveLoad_SaveSlot_C_ExecuteUbergraph_WBP_SaveLoad_SaveSlot::K2Node_Event_InAction' has a wrong offset!");
static_assert(offsetof(WBP_SaveLoad_SaveSlot_C_ExecuteUbergraph_WBP_SaveLoad_SaveSlot, CallFunc_GetContent_ReturnValue) == 0x000008, "Member 'WBP_SaveLoad_SaveSlot_C_ExecuteUbergraph_WBP_SaveLoad_SaveSlot::CallFunc_GetContent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SaveLoad_SaveSlot_C_ExecuteUbergraph_WBP_SaveLoad_SaveSlot, K2Node_Event_InState) == 0x000010, "Member 'WBP_SaveLoad_SaveSlot_C_ExecuteUbergraph_WBP_SaveLoad_SaveSlot::K2Node_Event_InState' has a wrong offset!");
static_assert(offsetof(WBP_SaveLoad_SaveSlot_C_ExecuteUbergraph_WBP_SaveLoad_SaveSlot, K2Node_Event_bInActivated) == 0x000011, "Member 'WBP_SaveLoad_SaveSlot_C_ExecuteUbergraph_WBP_SaveLoad_SaveSlot::K2Node_Event_bInActivated' has a wrong offset!");
static_assert(offsetof(WBP_SaveLoad_SaveSlot_C_ExecuteUbergraph_WBP_SaveLoad_SaveSlot, CallFunc_GetDateTimeShort_ReturnValue) == 0x000018, "Member 'WBP_SaveLoad_SaveSlot_C_ExecuteUbergraph_WBP_SaveLoad_SaveSlot::CallFunc_GetDateTimeShort_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SaveLoad_SaveSlot_C_ExecuteUbergraph_WBP_SaveLoad_SaveSlot, K2Node_SwitchEnum_CmpSuccess) == 0x000028, "Member 'WBP_SaveLoad_SaveSlot_C_ExecuteUbergraph_WBP_SaveLoad_SaveSlot::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_SaveLoad_SaveSlot_C_ExecuteUbergraph_WBP_SaveLoad_SaveSlot, K2Node_DynamicCast_AsTed_Saved_Game_Slot_Info) == 0x000030, "Member 'WBP_SaveLoad_SaveSlot_C_ExecuteUbergraph_WBP_SaveLoad_SaveSlot::K2Node_DynamicCast_AsTed_Saved_Game_Slot_Info' has a wrong offset!");
static_assert(offsetof(WBP_SaveLoad_SaveSlot_C_ExecuteUbergraph_WBP_SaveLoad_SaveSlot, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'WBP_SaveLoad_SaveSlot_C_ExecuteUbergraph_WBP_SaveLoad_SaveSlot::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_SaveLoad_SaveSlot_C_ExecuteUbergraph_WBP_SaveLoad_SaveSlot, CallFunc_IsValid_ReturnValue) == 0x000039, "Member 'WBP_SaveLoad_SaveSlot_C_ExecuteUbergraph_WBP_SaveLoad_SaveSlot::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SaveLoad_SaveSlot_C_ExecuteUbergraph_WBP_SaveLoad_SaveSlot, CallFunc_GetSaveDisplayName_ReturnValue) == 0x000040, "Member 'WBP_SaveLoad_SaveSlot_C_ExecuteUbergraph_WBP_SaveLoad_SaveSlot::CallFunc_GetSaveDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SaveLoad_SaveSlot_C_ExecuteUbergraph_WBP_SaveLoad_SaveSlot, CallFunc_IsStateActive_ReturnValue) == 0x000050, "Member 'WBP_SaveLoad_SaveSlot_C_ExecuteUbergraph_WBP_SaveLoad_SaveSlot::CallFunc_IsStateActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SaveLoad_SaveSlot_C_ExecuteUbergraph_WBP_SaveLoad_SaveSlot, Temp_text_Variable) == 0x000058, "Member 'WBP_SaveLoad_SaveSlot_C_ExecuteUbergraph_WBP_SaveLoad_SaveSlot::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(WBP_SaveLoad_SaveSlot_C_ExecuteUbergraph_WBP_SaveLoad_SaveSlot, CallFunc_GetContent_ReturnValue_1) == 0x000068, "Member 'WBP_SaveLoad_SaveSlot_C_ExecuteUbergraph_WBP_SaveLoad_SaveSlot::CallFunc_GetContent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_SaveLoad_SaveSlot_C_ExecuteUbergraph_WBP_SaveLoad_SaveSlot, CallFunc_GetParentContentPanel_ReturnValue) == 0x000070, "Member 'WBP_SaveLoad_SaveSlot_C_ExecuteUbergraph_WBP_SaveLoad_SaveSlot::CallFunc_GetParentContentPanel_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SaveLoad_SaveSlot_C_ExecuteUbergraph_WBP_SaveLoad_SaveSlot, K2Node_DynamicCast_AsTed_Save_Load_Content_Panel) == 0x000078, "Member 'WBP_SaveLoad_SaveSlot_C_ExecuteUbergraph_WBP_SaveLoad_SaveSlot::K2Node_DynamicCast_AsTed_Save_Load_Content_Panel' has a wrong offset!");
static_assert(offsetof(WBP_SaveLoad_SaveSlot_C_ExecuteUbergraph_WBP_SaveLoad_SaveSlot, K2Node_DynamicCast_bSuccess_1) == 0x000080, "Member 'WBP_SaveLoad_SaveSlot_C_ExecuteUbergraph_WBP_SaveLoad_SaveSlot::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_SaveLoad_SaveSlot_C_ExecuteUbergraph_WBP_SaveLoad_SaveSlot, Temp_text_Variable_1) == 0x000088, "Member 'WBP_SaveLoad_SaveSlot_C_ExecuteUbergraph_WBP_SaveLoad_SaveSlot::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_SaveLoad_SaveSlot_C_ExecuteUbergraph_WBP_SaveLoad_SaveSlot, CallFunc_GetEmptyText_ReturnValue) == 0x000098, "Member 'WBP_SaveLoad_SaveSlot_C_ExecuteUbergraph_WBP_SaveLoad_SaveSlot::CallFunc_GetEmptyText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SaveLoad_SaveSlot_C_ExecuteUbergraph_WBP_SaveLoad_SaveSlot, Temp_text_Variable_2) == 0x0000A8, "Member 'WBP_SaveLoad_SaveSlot_C_ExecuteUbergraph_WBP_SaveLoad_SaveSlot::Temp_text_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_SaveLoad_SaveSlot_C_ExecuteUbergraph_WBP_SaveLoad_SaveSlot, K2Node_Select_Default) == 0x0000B8, "Member 'WBP_SaveLoad_SaveSlot_C_ExecuteUbergraph_WBP_SaveLoad_SaveSlot::K2Node_Select_Default' has a wrong offset!");

// Function WBP_SaveLoad_SaveSlot.WBP_SaveLoad_SaveSlot_C.GetMaterialsSupportingStates
// 0x0028 (0x0028 - 0x0000)
struct WBP_SaveLoad_SaveSlot_C_GetMaterialsSupportingStates final
{
public:
	TArray<class UMaterialInstanceDynamic*>       OutMIDs;                                           // 0x0000(0x0010)(Parm, OutParm)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UMaterialInstanceDynamic*>       K2Node_MakeArray_Array;                            // 0x0018(0x0010)(ReferenceParm)
};
static_assert(alignof(WBP_SaveLoad_SaveSlot_C_GetMaterialsSupportingStates) == 0x000008, "Wrong alignment on WBP_SaveLoad_SaveSlot_C_GetMaterialsSupportingStates");
static_assert(sizeof(WBP_SaveLoad_SaveSlot_C_GetMaterialsSupportingStates) == 0x000028, "Wrong size on WBP_SaveLoad_SaveSlot_C_GetMaterialsSupportingStates");
static_assert(offsetof(WBP_SaveLoad_SaveSlot_C_GetMaterialsSupportingStates, OutMIDs) == 0x000000, "Member 'WBP_SaveLoad_SaveSlot_C_GetMaterialsSupportingStates::OutMIDs' has a wrong offset!");
static_assert(offsetof(WBP_SaveLoad_SaveSlot_C_GetMaterialsSupportingStates, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000010, "Member 'WBP_SaveLoad_SaveSlot_C_GetMaterialsSupportingStates::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SaveLoad_SaveSlot_C_GetMaterialsSupportingStates, K2Node_MakeArray_Array) == 0x000018, "Member 'WBP_SaveLoad_SaveSlot_C_GetMaterialsSupportingStates::K2Node_MakeArray_Array' has a wrong offset!");

}

