#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_HUD_SelectionDetails_UnitScrolling_Slot

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Tempest_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_HUD_SelectionDetails_UnitScrolling_Slot.WBP_HUD_SelectionDetails_UnitScrolling_Slot_C
// 0x0028 (0x0458 - 0x0430)
class UWBP_HUD_SelectionDetails_UnitScrolling_Slot_C final : public UTedContentPanelSlotButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0430(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCanvasPanel*                           CanvasPanel_Root;                                  // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Background;                                  // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Icon;                                        // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bFlip;                                             // 0x0450(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_HUD_SelectionDetails_UnitScrolling_Slot(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);

	void GetMaterialsSupportingStates(TArray<class UMaterialInstanceDynamic*>* OutMIDs) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_HUD_SelectionDetails_UnitScrolling_Slot_C">();
	}
	static class UWBP_HUD_SelectionDetails_UnitScrolling_Slot_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_HUD_SelectionDetails_UnitScrolling_Slot_C>();
	}
};
static_assert(alignof(UWBP_HUD_SelectionDetails_UnitScrolling_Slot_C) == 0x000008, "Wrong alignment on UWBP_HUD_SelectionDetails_UnitScrolling_Slot_C");
static_assert(sizeof(UWBP_HUD_SelectionDetails_UnitScrolling_Slot_C) == 0x000458, "Wrong size on UWBP_HUD_SelectionDetails_UnitScrolling_Slot_C");
static_assert(offsetof(UWBP_HUD_SelectionDetails_UnitScrolling_Slot_C, UberGraphFrame) == 0x000430, "Member 'UWBP_HUD_SelectionDetails_UnitScrolling_Slot_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_SelectionDetails_UnitScrolling_Slot_C, CanvasPanel_Root) == 0x000438, "Member 'UWBP_HUD_SelectionDetails_UnitScrolling_Slot_C::CanvasPanel_Root' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_SelectionDetails_UnitScrolling_Slot_C, Image_Background) == 0x000440, "Member 'UWBP_HUD_SelectionDetails_UnitScrolling_Slot_C::Image_Background' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_SelectionDetails_UnitScrolling_Slot_C, Image_Icon) == 0x000448, "Member 'UWBP_HUD_SelectionDetails_UnitScrolling_Slot_C::Image_Icon' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_SelectionDetails_UnitScrolling_Slot_C, bFlip) == 0x000450, "Member 'UWBP_HUD_SelectionDetails_UnitScrolling_Slot_C::bFlip' has a wrong offset!");

}

