#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SpecialistsCard_Slot

#include "Basic.hpp"

#include "Tempest_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_SpecialistsCard_Slot.WBP_SpecialistsCard_Slot_C.ExecuteUbergraph_WBP_SpecialistsCard_Slot
// 0x0090 (0x0090 - 0x0000)
struct WBP_SpecialistsCard_Slot_C_ExecuteUbergraph_WBP_SpecialistsCard_Slot final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_OldValue;                             // 0x0004(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_NewValue;                             // 0x0008(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSlotIndex_ReturnValue;                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTedContentPanelBase*                   CallFunc_K2_GetParentContentPanel_ReturnValue;     // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetOwningPlayerPawn_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_SpecialistsCard_Panel_C*           K2Node_DynamicCast_AsWBP_Specialists_Card_Panel;   // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATedPawn*                               CallFunc_GetSlotContent_ReturnValue;               // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATedPawn*                               CallFunc_GetContent_ReturnValue;                   // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_TeleportTo_ReturnValue;                // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62[0x2];                                       // 0x0062(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetHealthMax_ReturnValue;                 // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETedContentSlotAction                         K2Node_Event_InAction;                             // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_72[0x6];                                       // 0x0072(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_A_ImplicitCast;       // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_B_ImplicitCast;       // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SpecialistsCard_Slot_C_ExecuteUbergraph_WBP_SpecialistsCard_Slot) == 0x000008, "Wrong alignment on WBP_SpecialistsCard_Slot_C_ExecuteUbergraph_WBP_SpecialistsCard_Slot");
static_assert(sizeof(WBP_SpecialistsCard_Slot_C_ExecuteUbergraph_WBP_SpecialistsCard_Slot) == 0x000090, "Wrong size on WBP_SpecialistsCard_Slot_C_ExecuteUbergraph_WBP_SpecialistsCard_Slot");
static_assert(offsetof(WBP_SpecialistsCard_Slot_C_ExecuteUbergraph_WBP_SpecialistsCard_Slot, EntryPoint) == 0x000000, "Member 'WBP_SpecialistsCard_Slot_C_ExecuteUbergraph_WBP_SpecialistsCard_Slot::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_SpecialistsCard_Slot_C_ExecuteUbergraph_WBP_SpecialistsCard_Slot, K2Node_Event_OldValue) == 0x000004, "Member 'WBP_SpecialistsCard_Slot_C_ExecuteUbergraph_WBP_SpecialistsCard_Slot::K2Node_Event_OldValue' has a wrong offset!");
static_assert(offsetof(WBP_SpecialistsCard_Slot_C_ExecuteUbergraph_WBP_SpecialistsCard_Slot, K2Node_Event_NewValue) == 0x000008, "Member 'WBP_SpecialistsCard_Slot_C_ExecuteUbergraph_WBP_SpecialistsCard_Slot::K2Node_Event_NewValue' has a wrong offset!");
static_assert(offsetof(WBP_SpecialistsCard_Slot_C_ExecuteUbergraph_WBP_SpecialistsCard_Slot, CallFunc_GetSlotIndex_ReturnValue) == 0x00000C, "Member 'WBP_SpecialistsCard_Slot_C_ExecuteUbergraph_WBP_SpecialistsCard_Slot::CallFunc_GetSlotIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SpecialistsCard_Slot_C_ExecuteUbergraph_WBP_SpecialistsCard_Slot, CallFunc_K2_GetParentContentPanel_ReturnValue) == 0x000010, "Member 'WBP_SpecialistsCard_Slot_C_ExecuteUbergraph_WBP_SpecialistsCard_Slot::CallFunc_K2_GetParentContentPanel_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SpecialistsCard_Slot_C_ExecuteUbergraph_WBP_SpecialistsCard_Slot, CallFunc_GetOwningPlayerPawn_ReturnValue) == 0x000018, "Member 'WBP_SpecialistsCard_Slot_C_ExecuteUbergraph_WBP_SpecialistsCard_Slot::CallFunc_GetOwningPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SpecialistsCard_Slot_C_ExecuteUbergraph_WBP_SpecialistsCard_Slot, K2Node_DynamicCast_AsWBP_Specialists_Card_Panel) == 0x000020, "Member 'WBP_SpecialistsCard_Slot_C_ExecuteUbergraph_WBP_SpecialistsCard_Slot::K2Node_DynamicCast_AsWBP_Specialists_Card_Panel' has a wrong offset!");
static_assert(offsetof(WBP_SpecialistsCard_Slot_C_ExecuteUbergraph_WBP_SpecialistsCard_Slot, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'WBP_SpecialistsCard_Slot_C_ExecuteUbergraph_WBP_SpecialistsCard_Slot::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_SpecialistsCard_Slot_C_ExecuteUbergraph_WBP_SpecialistsCard_Slot, CallFunc_GetSlotContent_ReturnValue) == 0x000030, "Member 'WBP_SpecialistsCard_Slot_C_ExecuteUbergraph_WBP_SpecialistsCard_Slot::CallFunc_GetSlotContent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SpecialistsCard_Slot_C_ExecuteUbergraph_WBP_SpecialistsCard_Slot, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000038, "Member 'WBP_SpecialistsCard_Slot_C_ExecuteUbergraph_WBP_SpecialistsCard_Slot::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SpecialistsCard_Slot_C_ExecuteUbergraph_WBP_SpecialistsCard_Slot, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000040, "Member 'WBP_SpecialistsCard_Slot_C_ExecuteUbergraph_WBP_SpecialistsCard_Slot::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SpecialistsCard_Slot_C_ExecuteUbergraph_WBP_SpecialistsCard_Slot, CallFunc_GetContent_ReturnValue) == 0x000058, "Member 'WBP_SpecialistsCard_Slot_C_ExecuteUbergraph_WBP_SpecialistsCard_Slot::CallFunc_GetContent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SpecialistsCard_Slot_C_ExecuteUbergraph_WBP_SpecialistsCard_Slot, CallFunc_K2_TeleportTo_ReturnValue) == 0x000060, "Member 'WBP_SpecialistsCard_Slot_C_ExecuteUbergraph_WBP_SpecialistsCard_Slot::CallFunc_K2_TeleportTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SpecialistsCard_Slot_C_ExecuteUbergraph_WBP_SpecialistsCard_Slot, CallFunc_IsValid_ReturnValue) == 0x000061, "Member 'WBP_SpecialistsCard_Slot_C_ExecuteUbergraph_WBP_SpecialistsCard_Slot::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SpecialistsCard_Slot_C_ExecuteUbergraph_WBP_SpecialistsCard_Slot, CallFunc_GetHealthMax_ReturnValue) == 0x000064, "Member 'WBP_SpecialistsCard_Slot_C_ExecuteUbergraph_WBP_SpecialistsCard_Slot::CallFunc_GetHealthMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SpecialistsCard_Slot_C_ExecuteUbergraph_WBP_SpecialistsCard_Slot, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000068, "Member 'WBP_SpecialistsCard_Slot_C_ExecuteUbergraph_WBP_SpecialistsCard_Slot::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SpecialistsCard_Slot_C_ExecuteUbergraph_WBP_SpecialistsCard_Slot, K2Node_Event_InAction) == 0x000070, "Member 'WBP_SpecialistsCard_Slot_C_ExecuteUbergraph_WBP_SpecialistsCard_Slot::K2Node_Event_InAction' has a wrong offset!");
static_assert(offsetof(WBP_SpecialistsCard_Slot_C_ExecuteUbergraph_WBP_SpecialistsCard_Slot, K2Node_SwitchEnum_CmpSuccess) == 0x000071, "Member 'WBP_SpecialistsCard_Slot_C_ExecuteUbergraph_WBP_SpecialistsCard_Slot::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_SpecialistsCard_Slot_C_ExecuteUbergraph_WBP_SpecialistsCard_Slot, CallFunc_Divide_DoubleDouble_A_ImplicitCast) == 0x000078, "Member 'WBP_SpecialistsCard_Slot_C_ExecuteUbergraph_WBP_SpecialistsCard_Slot::CallFunc_Divide_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_SpecialistsCard_Slot_C_ExecuteUbergraph_WBP_SpecialistsCard_Slot, CallFunc_Divide_DoubleDouble_B_ImplicitCast) == 0x000080, "Member 'WBP_SpecialistsCard_Slot_C_ExecuteUbergraph_WBP_SpecialistsCard_Slot::CallFunc_Divide_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_SpecialistsCard_Slot_C_ExecuteUbergraph_WBP_SpecialistsCard_Slot, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000088, "Member 'WBP_SpecialistsCard_Slot_C_ExecuteUbergraph_WBP_SpecialistsCard_Slot::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");

// Function WBP_SpecialistsCard_Slot.WBP_SpecialistsCard_Slot_C.OnTriggerAction
// 0x0001 (0x0001 - 0x0000)
struct WBP_SpecialistsCard_Slot_C_OnTriggerAction final
{
public:
	ETedContentSlotAction                         InAction;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SpecialistsCard_Slot_C_OnTriggerAction) == 0x000001, "Wrong alignment on WBP_SpecialistsCard_Slot_C_OnTriggerAction");
static_assert(sizeof(WBP_SpecialistsCard_Slot_C_OnTriggerAction) == 0x000001, "Wrong size on WBP_SpecialistsCard_Slot_C_OnTriggerAction");
static_assert(offsetof(WBP_SpecialistsCard_Slot_C_OnTriggerAction, InAction) == 0x000000, "Member 'WBP_SpecialistsCard_Slot_C_OnTriggerAction::InAction' has a wrong offset!");

// Function WBP_SpecialistsCard_Slot.WBP_SpecialistsCard_Slot_C.OnWorkerHealthChanged
// 0x0008 (0x0008 - 0x0000)
struct WBP_SpecialistsCard_Slot_C_OnWorkerHealthChanged final
{
public:
	float                                         OldValue;                                          // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         NewValue;                                          // 0x0004(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SpecialistsCard_Slot_C_OnWorkerHealthChanged) == 0x000004, "Wrong alignment on WBP_SpecialistsCard_Slot_C_OnWorkerHealthChanged");
static_assert(sizeof(WBP_SpecialistsCard_Slot_C_OnWorkerHealthChanged) == 0x000008, "Wrong size on WBP_SpecialistsCard_Slot_C_OnWorkerHealthChanged");
static_assert(offsetof(WBP_SpecialistsCard_Slot_C_OnWorkerHealthChanged, OldValue) == 0x000000, "Member 'WBP_SpecialistsCard_Slot_C_OnWorkerHealthChanged::OldValue' has a wrong offset!");
static_assert(offsetof(WBP_SpecialistsCard_Slot_C_OnWorkerHealthChanged, NewValue) == 0x000004, "Member 'WBP_SpecialistsCard_Slot_C_OnWorkerHealthChanged::NewValue' has a wrong offset!");

// Function WBP_SpecialistsCard_Slot.WBP_SpecialistsCard_Slot_C.GetMaterialsSupportingStates
// 0x0028 (0x0028 - 0x0000)
struct WBP_SpecialistsCard_Slot_C_GetMaterialsSupportingStates final
{
public:
	TArray<class UMaterialInstanceDynamic*>       OutMIDs;                                           // 0x0000(0x0010)(Parm, OutParm)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UMaterialInstanceDynamic*>       K2Node_MakeArray_Array;                            // 0x0018(0x0010)(ReferenceParm)
};
static_assert(alignof(WBP_SpecialistsCard_Slot_C_GetMaterialsSupportingStates) == 0x000008, "Wrong alignment on WBP_SpecialistsCard_Slot_C_GetMaterialsSupportingStates");
static_assert(sizeof(WBP_SpecialistsCard_Slot_C_GetMaterialsSupportingStates) == 0x000028, "Wrong size on WBP_SpecialistsCard_Slot_C_GetMaterialsSupportingStates");
static_assert(offsetof(WBP_SpecialistsCard_Slot_C_GetMaterialsSupportingStates, OutMIDs) == 0x000000, "Member 'WBP_SpecialistsCard_Slot_C_GetMaterialsSupportingStates::OutMIDs' has a wrong offset!");
static_assert(offsetof(WBP_SpecialistsCard_Slot_C_GetMaterialsSupportingStates, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000010, "Member 'WBP_SpecialistsCard_Slot_C_GetMaterialsSupportingStates::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SpecialistsCard_Slot_C_GetMaterialsSupportingStates, K2Node_MakeArray_Array) == 0x000018, "Member 'WBP_SpecialistsCard_Slot_C_GetMaterialsSupportingStates::K2Node_MakeArray_Array' has a wrong offset!");

}

