#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ScoreScreen_StatTable_Headers_Slot

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Tempest_structs.hpp"
#include "Tempest_classes.hpp"
#include "UMG_structs.hpp"
#include "Slate_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ScoreScreen_StatTable_Headers_Slot.WBP_ScoreScreen_StatTable_Headers_Slot_C
// 0x0030 (0x0460 - 0x0430)
class UWBP_ScoreScreen_StatTable_Headers_Slot_C final : public UTedContentPanelSlotButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0430(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_AscendingIcon;                               // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_0;                                         // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBox_Label;                                     // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          ConstantWidth;                                     // 0x0450(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_451[0x7];                                      // 0x0451(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Width;                                             // 0x0458(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_ScoreScreen_StatTable_Headers_Slot(int32 EntryPoint);
	void GetContent(struct FTedTableHeaderContent* OutContent, bool* bOutFound);
	void GetHeadersPanel(class UTedScoreScreenHeadersPanel** OutPanel);
	void OnActivateState(ETedContentSlotState InState, bool bInActivated);
	void PreConstruct(bool IsDesignTime);
	void RefreshAscendingIcon();
	void RefreshUI();
	void Set_Font_Material(class UMaterialInterface* InMaterial);
	void Set_Justification(ETextJustify Justification);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ScoreScreen_StatTable_Headers_Slot_C">();
	}
	static class UWBP_ScoreScreen_StatTable_Headers_Slot_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ScoreScreen_StatTable_Headers_Slot_C>();
	}
};
static_assert(alignof(UWBP_ScoreScreen_StatTable_Headers_Slot_C) == 0x000008, "Wrong alignment on UWBP_ScoreScreen_StatTable_Headers_Slot_C");
static_assert(sizeof(UWBP_ScoreScreen_StatTable_Headers_Slot_C) == 0x000460, "Wrong size on UWBP_ScoreScreen_StatTable_Headers_Slot_C");
static_assert(offsetof(UWBP_ScoreScreen_StatTable_Headers_Slot_C, UberGraphFrame) == 0x000430, "Member 'UWBP_ScoreScreen_StatTable_Headers_Slot_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ScoreScreen_StatTable_Headers_Slot_C, Image_AscendingIcon) == 0x000438, "Member 'UWBP_ScoreScreen_StatTable_Headers_Slot_C::Image_AscendingIcon' has a wrong offset!");
static_assert(offsetof(UWBP_ScoreScreen_StatTable_Headers_Slot_C, SizeBox_0) == 0x000440, "Member 'UWBP_ScoreScreen_StatTable_Headers_Slot_C::SizeBox_0' has a wrong offset!");
static_assert(offsetof(UWBP_ScoreScreen_StatTable_Headers_Slot_C, TextBox_Label) == 0x000448, "Member 'UWBP_ScoreScreen_StatTable_Headers_Slot_C::TextBox_Label' has a wrong offset!");
static_assert(offsetof(UWBP_ScoreScreen_StatTable_Headers_Slot_C, ConstantWidth) == 0x000450, "Member 'UWBP_ScoreScreen_StatTable_Headers_Slot_C::ConstantWidth' has a wrong offset!");
static_assert(offsetof(UWBP_ScoreScreen_StatTable_Headers_Slot_C, Width) == 0x000458, "Member 'UWBP_ScoreScreen_StatTable_Headers_Slot_C::Width' has a wrong offset!");

}

