#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ScoreScreen_StatTable_Headers_Panel

#include "Basic.hpp"

#include "Tempest_structs.hpp"


namespace SDK::Params
{

// Function WBP_ScoreScreen_StatTable_Headers_Panel.WBP_ScoreScreen_StatTable_Headers_Panel_C.ExecuteUbergraph_WBP_ScoreScreen_StatTable_Headers_Panel
// 0x0058 (0x0058 - 0x0000)
struct WBP_ScoreScreen_StatTable_Headers_Panel_C_ExecuteUbergraph_WBP_ScoreScreen_StatTable_Headers_Panel final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTedContentPanelSlotBase*               K2Node_Event_InContentSlot;                        // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ETedContentPanelRegistration                  K2Node_Event_InMode;                               // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetSlotIndex_ReturnValue;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTedTableHeaderContent                 CallFunc_GetContent_OutContent;                    // 0x0018(0x0028)()
	bool                                          CallFunc_GetContent_ReturnValue;                   // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_ScoreScreen_StatTable_Headers_Slot_C* K2Node_DynamicCast_AsWBP_Score_Screen_Stat_Table_Headers_Slot; // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ScoreScreen_StatTable_Headers_Panel_C_ExecuteUbergraph_WBP_ScoreScreen_StatTable_Headers_Panel) == 0x000008, "Wrong alignment on WBP_ScoreScreen_StatTable_Headers_Panel_C_ExecuteUbergraph_WBP_ScoreScreen_StatTable_Headers_Panel");
static_assert(sizeof(WBP_ScoreScreen_StatTable_Headers_Panel_C_ExecuteUbergraph_WBP_ScoreScreen_StatTable_Headers_Panel) == 0x000058, "Wrong size on WBP_ScoreScreen_StatTable_Headers_Panel_C_ExecuteUbergraph_WBP_ScoreScreen_StatTable_Headers_Panel");
static_assert(offsetof(WBP_ScoreScreen_StatTable_Headers_Panel_C_ExecuteUbergraph_WBP_ScoreScreen_StatTable_Headers_Panel, EntryPoint) == 0x000000, "Member 'WBP_ScoreScreen_StatTable_Headers_Panel_C_ExecuteUbergraph_WBP_ScoreScreen_StatTable_Headers_Panel::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_ScoreScreen_StatTable_Headers_Panel_C_ExecuteUbergraph_WBP_ScoreScreen_StatTable_Headers_Panel, K2Node_Event_InContentSlot) == 0x000008, "Member 'WBP_ScoreScreen_StatTable_Headers_Panel_C_ExecuteUbergraph_WBP_ScoreScreen_StatTable_Headers_Panel::K2Node_Event_InContentSlot' has a wrong offset!");
static_assert(offsetof(WBP_ScoreScreen_StatTable_Headers_Panel_C_ExecuteUbergraph_WBP_ScoreScreen_StatTable_Headers_Panel, K2Node_Event_InMode) == 0x000010, "Member 'WBP_ScoreScreen_StatTable_Headers_Panel_C_ExecuteUbergraph_WBP_ScoreScreen_StatTable_Headers_Panel::K2Node_Event_InMode' has a wrong offset!");
static_assert(offsetof(WBP_ScoreScreen_StatTable_Headers_Panel_C_ExecuteUbergraph_WBP_ScoreScreen_StatTable_Headers_Panel, CallFunc_GetSlotIndex_ReturnValue) == 0x000014, "Member 'WBP_ScoreScreen_StatTable_Headers_Panel_C_ExecuteUbergraph_WBP_ScoreScreen_StatTable_Headers_Panel::CallFunc_GetSlotIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ScoreScreen_StatTable_Headers_Panel_C_ExecuteUbergraph_WBP_ScoreScreen_StatTable_Headers_Panel, CallFunc_GetContent_OutContent) == 0x000018, "Member 'WBP_ScoreScreen_StatTable_Headers_Panel_C_ExecuteUbergraph_WBP_ScoreScreen_StatTable_Headers_Panel::CallFunc_GetContent_OutContent' has a wrong offset!");
static_assert(offsetof(WBP_ScoreScreen_StatTable_Headers_Panel_C_ExecuteUbergraph_WBP_ScoreScreen_StatTable_Headers_Panel, CallFunc_GetContent_ReturnValue) == 0x000040, "Member 'WBP_ScoreScreen_StatTable_Headers_Panel_C_ExecuteUbergraph_WBP_ScoreScreen_StatTable_Headers_Panel::CallFunc_GetContent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ScoreScreen_StatTable_Headers_Panel_C_ExecuteUbergraph_WBP_ScoreScreen_StatTable_Headers_Panel, K2Node_DynamicCast_AsWBP_Score_Screen_Stat_Table_Headers_Slot) == 0x000048, "Member 'WBP_ScoreScreen_StatTable_Headers_Panel_C_ExecuteUbergraph_WBP_ScoreScreen_StatTable_Headers_Panel::K2Node_DynamicCast_AsWBP_Score_Screen_Stat_Table_Headers_Slot' has a wrong offset!");
static_assert(offsetof(WBP_ScoreScreen_StatTable_Headers_Panel_C_ExecuteUbergraph_WBP_ScoreScreen_StatTable_Headers_Panel, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'WBP_ScoreScreen_StatTable_Headers_Panel_C_ExecuteUbergraph_WBP_ScoreScreen_StatTable_Headers_Panel::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WBP_ScoreScreen_StatTable_Headers_Panel.WBP_ScoreScreen_StatTable_Headers_Panel_C.OnRegisterContentSlot
// 0x0010 (0x0010 - 0x0000)
struct WBP_ScoreScreen_StatTable_Headers_Panel_C_OnRegisterContentSlot final
{
public:
	class UTedContentPanelSlotBase*               InContentSlot;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ETedContentPanelRegistration                  InMode;                                            // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ScoreScreen_StatTable_Headers_Panel_C_OnRegisterContentSlot) == 0x000008, "Wrong alignment on WBP_ScoreScreen_StatTable_Headers_Panel_C_OnRegisterContentSlot");
static_assert(sizeof(WBP_ScoreScreen_StatTable_Headers_Panel_C_OnRegisterContentSlot) == 0x000010, "Wrong size on WBP_ScoreScreen_StatTable_Headers_Panel_C_OnRegisterContentSlot");
static_assert(offsetof(WBP_ScoreScreen_StatTable_Headers_Panel_C_OnRegisterContentSlot, InContentSlot) == 0x000000, "Member 'WBP_ScoreScreen_StatTable_Headers_Panel_C_OnRegisterContentSlot::InContentSlot' has a wrong offset!");
static_assert(offsetof(WBP_ScoreScreen_StatTable_Headers_Panel_C_OnRegisterContentSlot, InMode) == 0x000008, "Member 'WBP_ScoreScreen_StatTable_Headers_Panel_C_OnRegisterContentSlot::InMode' has a wrong offset!");

}

