#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_HUD_Resources_Intel

#include "Basic.hpp"

#include "Tempest_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function WBP_HUD_Resources_Intel.WBP_HUD_Resources_Intel_C.OnAnimationFinished
// 0x0018 (0x0018 - 0x0000)
struct WBP_HUD_Resources_Intel_C_OnAnimationFinished final
{
public:
	const class UWidgetAnimation*                 Animation;                                         // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Local_PlayedAnim;                                  // 0x0008(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	bool                                          GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess;   // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_Resources_Intel_C_OnAnimationFinished) == 0x000008, "Wrong alignment on WBP_HUD_Resources_Intel_C_OnAnimationFinished");
static_assert(sizeof(WBP_HUD_Resources_Intel_C_OnAnimationFinished) == 0x000018, "Wrong size on WBP_HUD_Resources_Intel_C_OnAnimationFinished");
static_assert(offsetof(WBP_HUD_Resources_Intel_C_OnAnimationFinished, Animation) == 0x000000, "Member 'WBP_HUD_Resources_Intel_C_OnAnimationFinished::Animation' has a wrong offset!");
static_assert(offsetof(WBP_HUD_Resources_Intel_C_OnAnimationFinished, Local_PlayedAnim) == 0x000008, "Member 'WBP_HUD_Resources_Intel_C_OnAnimationFinished::Local_PlayedAnim' has a wrong offset!");
static_assert(offsetof(WBP_HUD_Resources_Intel_C_OnAnimationFinished, GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess) == 0x000010, "Member 'WBP_HUD_Resources_Intel_C_OnAnimationFinished::GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess' has a wrong offset!");

// Function WBP_HUD_Resources_Intel.WBP_HUD_Resources_Intel_C.OnPlayWidgetAnimation
// 0x0020 (0x0020 - 0x0000)
struct WBP_HUD_Resources_Intel_C_OnPlayWidgetAnimation final
{
public:
	struct FGameplayTag                           InAnim;                                            // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	bool                                          GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess;   // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_Resources_Intel_C_OnPlayWidgetAnimation) == 0x000008, "Wrong alignment on WBP_HUD_Resources_Intel_C_OnPlayWidgetAnimation");
static_assert(sizeof(WBP_HUD_Resources_Intel_C_OnPlayWidgetAnimation) == 0x000020, "Wrong size on WBP_HUD_Resources_Intel_C_OnPlayWidgetAnimation");
static_assert(offsetof(WBP_HUD_Resources_Intel_C_OnPlayWidgetAnimation, InAnim) == 0x000000, "Member 'WBP_HUD_Resources_Intel_C_OnPlayWidgetAnimation::InAnim' has a wrong offset!");
static_assert(offsetof(WBP_HUD_Resources_Intel_C_OnPlayWidgetAnimation, GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess) == 0x000008, "Member 'WBP_HUD_Resources_Intel_C_OnPlayWidgetAnimation::GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_HUD_Resources_Intel_C_OnPlayWidgetAnimation, CallFunc_PlayAnimationForward_ReturnValue) == 0x000010, "Member 'WBP_HUD_Resources_Intel_C_OnPlayWidgetAnimation::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_Resources_Intel_C_OnPlayWidgetAnimation, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000018, "Member 'WBP_HUD_Resources_Intel_C_OnPlayWidgetAnimation::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");

// Function WBP_HUD_Resources_Intel.WBP_HUD_Resources_Intel_C.OnResourcesChange_Handler
// 0x0070 (0x0070 - 0x0000)
struct WBP_HUD_Resources_Intel_C_OnResourcesChange_Handler final
{
public:
	class UTedPlayerData*                         InPlayerData;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FTedPlayerDataResources                InPrevious;                                        // 0x0008(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
	struct FTedPlayerDataResources                InCurrent;                                         // 0x0028(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
	class ATedPlayerState*                        CallFunc_GetOwningPlayerState_ReturnValue;         // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ETedFaction                                   CallFunc_GetPlayerFaction_ReturnValue;             // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x0053(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0058(0x0010)()
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_Resources_Intel_C_OnResourcesChange_Handler) == 0x000008, "Wrong alignment on WBP_HUD_Resources_Intel_C_OnResourcesChange_Handler");
static_assert(sizeof(WBP_HUD_Resources_Intel_C_OnResourcesChange_Handler) == 0x000070, "Wrong size on WBP_HUD_Resources_Intel_C_OnResourcesChange_Handler");
static_assert(offsetof(WBP_HUD_Resources_Intel_C_OnResourcesChange_Handler, InPlayerData) == 0x000000, "Member 'WBP_HUD_Resources_Intel_C_OnResourcesChange_Handler::InPlayerData' has a wrong offset!");
static_assert(offsetof(WBP_HUD_Resources_Intel_C_OnResourcesChange_Handler, InPrevious) == 0x000008, "Member 'WBP_HUD_Resources_Intel_C_OnResourcesChange_Handler::InPrevious' has a wrong offset!");
static_assert(offsetof(WBP_HUD_Resources_Intel_C_OnResourcesChange_Handler, InCurrent) == 0x000028, "Member 'WBP_HUD_Resources_Intel_C_OnResourcesChange_Handler::InCurrent' has a wrong offset!");
static_assert(offsetof(WBP_HUD_Resources_Intel_C_OnResourcesChange_Handler, CallFunc_GetOwningPlayerState_ReturnValue) == 0x000048, "Member 'WBP_HUD_Resources_Intel_C_OnResourcesChange_Handler::CallFunc_GetOwningPlayerState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_Resources_Intel_C_OnResourcesChange_Handler, CallFunc_GetPlayerFaction_ReturnValue) == 0x000050, "Member 'WBP_HUD_Resources_Intel_C_OnResourcesChange_Handler::CallFunc_GetPlayerFaction_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_Resources_Intel_C_OnResourcesChange_Handler, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000051, "Member 'WBP_HUD_Resources_Intel_C_OnResourcesChange_Handler::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_Resources_Intel_C_OnResourcesChange_Handler, CallFunc_Greater_IntInt_ReturnValue) == 0x000052, "Member 'WBP_HUD_Resources_Intel_C_OnResourcesChange_Handler::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_Resources_Intel_C_OnResourcesChange_Handler, CallFunc_Greater_IntInt_ReturnValue_1) == 0x000053, "Member 'WBP_HUD_Resources_Intel_C_OnResourcesChange_Handler::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_HUD_Resources_Intel_C_OnResourcesChange_Handler, CallFunc_Conv_IntToText_ReturnValue) == 0x000058, "Member 'WBP_HUD_Resources_Intel_C_OnResourcesChange_Handler::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_Resources_Intel_C_OnResourcesChange_Handler, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000068, "Member 'WBP_HUD_Resources_Intel_C_OnResourcesChange_Handler::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");

// Function WBP_HUD_Resources_Intel.WBP_HUD_Resources_Intel_C.SetAreResourcesVisible
// 0x0002 (0x0002 - 0x0000)
struct WBP_HUD_Resources_Intel_C_SetAreResourcesVisible final
{
public:
	bool                                          bInValue;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_Resources_Intel_C_SetAreResourcesVisible) == 0x000001, "Wrong alignment on WBP_HUD_Resources_Intel_C_SetAreResourcesVisible");
static_assert(sizeof(WBP_HUD_Resources_Intel_C_SetAreResourcesVisible) == 0x000002, "Wrong size on WBP_HUD_Resources_Intel_C_SetAreResourcesVisible");
static_assert(offsetof(WBP_HUD_Resources_Intel_C_SetAreResourcesVisible, bInValue) == 0x000000, "Member 'WBP_HUD_Resources_Intel_C_SetAreResourcesVisible::bInValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_Resources_Intel_C_SetAreResourcesVisible, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000001, "Member 'WBP_HUD_Resources_Intel_C_SetAreResourcesVisible::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");

// Function WBP_HUD_Resources_Intel.WBP_HUD_Resources_Intel_C.SetRelevant
// 0x0002 (0x0002 - 0x0000)
struct WBP_HUD_Resources_Intel_C_SetRelevant final
{
public:
	bool                                          bInValue;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_Resources_Intel_C_SetRelevant) == 0x000001, "Wrong alignment on WBP_HUD_Resources_Intel_C_SetRelevant");
static_assert(sizeof(WBP_HUD_Resources_Intel_C_SetRelevant) == 0x000002, "Wrong size on WBP_HUD_Resources_Intel_C_SetRelevant");
static_assert(offsetof(WBP_HUD_Resources_Intel_C_SetRelevant, bInValue) == 0x000000, "Member 'WBP_HUD_Resources_Intel_C_SetRelevant::bInValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_Resources_Intel_C_SetRelevant, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000001, "Member 'WBP_HUD_Resources_Intel_C_SetRelevant::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");

// Function WBP_HUD_Resources_Intel.WBP_HUD_Resources_Intel_C.TryPlayAnim
// 0x0003 (0x0003 - 0x0000)
struct WBP_HUD_Resources_Intel_C_TryPlayAnim final
{
public:
	bool                                          bInShow;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsStartupSequenceFinished_ReturnValue;    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_Resources_Intel_C_TryPlayAnim) == 0x000001, "Wrong alignment on WBP_HUD_Resources_Intel_C_TryPlayAnim");
static_assert(sizeof(WBP_HUD_Resources_Intel_C_TryPlayAnim) == 0x000003, "Wrong size on WBP_HUD_Resources_Intel_C_TryPlayAnim");
static_assert(offsetof(WBP_HUD_Resources_Intel_C_TryPlayAnim, bInShow) == 0x000000, "Member 'WBP_HUD_Resources_Intel_C_TryPlayAnim::bInShow' has a wrong offset!");
static_assert(offsetof(WBP_HUD_Resources_Intel_C_TryPlayAnim, CallFunc_IsStartupSequenceFinished_ReturnValue) == 0x000001, "Member 'WBP_HUD_Resources_Intel_C_TryPlayAnim::CallFunc_IsStartupSequenceFinished_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_Resources_Intel_C_TryPlayAnim, CallFunc_BooleanAND_ReturnValue) == 0x000002, "Member 'WBP_HUD_Resources_Intel_C_TryPlayAnim::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function WBP_HUD_Resources_Intel.WBP_HUD_Resources_Intel_C.OnCanPlayWidgetAnimation
// 0x0020 (0x0020 - 0x0000)
struct WBP_HUD_Resources_Intel_C_OnCanPlayWidgetAnimation final
{
public:
	struct FGameplayTag                           InAnim;                                            // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess;   // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UTedPlayerData*                         CallFunc_GetTargetPlayerData_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsIntelRelevant_ReturnValue;              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_Resources_Intel_C_OnCanPlayWidgetAnimation) == 0x000008, "Wrong alignment on WBP_HUD_Resources_Intel_C_OnCanPlayWidgetAnimation");
static_assert(sizeof(WBP_HUD_Resources_Intel_C_OnCanPlayWidgetAnimation) == 0x000020, "Wrong size on WBP_HUD_Resources_Intel_C_OnCanPlayWidgetAnimation");
static_assert(offsetof(WBP_HUD_Resources_Intel_C_OnCanPlayWidgetAnimation, InAnim) == 0x000000, "Member 'WBP_HUD_Resources_Intel_C_OnCanPlayWidgetAnimation::InAnim' has a wrong offset!");
static_assert(offsetof(WBP_HUD_Resources_Intel_C_OnCanPlayWidgetAnimation, ReturnValue) == 0x000008, "Member 'WBP_HUD_Resources_Intel_C_OnCanPlayWidgetAnimation::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_Resources_Intel_C_OnCanPlayWidgetAnimation, GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess) == 0x000009, "Member 'WBP_HUD_Resources_Intel_C_OnCanPlayWidgetAnimation::GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_HUD_Resources_Intel_C_OnCanPlayWidgetAnimation, CallFunc_GetTargetPlayerData_ReturnValue) == 0x000010, "Member 'WBP_HUD_Resources_Intel_C_OnCanPlayWidgetAnimation::CallFunc_GetTargetPlayerData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_Resources_Intel_C_OnCanPlayWidgetAnimation, CallFunc_IsIntelRelevant_ReturnValue) == 0x000018, "Member 'WBP_HUD_Resources_Intel_C_OnCanPlayWidgetAnimation::CallFunc_IsIntelRelevant_ReturnValue' has a wrong offset!");

}

