#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_HUD_Widget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Tempest_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_HUD_Widget.WBP_HUD_Widget_C
// 0x0090 (0x0490 - 0x0400)
class UWBP_HUD_Widget_C final : public UTedUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0400(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_HUD_BuildingGridCorner_C*          BuildingGrid;                                      // 0x0408(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_HUD_MinimapCorner_C*               MinimapCorner;                                     // 0x0410(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MissionClock_C*                    MissionClock;                                      // 0x0418(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_HUD_ObjectivesWidget_C*            ObjectivesWidget;                                  // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_HUD_PlayerCommands_C*              PlayerCommands;                                    // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_HUD_Popup_C*                       Popup;                                             // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_HUD_Popup_2Buttons_C*              Popup_2Buttons;                                    // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_HUD_Popup_C*                       Popup_Side;                                        // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SaveIndicator_C*                   SaveIndicator;                                     // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_HUD_SelectionGroupsCorner_C*       SelectionGroups;                                   // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_TedHintsMain_C*                    TedHintsMain;                                      // 0x0458(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UTedUserWidget*>                 StartupSequenceAnimOrder;                          // 0x0460(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	int32                                         CurrentStartupSequenceWidget;                      // 0x0470(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_474[0x4];                                      // 0x0474(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UTedUserWidget*>                 WidgetsBlockingStartupSequenceEnd;                 // 0x0478(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	struct FTimerHandle                           PlayPossibleStartupSequencesTimerHandle;           // 0x0488(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void CacheStartuipSequenceOrder();
	void ClearPlayPossibleStartupSequencesTimer();
	void Construct();
	void ExecuteUbergraph_WBP_HUD_Widget(int32 EntryPoint);
	void OnInnerWidgetAnimationEnd(class UTedUserWidget* InWidget, const struct FGameplayTag& InAnimation);
	void OnPlayWidgetAnimation(const struct FGameplayTag& InAnim);
	void PlayPossibleStartupSequences();
	void PlayPossibleStartupSequencesTimer();
	void TryEndStartupSequence();

	bool OnCanPlayWidgetAnimation(const struct FGameplayTag& InAnim) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_HUD_Widget_C">();
	}
	static class UWBP_HUD_Widget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_HUD_Widget_C>();
	}
};
static_assert(alignof(UWBP_HUD_Widget_C) == 0x000008, "Wrong alignment on UWBP_HUD_Widget_C");
static_assert(sizeof(UWBP_HUD_Widget_C) == 0x000490, "Wrong size on UWBP_HUD_Widget_C");
static_assert(offsetof(UWBP_HUD_Widget_C, UberGraphFrame) == 0x000400, "Member 'UWBP_HUD_Widget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_Widget_C, BuildingGrid) == 0x000408, "Member 'UWBP_HUD_Widget_C::BuildingGrid' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_Widget_C, MinimapCorner) == 0x000410, "Member 'UWBP_HUD_Widget_C::MinimapCorner' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_Widget_C, MissionClock) == 0x000418, "Member 'UWBP_HUD_Widget_C::MissionClock' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_Widget_C, ObjectivesWidget) == 0x000420, "Member 'UWBP_HUD_Widget_C::ObjectivesWidget' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_Widget_C, PlayerCommands) == 0x000428, "Member 'UWBP_HUD_Widget_C::PlayerCommands' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_Widget_C, Popup) == 0x000430, "Member 'UWBP_HUD_Widget_C::Popup' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_Widget_C, Popup_2Buttons) == 0x000438, "Member 'UWBP_HUD_Widget_C::Popup_2Buttons' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_Widget_C, Popup_Side) == 0x000440, "Member 'UWBP_HUD_Widget_C::Popup_Side' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_Widget_C, SaveIndicator) == 0x000448, "Member 'UWBP_HUD_Widget_C::SaveIndicator' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_Widget_C, SelectionGroups) == 0x000450, "Member 'UWBP_HUD_Widget_C::SelectionGroups' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_Widget_C, TedHintsMain) == 0x000458, "Member 'UWBP_HUD_Widget_C::TedHintsMain' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_Widget_C, StartupSequenceAnimOrder) == 0x000460, "Member 'UWBP_HUD_Widget_C::StartupSequenceAnimOrder' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_Widget_C, CurrentStartupSequenceWidget) == 0x000470, "Member 'UWBP_HUD_Widget_C::CurrentStartupSequenceWidget' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_Widget_C, WidgetsBlockingStartupSequenceEnd) == 0x000478, "Member 'UWBP_HUD_Widget_C::WidgetsBlockingStartupSequenceEnd' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_Widget_C, PlayPossibleStartupSequencesTimerHandle) == 0x000488, "Member 'UWBP_HUD_Widget_C::PlayPossibleStartupSequencesTimerHandle' has a wrong offset!");

}

