#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Commands_Slot_Glowing_Short

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Slate_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Tempest_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_Commands_Slot_Glowing_Short.WBP_Commands_Slot_Glowing_Short_C.CheckForHighlight
// 0x0030 (0x0030 - 0x0000)
struct WBP_Commands_Slot_Glowing_Short_C_CheckForHighlight final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UTedHintsSubsystem*                     CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSlotIndex_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTedCommandsPanel*                      CallFunc_GetCommandsPanel_ReturnValue;             // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TSubclassOf<class UTedCommand>                CallFunc_GetSlotContent_ReturnValue;               // 0x0020(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldAbilityBeHighlighted_ReturnValue;   // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Commands_Slot_Glowing_Short_C_CheckForHighlight) == 0x000008, "Wrong alignment on WBP_Commands_Slot_Glowing_Short_C_CheckForHighlight");
static_assert(sizeof(WBP_Commands_Slot_Glowing_Short_C_CheckForHighlight) == 0x000030, "Wrong size on WBP_Commands_Slot_Glowing_Short_C_CheckForHighlight");
static_assert(offsetof(WBP_Commands_Slot_Glowing_Short_C_CheckForHighlight, Temp_bool_Variable) == 0x000000, "Member 'WBP_Commands_Slot_Glowing_Short_C_CheckForHighlight::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_Short_C_CheckForHighlight, Temp_byte_Variable) == 0x000001, "Member 'WBP_Commands_Slot_Glowing_Short_C_CheckForHighlight::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_Short_C_CheckForHighlight, Temp_byte_Variable_1) == 0x000002, "Member 'WBP_Commands_Slot_Glowing_Short_C_CheckForHighlight::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_Short_C_CheckForHighlight, CallFunc_GetWorldSubsystem_ReturnValue) == 0x000008, "Member 'WBP_Commands_Slot_Glowing_Short_C_CheckForHighlight::CallFunc_GetWorldSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_Short_C_CheckForHighlight, CallFunc_GetSlotIndex_ReturnValue) == 0x000010, "Member 'WBP_Commands_Slot_Glowing_Short_C_CheckForHighlight::CallFunc_GetSlotIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_Short_C_CheckForHighlight, CallFunc_GetCommandsPanel_ReturnValue) == 0x000018, "Member 'WBP_Commands_Slot_Glowing_Short_C_CheckForHighlight::CallFunc_GetCommandsPanel_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_Short_C_CheckForHighlight, CallFunc_GetSlotContent_ReturnValue) == 0x000020, "Member 'WBP_Commands_Slot_Glowing_Short_C_CheckForHighlight::CallFunc_GetSlotContent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_Short_C_CheckForHighlight, CallFunc_ShouldAbilityBeHighlighted_ReturnValue) == 0x000028, "Member 'WBP_Commands_Slot_Glowing_Short_C_CheckForHighlight::CallFunc_ShouldAbilityBeHighlighted_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_Short_C_CheckForHighlight, K2Node_Select_Default) == 0x000029, "Member 'WBP_Commands_Slot_Glowing_Short_C_CheckForHighlight::K2Node_Select_Default' has a wrong offset!");

// Function WBP_Commands_Slot_Glowing_Short.WBP_Commands_Slot_Glowing_Short_C.ExecuteUbergraph_WBP_Commands_Slot_Glowing_Short
// 0x0180 (0x0180 - 0x0000)
struct WBP_Commands_Slot_Glowing_Short_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing_Short final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSlotIndex_ReturnValue;                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0010(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTedCommandsPanel*                      CallFunc_GetCommandsPanel_ReturnValue;             // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSlotIndex_ReturnValue_1;               // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCooldown_OutCooldownAlpha;             // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCooldown_OutDuration;                  // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetCooldown_ReturnValue;                  // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_DoubleDouble_ReturnValue;        // 0x0065(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_66[0x2];                                       // 0x0066(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bToggle;                        // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_73[0x5];                                       // 0x0073(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UImage*                                 K2Node_CustomEvent_ImageToToggle;                  // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UTedCommandsPanel*                      CallFunc_GetCommandsPanel_ReturnValue_1;           // 0x0080(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             CallFunc_GetSlotContentUIData_OutIcon;             // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetSlotContentUIData_OutName;             // 0x0098(0x0010)()
	class FText                                   CallFunc_GetSlotContentUIData_OutDescription;      // 0x00A8(0x0010)()
	bool                                          CallFunc_GetSlotContentUIData_ReturnValue;         // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETedContentSlotState                          K2Node_Event_InState;                              // 0x00BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInActivated;                         // 0x00BB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_BoolToString_ReturnValue;            // 0x00C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x00D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable;                                // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETedContentSlotState                          CallFunc_GetDurationActiveSlotState_ReturnValue;   // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETedContentSlotState                          CallFunc_GetAlternatingActiveSlotState_ReturnValue; // 0x00F2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x00F3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x00F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x00F5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F6[0x2];                                       // 0x00F6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_1;                              // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Select_Default_1;                           // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetPathName_ReturnValue;                  // 0x0108(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0118(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0128(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0138(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x0148(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_4;              // 0x0158(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_B_ImplicitCast;     // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_NotEqual_DoubleDouble_A_ImplicitCast;     // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetRenderOpacity_InOpacity_ImplicitCast;  // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Commands_Slot_Glowing_Short_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing_Short) == 0x000008, "Wrong alignment on WBP_Commands_Slot_Glowing_Short_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing_Short");
static_assert(sizeof(WBP_Commands_Slot_Glowing_Short_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing_Short) == 0x000180, "Wrong size on WBP_Commands_Slot_Glowing_Short_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing_Short");
static_assert(offsetof(WBP_Commands_Slot_Glowing_Short_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing_Short, EntryPoint) == 0x000000, "Member 'WBP_Commands_Slot_Glowing_Short_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing_Short::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_Short_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing_Short, CallFunc_GetSlotIndex_ReturnValue) == 0x000004, "Member 'WBP_Commands_Slot_Glowing_Short_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing_Short::CallFunc_GetSlotIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_Short_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing_Short, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000008, "Member 'WBP_Commands_Slot_Glowing_Short_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing_Short::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_Short_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing_Short, K2Node_Event_MyGeometry) == 0x000010, "Member 'WBP_Commands_Slot_Glowing_Short_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing_Short::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_Short_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing_Short, K2Node_Event_InDeltaTime) == 0x000048, "Member 'WBP_Commands_Slot_Glowing_Short_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing_Short::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_Short_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing_Short, CallFunc_GetCommandsPanel_ReturnValue) == 0x000050, "Member 'WBP_Commands_Slot_Glowing_Short_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing_Short::CallFunc_GetCommandsPanel_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_Short_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing_Short, CallFunc_GetSlotIndex_ReturnValue_1) == 0x000058, "Member 'WBP_Commands_Slot_Glowing_Short_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing_Short::CallFunc_GetSlotIndex_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_Short_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing_Short, CallFunc_GetCooldown_OutCooldownAlpha) == 0x00005C, "Member 'WBP_Commands_Slot_Glowing_Short_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing_Short::CallFunc_GetCooldown_OutCooldownAlpha' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_Short_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing_Short, CallFunc_GetCooldown_OutDuration) == 0x000060, "Member 'WBP_Commands_Slot_Glowing_Short_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing_Short::CallFunc_GetCooldown_OutDuration' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_Short_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing_Short, CallFunc_GetCooldown_ReturnValue) == 0x000064, "Member 'WBP_Commands_Slot_Glowing_Short_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing_Short::CallFunc_GetCooldown_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_Short_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing_Short, CallFunc_NotEqual_DoubleDouble_ReturnValue) == 0x000065, "Member 'WBP_Commands_Slot_Glowing_Short_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing_Short::CallFunc_NotEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_Short_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing_Short, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000068, "Member 'WBP_Commands_Slot_Glowing_Short_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing_Short::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_Short_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing_Short, Temp_byte_Variable) == 0x000070, "Member 'WBP_Commands_Slot_Glowing_Short_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing_Short::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_Short_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing_Short, Temp_byte_Variable_1) == 0x000071, "Member 'WBP_Commands_Slot_Glowing_Short_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing_Short::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_Short_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing_Short, K2Node_CustomEvent_bToggle) == 0x000072, "Member 'WBP_Commands_Slot_Glowing_Short_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing_Short::K2Node_CustomEvent_bToggle' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_Short_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing_Short, K2Node_CustomEvent_ImageToToggle) == 0x000078, "Member 'WBP_Commands_Slot_Glowing_Short_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing_Short::K2Node_CustomEvent_ImageToToggle' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_Short_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing_Short, CallFunc_GetCommandsPanel_ReturnValue_1) == 0x000080, "Member 'WBP_Commands_Slot_Glowing_Short_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing_Short::CallFunc_GetCommandsPanel_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_Short_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing_Short, Temp_bool_Variable) == 0x000088, "Member 'WBP_Commands_Slot_Glowing_Short_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing_Short::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_Short_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing_Short, CallFunc_GetSlotContentUIData_OutIcon) == 0x000090, "Member 'WBP_Commands_Slot_Glowing_Short_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing_Short::CallFunc_GetSlotContentUIData_OutIcon' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_Short_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing_Short, CallFunc_GetSlotContentUIData_OutName) == 0x000098, "Member 'WBP_Commands_Slot_Glowing_Short_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing_Short::CallFunc_GetSlotContentUIData_OutName' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_Short_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing_Short, CallFunc_GetSlotContentUIData_OutDescription) == 0x0000A8, "Member 'WBP_Commands_Slot_Glowing_Short_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing_Short::CallFunc_GetSlotContentUIData_OutDescription' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_Short_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing_Short, CallFunc_GetSlotContentUIData_ReturnValue) == 0x0000B8, "Member 'WBP_Commands_Slot_Glowing_Short_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing_Short::CallFunc_GetSlotContentUIData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_Short_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing_Short, K2Node_Select_Default) == 0x0000B9, "Member 'WBP_Commands_Slot_Glowing_Short_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing_Short::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_Short_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing_Short, K2Node_Event_InState) == 0x0000BA, "Member 'WBP_Commands_Slot_Glowing_Short_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing_Short::K2Node_Event_InState' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_Short_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing_Short, K2Node_Event_bInActivated) == 0x0000BB, "Member 'WBP_Commands_Slot_Glowing_Short_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing_Short::K2Node_Event_bInActivated' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_Short_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing_Short, CallFunc_Conv_BoolToString_ReturnValue) == 0x0000C0, "Member 'WBP_Commands_Slot_Glowing_Short_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing_Short::CallFunc_Conv_BoolToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_Short_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing_Short, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x0000D0, "Member 'WBP_Commands_Slot_Glowing_Short_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing_Short::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_Short_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing_Short, K2Node_SwitchEnum_CmpSuccess) == 0x0000E0, "Member 'WBP_Commands_Slot_Glowing_Short_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing_Short::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_Short_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing_Short, Temp_real_Variable) == 0x0000E8, "Member 'WBP_Commands_Slot_Glowing_Short_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing_Short::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_Short_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing_Short, CallFunc_GetDurationActiveSlotState_ReturnValue) == 0x0000F0, "Member 'WBP_Commands_Slot_Glowing_Short_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing_Short::CallFunc_GetDurationActiveSlotState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_Short_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing_Short, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000F1, "Member 'WBP_Commands_Slot_Glowing_Short_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing_Short::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_Short_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing_Short, CallFunc_GetAlternatingActiveSlotState_ReturnValue) == 0x0000F2, "Member 'WBP_Commands_Slot_Glowing_Short_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing_Short::CallFunc_GetAlternatingActiveSlotState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_Short_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing_Short, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x0000F3, "Member 'WBP_Commands_Slot_Glowing_Short_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing_Short::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_Short_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing_Short, K2Node_Event_IsDesignTime) == 0x0000F4, "Member 'WBP_Commands_Slot_Glowing_Short_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing_Short::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_Short_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing_Short, Temp_bool_Variable_1) == 0x0000F5, "Member 'WBP_Commands_Slot_Glowing_Short_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing_Short::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_Short_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing_Short, Temp_real_Variable_1) == 0x0000F8, "Member 'WBP_Commands_Slot_Glowing_Short_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing_Short::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_Short_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing_Short, K2Node_Select_Default_1) == 0x000100, "Member 'WBP_Commands_Slot_Glowing_Short_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing_Short::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_Short_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing_Short, CallFunc_GetPathName_ReturnValue) == 0x000108, "Member 'WBP_Commands_Slot_Glowing_Short_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing_Short::CallFunc_GetPathName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_Short_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing_Short, CallFunc_Concat_StrStr_ReturnValue) == 0x000118, "Member 'WBP_Commands_Slot_Glowing_Short_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing_Short::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_Short_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing_Short, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000128, "Member 'WBP_Commands_Slot_Glowing_Short_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing_Short::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_Short_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing_Short, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000138, "Member 'WBP_Commands_Slot_Glowing_Short_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing_Short::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_Short_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing_Short, CallFunc_Concat_StrStr_ReturnValue_3) == 0x000148, "Member 'WBP_Commands_Slot_Glowing_Short_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing_Short::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_Short_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing_Short, CallFunc_Concat_StrStr_ReturnValue_4) == 0x000158, "Member 'WBP_Commands_Slot_Glowing_Short_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing_Short::CallFunc_Concat_StrStr_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_Short_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing_Short, CallFunc_Subtract_DoubleDouble_B_ImplicitCast) == 0x000168, "Member 'WBP_Commands_Slot_Glowing_Short_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing_Short::CallFunc_Subtract_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_Short_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing_Short, CallFunc_NotEqual_DoubleDouble_A_ImplicitCast) == 0x000170, "Member 'WBP_Commands_Slot_Glowing_Short_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing_Short::CallFunc_NotEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_Short_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing_Short, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000178, "Member 'WBP_Commands_Slot_Glowing_Short_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing_Short::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_Short_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing_Short, CallFunc_SetRenderOpacity_InOpacity_ImplicitCast) == 0x00017C, "Member 'WBP_Commands_Slot_Glowing_Short_C_ExecuteUbergraph_WBP_Commands_Slot_Glowing_Short::CallFunc_SetRenderOpacity_InOpacity_ImplicitCast' has a wrong offset!");

// Function WBP_Commands_Slot_Glowing_Short.WBP_Commands_Slot_Glowing_Short_C.GetCommandsPanel
// 0x0020 (0x0020 - 0x0000)
struct WBP_Commands_Slot_Glowing_Short_C_GetCommandsPanel final
{
public:
	class UTedCommandsPanel*                      ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UTedContentPanelBase*                   CallFunc_GetParentContentPanel_ReturnValue;        // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UTedCommandsPanel*                      K2Node_DynamicCast_AsTed_Commands_Panel;           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Commands_Slot_Glowing_Short_C_GetCommandsPanel) == 0x000008, "Wrong alignment on WBP_Commands_Slot_Glowing_Short_C_GetCommandsPanel");
static_assert(sizeof(WBP_Commands_Slot_Glowing_Short_C_GetCommandsPanel) == 0x000020, "Wrong size on WBP_Commands_Slot_Glowing_Short_C_GetCommandsPanel");
static_assert(offsetof(WBP_Commands_Slot_Glowing_Short_C_GetCommandsPanel, ReturnValue) == 0x000000, "Member 'WBP_Commands_Slot_Glowing_Short_C_GetCommandsPanel::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_Short_C_GetCommandsPanel, CallFunc_GetParentContentPanel_ReturnValue) == 0x000008, "Member 'WBP_Commands_Slot_Glowing_Short_C_GetCommandsPanel::CallFunc_GetParentContentPanel_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_Short_C_GetCommandsPanel, K2Node_DynamicCast_AsTed_Commands_Panel) == 0x000010, "Member 'WBP_Commands_Slot_Glowing_Short_C_GetCommandsPanel::K2Node_DynamicCast_AsTed_Commands_Panel' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_Short_C_GetCommandsPanel, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WBP_Commands_Slot_Glowing_Short_C_GetCommandsPanel::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WBP_Commands_Slot_Glowing_Short.WBP_Commands_Slot_Glowing_Short_C.GetSlotCDO
// 0x0020 (0x0020 - 0x0000)
struct WBP_Commands_Slot_Glowing_Short_C_GetSlotCDO final
{
public:
	const class UTedCommand*                      ReturnValue;                                       // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSlotIndex_ReturnValue;                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTedCommandsPanel*                      CallFunc_GetCommandsPanel_ReturnValue;             // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	const class UTedCommand*                      CallFunc_GetSlotContentCDO_ReturnValue;            // 0x0018(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Commands_Slot_Glowing_Short_C_GetSlotCDO) == 0x000008, "Wrong alignment on WBP_Commands_Slot_Glowing_Short_C_GetSlotCDO");
static_assert(sizeof(WBP_Commands_Slot_Glowing_Short_C_GetSlotCDO) == 0x000020, "Wrong size on WBP_Commands_Slot_Glowing_Short_C_GetSlotCDO");
static_assert(offsetof(WBP_Commands_Slot_Glowing_Short_C_GetSlotCDO, ReturnValue) == 0x000000, "Member 'WBP_Commands_Slot_Glowing_Short_C_GetSlotCDO::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_Short_C_GetSlotCDO, CallFunc_GetSlotIndex_ReturnValue) == 0x000008, "Member 'WBP_Commands_Slot_Glowing_Short_C_GetSlotCDO::CallFunc_GetSlotIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_Short_C_GetSlotCDO, CallFunc_GetCommandsPanel_ReturnValue) == 0x000010, "Member 'WBP_Commands_Slot_Glowing_Short_C_GetSlotCDO::CallFunc_GetCommandsPanel_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_Short_C_GetSlotCDO, CallFunc_GetSlotContentCDO_ReturnValue) == 0x000018, "Member 'WBP_Commands_Slot_Glowing_Short_C_GetSlotCDO::CallFunc_GetSlotContentCDO_ReturnValue' has a wrong offset!");

// Function WBP_Commands_Slot_Glowing_Short.WBP_Commands_Slot_Glowing_Short_C.OnActivateState
// 0x0002 (0x0002 - 0x0000)
struct WBP_Commands_Slot_Glowing_Short_C_OnActivateState final
{
public:
	ETedContentSlotState                          InState;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bInActivated;                                      // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Commands_Slot_Glowing_Short_C_OnActivateState) == 0x000001, "Wrong alignment on WBP_Commands_Slot_Glowing_Short_C_OnActivateState");
static_assert(sizeof(WBP_Commands_Slot_Glowing_Short_C_OnActivateState) == 0x000002, "Wrong size on WBP_Commands_Slot_Glowing_Short_C_OnActivateState");
static_assert(offsetof(WBP_Commands_Slot_Glowing_Short_C_OnActivateState, InState) == 0x000000, "Member 'WBP_Commands_Slot_Glowing_Short_C_OnActivateState::InState' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_Short_C_OnActivateState, bInActivated) == 0x000001, "Member 'WBP_Commands_Slot_Glowing_Short_C_OnActivateState::bInActivated' has a wrong offset!");

// Function WBP_Commands_Slot_Glowing_Short.WBP_Commands_Slot_Glowing_Short_C.OnRefreshControlMappings
// 0x0048 (0x0048 - 0x0000)
struct WBP_Commands_Slot_Glowing_Short_C_OnRefreshControlMappings final
{
public:
	int32                                         CallFunc_GetSlotIndex_ReturnValue;                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTedCommandsPanel*                      CallFunc_GetCommandsPanel_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FInputChord                            CallFunc_GetShortcut_OutShortcut;                  // 0x0010(0x0020)(HasGetValueTypeHash)
	bool                                          CallFunc_GetShortcut_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetChordDisplayText_ReturnValue;          // 0x0038(0x0010)()
};
static_assert(alignof(WBP_Commands_Slot_Glowing_Short_C_OnRefreshControlMappings) == 0x000008, "Wrong alignment on WBP_Commands_Slot_Glowing_Short_C_OnRefreshControlMappings");
static_assert(sizeof(WBP_Commands_Slot_Glowing_Short_C_OnRefreshControlMappings) == 0x000048, "Wrong size on WBP_Commands_Slot_Glowing_Short_C_OnRefreshControlMappings");
static_assert(offsetof(WBP_Commands_Slot_Glowing_Short_C_OnRefreshControlMappings, CallFunc_GetSlotIndex_ReturnValue) == 0x000000, "Member 'WBP_Commands_Slot_Glowing_Short_C_OnRefreshControlMappings::CallFunc_GetSlotIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_Short_C_OnRefreshControlMappings, CallFunc_GetCommandsPanel_ReturnValue) == 0x000008, "Member 'WBP_Commands_Slot_Glowing_Short_C_OnRefreshControlMappings::CallFunc_GetCommandsPanel_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_Short_C_OnRefreshControlMappings, CallFunc_GetShortcut_OutShortcut) == 0x000010, "Member 'WBP_Commands_Slot_Glowing_Short_C_OnRefreshControlMappings::CallFunc_GetShortcut_OutShortcut' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_Short_C_OnRefreshControlMappings, CallFunc_GetShortcut_ReturnValue) == 0x000030, "Member 'WBP_Commands_Slot_Glowing_Short_C_OnRefreshControlMappings::CallFunc_GetShortcut_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_Short_C_OnRefreshControlMappings, CallFunc_GetChordDisplayText_ReturnValue) == 0x000038, "Member 'WBP_Commands_Slot_Glowing_Short_C_OnRefreshControlMappings::CallFunc_GetChordDisplayText_ReturnValue' has a wrong offset!");

// Function WBP_Commands_Slot_Glowing_Short.WBP_Commands_Slot_Glowing_Short_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_Commands_Slot_Glowing_Short_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Commands_Slot_Glowing_Short_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_Commands_Slot_Glowing_Short_C_PreConstruct");
static_assert(sizeof(WBP_Commands_Slot_Glowing_Short_C_PreConstruct) == 0x000001, "Wrong size on WBP_Commands_Slot_Glowing_Short_C_PreConstruct");
static_assert(offsetof(WBP_Commands_Slot_Glowing_Short_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_Commands_Slot_Glowing_Short_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_Commands_Slot_Glowing_Short.WBP_Commands_Slot_Glowing_Short_C.SetActiveEffectColor
// 0x0040 (0x0040 - 0x0000)
struct WBP_Commands_Slot_Glowing_Short_C_SetActiveEffectColor final
{
public:
	bool                                          Condition;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Commands_Slot_Glowing_Short_C_SetActiveEffectColor) == 0x000008, "Wrong alignment on WBP_Commands_Slot_Glowing_Short_C_SetActiveEffectColor");
static_assert(sizeof(WBP_Commands_Slot_Glowing_Short_C_SetActiveEffectColor) == 0x000040, "Wrong size on WBP_Commands_Slot_Glowing_Short_C_SetActiveEffectColor");
static_assert(offsetof(WBP_Commands_Slot_Glowing_Short_C_SetActiveEffectColor, Condition) == 0x000000, "Member 'WBP_Commands_Slot_Glowing_Short_C_SetActiveEffectColor::Condition' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_Short_C_SetActiveEffectColor, Temp_int_Array_Index_Variable) == 0x000004, "Member 'WBP_Commands_Slot_Glowing_Short_C_SetActiveEffectColor::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_Short_C_SetActiveEffectColor, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'WBP_Commands_Slot_Glowing_Short_C_SetActiveEffectColor::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_Short_C_SetActiveEffectColor, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'WBP_Commands_Slot_Glowing_Short_C_SetActiveEffectColor::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_Short_C_SetActiveEffectColor, K2Node_MakeStruct_LinearColor) == 0x000010, "Member 'WBP_Commands_Slot_Glowing_Short_C_SetActiveEffectColor::K2Node_MakeStruct_LinearColor' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_Short_C_SetActiveEffectColor, CallFunc_Array_Get_Item) == 0x000020, "Member 'WBP_Commands_Slot_Glowing_Short_C_SetActiveEffectColor::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_Short_C_SetActiveEffectColor, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'WBP_Commands_Slot_Glowing_Short_C_SetActiveEffectColor::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_Short_C_SetActiveEffectColor, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000030, "Member 'WBP_Commands_Slot_Glowing_Short_C_SetActiveEffectColor::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_Short_C_SetActiveEffectColor, CallFunc_Less_IntInt_ReturnValue) == 0x000038, "Member 'WBP_Commands_Slot_Glowing_Short_C_SetActiveEffectColor::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_Commands_Slot_Glowing_Short.WBP_Commands_Slot_Glowing_Short_C.SetupCooldownImage
// 0x0008 (0x0008 - 0x0000)
struct WBP_Commands_Slot_Glowing_Short_C_SetupCooldownImage final
{
public:
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Commands_Slot_Glowing_Short_C_SetupCooldownImage) == 0x000008, "Wrong alignment on WBP_Commands_Slot_Glowing_Short_C_SetupCooldownImage");
static_assert(sizeof(WBP_Commands_Slot_Glowing_Short_C_SetupCooldownImage) == 0x000008, "Wrong size on WBP_Commands_Slot_Glowing_Short_C_SetupCooldownImage");
static_assert(offsetof(WBP_Commands_Slot_Glowing_Short_C_SetupCooldownImage, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000000, "Member 'WBP_Commands_Slot_Glowing_Short_C_SetupCooldownImage::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");

// Function WBP_Commands_Slot_Glowing_Short.WBP_Commands_Slot_Glowing_Short_C.Tick
// 0x003C (0x003C - 0x0000)
struct WBP_Commands_Slot_Glowing_Short_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Commands_Slot_Glowing_Short_C_Tick) == 0x000004, "Wrong alignment on WBP_Commands_Slot_Glowing_Short_C_Tick");
static_assert(sizeof(WBP_Commands_Slot_Glowing_Short_C_Tick) == 0x00003C, "Wrong size on WBP_Commands_Slot_Glowing_Short_C_Tick");
static_assert(offsetof(WBP_Commands_Slot_Glowing_Short_C_Tick, MyGeometry) == 0x000000, "Member 'WBP_Commands_Slot_Glowing_Short_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_Short_C_Tick, InDeltaTime) == 0x000038, "Member 'WBP_Commands_Slot_Glowing_Short_C_Tick::InDeltaTime' has a wrong offset!");

// Function WBP_Commands_Slot_Glowing_Short.WBP_Commands_Slot_Glowing_Short_C.ToggleActiveEffect
// 0x0010 (0x0010 - 0x0000)
struct WBP_Commands_Slot_Glowing_Short_C_ToggleActiveEffect final
{
public:
	bool                                          bToggle;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UImage*                                 ImageToToggle;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Commands_Slot_Glowing_Short_C_ToggleActiveEffect) == 0x000008, "Wrong alignment on WBP_Commands_Slot_Glowing_Short_C_ToggleActiveEffect");
static_assert(sizeof(WBP_Commands_Slot_Glowing_Short_C_ToggleActiveEffect) == 0x000010, "Wrong size on WBP_Commands_Slot_Glowing_Short_C_ToggleActiveEffect");
static_assert(offsetof(WBP_Commands_Slot_Glowing_Short_C_ToggleActiveEffect, bToggle) == 0x000000, "Member 'WBP_Commands_Slot_Glowing_Short_C_ToggleActiveEffect::bToggle' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_Short_C_ToggleActiveEffect, ImageToToggle) == 0x000008, "Member 'WBP_Commands_Slot_Glowing_Short_C_ToggleActiveEffect::ImageToToggle' has a wrong offset!");

// Function WBP_Commands_Slot_Glowing_Short.WBP_Commands_Slot_Glowing_Short_C.GetMaterialsSupportingStates
// 0x0028 (0x0028 - 0x0000)
struct WBP_Commands_Slot_Glowing_Short_C_GetMaterialsSupportingStates final
{
public:
	TArray<class UMaterialInstanceDynamic*>       OutMIDs;                                           // 0x0000(0x0010)(Parm, OutParm)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UMaterialInstanceDynamic*>       K2Node_MakeArray_Array;                            // 0x0018(0x0010)(ReferenceParm)
};
static_assert(alignof(WBP_Commands_Slot_Glowing_Short_C_GetMaterialsSupportingStates) == 0x000008, "Wrong alignment on WBP_Commands_Slot_Glowing_Short_C_GetMaterialsSupportingStates");
static_assert(sizeof(WBP_Commands_Slot_Glowing_Short_C_GetMaterialsSupportingStates) == 0x000028, "Wrong size on WBP_Commands_Slot_Glowing_Short_C_GetMaterialsSupportingStates");
static_assert(offsetof(WBP_Commands_Slot_Glowing_Short_C_GetMaterialsSupportingStates, OutMIDs) == 0x000000, "Member 'WBP_Commands_Slot_Glowing_Short_C_GetMaterialsSupportingStates::OutMIDs' has a wrong offset!");
static_assert(offsetof(WBP_Commands_Slot_Glowing_Short_C_GetMaterialsSupportingStates, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000010, "Member 'WBP_Commands_Slot_Glowing_Short_C_GetMaterialsSupportingStates::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
