#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Generic_Popup

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_Generic_Popup.WBP_Generic_Popup_C.BndEvt__WBP_Generic_Popup_TextBox_K2Node_ComponentBoundEvent_0_OnEditableTextBoxChangedEvent__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_Generic_Popup_C_BndEvt__WBP_Generic_Popup_TextBox_K2Node_ComponentBoundEvent_0_OnEditableTextBoxChangedEvent__DelegateSignature final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_Generic_Popup_C_BndEvt__WBP_Generic_Popup_TextBox_K2Node_ComponentBoundEvent_0_OnEditableTextBoxChangedEvent__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Generic_Popup_C_BndEvt__WBP_Generic_Popup_TextBox_K2Node_ComponentBoundEvent_0_OnEditableTextBoxChangedEvent__DelegateSignature");
static_assert(sizeof(WBP_Generic_Popup_C_BndEvt__WBP_Generic_Popup_TextBox_K2Node_ComponentBoundEvent_0_OnEditableTextBoxChangedEvent__DelegateSignature) == 0x000010, "Wrong size on WBP_Generic_Popup_C_BndEvt__WBP_Generic_Popup_TextBox_K2Node_ComponentBoundEvent_0_OnEditableTextBoxChangedEvent__DelegateSignature");
static_assert(offsetof(WBP_Generic_Popup_C_BndEvt__WBP_Generic_Popup_TextBox_K2Node_ComponentBoundEvent_0_OnEditableTextBoxChangedEvent__DelegateSignature, Text) == 0x000000, "Member 'WBP_Generic_Popup_C_BndEvt__WBP_Generic_Popup_TextBox_K2Node_ComponentBoundEvent_0_OnEditableTextBoxChangedEvent__DelegateSignature::Text' has a wrong offset!");

// Function WBP_Generic_Popup.WBP_Generic_Popup_C.ExecuteUbergraph_WBP_Generic_Popup
// 0x0070 (0x0070 - 0x0000)
struct WBP_Generic_Popup_C_ExecuteUbergraph_WBP_Generic_Popup final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetEmptyText_ReturnValue;                 // 0x0008(0x0010)()
	class FText                                   K2Node_Event_ErrorMessage;                         // 0x0018(0x0010)(ConstParm)
	int32                                         CallFunc_GetOptionsCount_ReturnValue;              // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_ComponentBoundEvent_Text;                   // 0x0030(0x0010)(ConstParm)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_FixInvalidFilenameCharacters_ReturnValue; // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0060(0x0010)()
};
static_assert(alignof(WBP_Generic_Popup_C_ExecuteUbergraph_WBP_Generic_Popup) == 0x000008, "Wrong alignment on WBP_Generic_Popup_C_ExecuteUbergraph_WBP_Generic_Popup");
static_assert(sizeof(WBP_Generic_Popup_C_ExecuteUbergraph_WBP_Generic_Popup) == 0x000070, "Wrong size on WBP_Generic_Popup_C_ExecuteUbergraph_WBP_Generic_Popup");
static_assert(offsetof(WBP_Generic_Popup_C_ExecuteUbergraph_WBP_Generic_Popup, EntryPoint) == 0x000000, "Member 'WBP_Generic_Popup_C_ExecuteUbergraph_WBP_Generic_Popup::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Generic_Popup_C_ExecuteUbergraph_WBP_Generic_Popup, CallFunc_GetEmptyText_ReturnValue) == 0x000008, "Member 'WBP_Generic_Popup_C_ExecuteUbergraph_WBP_Generic_Popup::CallFunc_GetEmptyText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Generic_Popup_C_ExecuteUbergraph_WBP_Generic_Popup, K2Node_Event_ErrorMessage) == 0x000018, "Member 'WBP_Generic_Popup_C_ExecuteUbergraph_WBP_Generic_Popup::K2Node_Event_ErrorMessage' has a wrong offset!");
static_assert(offsetof(WBP_Generic_Popup_C_ExecuteUbergraph_WBP_Generic_Popup, CallFunc_GetOptionsCount_ReturnValue) == 0x000028, "Member 'WBP_Generic_Popup_C_ExecuteUbergraph_WBP_Generic_Popup::CallFunc_GetOptionsCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Generic_Popup_C_ExecuteUbergraph_WBP_Generic_Popup, CallFunc_Greater_IntInt_ReturnValue) == 0x00002C, "Member 'WBP_Generic_Popup_C_ExecuteUbergraph_WBP_Generic_Popup::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Generic_Popup_C_ExecuteUbergraph_WBP_Generic_Popup, K2Node_ComponentBoundEvent_Text) == 0x000030, "Member 'WBP_Generic_Popup_C_ExecuteUbergraph_WBP_Generic_Popup::K2Node_ComponentBoundEvent_Text' has a wrong offset!");
static_assert(offsetof(WBP_Generic_Popup_C_ExecuteUbergraph_WBP_Generic_Popup, CallFunc_Conv_TextToString_ReturnValue) == 0x000040, "Member 'WBP_Generic_Popup_C_ExecuteUbergraph_WBP_Generic_Popup::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Generic_Popup_C_ExecuteUbergraph_WBP_Generic_Popup, CallFunc_FixInvalidFilenameCharacters_ReturnValue) == 0x000050, "Member 'WBP_Generic_Popup_C_ExecuteUbergraph_WBP_Generic_Popup::CallFunc_FixInvalidFilenameCharacters_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Generic_Popup_C_ExecuteUbergraph_WBP_Generic_Popup, CallFunc_Conv_StringToText_ReturnValue) == 0x000060, "Member 'WBP_Generic_Popup_C_ExecuteUbergraph_WBP_Generic_Popup::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function WBP_Generic_Popup.WBP_Generic_Popup_C.K2_OnErrorShown
// 0x0010 (0x0010 - 0x0000)
struct WBP_Generic_Popup_C_K2_OnErrorShown final
{
public:
	class FText                                   ErrorMessage;                                      // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_Generic_Popup_C_K2_OnErrorShown) == 0x000008, "Wrong alignment on WBP_Generic_Popup_C_K2_OnErrorShown");
static_assert(sizeof(WBP_Generic_Popup_C_K2_OnErrorShown) == 0x000010, "Wrong size on WBP_Generic_Popup_C_K2_OnErrorShown");
static_assert(offsetof(WBP_Generic_Popup_C_K2_OnErrorShown, ErrorMessage) == 0x000000, "Member 'WBP_Generic_Popup_C_K2_OnErrorShown::ErrorMessage' has a wrong offset!");

}

