#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_HUD_Doctrines_Slot_Tooltip

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_HUD_Doctrines_Slot_Tooltip.WBP_HUD_Doctrines_Slot_Tooltip_C.RefreshBaseData
// 0x0028 (0x0028 - 0x0000)
struct WBP_HUD_Doctrines_Slot_Tooltip_C_RefreshBaseData final
{
public:
	class UTexture2D*                             CallFunc_GetIcon_ReturnValue;                      // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetDescription_ReturnValue;               // 0x0008(0x0010)()
	class FText                                   CallFunc_GetTitle_ReturnValue;                     // 0x0018(0x0010)(ConstParm)
};
static_assert(alignof(WBP_HUD_Doctrines_Slot_Tooltip_C_RefreshBaseData) == 0x000008, "Wrong alignment on WBP_HUD_Doctrines_Slot_Tooltip_C_RefreshBaseData");
static_assert(sizeof(WBP_HUD_Doctrines_Slot_Tooltip_C_RefreshBaseData) == 0x000028, "Wrong size on WBP_HUD_Doctrines_Slot_Tooltip_C_RefreshBaseData");
static_assert(offsetof(WBP_HUD_Doctrines_Slot_Tooltip_C_RefreshBaseData, CallFunc_GetIcon_ReturnValue) == 0x000000, "Member 'WBP_HUD_Doctrines_Slot_Tooltip_C_RefreshBaseData::CallFunc_GetIcon_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_Doctrines_Slot_Tooltip_C_RefreshBaseData, CallFunc_GetDescription_ReturnValue) == 0x000008, "Member 'WBP_HUD_Doctrines_Slot_Tooltip_C_RefreshBaseData::CallFunc_GetDescription_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_Doctrines_Slot_Tooltip_C_RefreshBaseData, CallFunc_GetTitle_ReturnValue) == 0x000018, "Member 'WBP_HUD_Doctrines_Slot_Tooltip_C_RefreshBaseData::CallFunc_GetTitle_ReturnValue' has a wrong offset!");

// Function WBP_HUD_Doctrines_Slot_Tooltip.WBP_HUD_Doctrines_Slot_Tooltip_C.RefreshCost
// 0x0038 (0x0038 - 0x0000)
struct WBP_HUD_Doctrines_Slot_Tooltip_C_RefreshCost final
{
public:
	bool                                          CallFunc_IsResearchRelevant_ReturnValue;           // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetResearchTime_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue;            // 0x0008(0x0010)()
	int32                                         CallFunc_GetResearchCostCredits_ReturnValue;       // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0020(0x0010)()
	double                                        CallFunc_Conv_DoubleToText_Value_ImplicitCast;     // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_Doctrines_Slot_Tooltip_C_RefreshCost) == 0x000008, "Wrong alignment on WBP_HUD_Doctrines_Slot_Tooltip_C_RefreshCost");
static_assert(sizeof(WBP_HUD_Doctrines_Slot_Tooltip_C_RefreshCost) == 0x000038, "Wrong size on WBP_HUD_Doctrines_Slot_Tooltip_C_RefreshCost");
static_assert(offsetof(WBP_HUD_Doctrines_Slot_Tooltip_C_RefreshCost, CallFunc_IsResearchRelevant_ReturnValue) == 0x000000, "Member 'WBP_HUD_Doctrines_Slot_Tooltip_C_RefreshCost::CallFunc_IsResearchRelevant_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_Doctrines_Slot_Tooltip_C_RefreshCost, CallFunc_GetResearchTime_ReturnValue) == 0x000004, "Member 'WBP_HUD_Doctrines_Slot_Tooltip_C_RefreshCost::CallFunc_GetResearchTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_Doctrines_Slot_Tooltip_C_RefreshCost, CallFunc_Conv_DoubleToText_ReturnValue) == 0x000008, "Member 'WBP_HUD_Doctrines_Slot_Tooltip_C_RefreshCost::CallFunc_Conv_DoubleToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_Doctrines_Slot_Tooltip_C_RefreshCost, CallFunc_GetResearchCostCredits_ReturnValue) == 0x000018, "Member 'WBP_HUD_Doctrines_Slot_Tooltip_C_RefreshCost::CallFunc_GetResearchCostCredits_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_Doctrines_Slot_Tooltip_C_RefreshCost, CallFunc_Conv_IntToText_ReturnValue) == 0x000020, "Member 'WBP_HUD_Doctrines_Slot_Tooltip_C_RefreshCost::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_Doctrines_Slot_Tooltip_C_RefreshCost, CallFunc_Conv_DoubleToText_Value_ImplicitCast) == 0x000030, "Member 'WBP_HUD_Doctrines_Slot_Tooltip_C_RefreshCost::CallFunc_Conv_DoubleToText_Value_ImplicitCast' has a wrong offset!");

// Function WBP_HUD_Doctrines_Slot_Tooltip.WBP_HUD_Doctrines_Slot_Tooltip_C.RefreshUI
// 0x0008 (0x0008 - 0x0000)
struct WBP_HUD_Doctrines_Slot_Tooltip_C_RefreshUI final
{
public:
	int32                                         CallFunc_GetContentSlotsCount_ReturnValue;         // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_Doctrines_Slot_Tooltip_C_RefreshUI) == 0x000004, "Wrong alignment on WBP_HUD_Doctrines_Slot_Tooltip_C_RefreshUI");
static_assert(sizeof(WBP_HUD_Doctrines_Slot_Tooltip_C_RefreshUI) == 0x000008, "Wrong size on WBP_HUD_Doctrines_Slot_Tooltip_C_RefreshUI");
static_assert(offsetof(WBP_HUD_Doctrines_Slot_Tooltip_C_RefreshUI, CallFunc_GetContentSlotsCount_ReturnValue) == 0x000000, "Member 'WBP_HUD_Doctrines_Slot_Tooltip_C_RefreshUI::CallFunc_GetContentSlotsCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_Doctrines_Slot_Tooltip_C_RefreshUI, CallFunc_Greater_IntInt_ReturnValue) == 0x000004, "Member 'WBP_HUD_Doctrines_Slot_Tooltip_C_RefreshUI::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

}

