#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_HintWorldWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Tempest_classes.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_HintWorldWidget.WBP_HintWorldWidget_C
// 0x0080 (0x04A8 - 0x0428)
class UWBP_HintWorldWidget_C final : public UTedWorldHintWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0428(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 BorderImage;                                       // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_0;                                          // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             DisplayText;                                       // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IconImage;                                         // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTexture2D*                             IconDefaultImage;                                  // 0x0450(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             IconHoverImage;                                    // 0x0458(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             IconPressedImage;                                  // 0x0460(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            IconPressedColor;                                  // 0x0468(0x0014)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateColor                            IconDefaultColor;                                  // 0x047C(0x0014)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateColor                            IconHoveredColor;                                  // 0x0490(0x0014)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void BndEvt__WBP_HintWorldWidget_Button_0_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_HintWorldWidget_Button_0_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_HintWorldWidget_Button_0_K2Node_ComponentBoundEvent_2_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__WBP_HintWorldWidget_Button_0_K2Node_ComponentBoundEvent_3_OnButtonReleasedEvent__DelegateSignature();
	void BndEvt__WBP_HintWorldWidget_Button_0_K2Node_ComponentBoundEvent_4_OnButtonHoverEvent__DelegateSignature();
	void ExecuteUbergraph_WBP_HintWorldWidget(int32 EntryPoint);
	struct FEventReply OnMouseButtonDown(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void SetDisplayedHintText(const class FText& NewText);
	void SetHintData(class UTedHintsAsset* HintData);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_HintWorldWidget_C">();
	}
	static class UWBP_HintWorldWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_HintWorldWidget_C>();
	}
};
static_assert(alignof(UWBP_HintWorldWidget_C) == 0x000008, "Wrong alignment on UWBP_HintWorldWidget_C");
static_assert(sizeof(UWBP_HintWorldWidget_C) == 0x0004A8, "Wrong size on UWBP_HintWorldWidget_C");
static_assert(offsetof(UWBP_HintWorldWidget_C, UberGraphFrame) == 0x000428, "Member 'UWBP_HintWorldWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_HintWorldWidget_C, BorderImage) == 0x000430, "Member 'UWBP_HintWorldWidget_C::BorderImage' has a wrong offset!");
static_assert(offsetof(UWBP_HintWorldWidget_C, Button_0) == 0x000438, "Member 'UWBP_HintWorldWidget_C::Button_0' has a wrong offset!");
static_assert(offsetof(UWBP_HintWorldWidget_C, DisplayText) == 0x000440, "Member 'UWBP_HintWorldWidget_C::DisplayText' has a wrong offset!");
static_assert(offsetof(UWBP_HintWorldWidget_C, IconImage) == 0x000448, "Member 'UWBP_HintWorldWidget_C::IconImage' has a wrong offset!");
static_assert(offsetof(UWBP_HintWorldWidget_C, IconDefaultImage) == 0x000450, "Member 'UWBP_HintWorldWidget_C::IconDefaultImage' has a wrong offset!");
static_assert(offsetof(UWBP_HintWorldWidget_C, IconHoverImage) == 0x000458, "Member 'UWBP_HintWorldWidget_C::IconHoverImage' has a wrong offset!");
static_assert(offsetof(UWBP_HintWorldWidget_C, IconPressedImage) == 0x000460, "Member 'UWBP_HintWorldWidget_C::IconPressedImage' has a wrong offset!");
static_assert(offsetof(UWBP_HintWorldWidget_C, IconPressedColor) == 0x000468, "Member 'UWBP_HintWorldWidget_C::IconPressedColor' has a wrong offset!");
static_assert(offsetof(UWBP_HintWorldWidget_C, IconDefaultColor) == 0x00047C, "Member 'UWBP_HintWorldWidget_C::IconDefaultColor' has a wrong offset!");
static_assert(offsetof(UWBP_HintWorldWidget_C, IconHoveredColor) == 0x000490, "Member 'UWBP_HintWorldWidget_C::IconHoveredColor' has a wrong offset!");

}

