#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PauseMenu_Slot

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Tempest_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_PauseMenu_Slot.WBP_PauseMenu_Slot_C.RefreshHorizontalFlip
// 0x00B0 (0x00B0 - 0x0000)
struct WBP_PauseMenu_Slot_C_RefreshHorizontalFlip final
{
public:
	struct FWidgetTransform                       LocalFlippedTransform;                             // 0x0000(0x0038)(Edit, BlueprintVisible, NoDestructor)
	struct FWidgetTransform                       LocalDefaultTransform;                             // 0x0038(0x0038)(Edit, BlueprintVisible, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FWidgetTransform                       K2Node_Select_Default;                             // 0x0078(0x0038)(NoDestructor)
};
static_assert(alignof(WBP_PauseMenu_Slot_C_RefreshHorizontalFlip) == 0x000008, "Wrong alignment on WBP_PauseMenu_Slot_C_RefreshHorizontalFlip");
static_assert(sizeof(WBP_PauseMenu_Slot_C_RefreshHorizontalFlip) == 0x0000B0, "Wrong size on WBP_PauseMenu_Slot_C_RefreshHorizontalFlip");
static_assert(offsetof(WBP_PauseMenu_Slot_C_RefreshHorizontalFlip, LocalFlippedTransform) == 0x000000, "Member 'WBP_PauseMenu_Slot_C_RefreshHorizontalFlip::LocalFlippedTransform' has a wrong offset!");
static_assert(offsetof(WBP_PauseMenu_Slot_C_RefreshHorizontalFlip, LocalDefaultTransform) == 0x000038, "Member 'WBP_PauseMenu_Slot_C_RefreshHorizontalFlip::LocalDefaultTransform' has a wrong offset!");
static_assert(offsetof(WBP_PauseMenu_Slot_C_RefreshHorizontalFlip, Temp_bool_Variable) == 0x000070, "Member 'WBP_PauseMenu_Slot_C_RefreshHorizontalFlip::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PauseMenu_Slot_C_RefreshHorizontalFlip, K2Node_Select_Default) == 0x000078, "Member 'WBP_PauseMenu_Slot_C_RefreshHorizontalFlip::K2Node_Select_Default' has a wrong offset!");

// Function WBP_PauseMenu_Slot.WBP_PauseMenu_Slot_C.RefreshDisabledVisuals
// 0x0058 (0x0058 - 0x0000)
struct WBP_PauseMenu_Slot_C_RefreshDisabledVisuals final
{
public:
	bool                                          bLocalEnabled;                                     // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           LocalEnabledColor;                                 // 0x0004(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           LocalDisabledColor;                                // 0x0014(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsStateActive_ReturnValue;                // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0027(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default;                             // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0038(0x0014)()
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     K2Node_Select_Default_1;                           // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PauseMenu_Slot_C_RefreshDisabledVisuals) == 0x000008, "Wrong alignment on WBP_PauseMenu_Slot_C_RefreshDisabledVisuals");
static_assert(sizeof(WBP_PauseMenu_Slot_C_RefreshDisabledVisuals) == 0x000058, "Wrong size on WBP_PauseMenu_Slot_C_RefreshDisabledVisuals");
static_assert(offsetof(WBP_PauseMenu_Slot_C_RefreshDisabledVisuals, bLocalEnabled) == 0x000000, "Member 'WBP_PauseMenu_Slot_C_RefreshDisabledVisuals::bLocalEnabled' has a wrong offset!");
static_assert(offsetof(WBP_PauseMenu_Slot_C_RefreshDisabledVisuals, LocalEnabledColor) == 0x000004, "Member 'WBP_PauseMenu_Slot_C_RefreshDisabledVisuals::LocalEnabledColor' has a wrong offset!");
static_assert(offsetof(WBP_PauseMenu_Slot_C_RefreshDisabledVisuals, LocalDisabledColor) == 0x000014, "Member 'WBP_PauseMenu_Slot_C_RefreshDisabledVisuals::LocalDisabledColor' has a wrong offset!");
static_assert(offsetof(WBP_PauseMenu_Slot_C_RefreshDisabledVisuals, Temp_bool_Variable) == 0x000024, "Member 'WBP_PauseMenu_Slot_C_RefreshDisabledVisuals::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PauseMenu_Slot_C_RefreshDisabledVisuals, Temp_bool_Variable_1) == 0x000025, "Member 'WBP_PauseMenu_Slot_C_RefreshDisabledVisuals::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_PauseMenu_Slot_C_RefreshDisabledVisuals, CallFunc_IsStateActive_ReturnValue) == 0x000026, "Member 'WBP_PauseMenu_Slot_C_RefreshDisabledVisuals::CallFunc_IsStateActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PauseMenu_Slot_C_RefreshDisabledVisuals, CallFunc_Not_PreBool_ReturnValue) == 0x000027, "Member 'WBP_PauseMenu_Slot_C_RefreshDisabledVisuals::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PauseMenu_Slot_C_RefreshDisabledVisuals, K2Node_Select_Default) == 0x000028, "Member 'WBP_PauseMenu_Slot_C_RefreshDisabledVisuals::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_PauseMenu_Slot_C_RefreshDisabledVisuals, K2Node_MakeStruct_SlateColor) == 0x000038, "Member 'WBP_PauseMenu_Slot_C_RefreshDisabledVisuals::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(WBP_PauseMenu_Slot_C_RefreshDisabledVisuals, K2Node_Select_Default_1) == 0x000050, "Member 'WBP_PauseMenu_Slot_C_RefreshDisabledVisuals::K2Node_Select_Default_1' has a wrong offset!");

// Function WBP_PauseMenu_Slot.WBP_PauseMenu_Slot_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_PauseMenu_Slot_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PauseMenu_Slot_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_PauseMenu_Slot_C_PreConstruct");
static_assert(sizeof(WBP_PauseMenu_Slot_C_PreConstruct) == 0x000001, "Wrong size on WBP_PauseMenu_Slot_C_PreConstruct");
static_assert(offsetof(WBP_PauseMenu_Slot_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_PauseMenu_Slot_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_PauseMenu_Slot.WBP_PauseMenu_Slot_C.OnActivateState
// 0x0002 (0x0002 - 0x0000)
struct WBP_PauseMenu_Slot_C_OnActivateState final
{
public:
	ETedContentSlotState                          InState;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bInActivated;                                      // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PauseMenu_Slot_C_OnActivateState) == 0x000001, "Wrong alignment on WBP_PauseMenu_Slot_C_OnActivateState");
static_assert(sizeof(WBP_PauseMenu_Slot_C_OnActivateState) == 0x000002, "Wrong size on WBP_PauseMenu_Slot_C_OnActivateState");
static_assert(offsetof(WBP_PauseMenu_Slot_C_OnActivateState, InState) == 0x000000, "Member 'WBP_PauseMenu_Slot_C_OnActivateState::InState' has a wrong offset!");
static_assert(offsetof(WBP_PauseMenu_Slot_C_OnActivateState, bInActivated) == 0x000001, "Member 'WBP_PauseMenu_Slot_C_OnActivateState::bInActivated' has a wrong offset!");

// Function WBP_PauseMenu_Slot.WBP_PauseMenu_Slot_C.ExecuteUbergraph_WBP_PauseMenu_Slot
// 0x0018 (0x0018 - 0x0000)
struct WBP_PauseMenu_Slot_C_ExecuteUbergraph_WBP_PauseMenu_Slot final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsStateActive_ReturnValue;                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UTedUserWidget*                         K2Node_ComponentBoundEvent_InWidget;               // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETedContentSlotState                          K2Node_Event_InState;                              // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInActivated;                         // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PauseMenu_Slot_C_ExecuteUbergraph_WBP_PauseMenu_Slot) == 0x000008, "Wrong alignment on WBP_PauseMenu_Slot_C_ExecuteUbergraph_WBP_PauseMenu_Slot");
static_assert(sizeof(WBP_PauseMenu_Slot_C_ExecuteUbergraph_WBP_PauseMenu_Slot) == 0x000018, "Wrong size on WBP_PauseMenu_Slot_C_ExecuteUbergraph_WBP_PauseMenu_Slot");
static_assert(offsetof(WBP_PauseMenu_Slot_C_ExecuteUbergraph_WBP_PauseMenu_Slot, EntryPoint) == 0x000000, "Member 'WBP_PauseMenu_Slot_C_ExecuteUbergraph_WBP_PauseMenu_Slot::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_PauseMenu_Slot_C_ExecuteUbergraph_WBP_PauseMenu_Slot, CallFunc_IsStateActive_ReturnValue) == 0x000004, "Member 'WBP_PauseMenu_Slot_C_ExecuteUbergraph_WBP_PauseMenu_Slot::CallFunc_IsStateActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PauseMenu_Slot_C_ExecuteUbergraph_WBP_PauseMenu_Slot, K2Node_Event_IsDesignTime) == 0x000005, "Member 'WBP_PauseMenu_Slot_C_ExecuteUbergraph_WBP_PauseMenu_Slot::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_PauseMenu_Slot_C_ExecuteUbergraph_WBP_PauseMenu_Slot, K2Node_ComponentBoundEvent_InWidget) == 0x000008, "Member 'WBP_PauseMenu_Slot_C_ExecuteUbergraph_WBP_PauseMenu_Slot::K2Node_ComponentBoundEvent_InWidget' has a wrong offset!");
static_assert(offsetof(WBP_PauseMenu_Slot_C_ExecuteUbergraph_WBP_PauseMenu_Slot, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'WBP_PauseMenu_Slot_C_ExecuteUbergraph_WBP_PauseMenu_Slot::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PauseMenu_Slot_C_ExecuteUbergraph_WBP_PauseMenu_Slot, CallFunc_IsValid_ReturnValue_1) == 0x000011, "Member 'WBP_PauseMenu_Slot_C_ExecuteUbergraph_WBP_PauseMenu_Slot::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PauseMenu_Slot_C_ExecuteUbergraph_WBP_PauseMenu_Slot, K2Node_Event_InState) == 0x000012, "Member 'WBP_PauseMenu_Slot_C_ExecuteUbergraph_WBP_PauseMenu_Slot::K2Node_Event_InState' has a wrong offset!");
static_assert(offsetof(WBP_PauseMenu_Slot_C_ExecuteUbergraph_WBP_PauseMenu_Slot, K2Node_Event_bInActivated) == 0x000013, "Member 'WBP_PauseMenu_Slot_C_ExecuteUbergraph_WBP_PauseMenu_Slot::K2Node_Event_bInActivated' has a wrong offset!");
static_assert(offsetof(WBP_PauseMenu_Slot_C_ExecuteUbergraph_WBP_PauseMenu_Slot, K2Node_SwitchEnum_CmpSuccess) == 0x000014, "Member 'WBP_PauseMenu_Slot_C_ExecuteUbergraph_WBP_PauseMenu_Slot::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function WBP_PauseMenu_Slot.WBP_PauseMenu_Slot_C.DisableButton
// 0x0014 (0x0014 - 0x0000)
struct WBP_PauseMenu_Slot_C_DisableButton final
{
public:
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0000(0x0014)()
};
static_assert(alignof(WBP_PauseMenu_Slot_C_DisableButton) == 0x000004, "Wrong alignment on WBP_PauseMenu_Slot_C_DisableButton");
static_assert(sizeof(WBP_PauseMenu_Slot_C_DisableButton) == 0x000014, "Wrong size on WBP_PauseMenu_Slot_C_DisableButton");
static_assert(offsetof(WBP_PauseMenu_Slot_C_DisableButton, K2Node_MakeStruct_SlateColor) == 0x000000, "Member 'WBP_PauseMenu_Slot_C_DisableButton::K2Node_MakeStruct_SlateColor' has a wrong offset!");

// Function WBP_PauseMenu_Slot.WBP_PauseMenu_Slot_C.BndEvt__WBP_GameMenu_Slot_Button_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_PauseMenu_Slot_C_BndEvt__WBP_GameMenu_Slot_Button_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature final
{
public:
	class UTedUserWidget*                         InWidget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PauseMenu_Slot_C_BndEvt__WBP_GameMenu_Slot_Button_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_PauseMenu_Slot_C_BndEvt__WBP_GameMenu_Slot_Button_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature");
static_assert(sizeof(WBP_PauseMenu_Slot_C_BndEvt__WBP_GameMenu_Slot_Button_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_PauseMenu_Slot_C_BndEvt__WBP_GameMenu_Slot_Button_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature");
static_assert(offsetof(WBP_PauseMenu_Slot_C_BndEvt__WBP_GameMenu_Slot_Button_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature, InWidget) == 0x000000, "Member 'WBP_PauseMenu_Slot_C_BndEvt__WBP_GameMenu_Slot_Button_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature::InWidget' has a wrong offset!");

}

