#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_HUD_SelectionGroups_Slot

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Tempest_structs.hpp"


namespace SDK::Params
{

// Function WBP_HUD_SelectionGroups_Slot.WBP_HUD_SelectionGroups_Slot_C.ExecuteUbergraph_WBP_HUD_SelectionGroups_Slot
// 0x0030 (0x0030 - 0x0000)
struct WBP_HUD_SelectionGroups_Slot_C_ExecuteUbergraph_WBP_HUD_SelectionGroups_Slot final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSlotIndex_ReturnValue;                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETedContentSlotAction                         K2Node_Event_InAction;                             // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0018(0x0010)()
	ETedContentSlotState                          K2Node_Event_InState;                              // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInActivated;                         // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_SelectionGroups_Slot_C_ExecuteUbergraph_WBP_HUD_SelectionGroups_Slot) == 0x000008, "Wrong alignment on WBP_HUD_SelectionGroups_Slot_C_ExecuteUbergraph_WBP_HUD_SelectionGroups_Slot");
static_assert(sizeof(WBP_HUD_SelectionGroups_Slot_C_ExecuteUbergraph_WBP_HUD_SelectionGroups_Slot) == 0x000030, "Wrong size on WBP_HUD_SelectionGroups_Slot_C_ExecuteUbergraph_WBP_HUD_SelectionGroups_Slot");
static_assert(offsetof(WBP_HUD_SelectionGroups_Slot_C_ExecuteUbergraph_WBP_HUD_SelectionGroups_Slot, EntryPoint) == 0x000000, "Member 'WBP_HUD_SelectionGroups_Slot_C_ExecuteUbergraph_WBP_HUD_SelectionGroups_Slot::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SelectionGroups_Slot_C_ExecuteUbergraph_WBP_HUD_SelectionGroups_Slot, CallFunc_GetSlotIndex_ReturnValue) == 0x000004, "Member 'WBP_HUD_SelectionGroups_Slot_C_ExecuteUbergraph_WBP_HUD_SelectionGroups_Slot::CallFunc_GetSlotIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SelectionGroups_Slot_C_ExecuteUbergraph_WBP_HUD_SelectionGroups_Slot, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'WBP_HUD_SelectionGroups_Slot_C_ExecuteUbergraph_WBP_HUD_SelectionGroups_Slot::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SelectionGroups_Slot_C_ExecuteUbergraph_WBP_HUD_SelectionGroups_Slot, K2Node_Event_InAction) == 0x00000C, "Member 'WBP_HUD_SelectionGroups_Slot_C_ExecuteUbergraph_WBP_HUD_SelectionGroups_Slot::K2Node_Event_InAction' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SelectionGroups_Slot_C_ExecuteUbergraph_WBP_HUD_SelectionGroups_Slot, CallFunc_Percent_IntInt_ReturnValue) == 0x000010, "Member 'WBP_HUD_SelectionGroups_Slot_C_ExecuteUbergraph_WBP_HUD_SelectionGroups_Slot::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SelectionGroups_Slot_C_ExecuteUbergraph_WBP_HUD_SelectionGroups_Slot, K2Node_SwitchEnum_CmpSuccess) == 0x000014, "Member 'WBP_HUD_SelectionGroups_Slot_C_ExecuteUbergraph_WBP_HUD_SelectionGroups_Slot::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SelectionGroups_Slot_C_ExecuteUbergraph_WBP_HUD_SelectionGroups_Slot, CallFunc_Conv_IntToText_ReturnValue) == 0x000018, "Member 'WBP_HUD_SelectionGroups_Slot_C_ExecuteUbergraph_WBP_HUD_SelectionGroups_Slot::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SelectionGroups_Slot_C_ExecuteUbergraph_WBP_HUD_SelectionGroups_Slot, K2Node_Event_InState) == 0x000028, "Member 'WBP_HUD_SelectionGroups_Slot_C_ExecuteUbergraph_WBP_HUD_SelectionGroups_Slot::K2Node_Event_InState' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SelectionGroups_Slot_C_ExecuteUbergraph_WBP_HUD_SelectionGroups_Slot, K2Node_Event_bInActivated) == 0x000029, "Member 'WBP_HUD_SelectionGroups_Slot_C_ExecuteUbergraph_WBP_HUD_SelectionGroups_Slot::K2Node_Event_bInActivated' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SelectionGroups_Slot_C_ExecuteUbergraph_WBP_HUD_SelectionGroups_Slot, K2Node_SwitchEnum_CmpSuccess_1) == 0x00002A, "Member 'WBP_HUD_SelectionGroups_Slot_C_ExecuteUbergraph_WBP_HUD_SelectionGroups_Slot::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");

// Function WBP_HUD_SelectionGroups_Slot.WBP_HUD_SelectionGroups_Slot_C.FocusCameraOnGroup
// 0x0020 (0x0020 - 0x0000)
struct WBP_HUD_SelectionGroups_Slot_C_FocusCameraOnGroup final
{
public:
	int32                                         CallFunc_GetSlotIndex_ReturnValue;                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTedContentPanelBase*                   CallFunc_GetParentContentPanel_ReturnValue;        // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UTedSelectionGroupPanel*                K2Node_DynamicCast_AsTed_Selection_Group_Panel;    // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_SelectionGroups_Slot_C_FocusCameraOnGroup) == 0x000008, "Wrong alignment on WBP_HUD_SelectionGroups_Slot_C_FocusCameraOnGroup");
static_assert(sizeof(WBP_HUD_SelectionGroups_Slot_C_FocusCameraOnGroup) == 0x000020, "Wrong size on WBP_HUD_SelectionGroups_Slot_C_FocusCameraOnGroup");
static_assert(offsetof(WBP_HUD_SelectionGroups_Slot_C_FocusCameraOnGroup, CallFunc_GetSlotIndex_ReturnValue) == 0x000000, "Member 'WBP_HUD_SelectionGroups_Slot_C_FocusCameraOnGroup::CallFunc_GetSlotIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SelectionGroups_Slot_C_FocusCameraOnGroup, CallFunc_GetParentContentPanel_ReturnValue) == 0x000008, "Member 'WBP_HUD_SelectionGroups_Slot_C_FocusCameraOnGroup::CallFunc_GetParentContentPanel_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SelectionGroups_Slot_C_FocusCameraOnGroup, K2Node_DynamicCast_AsTed_Selection_Group_Panel) == 0x000010, "Member 'WBP_HUD_SelectionGroups_Slot_C_FocusCameraOnGroup::K2Node_DynamicCast_AsTed_Selection_Group_Panel' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SelectionGroups_Slot_C_FocusCameraOnGroup, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WBP_HUD_SelectionGroups_Slot_C_FocusCameraOnGroup::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WBP_HUD_SelectionGroups_Slot.WBP_HUD_SelectionGroups_Slot_C.OnActivateState
// 0x0002 (0x0002 - 0x0000)
struct WBP_HUD_SelectionGroups_Slot_C_OnActivateState final
{
public:
	ETedContentSlotState                          InState;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bInActivated;                                      // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_SelectionGroups_Slot_C_OnActivateState) == 0x000001, "Wrong alignment on WBP_HUD_SelectionGroups_Slot_C_OnActivateState");
static_assert(sizeof(WBP_HUD_SelectionGroups_Slot_C_OnActivateState) == 0x000002, "Wrong size on WBP_HUD_SelectionGroups_Slot_C_OnActivateState");
static_assert(offsetof(WBP_HUD_SelectionGroups_Slot_C_OnActivateState, InState) == 0x000000, "Member 'WBP_HUD_SelectionGroups_Slot_C_OnActivateState::InState' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SelectionGroups_Slot_C_OnActivateState, bInActivated) == 0x000001, "Member 'WBP_HUD_SelectionGroups_Slot_C_OnActivateState::bInActivated' has a wrong offset!");

// Function WBP_HUD_SelectionGroups_Slot.WBP_HUD_SelectionGroups_Slot_C.OnTriggerAction
// 0x0001 (0x0001 - 0x0000)
struct WBP_HUD_SelectionGroups_Slot_C_OnTriggerAction final
{
public:
	ETedContentSlotAction                         InAction;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_SelectionGroups_Slot_C_OnTriggerAction) == 0x000001, "Wrong alignment on WBP_HUD_SelectionGroups_Slot_C_OnTriggerAction");
static_assert(sizeof(WBP_HUD_SelectionGroups_Slot_C_OnTriggerAction) == 0x000001, "Wrong size on WBP_HUD_SelectionGroups_Slot_C_OnTriggerAction");
static_assert(offsetof(WBP_HUD_SelectionGroups_Slot_C_OnTriggerAction, InAction) == 0x000000, "Member 'WBP_HUD_SelectionGroups_Slot_C_OnTriggerAction::InAction' has a wrong offset!");

// Function WBP_HUD_SelectionGroups_Slot.WBP_HUD_SelectionGroups_Slot_C.UpdateHoverEffectVisibility
// 0x0005 (0x0005 - 0x0000)
struct WBP_HUD_SelectionGroups_Slot_C_UpdateHoverEffectVisibility final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsStateActive_ReturnValue;                // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_SelectionGroups_Slot_C_UpdateHoverEffectVisibility) == 0x000001, "Wrong alignment on WBP_HUD_SelectionGroups_Slot_C_UpdateHoverEffectVisibility");
static_assert(sizeof(WBP_HUD_SelectionGroups_Slot_C_UpdateHoverEffectVisibility) == 0x000005, "Wrong size on WBP_HUD_SelectionGroups_Slot_C_UpdateHoverEffectVisibility");
static_assert(offsetof(WBP_HUD_SelectionGroups_Slot_C_UpdateHoverEffectVisibility, Temp_bool_Variable) == 0x000000, "Member 'WBP_HUD_SelectionGroups_Slot_C_UpdateHoverEffectVisibility::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SelectionGroups_Slot_C_UpdateHoverEffectVisibility, Temp_byte_Variable) == 0x000001, "Member 'WBP_HUD_SelectionGroups_Slot_C_UpdateHoverEffectVisibility::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SelectionGroups_Slot_C_UpdateHoverEffectVisibility, Temp_byte_Variable_1) == 0x000002, "Member 'WBP_HUD_SelectionGroups_Slot_C_UpdateHoverEffectVisibility::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SelectionGroups_Slot_C_UpdateHoverEffectVisibility, CallFunc_IsStateActive_ReturnValue) == 0x000003, "Member 'WBP_HUD_SelectionGroups_Slot_C_UpdateHoverEffectVisibility::CallFunc_IsStateActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SelectionGroups_Slot_C_UpdateHoverEffectVisibility, K2Node_Select_Default) == 0x000004, "Member 'WBP_HUD_SelectionGroups_Slot_C_UpdateHoverEffectVisibility::K2Node_Select_Default' has a wrong offset!");

// Function WBP_HUD_SelectionGroups_Slot.WBP_HUD_SelectionGroups_Slot_C.UpdateSize
// 0x0028 (0x0028 - 0x0000)
struct WBP_HUD_SelectionGroups_Slot_C_UpdateSize final
{
public:
	int32                                         InSize;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Clamp_ReturnValue;                        // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0010(0x0010)()
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_SelectionGroups_Slot_C_UpdateSize) == 0x000008, "Wrong alignment on WBP_HUD_SelectionGroups_Slot_C_UpdateSize");
static_assert(sizeof(WBP_HUD_SelectionGroups_Slot_C_UpdateSize) == 0x000028, "Wrong size on WBP_HUD_SelectionGroups_Slot_C_UpdateSize");
static_assert(offsetof(WBP_HUD_SelectionGroups_Slot_C_UpdateSize, InSize) == 0x000000, "Member 'WBP_HUD_SelectionGroups_Slot_C_UpdateSize::InSize' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SelectionGroups_Slot_C_UpdateSize, Temp_bool_Variable) == 0x000004, "Member 'WBP_HUD_SelectionGroups_Slot_C_UpdateSize::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SelectionGroups_Slot_C_UpdateSize, CallFunc_Clamp_ReturnValue) == 0x000008, "Member 'WBP_HUD_SelectionGroups_Slot_C_UpdateSize::CallFunc_Clamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SelectionGroups_Slot_C_UpdateSize, Temp_byte_Variable) == 0x00000C, "Member 'WBP_HUD_SelectionGroups_Slot_C_UpdateSize::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SelectionGroups_Slot_C_UpdateSize, CallFunc_Conv_IntToText_ReturnValue) == 0x000010, "Member 'WBP_HUD_SelectionGroups_Slot_C_UpdateSize::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SelectionGroups_Slot_C_UpdateSize, CallFunc_Greater_IntInt_ReturnValue) == 0x000020, "Member 'WBP_HUD_SelectionGroups_Slot_C_UpdateSize::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SelectionGroups_Slot_C_UpdateSize, Temp_byte_Variable_1) == 0x000021, "Member 'WBP_HUD_SelectionGroups_Slot_C_UpdateSize::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SelectionGroups_Slot_C_UpdateSize, CallFunc_BooleanAND_ReturnValue) == 0x000022, "Member 'WBP_HUD_SelectionGroups_Slot_C_UpdateSize::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SelectionGroups_Slot_C_UpdateSize, K2Node_Select_Default) == 0x000023, "Member 'WBP_HUD_SelectionGroups_Slot_C_UpdateSize::K2Node_Select_Default' has a wrong offset!");

// Function WBP_HUD_SelectionGroups_Slot.WBP_HUD_SelectionGroups_Slot_C.UpdateTextColor
// 0x0030 (0x0030 - 0x0000)
struct WBP_HUD_SelectionGroups_Slot_C_UpdateTextColor final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable;                                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1;                              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsStateActive_ReturnValue;                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_Select_Default;                             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetRenderOpacity_InOpacity_ImplicitCast;  // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_SelectionGroups_Slot_C_UpdateTextColor) == 0x000008, "Wrong alignment on WBP_HUD_SelectionGroups_Slot_C_UpdateTextColor");
static_assert(sizeof(WBP_HUD_SelectionGroups_Slot_C_UpdateTextColor) == 0x000030, "Wrong size on WBP_HUD_SelectionGroups_Slot_C_UpdateTextColor");
static_assert(offsetof(WBP_HUD_SelectionGroups_Slot_C_UpdateTextColor, Temp_bool_Variable) == 0x000000, "Member 'WBP_HUD_SelectionGroups_Slot_C_UpdateTextColor::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SelectionGroups_Slot_C_UpdateTextColor, Temp_real_Variable) == 0x000008, "Member 'WBP_HUD_SelectionGroups_Slot_C_UpdateTextColor::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SelectionGroups_Slot_C_UpdateTextColor, Temp_real_Variable_1) == 0x000010, "Member 'WBP_HUD_SelectionGroups_Slot_C_UpdateTextColor::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SelectionGroups_Slot_C_UpdateTextColor, CallFunc_IsStateActive_ReturnValue) == 0x000018, "Member 'WBP_HUD_SelectionGroups_Slot_C_UpdateTextColor::CallFunc_IsStateActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SelectionGroups_Slot_C_UpdateTextColor, K2Node_Select_Default) == 0x000020, "Member 'WBP_HUD_SelectionGroups_Slot_C_UpdateTextColor::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SelectionGroups_Slot_C_UpdateTextColor, CallFunc_SetRenderOpacity_InOpacity_ImplicitCast) == 0x000028, "Member 'WBP_HUD_SelectionGroups_Slot_C_UpdateTextColor::CallFunc_SetRenderOpacity_InOpacity_ImplicitCast' has a wrong offset!");

// Function WBP_HUD_SelectionGroups_Slot.WBP_HUD_SelectionGroups_Slot_C.GetMaterialsSupportingStates
// 0x0028 (0x0028 - 0x0000)
struct WBP_HUD_SelectionGroups_Slot_C_GetMaterialsSupportingStates final
{
public:
	TArray<class UMaterialInstanceDynamic*>       OutMIDs;                                           // 0x0000(0x0010)(Parm, OutParm)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UMaterialInstanceDynamic*>       K2Node_MakeArray_Array;                            // 0x0018(0x0010)(ReferenceParm)
};
static_assert(alignof(WBP_HUD_SelectionGroups_Slot_C_GetMaterialsSupportingStates) == 0x000008, "Wrong alignment on WBP_HUD_SelectionGroups_Slot_C_GetMaterialsSupportingStates");
static_assert(sizeof(WBP_HUD_SelectionGroups_Slot_C_GetMaterialsSupportingStates) == 0x000028, "Wrong size on WBP_HUD_SelectionGroups_Slot_C_GetMaterialsSupportingStates");
static_assert(offsetof(WBP_HUD_SelectionGroups_Slot_C_GetMaterialsSupportingStates, OutMIDs) == 0x000000, "Member 'WBP_HUD_SelectionGroups_Slot_C_GetMaterialsSupportingStates::OutMIDs' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SelectionGroups_Slot_C_GetMaterialsSupportingStates, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000010, "Member 'WBP_HUD_SelectionGroups_Slot_C_GetMaterialsSupportingStates::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SelectionGroups_Slot_C_GetMaterialsSupportingStates, K2Node_MakeArray_Array) == 0x000018, "Member 'WBP_HUD_SelectionGroups_Slot_C_GetMaterialsSupportingStates::K2Node_MakeArray_Array' has a wrong offset!");

}

