#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Noah_V2_PostProcess

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "KawaiiPhysics_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "ABP_Noah_V2_PostProcess_structs.hpp"
#include "ControlRig_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_Noah_V2_PostProcess.ABP_Noah_V2_PostProcess_C
// 0xFAF0 (0xFE60 - 0x0370)
class UABP_Noah_V2_PostProcess_C final : public UAnimInstance
{
public:
	uint8                                         Pad_368[0x8];                                      // 0x0368(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0370(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct ABP_Noah_V2_PostProcess::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;      // 0x0378(0x0002)(HasGetValueTypeHash)
	uint8                                         Pad_37A[0x6];                                      // 0x037A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0380(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0388(0x0008)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x0390(0x00B8)()
	uint8                                         Pad_448[0x8];                                      // 0x0448(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_12;                    // 0x0450(0x07A0)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_1;             // 0x0BF0(0x0020)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_11;                    // 0x0C10(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_10;                    // 0x13B0(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_9;                     // 0x1B50(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_8;                     // 0x22F0(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_7;                     // 0x2A90(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_6;                     // 0x3230(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_5;                     // 0x39D0(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_4;                     // 0x4170(0x07A0)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_13;                     // 0x4910(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_12;                     // 0x4E30(0x0520)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x5350(0x0028)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x5378(0x0020)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_1;                    // 0x5398(0x0080)()
	uint8                                         Pad_5418[0x8];                                     // 0x5418(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_3;                     // 0x5420(0x07A0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x5BC0(0x0048)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig;                          // 0x5C08(0x04D0)(ContainsInstancedReference)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_1;             // 0x60D8(0x0020)()
	uint8                                         Pad_60F8[0x8];                                     // 0x60F8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_2;                     // 0x6100(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_1;                     // 0x68A0(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics;                       // 0x7040(0x07A0)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x77E0(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x7800(0x0020)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_11;                     // 0x7820(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_10;                     // 0x7D40(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_9;                      // 0x8260(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_8;                      // 0x8780(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_7;                      // 0x8CA0(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_6;                      // 0x91C0(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_5;                      // 0x96E0(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_4;                      // 0x9C00(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_3;                      // 0xA120(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_2;                      // 0xA640(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_1;                      // 0xAB60(0x0520)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0xB080(0x0028)()
	uint8                                         Pad_B0A8[0x8];                                     // 0xB0A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics;                        // 0xB0B0(0x0520)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_43;                       // 0xB5D0(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_42;                       // 0xB770(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_41;                       // 0xB910(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_40;                       // 0xBAB0(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_39;                       // 0xBC50(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_38;                       // 0xBDF0(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_37;                       // 0xBF90(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_36;                       // 0xC130(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_35;                       // 0xC2D0(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_34;                       // 0xC470(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_33;                       // 0xC610(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_32;                       // 0xC7B0(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_31;                       // 0xC950(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_30;                       // 0xCAF0(0x01A0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0xCC90(0x0080)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_29;                       // 0xCD10(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_28;                       // 0xCEB0(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_27;                       // 0xD050(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_26;                       // 0xD1F0(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_25;                       // 0xD390(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_24;                       // 0xD530(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_23;                       // 0xD6D0(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_22;                       // 0xD870(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_21;                       // 0xDA10(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_20;                       // 0xDBB0(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_19;                       // 0xDD50(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_18;                       // 0xDEF0(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_17;                       // 0xE090(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_16;                       // 0xE230(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_15;                       // 0xE3D0(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_14;                       // 0xE570(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_13;                       // 0xE710(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_12;                       // 0xE8B0(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_11;                       // 0xEA50(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_10;                       // 0xEBF0(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_9;                        // 0xED90(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_8;                        // 0xEF30(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_7;                        // 0xF0D0(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_6;                        // 0xF270(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_5;                        // 0xF410(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_4;                        // 0xF5B0(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_3;                        // 0xF750(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_2;                        // 0xF8F0(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_1;                        // 0xFA90(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver;                          // 0xFC30(0x01A0)()
	struct FKawaiiPhysicsSettings                 Physics_Settings_Coat;                             // 0xFDD0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FVector                                External_Force;                                    // 0xFDE8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CoatShouldGoGup;                                   // 0xFE00(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FE01[0x7];                                     // 0xFE01(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        FallingVelocity;                                   // 0xFE08(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Pelvis;                                            // 0xFE10(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsCharacter;                                       // 0xFE18(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FE19[0x7];                                     // 0xFE19(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  PawnOwner;                                         // 0xFE20(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CharacterMesh;                                     // 0xFE28(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	struct FRotator                               PreviousRotator;                                   // 0xFE30(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	double                                        RotationVelocity;                                  // 0xFE48(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CoatTurnVelocityThreshold;                         // 0xFE50(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShouldDisablePostProcess;                          // 0xFE58(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(const struct FPoseLink& InPose, struct FPoseLink* AnimGraph_0);
	void BlueprintInitializeAnimation();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void ExecuteUbergraph_ABP_Noah_V2_PostProcess(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_Noah_V2_PostProcess_C">();
	}
	static class UABP_Noah_V2_PostProcess_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_Noah_V2_PostProcess_C>();
	}
};
static_assert(alignof(UABP_Noah_V2_PostProcess_C) == 0x000010, "Wrong alignment on UABP_Noah_V2_PostProcess_C");
static_assert(sizeof(UABP_Noah_V2_PostProcess_C) == 0x00FE60, "Wrong size on UABP_Noah_V2_PostProcess_C");
static_assert(offsetof(UABP_Noah_V2_PostProcess_C, UberGraphFrame) == 0x000370, "Member 'UABP_Noah_V2_PostProcess_C::UberGraphFrame' has a wrong offset!");
