#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Quinn_PostProcess

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "ControlRig_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_Quinn_PostProcess.ABP_Quinn_PostProcess_C
// 0x1C80 (0x1FF0 - 0x0370)
class UABP_Quinn_PostProcess_C final : public UAnimInstance
{
public:
	uint8                                         Pad_368[0x8];                                      // 0x0368(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0370(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0378(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0380(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0388(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x03A8(0x00B8)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig;                          // 0x0460(0x04D0)(ContainsInstancedReference)
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_13;                       // 0x0930(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_12;                       // 0x0AD0(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_11;                       // 0x0C70(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_10;                       // 0x0E10(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_9;                        // 0x0FB0(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_8;                        // 0x1150(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_7;                        // 0x12F0(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_6;                        // 0x1490(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_5;                        // 0x1630(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_4;                        // 0x17D0(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_3;                        // 0x1970(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_2;                        // 0x1B10(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_1;                        // 0x1CB0(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver;                          // 0x1E50(0x01A0)()

public:
	void AnimGraph(const struct FPoseLink& InPose, struct FPoseLink* AnimGraph_0);
	void ExecuteUbergraph_ABP_Quinn_PostProcess(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_Quinn_PostProcess_C">();
	}
	static class UABP_Quinn_PostProcess_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_Quinn_PostProcess_C>();
	}
};
static_assert(alignof(UABP_Quinn_PostProcess_C) == 0x000010, "Wrong alignment on UABP_Quinn_PostProcess_C");
static_assert(sizeof(UABP_Quinn_PostProcess_C) == 0x001FF0, "Wrong size on UABP_Quinn_PostProcess_C");
static_assert(offsetof(UABP_Quinn_PostProcess_C, UberGraphFrame) == 0x000370, "Member 'UABP_Quinn_PostProcess_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_Quinn_PostProcess_C, AnimBlueprintExtension_PropertyAccess) == 0x000378, "Member 'UABP_Quinn_PostProcess_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UABP_Quinn_PostProcess_C, AnimBlueprintExtension_Base) == 0x000380, "Member 'UABP_Quinn_PostProcess_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UABP_Quinn_PostProcess_C, AnimGraphNode_Root) == 0x000388, "Member 'UABP_Quinn_PostProcess_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_Quinn_PostProcess_C, AnimGraphNode_LinkedInputPose) == 0x0003A8, "Member 'UABP_Quinn_PostProcess_C::AnimGraphNode_LinkedInputPose' has a wrong offset!");
static_assert(offsetof(UABP_Quinn_PostProcess_C, AnimGraphNode_ControlRig) == 0x000460, "Member 'UABP_Quinn_PostProcess_C::AnimGraphNode_ControlRig' has a wrong offset!");
static_assert(offsetof(UABP_Quinn_PostProcess_C, AnimGraphNode_PoseDriver_13) == 0x000930, "Member 'UABP_Quinn_PostProcess_C::AnimGraphNode_PoseDriver_13' has a wrong offset!");
static_assert(offsetof(UABP_Quinn_PostProcess_C, AnimGraphNode_PoseDriver_12) == 0x000AD0, "Member 'UABP_Quinn_PostProcess_C::AnimGraphNode_PoseDriver_12' has a wrong offset!");
static_assert(offsetof(UABP_Quinn_PostProcess_C, AnimGraphNode_PoseDriver_11) == 0x000C70, "Member 'UABP_Quinn_PostProcess_C::AnimGraphNode_PoseDriver_11' has a wrong offset!");
static_assert(offsetof(UABP_Quinn_PostProcess_C, AnimGraphNode_PoseDriver_10) == 0x000E10, "Member 'UABP_Quinn_PostProcess_C::AnimGraphNode_PoseDriver_10' has a wrong offset!");
static_assert(offsetof(UABP_Quinn_PostProcess_C, AnimGraphNode_PoseDriver_9) == 0x000FB0, "Member 'UABP_Quinn_PostProcess_C::AnimGraphNode_PoseDriver_9' has a wrong offset!");
static_assert(offsetof(UABP_Quinn_PostProcess_C, AnimGraphNode_PoseDriver_8) == 0x001150, "Member 'UABP_Quinn_PostProcess_C::AnimGraphNode_PoseDriver_8' has a wrong offset!");
static_assert(offsetof(UABP_Quinn_PostProcess_C, AnimGraphNode_PoseDriver_7) == 0x0012F0, "Member 'UABP_Quinn_PostProcess_C::AnimGraphNode_PoseDriver_7' has a wrong offset!");
static_assert(offsetof(UABP_Quinn_PostProcess_C, AnimGraphNode_PoseDriver_6) == 0x001490, "Member 'UABP_Quinn_PostProcess_C::AnimGraphNode_PoseDriver_6' has a wrong offset!");
static_assert(offsetof(UABP_Quinn_PostProcess_C, AnimGraphNode_PoseDriver_5) == 0x001630, "Member 'UABP_Quinn_PostProcess_C::AnimGraphNode_PoseDriver_5' has a wrong offset!");
static_assert(offsetof(UABP_Quinn_PostProcess_C, AnimGraphNode_PoseDriver_4) == 0x0017D0, "Member 'UABP_Quinn_PostProcess_C::AnimGraphNode_PoseDriver_4' has a wrong offset!");
static_assert(offsetof(UABP_Quinn_PostProcess_C, AnimGraphNode_PoseDriver_3) == 0x001970, "Member 'UABP_Quinn_PostProcess_C::AnimGraphNode_PoseDriver_3' has a wrong offset!");
static_assert(offsetof(UABP_Quinn_PostProcess_C, AnimGraphNode_PoseDriver_2) == 0x001B10, "Member 'UABP_Quinn_PostProcess_C::AnimGraphNode_PoseDriver_2' has a wrong offset!");
static_assert(offsetof(UABP_Quinn_PostProcess_C, AnimGraphNode_PoseDriver_1) == 0x001CB0, "Member 'UABP_Quinn_PostProcess_C::AnimGraphNode_PoseDriver_1' has a wrong offset!");
static_assert(offsetof(UABP_Quinn_PostProcess_C, AnimGraphNode_PoseDriver) == 0x001E50, "Member 'UABP_Quinn_PostProcess_C::AnimGraphNode_PoseDriver' has a wrong offset!");

}

