#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Facial_Cine_Main

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function ABP_Facial_Cine_Main.ABP_Facial_Cine_Main_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct ABP_Facial_Cine_Main_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_Facial_Cine_Main_C_AnimGraph) == 0x000008, "Wrong alignment on ABP_Facial_Cine_Main_C_AnimGraph");
static_assert(sizeof(ABP_Facial_Cine_Main_C_AnimGraph) == 0x000010, "Wrong size on ABP_Facial_Cine_Main_C_AnimGraph");
static_assert(offsetof(ABP_Facial_Cine_Main_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'ABP_Facial_Cine_Main_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function ABP_Facial_Cine_Main.ABP_Facial_Cine_Main_C.ExecuteUbergraph_ABP_Facial_Cine_Main
// 0x00B0 (0x00B0 - 0x0000)
struct ABP_Facial_Cine_Main_C_ExecuteUbergraph_ABP_Facial_Cine_Main final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_MapRangeClamped_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSlotActive_ReturnValue;                 // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FQuat                                  CallFunc_Conv_RotatorToQuaternion_ReturnValue;     // 0x0030(0x0020)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Abs_ReturnValue;                          // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Abs_ReturnValue_1;                        // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_Value_ImplicitCast;       // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast; // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_StructMemberSet_Alpha_ImplicitCast;         // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Yaw_ImplicitCast;             // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Roll_ImplicitCast;            // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast;         // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Abs_A_ImplicitCast;                       // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_StructMemberSet_Alpha_ImplicitCast_1;       // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Abs_A_ImplicitCast_1;                     // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_StructMemberSet_Alpha_ImplicitCast_2;       // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_Facial_Cine_Main_C_ExecuteUbergraph_ABP_Facial_Cine_Main) == 0x000010, "Wrong alignment on ABP_Facial_Cine_Main_C_ExecuteUbergraph_ABP_Facial_Cine_Main");
static_assert(sizeof(ABP_Facial_Cine_Main_C_ExecuteUbergraph_ABP_Facial_Cine_Main) == 0x0000B0, "Wrong size on ABP_Facial_Cine_Main_C_ExecuteUbergraph_ABP_Facial_Cine_Main");
static_assert(offsetof(ABP_Facial_Cine_Main_C_ExecuteUbergraph_ABP_Facial_Cine_Main, EntryPoint) == 0x000000, "Member 'ABP_Facial_Cine_Main_C_ExecuteUbergraph_ABP_Facial_Cine_Main::EntryPoint' has a wrong offset!");
static_assert(offsetof(ABP_Facial_Cine_Main_C_ExecuteUbergraph_ABP_Facial_Cine_Main, CallFunc_MapRangeClamped_ReturnValue) == 0x000008, "Member 'ABP_Facial_Cine_Main_C_ExecuteUbergraph_ABP_Facial_Cine_Main::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Facial_Cine_Main_C_ExecuteUbergraph_ABP_Facial_Cine_Main, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x000010, "Member 'ABP_Facial_Cine_Main_C_ExecuteUbergraph_ABP_Facial_Cine_Main::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Facial_Cine_Main_C_ExecuteUbergraph_ABP_Facial_Cine_Main, CallFunc_IsSlotActive_ReturnValue) == 0x000011, "Member 'ABP_Facial_Cine_Main_C_ExecuteUbergraph_ABP_Facial_Cine_Main::CallFunc_IsSlotActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Facial_Cine_Main_C_ExecuteUbergraph_ABP_Facial_Cine_Main, CallFunc_MakeRotator_ReturnValue) == 0x000018, "Member 'ABP_Facial_Cine_Main_C_ExecuteUbergraph_ABP_Facial_Cine_Main::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Facial_Cine_Main_C_ExecuteUbergraph_ABP_Facial_Cine_Main, CallFunc_Conv_RotatorToQuaternion_ReturnValue) == 0x000030, "Member 'ABP_Facial_Cine_Main_C_ExecuteUbergraph_ABP_Facial_Cine_Main::CallFunc_Conv_RotatorToQuaternion_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Facial_Cine_Main_C_ExecuteUbergraph_ABP_Facial_Cine_Main, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000050, "Member 'ABP_Facial_Cine_Main_C_ExecuteUbergraph_ABP_Facial_Cine_Main::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Facial_Cine_Main_C_ExecuteUbergraph_ABP_Facial_Cine_Main, CallFunc_Abs_ReturnValue) == 0x000058, "Member 'ABP_Facial_Cine_Main_C_ExecuteUbergraph_ABP_Facial_Cine_Main::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Facial_Cine_Main_C_ExecuteUbergraph_ABP_Facial_Cine_Main, CallFunc_Abs_ReturnValue_1) == 0x000060, "Member 'ABP_Facial_Cine_Main_C_ExecuteUbergraph_ABP_Facial_Cine_Main::CallFunc_Abs_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_Facial_Cine_Main_C_ExecuteUbergraph_ABP_Facial_Cine_Main, CallFunc_MapRangeClamped_Value_ImplicitCast) == 0x000068, "Member 'ABP_Facial_Cine_Main_C_ExecuteUbergraph_ABP_Facial_Cine_Main::CallFunc_MapRangeClamped_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ABP_Facial_Cine_Main_C_ExecuteUbergraph_ABP_Facial_Cine_Main, CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast) == 0x000070, "Member 'ABP_Facial_Cine_Main_C_ExecuteUbergraph_ABP_Facial_Cine_Main::CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ABP_Facial_Cine_Main_C_ExecuteUbergraph_ABP_Facial_Cine_Main, K2Node_StructMemberSet_Alpha_ImplicitCast) == 0x000078, "Member 'ABP_Facial_Cine_Main_C_ExecuteUbergraph_ABP_Facial_Cine_Main::K2Node_StructMemberSet_Alpha_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ABP_Facial_Cine_Main_C_ExecuteUbergraph_ABP_Facial_Cine_Main, CallFunc_MakeRotator_Yaw_ImplicitCast) == 0x00007C, "Member 'ABP_Facial_Cine_Main_C_ExecuteUbergraph_ABP_Facial_Cine_Main::CallFunc_MakeRotator_Yaw_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ABP_Facial_Cine_Main_C_ExecuteUbergraph_ABP_Facial_Cine_Main, CallFunc_MakeRotator_Roll_ImplicitCast) == 0x000080, "Member 'ABP_Facial_Cine_Main_C_ExecuteUbergraph_ABP_Facial_Cine_Main::CallFunc_MakeRotator_Roll_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ABP_Facial_Cine_Main_C_ExecuteUbergraph_ABP_Facial_Cine_Main, CallFunc_Less_DoubleDouble_A_ImplicitCast) == 0x000088, "Member 'ABP_Facial_Cine_Main_C_ExecuteUbergraph_ABP_Facial_Cine_Main::CallFunc_Less_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ABP_Facial_Cine_Main_C_ExecuteUbergraph_ABP_Facial_Cine_Main, CallFunc_Abs_A_ImplicitCast) == 0x000090, "Member 'ABP_Facial_Cine_Main_C_ExecuteUbergraph_ABP_Facial_Cine_Main::CallFunc_Abs_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ABP_Facial_Cine_Main_C_ExecuteUbergraph_ABP_Facial_Cine_Main, K2Node_StructMemberSet_Alpha_ImplicitCast_1) == 0x000098, "Member 'ABP_Facial_Cine_Main_C_ExecuteUbergraph_ABP_Facial_Cine_Main::K2Node_StructMemberSet_Alpha_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(ABP_Facial_Cine_Main_C_ExecuteUbergraph_ABP_Facial_Cine_Main, CallFunc_Abs_A_ImplicitCast_1) == 0x0000A0, "Member 'ABP_Facial_Cine_Main_C_ExecuteUbergraph_ABP_Facial_Cine_Main::CallFunc_Abs_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(ABP_Facial_Cine_Main_C_ExecuteUbergraph_ABP_Facial_Cine_Main, K2Node_StructMemberSet_Alpha_ImplicitCast_2) == 0x0000A8, "Member 'ABP_Facial_Cine_Main_C_ExecuteUbergraph_ABP_Facial_Cine_Main::K2Node_StructMemberSet_Alpha_ImplicitCast_2' has a wrong offset!");

}

