#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_CustomMovement

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function ABP_CustomMovement.ABP_CustomMovement_C.AnimGraph
// 0x0020 (0x0020 - 0x0000)
struct ABP_CustomMovement_C_AnimGraph final
{
public:
	struct FPoseLink                              InPose;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              AnimGraph_0;                                       // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_CustomMovement_C_AnimGraph) == 0x000008, "Wrong alignment on ABP_CustomMovement_C_AnimGraph");
static_assert(sizeof(ABP_CustomMovement_C_AnimGraph) == 0x000020, "Wrong size on ABP_CustomMovement_C_AnimGraph");
static_assert(offsetof(ABP_CustomMovement_C_AnimGraph, InPose) == 0x000000, "Member 'ABP_CustomMovement_C_AnimGraph::InPose' has a wrong offset!");
static_assert(offsetof(ABP_CustomMovement_C_AnimGraph, AnimGraph_0) == 0x000010, "Member 'ABP_CustomMovement_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function ABP_CustomMovement.ABP_CustomMovement_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct ABP_CustomMovement_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_CustomMovement_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on ABP_CustomMovement_C_BlueprintUpdateAnimation");
static_assert(sizeof(ABP_CustomMovement_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on ABP_CustomMovement_C_BlueprintUpdateAnimation");
static_assert(offsetof(ABP_CustomMovement_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'ABP_CustomMovement_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function ABP_CustomMovement.ABP_CustomMovement_C.ExecuteUbergraph_ABP_CustomMovement
// 0x0068 (0x0068 - 0x0000)
struct ABP_CustomMovement_C_ExecuteUbergraph_ABP_CustomMovement final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x0010(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0053(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_StructMemberSet___FloatProperty_3_ImplicitCast; // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_CustomMovement_C_ExecuteUbergraph_ABP_CustomMovement) == 0x000008, "Wrong alignment on ABP_CustomMovement_C_ExecuteUbergraph_ABP_CustomMovement");
static_assert(sizeof(ABP_CustomMovement_C_ExecuteUbergraph_ABP_CustomMovement) == 0x000068, "Wrong size on ABP_CustomMovement_C_ExecuteUbergraph_ABP_CustomMovement");
static_assert(offsetof(ABP_CustomMovement_C_ExecuteUbergraph_ABP_CustomMovement, EntryPoint) == 0x000000, "Member 'ABP_CustomMovement_C_ExecuteUbergraph_ABP_CustomMovement::EntryPoint' has a wrong offset!");
static_assert(offsetof(ABP_CustomMovement_C_ExecuteUbergraph_ABP_CustomMovement, K2Node_SwitchEnum_CmpSuccess) == 0x000004, "Member 'ABP_CustomMovement_C_ExecuteUbergraph_ABP_CustomMovement::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(ABP_CustomMovement_C_ExecuteUbergraph_ABP_CustomMovement, K2Node_Event_DeltaTimeX) == 0x000008, "Member 'ABP_CustomMovement_C_ExecuteUbergraph_ABP_CustomMovement::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(ABP_CustomMovement_C_ExecuteUbergraph_ABP_CustomMovement, Temp_bool_IsClosed_Variable) == 0x00000C, "Member 'ABP_CustomMovement_C_ExecuteUbergraph_ABP_CustomMovement::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(ABP_CustomMovement_C_ExecuteUbergraph_ABP_CustomMovement, CallFunc_GetVelocity_ReturnValue) == 0x000010, "Member 'ABP_CustomMovement_C_ExecuteUbergraph_ABP_CustomMovement::CallFunc_GetVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_CustomMovement_C_ExecuteUbergraph_ABP_CustomMovement, CallFunc_VLerp_ReturnValue) == 0x000028, "Member 'ABP_CustomMovement_C_ExecuteUbergraph_ABP_CustomMovement::CallFunc_VLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_CustomMovement_C_ExecuteUbergraph_ABP_CustomMovement, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000040, "Member 'ABP_CustomMovement_C_ExecuteUbergraph_ABP_CustomMovement::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_CustomMovement_C_ExecuteUbergraph_ABP_CustomMovement, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000048, "Member 'ABP_CustomMovement_C_ExecuteUbergraph_ABP_CustomMovement::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_CustomMovement_C_ExecuteUbergraph_ABP_CustomMovement, Temp_bool_Has_Been_Initd_Variable) == 0x000050, "Member 'ABP_CustomMovement_C_ExecuteUbergraph_ABP_CustomMovement::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(ABP_CustomMovement_C_ExecuteUbergraph_ABP_CustomMovement, CallFunc_IsValid_ReturnValue) == 0x000051, "Member 'ABP_CustomMovement_C_ExecuteUbergraph_ABP_CustomMovement::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_CustomMovement_C_ExecuteUbergraph_ABP_CustomMovement, CallFunc_GetValidValue_ReturnValue) == 0x000052, "Member 'ABP_CustomMovement_C_ExecuteUbergraph_ABP_CustomMovement::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_CustomMovement_C_ExecuteUbergraph_ABP_CustomMovement, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000053, "Member 'ABP_CustomMovement_C_ExecuteUbergraph_ABP_CustomMovement::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_CustomMovement_C_ExecuteUbergraph_ABP_CustomMovement, CallFunc_IsValid_ReturnValue_1) == 0x000054, "Member 'ABP_CustomMovement_C_ExecuteUbergraph_ABP_CustomMovement::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_CustomMovement_C_ExecuteUbergraph_ABP_CustomMovement, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x000058, "Member 'ABP_CustomMovement_C_ExecuteUbergraph_ABP_CustomMovement::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ABP_CustomMovement_C_ExecuteUbergraph_ABP_CustomMovement, K2Node_StructMemberSet___FloatProperty_3_ImplicitCast) == 0x000060, "Member 'ABP_CustomMovement_C_ExecuteUbergraph_ABP_CustomMovement::K2Node_StructMemberSet___FloatProperty_3_ImplicitCast' has a wrong offset!");

// Function ABP_CustomMovement.ABP_CustomMovement_C.UpdateAnimationAssets
// 0x0040 (0x0040 - 0x0000)
struct ABP_CustomMovement_C_UpdateAnimationAssets final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_CustomMovementCharacter_C> K2Node_DynamicCast_AsBPI_Custom_Movement_Character; // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_CustomMovementComponent_C*          CallFunc_GetCustomMovement_CustomMovement;         // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue;              // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             K2Node_DynamicCast_AsCharacter;                    // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_CustomMovement_C_UpdateAnimationAssets) == 0x000008, "Wrong alignment on ABP_CustomMovement_C_UpdateAnimationAssets");
static_assert(sizeof(ABP_CustomMovement_C_UpdateAnimationAssets) == 0x000040, "Wrong size on ABP_CustomMovement_C_UpdateAnimationAssets");
static_assert(offsetof(ABP_CustomMovement_C_UpdateAnimationAssets, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'ABP_CustomMovement_C_UpdateAnimationAssets::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_CustomMovement_C_UpdateAnimationAssets, K2Node_DynamicCast_AsBPI_Custom_Movement_Character) == 0x000008, "Member 'ABP_CustomMovement_C_UpdateAnimationAssets::K2Node_DynamicCast_AsBPI_Custom_Movement_Character' has a wrong offset!");
static_assert(offsetof(ABP_CustomMovement_C_UpdateAnimationAssets, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'ABP_CustomMovement_C_UpdateAnimationAssets::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ABP_CustomMovement_C_UpdateAnimationAssets, CallFunc_GetCustomMovement_CustomMovement) == 0x000020, "Member 'ABP_CustomMovement_C_UpdateAnimationAssets::CallFunc_GetCustomMovement_CustomMovement' has a wrong offset!");
static_assert(offsetof(ABP_CustomMovement_C_UpdateAnimationAssets, CallFunc_TryGetPawnOwner_ReturnValue) == 0x000028, "Member 'ABP_CustomMovement_C_UpdateAnimationAssets::CallFunc_TryGetPawnOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_CustomMovement_C_UpdateAnimationAssets, K2Node_DynamicCast_AsCharacter) == 0x000030, "Member 'ABP_CustomMovement_C_UpdateAnimationAssets::K2Node_DynamicCast_AsCharacter' has a wrong offset!");
static_assert(offsetof(ABP_CustomMovement_C_UpdateAnimationAssets, K2Node_DynamicCast_bSuccess_1) == 0x000038, "Member 'ABP_CustomMovement_C_UpdateAnimationAssets::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

}

