#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_PostProcess_Potato_Tank

#include "Basic.hpp"

#include "KawaiiPhysics_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_PostProcess_Potato_Tank.ABP_PostProcess_Potato_Tank_C
// 0x9550 (0x98C0 - 0x0370)
class UABP_PostProcess_Potato_Tank_C final : public UAnimInstance
{
public:
	uint8                                         Pad_368[0x8];                                      // 0x0368(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0370(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0378(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0380(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0388(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x03A8(0x00B8)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x0460(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0480(0x0020)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_16;                     // 0x04A0(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_15;                     // 0x09C0(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_14;                     // 0x0EE0(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_13;                     // 0x1400(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_12;                     // 0x1920(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_11;                     // 0x1E40(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_10;                     // 0x2360(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_9;                      // 0x2880(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_8;                      // 0x2DA0(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_7;                      // 0x32C0(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_6;                      // 0x37E0(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_5;                      // 0x3D00(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_4;                      // 0x4220(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_3;                      // 0x4740(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_2;                      // 0x4C60(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_1;                      // 0x5180(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics;                        // 0x56A0(0x0520)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_7;                     // 0x5BC0(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_6;                     // 0x6360(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_5;                     // 0x6B00(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_4;                     // 0x72A0(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_3;                     // 0x7A40(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_2;                     // 0x81E0(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_1;                     // 0x8980(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics;                       // 0x9120(0x07A0)()

public:
	void AnimGraph(const struct FPoseLink& InPose, struct FPoseLink* AnimGraph_0);
	void ExecuteUbergraph_ABP_PostProcess_Potato_Tank(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_PostProcess_Potato_Tank_C">();
	}
	static class UABP_PostProcess_Potato_Tank_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_PostProcess_Potato_Tank_C>();
	}
};
static_assert(alignof(UABP_PostProcess_Potato_Tank_C) == 0x000010, "Wrong alignment on UABP_PostProcess_Potato_Tank_C");
static_assert(sizeof(UABP_PostProcess_Potato_Tank_C) == 0x0098C0, "Wrong size on UABP_PostProcess_Potato_Tank_C");
static_assert(offsetof(UABP_PostProcess_Potato_Tank_C, UberGraphFrame) == 0x000370, "Member 'UABP_PostProcess_Potato_Tank_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Potato_Tank_C, AnimBlueprintExtension_PropertyAccess) == 0x000378, "Member 'UABP_PostProcess_Potato_Tank_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Potato_Tank_C, AnimBlueprintExtension_Base) == 0x000380, "Member 'UABP_PostProcess_Potato_Tank_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Potato_Tank_C, AnimGraphNode_Root) == 0x000388, "Member 'UABP_PostProcess_Potato_Tank_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Potato_Tank_C, AnimGraphNode_LinkedInputPose) == 0x0003A8, "Member 'UABP_PostProcess_Potato_Tank_C::AnimGraphNode_LinkedInputPose' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Potato_Tank_C, AnimGraphNode_LocalToComponentSpace) == 0x000460, "Member 'UABP_PostProcess_Potato_Tank_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Potato_Tank_C, AnimGraphNode_ComponentToLocalSpace) == 0x000480, "Member 'UABP_PostProcess_Potato_Tank_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Potato_Tank_C, AnimGraphNode_AnimDynamics_16) == 0x0004A0, "Member 'UABP_PostProcess_Potato_Tank_C::AnimGraphNode_AnimDynamics_16' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Potato_Tank_C, AnimGraphNode_AnimDynamics_15) == 0x0009C0, "Member 'UABP_PostProcess_Potato_Tank_C::AnimGraphNode_AnimDynamics_15' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Potato_Tank_C, AnimGraphNode_AnimDynamics_14) == 0x000EE0, "Member 'UABP_PostProcess_Potato_Tank_C::AnimGraphNode_AnimDynamics_14' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Potato_Tank_C, AnimGraphNode_AnimDynamics_13) == 0x001400, "Member 'UABP_PostProcess_Potato_Tank_C::AnimGraphNode_AnimDynamics_13' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Potato_Tank_C, AnimGraphNode_AnimDynamics_12) == 0x001920, "Member 'UABP_PostProcess_Potato_Tank_C::AnimGraphNode_AnimDynamics_12' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Potato_Tank_C, AnimGraphNode_AnimDynamics_11) == 0x001E40, "Member 'UABP_PostProcess_Potato_Tank_C::AnimGraphNode_AnimDynamics_11' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Potato_Tank_C, AnimGraphNode_AnimDynamics_10) == 0x002360, "Member 'UABP_PostProcess_Potato_Tank_C::AnimGraphNode_AnimDynamics_10' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Potato_Tank_C, AnimGraphNode_AnimDynamics_9) == 0x002880, "Member 'UABP_PostProcess_Potato_Tank_C::AnimGraphNode_AnimDynamics_9' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Potato_Tank_C, AnimGraphNode_AnimDynamics_8) == 0x002DA0, "Member 'UABP_PostProcess_Potato_Tank_C::AnimGraphNode_AnimDynamics_8' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Potato_Tank_C, AnimGraphNode_AnimDynamics_7) == 0x0032C0, "Member 'UABP_PostProcess_Potato_Tank_C::AnimGraphNode_AnimDynamics_7' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Potato_Tank_C, AnimGraphNode_AnimDynamics_6) == 0x0037E0, "Member 'UABP_PostProcess_Potato_Tank_C::AnimGraphNode_AnimDynamics_6' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Potato_Tank_C, AnimGraphNode_AnimDynamics_5) == 0x003D00, "Member 'UABP_PostProcess_Potato_Tank_C::AnimGraphNode_AnimDynamics_5' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Potato_Tank_C, AnimGraphNode_AnimDynamics_4) == 0x004220, "Member 'UABP_PostProcess_Potato_Tank_C::AnimGraphNode_AnimDynamics_4' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Potato_Tank_C, AnimGraphNode_AnimDynamics_3) == 0x004740, "Member 'UABP_PostProcess_Potato_Tank_C::AnimGraphNode_AnimDynamics_3' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Potato_Tank_C, AnimGraphNode_AnimDynamics_2) == 0x004C60, "Member 'UABP_PostProcess_Potato_Tank_C::AnimGraphNode_AnimDynamics_2' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Potato_Tank_C, AnimGraphNode_AnimDynamics_1) == 0x005180, "Member 'UABP_PostProcess_Potato_Tank_C::AnimGraphNode_AnimDynamics_1' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Potato_Tank_C, AnimGraphNode_AnimDynamics) == 0x0056A0, "Member 'UABP_PostProcess_Potato_Tank_C::AnimGraphNode_AnimDynamics' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Potato_Tank_C, AnimGraphNode_KawaiiPhysics_7) == 0x005BC0, "Member 'UABP_PostProcess_Potato_Tank_C::AnimGraphNode_KawaiiPhysics_7' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Potato_Tank_C, AnimGraphNode_KawaiiPhysics_6) == 0x006360, "Member 'UABP_PostProcess_Potato_Tank_C::AnimGraphNode_KawaiiPhysics_6' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Potato_Tank_C, AnimGraphNode_KawaiiPhysics_5) == 0x006B00, "Member 'UABP_PostProcess_Potato_Tank_C::AnimGraphNode_KawaiiPhysics_5' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Potato_Tank_C, AnimGraphNode_KawaiiPhysics_4) == 0x0072A0, "Member 'UABP_PostProcess_Potato_Tank_C::AnimGraphNode_KawaiiPhysics_4' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Potato_Tank_C, AnimGraphNode_KawaiiPhysics_3) == 0x007A40, "Member 'UABP_PostProcess_Potato_Tank_C::AnimGraphNode_KawaiiPhysics_3' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Potato_Tank_C, AnimGraphNode_KawaiiPhysics_2) == 0x0081E0, "Member 'UABP_PostProcess_Potato_Tank_C::AnimGraphNode_KawaiiPhysics_2' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Potato_Tank_C, AnimGraphNode_KawaiiPhysics_1) == 0x008980, "Member 'UABP_PostProcess_Potato_Tank_C::AnimGraphNode_KawaiiPhysics_1' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Potato_Tank_C, AnimGraphNode_KawaiiPhysics) == 0x009120, "Member 'UABP_PostProcess_Potato_Tank_C::AnimGraphNode_KawaiiPhysics' has a wrong offset!");

}

