#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_CustomMovement

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct ABP_CustomMovement.ABP_CustomMovement_C.AnimBlueprintGeneratedConstantData
// 0x03DF (0x03E0 - 0x0001)
struct ABP_CustomMovement::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_56;                                 // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_57;                                // 0x000C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESequenceEvalReinit                           __ByteProperty_58;                                 // 0x0010(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_59;                                 // 0x0011(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_60;                                 // 0x0012(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_61;                                 // 0x0013(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_62;                                 // 0x0014(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_63;                                 // 0x001C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_64;                                 // 0x0024(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_65;                                  // 0x002C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlendProfile*                          __BlendProfile_66;                                 // 0x0030(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_67;                                   // 0x0038(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          __BoolProperty_68;                                 // 0x0040(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_69;                                 // 0x0041(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_70;                                 // 0x0042(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_43[0x5];                                       // 0x0043(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_71;                                // 0x0048(0x0010)(BlueprintVisible, EditFixedSize)
	struct FAnimNodeFunctionRef                   __StructProperty_72;                               // 0x0058(0x0020)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_Tag                     AnimBlueprintExtension_Tag;                        // 0x0078(0x0060)()
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x00D8(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0158(0x0018)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_2;              // 0x0170(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_1;              // 0x01A0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root;                           // 0x01D0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SubInput;                       // 0x0200(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedAnimGraph_1;              // 0x0230(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ComponentToLocalSpace;          // 0x0260(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone;                     // 0x0290(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalToComponentSpace;          // 0x02C0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequenceEvaluator;              // 0x02F0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult;                    // 0x0320(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine;                   // 0x0350(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool;                // 0x0380(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedAnimGraph;                // 0x03B0(0x0030)()
};
static_assert(alignof(ABP_CustomMovement::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on ABP_CustomMovement::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(ABP_CustomMovement::FAnimBlueprintGeneratedConstantData) == 0x0003E0, "Wrong size on ABP_CustomMovement::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(ABP_CustomMovement::FAnimBlueprintGeneratedConstantData, __NameProperty_56) == 0x000004, "Member 'ABP_CustomMovement::FAnimBlueprintGeneratedConstantData::__NameProperty_56' has a wrong offset!");
static_assert(offsetof(ABP_CustomMovement::FAnimBlueprintGeneratedConstantData, __FloatProperty_57) == 0x00000C, "Member 'ABP_CustomMovement::FAnimBlueprintGeneratedConstantData::__FloatProperty_57' has a wrong offset!");
static_assert(offsetof(ABP_CustomMovement::FAnimBlueprintGeneratedConstantData, __ByteProperty_58) == 0x000010, "Member 'ABP_CustomMovement::FAnimBlueprintGeneratedConstantData::__ByteProperty_58' has a wrong offset!");
static_assert(offsetof(ABP_CustomMovement::FAnimBlueprintGeneratedConstantData, __BoolProperty_59) == 0x000011, "Member 'ABP_CustomMovement::FAnimBlueprintGeneratedConstantData::__BoolProperty_59' has a wrong offset!");
static_assert(offsetof(ABP_CustomMovement::FAnimBlueprintGeneratedConstantData, __EnumProperty_60) == 0x000012, "Member 'ABP_CustomMovement::FAnimBlueprintGeneratedConstantData::__EnumProperty_60' has a wrong offset!");
static_assert(offsetof(ABP_CustomMovement::FAnimBlueprintGeneratedConstantData, __ByteProperty_61) == 0x000013, "Member 'ABP_CustomMovement::FAnimBlueprintGeneratedConstantData::__ByteProperty_61' has a wrong offset!");
static_assert(offsetof(ABP_CustomMovement::FAnimBlueprintGeneratedConstantData, __NameProperty_62) == 0x000014, "Member 'ABP_CustomMovement::FAnimBlueprintGeneratedConstantData::__NameProperty_62' has a wrong offset!");
static_assert(offsetof(ABP_CustomMovement::FAnimBlueprintGeneratedConstantData, __NameProperty_63) == 0x00001C, "Member 'ABP_CustomMovement::FAnimBlueprintGeneratedConstantData::__NameProperty_63' has a wrong offset!");
static_assert(offsetof(ABP_CustomMovement::FAnimBlueprintGeneratedConstantData, __NameProperty_64) == 0x000024, "Member 'ABP_CustomMovement::FAnimBlueprintGeneratedConstantData::__NameProperty_64' has a wrong offset!");
static_assert(offsetof(ABP_CustomMovement::FAnimBlueprintGeneratedConstantData, __IntProperty_65) == 0x00002C, "Member 'ABP_CustomMovement::FAnimBlueprintGeneratedConstantData::__IntProperty_65' has a wrong offset!");
static_assert(offsetof(ABP_CustomMovement::FAnimBlueprintGeneratedConstantData, __BlendProfile_66) == 0x000030, "Member 'ABP_CustomMovement::FAnimBlueprintGeneratedConstantData::__BlendProfile_66' has a wrong offset!");
static_assert(offsetof(ABP_CustomMovement::FAnimBlueprintGeneratedConstantData, __CurveFloat_67) == 0x000038, "Member 'ABP_CustomMovement::FAnimBlueprintGeneratedConstantData::__CurveFloat_67' has a wrong offset!");
static_assert(offsetof(ABP_CustomMovement::FAnimBlueprintGeneratedConstantData, __BoolProperty_68) == 0x000040, "Member 'ABP_CustomMovement::FAnimBlueprintGeneratedConstantData::__BoolProperty_68' has a wrong offset!");
static_assert(offsetof(ABP_CustomMovement::FAnimBlueprintGeneratedConstantData, __EnumProperty_69) == 0x000041, "Member 'ABP_CustomMovement::FAnimBlueprintGeneratedConstantData::__EnumProperty_69' has a wrong offset!");
static_assert(offsetof(ABP_CustomMovement::FAnimBlueprintGeneratedConstantData, __EnumProperty_70) == 0x000042, "Member 'ABP_CustomMovement::FAnimBlueprintGeneratedConstantData::__EnumProperty_70' has a wrong offset!");
static_assert(offsetof(ABP_CustomMovement::FAnimBlueprintGeneratedConstantData, __ArrayProperty_71) == 0x000048, "Member 'ABP_CustomMovement::FAnimBlueprintGeneratedConstantData::__ArrayProperty_71' has a wrong offset!");
static_assert(offsetof(ABP_CustomMovement::FAnimBlueprintGeneratedConstantData, __StructProperty_72) == 0x000058, "Member 'ABP_CustomMovement::FAnimBlueprintGeneratedConstantData::__StructProperty_72' has a wrong offset!");
static_assert(offsetof(ABP_CustomMovement::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Tag) == 0x000078, "Member 'ABP_CustomMovement::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Tag' has a wrong offset!");
static_assert(offsetof(ABP_CustomMovement::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x0000D8, "Member 'ABP_CustomMovement::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(ABP_CustomMovement::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000158, "Member 'ABP_CustomMovement::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(ABP_CustomMovement::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendListByBool_2) == 0x000170, "Member 'ABP_CustomMovement::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendListByBool_2' has a wrong offset!");
static_assert(offsetof(ABP_CustomMovement::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendListByBool_1) == 0x0001A0, "Member 'ABP_CustomMovement::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendListByBool_1' has a wrong offset!");
static_assert(offsetof(ABP_CustomMovement::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root) == 0x0001D0, "Member 'ABP_CustomMovement::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(ABP_CustomMovement::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SubInput) == 0x000200, "Member 'ABP_CustomMovement::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SubInput' has a wrong offset!");
static_assert(offsetof(ABP_CustomMovement::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LinkedAnimGraph_1) == 0x000230, "Member 'ABP_CustomMovement::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LinkedAnimGraph_1' has a wrong offset!");
static_assert(offsetof(ABP_CustomMovement::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ComponentToLocalSpace) == 0x000260, "Member 'ABP_CustomMovement::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(ABP_CustomMovement::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ModifyBone) == 0x000290, "Member 'ABP_CustomMovement::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(ABP_CustomMovement::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LocalToComponentSpace) == 0x0002C0, "Member 'ABP_CustomMovement::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(ABP_CustomMovement::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequenceEvaluator) == 0x0002F0, "Member 'ABP_CustomMovement::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequenceEvaluator' has a wrong offset!");
static_assert(offsetof(ABP_CustomMovement::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult) == 0x000320, "Member 'ABP_CustomMovement::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(ABP_CustomMovement::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateMachine) == 0x000350, "Member 'ABP_CustomMovement::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(ABP_CustomMovement::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendListByBool) == 0x000380, "Member 'ABP_CustomMovement::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(ABP_CustomMovement::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LinkedAnimGraph) == 0x0003B0, "Member 'ABP_CustomMovement::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LinkedAnimGraph' has a wrong offset!");

// ScriptStruct ABP_CustomMovement.ABP_CustomMovement_C.AnimBlueprintGeneratedMutableData
// 0x0047 (0x0048 - 0x0001)
struct ABP_CustomMovement::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty;                                   // 0x0008(0x0010)(BlueprintVisible, EditFixedSize)
	bool                                          __BoolProperty_0;                                  // 0x0018(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_1;                                 // 0x0020(0x0010)(BlueprintVisible, EditFixedSize)
	bool                                          __BoolProperty_2;                                  // 0x0030(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_3;                                 // 0x0034(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_4;                              // 0x0038(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          __BoolProperty_5;                                  // 0x0040(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_CustomMovement::FAnimBlueprintGeneratedMutableData) == 0x000008, "Wrong alignment on ABP_CustomMovement::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(ABP_CustomMovement::FAnimBlueprintGeneratedMutableData) == 0x000048, "Wrong size on ABP_CustomMovement::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(ABP_CustomMovement::FAnimBlueprintGeneratedMutableData, __ArrayProperty) == 0x000008, "Member 'ABP_CustomMovement::FAnimBlueprintGeneratedMutableData::__ArrayProperty' has a wrong offset!");
static_assert(offsetof(ABP_CustomMovement::FAnimBlueprintGeneratedMutableData, __BoolProperty_0) == 0x000018, "Member 'ABP_CustomMovement::FAnimBlueprintGeneratedMutableData::__BoolProperty_0' has a wrong offset!");
static_assert(offsetof(ABP_CustomMovement::FAnimBlueprintGeneratedMutableData, __ArrayProperty_1) == 0x000020, "Member 'ABP_CustomMovement::FAnimBlueprintGeneratedMutableData::__ArrayProperty_1' has a wrong offset!");
static_assert(offsetof(ABP_CustomMovement::FAnimBlueprintGeneratedMutableData, __BoolProperty_2) == 0x000030, "Member 'ABP_CustomMovement::FAnimBlueprintGeneratedMutableData::__BoolProperty_2' has a wrong offset!");
static_assert(offsetof(ABP_CustomMovement::FAnimBlueprintGeneratedMutableData, __FloatProperty_3) == 0x000034, "Member 'ABP_CustomMovement::FAnimBlueprintGeneratedMutableData::__FloatProperty_3' has a wrong offset!");
static_assert(offsetof(ABP_CustomMovement::FAnimBlueprintGeneratedMutableData, __AnimSequenceBase_4) == 0x000038, "Member 'ABP_CustomMovement::FAnimBlueprintGeneratedMutableData::__AnimSequenceBase_4' has a wrong offset!");
static_assert(offsetof(ABP_CustomMovement::FAnimBlueprintGeneratedMutableData, __BoolProperty_5) == 0x000040, "Member 'ABP_CustomMovement::FAnimBlueprintGeneratedMutableData::__BoolProperty_5' has a wrong offset!");

}

