#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_CinematicCharacter

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function ABP_CinematicCharacter.ABP_CinematicCharacter_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct ABP_CinematicCharacter_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_CinematicCharacter_C_AnimGraph) == 0x000008, "Wrong alignment on ABP_CinematicCharacter_C_AnimGraph");
static_assert(sizeof(ABP_CinematicCharacter_C_AnimGraph) == 0x000010, "Wrong size on ABP_CinematicCharacter_C_AnimGraph");
static_assert(offsetof(ABP_CinematicCharacter_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'ABP_CinematicCharacter_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function ABP_CinematicCharacter.ABP_CinematicCharacter_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct ABP_CinematicCharacter_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_CinematicCharacter_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on ABP_CinematicCharacter_C_BlueprintUpdateAnimation");
static_assert(sizeof(ABP_CinematicCharacter_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on ABP_CinematicCharacter_C_BlueprintUpdateAnimation");
static_assert(offsetof(ABP_CinematicCharacter_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'ABP_CinematicCharacter_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function ABP_CinematicCharacter.ABP_CinematicCharacter_C.ExecuteUbergraph_ABP_CinematicCharacter
// 0x0160 (0x0160 - 0x0000)
struct ABP_CinematicCharacter_C_ExecuteUbergraph_ABP_CinematicCharacter final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue; // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DoubleDouble_ReturnValue;      // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue_1;            // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F[0x1];                                        // 0x000F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_1; // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DoubleDouble_ReturnValue_1;    // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DoubleDouble_ReturnValue_2;    // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0xC];                                       // 0x0024(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_Conv_VectorToTransform_ReturnValue;       // 0x0030(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DoubleDouble_ReturnValue_3;    // 0x0092(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0093(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_95[0x3];                                       // 0x0095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue_1;                // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue_1;          // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x00A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_DoubleDouble_ReturnValue;        // 0x00A3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTimeX;                           // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue;              // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_CineCharacter_Main_C*               K2Node_DynamicCast_AsBP_Cine_Character_Main;       // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x00BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BB[0x5];                                       // 0x00BB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_CineCharacter_Main_C*               K2Node_DynamicCast_AsBP_Cine_Character_Main_1;     // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x00E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x0100(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInPlayMode_ReturnValue;                 // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x011A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x011B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11C[0x4];                                      // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_RandomFloatInRange_ReturnValue;           // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_2;         // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_EqualEqual_DoubleDouble_A_ImplicitCast;   // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_EqualEqual_DoubleDouble_A_ImplicitCast_1; // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_VariableSet_HandsManualBlendWeight_ImplicitCast; // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_StructMemberSet_Lookat_Radius_ImplicitCast; // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_StructMemberSet_Interpolation_Speed_ImplicitCast; // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_VariableSet_BreathingPlayRate_ImplicitCast; // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_VariableSet_Start_PositionBreathingAnimation_ImplicitCast; // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_VariableSet_BreathingPlayRate_ImplicitCast_1; // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_CinematicCharacter_C_ExecuteUbergraph_ABP_CinematicCharacter) == 0x000010, "Wrong alignment on ABP_CinematicCharacter_C_ExecuteUbergraph_ABP_CinematicCharacter");
static_assert(sizeof(ABP_CinematicCharacter_C_ExecuteUbergraph_ABP_CinematicCharacter) == 0x000160, "Wrong size on ABP_CinematicCharacter_C_ExecuteUbergraph_ABP_CinematicCharacter");
static_assert(offsetof(ABP_CinematicCharacter_C_ExecuteUbergraph_ABP_CinematicCharacter, EntryPoint) == 0x000000, "Member 'ABP_CinematicCharacter_C_ExecuteUbergraph_ABP_CinematicCharacter::EntryPoint' has a wrong offset!");
static_assert(offsetof(ABP_CinematicCharacter_C_ExecuteUbergraph_ABP_CinematicCharacter, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000004, "Member 'ABP_CinematicCharacter_C_ExecuteUbergraph_ABP_CinematicCharacter::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_CinematicCharacter_C_ExecuteUbergraph_ABP_CinematicCharacter, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000005, "Member 'ABP_CinematicCharacter_C_ExecuteUbergraph_ABP_CinematicCharacter::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_CinematicCharacter_C_ExecuteUbergraph_ABP_CinematicCharacter, CallFunc_GetRelevantAnimTimeRemaining_ReturnValue) == 0x000008, "Member 'ABP_CinematicCharacter_C_ExecuteUbergraph_ABP_CinematicCharacter::CallFunc_GetRelevantAnimTimeRemaining_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_CinematicCharacter_C_ExecuteUbergraph_ABP_CinematicCharacter, CallFunc_EqualEqual_DoubleDouble_ReturnValue) == 0x00000C, "Member 'ABP_CinematicCharacter_C_ExecuteUbergraph_ABP_CinematicCharacter::CallFunc_EqualEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_CinematicCharacter_C_ExecuteUbergraph_ABP_CinematicCharacter, CallFunc_NotEqual_IntInt_ReturnValue_1) == 0x00000D, "Member 'ABP_CinematicCharacter_C_ExecuteUbergraph_ABP_CinematicCharacter::CallFunc_NotEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_CinematicCharacter_C_ExecuteUbergraph_ABP_CinematicCharacter, CallFunc_BooleanOR_ReturnValue) == 0x00000E, "Member 'ABP_CinematicCharacter_C_ExecuteUbergraph_ABP_CinematicCharacter::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_CinematicCharacter_C_ExecuteUbergraph_ABP_CinematicCharacter, CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_1) == 0x000010, "Member 'ABP_CinematicCharacter_C_ExecuteUbergraph_ABP_CinematicCharacter::CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_CinematicCharacter_C_ExecuteUbergraph_ABP_CinematicCharacter, CallFunc_EqualEqual_DoubleDouble_ReturnValue_1) == 0x000014, "Member 'ABP_CinematicCharacter_C_ExecuteUbergraph_ABP_CinematicCharacter::CallFunc_EqualEqual_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_CinematicCharacter_C_ExecuteUbergraph_ABP_CinematicCharacter, CallFunc_SelectFloat_ReturnValue) == 0x000018, "Member 'ABP_CinematicCharacter_C_ExecuteUbergraph_ABP_CinematicCharacter::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_CinematicCharacter_C_ExecuteUbergraph_ABP_CinematicCharacter, CallFunc_BooleanOR_ReturnValue_1) == 0x000020, "Member 'ABP_CinematicCharacter_C_ExecuteUbergraph_ABP_CinematicCharacter::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_CinematicCharacter_C_ExecuteUbergraph_ABP_CinematicCharacter, CallFunc_IsValid_ReturnValue) == 0x000021, "Member 'ABP_CinematicCharacter_C_ExecuteUbergraph_ABP_CinematicCharacter::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_CinematicCharacter_C_ExecuteUbergraph_ABP_CinematicCharacter, CallFunc_IsValid_ReturnValue_1) == 0x000022, "Member 'ABP_CinematicCharacter_C_ExecuteUbergraph_ABP_CinematicCharacter::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_CinematicCharacter_C_ExecuteUbergraph_ABP_CinematicCharacter, CallFunc_EqualEqual_DoubleDouble_ReturnValue_2) == 0x000023, "Member 'ABP_CinematicCharacter_C_ExecuteUbergraph_ABP_CinematicCharacter::CallFunc_EqualEqual_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABP_CinematicCharacter_C_ExecuteUbergraph_ABP_CinematicCharacter, CallFunc_Conv_VectorToTransform_ReturnValue) == 0x000030, "Member 'ABP_CinematicCharacter_C_ExecuteUbergraph_ABP_CinematicCharacter::CallFunc_Conv_VectorToTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_CinematicCharacter_C_ExecuteUbergraph_ABP_CinematicCharacter, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000090, "Member 'ABP_CinematicCharacter_C_ExecuteUbergraph_ABP_CinematicCharacter::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_CinematicCharacter_C_ExecuteUbergraph_ABP_CinematicCharacter, CallFunc_BooleanAND_ReturnValue) == 0x000091, "Member 'ABP_CinematicCharacter_C_ExecuteUbergraph_ABP_CinematicCharacter::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_CinematicCharacter_C_ExecuteUbergraph_ABP_CinematicCharacter, CallFunc_EqualEqual_DoubleDouble_ReturnValue_3) == 0x000092, "Member 'ABP_CinematicCharacter_C_ExecuteUbergraph_ABP_CinematicCharacter::CallFunc_EqualEqual_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ABP_CinematicCharacter_C_ExecuteUbergraph_ABP_CinematicCharacter, CallFunc_Not_PreBool_ReturnValue) == 0x000093, "Member 'ABP_CinematicCharacter_C_ExecuteUbergraph_ABP_CinematicCharacter::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_CinematicCharacter_C_ExecuteUbergraph_ABP_CinematicCharacter, CallFunc_BooleanOR_ReturnValue_2) == 0x000094, "Member 'ABP_CinematicCharacter_C_ExecuteUbergraph_ABP_CinematicCharacter::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABP_CinematicCharacter_C_ExecuteUbergraph_ABP_CinematicCharacter, CallFunc_SelectFloat_ReturnValue_1) == 0x000098, "Member 'ABP_CinematicCharacter_C_ExecuteUbergraph_ABP_CinematicCharacter::CallFunc_SelectFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_CinematicCharacter_C_ExecuteUbergraph_ABP_CinematicCharacter, CallFunc_Less_DoubleDouble_ReturnValue_1) == 0x0000A0, "Member 'ABP_CinematicCharacter_C_ExecuteUbergraph_ABP_CinematicCharacter::CallFunc_Less_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_CinematicCharacter_C_ExecuteUbergraph_ABP_CinematicCharacter, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x0000A1, "Member 'ABP_CinematicCharacter_C_ExecuteUbergraph_ABP_CinematicCharacter::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_CinematicCharacter_C_ExecuteUbergraph_ABP_CinematicCharacter, CallFunc_BooleanAND_ReturnValue_1) == 0x0000A2, "Member 'ABP_CinematicCharacter_C_ExecuteUbergraph_ABP_CinematicCharacter::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_CinematicCharacter_C_ExecuteUbergraph_ABP_CinematicCharacter, CallFunc_NotEqual_DoubleDouble_ReturnValue) == 0x0000A3, "Member 'ABP_CinematicCharacter_C_ExecuteUbergraph_ABP_CinematicCharacter::CallFunc_NotEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_CinematicCharacter_C_ExecuteUbergraph_ABP_CinematicCharacter, K2Node_Event_DeltaTimeX) == 0x0000A4, "Member 'ABP_CinematicCharacter_C_ExecuteUbergraph_ABP_CinematicCharacter::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(ABP_CinematicCharacter_C_ExecuteUbergraph_ABP_CinematicCharacter, CallFunc_TryGetPawnOwner_ReturnValue) == 0x0000A8, "Member 'ABP_CinematicCharacter_C_ExecuteUbergraph_ABP_CinematicCharacter::CallFunc_TryGetPawnOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_CinematicCharacter_C_ExecuteUbergraph_ABP_CinematicCharacter, K2Node_DynamicCast_AsBP_Cine_Character_Main) == 0x0000B0, "Member 'ABP_CinematicCharacter_C_ExecuteUbergraph_ABP_CinematicCharacter::K2Node_DynamicCast_AsBP_Cine_Character_Main' has a wrong offset!");
static_assert(offsetof(ABP_CinematicCharacter_C_ExecuteUbergraph_ABP_CinematicCharacter, K2Node_DynamicCast_bSuccess) == 0x0000B8, "Member 'ABP_CinematicCharacter_C_ExecuteUbergraph_ABP_CinematicCharacter::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ABP_CinematicCharacter_C_ExecuteUbergraph_ABP_CinematicCharacter, CallFunc_IsValid_ReturnValue_2) == 0x0000B9, "Member 'ABP_CinematicCharacter_C_ExecuteUbergraph_ABP_CinematicCharacter::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABP_CinematicCharacter_C_ExecuteUbergraph_ABP_CinematicCharacter, CallFunc_IsValid_ReturnValue_3) == 0x0000BA, "Member 'ABP_CinematicCharacter_C_ExecuteUbergraph_ABP_CinematicCharacter::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ABP_CinematicCharacter_C_ExecuteUbergraph_ABP_CinematicCharacter, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0000C0, "Member 'ABP_CinematicCharacter_C_ExecuteUbergraph_ABP_CinematicCharacter::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_CinematicCharacter_C_ExecuteUbergraph_ABP_CinematicCharacter, K2Node_DynamicCast_AsBP_Cine_Character_Main_1) == 0x0000D8, "Member 'ABP_CinematicCharacter_C_ExecuteUbergraph_ABP_CinematicCharacter::K2Node_DynamicCast_AsBP_Cine_Character_Main_1' has a wrong offset!");
static_assert(offsetof(ABP_CinematicCharacter_C_ExecuteUbergraph_ABP_CinematicCharacter, K2Node_DynamicCast_bSuccess_1) == 0x0000E0, "Member 'ABP_CinematicCharacter_C_ExecuteUbergraph_ABP_CinematicCharacter::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(ABP_CinematicCharacter_C_ExecuteUbergraph_ABP_CinematicCharacter, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x0000E8, "Member 'ABP_CinematicCharacter_C_ExecuteUbergraph_ABP_CinematicCharacter::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_CinematicCharacter_C_ExecuteUbergraph_ABP_CinematicCharacter, CallFunc_GetSocketLocation_ReturnValue) == 0x000100, "Member 'ABP_CinematicCharacter_C_ExecuteUbergraph_ABP_CinematicCharacter::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_CinematicCharacter_C_ExecuteUbergraph_ABP_CinematicCharacter, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000118, "Member 'ABP_CinematicCharacter_C_ExecuteUbergraph_ABP_CinematicCharacter::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_CinematicCharacter_C_ExecuteUbergraph_ABP_CinematicCharacter, CallFunc_IsInPlayMode_ReturnValue) == 0x000119, "Member 'ABP_CinematicCharacter_C_ExecuteUbergraph_ABP_CinematicCharacter::CallFunc_IsInPlayMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_CinematicCharacter_C_ExecuteUbergraph_ABP_CinematicCharacter, CallFunc_Not_PreBool_ReturnValue_1) == 0x00011A, "Member 'ABP_CinematicCharacter_C_ExecuteUbergraph_ABP_CinematicCharacter::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_CinematicCharacter_C_ExecuteUbergraph_ABP_CinematicCharacter, CallFunc_BooleanAND_ReturnValue_2) == 0x00011B, "Member 'ABP_CinematicCharacter_C_ExecuteUbergraph_ABP_CinematicCharacter::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABP_CinematicCharacter_C_ExecuteUbergraph_ABP_CinematicCharacter, CallFunc_RandomFloatInRange_ReturnValue) == 0x000120, "Member 'ABP_CinematicCharacter_C_ExecuteUbergraph_ABP_CinematicCharacter::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_CinematicCharacter_C_ExecuteUbergraph_ABP_CinematicCharacter, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x000128, "Member 'ABP_CinematicCharacter_C_ExecuteUbergraph_ABP_CinematicCharacter::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_CinematicCharacter_C_ExecuteUbergraph_ABP_CinematicCharacter, CallFunc_RandomFloatInRange_ReturnValue_2) == 0x000130, "Member 'ABP_CinematicCharacter_C_ExecuteUbergraph_ABP_CinematicCharacter::CallFunc_RandomFloatInRange_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABP_CinematicCharacter_C_ExecuteUbergraph_ABP_CinematicCharacter, CallFunc_EqualEqual_DoubleDouble_A_ImplicitCast) == 0x000138, "Member 'ABP_CinematicCharacter_C_ExecuteUbergraph_ABP_CinematicCharacter::CallFunc_EqualEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ABP_CinematicCharacter_C_ExecuteUbergraph_ABP_CinematicCharacter, CallFunc_EqualEqual_DoubleDouble_A_ImplicitCast_1) == 0x000140, "Member 'ABP_CinematicCharacter_C_ExecuteUbergraph_ABP_CinematicCharacter::CallFunc_EqualEqual_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(ABP_CinematicCharacter_C_ExecuteUbergraph_ABP_CinematicCharacter, K2Node_VariableSet_HandsManualBlendWeight_ImplicitCast) == 0x000148, "Member 'ABP_CinematicCharacter_C_ExecuteUbergraph_ABP_CinematicCharacter::K2Node_VariableSet_HandsManualBlendWeight_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ABP_CinematicCharacter_C_ExecuteUbergraph_ABP_CinematicCharacter, K2Node_StructMemberSet_Lookat_Radius_ImplicitCast) == 0x00014C, "Member 'ABP_CinematicCharacter_C_ExecuteUbergraph_ABP_CinematicCharacter::K2Node_StructMemberSet_Lookat_Radius_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ABP_CinematicCharacter_C_ExecuteUbergraph_ABP_CinematicCharacter, K2Node_StructMemberSet_Interpolation_Speed_ImplicitCast) == 0x000150, "Member 'ABP_CinematicCharacter_C_ExecuteUbergraph_ABP_CinematicCharacter::K2Node_StructMemberSet_Interpolation_Speed_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ABP_CinematicCharacter_C_ExecuteUbergraph_ABP_CinematicCharacter, K2Node_VariableSet_BreathingPlayRate_ImplicitCast) == 0x000154, "Member 'ABP_CinematicCharacter_C_ExecuteUbergraph_ABP_CinematicCharacter::K2Node_VariableSet_BreathingPlayRate_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ABP_CinematicCharacter_C_ExecuteUbergraph_ABP_CinematicCharacter, K2Node_VariableSet_Start_PositionBreathingAnimation_ImplicitCast) == 0x000158, "Member 'ABP_CinematicCharacter_C_ExecuteUbergraph_ABP_CinematicCharacter::K2Node_VariableSet_Start_PositionBreathingAnimation_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ABP_CinematicCharacter_C_ExecuteUbergraph_ABP_CinematicCharacter, K2Node_VariableSet_BreathingPlayRate_ImplicitCast_1) == 0x00015C, "Member 'ABP_CinematicCharacter_C_ExecuteUbergraph_ABP_CinematicCharacter::K2Node_VariableSet_BreathingPlayRate_ImplicitCast_1' has a wrong offset!");

}

