#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Maelle_V2_PostProcess

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ABP_Maelle_V2_PostProcess.ABP_Maelle_V2_PostProcess_C.AnimGraph
// 0x0020 (0x0020 - 0x0000)
struct ABP_Maelle_V2_PostProcess_C_AnimGraph final
{
public:
	struct FPoseLink                              InPose;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              AnimGraph_0;                                       // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_Maelle_V2_PostProcess_C_AnimGraph) == 0x000008, "Wrong alignment on ABP_Maelle_V2_PostProcess_C_AnimGraph");
static_assert(sizeof(ABP_Maelle_V2_PostProcess_C_AnimGraph) == 0x000020, "Wrong size on ABP_Maelle_V2_PostProcess_C_AnimGraph");
static_assert(offsetof(ABP_Maelle_V2_PostProcess_C_AnimGraph, InPose) == 0x000000, "Member 'ABP_Maelle_V2_PostProcess_C_AnimGraph::InPose' has a wrong offset!");
static_assert(offsetof(ABP_Maelle_V2_PostProcess_C_AnimGraph, AnimGraph_0) == 0x000010, "Member 'ABP_Maelle_V2_PostProcess_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function ABP_Maelle_V2_PostProcess.ABP_Maelle_V2_PostProcess_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct ABP_Maelle_V2_PostProcess_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_Maelle_V2_PostProcess_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on ABP_Maelle_V2_PostProcess_C_BlueprintUpdateAnimation");
static_assert(sizeof(ABP_Maelle_V2_PostProcess_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on ABP_Maelle_V2_PostProcess_C_BlueprintUpdateAnimation");
static_assert(offsetof(ABP_Maelle_V2_PostProcess_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'ABP_Maelle_V2_PostProcess_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function ABP_Maelle_V2_PostProcess.ABP_Maelle_V2_PostProcess_C.ExecuteUbergraph_ABP_Maelle_V2_PostProcess
// 0x0018 (0x0018 - 0x0000)
struct ABP_Maelle_V2_PostProcess_C_ExecuteUbergraph_ABP_Maelle_V2_PostProcess final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldDisablePostProcessInAnimation_ShouldDisablePostProcessAnimationBlueprint; // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_Maelle_V2_PostProcess_C_ExecuteUbergraph_ABP_Maelle_V2_PostProcess) == 0x000008, "Wrong alignment on ABP_Maelle_V2_PostProcess_C_ExecuteUbergraph_ABP_Maelle_V2_PostProcess");
static_assert(sizeof(ABP_Maelle_V2_PostProcess_C_ExecuteUbergraph_ABP_Maelle_V2_PostProcess) == 0x000018, "Wrong size on ABP_Maelle_V2_PostProcess_C_ExecuteUbergraph_ABP_Maelle_V2_PostProcess");
static_assert(offsetof(ABP_Maelle_V2_PostProcess_C_ExecuteUbergraph_ABP_Maelle_V2_PostProcess, EntryPoint) == 0x000000, "Member 'ABP_Maelle_V2_PostProcess_C_ExecuteUbergraph_ABP_Maelle_V2_PostProcess::EntryPoint' has a wrong offset!");
static_assert(offsetof(ABP_Maelle_V2_PostProcess_C_ExecuteUbergraph_ABP_Maelle_V2_PostProcess, CallFunc_TryGetPawnOwner_ReturnValue) == 0x000008, "Member 'ABP_Maelle_V2_PostProcess_C_ExecuteUbergraph_ABP_Maelle_V2_PostProcess::CallFunc_TryGetPawnOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Maelle_V2_PostProcess_C_ExecuteUbergraph_ABP_Maelle_V2_PostProcess, CallFunc_ShouldDisablePostProcessInAnimation_ShouldDisablePostProcessAnimationBlueprint) == 0x000010, "Member 'ABP_Maelle_V2_PostProcess_C_ExecuteUbergraph_ABP_Maelle_V2_PostProcess::CallFunc_ShouldDisablePostProcessInAnimation_ShouldDisablePostProcessAnimationBlueprint' has a wrong offset!");
static_assert(offsetof(ABP_Maelle_V2_PostProcess_C_ExecuteUbergraph_ABP_Maelle_V2_PostProcess, K2Node_Event_DeltaTimeX) == 0x000014, "Member 'ABP_Maelle_V2_PostProcess_C_ExecuteUbergraph_ABP_Maelle_V2_PostProcess::K2Node_Event_DeltaTimeX' has a wrong offset!");

}

