#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_PostProcess_MyFlower_Rose

#include "Basic.hpp"

#include "KawaiiPhysics_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_PostProcess_MyFlower_Rose.ABP_PostProcess_MyFlower_Rose_C
// 0x0E70 (0x11E0 - 0x0370)
class UABP_PostProcess_MyFlower_Rose_C final : public UAnimInstance
{
public:
	uint8                                         Pad_368[0x8];                                      // 0x0368(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0370(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0378(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0380(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0388(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x03A8(0x00B8)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x0460(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0480(0x0020)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics;                       // 0x04A0(0x07A0)()
	struct FAnimNode_SpringBone                   AnimGraphNode_SpringBone_3;                        // 0x0C40(0x0168)()
	struct FAnimNode_SpringBone                   AnimGraphNode_SpringBone_2;                        // 0x0DA8(0x0168)()
	struct FAnimNode_SpringBone                   AnimGraphNode_SpringBone_1;                        // 0x0F10(0x0168)()
	struct FAnimNode_SpringBone                   AnimGraphNode_SpringBone;                          // 0x1078(0x0168)()

public:
	void AnimGraph(const struct FPoseLink& InPose, struct FPoseLink* AnimGraph_0);
	void ExecuteUbergraph_ABP_PostProcess_MyFlower_Rose(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_PostProcess_MyFlower_Rose_C">();
	}
	static class UABP_PostProcess_MyFlower_Rose_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_PostProcess_MyFlower_Rose_C>();
	}
};
static_assert(alignof(UABP_PostProcess_MyFlower_Rose_C) == 0x000010, "Wrong alignment on UABP_PostProcess_MyFlower_Rose_C");
static_assert(sizeof(UABP_PostProcess_MyFlower_Rose_C) == 0x0011E0, "Wrong size on UABP_PostProcess_MyFlower_Rose_C");
static_assert(offsetof(UABP_PostProcess_MyFlower_Rose_C, UberGraphFrame) == 0x000370, "Member 'UABP_PostProcess_MyFlower_Rose_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_MyFlower_Rose_C, AnimBlueprintExtension_PropertyAccess) == 0x000378, "Member 'UABP_PostProcess_MyFlower_Rose_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_MyFlower_Rose_C, AnimBlueprintExtension_Base) == 0x000380, "Member 'UABP_PostProcess_MyFlower_Rose_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_MyFlower_Rose_C, AnimGraphNode_Root) == 0x000388, "Member 'UABP_PostProcess_MyFlower_Rose_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_MyFlower_Rose_C, AnimGraphNode_LinkedInputPose) == 0x0003A8, "Member 'UABP_PostProcess_MyFlower_Rose_C::AnimGraphNode_LinkedInputPose' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_MyFlower_Rose_C, AnimGraphNode_LocalToComponentSpace) == 0x000460, "Member 'UABP_PostProcess_MyFlower_Rose_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_MyFlower_Rose_C, AnimGraphNode_ComponentToLocalSpace) == 0x000480, "Member 'UABP_PostProcess_MyFlower_Rose_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_MyFlower_Rose_C, AnimGraphNode_KawaiiPhysics) == 0x0004A0, "Member 'UABP_PostProcess_MyFlower_Rose_C::AnimGraphNode_KawaiiPhysics' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_MyFlower_Rose_C, AnimGraphNode_SpringBone_3) == 0x000C40, "Member 'UABP_PostProcess_MyFlower_Rose_C::AnimGraphNode_SpringBone_3' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_MyFlower_Rose_C, AnimGraphNode_SpringBone_2) == 0x000DA8, "Member 'UABP_PostProcess_MyFlower_Rose_C::AnimGraphNode_SpringBone_2' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_MyFlower_Rose_C, AnimGraphNode_SpringBone_1) == 0x000F10, "Member 'UABP_PostProcess_MyFlower_Rose_C::AnimGraphNode_SpringBone_1' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_MyFlower_Rose_C, AnimGraphNode_SpringBone) == 0x001078, "Member 'UABP_PostProcess_MyFlower_Rose_C::AnimGraphNode_SpringBone' has a wrong offset!");

}

