#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AC_InteractionCheck

#include "Basic.hpp"


namespace SDK::Params
{

// Function AC_InteractionCheck.AC_InteractionCheck_C.ExecuteUbergraph_AC_InteractionCheck
// 0x0028 (0x0028 - 0x0000)
struct AC_InteractionCheck_C_ExecuteUbergraph_AC_InteractionCheck final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_jRPG_GI_Custom_C*                   K2Node_DynamicCast_AsBP_J_RPG_GI_Custom;           // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckInteractionDone_AllCheckTrue;        // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AC_InteractionCheck_C_ExecuteUbergraph_AC_InteractionCheck) == 0x000008, "Wrong alignment on AC_InteractionCheck_C_ExecuteUbergraph_AC_InteractionCheck");
static_assert(sizeof(AC_InteractionCheck_C_ExecuteUbergraph_AC_InteractionCheck) == 0x000028, "Wrong size on AC_InteractionCheck_C_ExecuteUbergraph_AC_InteractionCheck");
static_assert(offsetof(AC_InteractionCheck_C_ExecuteUbergraph_AC_InteractionCheck, EntryPoint) == 0x000000, "Member 'AC_InteractionCheck_C_ExecuteUbergraph_AC_InteractionCheck::EntryPoint' has a wrong offset!");
static_assert(offsetof(AC_InteractionCheck_C_ExecuteUbergraph_AC_InteractionCheck, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'AC_InteractionCheck_C_ExecuteUbergraph_AC_InteractionCheck::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_InteractionCheck_C_ExecuteUbergraph_AC_InteractionCheck, CallFunc_GetGameInstance_ReturnValue) == 0x000010, "Member 'AC_InteractionCheck_C_ExecuteUbergraph_AC_InteractionCheck::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_InteractionCheck_C_ExecuteUbergraph_AC_InteractionCheck, K2Node_DynamicCast_AsBP_J_RPG_GI_Custom) == 0x000018, "Member 'AC_InteractionCheck_C_ExecuteUbergraph_AC_InteractionCheck::K2Node_DynamicCast_AsBP_J_RPG_GI_Custom' has a wrong offset!");
static_assert(offsetof(AC_InteractionCheck_C_ExecuteUbergraph_AC_InteractionCheck, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'AC_InteractionCheck_C_ExecuteUbergraph_AC_InteractionCheck::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AC_InteractionCheck_C_ExecuteUbergraph_AC_InteractionCheck, CallFunc_CheckInteractionDone_AllCheckTrue) == 0x000021, "Member 'AC_InteractionCheck_C_ExecuteUbergraph_AC_InteractionCheck::CallFunc_CheckInteractionDone_AllCheckTrue' has a wrong offset!");

}

