#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AC_jRPG_CharactersManager

#include "Basic.hpp"

#include "FEquipmentSlot_structs.hpp"
#include "S_jRPG_PartySlot_structs.hpp"
#include "S_jRPG_CharacterSaveState_structs.hpp"
#include "Engine_structs.hpp"
#include "S_jRPG_Item_StaticData_structs.hpp"
#include "E_jRPG_ItemType_structs.hpp"


namespace SDK::Params
{

// Function AC_jRPG_CharactersManager.AC_jRPG_CharactersManager_C.AddCharacterToParty
// 0x0050 (0x0050 - 0x0000)
struct AC_jRPG_CharactersManager_C_AddCharacterToParty final
{
public:
	class FName                                   CharacterHardcodedName;                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_jRPG_GI_Custom_C*                   CallFunc_GetCustomGI_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FS_jRPG_PartySlot                      K2Node_MakeStruct_S_jRPG_PartySlot;                // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckIfThereIsCharacterInParty_Success_;  // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_CheckIfThereIsCharacterInParty_SlotIndex; // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_jRPG_GI_Custom_C*                   CallFunc_GetCustomGI_ReturnValue_1;                // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_jRPG_GI_Custom_C*                   CallFunc_GetCustomGI_ReturnValue_2;                // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_CharacterData_C*                    CallFunc_GetCharacterByID_CharacterData;           // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AC_jRPG_CharactersManager_C_AddCharacterToParty) == 0x000008, "Wrong alignment on AC_jRPG_CharactersManager_C_AddCharacterToParty");
static_assert(sizeof(AC_jRPG_CharactersManager_C_AddCharacterToParty) == 0x000050, "Wrong size on AC_jRPG_CharactersManager_C_AddCharacterToParty");
static_assert(offsetof(AC_jRPG_CharactersManager_C_AddCharacterToParty, CharacterHardcodedName) == 0x000000, "Member 'AC_jRPG_CharactersManager_C_AddCharacterToParty::CharacterHardcodedName' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharactersManager_C_AddCharacterToParty, CallFunc_GetCustomGI_ReturnValue) == 0x000008, "Member 'AC_jRPG_CharactersManager_C_AddCharacterToParty::CallFunc_GetCustomGI_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharactersManager_C_AddCharacterToParty, K2Node_MakeStruct_S_jRPG_PartySlot) == 0x000010, "Member 'AC_jRPG_CharactersManager_C_AddCharacterToParty::K2Node_MakeStruct_S_jRPG_PartySlot' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharactersManager_C_AddCharacterToParty, CallFunc_CheckIfThereIsCharacterInParty_Success_) == 0x00001C, "Member 'AC_jRPG_CharactersManager_C_AddCharacterToParty::CallFunc_CheckIfThereIsCharacterInParty_Success_' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharactersManager_C_AddCharacterToParty, CallFunc_CheckIfThereIsCharacterInParty_SlotIndex) == 0x000020, "Member 'AC_jRPG_CharactersManager_C_AddCharacterToParty::CallFunc_CheckIfThereIsCharacterInParty_SlotIndex' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharactersManager_C_AddCharacterToParty, CallFunc_Array_Add_ReturnValue) == 0x000024, "Member 'AC_jRPG_CharactersManager_C_AddCharacterToParty::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharactersManager_C_AddCharacterToParty, CallFunc_Not_PreBool_ReturnValue) == 0x000028, "Member 'AC_jRPG_CharactersManager_C_AddCharacterToParty::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharactersManager_C_AddCharacterToParty, CallFunc_GetCustomGI_ReturnValue_1) == 0x000030, "Member 'AC_jRPG_CharactersManager_C_AddCharacterToParty::CallFunc_GetCustomGI_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharactersManager_C_AddCharacterToParty, CallFunc_GetCustomGI_ReturnValue_2) == 0x000038, "Member 'AC_jRPG_CharactersManager_C_AddCharacterToParty::CallFunc_GetCustomGI_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharactersManager_C_AddCharacterToParty, CallFunc_GetCharacterByID_CharacterData) == 0x000040, "Member 'AC_jRPG_CharactersManager_C_AddCharacterToParty::CallFunc_GetCharacterByID_CharacterData' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharactersManager_C_AddCharacterToParty, CallFunc_Array_Length_ReturnValue) == 0x000048, "Member 'AC_jRPG_CharactersManager_C_AddCharacterToParty::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharactersManager_C_AddCharacterToParty, CallFunc_IsValid_ReturnValue) == 0x00004C, "Member 'AC_jRPG_CharactersManager_C_AddCharacterToParty::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharactersManager_C_AddCharacterToParty, CallFunc_Less_IntInt_ReturnValue) == 0x00004D, "Member 'AC_jRPG_CharactersManager_C_AddCharacterToParty::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function AC_jRPG_CharactersManager.AC_jRPG_CharactersManager_C.AddNewCharacterToCollection
// 0x04B0 (0x04B0 - 0x0000)
struct AC_jRPG_CharactersManager_C_AddNewCharacterToCollection final
{
public:
	struct FS_jRPG_CharacterSaveState             CharacterSaveState;                                // 0x0000(0x01C0)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	TMap<struct FFEquipmentSlot, struct FS_jRPG_Item_StaticData> local_CharacterEquipmentPerSlot;    // 0x01C0(0x0050)(Edit, BlueprintVisible, ContainsInstancedReference)
	TMap<E_jRPG_ItemType, struct FS_jRPG_Item_StaticData> local_CharacterEquipment;                  // 0x0210(0x0050)(Edit, BlueprintVisible, ContainsInstancedReference)
	struct FS_jRPG_CharacterSaveState             local_CharacterStruct;                             // 0x0260(0x01C0)(Edit, BlueprintVisible, HasGetValueTypeHash)
	class UBP_CharacterData_C*                    CallFunc_InitCharacterData_ReturnValue;            // 0x0420(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_NameToText_ReturnValue;              // 0x0428(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0438(0x0048)(HasGetValueTypeHash)
	class UBP_jRPG_GI_Custom_C*                   CallFunc_GetCustomGI_ReturnValue;                  // 0x0480(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0488(0x0010)(ReferenceParm)
	bool                                          CallFunc_GetIsSaveLoaded_ReturnNode;               // 0x0498(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_499[0x7];                                      // 0x0499(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x04A0(0x0010)()
};
static_assert(alignof(AC_jRPG_CharactersManager_C_AddNewCharacterToCollection) == 0x000008, "Wrong alignment on AC_jRPG_CharactersManager_C_AddNewCharacterToCollection");
static_assert(sizeof(AC_jRPG_CharactersManager_C_AddNewCharacterToCollection) == 0x0004B0, "Wrong size on AC_jRPG_CharactersManager_C_AddNewCharacterToCollection");
static_assert(offsetof(AC_jRPG_CharactersManager_C_AddNewCharacterToCollection, CharacterSaveState) == 0x000000, "Member 'AC_jRPG_CharactersManager_C_AddNewCharacterToCollection::CharacterSaveState' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharactersManager_C_AddNewCharacterToCollection, local_CharacterEquipmentPerSlot) == 0x0001C0, "Member 'AC_jRPG_CharactersManager_C_AddNewCharacterToCollection::local_CharacterEquipmentPerSlot' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharactersManager_C_AddNewCharacterToCollection, local_CharacterEquipment) == 0x000210, "Member 'AC_jRPG_CharactersManager_C_AddNewCharacterToCollection::local_CharacterEquipment' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharactersManager_C_AddNewCharacterToCollection, local_CharacterStruct) == 0x000260, "Member 'AC_jRPG_CharactersManager_C_AddNewCharacterToCollection::local_CharacterStruct' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharactersManager_C_AddNewCharacterToCollection, CallFunc_InitCharacterData_ReturnValue) == 0x000420, "Member 'AC_jRPG_CharactersManager_C_AddNewCharacterToCollection::CallFunc_InitCharacterData_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharactersManager_C_AddNewCharacterToCollection, CallFunc_Conv_NameToText_ReturnValue) == 0x000428, "Member 'AC_jRPG_CharactersManager_C_AddNewCharacterToCollection::CallFunc_Conv_NameToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharactersManager_C_AddNewCharacterToCollection, K2Node_MakeStruct_FormatArgumentData) == 0x000438, "Member 'AC_jRPG_CharactersManager_C_AddNewCharacterToCollection::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharactersManager_C_AddNewCharacterToCollection, CallFunc_GetCustomGI_ReturnValue) == 0x000480, "Member 'AC_jRPG_CharactersManager_C_AddNewCharacterToCollection::CallFunc_GetCustomGI_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharactersManager_C_AddNewCharacterToCollection, K2Node_MakeArray_Array) == 0x000488, "Member 'AC_jRPG_CharactersManager_C_AddNewCharacterToCollection::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharactersManager_C_AddNewCharacterToCollection, CallFunc_GetIsSaveLoaded_ReturnNode) == 0x000498, "Member 'AC_jRPG_CharactersManager_C_AddNewCharacterToCollection::CallFunc_GetIsSaveLoaded_ReturnNode' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharactersManager_C_AddNewCharacterToCollection, CallFunc_Format_ReturnValue) == 0x0004A0, "Member 'AC_jRPG_CharactersManager_C_AddNewCharacterToCollection::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function AC_jRPG_CharactersManager.AC_jRPG_CharactersManager_C.CheckIfThereIsCharacterInParty
// 0x0060 (0x0060 - 0x0000)
struct AC_jRPG_CharactersManager_C_CheckIfThereIsCharacterInParty final
{
public:
	class FName                                   CharacterHardcodedName;                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Success_;                                          // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SlotIndex;                                         // 0x000C(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SlotIndexLOCAL;                                    // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Success_LOCAL;                                     // 0x0014(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FS_jRPG_PartySlot>              Temp_wildcard_Variable;                            // 0x0020(0x0010)(ReferenceParm)
	struct FS_jRPG_PartySlot                      CallFunc_Array_Get_Item;                           // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_jRPG_GI_Custom_C*                   CallFunc_GetCustomGI_ReturnValue;                  // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AC_jRPG_CharactersManager_C_CheckIfThereIsCharacterInParty) == 0x000008, "Wrong alignment on AC_jRPG_CharactersManager_C_CheckIfThereIsCharacterInParty");
static_assert(sizeof(AC_jRPG_CharactersManager_C_CheckIfThereIsCharacterInParty) == 0x000060, "Wrong size on AC_jRPG_CharactersManager_C_CheckIfThereIsCharacterInParty");
static_assert(offsetof(AC_jRPG_CharactersManager_C_CheckIfThereIsCharacterInParty, CharacterHardcodedName) == 0x000000, "Member 'AC_jRPG_CharactersManager_C_CheckIfThereIsCharacterInParty::CharacterHardcodedName' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharactersManager_C_CheckIfThereIsCharacterInParty, Success_) == 0x000008, "Member 'AC_jRPG_CharactersManager_C_CheckIfThereIsCharacterInParty::Success_' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharactersManager_C_CheckIfThereIsCharacterInParty, SlotIndex) == 0x00000C, "Member 'AC_jRPG_CharactersManager_C_CheckIfThereIsCharacterInParty::SlotIndex' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharactersManager_C_CheckIfThereIsCharacterInParty, SlotIndexLOCAL) == 0x000010, "Member 'AC_jRPG_CharactersManager_C_CheckIfThereIsCharacterInParty::SlotIndexLOCAL' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharactersManager_C_CheckIfThereIsCharacterInParty, Success_LOCAL) == 0x000014, "Member 'AC_jRPG_CharactersManager_C_CheckIfThereIsCharacterInParty::Success_LOCAL' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharactersManager_C_CheckIfThereIsCharacterInParty, Temp_bool_True_if_break_was_hit_Variable) == 0x000015, "Member 'AC_jRPG_CharactersManager_C_CheckIfThereIsCharacterInParty::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharactersManager_C_CheckIfThereIsCharacterInParty, Temp_int_Array_Index_Variable) == 0x000018, "Member 'AC_jRPG_CharactersManager_C_CheckIfThereIsCharacterInParty::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharactersManager_C_CheckIfThereIsCharacterInParty, CallFunc_Not_PreBool_ReturnValue) == 0x00001C, "Member 'AC_jRPG_CharactersManager_C_CheckIfThereIsCharacterInParty::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharactersManager_C_CheckIfThereIsCharacterInParty, Temp_wildcard_Variable) == 0x000020, "Member 'AC_jRPG_CharactersManager_C_CheckIfThereIsCharacterInParty::Temp_wildcard_Variable' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharactersManager_C_CheckIfThereIsCharacterInParty, CallFunc_Array_Get_Item) == 0x000030, "Member 'AC_jRPG_CharactersManager_C_CheckIfThereIsCharacterInParty::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharactersManager_C_CheckIfThereIsCharacterInParty, CallFunc_Array_Length_ReturnValue) == 0x00003C, "Member 'AC_jRPG_CharactersManager_C_CheckIfThereIsCharacterInParty::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharactersManager_C_CheckIfThereIsCharacterInParty, CallFunc_GetCustomGI_ReturnValue) == 0x000040, "Member 'AC_jRPG_CharactersManager_C_CheckIfThereIsCharacterInParty::CallFunc_GetCustomGI_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharactersManager_C_CheckIfThereIsCharacterInParty, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000048, "Member 'AC_jRPG_CharactersManager_C_CheckIfThereIsCharacterInParty::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharactersManager_C_CheckIfThereIsCharacterInParty, Temp_int_Loop_Counter_Variable) == 0x00004C, "Member 'AC_jRPG_CharactersManager_C_CheckIfThereIsCharacterInParty::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharactersManager_C_CheckIfThereIsCharacterInParty, CallFunc_Less_IntInt_ReturnValue) == 0x000050, "Member 'AC_jRPG_CharactersManager_C_CheckIfThereIsCharacterInParty::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharactersManager_C_CheckIfThereIsCharacterInParty, CallFunc_Add_IntInt_ReturnValue) == 0x000054, "Member 'AC_jRPG_CharactersManager_C_CheckIfThereIsCharacterInParty::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharactersManager_C_CheckIfThereIsCharacterInParty, CallFunc_BooleanAND_ReturnValue) == 0x000058, "Member 'AC_jRPG_CharactersManager_C_CheckIfThereIsCharacterInParty::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function AC_jRPG_CharactersManager.AC_jRPG_CharactersManager_C.ComputePartyWithExclusions
// 0x00E8 (0x00E8 - 0x0000)
struct AC_jRPG_CharactersManager_C_ComputePartyWithExclusions final
{
public:
	TArray<class FName>                           local_Party;                                       // 0x0000(0x0010)(Edit, BlueprintVisible)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FS_jRPG_PartySlot>              Temp_wildcard_Variable;                            // 0x0018(0x0010)(ReferenceParm)
	struct FS_jRPG_PartySlot                      CallFunc_Array_Get_Item;                           // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_jRPG_GI_Custom_C*                   CallFunc_GetCustomGI_ReturnValue;                  // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_jRPG_GI_Custom_C*                   CallFunc_GetCustomGI_ReturnValue_1;                // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item_1;                         // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_CharacterData_C*                    CallFunc_GetCharacterByID_CharacterData;           // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsExcluded_Excluded;                   // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_CharacterData_C*                    CallFunc_GetCharacterByID_CharacterData_1;         // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7A[0x2];                                       // 0x007A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_jRPG_GI_Custom_C*                   CallFunc_GetCustomGI_ReturnValue_2;                // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UBP_CharacterData_C*>            CallFunc_Map_Values_Values;                        // 0x0090(0x0010)(ReferenceParm)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_CharacterData_C*                    CallFunc_Array_Get_Item_2;                         // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsExcluded_Excluded_1;                 // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B2[0x2];                                       // 0x00B2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BD[0x3];                                       // 0x00BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_jRPG_GI_Custom_C*                   CallFunc_GetCustomGI_ReturnValue_3;                // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00CD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CE[0x2];                                       // 0x00CE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsNotEmpty_ReturnValue;             // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x00D5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D6[0x2];                                       // 0x00D6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AC_jRPG_CharactersManager_C_ComputePartyWithExclusions) == 0x000008, "Wrong alignment on AC_jRPG_CharactersManager_C_ComputePartyWithExclusions");
static_assert(sizeof(AC_jRPG_CharactersManager_C_ComputePartyWithExclusions) == 0x0000E8, "Wrong size on AC_jRPG_CharactersManager_C_ComputePartyWithExclusions");
static_assert(offsetof(AC_jRPG_CharactersManager_C_ComputePartyWithExclusions, local_Party) == 0x000000, "Member 'AC_jRPG_CharactersManager_C_ComputePartyWithExclusions::local_Party' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharactersManager_C_ComputePartyWithExclusions, Temp_int_Array_Index_Variable) == 0x000010, "Member 'AC_jRPG_CharactersManager_C_ComputePartyWithExclusions::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharactersManager_C_ComputePartyWithExclusions, Temp_wildcard_Variable) == 0x000018, "Member 'AC_jRPG_CharactersManager_C_ComputePartyWithExclusions::Temp_wildcard_Variable' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharactersManager_C_ComputePartyWithExclusions, CallFunc_Array_Get_Item) == 0x000028, "Member 'AC_jRPG_CharactersManager_C_ComputePartyWithExclusions::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharactersManager_C_ComputePartyWithExclusions, CallFunc_Array_Length_ReturnValue) == 0x000034, "Member 'AC_jRPG_CharactersManager_C_ComputePartyWithExclusions::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharactersManager_C_ComputePartyWithExclusions, Temp_int_Array_Index_Variable_1) == 0x000038, "Member 'AC_jRPG_CharactersManager_C_ComputePartyWithExclusions::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharactersManager_C_ComputePartyWithExclusions, Temp_int_Loop_Counter_Variable) == 0x00003C, "Member 'AC_jRPG_CharactersManager_C_ComputePartyWithExclusions::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharactersManager_C_ComputePartyWithExclusions, CallFunc_Add_IntInt_ReturnValue) == 0x000040, "Member 'AC_jRPG_CharactersManager_C_ComputePartyWithExclusions::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharactersManager_C_ComputePartyWithExclusions, Temp_int_Array_Index_Variable_2) == 0x000044, "Member 'AC_jRPG_CharactersManager_C_ComputePartyWithExclusions::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharactersManager_C_ComputePartyWithExclusions, CallFunc_GetCustomGI_ReturnValue) == 0x000048, "Member 'AC_jRPG_CharactersManager_C_ComputePartyWithExclusions::CallFunc_GetCustomGI_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharactersManager_C_ComputePartyWithExclusions, CallFunc_GetCustomGI_ReturnValue_1) == 0x000050, "Member 'AC_jRPG_CharactersManager_C_ComputePartyWithExclusions::CallFunc_GetCustomGI_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharactersManager_C_ComputePartyWithExclusions, CallFunc_Array_Get_Item_1) == 0x000058, "Member 'AC_jRPG_CharactersManager_C_ComputePartyWithExclusions::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharactersManager_C_ComputePartyWithExclusions, CallFunc_GetCharacterByID_CharacterData) == 0x000060, "Member 'AC_jRPG_CharactersManager_C_ComputePartyWithExclusions::CallFunc_GetCharacterByID_CharacterData' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharactersManager_C_ComputePartyWithExclusions, CallFunc_GetIsExcluded_Excluded) == 0x000068, "Member 'AC_jRPG_CharactersManager_C_ComputePartyWithExclusions::CallFunc_GetIsExcluded_Excluded' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharactersManager_C_ComputePartyWithExclusions, CallFunc_GetCharacterByID_CharacterData_1) == 0x000070, "Member 'AC_jRPG_CharactersManager_C_ComputePartyWithExclusions::CallFunc_GetCharacterByID_CharacterData_1' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharactersManager_C_ComputePartyWithExclusions, CallFunc_Not_PreBool_ReturnValue) == 0x000078, "Member 'AC_jRPG_CharactersManager_C_ComputePartyWithExclusions::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharactersManager_C_ComputePartyWithExclusions, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x000079, "Member 'AC_jRPG_CharactersManager_C_ComputePartyWithExclusions::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharactersManager_C_ComputePartyWithExclusions, CallFunc_Array_Length_ReturnValue_1) == 0x00007C, "Member 'AC_jRPG_CharactersManager_C_ComputePartyWithExclusions::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharactersManager_C_ComputePartyWithExclusions, CallFunc_GetCustomGI_ReturnValue_2) == 0x000080, "Member 'AC_jRPG_CharactersManager_C_ComputePartyWithExclusions::CallFunc_GetCustomGI_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharactersManager_C_ComputePartyWithExclusions, Temp_int_Loop_Counter_Variable_1) == 0x000088, "Member 'AC_jRPG_CharactersManager_C_ComputePartyWithExclusions::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharactersManager_C_ComputePartyWithExclusions, CallFunc_Map_Values_Values) == 0x000090, "Member 'AC_jRPG_CharactersManager_C_ComputePartyWithExclusions::CallFunc_Map_Values_Values' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharactersManager_C_ComputePartyWithExclusions, CallFunc_Less_IntInt_ReturnValue) == 0x0000A0, "Member 'AC_jRPG_CharactersManager_C_ComputePartyWithExclusions::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharactersManager_C_ComputePartyWithExclusions, CallFunc_Array_Get_Item_2) == 0x0000A8, "Member 'AC_jRPG_CharactersManager_C_ComputePartyWithExclusions::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharactersManager_C_ComputePartyWithExclusions, CallFunc_GetIsExcluded_Excluded_1) == 0x0000B0, "Member 'AC_jRPG_CharactersManager_C_ComputePartyWithExclusions::CallFunc_GetIsExcluded_Excluded_1' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharactersManager_C_ComputePartyWithExclusions, CallFunc_Not_PreBool_ReturnValue_1) == 0x0000B1, "Member 'AC_jRPG_CharactersManager_C_ComputePartyWithExclusions::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharactersManager_C_ComputePartyWithExclusions, CallFunc_Array_Length_ReturnValue_2) == 0x0000B4, "Member 'AC_jRPG_CharactersManager_C_ComputePartyWithExclusions::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharactersManager_C_ComputePartyWithExclusions, CallFunc_Add_IntInt_ReturnValue_1) == 0x0000B8, "Member 'AC_jRPG_CharactersManager_C_ComputePartyWithExclusions::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharactersManager_C_ComputePartyWithExclusions, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000BC, "Member 'AC_jRPG_CharactersManager_C_ComputePartyWithExclusions::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharactersManager_C_ComputePartyWithExclusions, CallFunc_GetCustomGI_ReturnValue_3) == 0x0000C0, "Member 'AC_jRPG_CharactersManager_C_ComputePartyWithExclusions::CallFunc_GetCustomGI_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharactersManager_C_ComputePartyWithExclusions, CallFunc_Array_Length_ReturnValue_3) == 0x0000C8, "Member 'AC_jRPG_CharactersManager_C_ComputePartyWithExclusions::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharactersManager_C_ComputePartyWithExclusions, CallFunc_Less_IntInt_ReturnValue_2) == 0x0000CC, "Member 'AC_jRPG_CharactersManager_C_ComputePartyWithExclusions::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharactersManager_C_ComputePartyWithExclusions, CallFunc_BooleanAND_ReturnValue) == 0x0000CD, "Member 'AC_jRPG_CharactersManager_C_ComputePartyWithExclusions::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharactersManager_C_ComputePartyWithExclusions, Temp_int_Loop_Counter_Variable_2) == 0x0000D0, "Member 'AC_jRPG_CharactersManager_C_ComputePartyWithExclusions::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharactersManager_C_ComputePartyWithExclusions, CallFunc_Array_IsNotEmpty_ReturnValue) == 0x0000D4, "Member 'AC_jRPG_CharactersManager_C_ComputePartyWithExclusions::CallFunc_Array_IsNotEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharactersManager_C_ComputePartyWithExclusions, CallFunc_Less_IntInt_ReturnValue_3) == 0x0000D5, "Member 'AC_jRPG_CharactersManager_C_ComputePartyWithExclusions::CallFunc_Less_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharactersManager_C_ComputePartyWithExclusions, CallFunc_Add_IntInt_ReturnValue_2) == 0x0000D8, "Member 'AC_jRPG_CharactersManager_C_ComputePartyWithExclusions::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharactersManager_C_ComputePartyWithExclusions, CallFunc_Array_AddUnique_ReturnValue) == 0x0000DC, "Member 'AC_jRPG_CharactersManager_C_ComputePartyWithExclusions::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharactersManager_C_ComputePartyWithExclusions, CallFunc_Array_Add_ReturnValue) == 0x0000E0, "Member 'AC_jRPG_CharactersManager_C_ComputePartyWithExclusions::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function AC_jRPG_CharactersManager.AC_jRPG_CharactersManager_C.FullHealAllCharacters
// 0x0060 (0x0060 - 0x0000)
struct AC_jRPG_CharactersManager_C_FullHealAllCharacters final
{
public:
	class UBP_CharacterData_C*                    local_characterData;                               // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_jRPG_GI_Custom_C*                   K2Node_DynamicCast_AsBP_J_RPG_GI_Custom;           // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UBP_CharacterData_C*>            CallFunc_Map_Values_Values;                        // 0x0030(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_CharacterData_C*                    CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetMaxHP_MaxHP;                           // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AC_jRPG_CharactersManager_C_FullHealAllCharacters) == 0x000008, "Wrong alignment on AC_jRPG_CharactersManager_C_FullHealAllCharacters");
static_assert(sizeof(AC_jRPG_CharactersManager_C_FullHealAllCharacters) == 0x000060, "Wrong size on AC_jRPG_CharactersManager_C_FullHealAllCharacters");
static_assert(offsetof(AC_jRPG_CharactersManager_C_FullHealAllCharacters, local_characterData) == 0x000000, "Member 'AC_jRPG_CharactersManager_C_FullHealAllCharacters::local_characterData' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharactersManager_C_FullHealAllCharacters, Temp_int_Array_Index_Variable) == 0x000008, "Member 'AC_jRPG_CharactersManager_C_FullHealAllCharacters::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharactersManager_C_FullHealAllCharacters, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'AC_jRPG_CharactersManager_C_FullHealAllCharacters::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharactersManager_C_FullHealAllCharacters, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'AC_jRPG_CharactersManager_C_FullHealAllCharacters::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharactersManager_C_FullHealAllCharacters, CallFunc_GetGameInstance_ReturnValue) == 0x000018, "Member 'AC_jRPG_CharactersManager_C_FullHealAllCharacters::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharactersManager_C_FullHealAllCharacters, K2Node_DynamicCast_AsBP_J_RPG_GI_Custom) == 0x000020, "Member 'AC_jRPG_CharactersManager_C_FullHealAllCharacters::K2Node_DynamicCast_AsBP_J_RPG_GI_Custom' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharactersManager_C_FullHealAllCharacters, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'AC_jRPG_CharactersManager_C_FullHealAllCharacters::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharactersManager_C_FullHealAllCharacters, CallFunc_Map_Values_Values) == 0x000030, "Member 'AC_jRPG_CharactersManager_C_FullHealAllCharacters::CallFunc_Map_Values_Values' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharactersManager_C_FullHealAllCharacters, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'AC_jRPG_CharactersManager_C_FullHealAllCharacters::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharactersManager_C_FullHealAllCharacters, CallFunc_Array_Get_Item) == 0x000048, "Member 'AC_jRPG_CharactersManager_C_FullHealAllCharacters::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharactersManager_C_FullHealAllCharacters, CallFunc_Less_IntInt_ReturnValue) == 0x000050, "Member 'AC_jRPG_CharactersManager_C_FullHealAllCharacters::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharactersManager_C_FullHealAllCharacters, CallFunc_GetMaxHP_MaxHP) == 0x000058, "Member 'AC_jRPG_CharactersManager_C_FullHealAllCharacters::CallFunc_GetMaxHP_MaxHP' has a wrong offset!");

// Function AC_jRPG_CharactersManager.AC_jRPG_CharactersManager_C.GetCharacterData
// 0x0020 (0x0020 - 0x0000)
struct AC_jRPG_CharactersManager_C_GetCharacterData final
{
public:
	class FName                                   CharacterId;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_CharacterData_C*                    CharacterData;                                     // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_jRPG_GI_Custom_C*                   CallFunc_GetCustomGI_ReturnValue;                  // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_CharacterData_C*                    CallFunc_GetCharacterByID_CharacterData;           // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AC_jRPG_CharactersManager_C_GetCharacterData) == 0x000008, "Wrong alignment on AC_jRPG_CharactersManager_C_GetCharacterData");
static_assert(sizeof(AC_jRPG_CharactersManager_C_GetCharacterData) == 0x000020, "Wrong size on AC_jRPG_CharactersManager_C_GetCharacterData");
static_assert(offsetof(AC_jRPG_CharactersManager_C_GetCharacterData, CharacterId) == 0x000000, "Member 'AC_jRPG_CharactersManager_C_GetCharacterData::CharacterId' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharactersManager_C_GetCharacterData, CharacterData) == 0x000008, "Member 'AC_jRPG_CharactersManager_C_GetCharacterData::CharacterData' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharactersManager_C_GetCharacterData, CallFunc_GetCustomGI_ReturnValue) == 0x000010, "Member 'AC_jRPG_CharactersManager_C_GetCharacterData::CallFunc_GetCustomGI_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharactersManager_C_GetCharacterData, CallFunc_GetCharacterByID_CharacterData) == 0x000018, "Member 'AC_jRPG_CharactersManager_C_GetCharacterData::CallFunc_GetCharacterByID_CharacterData' has a wrong offset!");

// Function AC_jRPG_CharactersManager.AC_jRPG_CharactersManager_C.InitCharacterData
// 0x0270 (0x0270 - 0x0000)
struct AC_jRPG_CharactersManager_C_InitCharacterData final
{
public:
	struct FS_jRPG_CharacterSaveState             CharacterSaveState;                                // 0x0000(0x01C0)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	class UBP_CharacterData_C*                    ReturnValue;                                       // 0x01C0(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash)
	class UBP_jRPG_GI_Custom_C*                   CallFunc_GetCustomGI_ReturnValue;                  // 0x01C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UBP_CharacterData_C* CharacterData)> K2Node_CreateDelegate_OutputDelegate;  // 0x01D0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_NameToText_ReturnValue;              // 0x01E0(0x0010)()
	class UBP_jRPG_GI_Custom_C*                   CallFunc_GetCustomGI_ReturnValue_1;                // 0x01F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x01F8(0x0048)(HasGetValueTypeHash)
	class UBP_CharacterData_C*                    CallFunc_SpawnObject_ReturnValue;                  // 0x0240(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0248(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0258(0x0010)()
	class UBP_jRPG_GI_Custom_C*                   CallFunc_GetCustomGI_ReturnValue_2;                // 0x0268(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AC_jRPG_CharactersManager_C_InitCharacterData) == 0x000008, "Wrong alignment on AC_jRPG_CharactersManager_C_InitCharacterData");
static_assert(sizeof(AC_jRPG_CharactersManager_C_InitCharacterData) == 0x000270, "Wrong size on AC_jRPG_CharactersManager_C_InitCharacterData");
static_assert(offsetof(AC_jRPG_CharactersManager_C_InitCharacterData, CharacterSaveState) == 0x000000, "Member 'AC_jRPG_CharactersManager_C_InitCharacterData::CharacterSaveState' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharactersManager_C_InitCharacterData, ReturnValue) == 0x0001C0, "Member 'AC_jRPG_CharactersManager_C_InitCharacterData::ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharactersManager_C_InitCharacterData, CallFunc_GetCustomGI_ReturnValue) == 0x0001C8, "Member 'AC_jRPG_CharactersManager_C_InitCharacterData::CallFunc_GetCustomGI_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharactersManager_C_InitCharacterData, K2Node_CreateDelegate_OutputDelegate) == 0x0001D0, "Member 'AC_jRPG_CharactersManager_C_InitCharacterData::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharactersManager_C_InitCharacterData, CallFunc_Conv_NameToText_ReturnValue) == 0x0001E0, "Member 'AC_jRPG_CharactersManager_C_InitCharacterData::CallFunc_Conv_NameToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharactersManager_C_InitCharacterData, CallFunc_GetCustomGI_ReturnValue_1) == 0x0001F0, "Member 'AC_jRPG_CharactersManager_C_InitCharacterData::CallFunc_GetCustomGI_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharactersManager_C_InitCharacterData, K2Node_MakeStruct_FormatArgumentData) == 0x0001F8, "Member 'AC_jRPG_CharactersManager_C_InitCharacterData::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharactersManager_C_InitCharacterData, CallFunc_SpawnObject_ReturnValue) == 0x000240, "Member 'AC_jRPG_CharactersManager_C_InitCharacterData::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharactersManager_C_InitCharacterData, K2Node_MakeArray_Array) == 0x000248, "Member 'AC_jRPG_CharactersManager_C_InitCharacterData::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharactersManager_C_InitCharacterData, CallFunc_Format_ReturnValue) == 0x000258, "Member 'AC_jRPG_CharactersManager_C_InitCharacterData::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharactersManager_C_InitCharacterData, CallFunc_GetCustomGI_ReturnValue_2) == 0x000268, "Member 'AC_jRPG_CharactersManager_C_InitCharacterData::CallFunc_GetCustomGI_ReturnValue_2' has a wrong offset!");

// Function AC_jRPG_CharactersManager.AC_jRPG_CharactersManager_C.LearnNewAction
// 0x0080 (0x0080 - 0x0000)
struct AC_jRPG_CharactersManager_C_LearnNewAction final
{
public:
	class FName                                   Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ActionName;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UpgradeIfAlreadyLearned;                           // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FName, int32>                      CharacterLearnedActionsLOCAL;                      // 0x0018(0x0050)(Edit, BlueprintVisible)
	bool                                          UpgradeIfExistLOCAL;                               // 0x0068(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ActionNameLOCAL;                                   // 0x006C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CharacterLOCAL;                                    // 0x0074(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AC_jRPG_CharactersManager_C_LearnNewAction) == 0x000008, "Wrong alignment on AC_jRPG_CharactersManager_C_LearnNewAction");
static_assert(sizeof(AC_jRPG_CharactersManager_C_LearnNewAction) == 0x000080, "Wrong size on AC_jRPG_CharactersManager_C_LearnNewAction");
static_assert(offsetof(AC_jRPG_CharactersManager_C_LearnNewAction, Character) == 0x000000, "Member 'AC_jRPG_CharactersManager_C_LearnNewAction::Character' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharactersManager_C_LearnNewAction, ActionName) == 0x000008, "Member 'AC_jRPG_CharactersManager_C_LearnNewAction::ActionName' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharactersManager_C_LearnNewAction, UpgradeIfAlreadyLearned) == 0x000010, "Member 'AC_jRPG_CharactersManager_C_LearnNewAction::UpgradeIfAlreadyLearned' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharactersManager_C_LearnNewAction, CharacterLearnedActionsLOCAL) == 0x000018, "Member 'AC_jRPG_CharactersManager_C_LearnNewAction::CharacterLearnedActionsLOCAL' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharactersManager_C_LearnNewAction, UpgradeIfExistLOCAL) == 0x000068, "Member 'AC_jRPG_CharactersManager_C_LearnNewAction::UpgradeIfExistLOCAL' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharactersManager_C_LearnNewAction, ActionNameLOCAL) == 0x00006C, "Member 'AC_jRPG_CharactersManager_C_LearnNewAction::ActionNameLOCAL' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharactersManager_C_LearnNewAction, CharacterLOCAL) == 0x000074, "Member 'AC_jRPG_CharactersManager_C_LearnNewAction::CharacterLOCAL' has a wrong offset!");

// Function AC_jRPG_CharactersManager.AC_jRPG_CharactersManager_C.RemoveCharacterFromCollection
// 0x0068 (0x0068 - 0x0000)
struct AC_jRPG_CharactersManager_C_RemoveCharacterFromCollection final
{
public:
	class UBP_CharacterData_C*                    CharacterData;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_jRPG_GI_Custom_C*                   CallFunc_GetCustomGI_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_jRPG_GI_Custom_C*                   CallFunc_GetCustomGI_ReturnValue_1;                // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Remove_ReturnValue;                   // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasCharacterInPartyByHardcodedName_Result; // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B[0x5];                                       // 0x001B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_jRPG_GI_Custom_C*                   CallFunc_GetCustomGI_ReturnValue_2;                // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_jRPG_GI_Custom_C*                   CallFunc_GetCustomGI_ReturnValue_3;                // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           CallFunc_Map_Keys_Keys;                            // 0x0030(0x0010)(ReferenceParm)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_jRPG_GI_Custom_C*                   CallFunc_GetCustomGI_ReturnValue_4;                // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           CallFunc_Map_Keys_Keys_1;                          // 0x0058(0x0010)(ReferenceParm)
};
static_assert(alignof(AC_jRPG_CharactersManager_C_RemoveCharacterFromCollection) == 0x000008, "Wrong alignment on AC_jRPG_CharactersManager_C_RemoveCharacterFromCollection");
static_assert(sizeof(AC_jRPG_CharactersManager_C_RemoveCharacterFromCollection) == 0x000068, "Wrong size on AC_jRPG_CharactersManager_C_RemoveCharacterFromCollection");
static_assert(offsetof(AC_jRPG_CharactersManager_C_RemoveCharacterFromCollection, CharacterData) == 0x000000, "Member 'AC_jRPG_CharactersManager_C_RemoveCharacterFromCollection::CharacterData' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharactersManager_C_RemoveCharacterFromCollection, CallFunc_GetCustomGI_ReturnValue) == 0x000008, "Member 'AC_jRPG_CharactersManager_C_RemoveCharacterFromCollection::CallFunc_GetCustomGI_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharactersManager_C_RemoveCharacterFromCollection, CallFunc_GetCustomGI_ReturnValue_1) == 0x000010, "Member 'AC_jRPG_CharactersManager_C_RemoveCharacterFromCollection::CallFunc_GetCustomGI_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharactersManager_C_RemoveCharacterFromCollection, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000018, "Member 'AC_jRPG_CharactersManager_C_RemoveCharacterFromCollection::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharactersManager_C_RemoveCharacterFromCollection, CallFunc_Map_Remove_ReturnValue) == 0x000019, "Member 'AC_jRPG_CharactersManager_C_RemoveCharacterFromCollection::CallFunc_Map_Remove_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharactersManager_C_RemoveCharacterFromCollection, CallFunc_HasCharacterInPartyByHardcodedName_Result) == 0x00001A, "Member 'AC_jRPG_CharactersManager_C_RemoveCharacterFromCollection::CallFunc_HasCharacterInPartyByHardcodedName_Result' has a wrong offset!");
