#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AC_jRPG_ActionsManager

#include "Basic.hpp"

#include "S_jRPG_Action_structs.hpp"
#include "S_jRPG_Item_StaticData_structs.hpp"
#include "E_jRPG_StatType_structs.hpp"
#include "Engine_structs.hpp"
#include "EAttackType_structs.hpp"
#include "E_jRPG_ActionType_structs.hpp"
#include "S_BalancingTableFloatEntry_structs.hpp"


namespace SDK::Params
{

// Function AC_jRPG_ActionsManager.AC_jRPG_ActionsManager_C.AreAllAlive
// 0x0030 (0x0030 - 0x0000)
struct AC_jRPG_ActionsManager_C_AreAllAlive final
{
public:
	TArray<class ABP_jRPG_Character_Battle_Base_C*> NewParam;                                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          SomeAreAlive;                                      // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_jRPG_Character_Battle_Base_C*       CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x2];                                       // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AC_jRPG_ActionsManager_C_AreAllAlive) == 0x000008, "Wrong alignment on AC_jRPG_ActionsManager_C_AreAllAlive");
static_assert(sizeof(AC_jRPG_ActionsManager_C_AreAllAlive) == 0x000030, "Wrong size on AC_jRPG_ActionsManager_C_AreAllAlive");
static_assert(offsetof(AC_jRPG_ActionsManager_C_AreAllAlive, NewParam) == 0x000000, "Member 'AC_jRPG_ActionsManager_C_AreAllAlive::NewParam' has a wrong offset!");
static_assert(offsetof(AC_jRPG_ActionsManager_C_AreAllAlive, SomeAreAlive) == 0x000010, "Member 'AC_jRPG_ActionsManager_C_AreAllAlive::SomeAreAlive' has a wrong offset!");
static_assert(offsetof(AC_jRPG_ActionsManager_C_AreAllAlive, CallFunc_Array_Length_ReturnValue) == 0x000014, "Member 'AC_jRPG_ActionsManager_C_AreAllAlive::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_ActionsManager_C_AreAllAlive, Temp_int_Array_Index_Variable) == 0x000018, "Member 'AC_jRPG_ActionsManager_C_AreAllAlive::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(AC_jRPG_ActionsManager_C_AreAllAlive, Temp_int_Loop_Counter_Variable) == 0x00001C, "Member 'AC_jRPG_ActionsManager_C_AreAllAlive::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(AC_jRPG_ActionsManager_C_AreAllAlive, CallFunc_Array_Get_Item) == 0x000020, "Member 'AC_jRPG_ActionsManager_C_AreAllAlive::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(AC_jRPG_ActionsManager_C_AreAllAlive, CallFunc_Less_IntInt_ReturnValue) == 0x000028, "Member 'AC_jRPG_ActionsManager_C_AreAllAlive::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_ActionsManager_C_AreAllAlive, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x000029, "Member 'AC_jRPG_ActionsManager_C_AreAllAlive::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_ActionsManager_C_AreAllAlive, CallFunc_Add_IntInt_ReturnValue) == 0x00002C, "Member 'AC_jRPG_ActionsManager_C_AreAllAlive::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function AC_jRPG_ActionsManager.AC_jRPG_ActionsManager_C.Attack
// 0x0090 (0x0090 - 0x0000)
struct AC_jRPG_ActionsManager_C_Attack final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAC_jRPG_BattleManager_C*               CallFunc_GetComponentByClass_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAC_jRPG_BattleManager_C*               CallFunc_GetComponentByClass_ReturnValue_1;        // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAttackType                                   CallFunc_GetBaseDamageType_ReturnValue;            // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_BalancingTableFloatEntry            CallFunc_GetDataTableRowFromName_OutRow;           // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_jRPG_Character_Battle_Base_C*       CallFunc_Array_Get_Item;                           // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IIBattleDamageSource_C> CallFunc_MakeDamageBuilder_DamageSource_CastInput; // 0x0068(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_BattleDamageBuilder_C*              CallFunc_MakeDamageBuilder_ReturnValue;            // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DealDamages_HasHit;                       // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_82[0x6];                                       // 0x0082(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_BattleDamages_C*                    CallFunc_DealDamages_BattleDamages;                // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AC_jRPG_ActionsManager_C_Attack) == 0x000008, "Wrong alignment on AC_jRPG_ActionsManager_C_Attack");
static_assert(sizeof(AC_jRPG_ActionsManager_C_Attack) == 0x000090, "Wrong size on AC_jRPG_ActionsManager_C_Attack");
static_assert(offsetof(AC_jRPG_ActionsManager_C_Attack, Temp_int_Array_Index_Variable) == 0x000000, "Member 'AC_jRPG_ActionsManager_C_Attack::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(AC_jRPG_ActionsManager_C_Attack, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'AC_jRPG_ActionsManager_C_Attack::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(AC_jRPG_ActionsManager_C_Attack, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'AC_jRPG_ActionsManager_C_Attack::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_ActionsManager_C_Attack, CallFunc_GetOwner_ReturnValue) == 0x000010, "Member 'AC_jRPG_ActionsManager_C_Attack::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_ActionsManager_C_Attack, CallFunc_GetOwner_ReturnValue_1) == 0x000018, "Member 'AC_jRPG_ActionsManager_C_Attack::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AC_jRPG_ActionsManager_C_Attack, CallFunc_GetComponentByClass_ReturnValue) == 0x000020, "Member 'AC_jRPG_ActionsManager_C_Attack::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_ActionsManager_C_Attack, CallFunc_GetComponentByClass_ReturnValue_1) == 0x000028, "Member 'AC_jRPG_ActionsManager_C_Attack::CallFunc_GetComponentByClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AC_jRPG_ActionsManager_C_Attack, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000030, "Member 'AC_jRPG_ActionsManager_C_Attack::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_ActionsManager_C_Attack, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000038, "Member 'AC_jRPG_ActionsManager_C_Attack::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_ActionsManager_C_Attack, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000040, "Member 'AC_jRPG_ActionsManager_C_Attack::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_ActionsManager_C_Attack, CallFunc_GetBaseDamageType_ReturnValue) == 0x000048, "Member 'AC_jRPG_ActionsManager_C_Attack::CallFunc_GetBaseDamageType_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_ActionsManager_C_Attack, CallFunc_GetDataTableRowFromName_OutRow) == 0x000050, "Member 'AC_jRPG_ActionsManager_C_Attack::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(AC_jRPG_ActionsManager_C_Attack, CallFunc_Array_Get_Item) == 0x000058, "Member 'AC_jRPG_ActionsManager_C_Attack::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(AC_jRPG_ActionsManager_C_Attack, CallFunc_Array_Length_ReturnValue) == 0x000060, "Member 'AC_jRPG_ActionsManager_C_Attack::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_ActionsManager_C_Attack, CallFunc_MakeDamageBuilder_DamageSource_CastInput) == 0x000068, "Member 'AC_jRPG_ActionsManager_C_Attack::CallFunc_MakeDamageBuilder_DamageSource_CastInput' has a wrong offset!");
static_assert(offsetof(AC_jRPG_ActionsManager_C_Attack, CallFunc_MakeDamageBuilder_ReturnValue) == 0x000078, "Member 'AC_jRPG_ActionsManager_C_Attack::CallFunc_MakeDamageBuilder_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_ActionsManager_C_Attack, CallFunc_Less_IntInt_ReturnValue) == 0x000080, "Member 'AC_jRPG_ActionsManager_C_Attack::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_ActionsManager_C_Attack, CallFunc_DealDamages_HasHit) == 0x000081, "Member 'AC_jRPG_ActionsManager_C_Attack::CallFunc_DealDamages_HasHit' has a wrong offset!");
static_assert(offsetof(AC_jRPG_ActionsManager_C_Attack, CallFunc_DealDamages_BattleDamages) == 0x000088, "Member 'AC_jRPG_ActionsManager_C_Attack::CallFunc_DealDamages_BattleDamages' has a wrong offset!");

// Function AC_jRPG_ActionsManager.AC_jRPG_ActionsManager_C.AttackStatCalculation
// 0x00F8 (0x00F8 - 0x0000)
struct AC_jRPG_ActionsManager_C_AttackStatCalculation final
{
public:
	double                                        Power;                                             // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CritRate;                                          // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CriticalPower;                                     // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Sharpness;                                         // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Defense;                                           // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Speed;                                             // 0x0028(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Luck;                                              // 0x0030(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        HP;                                                // 0x0038(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        AP;                                                // 0x0040(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_jRPG_StatType                               Temp_byte_Variable;                                // 0x0048(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_jRPG_StatType                               Temp_byte_Variable_1;                              // 0x0049(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_jRPG_StatType                               Temp_byte_Variable_2;                              // 0x004A(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_jRPG_StatType                               Temp_byte_Variable_3;                              // 0x004B(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_jRPG_StatType                               Temp_byte_Variable_4;                              // 0x004C(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_jRPG_StatType                               Temp_byte_Variable_5;                              // 0x004D(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_jRPG_StatType                               Temp_byte_Variable_6;                              // 0x004E(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F[0x1];                                       // 0x004F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAC_jRPG_BattleManager_C*               CallFunc_GetComponentByClass_ReturnValue;          // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	E_jRPG_StatType                               Temp_byte_Variable_7;                              // 0x0060(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_jRPG_StatType                               Temp_byte_Variable_8;                              // 0x0061(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62[0x6];                                       // 0x0062(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Map_Find_Value;                           // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Map_Find_Value_1;                         // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_1;                   // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Map_Find_Value_2;                         // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_2;                   // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Map_Find_Value_3;                         // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_3;                   // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Map_Find_Value_4;                         // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_4;                   // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Map_Find_Value_5;                         // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_5;                   // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Map_Find_Value_6;                         // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_6;                   // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Map_Find_Value_7;                         // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_7;                   // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Map_Find_Value_8;                         // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_8;                   // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AC_jRPG_ActionsManager_C_AttackStatCalculation) == 0x000008, "Wrong alignment on AC_jRPG_ActionsManager_C_AttackStatCalculation");
static_assert(sizeof(AC_jRPG_ActionsManager_C_AttackStatCalculation) == 0x0000F8, "Wrong size on AC_jRPG_ActionsManager_C_AttackStatCalculation");
static_assert(offsetof(AC_jRPG_ActionsManager_C_AttackStatCalculation, Power) == 0x000000, "Member 'AC_jRPG_ActionsManager_C_AttackStatCalculation::Power' has a wrong offset!");
static_assert(offsetof(AC_jRPG_ActionsManager_C_AttackStatCalculation, CritRate) == 0x000008, "Member 'AC_jRPG_ActionsManager_C_AttackStatCalculation::CritRate' has a wrong offset!");
static_assert(offsetof(AC_jRPG_ActionsManager_C_AttackStatCalculation, CriticalPower) == 0x000010, "Member 'AC_jRPG_ActionsManager_C_AttackStatCalculation::CriticalPower' has a wrong offset!");
static_assert(offsetof(AC_jRPG_ActionsManager_C_AttackStatCalculation, Sharpness) == 0x000018, "Member 'AC_jRPG_ActionsManager_C_AttackStatCalculation::Sharpness' has a wrong offset!");
static_assert(offsetof(AC_jRPG_ActionsManager_C_AttackStatCalculation, Defense) == 0x000020, "Member 'AC_jRPG_ActionsManager_C_AttackStatCalculation::Defense' has a wrong offset!");
static_assert(offsetof(AC_jRPG_ActionsManager_C_AttackStatCalculation, Speed) == 0x000028, "Member 'AC_jRPG_ActionsManager_C_AttackStatCalculation::Speed' has a wrong offset!");
static_assert(offsetof(AC_jRPG_ActionsManager_C_AttackStatCalculation, Luck) == 0x000030, "Member 'AC_jRPG_ActionsManager_C_AttackStatCalculation::Luck' has a wrong offset!");
static_assert(offsetof(AC_jRPG_ActionsManager_C_AttackStatCalculation, HP) == 0x000038, "Member 'AC_jRPG_ActionsManager_C_AttackStatCalculation::HP' has a wrong offset!");
static_assert(offsetof(AC_jRPG_ActionsManager_C_AttackStatCalculation, AP) == 0x000040, "Member 'AC_jRPG_ActionsManager_C_AttackStatCalculation::AP' has a wrong offset!");
static_assert(offsetof(AC_jRPG_ActionsManager_C_AttackStatCalculation, Temp_byte_Variable) == 0x000048, "Member 'AC_jRPG_ActionsManager_C_AttackStatCalculation::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AC_jRPG_ActionsManager_C_AttackStatCalculation, Temp_byte_Variable_1) == 0x000049, "Member 'AC_jRPG_ActionsManager_C_AttackStatCalculation::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(AC_jRPG_ActionsManager_C_AttackStatCalculation, Temp_byte_Variable_2) == 0x00004A, "Member 'AC_jRPG_ActionsManager_C_AttackStatCalculation::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(AC_jRPG_ActionsManager_C_AttackStatCalculation, Temp_byte_Variable_3) == 0x00004B, "Member 'AC_jRPG_ActionsManager_C_AttackStatCalculation::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(AC_jRPG_ActionsManager_C_AttackStatCalculation, Temp_byte_Variable_4) == 0x00004C, "Member 'AC_jRPG_ActionsManager_C_AttackStatCalculation::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(AC_jRPG_ActionsManager_C_AttackStatCalculation, Temp_byte_Variable_5) == 0x00004D, "Member 'AC_jRPG_ActionsManager_C_AttackStatCalculation::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(AC_jRPG_ActionsManager_C_AttackStatCalculation, Temp_byte_Variable_6) == 0x00004E, "Member 'AC_jRPG_ActionsManager_C_AttackStatCalculation::Temp_byte_Variable_6' has a wrong offset!");
static_assert(offsetof(AC_jRPG_ActionsManager_C_AttackStatCalculation, CallFunc_GetOwner_ReturnValue) == 0x000050, "Member 'AC_jRPG_ActionsManager_C_AttackStatCalculation::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_ActionsManager_C_AttackStatCalculation, CallFunc_GetComponentByClass_ReturnValue) == 0x000058, "Member 'AC_jRPG_ActionsManager_C_AttackStatCalculation::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_ActionsManager_C_AttackStatCalculation, Temp_byte_Variable_7) == 0x000060, "Member 'AC_jRPG_ActionsManager_C_AttackStatCalculation::Temp_byte_Variable_7' has a wrong offset!");
static_assert(offsetof(AC_jRPG_ActionsManager_C_AttackStatCalculation, Temp_byte_Variable_8) == 0x000061, "Member 'AC_jRPG_ActionsManager_C_AttackStatCalculation::Temp_byte_Variable_8' has a wrong offset!");
static_assert(offsetof(AC_jRPG_ActionsManager_C_AttackStatCalculation, CallFunc_Map_Find_Value) == 0x000068, "Member 'AC_jRPG_ActionsManager_C_AttackStatCalculation::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(AC_jRPG_ActionsManager_C_AttackStatCalculation, CallFunc_Map_Find_ReturnValue) == 0x000070, "Member 'AC_jRPG_ActionsManager_C_AttackStatCalculation::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_ActionsManager_C_AttackStatCalculation, CallFunc_Map_Find_Value_1) == 0x000078, "Member 'AC_jRPG_ActionsManager_C_AttackStatCalculation::CallFunc_Map_Find_Value_1' has a wrong offset!");
static_assert(offsetof(AC_jRPG_ActionsManager_C_AttackStatCalculation, CallFunc_Map_Find_ReturnValue_1) == 0x000080, "Member 'AC_jRPG_ActionsManager_C_AttackStatCalculation::CallFunc_Map_Find_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AC_jRPG_ActionsManager_C_AttackStatCalculation, CallFunc_Map_Find_Value_2) == 0x000088, "Member 'AC_jRPG_ActionsManager_C_AttackStatCalculation::CallFunc_Map_Find_Value_2' has a wrong offset!");
static_assert(offsetof(AC_jRPG_ActionsManager_C_AttackStatCalculation, CallFunc_Map_Find_ReturnValue_2) == 0x000090, "Member 'AC_jRPG_ActionsManager_C_AttackStatCalculation::CallFunc_Map_Find_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AC_jRPG_ActionsManager_C_AttackStatCalculation, CallFunc_Map_Find_Value_3) == 0x000098, "Member 'AC_jRPG_ActionsManager_C_AttackStatCalculation::CallFunc_Map_Find_Value_3' has a wrong offset!");
static_assert(offsetof(AC_jRPG_ActionsManager_C_AttackStatCalculation, CallFunc_Map_Find_ReturnValue_3) == 0x0000A0, "Member 'AC_jRPG_ActionsManager_C_AttackStatCalculation::CallFunc_Map_Find_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(AC_jRPG_ActionsManager_C_AttackStatCalculation, CallFunc_Map_Find_Value_4) == 0x0000A8, "Member 'AC_jRPG_ActionsManager_C_AttackStatCalculation::CallFunc_Map_Find_Value_4' has a wrong offset!");
static_assert(offsetof(AC_jRPG_ActionsManager_C_AttackStatCalculation, CallFunc_Map_Find_ReturnValue_4) == 0x0000B0, "Member 'AC_jRPG_ActionsManager_C_AttackStatCalculation::CallFunc_Map_Find_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(AC_jRPG_ActionsManager_C_AttackStatCalculation, CallFunc_Map_Find_Value_5) == 0x0000B8, "Member 'AC_jRPG_ActionsManager_C_AttackStatCalculation::CallFunc_Map_Find_Value_5' has a wrong offset!");
static_assert(offsetof(AC_jRPG_ActionsManager_C_AttackStatCalculation, CallFunc_Map_Find_ReturnValue_5) == 0x0000C0, "Member 'AC_jRPG_ActionsManager_C_AttackStatCalculation::CallFunc_Map_Find_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(AC_jRPG_ActionsManager_C_AttackStatCalculation, CallFunc_Map_Find_Value_6) == 0x0000C8, "Member 'AC_jRPG_ActionsManager_C_AttackStatCalculation::CallFunc_Map_Find_Value_6' has a wrong offset!");
static_assert(offsetof(AC_jRPG_ActionsManager_C_AttackStatCalculation, CallFunc_Map_Find_ReturnValue_6) == 0x0000D0, "Member 'AC_jRPG_ActionsManager_C_AttackStatCalculation::CallFunc_Map_Find_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(AC_jRPG_ActionsManager_C_AttackStatCalculation, CallFunc_Map_Find_Value_7) == 0x0000D8, "Member 'AC_jRPG_ActionsManager_C_AttackStatCalculation::CallFunc_Map_Find_Value_7' has a wrong offset!");
static_assert(offsetof(AC_jRPG_ActionsManager_C_AttackStatCalculation, CallFunc_Map_Find_ReturnValue_7) == 0x0000E0, "Member 'AC_jRPG_ActionsManager_C_AttackStatCalculation::CallFunc_Map_Find_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(AC_jRPG_ActionsManager_C_AttackStatCalculation, CallFunc_Map_Find_Value_8) == 0x0000E8, "Member 'AC_jRPG_ActionsManager_C_AttackStatCalculation::CallFunc_Map_Find_Value_8' has a wrong offset!");
static_assert(offsetof(AC_jRPG_ActionsManager_C_AttackStatCalculation, CallFunc_Map_Find_ReturnValue_8) == 0x0000F0, "Member 'AC_jRPG_ActionsManager_C_AttackStatCalculation::CallFunc_Map_Find_ReturnValue_8' has a wrong offset!");

// Function AC_jRPG_ActionsManager.AC_jRPG_ActionsManager_C.AttackStatCalculation_WithPerfection
// 0x00A0 (0x00A0 - 0x0000)
struct AC_jRPG_ActionsManager_C_AttackStatCalculation_WithPerfection final
{
public:
	double                                        Power;                                             // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CritRate;                                          // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CriticalPower;                                     // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Sharpness;                                         // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_AttackStatCalculation_Power;              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_AttackStatCalculation_CritRate;           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_AttackStatCalculation_CriticalPower;      // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_AttackStatCalculation_Sharpness;          // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_AttackStatCalculation_Defense;            // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_AttackStatCalculation_Speed;              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_AttackStatCalculation_Luck;               // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_AttackStatCalculation_HP;                 // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_AttackStatCalculation_AP;                 // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAC_jRPG_BattleManager_C*               CallFunc_GetComponentByClass_ReturnValue;          // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UBP_PerfectionMechanicComponent_C*      CallFunc_GetComponentByClass_ReturnValue_1;        // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_IntFloat_ReturnValue;            // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AC_jRPG_ActionsManager_C_AttackStatCalculation_WithPerfection) == 0x000008, "Wrong alignment on AC_jRPG_ActionsManager_C_AttackStatCalculation_WithPerfection");
static_assert(sizeof(AC_jRPG_ActionsManager_C_AttackStatCalculation_WithPerfection) == 0x0000A0, "Wrong size on AC_jRPG_ActionsManager_C_AttackStatCalculation_WithPerfection");
static_assert(offsetof(AC_jRPG_ActionsManager_C_AttackStatCalculation_WithPerfection, Power) == 0x000000, "Member 'AC_jRPG_ActionsManager_C_AttackStatCalculation_WithPerfection::Power' has a wrong offset!");
static_assert(offsetof(AC_jRPG_ActionsManager_C_AttackStatCalculation_WithPerfection, CritRate) == 0x000008, "Member 'AC_jRPG_ActionsManager_C_AttackStatCalculation_WithPerfection::CritRate' has a wrong offset!");
static_assert(offsetof(AC_jRPG_ActionsManager_C_AttackStatCalculation_WithPerfection, CriticalPower) == 0x000010, "Member 'AC_jRPG_ActionsManager_C_AttackStatCalculation_WithPerfection::CriticalPower' has a wrong offset!");
static_assert(offsetof(AC_jRPG_ActionsManager_C_AttackStatCalculation_WithPerfection, Sharpness) == 0x000018, "Member 'AC_jRPG_ActionsManager_C_AttackStatCalculation_WithPerfection::Sharpness' has a wrong offset!");
static_assert(offsetof(AC_jRPG_ActionsManager_C_AttackStatCalculation_WithPerfection, CallFunc_GetOwner_ReturnValue) == 0x000020, "Member 'AC_jRPG_ActionsManager_C_AttackStatCalculation_WithPerfection::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_ActionsManager_C_AttackStatCalculation_WithPerfection, CallFunc_AttackStatCalculation_Power) == 0x000028, "Member 'AC_jRPG_ActionsManager_C_AttackStatCalculation_WithPerfection::CallFunc_AttackStatCalculation_Power' has a wrong offset!");
static_assert(offsetof(AC_jRPG_ActionsManager_C_AttackStatCalculation_WithPerfection, CallFunc_AttackStatCalculation_CritRate) == 0x000030, "Member 'AC_jRPG_ActionsManager_C_AttackStatCalculation_WithPerfection::CallFunc_AttackStatCalculation_CritRate' has a wrong offset!");
static_assert(offsetof(AC_jRPG_ActionsManager_C_AttackStatCalculation_WithPerfection, CallFunc_AttackStatCalculation_CriticalPower) == 0x000038, "Member 'AC_jRPG_ActionsManager_C_AttackStatCalculation_WithPerfection::CallFunc_AttackStatCalculation_CriticalPower' has a wrong offset!");
static_assert(offsetof(AC_jRPG_ActionsManager_C_AttackStatCalculation_WithPerfection, CallFunc_AttackStatCalculation_Sharpness) == 0x000040, "Member 'AC_jRPG_ActionsManager_C_AttackStatCalculation_WithPerfection::CallFunc_AttackStatCalculation_Sharpness' has a wrong offset!");
static_assert(offsetof(AC_jRPG_ActionsManager_C_AttackStatCalculation_WithPerfection, CallFunc_AttackStatCalculation_Defense) == 0x000048, "Member 'AC_jRPG_ActionsManager_C_AttackStatCalculation_WithPerfection::CallFunc_AttackStatCalculation_Defense' has a wrong offset!");
static_assert(offsetof(AC_jRPG_ActionsManager_C_AttackStatCalculation_WithPerfection, CallFunc_AttackStatCalculation_Speed) == 0x000050, "Member 'AC_jRPG_ActionsManager_C_AttackStatCalculation_WithPerfection::CallFunc_AttackStatCalculation_Speed' has a wrong offset!");
static_assert(offsetof(AC_jRPG_ActionsManager_C_AttackStatCalculation_WithPerfection, CallFunc_AttackStatCalculation_Luck) == 0x000058, "Member 'AC_jRPG_ActionsManager_C_AttackStatCalculation_WithPerfection::CallFunc_AttackStatCalculation_Luck' has a wrong offset!");
static_assert(offsetof(AC_jRPG_ActionsManager_C_AttackStatCalculation_WithPerfection, CallFunc_AttackStatCalculation_HP) == 0x000060, "Member 'AC_jRPG_ActionsManager_C_AttackStatCalculation_WithPerfection::CallFunc_AttackStatCalculation_HP' has a wrong offset!");
static_assert(offsetof(AC_jRPG_ActionsManager_C_AttackStatCalculation_WithPerfection, CallFunc_AttackStatCalculation_AP) == 0x000068, "Member 'AC_jRPG_ActionsManager_C_AttackStatCalculation_WithPerfection::CallFunc_AttackStatCalculation_AP' has a wrong offset!");
static_assert(offsetof(AC_jRPG_ActionsManager_C_AttackStatCalculation_WithPerfection, CallFunc_GetComponentByClass_ReturnValue) == 0x000070, "Member 'AC_jRPG_ActionsManager_C_AttackStatCalculation_WithPerfection::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_ActionsManager_C_AttackStatCalculation_WithPerfection, CallFunc_GetComponentByClass_ReturnValue_1) == 0x000078, "Member 'AC_jRPG_ActionsManager_C_AttackStatCalculation_WithPerfection::CallFunc_GetComponentByClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AC_jRPG_ActionsManager_C_AttackStatCalculation_WithPerfection, CallFunc_Multiply_IntFloat_ReturnValue) == 0x000080, "Member 'AC_jRPG_ActionsManager_C_AttackStatCalculation_WithPerfection::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_ActionsManager_C_AttackStatCalculation_WithPerfection, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000088, "Member 'AC_jRPG_ActionsManager_C_AttackStatCalculation_WithPerfection::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_ActionsManager_C_AttackStatCalculation_WithPerfection, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000090, "Member 'AC_jRPG_ActionsManager_C_AttackStatCalculation_WithPerfection::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_ActionsManager_C_AttackStatCalculation_WithPerfection, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000098, "Member 'AC_jRPG_ActionsManager_C_AttackStatCalculation_WithPerfection::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");

// Function AC_jRPG_ActionsManager.AC_jRPG_ActionsManager_C.CallFunctionByName
// 0x0018 (0x0018 - 0x0000)
struct AC_jRPG_ActionsManager_C_CallFunctionByName final
{
public:
	class FString                                 FunctionName;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0010(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AC_jRPG_ActionsManager_C_CallFunctionByName) == 0x000008, "Wrong alignment on AC_jRPG_ActionsManager_C_CallFunctionByName");
static_assert(sizeof(AC_jRPG_ActionsManager_C_CallFunctionByName) == 0x000018, "Wrong size on AC_jRPG_ActionsManager_C_CallFunctionByName");
static_assert(offsetof(AC_jRPG_ActionsManager_C_CallFunctionByName, FunctionName) == 0x000000, "Member 'AC_jRPG_ActionsManager_C_CallFunctionByName::FunctionName' has a wrong offset!");
static_assert(offsetof(AC_jRPG_ActionsManager_C_CallFunctionByName, CallFunc_K2_SetTimer_ReturnValue) == 0x000010, "Member 'AC_jRPG_ActionsManager_C_CallFunctionByName::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");

// Function AC_jRPG_ActionsManager.AC_jRPG_ActionsManager_C.CheckTargetBuff
// 0x0030 (0x0030 - 0x0000)
struct AC_jRPG_ActionsManager_C_CheckTargetBuff final
{
public:
	class UAC_jRPG_CharacterBattleStats_C*        Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, InstancedReference, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Buff;                                              // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          HasBuff;                                           // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UBP_BattleBuffInstanceWrapper_C*> CallFunc_GetActiveBuffsByClass_ActiveBuffInstanceWrappers; // 0x0018(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AC_jRPG_ActionsManager_C_CheckTargetBuff) == 0x000008, "Wrong alignment on AC_jRPG_ActionsManager_C_CheckTargetBuff");
static_assert(sizeof(AC_jRPG_ActionsManager_C_CheckTargetBuff) == 0x000030, "Wrong size on AC_jRPG_ActionsManager_C_CheckTargetBuff");
static_assert(offsetof(AC_jRPG_ActionsManager_C_CheckTargetBuff, Target) == 0x000000, "Member 'AC_jRPG_ActionsManager_C_CheckTargetBuff::Target' has a wrong offset!");
static_assert(offsetof(AC_jRPG_ActionsManager_C_CheckTargetBuff, Buff) == 0x000008, "Member 'AC_jRPG_ActionsManager_C_CheckTargetBuff::Buff' has a wrong offset!");
static_assert(offsetof(AC_jRPG_ActionsManager_C_CheckTargetBuff, HasBuff) == 0x000010, "Member 'AC_jRPG_ActionsManager_C_CheckTargetBuff::HasBuff' has a wrong offset!");
static_assert(offsetof(AC_jRPG_ActionsManager_C_CheckTargetBuff, CallFunc_GetActiveBuffsByClass_ActiveBuffInstanceWrappers) == 0x000018, "Member 'AC_jRPG_ActionsManager_C_CheckTargetBuff::CallFunc_GetActiveBuffsByClass_ActiveBuffInstanceWrappers' has a wrong offset!");
static_assert(offsetof(AC_jRPG_ActionsManager_C_CheckTargetBuff, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'AC_jRPG_ActionsManager_C_CheckTargetBuff::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_ActionsManager_C_CheckTargetBuff, CallFunc_Greater_IntInt_ReturnValue) == 0x00002C, "Member 'AC_jRPG_ActionsManager_C_CheckTargetBuff::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

// Function AC_jRPG_ActionsManager.AC_jRPG_ActionsManager_C.Defend
// 0x00B8 (0x00B8 - 0x0000)
struct AC_jRPG_ActionsManager_C_Defend final
{
public:
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAC_jRPG_BattleManager_C*               CallFunc_GetComponentByClass_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAC_jRPG_BattleManager_C*               CallFunc_GetComponentByClass_ReturnValue_1;        // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_2;                   // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAC_jRPG_BattleManager_C*               CallFunc_GetComponentByClass_ReturnValue_2;        // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAC_jRPG_CharacterBattleStats_C*        CallFunc_GetComponentByClass_ReturnValue_3;        // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_On_Action_Finished_HasMoreActions;        // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0040(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0088(0x0010)(ReferenceParm)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_3;                   // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00A0(0x0010)()
	class UAC_jRPG_BattleManager_C*               CallFunc_GetComponentByClass_ReturnValue_4;        // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AC_jRPG_ActionsManager_C_Defend) == 0x000008, "Wrong alignment on AC_jRPG_ActionsManager_C_Defend");
static_assert(sizeof(AC_jRPG_ActionsManager_C_Defend) == 0x0000B8, "Wrong size on AC_jRPG_ActionsManager_C_Defend");
static_assert(offsetof(AC_jRPG_ActionsManager_C_Defend, CallFunc_GetOwner_ReturnValue) == 0x000000, "Member 'AC_jRPG_ActionsManager_C_Defend::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_ActionsManager_C_Defend, CallFunc_GetOwner_ReturnValue_1) == 0x000008, "Member 'AC_jRPG_ActionsManager_C_Defend::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AC_jRPG_ActionsManager_C_Defend, CallFunc_GetComponentByClass_ReturnValue) == 0x000010, "Member 'AC_jRPG_ActionsManager_C_Defend::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_ActionsManager_C_Defend, CallFunc_GetComponentByClass_ReturnValue_1) == 0x000018, "Member 'AC_jRPG_ActionsManager_C_Defend::CallFunc_GetComponentByClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AC_jRPG_ActionsManager_C_Defend, CallFunc_GetOwner_ReturnValue_2) == 0x000020, "Member 'AC_jRPG_ActionsManager_C_Defend::CallFunc_GetOwner_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AC_jRPG_ActionsManager_C_Defend, CallFunc_GetComponentByClass_ReturnValue_2) == 0x000028, "Member 'AC_jRPG_ActionsManager_C_Defend::CallFunc_GetComponentByClass_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AC_jRPG_ActionsManager_C_Defend, CallFunc_GetComponentByClass_ReturnValue_3) == 0x000030, "Member 'AC_jRPG_ActionsManager_C_Defend::CallFunc_GetComponentByClass_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(AC_jRPG_ActionsManager_C_Defend, CallFunc_On_Action_Finished_HasMoreActions) == 0x000038, "Member 'AC_jRPG_ActionsManager_C_Defend::CallFunc_On_Action_Finished_HasMoreActions' has a wrong offset!");
static_assert(offsetof(AC_jRPG_ActionsManager_C_Defend, K2Node_MakeStruct_FormatArgumentData) == 0x000040, "Member 'AC_jRPG_ActionsManager_C_Defend::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(AC_jRPG_ActionsManager_C_Defend, K2Node_MakeArray_Array) == 0x000088, "Member 'AC_jRPG_ActionsManager_C_Defend::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(AC_jRPG_ActionsManager_C_Defend, CallFunc_GetOwner_ReturnValue_3) == 0x000098, "Member 'AC_jRPG_ActionsManager_C_Defend::CallFunc_GetOwner_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(AC_jRPG_ActionsManager_C_Defend, CallFunc_Format_ReturnValue) == 0x0000A0, "Member 'AC_jRPG_ActionsManager_C_Defend::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_ActionsManager_C_Defend, CallFunc_GetComponentByClass_ReturnValue_4) == 0x0000B0, "Member 'AC_jRPG_ActionsManager_C_Defend::CallFunc_GetComponentByClass_ReturnValue_4' has a wrong offset!");

// Function AC_jRPG_ActionsManager.AC_jRPG_ActionsManager_C.ExecuteUbergraph_AC_jRPG_ActionsManager
// 0x0560 (0x0560 - 0x0000)
struct AC_jRPG_ActionsManager_C_ExecuteUbergraph_AC_jRPG_ActionsManager final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAC_jRPG_BattleManager_C*               CallFunc_GetComponentByClass_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAC_jRPG_BattleManager_C*               CallFunc_GetComponentByClass_ReturnValue_1;        // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_2;                   // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAC_jRPG_TargetingManager_C*            CallFunc_GetComponentByClass_ReturnValue_2;        // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_3;                   // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_4;                   // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAC_jRPG_BattleManager_C*               CallFunc_GetComponentByClass_ReturnValue_3;        // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAC_jRPG_TargetingManager_C*            CallFunc_GetComponentByClass_ReturnValue_4;        // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_ItemUpgradeSystem_C*                CallFunc_GetItemUpgradeSystem_ReturnValue;         // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_5;                   // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAC_jRPG_BattleManager_C*               CallFunc_GetComponentByClass_ReturnValue_5;        // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ABP_jRPG_Character_Battle_Base_C*       CallFunc_Array_Get_Item;                           // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_6;                   // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_BattleBuff_Flee_C*                  CallFunc_SpawnObject_ReturnValue;                  // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAC_jRPG_BattleManager_C*               CallFunc_GetComponentByClass_ReturnValue_6;        // 0x0098(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ActivateBuff_Success;                     // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_7;                   // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_8;                   // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAC_jRPG_BattleManager_C*               CallFunc_GetComponentByClass_ReturnValue_7;        // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAC_jRPG_BattleManager_C*               CallFunc_GetComponentByClass_ReturnValue_8;        // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FS_jRPG_Item_StaticData                CallFunc_GetDataTableRowFromName_OutRow;           // 0x00D0(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_201[0x7];                                      // 0x0201(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_DataAsset_Skill_C*                  CallFunc_FindEquippedSkillByID_Skill;              // 0x0208(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_9;                   // 0x0210(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_10;                  // 0x0218(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAC_jRPG_BattleManager_C*               CallFunc_GetComponentByClass_ReturnValue_9;        // 0x0220(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAC_jRPG_BattleManager_C*               CallFunc_GetComponentByClass_ReturnValue_10;       // 0x0228(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayerTeamCharacter_IsPlayerTeam;       // 0x0231(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_232[0x6];                                      // 0x0232(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_11;                  // 0x0238(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAC_jRPG_BattleManager_C*               CallFunc_GetComponentByClass_ReturnValue_11;       // 0x0240(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_12;                  // 0x0248(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAC_jRPG_BattleManager_C*               CallFunc_GetComponentByClass_ReturnValue_12;       // 0x0250(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_259[0x7];                                      // 0x0259(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_13;                  // 0x0260(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_14;                  // 0x0268(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAC_jRPG_BattleManager_C*               CallFunc_GetComponentByClass_ReturnValue_13;       // 0x0270(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAC_jRPG_BattleManager_C*               CallFunc_GetComponentByClass_ReturnValue_14;       // 0x0278(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_281[0x7];                                      // 0x0281(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_15;                  // 0x0288(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
