#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AC_jRPG_TargetingManager

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "S_BlockedActionFeedback_structs.hpp"
#include "E_jRPG_TargetingType_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function AC_jRPG_TargetingManager.AC_jRPG_TargetingManager_C.AddSingleCharacterTargetingGroup
// 0x0038 (0x0038 - 0x0000)
struct AC_jRPG_TargetingManager_C_AddSingleCharacterTargetingGroup final
{
public:
	class ABP_jRPG_Character_Battle_Base_C*       Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UBP_TargetingGroup_C*>           TargetGroups_0;                                    // 0x0008(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UBP_TargetingGroup_C*                   TargetingGroup;                                    // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TArray<class ABP_jRPG_Character_Battle_Base_C*> K2Node_MakeArray_Array;                          // 0x0020(0x0010)(ReferenceParm)
	class UBP_TargetingGroup_C*                   CallFunc_AddTargetingGroup_TargetingGroup;         // 0x0030(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(AC_jRPG_TargetingManager_C_AddSingleCharacterTargetingGroup) == 0x000008, "Wrong alignment on AC_jRPG_TargetingManager_C_AddSingleCharacterTargetingGroup");
static_assert(sizeof(AC_jRPG_TargetingManager_C_AddSingleCharacterTargetingGroup) == 0x000038, "Wrong size on AC_jRPG_TargetingManager_C_AddSingleCharacterTargetingGroup");
static_assert(offsetof(AC_jRPG_TargetingManager_C_AddSingleCharacterTargetingGroup, Character) == 0x000000, "Member 'AC_jRPG_TargetingManager_C_AddSingleCharacterTargetingGroup::Character' has a wrong offset!");
static_assert(offsetof(AC_jRPG_TargetingManager_C_AddSingleCharacterTargetingGroup, TargetGroups_0) == 0x000008, "Member 'AC_jRPG_TargetingManager_C_AddSingleCharacterTargetingGroup::TargetGroups_0' has a wrong offset!");
static_assert(offsetof(AC_jRPG_TargetingManager_C_AddSingleCharacterTargetingGroup, TargetingGroup) == 0x000018, "Member 'AC_jRPG_TargetingManager_C_AddSingleCharacterTargetingGroup::TargetingGroup' has a wrong offset!");
static_assert(offsetof(AC_jRPG_TargetingManager_C_AddSingleCharacterTargetingGroup, K2Node_MakeArray_Array) == 0x000020, "Member 'AC_jRPG_TargetingManager_C_AddSingleCharacterTargetingGroup::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(AC_jRPG_TargetingManager_C_AddSingleCharacterTargetingGroup, CallFunc_AddTargetingGroup_TargetingGroup) == 0x000030, "Member 'AC_jRPG_TargetingManager_C_AddSingleCharacterTargetingGroup::CallFunc_AddTargetingGroup_TargetingGroup' has a wrong offset!");

// Function AC_jRPG_TargetingManager.AC_jRPG_TargetingManager_C.AddTargetingGroup
// 0x0040 (0x0040 - 0x0000)
struct AC_jRPG_TargetingManager_C_AddTargetingGroup final
{
public:
	TArray<class ABP_jRPG_Character_Battle_Base_C*> Characters;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<class UBP_TargetingGroup_C*>           TargetGroups_0;                                    // 0x0010(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UBP_TargetingGroup_C*                   TargetingGroup;                                    // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAC_jRPG_BattleManager_C*               CallFunc_GetBattleManager_ReturnValue;             // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UBP_TargetingGroup_C*                   CallFunc_SpawnObject_ReturnValue;                  // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AC_jRPG_TargetingManager_C_AddTargetingGroup) == 0x000008, "Wrong alignment on AC_jRPG_TargetingManager_C_AddTargetingGroup");
static_assert(sizeof(AC_jRPG_TargetingManager_C_AddTargetingGroup) == 0x000040, "Wrong size on AC_jRPG_TargetingManager_C_AddTargetingGroup");
static_assert(offsetof(AC_jRPG_TargetingManager_C_AddTargetingGroup, Characters) == 0x000000, "Member 'AC_jRPG_TargetingManager_C_AddTargetingGroup::Characters' has a wrong offset!");
static_assert(offsetof(AC_jRPG_TargetingManager_C_AddTargetingGroup, TargetGroups_0) == 0x000010, "Member 'AC_jRPG_TargetingManager_C_AddTargetingGroup::TargetGroups_0' has a wrong offset!");
static_assert(offsetof(AC_jRPG_TargetingManager_C_AddTargetingGroup, TargetingGroup) == 0x000020, "Member 'AC_jRPG_TargetingManager_C_AddTargetingGroup::TargetingGroup' has a wrong offset!");
static_assert(offsetof(AC_jRPG_TargetingManager_C_AddTargetingGroup, CallFunc_GetBattleManager_ReturnValue) == 0x000028, "Member 'AC_jRPG_TargetingManager_C_AddTargetingGroup::CallFunc_GetBattleManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_TargetingManager_C_AddTargetingGroup, CallFunc_SpawnObject_ReturnValue) == 0x000030, "Member 'AC_jRPG_TargetingManager_C_AddTargetingGroup::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_TargetingManager_C_AddTargetingGroup, CallFunc_Array_Add_ReturnValue) == 0x000038, "Member 'AC_jRPG_TargetingManager_C_AddTargetingGroup::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function AC_jRPG_TargetingManager.AC_jRPG_TargetingManager_C.CancelTargeting
// 0x0028 (0x0028 - 0x0000)
struct AC_jRPG_TargetingManager_C_CancelTargeting final
{
public:
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAC_jRPG_BattleManager_C*               CallFunc_GetComponentByClass_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ABP_jRPG_Character_Battle_Base_C*       CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAC_jRPG_DynamicCameraManager_C*        CallFunc_GetComponentByClass_ReturnValue_1;        // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AC_jRPG_TargetingManager_C_CancelTargeting) == 0x000008, "Wrong alignment on AC_jRPG_TargetingManager_C_CancelTargeting");
static_assert(sizeof(AC_jRPG_TargetingManager_C_CancelTargeting) == 0x000028, "Wrong size on AC_jRPG_TargetingManager_C_CancelTargeting");
static_assert(offsetof(AC_jRPG_TargetingManager_C_CancelTargeting, CallFunc_GetOwner_ReturnValue) == 0x000000, "Member 'AC_jRPG_TargetingManager_C_CancelTargeting::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_TargetingManager_C_CancelTargeting, CallFunc_GetComponentByClass_ReturnValue) == 0x000008, "Member 'AC_jRPG_TargetingManager_C_CancelTargeting::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_TargetingManager_C_CancelTargeting, CallFunc_Array_Get_Item) == 0x000010, "Member 'AC_jRPG_TargetingManager_C_CancelTargeting::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(AC_jRPG_TargetingManager_C_CancelTargeting, CallFunc_GetOwner_ReturnValue_1) == 0x000018, "Member 'AC_jRPG_TargetingManager_C_CancelTargeting::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AC_jRPG_TargetingManager_C_CancelTargeting, CallFunc_GetComponentByClass_ReturnValue_1) == 0x000020, "Member 'AC_jRPG_TargetingManager_C_CancelTargeting::CallFunc_GetComponentByClass_ReturnValue_1' has a wrong offset!");

// Function AC_jRPG_TargetingManager.AC_jRPG_TargetingManager_C.ComputeTargetGroups
// 0x03C0 (0x03C0 - 0x0000)
struct AC_jRPG_TargetingManager_C_ComputeTargetGroups final
{
public:
	E_jRPG_TargetingType                          TargetingType;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          BypassChecks;                                      // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsAlly;                                            // 0x0002(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UBP_TargetingGroup_C*>           TargetGroups_0;                                    // 0x0008(0x0010)(Parm, OutParm)
	class ABP_jRPG_Character_Battle_Base_C*       PreferedNextInitialTarget_0;                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_jRPG_Character_Battle_Base_C*       local_PreferedNextInitialTarget;                   // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	TArray<class UBP_TargetingGroup_C*>           local_TargetGroups;                                // 0x0028(0x0010)(Edit, BlueprintVisible)
	TArray<class UBP_TargetingGroup_C*>           local_TargetGroupsBeforeSort;                      // 0x0038(0x0010)(Edit, BlueprintVisible)
	TMap<int32, int32>                            local_EnemyIndexToBattleSpotOrder;                 // 0x0048(0x0050)(Edit, BlueprintVisible)
	bool                                          local_MustBeSelf;                                  // 0x0098(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_jRPG_Character_Battle_Base_C*> local_AllMatchingTargets;                        // 0x00A0(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	bool                                          local_AllInSingleGroup;                            // 0x00B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          local_MustBeEnemy;                                 // 0x00B1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          local_MustBeAlly;                                  // 0x00B2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          local_MustBeDead;                                  // 0x00B3(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          local_MustBeAlive;                                 // 0x00B4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B5[0x3];                                       // 0x00B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FIntVector>                     local_GroupBounds;                                 // 0x00B8(0x0010)(Edit, BlueprintVisible)
	TArray<class ABP_jRPG_Character_Battle_Base_C*> local_Result;                                    // 0x00C8(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	bool                                          Temp_bool_Variable;                                // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsTargetingTypeAlly_ReturnValue;          // 0x00DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x00DB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x00DD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x00DE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_5;                              // 0x00DF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_6;                              // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_7;                              // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_8;                              // 0x00E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_9;                              // 0x00E3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_10;                             // 0x00E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_jRPG_TargetingType                          Temp_byte_Variable;                                // 0x00E5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_11;                             // 0x00E6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_12;                             // 0x00E7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_13;                             // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_14;                             // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_15;                             // 0x00EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_16;                             // 0x00EB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_17;                             // 0x00EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_18;                             // 0x00ED(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_19;                             // 0x00EE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_20;                             // 0x00EF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_21;                             // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_jRPG_TargetingType                          Temp_byte_Variable_1;                              // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Select_Default;                             // 0x00F2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_22;                             // 0x00F3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_23;                             // 0x00F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_24;                             // 0x00F5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_25;                             // 0x00F6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_26;                             // 0x00F7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_27;                             // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_28;                             // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_29;                             // 0x00FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_30;                             // 0x00FB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_31;                             // 0x00FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_32;                             // 0x00FD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_jRPG_TargetingType                          Temp_byte_Variable_2;                              // 0x00FE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Select_Default_1;                           // 0x00FF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Select_Default_2;                           // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_33;                             // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_102[0x2];                                      // 0x0102(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_NextIndex_Variable;                       // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 Temp_wildcard_Original_index_Variable;             // 0x0118(0x0010)(ConstParm, ReferenceParm)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_34;                             // 0x012C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12D[0x3];                                      // 0x012D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<int32, int32>                            Temp_wildcard_RemapTable_Variable;                 // 0x0130(0x0050)(ConstParm)
	bool                                          Temp_bool_Variable_35;                             // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_36;                             // 0x0181(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_37;                             // 0x0182(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_183[0x1];                                      // 0x0183(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<double>                                Temp_real_Variable;                                // 0x0190(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MinOfFloatArray_IndexOfMinValue;          // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MinOfFloatArray_MinValue;                 // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x01AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1AD[0x3];                                      // 0x01AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Get_Item;                           // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_38;                             // 0x01B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B5[0x3];                                      // 0x01B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_jRPG_Character_Battle_Base_C*> Temp_wildcard_Variable;                          // 0x01B8(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_39;                             // 0x01CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1CD[0x3];                                      // 0x01CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UBP_TargetingGroup_C*>           Temp_wildcard_Result_array_Variable;               // 0x01D0(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_IsPackagedForDistribution_ReturnValue;    // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E1[0x3];                                      // 0x01E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E9[0x3];                                      // 0x01E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x01EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_jRPG_TargetingType                          Temp_byte_Variable_3;                              // 0x01F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F5[0x3];                                      // 0x01F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_jRPG_Character_Battle_Base_C*       CallFunc_Array_Get_Item_1;                         // 0x01F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_201[0x7];                                      // 0x0201(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAC_jRPG_BattleManager_C*               CallFunc_GetBattleManager_ReturnValue;             // 0x0208(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAC_jRPG_BattleManager_C*               CallFunc_GetBattleManager_ReturnValue_1;           // 0x0210(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_jRPG_Character_Battle_Base_C*> CallFunc_GetAllCharacters_AllCharacters;         // 0x0218(0x0010)(ReferenceParm)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayerTeamCharacterBase_IsPlayerTeam;   // 0x0229(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x022A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22B[0x5];                                      // 0x022B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_TargetingGroup_C*                   CallFunc_AddSingleCharacterTargetingGroup_TargetingGroup; // 0x0230(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UBP_TargetingGroup_C*                   CallFunc_Array_Get_Item_2;                         // 0x0238(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0240(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_244[0x4];                                      // 0x0244(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_ObjectToText_ReturnValue;            // 0x0248(0x0010)()
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_259[0x7];                                      // 0x0259(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0260(0x0048)(HasGetValueTypeHash)
	TArray<class ABP_jRPG_Character_Battle_Base_C*> CallFunc_GetCharacters_Characters;               // 0x02A8(0x0010)(ReferenceParm)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B9[0x7];                                      // 0x02B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_ConcatenateDisplayNames_Result;           // 0x02C0(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x02D0(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0318(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0328(0x0010)()
	bool                                          CallFunc_CheckIsAlive_Value;                       // 0x0338(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0339(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckIsAlive_Value_1;                     // 0x033A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_40;                             // 0x033B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_41;                             // 0x033C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33D[0x3];                                      // 0x033D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UBP_TargetingGroup_C*>           CallFunc_Array_Remap_ResultArray;                  // 0x0340(0x0010)(ReferenceParm)
	TArray<class ABP_jRPG_Character_Battle_Base_C*> CallFunc_GetCharacters_Characters_1;             // 0x0350(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0360(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_364[0x4];                                      // 0x0364(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_jRPG_Character_Battle_Base_C*       CallFunc_Array_Get_Item_3;                         // 0x0368(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x0370(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetBattleSpotIndexLeftToRight__WhenFacingCharacters__ReturnValue; // 0x0374(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0378(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_379[0x7];                                      // 0x0379(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0380(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_2;                  // 0x0388(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x038C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_42;                             // 0x0390(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_43;                             // 0x0391(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_44;                             // 0x0392(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Select_Default_3;                           // 0x0393(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_45;                             // 0x0394(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_395[0x3];                                      // 0x0395(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_TargetingGroup_C*                   CallFunc_AddTargetingGroup_TargetingGroup;         // 0x0398(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_46;                             // 0x03A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A1[0x3];                                      // 0x03A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue_3;                  // 0x03A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_47;                             // 0x03A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_48;                             // 0x03A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_49;                             // 0x03AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Select_Default_4;                           // 0x03AB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Select_Default_5;                           // 0x03AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Select_Default_6;                           // 0x03AD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3AE[0x2];                                      // 0x03AE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 CallFunc_MinOfFloatArray_FloatArray_ImplicitCast;  // 0x03B0(0x0010)(ConstParm, ReferenceParm)
};
static_assert(alignof(AC_jRPG_TargetingManager_C_ComputeTargetGroups) == 0x000008, "Wrong alignment on AC_jRPG_TargetingManager_C_ComputeTargetGroups");
static_assert(sizeof(AC_jRPG_TargetingManager_C_ComputeTargetGroups) == 0x0003C0, "Wrong size on AC_jRPG_TargetingManager_C_ComputeTargetGroups");
static_assert(offsetof(AC_jRPG_TargetingManager_C_ComputeTargetGroups, TargetingType) == 0x000000, "Member 'AC_jRPG_TargetingManager_C_ComputeTargetGroups::TargetingType' has a wrong offset!");
static_assert(offsetof(AC_jRPG_TargetingManager_C_ComputeTargetGroups, BypassChecks) == 0x000001, "Member 'AC_jRPG_TargetingManager_C_ComputeTargetGroups::BypassChecks' has a wrong offset!");
static_assert(offsetof(AC_jRPG_TargetingManager_C_ComputeTargetGroups, IsAlly) == 0x000002, "Member 'AC_jRPG_TargetingManager_C_ComputeTargetGroups::IsAlly' has a wrong offset!");
static_assert(offsetof(AC_jRPG_TargetingManager_C_ComputeTargetGroups, TargetGroups_0) == 0x000008, "Member 'AC_jRPG_TargetingManager_C_ComputeTargetGroups::TargetGroups_0' has a wrong offset!");
static_assert(offsetof(AC_jRPG_TargetingManager_C_ComputeTargetGroups, PreferedNextInitialTarget_0) == 0x000018, "Member 'AC_jRPG_TargetingManager_C_ComputeTargetGroups::PreferedNextInitialTarget_0' has a wrong offset!");
static_assert(offsetof(AC_jRPG_TargetingManager_C_ComputeTargetGroups, local_PreferedNextInitialTarget) == 0x000020, "Member 'AC_jRPG_TargetingManager_C_ComputeTargetGroups::local_PreferedNextInitialTarget' has a wrong offset!");
static_assert(offsetof(AC_jRPG_TargetingManager_C_ComputeTargetGroups, local_TargetGroups) == 0x000028, "Member 'AC_jRPG_TargetingManager_C_ComputeTargetGroups::local_TargetGroups' has a wrong offset!");
static_assert(offsetof(AC_jRPG_TargetingManager_C_ComputeTargetGroups, local_TargetGroupsBeforeSort) == 0x000038, "Member 'AC_jRPG_TargetingManager_C_ComputeTargetGroups::local_TargetGroupsBeforeSort' has a wrong offset!");
static_assert(offsetof(AC_jRPG_TargetingManager_C_ComputeTargetGroups, local_EnemyIndexToBattleSpotOrder) == 0x000048, "Member 'AC_jRPG_TargetingManager_C_ComputeTargetGroups::local_EnemyIndexToBattleSpotOrder' has a wrong offset!");
static_assert(offsetof(AC_jRPG_TargetingManager_C_ComputeTargetGroups, local_MustBeSelf) == 0x000098, "Member 'AC_jRPG_TargetingManager_C_ComputeTargetGroups::local_MustBeSelf' has a wrong offset!");
static_assert(offsetof(AC_jRPG_TargetingManager_C_ComputeTargetGroups, local_AllMatchingTargets) == 0x0000A0, "Member 'AC_jRPG_TargetingManager_C_ComputeTargetGroups::local_AllMatchingTargets' has a wrong offset!");
static_assert(offsetof(AC_jRPG_TargetingManager_C_ComputeTargetGroups, local_AllInSingleGroup) == 0x0000B0, "Member 'AC_jRPG_TargetingManager_C_ComputeTargetGroups::local_AllInSingleGroup' has a wrong offset!");
static_assert(offsetof(AC_jRPG_TargetingManager_C_ComputeTargetGroups, local_MustBeEnemy) == 0x0000B1, "Member 'AC_jRPG_TargetingManager_C_ComputeTargetGroups::local_MustBeEnemy' has a wrong offset!");
static_assert(offsetof(AC_jRPG_TargetingManager_C_ComputeTargetGroups, local_MustBeAlly) == 0x0000B2, "Member 'AC_jRPG_TargetingManager_C_ComputeTargetGroups::local_MustBeAlly' has a wrong offset!");
static_assert(offsetof(AC_jRPG_TargetingManager_C_ComputeTargetGroups, local_MustBeDead) == 0x0000B3, "Member 'AC_jRPG_TargetingManager_C_ComputeTargetGroups::local_MustBeDead' has a wrong offset!");
static_assert(offsetof(AC_jRPG_TargetingManager_C_ComputeTargetGroups, local_MustBeAlive) == 0x0000B4, "Member 'AC_jRPG_TargetingManager_C_ComputeTargetGroups::local_MustBeAlive' has a wrong offset!");
static_assert(offsetof(AC_jRPG_TargetingManager_C_ComputeTargetGroups, local_GroupBounds) == 0x0000B8, "Member 'AC_jRPG_TargetingManager_C_ComputeTargetGroups::local_GroupBounds' has a wrong offset!");
static_assert(offsetof(AC_jRPG_TargetingManager_C_ComputeTargetGroups, local_Result) == 0x0000C8, "Member 'AC_jRPG_TargetingManager_C_ComputeTargetGroups::local_Result' has a wrong offset!");
static_assert(offsetof(AC_jRPG_TargetingManager_C_ComputeTargetGroups, Temp_bool_Variable) == 0x0000D8, "Member 'AC_jRPG_TargetingManager_C_ComputeTargetGroups::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AC_jRPG_TargetingManager_C_ComputeTargetGroups, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000D9, "Member 'AC_jRPG_TargetingManager_C_ComputeTargetGroups::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_TargetingManager_C_ComputeTargetGroups, CallFunc_IsTargetingTypeAlly_ReturnValue) == 0x0000DA, "Member 'AC_jRPG_TargetingManager_C_ComputeTargetGroups::CallFunc_IsTargetingTypeAlly_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_TargetingManager_C_ComputeTargetGroups, Temp_bool_Variable_1) == 0x0000DB, "Member 'AC_jRPG_TargetingManager_C_ComputeTargetGroups::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(AC_jRPG_TargetingManager_C_ComputeTargetGroups, Temp_bool_Variable_2) == 0x0000DC, "Member 'AC_jRPG_TargetingManager_C_ComputeTargetGroups::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(AC_jRPG_TargetingManager_C_ComputeTargetGroups, Temp_bool_Variable_3) == 0x0000DD, "Member 'AC_jRPG_TargetingManager_C_ComputeTargetGroups::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(AC_jRPG_TargetingManager_C_ComputeTargetGroups, Temp_bool_Variable_4) == 0x0000DE, "Member 'AC_jRPG_TargetingManager_C_ComputeTargetGroups::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(AC_jRPG_TargetingManager_C_ComputeTargetGroups, Temp_bool_Variable_5) == 0x0000DF, "Member 'AC_jRPG_TargetingManager_C_ComputeTargetGroups::Temp_bool_Variable_5' has a wrong offset!");
static_assert(offsetof(AC_jRPG_TargetingManager_C_ComputeTargetGroups, Temp_bool_Variable_6) == 0x0000E0, "Member 'AC_jRPG_TargetingManager_C_ComputeTargetGroups::Temp_bool_Variable_6' has a wrong offset!");
static_assert(offsetof(AC_jRPG_TargetingManager_C_ComputeTargetGroups, Temp_bool_Variable_7) == 0x0000E1, "Member 'AC_jRPG_TargetingManager_C_ComputeTargetGroups::Temp_bool_Variable_7' has a wrong offset!");
static_assert(offsetof(AC_jRPG_TargetingManager_C_ComputeTargetGroups, Temp_bool_Variable_8) == 0x0000E2, "Member 'AC_jRPG_TargetingManager_C_ComputeTargetGroups::Temp_bool_Variable_8' has a wrong offset!");
static_assert(offsetof(AC_jRPG_TargetingManager_C_ComputeTargetGroups, Temp_bool_Variable_9) == 0x0000E3, "Member 'AC_jRPG_TargetingManager_C_ComputeTargetGroups::Temp_bool_Variable_9' has a wrong offset!");
static_assert(offsetof(AC_jRPG_TargetingManager_C_ComputeTargetGroups, Temp_bool_Variable_10) == 0x0000E4, "Member 'AC_jRPG_TargetingManager_C_ComputeTargetGroups::Temp_bool_Variable_10' has a wrong offset!");
static_assert(offsetof(AC_jRPG_TargetingManager_C_ComputeTargetGroups, Temp_byte_Variable) == 0x0000E5, "Member 'AC_jRPG_TargetingManager_C_ComputeTargetGroups::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AC_jRPG_TargetingManager_C_ComputeTargetGroups, Temp_bool_Variable_11) == 0x0000E6, "Member 'AC_jRPG_TargetingManager_C_ComputeTargetGroups::Temp_bool_Variable_11' has a wrong offset!");
static_assert(offsetof(AC_jRPG_TargetingManager_C_ComputeTargetGroups, Temp_bool_Variable_12) == 0x0000E7, "Member 'AC_jRPG_TargetingManager_C_ComputeTargetGroups::Temp_bool_Variable_12' has a wrong offset!");
static_assert(offsetof(AC_jRPG_TargetingManager_C_ComputeTargetGroups, Temp_bool_Variable_13) == 0x0000E8, "Member 'AC_jRPG_TargetingManager_C_ComputeTargetGroups::Temp_bool_Variable_13' has a wrong offset!");
static_assert(offsetof(AC_jRPG_TargetingManager_C_ComputeTargetGroups, Temp_bool_Variable_14) == 0x0000E9, "Member 'AC_jRPG_TargetingManager_C_ComputeTargetGroups::Temp_bool_Variable_14' has a wrong offset!");
static_assert(offsetof(AC_jRPG_TargetingManager_C_ComputeTargetGroups, Temp_bool_Variable_15) == 0x0000EA, "Member 'AC_jRPG_TargetingManager_C_ComputeTargetGroups::Temp_bool_Variable_15' has a wrong offset!");
static_assert(offsetof(AC_jRPG_TargetingManager_C_ComputeTargetGroups, Temp_bool_Variable_16) == 0x0000EB, "Member 'AC_jRPG_TargetingManager_C_ComputeTargetGroups::Temp_bool_Variable_16' has a wrong offset!");
static_assert(offsetof(AC_jRPG_TargetingManager_C_ComputeTargetGroups, Temp_bool_Variable_17) == 0x0000EC, "Member 'AC_jRPG_TargetingManager_C_ComputeTargetGroups::Temp_bool_Variable_17' has a wrong offset!");
static_assert(offsetof(AC_jRPG_TargetingManager_C_ComputeTargetGroups, Temp_bool_Variable_18) == 0x0000ED, "Member 'AC_jRPG_TargetingManager_C_ComputeTargetGroups::Temp_bool_Variable_18' has a wrong offset!");
static_assert(offsetof(AC_jRPG_TargetingManager_C_ComputeTargetGroups, Temp_bool_Variable_19) == 0x0000EE, "Member 'AC_jRPG_TargetingManager_C_ComputeTargetGroups::Temp_bool_Variable_19' has a wrong offset!");
static_assert(offsetof(AC_jRPG_TargetingManager_C_ComputeTargetGroups, Temp_bool_Variable_20) == 0x0000EF, "Member 'AC_jRPG_TargetingManager_C_ComputeTargetGroups::Temp_bool_Variable_20' has a wrong offset!");
static_assert(offsetof(AC_jRPG_TargetingManager_C_ComputeTargetGroups, Temp_bool_Variable_21) == 0x0000F0, "Member 'AC_jRPG_TargetingManager_C_ComputeTargetGroups::Temp_bool_Variable_21' has a wrong offset!");
static_assert(offsetof(AC_jRPG_TargetingManager_C_ComputeTargetGroups, Temp_byte_Variable_1) == 0x0000F1, "Member 'AC_jRPG_TargetingManager_C_ComputeTargetGroups::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(AC_jRPG_TargetingManager_C_ComputeTargetGroups, K2Node_Select_Default) == 0x0000F2, "Member 'AC_jRPG_TargetingManager_C_ComputeTargetGroups::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AC_jRPG_TargetingManager_C_ComputeTargetGroups, Temp_bool_Variable_22) == 0x0000F3, "Member 'AC_jRPG_TargetingManager_C_ComputeTargetGroups::Temp_bool_Variable_22' has a wrong offset!");
static_assert(offsetof(AC_jRPG_TargetingManager_C_ComputeTargetGroups, Temp_bool_Variable_23) == 0x0000F4, "Member 'AC_jRPG_TargetingManager_C_ComputeTargetGroups::Temp_bool_Variable_23' has a wrong offset!");
static_assert(offsetof(AC_jRPG_TargetingManager_C_ComputeTargetGroups, Temp_bool_Variable_24) == 0x0000F5, "Member 'AC_jRPG_TargetingManager_C_ComputeTargetGroups::Temp_bool_Variable_24' has a wrong offset!");
static_assert(offsetof(AC_jRPG_TargetingManager_C_ComputeTargetGroups, Temp_bool_Variable_25) == 0x0000F6, "Member 'AC_jRPG_TargetingManager_C_ComputeTargetGroups::Temp_bool_Variable_25' has a wrong offset!");
static_assert(offsetof(AC_jRPG_TargetingManager_C_ComputeTargetGroups, Temp_bool_Variable_26) == 0x0000F7, "Member 'AC_jRPG_TargetingManager_C_ComputeTargetGroups::Temp_bool_Variable_26' has a wrong offset!");
static_assert(offsetof(AC_jRPG_TargetingManager_C_ComputeTargetGroups, Temp_bool_Variable_27) == 0x0000F8, "Member 'AC_jRPG_TargetingManager_C_ComputeTargetGroups::Temp_bool_Variable_27' has a wrong offset!");
static_assert(offsetof(AC_jRPG_TargetingManager_C_ComputeTargetGroups, Temp_bool_Variable_28) == 0x0000F9, "Member 'AC_jRPG_TargetingManager_C_ComputeTargetGroups::Temp_bool_Variable_28' has a wrong offset!");
static_assert(offsetof(AC_jRPG_TargetingManager_C_ComputeTargetGroups, Temp_bool_Variable_29) == 0x0000FA, "Member 'AC_jRPG_TargetingManager_C_ComputeTargetGroups::Temp_bool_Variable_29' has a wrong offset!");
static_assert(offsetof(AC_jRPG_TargetingManager_C_ComputeTargetGroups, Temp_bool_Variable_30) == 0x0000FB, "Member 'AC_jRPG_TargetingManager_C_ComputeTargetGroups::Temp_bool_Variable_30' has a wrong offset!");
static_assert(offsetof(AC_jRPG_TargetingManager_C_ComputeTargetGroups, Temp_bool_Variable_31) == 0x0000FC, "Member 'AC_jRPG_TargetingManager_C_ComputeTargetGroups::Temp_bool_Variable_31' has a wrong offset!");
static_assert(offsetof(AC_jRPG_TargetingManager_C_ComputeTargetGroups, Temp_bool_Variable_32) == 0x0000FD, "Member 'AC_jRPG_TargetingManager_C_ComputeTargetGroups::Temp_bool_Variable_32' has a wrong offset!");
static_assert(offsetof(AC_jRPG_TargetingManager_C_ComputeTargetGroups, Temp_byte_Variable_2) == 0x0000FE, "Member 'AC_jRPG_TargetingManager_C_ComputeTargetGroups::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(AC_jRPG_TargetingManager_C_ComputeTargetGroups, K2Node_Select_Default_1) == 0x0000FF, "Member 'AC_jRPG_TargetingManager_C_ComputeTargetGroups::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(AC_jRPG_TargetingManager_C_ComputeTargetGroups, K2Node_Select_Default_2) == 0x000100, "Member 'AC_jRPG_TargetingManager_C_ComputeTargetGroups::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(AC_jRPG_TargetingManager_C_ComputeTargetGroups, Temp_bool_Variable_33) == 0x000101, "Member 'AC_jRPG_TargetingManager_C_ComputeTargetGroups::Temp_bool_Variable_33' has a wrong offset!");
static_assert(offsetof(AC_jRPG_TargetingManager_C_ComputeTargetGroups, Temp_int_Variable) == 0x000104, "Member 'AC_jRPG_TargetingManager_C_ComputeTargetGroups::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(AC_jRPG_TargetingManager_C_ComputeTargetGroups, Temp_int_NextIndex_Variable) == 0x000108, "Member 'AC_jRPG_TargetingManager_C_ComputeTargetGroups::Temp_int_NextIndex_Variable' has a wrong offset!");
static_assert(offsetof(AC_jRPG_TargetingManager_C_ComputeTargetGroups, CallFunc_Add_IntInt_ReturnValue) == 0x00010C, "Member 'AC_jRPG_TargetingManager_C_ComputeTargetGroups::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_TargetingManager_C_ComputeTargetGroups, CallFunc_Add_IntInt_ReturnValue_1) == 0x000110, "Member 'AC_jRPG_TargetingManager_C_ComputeTargetGroups::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AC_jRPG_TargetingManager_C_ComputeTargetGroups, Temp_wildcard_Original_index_Variable) == 0x000118, "Member 'AC_jRPG_TargetingManager_C_ComputeTargetGroups::Temp_wildcard_Original_index_Variable' has a wrong offset!");
static_assert(offsetof(AC_jRPG_TargetingManager_C_ComputeTargetGroups, CallFunc_Array_Add_ReturnValue) == 0x000128, "Member 'AC_jRPG_TargetingManager_C_ComputeTargetGroups::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_TargetingManager_C_ComputeTargetGroups, Temp_bool_Variable_34) == 0x00012C, "Member 'AC_jRPG_TargetingManager_C_ComputeTargetGroups::Temp_bool_Variable_34' has a wrong offset!");
static_assert(offsetof(AC_jRPG_TargetingManager_C_ComputeTargetGroups, Temp_wildcard_RemapTable_Variable) == 0x000130, "Member 'AC_jRPG_TargetingManager_C_ComputeTargetGroups::Temp_wildcard_RemapTable_Variable' has a wrong offset!");
static_assert(offsetof(AC_jRPG_TargetingManager_C_ComputeTargetGroups, Temp_bool_Variable_35) == 0x000180, "Member 'AC_jRPG_TargetingManager_C_ComputeTargetGroups::Temp_bool_Variable_35' has a wrong offset!");
static_assert(offsetof(AC_jRPG_TargetingManager_C_ComputeTargetGroups, Temp_bool_Variable_36) == 0x000181, "Member 'AC_jRPG_TargetingManager_C_ComputeTargetGroups::Temp_bool_Variable_36' has a wrong offset!");
static_assert(offsetof(AC_jRPG_TargetingManager_C_ComputeTargetGroups, Temp_bool_Variable_37) == 0x000182, "Member 'AC_jRPG_TargetingManager_C_ComputeTargetGroups::Temp_bool_Variable_37' has a wrong offset!");
static_assert(offsetof(AC_jRPG_TargetingManager_C_ComputeTargetGroups, Temp_int_Loop_Counter_Variable) == 0x000184, "Member 'AC_jRPG_TargetingManager_C_ComputeTargetGroups::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(AC_jRPG_TargetingManager_C_ComputeTargetGroups, CallFunc_Add_IntInt_ReturnValue_2) == 0x000188, "Member 'AC_jRPG_TargetingManager_C_ComputeTargetGroups::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AC_jRPG_TargetingManager_C_ComputeTargetGroups, Temp_int_Array_Index_Variable) == 0x00018C, "Member 'AC_jRPG_TargetingManager_C_ComputeTargetGroups::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(AC_jRPG_TargetingManager_C_ComputeTargetGroups, Temp_real_Variable) == 0x000190, "Member 'AC_jRPG_TargetingManager_C_ComputeTargetGroups::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(AC_jRPG_TargetingManager_C_ComputeTargetGroups, CallFunc_Array_Length_ReturnValue) == 0x0001A0, "Member 'AC_jRPG_TargetingManager_C_ComputeTargetGroups::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_TargetingManager_C_ComputeTargetGroups, CallFunc_MinOfFloatArray_IndexOfMinValue) == 0x0001A4, "Member 'AC_jRPG_TargetingManager_C_ComputeTargetGroups::CallFunc_MinOfFloatArray_IndexOfMinValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_TargetingManager_C_ComputeTargetGroups, CallFunc_MinOfFloatArray_MinValue) == 0x0001A8, "Member 'AC_jRPG_TargetingManager_C_ComputeTargetGroups::CallFunc_MinOfFloatArray_MinValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_TargetingManager_C_ComputeTargetGroups, CallFunc_Greater_IntInt_ReturnValue) == 0x0001AC, "Member 'AC_jRPG_TargetingManager_C_ComputeTargetGroups::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_TargetingManager_C_ComputeTargetGroups, CallFunc_Array_Get_Item) == 0x0001B0, "Member 'AC_jRPG_TargetingManager_C_ComputeTargetGroups::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(AC_jRPG_TargetingManager_C_ComputeTargetGroups, Temp_bool_Variable_38) == 0x0001B4, "Member 'AC_jRPG_TargetingManager_C_ComputeTargetGroups::Temp_bool_Variable_38' has a wrong offset!");
static_assert(offsetof(AC_jRPG_TargetingManager_C_ComputeTargetGroups, Temp_wildcard_Variable) == 0x0001B8, "Member 'AC_jRPG_TargetingManager_C_ComputeTargetGroups::Temp_wildcard_Variable' has a wrong offset!");
static_assert(offsetof(AC_jRPG_TargetingManager_C_ComputeTargetGroups, CallFunc_Array_Length_ReturnValue_1) == 0x0001C8, "Member 'AC_jRPG_TargetingManager_C_ComputeTargetGroups::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AC_jRPG_TargetingManager_C_ComputeTargetGroups, Temp_bool_Variable_39) == 0x0001CC, "Member 'AC_jRPG_TargetingManager_C_ComputeTargetGroups::Temp_bool_Variable_39' has a wrong offset!");
static_assert(offsetof(AC_jRPG_TargetingManager_C_ComputeTargetGroups, Temp_wildcard_Result_array_Variable) == 0x0001D0, "Member 'AC_jRPG_TargetingManager_C_ComputeTargetGroups::Temp_wildcard_Result_array_Variable' has a wrong offset!");
static_assert(offsetof(AC_jRPG_TargetingManager_C_ComputeTargetGroups, CallFunc_IsPackagedForDistribution_ReturnValue) == 0x0001E0, "Member 'AC_jRPG_TargetingManager_C_ComputeTargetGroups::CallFunc_IsPackagedForDistribution_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_TargetingManager_C_ComputeTargetGroups, Temp_int_Loop_Counter_Variable_1) == 0x0001E4, "Member 'AC_jRPG_TargetingManager_C_ComputeTargetGroups::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(AC_jRPG_TargetingManager_C_ComputeTargetGroups, CallFunc_Less_IntInt_ReturnValue) == 0x0001E8, "Member 'AC_jRPG_TargetingManager_C_ComputeTargetGroups::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_TargetingManager_C_ComputeTargetGroups, CallFunc_Add_IntInt_ReturnValue_3) == 0x0001EC, "Member 'AC_jRPG_TargetingManager_C_ComputeTargetGroups::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(AC_jRPG_TargetingManager_C_ComputeTargetGroups, Temp_int_Array_Index_Variable_1) == 0x0001F0, "Member 'AC_jRPG_TargetingManager_C_ComputeTargetGroups::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(AC_jRPG_TargetingManager_C_ComputeTargetGroups, Temp_byte_Variable_3) == 0x0001F4, "Member 'AC_jRPG_TargetingManager_C_ComputeTargetGroups::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(AC_jRPG_TargetingManager_C_ComputeTargetGroups, CallFunc_Array_Get_Item_1) == 0x0001F8, "Member 'AC_jRPG_TargetingManager_C_ComputeTargetGroups::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(AC_jRPG_TargetingManager_C_ComputeTargetGroups, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000200, "Member 'AC_jRPG_TargetingManager_C_ComputeTargetGroups::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_TargetingManager_C_ComputeTargetGroups, CallFunc_GetBattleManager_ReturnValue) == 0x000208, "Member 'AC_jRPG_TargetingManager_C_ComputeTargetGroups::CallFunc_GetBattleManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_TargetingManager_C_ComputeTargetGroups, CallFunc_GetBattleManager_ReturnValue_1) == 0x000210, "Member 'AC_jRPG_TargetingManager_C_ComputeTargetGroups::CallFunc_GetBattleManager_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AC_jRPG_TargetingManager_C_ComputeTargetGroups, CallFunc_GetAllCharacters_AllCharacters) == 0x000218, "Member 'AC_jRPG_TargetingManager_C_ComputeTargetGroups::CallFunc_GetAllCharacters_AllCharacters' has a wrong offset!");
static_assert(offsetof(AC_jRPG_TargetingManager_C_ComputeTargetGroups, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000228, "Member 'AC_jRPG_TargetingManager_C_ComputeTargetGroups::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_TargetingManager_C_ComputeTargetGroups, CallFunc_IsPlayerTeamCharacterBase_IsPlayerTeam) == 0x000229, "Member 'AC_jRPG_TargetingManager_C_ComputeTargetGroups::CallFunc_IsPlayerTeamCharacterBase_IsPlayerTeam' has a wrong offset!");
static_assert(offsetof(AC_jRPG_TargetingManager_C_ComputeTargetGroups, CallFunc_Not_PreBool_ReturnValue) == 0x00022A, "Member 'AC_jRPG_TargetingManager_C_ComputeTargetGroups::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_TargetingManager_C_ComputeTargetGroups, CallFunc_AddSingleCharacterTargetingGroup_TargetingGroup) == 0x000230, "Member 'AC_jRPG_TargetingManager_C_ComputeTargetGroups::CallFunc_AddSingleCharacterTargetingGroup_TargetingGroup' has a wrong offset!");
static_assert(offsetof(AC_jRPG_TargetingManager_C_ComputeTargetGroups, CallFunc_Array_Get_Item_2) == 0x000238, "Member 'AC_jRPG_TargetingManager_C_ComputeTargetGroups::CallFunc_Array_Get_Item_2' has a wrong offset!");
