#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AC_jRPG_CombatMovement

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "ECharacterTeamSelector_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function AC_jRPG_CombatMovement.AC_jRPG_CombatMovement_C.UpdateMovementProgression
// 0x0700 (0x0700 - 0x0000)
struct AC_jRPG_CombatMovement_C_UpdateMovementProgression final
{
public:
	float                                         CurveValue;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                local_newLocation;                                 // 0x0008(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         local_currentCurveValue;                           // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             K2Node_DynamicCast_AsCharacter;                    // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_VectorToString_ReturnValue;          // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UAnimMontage*                           CallFunc_GetCurrentMontage_ReturnValue;            // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0058(0x0010)()
	class FText                                   CallFunc_Conv_ObjectToText_ReturnValue;            // 0x0068(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0078(0x0048)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00C0(0x0048)(HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0110(0x0048)(HasGetValueTypeHash)
	class ACharacter*                             K2Node_DynamicCast_AsCharacter_1;                  // 0x0158(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0168(0x0010)(ReferenceParm)
	class UAnimMontage*                           CallFunc_GetCurrentMontage_ReturnValue_1;          // 0x0178(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0180(0x0010)()
	class FText                                   CallFunc_Conv_ObjectToText_ReturnValue_1;          // 0x0190(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x01A0(0x0048)(HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x01E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoesLocationMatch_Result;                 // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_201[0x7];                                      // 0x0201(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_BoolToText_ReturnValue;              // 0x0208(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_4;            // 0x0218(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0260(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0270(0x0010)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0280(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_5;            // 0x0290(0x0048)(HasGetValueTypeHash)
	double                                        CallFunc_Vector_Distance_ReturnValue;              // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x02E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_6;            // 0x02E8(0x0048)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_7;            // 0x0330(0x0048)(HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_2;                   // 0x0378(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_ObjectToText_ReturnValue_2;          // 0x0380(0x0010)()
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0390(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_8;            // 0x03A0(0x0048)(HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue_1;             // 0x03E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_2;                          // 0x03F8(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0408(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Format_ReturnValue_2;                     // 0x0418(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0428(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DoubleDouble_ReturnValue;      // 0x0430(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_431[0x7];                                      // 0x0431(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_9;            // 0x0438(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_3;                          // 0x0480(0x0010)(ReferenceParm)
	struct FDebugFloatHistory                     CallFunc_AddFloatHistorySample_ReturnValue;        // 0x0490(0x0020)()
	class FText                                   CallFunc_Format_ReturnValue_3;                     // 0x04B0(0x0010)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x04C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_3;                   // 0x04D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x04D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_VectorToString_ReturnValue_1;        // 0x04F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_2;          // 0x0500(0x0010)()
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x0510(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_10;           // 0x0528(0x0048)(HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_4;                   // 0x0570(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x0578(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x0670(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_671[0x7];                                      // 0x0671(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_BoolToText_ReturnValue_1;            // 0x0678(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_11;           // 0x0688(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_4;                          // 0x06D0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_4;                     // 0x06E0(0x0010)()
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x06F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_EqualEqual_DoubleDouble_A_ImplicitCast;   // 0x06F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AC_jRPG_CombatMovement_C_UpdateMovementProgression) == 0x000008, "Wrong alignment on AC_jRPG_CombatMovement_C_UpdateMovementProgression");
static_assert(sizeof(AC_jRPG_CombatMovement_C_UpdateMovementProgression) == 0x000700, "Wrong size on AC_jRPG_CombatMovement_C_UpdateMovementProgression");
static_assert(offsetof(AC_jRPG_CombatMovement_C_UpdateMovementProgression, CurveValue) == 0x000000, "Member 'AC_jRPG_CombatMovement_C_UpdateMovementProgression::CurveValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CombatMovement_C_UpdateMovementProgression, local_newLocation) == 0x000008, "Member 'AC_jRPG_CombatMovement_C_UpdateMovementProgression::local_newLocation' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CombatMovement_C_UpdateMovementProgression, local_currentCurveValue) == 0x000020, "Member 'AC_jRPG_CombatMovement_C_UpdateMovementProgression::local_currentCurveValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CombatMovement_C_UpdateMovementProgression, CallFunc_GetOwner_ReturnValue) == 0x000028, "Member 'AC_jRPG_CombatMovement_C_UpdateMovementProgression::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CombatMovement_C_UpdateMovementProgression, K2Node_DynamicCast_AsCharacter) == 0x000030, "Member 'AC_jRPG_CombatMovement_C_UpdateMovementProgression::K2Node_DynamicCast_AsCharacter' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CombatMovement_C_UpdateMovementProgression, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'AC_jRPG_CombatMovement_C_UpdateMovementProgression::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CombatMovement_C_UpdateMovementProgression, CallFunc_Conv_VectorToString_ReturnValue) == 0x000040, "Member 'AC_jRPG_CombatMovement_C_UpdateMovementProgression::CallFunc_Conv_VectorToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CombatMovement_C_UpdateMovementProgression, CallFunc_GetCurrentMontage_ReturnValue) == 0x000050, "Member 'AC_jRPG_CombatMovement_C_UpdateMovementProgression::CallFunc_GetCurrentMontage_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CombatMovement_C_UpdateMovementProgression, CallFunc_Conv_StringToText_ReturnValue) == 0x000058, "Member 'AC_jRPG_CombatMovement_C_UpdateMovementProgression::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CombatMovement_C_UpdateMovementProgression, CallFunc_Conv_ObjectToText_ReturnValue) == 0x000068, "Member 'AC_jRPG_CombatMovement_C_UpdateMovementProgression::CallFunc_Conv_ObjectToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CombatMovement_C_UpdateMovementProgression, K2Node_MakeStruct_FormatArgumentData) == 0x000078, "Member 'AC_jRPG_CombatMovement_C_UpdateMovementProgression::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CombatMovement_C_UpdateMovementProgression, K2Node_MakeStruct_FormatArgumentData_1) == 0x0000C0, "Member 'AC_jRPG_CombatMovement_C_UpdateMovementProgression::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CombatMovement_C_UpdateMovementProgression, CallFunc_GetOwner_ReturnValue_1) == 0x000108, "Member 'AC_jRPG_CombatMovement_C_UpdateMovementProgression::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CombatMovement_C_UpdateMovementProgression, K2Node_MakeStruct_FormatArgumentData_2) == 0x000110, "Member 'AC_jRPG_CombatMovement_C_UpdateMovementProgression::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CombatMovement_C_UpdateMovementProgression, K2Node_DynamicCast_AsCharacter_1) == 0x000158, "Member 'AC_jRPG_CombatMovement_C_UpdateMovementProgression::K2Node_DynamicCast_AsCharacter_1' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CombatMovement_C_UpdateMovementProgression, K2Node_DynamicCast_bSuccess_1) == 0x000160, "Member 'AC_jRPG_CombatMovement_C_UpdateMovementProgression::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CombatMovement_C_UpdateMovementProgression, K2Node_MakeArray_Array) == 0x000168, "Member 'AC_jRPG_CombatMovement_C_UpdateMovementProgression::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CombatMovement_C_UpdateMovementProgression, CallFunc_GetCurrentMontage_ReturnValue_1) == 0x000178, "Member 'AC_jRPG_CombatMovement_C_UpdateMovementProgression::CallFunc_GetCurrentMontage_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CombatMovement_C_UpdateMovementProgression, CallFunc_Format_ReturnValue) == 0x000180, "Member 'AC_jRPG_CombatMovement_C_UpdateMovementProgression::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CombatMovement_C_UpdateMovementProgression, CallFunc_Conv_ObjectToText_ReturnValue_1) == 0x000190, "Member 'AC_jRPG_CombatMovement_C_UpdateMovementProgression::CallFunc_Conv_ObjectToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CombatMovement_C_UpdateMovementProgression, K2Node_MakeStruct_FormatArgumentData_3) == 0x0001A0, "Member 'AC_jRPG_CombatMovement_C_UpdateMovementProgression::K2Node_MakeStruct_FormatArgumentData_3' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CombatMovement_C_UpdateMovementProgression, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0001E8, "Member 'AC_jRPG_CombatMovement_C_UpdateMovementProgression::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CombatMovement_C_UpdateMovementProgression, CallFunc_DoesLocationMatch_Result) == 0x000200, "Member 'AC_jRPG_CombatMovement_C_UpdateMovementProgression::CallFunc_DoesLocationMatch_Result' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CombatMovement_C_UpdateMovementProgression, CallFunc_Conv_BoolToText_ReturnValue) == 0x000208, "Member 'AC_jRPG_CombatMovement_C_UpdateMovementProgression::CallFunc_Conv_BoolToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CombatMovement_C_UpdateMovementProgression, K2Node_MakeStruct_FormatArgumentData_4) == 0x000218, "Member 'AC_jRPG_CombatMovement_C_UpdateMovementProgression::K2Node_MakeStruct_FormatArgumentData_4' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CombatMovement_C_UpdateMovementProgression, K2Node_MakeArray_Array_1) == 0x000260, "Member 'AC_jRPG_CombatMovement_C_UpdateMovementProgression::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CombatMovement_C_UpdateMovementProgression, CallFunc_Format_ReturnValue_1) == 0x000270, "Member 'AC_jRPG_CombatMovement_C_UpdateMovementProgression::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CombatMovement_C_UpdateMovementProgression, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000280, "Member 'AC_jRPG_CombatMovement_C_UpdateMovementProgression::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CombatMovement_C_UpdateMovementProgression, K2Node_MakeStruct_FormatArgumentData_5) == 0x000290, "Member 'AC_jRPG_CombatMovement_C_UpdateMovementProgression::K2Node_MakeStruct_FormatArgumentData_5' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CombatMovement_C_UpdateMovementProgression, CallFunc_Vector_Distance_ReturnValue) == 0x0002D8, "Member 'AC_jRPG_CombatMovement_C_UpdateMovementProgression::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CombatMovement_C_UpdateMovementProgression, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x0002E0, "Member 'AC_jRPG_CombatMovement_C_UpdateMovementProgression::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CombatMovement_C_UpdateMovementProgression, K2Node_MakeStruct_FormatArgumentData_6) == 0x0002E8, "Member 'AC_jRPG_CombatMovement_C_UpdateMovementProgression::K2Node_MakeStruct_FormatArgumentData_6' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CombatMovement_C_UpdateMovementProgression, K2Node_MakeStruct_FormatArgumentData_7) == 0x000330, "Member 'AC_jRPG_CombatMovement_C_UpdateMovementProgression::K2Node_MakeStruct_FormatArgumentData_7' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CombatMovement_C_UpdateMovementProgression, CallFunc_GetOwner_ReturnValue_2) == 0x000378, "Member 'AC_jRPG_CombatMovement_C_UpdateMovementProgression::CallFunc_GetOwner_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CombatMovement_C_UpdateMovementProgression, CallFunc_Conv_ObjectToText_ReturnValue_2) == 0x000380, "Member 'AC_jRPG_CombatMovement_C_UpdateMovementProgression::CallFunc_Conv_ObjectToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CombatMovement_C_UpdateMovementProgression, CallFunc_GetDisplayName_ReturnValue) == 0x000390, "Member 'AC_jRPG_CombatMovement_C_UpdateMovementProgression::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CombatMovement_C_UpdateMovementProgression, K2Node_MakeStruct_FormatArgumentData_8) == 0x0003A0, "Member 'AC_jRPG_CombatMovement_C_UpdateMovementProgression::K2Node_MakeStruct_FormatArgumentData_8' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CombatMovement_C_UpdateMovementProgression, CallFunc_GetDisplayName_ReturnValue_1) == 0x0003E8, "Member 'AC_jRPG_CombatMovement_C_UpdateMovementProgression::CallFunc_GetDisplayName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CombatMovement_C_UpdateMovementProgression, K2Node_MakeArray_Array_2) == 0x0003F8, "Member 'AC_jRPG_CombatMovement_C_UpdateMovementProgression::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CombatMovement_C_UpdateMovementProgression, CallFunc_Concat_StrStr_ReturnValue) == 0x000408, "Member 'AC_jRPG_CombatMovement_C_UpdateMovementProgression::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CombatMovement_C_UpdateMovementProgression, CallFunc_Format_ReturnValue_2) == 0x000418, "Member 'AC_jRPG_CombatMovement_C_UpdateMovementProgression::CallFunc_Format_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CombatMovement_C_UpdateMovementProgression, CallFunc_Conv_StringToName_ReturnValue) == 0x000428, "Member 'AC_jRPG_CombatMovement_C_UpdateMovementProgression::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CombatMovement_C_UpdateMovementProgression, CallFunc_EqualEqual_DoubleDouble_ReturnValue) == 0x000430, "Member 'AC_jRPG_CombatMovement_C_UpdateMovementProgression::CallFunc_EqualEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CombatMovement_C_UpdateMovementProgression, K2Node_MakeStruct_FormatArgumentData_9) == 0x000438, "Member 'AC_jRPG_CombatMovement_C_UpdateMovementProgression::K2Node_MakeStruct_FormatArgumentData_9' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CombatMovement_C_UpdateMovementProgression, K2Node_MakeArray_Array_3) == 0x000480, "Member 'AC_jRPG_CombatMovement_C_UpdateMovementProgression::K2Node_MakeArray_Array_3' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CombatMovement_C_UpdateMovementProgression, CallFunc_AddFloatHistorySample_ReturnValue) == 0x000490, "Member 'AC_jRPG_CombatMovement_C_UpdateMovementProgression::CallFunc_AddFloatHistorySample_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CombatMovement_C_UpdateMovementProgression, CallFunc_Format_ReturnValue_3) == 0x0004B0, "Member 'AC_jRPG_CombatMovement_C_UpdateMovementProgression::CallFunc_Format_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CombatMovement_C_UpdateMovementProgression, CallFunc_Conv_TextToString_ReturnValue) == 0x0004C0, "Member 'AC_jRPG_CombatMovement_C_UpdateMovementProgression::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CombatMovement_C_UpdateMovementProgression, CallFunc_GetOwner_ReturnValue_3) == 0x0004D0, "Member 'AC_jRPG_CombatMovement_C_UpdateMovementProgression::CallFunc_GetOwner_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CombatMovement_C_UpdateMovementProgression, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x0004D8, "Member 'AC_jRPG_CombatMovement_C_UpdateMovementProgression::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CombatMovement_C_UpdateMovementProgression, CallFunc_Conv_VectorToString_ReturnValue_1) == 0x0004F0, "Member 'AC_jRPG_CombatMovement_C_UpdateMovementProgression::CallFunc_Conv_VectorToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CombatMovement_C_UpdateMovementProgression, CallFunc_Conv_StringToText_ReturnValue_2) == 0x000500, "Member 'AC_jRPG_CombatMovement_C_UpdateMovementProgression::CallFunc_Conv_StringToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CombatMovement_C_UpdateMovementProgression, CallFunc_VLerp_ReturnValue) == 0x000510, "Member 'AC_jRPG_CombatMovement_C_UpdateMovementProgression::CallFunc_VLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CombatMovement_C_UpdateMovementProgression, K2Node_MakeStruct_FormatArgumentData_10) == 0x000528, "Member 'AC_jRPG_CombatMovement_C_UpdateMovementProgression::K2Node_MakeStruct_FormatArgumentData_10' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CombatMovement_C_UpdateMovementProgression, CallFunc_GetOwner_ReturnValue_4) == 0x000570, "Member 'AC_jRPG_CombatMovement_C_UpdateMovementProgression::CallFunc_GetOwner_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CombatMovement_C_UpdateMovementProgression, CallFunc_K2_SetActorLocation_SweepHitResult) == 0x000578, "Member 'AC_jRPG_CombatMovement_C_UpdateMovementProgression::CallFunc_K2_SetActorLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CombatMovement_C_UpdateMovementProgression, CallFunc_K2_SetActorLocation_ReturnValue) == 0x000670, "Member 'AC_jRPG_CombatMovement_C_UpdateMovementProgression::CallFunc_K2_SetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CombatMovement_C_UpdateMovementProgression, CallFunc_Conv_BoolToText_ReturnValue_1) == 0x000678, "Member 'AC_jRPG_CombatMovement_C_UpdateMovementProgression::CallFunc_Conv_BoolToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CombatMovement_C_UpdateMovementProgression, K2Node_MakeStruct_FormatArgumentData_11) == 0x000688, "Member 'AC_jRPG_CombatMovement_C_UpdateMovementProgression::K2Node_MakeStruct_FormatArgumentData_11' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CombatMovement_C_UpdateMovementProgression, K2Node_MakeArray_Array_4) == 0x0006D0, "Member 'AC_jRPG_CombatMovement_C_UpdateMovementProgression::K2Node_MakeArray_Array_4' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CombatMovement_C_UpdateMovementProgression, CallFunc_Format_ReturnValue_4) == 0x0006E0, "Member 'AC_jRPG_CombatMovement_C_UpdateMovementProgression::CallFunc_Format_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CombatMovement_C_UpdateMovementProgression, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x0006F0, "Member 'AC_jRPG_CombatMovement_C_UpdateMovementProgression::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CombatMovement_C_UpdateMovementProgression, CallFunc_EqualEqual_DoubleDouble_A_ImplicitCast) == 0x0006F8, "Member 'AC_jRPG_CombatMovement_C_UpdateMovementProgression::CallFunc_EqualEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function AC_jRPG_CombatMovement.AC_jRPG_CombatMovement_C.CallAndResetMovementLatentAction
// 0x0010 (0x0010 - 0x0000)
struct AC_jRPG_CombatMovement_C_CallAndResetMovementLatentAction final
{
public:
	class USF_BlueprintLatentAction*              Temp_wildcard_Variable;                            // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AC_jRPG_CombatMovement_C_CallAndResetMovementLatentAction) == 0x000008, "Wrong alignment on AC_jRPG_CombatMovement_C_CallAndResetMovementLatentAction");
static_assert(sizeof(AC_jRPG_CombatMovement_C_CallAndResetMovementLatentAction) == 0x000010, "Wrong size on AC_jRPG_CombatMovement_C_CallAndResetMovementLatentAction");
static_assert(offsetof(AC_jRPG_CombatMovement_C_CallAndResetMovementLatentAction, Temp_wildcard_Variable) == 0x000000, "Member 'AC_jRPG_CombatMovement_C_CallAndResetMovementLatentAction::Temp_wildcard_Variable' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CombatMovement_C_CallAndResetMovementLatentAction, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'AC_jRPG_CombatMovement_C_CallAndResetMovementLatentAction::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function AC_jRPG_CombatMovement.AC_jRPG_CombatMovement_C.IsMovingTowardsInitialLocation
// 0x0018 (0x0018 - 0x0000)
struct AC_jRPG_CombatMovement_C_IsMovingTowardsInitialLocation final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Vector_Distance_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NearlyEqual_FloatFloat_ReturnValue;       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AC_jRPG_CombatMovement_C_IsMovingTowardsInitialLocation) == 0x000008, "Wrong alignment on AC_jRPG_CombatMovement_C_IsMovingTowardsInitialLocation");
static_assert(sizeof(AC_jRPG_CombatMovement_C_IsMovingTowardsInitialLocation) == 0x000018, "Wrong size on AC_jRPG_CombatMovement_C_IsMovingTowardsInitialLocation");
static_assert(offsetof(AC_jRPG_CombatMovement_C_IsMovingTowardsInitialLocation, ReturnValue) == 0x000000, "Member 'AC_jRPG_CombatMovement_C_IsMovingTowardsInitialLocation::ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CombatMovement_C_IsMovingTowardsInitialLocation, CallFunc_Vector_Distance_ReturnValue) == 0x000008, "Member 'AC_jRPG_CombatMovement_C_IsMovingTowardsInitialLocation::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CombatMovement_C_IsMovingTowardsInitialLocation, CallFunc_NearlyEqual_FloatFloat_ReturnValue) == 0x000010, "Member 'AC_jRPG_CombatMovement_C_IsMovingTowardsInitialLocation::CallFunc_NearlyEqual_FloatFloat_ReturnValue' has a wrong offset!");

// Function AC_jRPG_CombatMovement.AC_jRPG_CombatMovement_C.IsAtInitialLocation
// 0x0038 (0x0038 - 0x0000)
struct AC_jRPG_CombatMovement_C_IsAtInitialLocation final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0010(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Vector_Distance_ReturnValue;              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NearlyEqual_FloatFloat_ReturnValue;       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AC_jRPG_CombatMovement_C_IsAtInitialLocation) == 0x000008, "Wrong alignment on AC_jRPG_CombatMovement_C_IsAtInitialLocation");
static_assert(sizeof(AC_jRPG_CombatMovement_C_IsAtInitialLocation) == 0x000038, "Wrong size on AC_jRPG_CombatMovement_C_IsAtInitialLocation");
static_assert(offsetof(AC_jRPG_CombatMovement_C_IsAtInitialLocation, ReturnValue) == 0x000000, "Member 'AC_jRPG_CombatMovement_C_IsAtInitialLocation::ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CombatMovement_C_IsAtInitialLocation, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'AC_jRPG_CombatMovement_C_IsAtInitialLocation::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CombatMovement_C_IsAtInitialLocation, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000010, "Member 'AC_jRPG_CombatMovement_C_IsAtInitialLocation::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CombatMovement_C_IsAtInitialLocation, CallFunc_Vector_Distance_ReturnValue) == 0x000028, "Member 'AC_jRPG_CombatMovement_C_IsAtInitialLocation::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CombatMovement_C_IsAtInitialLocation, CallFunc_NearlyEqual_FloatFloat_ReturnValue) == 0x000030, "Member 'AC_jRPG_CombatMovement_C_IsAtInitialLocation::CallFunc_NearlyEqual_FloatFloat_ReturnValue' has a wrong offset!");

// Function AC_jRPG_CombatMovement.AC_jRPG_CombatMovement_C.IsAtInitialLocationOrAboutToBe
// 0x0038 (0x0038 - 0x0000)
struct AC_jRPG_CombatMovement_C_IsAtInitialLocationOrAboutToBe final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAtInitialLocation_ReturnValue;          // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0010(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Vector_Distance_ReturnValue;              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NearlyEqual_FloatFloat_ReturnValue;       // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AC_jRPG_CombatMovement_C_IsAtInitialLocationOrAboutToBe) == 0x000008, "Wrong alignment on AC_jRPG_CombatMovement_C_IsAtInitialLocationOrAboutToBe");
static_assert(sizeof(AC_jRPG_CombatMovement_C_IsAtInitialLocationOrAboutToBe) == 0x000038, "Wrong size on AC_jRPG_CombatMovement_C_IsAtInitialLocationOrAboutToBe");
static_assert(offsetof(AC_jRPG_CombatMovement_C_IsAtInitialLocationOrAboutToBe, ReturnValue) == 0x000000, "Member 'AC_jRPG_CombatMovement_C_IsAtInitialLocationOrAboutToBe::ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CombatMovement_C_IsAtInitialLocationOrAboutToBe, CallFunc_IsAtInitialLocation_ReturnValue) == 0x000001, "Member 'AC_jRPG_CombatMovement_C_IsAtInitialLocationOrAboutToBe::CallFunc_IsAtInitialLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CombatMovement_C_IsAtInitialLocationOrAboutToBe, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'AC_jRPG_CombatMovement_C_IsAtInitialLocationOrAboutToBe::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CombatMovement_C_IsAtInitialLocationOrAboutToBe, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000010, "Member 'AC_jRPG_CombatMovement_C_IsAtInitialLocationOrAboutToBe::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CombatMovement_C_IsAtInitialLocationOrAboutToBe, CallFunc_Vector_Distance_ReturnValue) == 0x000028, "Member 'AC_jRPG_CombatMovement_C_IsAtInitialLocationOrAboutToBe::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CombatMovement_C_IsAtInitialLocationOrAboutToBe, CallFunc_Not_PreBool_ReturnValue) == 0x000030, "Member 'AC_jRPG_CombatMovement_C_IsAtInitialLocationOrAboutToBe::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CombatMovement_C_IsAtInitialLocationOrAboutToBe, CallFunc_NearlyEqual_FloatFloat_ReturnValue) == 0x000031, "Member 'AC_jRPG_CombatMovement_C_IsAtInitialLocationOrAboutToBe::CallFunc_NearlyEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CombatMovement_C_IsAtInitialLocationOrAboutToBe, CallFunc_BooleanAND_ReturnValue) == 0x000032, "Member 'AC_jRPG_CombatMovement_C_IsAtInitialLocationOrAboutToBe::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CombatMovement_C_IsAtInitialLocationOrAboutToBe, CallFunc_BooleanOR_ReturnValue) == 0x000033, "Member 'AC_jRPG_CombatMovement_C_IsAtInitialLocationOrAboutToBe::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function AC_jRPG_CombatMovement.AC_jRPG_CombatMovement_C.StartMovementToCharacter
// 0x01C0 (0x01C0 - 0x0000)
struct AC_jRPG_CombatMovement_C_StartMovementToCharacter final
{
public:
	class ABP_jRPG_Character_Battle_Base_C*       OtherCharacter;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           MontageToPlay;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         PlayRate;                                          // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Distance;                                          // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Angle;                                             // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          AbsoluteAngle;                                     // 0x0028(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USF_BlueprintLatentAction*              LatentAction;                                      // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                TargetLocation_0;                                  // 0x0038(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue_1;             // 0x0098(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x00A8(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x00B8(0x0048)(HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_2;                   // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_jRPG_Character_Battle_Base_C*       K2Node_DynamicCast_AsBP_J_RPG_Character_Battle_Base; // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue_2;             // 0x0120(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Compute_Move_to_Character_Transform_NewParam; // 0x0130(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0148(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0158(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x01A0(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Format_ReturnValue;                       // 0x01B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(AC_jRPG_CombatMovement_C_StartMovementToCharacter) == 0x000008, "Wrong alignment on AC_jRPG_CombatMovement_C_StartMovementToCharacter");
static_assert(sizeof(AC_jRPG_CombatMovement_C_StartMovementToCharacter) == 0x0001C0, "Wrong size on AC_jRPG_CombatMovement_C_StartMovementToCharacter");
static_assert(offsetof(AC_jRPG_CombatMovement_C_StartMovementToCharacter, OtherCharacter) == 0x000000, "Member 'AC_jRPG_CombatMovement_C_StartMovementToCharacter::OtherCharacter' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CombatMovement_C_StartMovementToCharacter, MontageToPlay) == 0x000008, "Member 'AC_jRPG_CombatMovement_C_StartMovementToCharacter::MontageToPlay' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CombatMovement_C_StartMovementToCharacter, PlayRate) == 0x000010, "Member 'AC_jRPG_CombatMovement_C_StartMovementToCharacter::PlayRate' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CombatMovement_C_StartMovementToCharacter, Distance) == 0x000018, "Member 'AC_jRPG_CombatMovement_C_StartMovementToCharacter::Distance' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CombatMovement_C_StartMovementToCharacter, Angle) == 0x000020, "Member 'AC_jRPG_CombatMovement_C_StartMovementToCharacter::Angle' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CombatMovement_C_StartMovementToCharacter, AbsoluteAngle) == 0x000028, "Member 'AC_jRPG_CombatMovement_C_StartMovementToCharacter::AbsoluteAngle' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CombatMovement_C_StartMovementToCharacter, LatentAction) == 0x000030, "Member 'AC_jRPG_CombatMovement_C_StartMovementToCharacter::LatentAction' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CombatMovement_C_StartMovementToCharacter, TargetLocation_0) == 0x000038, "Member 'AC_jRPG_CombatMovement_C_StartMovementToCharacter::TargetLocation_0' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CombatMovement_C_StartMovementToCharacter, CallFunc_GetOwner_ReturnValue) == 0x000050, "Member 'AC_jRPG_CombatMovement_C_StartMovementToCharacter::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CombatMovement_C_StartMovementToCharacter, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000058, "Member 'AC_jRPG_CombatMovement_C_StartMovementToCharacter::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CombatMovement_C_StartMovementToCharacter, CallFunc_GetDisplayName_ReturnValue) == 0x000070, "Member 'AC_jRPG_CombatMovement_C_StartMovementToCharacter::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CombatMovement_C_StartMovementToCharacter, CallFunc_Concat_StrStr_ReturnValue) == 0x000080, "Member 'AC_jRPG_CombatMovement_C_StartMovementToCharacter::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CombatMovement_C_StartMovementToCharacter, CallFunc_IsValid_ReturnValue) == 0x000090, "Member 'AC_jRPG_CombatMovement_C_StartMovementToCharacter::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CombatMovement_C_StartMovementToCharacter, CallFunc_GetDisplayName_ReturnValue_1) == 0x000098, "Member 'AC_jRPG_CombatMovement_C_StartMovementToCharacter::CallFunc_GetDisplayName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CombatMovement_C_StartMovementToCharacter, CallFunc_Conv_StringToText_ReturnValue) == 0x0000A8, "Member 'AC_jRPG_CombatMovement_C_StartMovementToCharacter::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CombatMovement_C_StartMovementToCharacter, K2Node_MakeStruct_FormatArgumentData) == 0x0000B8, "Member 'AC_jRPG_CombatMovement_C_StartMovementToCharacter::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CombatMovement_C_StartMovementToCharacter, CallFunc_GetOwner_ReturnValue_1) == 0x000100, "Member 'AC_jRPG_CombatMovement_C_StartMovementToCharacter::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CombatMovement_C_StartMovementToCharacter, CallFunc_GetOwner_ReturnValue_2) == 0x000108, "Member 'AC_jRPG_CombatMovement_C_StartMovementToCharacter::CallFunc_GetOwner_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CombatMovement_C_StartMovementToCharacter, K2Node_DynamicCast_AsBP_J_RPG_Character_Battle_Base) == 0x000110, "Member 'AC_jRPG_CombatMovement_C_StartMovementToCharacter::K2Node_DynamicCast_AsBP_J_RPG_Character_Battle_Base' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CombatMovement_C_StartMovementToCharacter, K2Node_DynamicCast_bSuccess) == 0x000118, "Member 'AC_jRPG_CombatMovement_C_StartMovementToCharacter::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CombatMovement_C_StartMovementToCharacter, CallFunc_GetDisplayName_ReturnValue_2) == 0x000120, "Member 'AC_jRPG_CombatMovement_C_StartMovementToCharacter::CallFunc_GetDisplayName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CombatMovement_C_StartMovementToCharacter, CallFunc_Compute_Move_to_Character_Transform_NewParam) == 0x000130, "Member 'AC_jRPG_CombatMovement_C_StartMovementToCharacter::CallFunc_Compute_Move_to_Character_Transform_NewParam' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CombatMovement_C_StartMovementToCharacter, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000148, "Member 'AC_jRPG_CombatMovement_C_StartMovementToCharacter::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CombatMovement_C_StartMovementToCharacter, K2Node_MakeStruct_FormatArgumentData_1) == 0x000158, "Member 'AC_jRPG_CombatMovement_C_StartMovementToCharacter::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CombatMovement_C_StartMovementToCharacter, K2Node_MakeArray_Array) == 0x0001A0, "Member 'AC_jRPG_CombatMovement_C_StartMovementToCharacter::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CombatMovement_C_StartMovementToCharacter, CallFunc_Format_ReturnValue) == 0x0001B0, "Member 'AC_jRPG_CombatMovement_C_StartMovementToCharacter::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function AC_jRPG_CombatMovement.AC_jRPG_CombatMovement_C.GetCurrentCurveValue
// 0x0110 (0x0110 - 0x0000)
struct AC_jRPG_CombatMovement_C_GetCurrentCurveValue final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_ObjectToText_ReturnValue;            // 0x0010(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0020(0x0048)(HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             K2Node_DynamicCast_AsCharacter;                    // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_ObjectToText_ReturnValue_1;          // 0x0088(0x0010)()
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00A0(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00E8(0x0010)(ReferenceParm)
	float                                         CallFunc_GetCurveValue_ReturnValue;                // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Format_ReturnValue;                       // 0x0100(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(AC_jRPG_CombatMovement_C_GetCurrentCurveValue) == 0x000008, "Wrong alignment on AC_jRPG_CombatMovement_C_GetCurrentCurveValue");
static_assert(sizeof(AC_jRPG_CombatMovement_C_GetCurrentCurveValue) == 0x000110, "Wrong size on AC_jRPG_CombatMovement_C_GetCurrentCurveValue");
static_assert(offsetof(AC_jRPG_CombatMovement_C_GetCurrentCurveValue, ReturnValue) == 0x000000, "Member 'AC_jRPG_CombatMovement_C_GetCurrentCurveValue::ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CombatMovement_C_GetCurrentCurveValue, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'AC_jRPG_CombatMovement_C_GetCurrentCurveValue::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CombatMovement_C_GetCurrentCurveValue, CallFunc_Conv_ObjectToText_ReturnValue) == 0x000010, "Member 'AC_jRPG_CombatMovement_C_GetCurrentCurveValue::CallFunc_Conv_ObjectToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CombatMovement_C_GetCurrentCurveValue, K2Node_MakeStruct_FormatArgumentData) == 0x000020, "Member 'AC_jRPG_CombatMovement_C_GetCurrentCurveValue::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CombatMovement_C_GetCurrentCurveValue, CallFunc_GetOwner_ReturnValue_1) == 0x000068, "Member 'AC_jRPG_CombatMovement_C_GetCurrentCurveValue::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CombatMovement_C_GetCurrentCurveValue, K2Node_DynamicCast_AsCharacter) == 0x000070, "Member 'AC_jRPG_CombatMovement_C_GetCurrentCurveValue::K2Node_DynamicCast_AsCharacter' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CombatMovement_C_GetCurrentCurveValue, K2Node_DynamicCast_bSuccess) == 0x000078, "Member 'AC_jRPG_CombatMovement_C_GetCurrentCurveValue::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CombatMovement_C_GetCurrentCurveValue, CallFunc_GetAnimInstance_ReturnValue) == 0x000080, "Member 'AC_jRPG_CombatMovement_C_GetCurrentCurveValue::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CombatMovement_C_GetCurrentCurveValue, CallFunc_Conv_ObjectToText_ReturnValue_1) == 0x000088, "Member 'AC_jRPG_CombatMovement_C_GetCurrentCurveValue::CallFunc_Conv_ObjectToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CombatMovement_C_GetCurrentCurveValue, CallFunc_Not_PreBool_ReturnValue) == 0x000098, "Member 'AC_jRPG_CombatMovement_C_GetCurrentCurveValue::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CombatMovement_C_GetCurrentCurveValue, K2Node_MakeStruct_FormatArgumentData_1) == 0x0000A0, "Member 'AC_jRPG_CombatMovement_C_GetCurrentCurveValue::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CombatMovement_C_GetCurrentCurveValue, K2Node_MakeArray_Array) == 0x0000E8, "Member 'AC_jRPG_CombatMovement_C_GetCurrentCurveValue::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CombatMovement_C_GetCurrentCurveValue, CallFunc_GetCurveValue_ReturnValue) == 0x0000F8, "Member 'AC_jRPG_CombatMovement_C_GetCurrentCurveValue::CallFunc_GetCurveValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CombatMovement_C_GetCurrentCurveValue, CallFunc_Format_ReturnValue) == 0x000100, "Member 'AC_jRPG_CombatMovement_C_GetCurrentCurveValue::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function AC_jRPG_CombatMovement.AC_jRPG_CombatMovement_C.UpdateMovement
// 0x00D8 (0x00D8 - 0x0000)
struct AC_jRPG_CombatMovement_C_UpdateMovement final
{
public:
	struct FVector                                local_newLocation;                                 // 0x0000(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         local_currentCurveValue;                           // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCurrentCurveValue_ReturnValue;         // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_VectorToString_ReturnValue;          // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0050(0x0010)()
	bool                                          CallFunc_DoesLocationMatch_Result;                 // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0068(0x0048)(HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00B8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00C8(0x0010)()
};
static_assert(alignof(AC_jRPG_CombatMovement_C_UpdateMovement) == 0x000008, "Wrong alignment on AC_jRPG_CombatMovement_C_UpdateMovement");
static_assert(sizeof(AC_jRPG_CombatMovement_C_UpdateMovement) == 0x0000D8, "Wrong size on AC_jRPG_CombatMovement_C_UpdateMovement");
static_assert(offsetof(AC_jRPG_CombatMovement_C_UpdateMovement, local_newLocation) == 0x000000, "Member 'AC_jRPG_CombatMovement_C_UpdateMovement::local_newLocation' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CombatMovement_C_UpdateMovement, local_currentCurveValue) == 0x000018, "Member 'AC_jRPG_CombatMovement_C_UpdateMovement::local_currentCurveValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CombatMovement_C_UpdateMovement, CallFunc_GetCurrentCurveValue_ReturnValue) == 0x00001C, "Member 'AC_jRPG_CombatMovement_C_UpdateMovement::CallFunc_GetCurrentCurveValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CombatMovement_C_UpdateMovement, CallFunc_GetOwner_ReturnValue) == 0x000020, "Member 'AC_jRPG_CombatMovement_C_UpdateMovement::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CombatMovement_C_UpdateMovement, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000028, "Member 'AC_jRPG_CombatMovement_C_UpdateMovement::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CombatMovement_C_UpdateMovement, CallFunc_Conv_VectorToString_ReturnValue) == 0x000040, "Member 'AC_jRPG_CombatMovement_C_UpdateMovement::CallFunc_Conv_VectorToString_ReturnValue' has a wrong offset!");
