#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AC_jRPG_CharacterBattleStats

#include "Basic.hpp"

#include "S_jRPG_Item_StaticData_structs.hpp"
#include "E_jRPG_StatType_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "S_jRPG_OverdriveSource_structs.hpp"
#include "StatMultiplier_structs.hpp"
#include "E_jRPG_ActionType_structs.hpp"
#include "EElementalAffinity_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "E_jRPG_ItemType_structs.hpp"
#include "FCharacterStats_structs.hpp"
#include "FEquipmentSlot_structs.hpp"
#include "ECharacterTeamSelector_structs.hpp"
#include "SandFall_structs.hpp"
#include "FPassiveEffect_structs.hpp"
#include "EAttackType_structs.hpp"
#include "S_ResurrectParameters_structs.hpp"
#include "EDamageReason_structs.hpp"
#include "E_BreakStunReason_structs.hpp"
#include "ERuntimeBattleStatType_structs.hpp"
#include "EBuffApplicationProbability_structs.hpp"
#include "EAPChangeReason_structs.hpp"
#include "EHealReason_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass AC_jRPG_CharacterBattleStats.AC_jRPG_CharacterBattleStats_C
// 0x0708 (0x07A8 - 0x00A0)
class UAC_jRPG_CharacterBattleStats_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class FName                                   CharacterHardcodedName;                            // 0x00A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             CharacterBattleIcon;                               // 0x00B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FText                                   CharacterDisplayName;                              // 0x00B8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<E_jRPG_StatType, double>                 CharacterBaseStats;                                // 0x00C8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, AdvancedDisplay)
	TMap<E_jRPG_StatType, double>                 CharacterCurrentStats;                             // 0x0118(0x0050)(Edit, BlueprintVisible, Transient, DisableEditOnInstance, AdvancedDisplay)
	double                                        CurrentHP;                                         // 0x0168(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	int32                                         CurrentShieldPoints;                               // 0x0170(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_174[0x4];                                      // 0x0174(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CurrentAP;                                         // 0x0178(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	double                                        CurrentInitiative;                                 // 0x0180(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	bool                                          Defending;                                         // 0x0188(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	uint8                                         Pad_189[0x7];                                      // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAC_jRPG_BattleManager_C*               BattleManagerReference;                            // 0x0190(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	class UBP_jRPG_GI_Custom_C*                   GameInstanceReference;                             // 0x0198(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	E_jRPG_ActionType                             SelectedActionType;                                // 0x01A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A1[0x3];                                      // 0x01A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   SelectedSecondaryActionName;                       // 0x01A4(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1AC[0x4];                                      // 0x01AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_jRPG_Character_Battle_Base_C*> TargetedCharacters;                              // 0x01B0(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	double                                        CurrentPower;                                      // 0x01C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	TMap<E_jRPG_ItemType, struct FS_jRPG_Item_StaticData> EquipmentLegacy;                           // 0x01C8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	double                                        BuffPower;                                         // 0x0218(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        OriginalPower;                                     // 0x0220(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_BattleBuffComponent_C*              BattleBuffComponent;                               // 0x0228(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TMap<struct FGuid, struct FStatMultiplier>    CharacterStatMultipliers;                          // 0x0230(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class FName, int32>                      SkillsLearnt;                                      // 0x0280(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, Deprecated)
	double                                        CurrentOverdrive;                                  // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	struct FS_jRPG_OverdriveSource                OverdriveSources;                                  // 0x02D8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SimulatedDamage_;                                  // 0x02E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E9[0x3];                                      // 0x02E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         TurnSkipRefCount;                                  // 0x02EC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(class UBP_BattleBuffInstance_C* BuffInstance)> OnBuffAdded;        // 0x02F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(class UBP_BattleBuffInstance_C* BuffInstance)> OnBuffRemoved;      // 0x0300(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(double NewHP, double PreviousHP)> OnHPChanged;                     // 0x0310(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(int32 CurrentValue, int32 PreviousValue)> OnShieldPointsChanged;   // 0x0320(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnCharacterInitialized;                            // 0x0330(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UWBP_HUD_Battle_CharacterPortrait_C*    CharacterBattleSlotWidget;                         // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          HasReceivedHitDuringCurrentSkill;                  // 0x0348(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HasParriedAllHitsDuringCurrentSkill;               // 0x0349(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34A[0x6];                                      // 0x034A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           ActiveChecks;                                      // 0x0350(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FName                                   Check_CanRecoverHP;                                // 0x0360(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Check_IsAlive;                                     // 0x0368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Check_IsMaxedHP;                                   // 0x0370(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Check_CanResurrect;                                // 0x0378(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_BattleCheckContext_C*               TargetingCheckContext;                             // 0x0380(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UBP_BattleCheckContext_C*               BattleActionCheckContext;                          // 0x0388(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(int32 NewAP, int32 PreviousAP, class UAC_jRPG_CharacterBattleStats_C* CharacterStats)> OnAPChanged; // 0x0390(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	int32                                         APDefendCost;                                      // 0x03A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         APDodgeCost;                                       // 0x03A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         APParryCost;                                       // 0x03A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         APNewTurnGain;                                     // 0x03AC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         APGainParry;                                       // 0x03B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         APGainAttack;                                      // 0x03B4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFCharacterStats                       CharacterStats;                                    // 0x03B8(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         APTurnStartBonus;                                  // 0x03E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3EC[0x4];                                      // 0x03EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(class UBP_BattleEvent_APChange_C* APChangeEvent)> OnAPChangedEvent; // 0x03F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnDeath;                                           // 0x0400(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	int32                                         DefenseLockRefCount;                               // 0x0410(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsStun;                                            // 0x0414(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_415[0x3];                                      // 0x0415(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<struct FFEquipmentSlot, struct FS_jRPG_Item_StaticData> Equipment;                          // 0x0418(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, Deprecated, ContainsInstancedReference)
	int64                                         StunBreakBarCurrent;                               // 0x0468(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         StunBreakBarMax;                                   // 0x0470(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSF_ReferenceCounter                   BreakDamageBlockerRefCount;                        // 0x0478(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          HasEngagementBonus;                                // 0x0498(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_499[0x7];                                      // 0x0499(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class UBP_BattleBuffInstance_C*, struct FFPassiveEffect> BuffToPassiveMap;                  // 0x04A0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class UBP_BattleBuffInstance_C*, class FName> BuffToPassiveIDsMap;                          // 0x04F0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          IsBoss;                                            // 0x0540(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_541[0x7];                                      // 0x0541(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSF_ReferenceCounter                   PreventDeathRefCount;                              // 0x0548(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          IsCurrentAttackUndodgeable;                        // 0x0568(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsCurrentAttackUnblockable;                        // 0x0569(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsCurrentAttackGradient;                           // 0x056A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsCurrentAttackJumpable;                           // 0x056B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_56C[0x4];                                      // 0x056C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 AutomaticCounterSkill;                             // 0x0570(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class UBP_DataAsset_Skill_C*>          Skills;                                            // 0x0578(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class UBP_DataAsset_Skill_C*, class UBP_SkillState_C*> SkillStates;                         // 0x0588(0x0050)(Edit, BlueprintVisible, Transient, DisableEditOnInstance)
	bool                                          GradientAttackPpIsOn;                              // 0x05D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsFleeing;                                         // 0x05D9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5DA[0x6];                                      // 0x05DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAC_jRPG_CharacterBattleStats_C*        PuppetedBy;                                        // 0x05E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UBP_SkillDataComponentScript_C*> BattleStartEvent_ToProcess_SkillDataComponent;     // 0x05E8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UBP_DependencyRefCounter_C*             BattleStartNotifyDependencies;                     // 0x05F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FSF_ReferenceCounter                   DodgeLock;                                         // 0x0600(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMulticastInlineDelegate<void(class UBP_BattleDamages_C* BattleDamages)> OnDamageReceived;       // 0x0620(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          IsPerformingLastStand;                             // 0x0630(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShouldInterceptAllTeamAttacks;                     // 0x0631(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_632[0x6];                                      // 0x0632(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UAC_jRPG_CharacterBattleStats_C*> CharactersToProtectWithInterception;              // 0x0638(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class UAC_jRPG_CharacterBattleStats_C*        CurrentInterceptedCharacter;                       // 0x0648(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FSF_ReferenceCounter                   DamageLimitUnlockRefCount;                         // 0x0650(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	EAttackType                                   BaseDamageType;                                    // 0x0670(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAttackType                                   FreeAimDamageType;                                 // 0x0671(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_672[0x6];                                      // 0x0672(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_ResurrectParameters                 NextResurrectParameters;                           // 0x0678(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(class UAC_jRPG_CharacterBattleStats_C* SelfCharacter, class UAC_jRPG_CharacterBattleStats_C* SourceCharacter, int32 PreviousValue)> OnBreakDamageReceived; // 0x0690(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(class UAC_jRPG_CharacterBattleStats_C* SelfCharacter)> OnBreakBarStun; // 0x06A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(class UAC_jRPG_CharacterBattleStats_C* Character, class FName ShardID, class FName ConsumableID)> OnConsumableActionEffect; // 0x06B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(class UObject* CharacterStats)> OnDeathDamagePrevented;            // 0x06C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          IsFlying;                                          // 0x06D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6D1[0x7];                                      // 0x06D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSF_ReferenceCounter                   ForceAutoAttackRefCount;                           // 0x06D8(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMulticastInlineDelegate<void(int32 Amount, class UBP_BattleDamages_C* BattleDamages)> OnDamageAbsorbed; // 0x06F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class ABP_Battle_SkillScript_C*               ForcedSkillOnNextTurn;                             // 0x0708(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FSF_ReferenceCounter                   ParryLock;                                         // 0x0710(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMulticastInlineDelegate<void(class UBP_SkillState_C* SkillState)> OnSkillPreExecution;          // 0x0730(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FSF_ModifierStackWrapper               DodgeWindowModifierStack;                          // 0x0740(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, ContainsInstancedReference)
	struct FSF_ModifierStackWrapper               ParryWindowModifierStack;                          // 0x0748(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, ContainsInstancedReference)
	TMulticastInlineDelegate<void()>              OnPerfectDodge;                                    // 0x0750(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	ETextGender                                   GenderTag;                                         // 0x0760(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsPreparedForBattle;                              // 0x0761(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsDeathQueuedForTurnEnd;                          // 0x0762(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_763[0x5];                                      // 0x0763(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UAction_AddBuff_C*>              NestedAddBuffActionStack;                          // 0x0768(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSF_ReferenceCounter                   SilenceRefCounts;                                  // 0x0778(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMulticastInlineDelegate<void()>              OnSkillStatesInitialized;                          // 0x0798(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void GetDamageSourceCharacter(class UAC_jRPG_CharacterBattleStats_C** CharacterStats_0);
	void GetDamageSourceType(EDamageReason* DamageSourceType);
	void NotifySkillStatesAvailable();
	bool CanCounterAttackCurrentEnemySkill();
	bool IsDeathQueuedForTurnEnd();
	void ClearSkillStates();
	void SetDead_Internal();
	bool IsPreparedForBattle();
	ETextGender GetGenderTag();
	void TryDodgeHitFromCharacter(class UAC_jRPG_CharacterBattleStats_C* AttackingCharacter, bool* Successful, bool* IsPerfectDodge);
	void TryParryHitFromCharacter(class UAC_jRPG_CharacterBattleStats_C* AttackingCharacter, bool* Successful);
	void GetParryWindowModifier(class UModifierStack_Float** Stack);
	void RemoveParryWindowModifier(struct FSF_ModifierStackEntryHandle& OutModifierHandle);
