#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AC_jRPG_CharacterBattleStats

#include "Basic.hpp"

#include "E_jRPG_StatType_structs.hpp"
#include "EDamageReason_structs.hpp"
#include "SandFall_structs.hpp"
#include "ECharacterTeamSelector_structs.hpp"
#include "S_jRPG_Enemy_structs.hpp"
#include "S_jRPG_OverdriveSource_structs.hpp"
#include "Engine_structs.hpp"
#include "E_BreakStunReason_structs.hpp"
#include "S_ResurrectParameters_structs.hpp"
#include "EAttackType_structs.hpp"
#include "EElementalAffinity_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FDamageModifier_structs.hpp"
#include "ERuntimeBattleStatType_structs.hpp"
#include "EBuffApplicationProbability_structs.hpp"
#include "FPassiveEffect_structs.hpp"
#include "EAPChangeReason_structs.hpp"
#include "S_WeaponDefinition_structs.hpp"
#include "StatMultiplier_structs.hpp"
#include "EHealReason_structs.hpp"
#include "FCharacterStats_structs.hpp"


namespace SDK::Params
{

// Function AC_jRPG_CharacterBattleStats.AC_jRPG_CharacterBattleStats_C.GetDamageSourceCharacter
// 0x0010 (0x0010 - 0x0000)
struct AC_jRPG_CharacterBattleStats_C_GetDamageSourceCharacter final
{
public:
	class UAC_jRPG_CharacterBattleStats_C*        CharacterStats_0;                                  // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AC_jRPG_CharacterBattleStats_C_GetDamageSourceCharacter) == 0x000008, "Wrong alignment on AC_jRPG_CharacterBattleStats_C_GetDamageSourceCharacter");
static_assert(sizeof(AC_jRPG_CharacterBattleStats_C_GetDamageSourceCharacter) == 0x000010, "Wrong size on AC_jRPG_CharacterBattleStats_C_GetDamageSourceCharacter");
static_assert(offsetof(AC_jRPG_CharacterBattleStats_C_GetDamageSourceCharacter, CharacterStats_0) == 0x000000, "Member 'AC_jRPG_CharacterBattleStats_C_GetDamageSourceCharacter::CharacterStats_0' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharacterBattleStats_C_GetDamageSourceCharacter, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'AC_jRPG_CharacterBattleStats_C_GetDamageSourceCharacter::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function AC_jRPG_CharacterBattleStats.AC_jRPG_CharacterBattleStats_C.GetDamageSourceType
// 0x0001 (0x0001 - 0x0000)
struct AC_jRPG_CharacterBattleStats_C_GetDamageSourceType final
{
public:
	EDamageReason                                 DamageSourceType;                                  // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AC_jRPG_CharacterBattleStats_C_GetDamageSourceType) == 0x000001, "Wrong alignment on AC_jRPG_CharacterBattleStats_C_GetDamageSourceType");
static_assert(sizeof(AC_jRPG_CharacterBattleStats_C_GetDamageSourceType) == 0x000001, "Wrong size on AC_jRPG_CharacterBattleStats_C_GetDamageSourceType");
static_assert(offsetof(AC_jRPG_CharacterBattleStats_C_GetDamageSourceType, DamageSourceType) == 0x000000, "Member 'AC_jRPG_CharacterBattleStats_C_GetDamageSourceType::DamageSourceType' has a wrong offset!");

// Function AC_jRPG_CharacterBattleStats.AC_jRPG_CharacterBattleStats_C.NotifySkillStatesAvailable
// 0x0020 (0x0020 - 0x0000)
struct AC_jRPG_CharacterBattleStats_C_NotifySkillStatesAvailable final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_BattleBuffInstanceWrapper_C*        CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AC_jRPG_CharacterBattleStats_C_NotifySkillStatesAvailable) == 0x000008, "Wrong alignment on AC_jRPG_CharacterBattleStats_C_NotifySkillStatesAvailable");
static_assert(sizeof(AC_jRPG_CharacterBattleStats_C_NotifySkillStatesAvailable) == 0x000020, "Wrong size on AC_jRPG_CharacterBattleStats_C_NotifySkillStatesAvailable");
static_assert(offsetof(AC_jRPG_CharacterBattleStats_C_NotifySkillStatesAvailable, Temp_int_Array_Index_Variable) == 0x000000, "Member 'AC_jRPG_CharacterBattleStats_C_NotifySkillStatesAvailable::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharacterBattleStats_C_NotifySkillStatesAvailable, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'AC_jRPG_CharacterBattleStats_C_NotifySkillStatesAvailable::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharacterBattleStats_C_NotifySkillStatesAvailable, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'AC_jRPG_CharacterBattleStats_C_NotifySkillStatesAvailable::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharacterBattleStats_C_NotifySkillStatesAvailable, CallFunc_Array_Length_ReturnValue) == 0x00000C, "Member 'AC_jRPG_CharacterBattleStats_C_NotifySkillStatesAvailable::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharacterBattleStats_C_NotifySkillStatesAvailable, CallFunc_Array_Get_Item) == 0x000010, "Member 'AC_jRPG_CharacterBattleStats_C_NotifySkillStatesAvailable::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharacterBattleStats_C_NotifySkillStatesAvailable, CallFunc_Less_IntInt_ReturnValue) == 0x000018, "Member 'AC_jRPG_CharacterBattleStats_C_NotifySkillStatesAvailable::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function AC_jRPG_CharacterBattleStats.AC_jRPG_CharacterBattleStats_C.CanCounterAttackCurrentEnemySkill
// 0x0001 (0x0001 - 0x0000)
struct AC_jRPG_CharacterBattleStats_C_CanCounterAttackCurrentEnemySkill final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AC_jRPG_CharacterBattleStats_C_CanCounterAttackCurrentEnemySkill) == 0x000001, "Wrong alignment on AC_jRPG_CharacterBattleStats_C_CanCounterAttackCurrentEnemySkill");
static_assert(sizeof(AC_jRPG_CharacterBattleStats_C_CanCounterAttackCurrentEnemySkill) == 0x000001, "Wrong size on AC_jRPG_CharacterBattleStats_C_CanCounterAttackCurrentEnemySkill");
static_assert(offsetof(AC_jRPG_CharacterBattleStats_C_CanCounterAttackCurrentEnemySkill, ReturnValue) == 0x000000, "Member 'AC_jRPG_CharacterBattleStats_C_CanCounterAttackCurrentEnemySkill::ReturnValue' has a wrong offset!");

// Function AC_jRPG_CharacterBattleStats.AC_jRPG_CharacterBattleStats_C.IsDeathQueuedForTurnEnd
// 0x0001 (0x0001 - 0x0000)
struct AC_jRPG_CharacterBattleStats_C_IsDeathQueuedForTurnEnd final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AC_jRPG_CharacterBattleStats_C_IsDeathQueuedForTurnEnd) == 0x000001, "Wrong alignment on AC_jRPG_CharacterBattleStats_C_IsDeathQueuedForTurnEnd");
static_assert(sizeof(AC_jRPG_CharacterBattleStats_C_IsDeathQueuedForTurnEnd) == 0x000001, "Wrong size on AC_jRPG_CharacterBattleStats_C_IsDeathQueuedForTurnEnd");
static_assert(offsetof(AC_jRPG_CharacterBattleStats_C_IsDeathQueuedForTurnEnd, ReturnValue) == 0x000000, "Member 'AC_jRPG_CharacterBattleStats_C_IsDeathQueuedForTurnEnd::ReturnValue' has a wrong offset!");

// Function AC_jRPG_CharacterBattleStats.AC_jRPG_CharacterBattleStats_C.ClearSkillStates
// 0x0038 (0x0038 - 0x0000)
struct AC_jRPG_CharacterBattleStats_C_ClearSkillStates final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UBP_SkillState_C*>               CallFunc_Map_Values_Values;                        // 0x0010(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_SkillState_C*                       CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AC_jRPG_CharacterBattleStats_C_ClearSkillStates) == 0x000008, "Wrong alignment on AC_jRPG_CharacterBattleStats_C_ClearSkillStates");
static_assert(sizeof(AC_jRPG_CharacterBattleStats_C_ClearSkillStates) == 0x000038, "Wrong size on AC_jRPG_CharacterBattleStats_C_ClearSkillStates");
static_assert(offsetof(AC_jRPG_CharacterBattleStats_C_ClearSkillStates, Temp_int_Array_Index_Variable) == 0x000000, "Member 'AC_jRPG_CharacterBattleStats_C_ClearSkillStates::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharacterBattleStats_C_ClearSkillStates, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'AC_jRPG_CharacterBattleStats_C_ClearSkillStates::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharacterBattleStats_C_ClearSkillStates, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'AC_jRPG_CharacterBattleStats_C_ClearSkillStates::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharacterBattleStats_C_ClearSkillStates, CallFunc_Map_Values_Values) == 0x000010, "Member 'AC_jRPG_CharacterBattleStats_C_ClearSkillStates::CallFunc_Map_Values_Values' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharacterBattleStats_C_ClearSkillStates, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'AC_jRPG_CharacterBattleStats_C_ClearSkillStates::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharacterBattleStats_C_ClearSkillStates, CallFunc_Array_Get_Item) == 0x000028, "Member 'AC_jRPG_CharacterBattleStats_C_ClearSkillStates::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharacterBattleStats_C_ClearSkillStates, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'AC_jRPG_CharacterBattleStats_C_ClearSkillStates::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function AC_jRPG_CharacterBattleStats.AC_jRPG_CharacterBattleStats_C.SetDead_Internal
// 0x0010 (0x0010 - 0x0000)
struct AC_jRPG_CharacterBattleStats_C_SetDead_Internal final
{
public:
	class ABP_jRPG_Character_Battle_Base_C*       CallFunc_GetCharacterBattleBase_jRPG_CharacterBattleBase; // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetCharacterBattleBase_IsValid;           // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AC_jRPG_CharacterBattleStats_C_SetDead_Internal) == 0x000008, "Wrong alignment on AC_jRPG_CharacterBattleStats_C_SetDead_Internal");
static_assert(sizeof(AC_jRPG_CharacterBattleStats_C_SetDead_Internal) == 0x000010, "Wrong size on AC_jRPG_CharacterBattleStats_C_SetDead_Internal");
static_assert(offsetof(AC_jRPG_CharacterBattleStats_C_SetDead_Internal, CallFunc_GetCharacterBattleBase_jRPG_CharacterBattleBase) == 0x000000, "Member 'AC_jRPG_CharacterBattleStats_C_SetDead_Internal::CallFunc_GetCharacterBattleBase_jRPG_CharacterBattleBase' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharacterBattleStats_C_SetDead_Internal, CallFunc_GetCharacterBattleBase_IsValid) == 0x000008, "Member 'AC_jRPG_CharacterBattleStats_C_SetDead_Internal::CallFunc_GetCharacterBattleBase_IsValid' has a wrong offset!");

// Function AC_jRPG_CharacterBattleStats.AC_jRPG_CharacterBattleStats_C.IsPreparedForBattle
// 0x0001 (0x0001 - 0x0000)
struct AC_jRPG_CharacterBattleStats_C_IsPreparedForBattle final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AC_jRPG_CharacterBattleStats_C_IsPreparedForBattle) == 0x000001, "Wrong alignment on AC_jRPG_CharacterBattleStats_C_IsPreparedForBattle");
static_assert(sizeof(AC_jRPG_CharacterBattleStats_C_IsPreparedForBattle) == 0x000001, "Wrong size on AC_jRPG_CharacterBattleStats_C_IsPreparedForBattle");
static_assert(offsetof(AC_jRPG_CharacterBattleStats_C_IsPreparedForBattle, ReturnValue) == 0x000000, "Member 'AC_jRPG_CharacterBattleStats_C_IsPreparedForBattle::ReturnValue' has a wrong offset!");

// Function AC_jRPG_CharacterBattleStats.AC_jRPG_CharacterBattleStats_C.GetGenderTag
// 0x0001 (0x0001 - 0x0000)
struct AC_jRPG_CharacterBattleStats_C_GetGenderTag final
{
public:
	ETextGender                                   ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AC_jRPG_CharacterBattleStats_C_GetGenderTag) == 0x000001, "Wrong alignment on AC_jRPG_CharacterBattleStats_C_GetGenderTag");
static_assert(sizeof(AC_jRPG_CharacterBattleStats_C_GetGenderTag) == 0x000001, "Wrong size on AC_jRPG_CharacterBattleStats_C_GetGenderTag");
static_assert(offsetof(AC_jRPG_CharacterBattleStats_C_GetGenderTag, ReturnValue) == 0x000000, "Member 'AC_jRPG_CharacterBattleStats_C_GetGenderTag::ReturnValue' has a wrong offset!");

// Function AC_jRPG_CharacterBattleStats.AC_jRPG_CharacterBattleStats_C.TryDodgeHitFromCharacter
// 0x0058 (0x0058 - 0x0000)
struct AC_jRPG_CharacterBattleStats_C_TryDodgeHitFromCharacter final
{
public:
	class UAC_jRPG_CharacterBattleStats_C*        AttackingCharacter;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Successful;                                        // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsPerfectDodge;                                    // 0x0009(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_jRPG_Character_Battle_Base_C*       CallFunc_GetCharacterBattleBase_jRPG_CharacterBattleBase; // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetCharacterBattleBase_IsValid;           // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TryStartDodge_Success;                    // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPackagedForDistribution_ReturnValue;    // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B[0x5];                                       // 0x001B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DEBUG_Console_AutoDodge_ReturnValue;      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_jRPG_Character_Battle_Base_C*       CallFunc_GetCharacterBattleBase_jRPG_CharacterBattleBase_1; // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetCharacterBattleBase_IsValid_1;         // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetParryImmuneDuration_ReturnValue;       // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AC_jRPG_CharacterBattleStats_C_TryDodgeHitFromCharacter) == 0x000008, "Wrong alignment on AC_jRPG_CharacterBattleStats_C_TryDodgeHitFromCharacter");
static_assert(sizeof(AC_jRPG_CharacterBattleStats_C_TryDodgeHitFromCharacter) == 0x000058, "Wrong size on AC_jRPG_CharacterBattleStats_C_TryDodgeHitFromCharacter");
static_assert(offsetof(AC_jRPG_CharacterBattleStats_C_TryDodgeHitFromCharacter, AttackingCharacter) == 0x000000, "Member 'AC_jRPG_CharacterBattleStats_C_TryDodgeHitFromCharacter::AttackingCharacter' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharacterBattleStats_C_TryDodgeHitFromCharacter, Successful) == 0x000008, "Member 'AC_jRPG_CharacterBattleStats_C_TryDodgeHitFromCharacter::Successful' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharacterBattleStats_C_TryDodgeHitFromCharacter, IsPerfectDodge) == 0x000009, "Member 'AC_jRPG_CharacterBattleStats_C_TryDodgeHitFromCharacter::IsPerfectDodge' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharacterBattleStats_C_TryDodgeHitFromCharacter, CallFunc_GetCharacterBattleBase_jRPG_CharacterBattleBase) == 0x000010, "Member 'AC_jRPG_CharacterBattleStats_C_TryDodgeHitFromCharacter::CallFunc_GetCharacterBattleBase_jRPG_CharacterBattleBase' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharacterBattleStats_C_TryDodgeHitFromCharacter, CallFunc_GetCharacterBattleBase_IsValid) == 0x000018, "Member 'AC_jRPG_CharacterBattleStats_C_TryDodgeHitFromCharacter::CallFunc_GetCharacterBattleBase_IsValid' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharacterBattleStats_C_TryDodgeHitFromCharacter, CallFunc_TryStartDodge_Success) == 0x000019, "Member 'AC_jRPG_CharacterBattleStats_C_TryDodgeHitFromCharacter::CallFunc_TryStartDodge_Success' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharacterBattleStats_C_TryDodgeHitFromCharacter, CallFunc_IsPackagedForDistribution_ReturnValue) == 0x00001A, "Member 'AC_jRPG_CharacterBattleStats_C_TryDodgeHitFromCharacter::CallFunc_IsPackagedForDistribution_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharacterBattleStats_C_TryDodgeHitFromCharacter, CallFunc_GetGameTimeInSeconds_ReturnValue) == 0x000020, "Member 'AC_jRPG_CharacterBattleStats_C_TryDodgeHitFromCharacter::CallFunc_GetGameTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharacterBattleStats_C_TryDodgeHitFromCharacter, CallFunc_DEBUG_Console_AutoDodge_ReturnValue) == 0x000028, "Member 'AC_jRPG_CharacterBattleStats_C_TryDodgeHitFromCharacter::CallFunc_DEBUG_Console_AutoDodge_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharacterBattleStats_C_TryDodgeHitFromCharacter, CallFunc_GetCharacterBattleBase_jRPG_CharacterBattleBase_1) == 0x000030, "Member 'AC_jRPG_CharacterBattleStats_C_TryDodgeHitFromCharacter::CallFunc_GetCharacterBattleBase_jRPG_CharacterBattleBase_1' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharacterBattleStats_C_TryDodgeHitFromCharacter, CallFunc_GetCharacterBattleBase_IsValid_1) == 0x000038, "Member 'AC_jRPG_CharacterBattleStats_C_TryDodgeHitFromCharacter::CallFunc_GetCharacterBattleBase_IsValid_1' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharacterBattleStats_C_TryDodgeHitFromCharacter, CallFunc_GetParryImmuneDuration_ReturnValue) == 0x000040, "Member 'AC_jRPG_CharacterBattleStats_C_TryDodgeHitFromCharacter::CallFunc_GetParryImmuneDuration_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharacterBattleStats_C_TryDodgeHitFromCharacter, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000048, "Member 'AC_jRPG_CharacterBattleStats_C_TryDodgeHitFromCharacter::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharacterBattleStats_C_TryDodgeHitFromCharacter, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x000050, "Member 'AC_jRPG_CharacterBattleStats_C_TryDodgeHitFromCharacter::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");

// Function AC_jRPG_CharacterBattleStats.AC_jRPG_CharacterBattleStats_C.TryParryHitFromCharacter
// 0x0050 (0x0050 - 0x0000)
struct AC_jRPG_CharacterBattleStats_C_TryParryHitFromCharacter final
{
public:
	class UAC_jRPG_CharacterBattleStats_C*        AttackingCharacter;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Successful;                                        // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPackagedForDistribution_ReturnValue;    // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_jRPG_Character_Battle_Base_C*       CallFunc_GetCharacterBattleBase_jRPG_CharacterBattleBase; // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetCharacterBattleBase_IsValid;           // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TryStartGradientParry_Success;            // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPackagedForDistribution_ReturnValue_1;  // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B[0x5];                                       // 0x001B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_jRPG_Character_Battle_Base_C*       CallFunc_GetCharacterBattleBase_jRPG_CharacterBattleBase_1; // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetCharacterBattleBase_IsValid_1;         // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_jRPG_Character_Battle_Base_C*       CallFunc_GetCharacterBattleBase_jRPG_CharacterBattleBase_2; // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetCharacterBattleBase_IsValid_2;         // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TryStartParry_Success;                    // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DEBUG_Console_AutoGradientParry_ReturnValue; // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B[0x5];                                       // 0x003B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_jRPG_Character_Battle_Base_C*       CallFunc_GetCharacterBattleBase_jRPG_CharacterBattleBase_3; // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetCharacterBattleBase_IsValid_3;         // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DEBUG_Console_AutoParry_ReturnValue;      // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AC_jRPG_CharacterBattleStats_C_TryParryHitFromCharacter) == 0x000008, "Wrong alignment on AC_jRPG_CharacterBattleStats_C_TryParryHitFromCharacter");
static_assert(sizeof(AC_jRPG_CharacterBattleStats_C_TryParryHitFromCharacter) == 0x000050, "Wrong size on AC_jRPG_CharacterBattleStats_C_TryParryHitFromCharacter");
static_assert(offsetof(AC_jRPG_CharacterBattleStats_C_TryParryHitFromCharacter, AttackingCharacter) == 0x000000, "Member 'AC_jRPG_CharacterBattleStats_C_TryParryHitFromCharacter::AttackingCharacter' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharacterBattleStats_C_TryParryHitFromCharacter, Successful) == 0x000008, "Member 'AC_jRPG_CharacterBattleStats_C_TryParryHitFromCharacter::Successful' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharacterBattleStats_C_TryParryHitFromCharacter, CallFunc_IsPackagedForDistribution_ReturnValue) == 0x000009, "Member 'AC_jRPG_CharacterBattleStats_C_TryParryHitFromCharacter::CallFunc_IsPackagedForDistribution_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharacterBattleStats_C_TryParryHitFromCharacter, CallFunc_GetCharacterBattleBase_jRPG_CharacterBattleBase) == 0x000010, "Member 'AC_jRPG_CharacterBattleStats_C_TryParryHitFromCharacter::CallFunc_GetCharacterBattleBase_jRPG_CharacterBattleBase' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharacterBattleStats_C_TryParryHitFromCharacter, CallFunc_GetCharacterBattleBase_IsValid) == 0x000018, "Member 'AC_jRPG_CharacterBattleStats_C_TryParryHitFromCharacter::CallFunc_GetCharacterBattleBase_IsValid' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharacterBattleStats_C_TryParryHitFromCharacter, CallFunc_TryStartGradientParry_Success) == 0x000019, "Member 'AC_jRPG_CharacterBattleStats_C_TryParryHitFromCharacter::CallFunc_TryStartGradientParry_Success' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharacterBattleStats_C_TryParryHitFromCharacter, CallFunc_IsPackagedForDistribution_ReturnValue_1) == 0x00001A, "Member 'AC_jRPG_CharacterBattleStats_C_TryParryHitFromCharacter::CallFunc_IsPackagedForDistribution_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharacterBattleStats_C_TryParryHitFromCharacter, CallFunc_GetCharacterBattleBase_jRPG_CharacterBattleBase_1) == 0x000020, "Member 'AC_jRPG_CharacterBattleStats_C_TryParryHitFromCharacter::CallFunc_GetCharacterBattleBase_jRPG_CharacterBattleBase_1' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharacterBattleStats_C_TryParryHitFromCharacter, CallFunc_GetCharacterBattleBase_IsValid_1) == 0x000028, "Member 'AC_jRPG_CharacterBattleStats_C_TryParryHitFromCharacter::CallFunc_GetCharacterBattleBase_IsValid_1' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharacterBattleStats_C_TryParryHitFromCharacter, CallFunc_GetCharacterBattleBase_jRPG_CharacterBattleBase_2) == 0x000030, "Member 'AC_jRPG_CharacterBattleStats_C_TryParryHitFromCharacter::CallFunc_GetCharacterBattleBase_jRPG_CharacterBattleBase_2' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharacterBattleStats_C_TryParryHitFromCharacter, CallFunc_GetCharacterBattleBase_IsValid_2) == 0x000038, "Member 'AC_jRPG_CharacterBattleStats_C_TryParryHitFromCharacter::CallFunc_GetCharacterBattleBase_IsValid_2' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharacterBattleStats_C_TryParryHitFromCharacter, CallFunc_TryStartParry_Success) == 0x000039, "Member 'AC_jRPG_CharacterBattleStats_C_TryParryHitFromCharacter::CallFunc_TryStartParry_Success' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharacterBattleStats_C_TryParryHitFromCharacter, CallFunc_DEBUG_Console_AutoGradientParry_ReturnValue) == 0x00003A, "Member 'AC_jRPG_CharacterBattleStats_C_TryParryHitFromCharacter::CallFunc_DEBUG_Console_AutoGradientParry_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharacterBattleStats_C_TryParryHitFromCharacter, CallFunc_GetCharacterBattleBase_jRPG_CharacterBattleBase_3) == 0x000040, "Member 'AC_jRPG_CharacterBattleStats_C_TryParryHitFromCharacter::CallFunc_GetCharacterBattleBase_jRPG_CharacterBattleBase_3' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharacterBattleStats_C_TryParryHitFromCharacter, CallFunc_GetCharacterBattleBase_IsValid_3) == 0x000048, "Member 'AC_jRPG_CharacterBattleStats_C_TryParryHitFromCharacter::CallFunc_GetCharacterBattleBase_IsValid_3' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharacterBattleStats_C_TryParryHitFromCharacter, CallFunc_DEBUG_Console_AutoParry_ReturnValue) == 0x000049, "Member 'AC_jRPG_CharacterBattleStats_C_TryParryHitFromCharacter::CallFunc_DEBUG_Console_AutoParry_ReturnValue' has a wrong offset!");

// Function AC_jRPG_CharacterBattleStats.AC_jRPG_CharacterBattleStats_C.GetParryWindowModifier
// 0x0008 (0x0008 - 0x0000)
struct AC_jRPG_CharacterBattleStats_C_GetParryWindowModifier final
{
public:
	class UModifierStack_Float*                   Stack;                                             // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(AC_jRPG_CharacterBattleStats_C_GetParryWindowModifier) == 0x000008, "Wrong alignment on AC_jRPG_CharacterBattleStats_C_GetParryWindowModifier");
static_assert(sizeof(AC_jRPG_CharacterBattleStats_C_GetParryWindowModifier) == 0x000008, "Wrong size on AC_jRPG_CharacterBattleStats_C_GetParryWindowModifier");
static_assert(offsetof(AC_jRPG_CharacterBattleStats_C_GetParryWindowModifier, Stack) == 0x000000, "Member 'AC_jRPG_CharacterBattleStats_C_GetParryWindowModifier::Stack' has a wrong offset!");

// Function AC_jRPG_CharacterBattleStats.AC_jRPG_CharacterBattleStats_C.RemoveParryWindowModifier
// 0x0030 (0x0030 - 0x0000)
struct AC_jRPG_CharacterBattleStats_C_RemoveParryWindowModifier final
{
public:
	struct FSF_ModifierStackEntryHandle           OutModifierHandle;                                 // 0x0000(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(AC_jRPG_CharacterBattleStats_C_RemoveParryWindowModifier) == 0x000008, "Wrong alignment on AC_jRPG_CharacterBattleStats_C_RemoveParryWindowModifier");
static_assert(sizeof(AC_jRPG_CharacterBattleStats_C_RemoveParryWindowModifier) == 0x000030, "Wrong size on AC_jRPG_CharacterBattleStats_C_RemoveParryWindowModifier");
static_assert(offsetof(AC_jRPG_CharacterBattleStats_C_RemoveParryWindowModifier, OutModifierHandle) == 0x000000, "Member 'AC_jRPG_CharacterBattleStats_C_RemoveParryWindowModifier::OutModifierHandle' has a wrong offset!");

// Function AC_jRPG_CharacterBattleStats.AC_jRPG_CharacterBattleStats_C.AddParryWindowModifier
// 0x0048 (0x0048 - 0x0000)
struct AC_jRPG_CharacterBattleStats_C_AddParryWindowModifier final
{
public:
	double                                        Percent;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSF_ModifierStackEntryHandle           OutModifierHandle;                                 // 0x0008(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FString                                 DebugName;                                         // 0x0038(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(AC_jRPG_CharacterBattleStats_C_AddParryWindowModifier) == 0x000008, "Wrong alignment on AC_jRPG_CharacterBattleStats_C_AddParryWindowModifier");
static_assert(sizeof(AC_jRPG_CharacterBattleStats_C_AddParryWindowModifier) == 0x000048, "Wrong size on AC_jRPG_CharacterBattleStats_C_AddParryWindowModifier");
static_assert(offsetof(AC_jRPG_CharacterBattleStats_C_AddParryWindowModifier, Percent) == 0x000000, "Member 'AC_jRPG_CharacterBattleStats_C_AddParryWindowModifier::Percent' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharacterBattleStats_C_AddParryWindowModifier, OutModifierHandle) == 0x000008, "Member 'AC_jRPG_CharacterBattleStats_C_AddParryWindowModifier::OutModifierHandle' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharacterBattleStats_C_AddParryWindowModifier, DebugName) == 0x000038, "Member 'AC_jRPG_CharacterBattleStats_C_AddParryWindowModifier::DebugName' has a wrong offset!");

// Function AC_jRPG_CharacterBattleStats.AC_jRPG_CharacterBattleStats_C.GetDodgeWindowModifier
// 0x0008 (0x0008 - 0x0000)
struct AC_jRPG_CharacterBattleStats_C_GetDodgeWindowModifier final
{
public:
	class UModifierStack_Float*                   Stack;                                             // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(AC_jRPG_CharacterBattleStats_C_GetDodgeWindowModifier) == 0x000008, "Wrong alignment on AC_jRPG_CharacterBattleStats_C_GetDodgeWindowModifier");
static_assert(sizeof(AC_jRPG_CharacterBattleStats_C_GetDodgeWindowModifier) == 0x000008, "Wrong size on AC_jRPG_CharacterBattleStats_C_GetDodgeWindowModifier");
static_assert(offsetof(AC_jRPG_CharacterBattleStats_C_GetDodgeWindowModifier, Stack) == 0x000000, "Member 'AC_jRPG_CharacterBattleStats_C_GetDodgeWindowModifier::Stack' has a wrong offset!");

// Function AC_jRPG_CharacterBattleStats.AC_jRPG_CharacterBattleStats_C.RemoveDodgeWindowModifier
// 0x0030 (0x0030 - 0x0000)
struct AC_jRPG_CharacterBattleStats_C_RemoveDodgeWindowModifier final
{
public:
	struct FSF_ModifierStackEntryHandle           OutModifierHandle;                                 // 0x0000(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(AC_jRPG_CharacterBattleStats_C_RemoveDodgeWindowModifier) == 0x000008, "Wrong alignment on AC_jRPG_CharacterBattleStats_C_RemoveDodgeWindowModifier");
static_assert(sizeof(AC_jRPG_CharacterBattleStats_C_RemoveDodgeWindowModifier) == 0x000030, "Wrong size on AC_jRPG_CharacterBattleStats_C_RemoveDodgeWindowModifier");
static_assert(offsetof(AC_jRPG_CharacterBattleStats_C_RemoveDodgeWindowModifier, OutModifierHandle) == 0x000000, "Member 'AC_jRPG_CharacterBattleStats_C_RemoveDodgeWindowModifier::OutModifierHandle' has a wrong offset!");

// Function AC_jRPG_CharacterBattleStats.AC_jRPG_CharacterBattleStats_C.AddDodgeWindowModifier
// 0x0048 (0x0048 - 0x0000)
struct AC_jRPG_CharacterBattleStats_C_AddDodgeWindowModifier final
{
public:
	double                                        Percent;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSF_ModifierStackEntryHandle           OutModifierHandle;                                 // 0x0008(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FString                                 DebugName;                                         // 0x0038(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(AC_jRPG_CharacterBattleStats_C_AddDodgeWindowModifier) == 0x000008, "Wrong alignment on AC_jRPG_CharacterBattleStats_C_AddDodgeWindowModifier");
static_assert(sizeof(AC_jRPG_CharacterBattleStats_C_AddDodgeWindowModifier) == 0x000048, "Wrong size on AC_jRPG_CharacterBattleStats_C_AddDodgeWindowModifier");
static_assert(offsetof(AC_jRPG_CharacterBattleStats_C_AddDodgeWindowModifier, Percent) == 0x000000, "Member 'AC_jRPG_CharacterBattleStats_C_AddDodgeWindowModifier::Percent' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharacterBattleStats_C_AddDodgeWindowModifier, OutModifierHandle) == 0x000008, "Member 'AC_jRPG_CharacterBattleStats_C_AddDodgeWindowModifier::OutModifierHandle' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharacterBattleStats_C_AddDodgeWindowModifier, DebugName) == 0x000038, "Member 'AC_jRPG_CharacterBattleStats_C_AddDodgeWindowModifier::DebugName' has a wrong offset!");

// Function AC_jRPG_CharacterBattleStats.AC_jRPG_CharacterBattleStats_C.RemoveParryLock
// 0x0028 (0x0028 - 0x0000)
struct AC_jRPG_CharacterBattleStats_C_RemoveParryLock final
{
public:
	struct FSF_ReferenceCounterHandle             LockHandle;                                        // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          CallFunc_RemoveReference_ReturnValue;              // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AC_jRPG_CharacterBattleStats_C_RemoveParryLock) == 0x000008, "Wrong alignment on AC_jRPG_CharacterBattleStats_C_RemoveParryLock");
static_assert(sizeof(AC_jRPG_CharacterBattleStats_C_RemoveParryLock) == 0x000028, "Wrong size on AC_jRPG_CharacterBattleStats_C_RemoveParryLock");
static_assert(offsetof(AC_jRPG_CharacterBattleStats_C_RemoveParryLock, LockHandle) == 0x000000, "Member 'AC_jRPG_CharacterBattleStats_C_RemoveParryLock::LockHandle' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharacterBattleStats_C_RemoveParryLock, CallFunc_RemoveReference_ReturnValue) == 0x000020, "Member 'AC_jRPG_CharacterBattleStats_C_RemoveParryLock::CallFunc_RemoveReference_ReturnValue' has a wrong offset!");

// Function AC_jRPG_CharacterBattleStats.AC_jRPG_CharacterBattleStats_C.AddParryLock
// 0x0038 (0x0038 - 0x0000)
struct AC_jRPG_CharacterBattleStats_C_AddParryLock final
{
public:
	struct FSF_ReferenceCounterHandle             LockHandle;                                        // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FString                                 DebugReason;                                       // 0x0020(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_AddReference_ReturnValue;                 // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AC_jRPG_CharacterBattleStats_C_AddParryLock) == 0x000008, "Wrong alignment on AC_jRPG_CharacterBattleStats_C_AddParryLock");
static_assert(sizeof(AC_jRPG_CharacterBattleStats_C_AddParryLock) == 0x000038, "Wrong size on AC_jRPG_CharacterBattleStats_C_AddParryLock");
static_assert(offsetof(AC_jRPG_CharacterBattleStats_C_AddParryLock, LockHandle) == 0x000000, "Member 'AC_jRPG_CharacterBattleStats_C_AddParryLock::LockHandle' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharacterBattleStats_C_AddParryLock, DebugReason) == 0x000020, "Member 'AC_jRPG_CharacterBattleStats_C_AddParryLock::DebugReason' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharacterBattleStats_C_AddParryLock, CallFunc_AddReference_ReturnValue) == 0x000030, "Member 'AC_jRPG_CharacterBattleStats_C_AddParryLock::CallFunc_AddReference_ReturnValue' has a wrong offset!");

// Function AC_jRPG_CharacterBattleStats.AC_jRPG_CharacterBattleStats_C.IsParryLocked
// 0x0002 (0x0002 - 0x0000)
struct AC_jRPG_CharacterBattleStats_C_IsParryLocked final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetReferenceCounterState_ReturnValue;     // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AC_jRPG_CharacterBattleStats_C_IsParryLocked) == 0x000001, "Wrong alignment on AC_jRPG_CharacterBattleStats_C_IsParryLocked");
static_assert(sizeof(AC_jRPG_CharacterBattleStats_C_IsParryLocked) == 0x000002, "Wrong size on AC_jRPG_CharacterBattleStats_C_IsParryLocked");
static_assert(offsetof(AC_jRPG_CharacterBattleStats_C_IsParryLocked, ReturnValue) == 0x000000, "Member 'AC_jRPG_CharacterBattleStats_C_IsParryLocked::ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharacterBattleStats_C_IsParryLocked, CallFunc_GetReferenceCounterState_ReturnValue) == 0x000001, "Member 'AC_jRPG_CharacterBattleStats_C_IsParryLocked::CallFunc_GetReferenceCounterState_ReturnValue' has a wrong offset!");

// Function AC_jRPG_CharacterBattleStats.AC_jRPG_CharacterBattleStats_C.GetCurrentSkillScript
// 0x0018 (0x0018 - 0x0000)
struct AC_jRPG_CharacterBattleStats_C_GetCurrentSkillScript final
{
public:
	class ABP_Battle_SkillScript_C*               ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash)
	class ABP_jRPG_Character_Battle_Base_C*       CallFunc_GetCharacterBattleBase_jRPG_CharacterBattleBase; // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetCharacterBattleBase_IsValid;           // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AC_jRPG_CharacterBattleStats_C_GetCurrentSkillScript) == 0x000008, "Wrong alignment on AC_jRPG_CharacterBattleStats_C_GetCurrentSkillScript");
static_assert(sizeof(AC_jRPG_CharacterBattleStats_C_GetCurrentSkillScript) == 0x000018, "Wrong size on AC_jRPG_CharacterBattleStats_C_GetCurrentSkillScript");
static_assert(offsetof(AC_jRPG_CharacterBattleStats_C_GetCurrentSkillScript, ReturnValue) == 0x000000, "Member 'AC_jRPG_CharacterBattleStats_C_GetCurrentSkillScript::ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharacterBattleStats_C_GetCurrentSkillScript, CallFunc_GetCharacterBattleBase_jRPG_CharacterBattleBase) == 0x000008, "Member 'AC_jRPG_CharacterBattleStats_C_GetCurrentSkillScript::CallFunc_GetCharacterBattleBase_jRPG_CharacterBattleBase' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharacterBattleStats_C_GetCurrentSkillScript, CallFunc_GetCharacterBattleBase_IsValid) == 0x000010, "Member 'AC_jRPG_CharacterBattleStats_C_GetCurrentSkillScript::CallFunc_GetCharacterBattleBase_IsValid' has a wrong offset!");

// Function AC_jRPG_CharacterBattleStats.AC_jRPG_CharacterBattleStats_C.IsOfArchetype
// 0x0068 (0x0068 - 0x0000)
struct AC_jRPG_CharacterBattleStats_C_IsOfArchetype final
{
public:
	TSoftObjectPtr<class UBP_DataAsset_EnemyBattleArchetype_C> Archetype;                            // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_DataAsset_EnemyBattleArchetype_C*   CallFunc_GetArchetype_Archetype;                   // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UBP_DataAsset_EnemyBattleArchetype_C> CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue; // 0x0038(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_SoftObjectReference_ReturnValue; // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AC_jRPG_CharacterBattleStats_C_IsOfArchetype) == 0x000008, "Wrong alignment on AC_jRPG_CharacterBattleStats_C_IsOfArchetype");
static_assert(sizeof(AC_jRPG_CharacterBattleStats_C_IsOfArchetype) == 0x000068, "Wrong size on AC_jRPG_CharacterBattleStats_C_IsOfArchetype");
static_assert(offsetof(AC_jRPG_CharacterBattleStats_C_IsOfArchetype, Archetype) == 0x000000, "Member 'AC_jRPG_CharacterBattleStats_C_IsOfArchetype::Archetype' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharacterBattleStats_C_IsOfArchetype, ReturnValue) == 0x000028, "Member 'AC_jRPG_CharacterBattleStats_C_IsOfArchetype::ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharacterBattleStats_C_IsOfArchetype, CallFunc_GetArchetype_Archetype) == 0x000030, "Member 'AC_jRPG_CharacterBattleStats_C_IsOfArchetype::CallFunc_GetArchetype_Archetype' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharacterBattleStats_C_IsOfArchetype, CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue) == 0x000038, "Member 'AC_jRPG_CharacterBattleStats_C_IsOfArchetype::CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharacterBattleStats_C_IsOfArchetype, CallFunc_EqualEqual_SoftObjectReference_ReturnValue) == 0x000060, "Member 'AC_jRPG_CharacterBattleStats_C_IsOfArchetype::CallFunc_EqualEqual_SoftObjectReference_ReturnValue' has a wrong offset!");

// Function AC_jRPG_CharacterBattleStats.AC_jRPG_CharacterBattleStats_C.GetArchetype
// 0x0218 (0x0218 - 0x0000)
struct AC_jRPG_CharacterBattleStats_C_GetArchetype final
{
public:
	class UBP_DataAsset_EnemyBattleArchetype_C*   Archetype;                                         // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetEnemyDataTableRow_Found;               // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_jRPG_Enemy                          CallFunc_GetEnemyDataTableRow_EnemyData;           // 0x0010(0x0200)(ContainsInstancedReference, HasGetValueTypeHash)
	class UBP_DataAsset_EnemyBattleArchetype_C*   CallFunc_GetEnemyArchetypeAsset_ReturnValue;       // 0x0210(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AC_jRPG_CharacterBattleStats_C_GetArchetype) == 0x000008, "Wrong alignment on AC_jRPG_CharacterBattleStats_C_GetArchetype");
static_assert(sizeof(AC_jRPG_CharacterBattleStats_C_GetArchetype) == 0x000218, "Wrong size on AC_jRPG_CharacterBattleStats_C_GetArchetype");
static_assert(offsetof(AC_jRPG_CharacterBattleStats_C_GetArchetype, Archetype) == 0x000000, "Member 'AC_jRPG_CharacterBattleStats_C_GetArchetype::Archetype' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharacterBattleStats_C_GetArchetype, CallFunc_GetEnemyDataTableRow_Found) == 0x000008, "Member 'AC_jRPG_CharacterBattleStats_C_GetArchetype::CallFunc_GetEnemyDataTableRow_Found' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharacterBattleStats_C_GetArchetype, CallFunc_GetEnemyDataTableRow_EnemyData) == 0x000010, "Member 'AC_jRPG_CharacterBattleStats_C_GetArchetype::CallFunc_GetEnemyDataTableRow_EnemyData' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharacterBattleStats_C_GetArchetype, CallFunc_GetEnemyArchetypeAsset_ReturnValue) == 0x000210, "Member 'AC_jRPG_CharacterBattleStats_C_GetArchetype::CallFunc_GetEnemyArchetypeAsset_ReturnValue' has a wrong offset!");

// Function AC_jRPG_CharacterBattleStats.AC_jRPG_CharacterBattleStats_C.GetForcedSkillOnNextTurn
// 0x0008 (0x0008 - 0x0000)
struct AC_jRPG_CharacterBattleStats_C_GetForcedSkillOnNextTurn final
{
public:
	class ABP_Battle_SkillScript_C*               ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AC_jRPG_CharacterBattleStats_C_GetForcedSkillOnNextTurn) == 0x000008, "Wrong alignment on AC_jRPG_CharacterBattleStats_C_GetForcedSkillOnNextTurn");
static_assert(sizeof(AC_jRPG_CharacterBattleStats_C_GetForcedSkillOnNextTurn) == 0x000008, "Wrong size on AC_jRPG_CharacterBattleStats_C_GetForcedSkillOnNextTurn");
static_assert(offsetof(AC_jRPG_CharacterBattleStats_C_GetForcedSkillOnNextTurn, ReturnValue) == 0x000000, "Member 'AC_jRPG_CharacterBattleStats_C_GetForcedSkillOnNextTurn::ReturnValue' has a wrong offset!");

// Function AC_jRPG_CharacterBattleStats.AC_jRPG_CharacterBattleStats_C.TryProcessForcedSkill
// 0x00C8 (0x00C8 - 0x0000)
struct AC_jRPG_CharacterBattleStats_C_TryProcessForcedSkill final
{
public:
	bool                                          PreventPlayerChoice;                               // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          local_allowTurnChoice;                             // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_jRPG_Character_Battle_Base_C*       CallFunc_GetCharacterBattleBase_jRPG_CharacterBattleBase; // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetCharacterBattleBase_IsValid;           // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Battle_SkillScript_C*               Temp_wildcard_Variable;                            // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoesForcedSkillAllowPlayerChoice_ReturnValue; // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_jRPG_Character_Battle_Base_C*> CallFunc_GetForcedSkillPreviousTargets_ReturnValue; // 0x0028(0x0010)(ReferenceParm)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_jRPG_Character_Battle_Base_C*       CallFunc_GetCharacterBattleBase_jRPG_CharacterBattleBase_1; // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetCharacterBattleBase_IsValid_1;         // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_ObjectToText_ReturnValue;            // 0x0050(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0060(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00A8(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Format_ReturnValue;                       // 0x00B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(AC_jRPG_CharacterBattleStats_C_TryProcessForcedSkill) == 0x000008, "Wrong alignment on AC_jRPG_CharacterBattleStats_C_TryProcessForcedSkill");
static_assert(sizeof(AC_jRPG_CharacterBattleStats_C_TryProcessForcedSkill) == 0x0000C8, "Wrong size on AC_jRPG_CharacterBattleStats_C_TryProcessForcedSkill");
static_assert(offsetof(AC_jRPG_CharacterBattleStats_C_TryProcessForcedSkill, PreventPlayerChoice) == 0x000000, "Member 'AC_jRPG_CharacterBattleStats_C_TryProcessForcedSkill::PreventPlayerChoice' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharacterBattleStats_C_TryProcessForcedSkill, local_allowTurnChoice) == 0x000001, "Member 'AC_jRPG_CharacterBattleStats_C_TryProcessForcedSkill::local_allowTurnChoice' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharacterBattleStats_C_TryProcessForcedSkill, CallFunc_GetCharacterBattleBase_jRPG_CharacterBattleBase) == 0x000008, "Member 'AC_jRPG_CharacterBattleStats_C_TryProcessForcedSkill::CallFunc_GetCharacterBattleBase_jRPG_CharacterBattleBase' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharacterBattleStats_C_TryProcessForcedSkill, CallFunc_GetCharacterBattleBase_IsValid) == 0x000010, "Member 'AC_jRPG_CharacterBattleStats_C_TryProcessForcedSkill::CallFunc_GetCharacterBattleBase_IsValid' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharacterBattleStats_C_TryProcessForcedSkill, Temp_wildcard_Variable) == 0x000018, "Member 'AC_jRPG_CharacterBattleStats_C_TryProcessForcedSkill::Temp_wildcard_Variable' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharacterBattleStats_C_TryProcessForcedSkill, CallFunc_DoesForcedSkillAllowPlayerChoice_ReturnValue) == 0x000020, "Member 'AC_jRPG_CharacterBattleStats_C_TryProcessForcedSkill::CallFunc_DoesForcedSkillAllowPlayerChoice_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharacterBattleStats_C_TryProcessForcedSkill, CallFunc_GetForcedSkillPreviousTargets_ReturnValue) == 0x000028, "Member 'AC_jRPG_CharacterBattleStats_C_TryProcessForcedSkill::CallFunc_GetForcedSkillPreviousTargets_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharacterBattleStats_C_TryProcessForcedSkill, CallFunc_Not_PreBool_ReturnValue) == 0x000038, "Member 'AC_jRPG_CharacterBattleStats_C_TryProcessForcedSkill::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharacterBattleStats_C_TryProcessForcedSkill, CallFunc_GetCharacterBattleBase_jRPG_CharacterBattleBase_1) == 0x000040, "Member 'AC_jRPG_CharacterBattleStats_C_TryProcessForcedSkill::CallFunc_GetCharacterBattleBase_jRPG_CharacterBattleBase_1' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharacterBattleStats_C_TryProcessForcedSkill, CallFunc_GetCharacterBattleBase_IsValid_1) == 0x000048, "Member 'AC_jRPG_CharacterBattleStats_C_TryProcessForcedSkill::CallFunc_GetCharacterBattleBase_IsValid_1' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharacterBattleStats_C_TryProcessForcedSkill, CallFunc_IsValid_ReturnValue) == 0x000049, "Member 'AC_jRPG_CharacterBattleStats_C_TryProcessForcedSkill::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharacterBattleStats_C_TryProcessForcedSkill, CallFunc_Conv_ObjectToText_ReturnValue) == 0x000050, "Member 'AC_jRPG_CharacterBattleStats_C_TryProcessForcedSkill::CallFunc_Conv_ObjectToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharacterBattleStats_C_TryProcessForcedSkill, K2Node_MakeStruct_FormatArgumentData) == 0x000060, "Member 'AC_jRPG_CharacterBattleStats_C_TryProcessForcedSkill::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharacterBattleStats_C_TryProcessForcedSkill, K2Node_MakeArray_Array) == 0x0000A8, "Member 'AC_jRPG_CharacterBattleStats_C_TryProcessForcedSkill::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(AC_jRPG_CharacterBattleStats_C_TryProcessForcedSkill, CallFunc_Format_ReturnValue) == 0x0000B8, "Member 'AC_jRPG_CharacterBattleStats_C_TryProcessForcedSkill::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function AC_jRPG_CharacterBattleStats.AC_jRPG_CharacterBattleStats_C.ForceSkillOnNextTurn
// 0x0008 (0x0008 - 0x0000)
struct AC_jRPG_CharacterBattleStats_C_ForceSkillOnNextTurn final
{
public:
	class ABP_Battle_SkillScript_C*               SkillScript;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AC_jRPG_CharacterBattleStats_C_ForceSkillOnNextTurn) == 0x000008, "Wrong alignment on AC_jRPG_CharacterBattleStats_C_ForceSkillOnNextTurn");
static_assert(sizeof(AC_jRPG_CharacterBattleStats_C_ForceSkillOnNextTurn) == 0x000008, "Wrong size on AC_jRPG_CharacterBattleStats_C_ForceSkillOnNextTurn");
static_assert(offsetof(AC_jRPG_CharacterBattleStats_C_ForceSkillOnNextTurn, SkillScript) == 0x000000, "Member 'AC_jRPG_CharacterBattleStats_C_ForceSkillOnNextTurn::SkillScript' has a wrong offset!");

// Function AC_jRPG_CharacterBattleStats.AC_jRPG_CharacterBattleStats_C.IsSameCharacterStats
// 0x0010 (0x0010 - 0x0000)
struct AC_jRPG_CharacterBattleStats_C_IsSameCharacterStats final
{
public:
	class UAC_jRPG_CharacterBattleStats_C*        CharacterStats_0;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AC_jRPG_CharacterBattleStats_C_IsSameCharacterStats) == 0x000008, "Wrong alignment on AC_jRPG_CharacterBattleStats_C_IsSameCharacterStats");
