#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AC_jRPG_InventoryManager

#include "Basic.hpp"

#include "E_jRPG_ItemType_structs.hpp"
#include "Engine_structs.hpp"
#include "E_jRPG_ItemSubtype_structs.hpp"
#include "S_jRPG_Item_DynamicData_structs.hpp"
#include "S_InventoryItemTypeMetadata_structs.hpp"
#include "S_LootContext_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "E_CustomizationItemType_structs.hpp"
#include "S_jRPG_Item_StaticData_structs.hpp"
#include "S_jRPG_CharacterSaveState_structs.hpp"
#include "S_ItemQuantity_structs.hpp"
#include "FVendorState_structs.hpp"
#include "FEquipmentSlot_structs.hpp"
#include "E_jRPG_StatType_structs.hpp"
#include "FCharacterAssignedEquipment_structs.hpp"


namespace SDK::Params
{

// Function AC_jRPG_InventoryManager.AC_jRPG_InventoryManager_C.AddItemInstanceToInventory
// 0x0180 (0x0180 - 0x0000)
struct AC_jRPG_InventoryManager_C_AddItemInstanceToInventory final
{
public:
	class UBP_ItemInstance_Base_C*                ItemInstance;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Amount;                                            // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_LootContext                         LootContext;                                       // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_GeneratedItemInfo_Base_C*           local_generatedItemInfo;                           // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          local_isNewItem;                                   // 0x0018(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_LootContext                         local_lootContext;                                 // 0x001C(0x0004)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SurplusLOCAL;                                      // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AmountToAddLOCAL;                                  // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ItemHardcodedNameLOCAL;                            // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_jRPG_Item_StaticData                ItemStructLOCAL;                                   // 0x0030(0x0130)(Edit, BlueprintVisible, ContainsInstancedReference, HasGetValueTypeHash)
	class UBP_ItemUpgradeSystem_C*                CallFunc_GetItemUpgradeSystem_ReturnValue;         // 0x0160(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetItemDefinitionID_ReturnValue;          // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_GeneratedItemInfo_Base_C*           CallFunc_AddItemToInventory_GeneratedItem;         // 0x0170(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_ItemInstance_Base_C*                CallFunc_FindItemInstanceByID_ItemInstance;        // 0x0178(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AC_jRPG_InventoryManager_C_AddItemInstanceToInventory) == 0x000008, "Wrong alignment on AC_jRPG_InventoryManager_C_AddItemInstanceToInventory");
static_assert(sizeof(AC_jRPG_InventoryManager_C_AddItemInstanceToInventory) == 0x000180, "Wrong size on AC_jRPG_InventoryManager_C_AddItemInstanceToInventory");
static_assert(offsetof(AC_jRPG_InventoryManager_C_AddItemInstanceToInventory, ItemInstance) == 0x000000, "Member 'AC_jRPG_InventoryManager_C_AddItemInstanceToInventory::ItemInstance' has a wrong offset!");
static_assert(offsetof(AC_jRPG_InventoryManager_C_AddItemInstanceToInventory, Amount) == 0x000008, "Member 'AC_jRPG_InventoryManager_C_AddItemInstanceToInventory::Amount' has a wrong offset!");
static_assert(offsetof(AC_jRPG_InventoryManager_C_AddItemInstanceToInventory, LootContext) == 0x00000C, "Member 'AC_jRPG_InventoryManager_C_AddItemInstanceToInventory::LootContext' has a wrong offset!");
static_assert(offsetof(AC_jRPG_InventoryManager_C_AddItemInstanceToInventory, local_generatedItemInfo) == 0x000010, "Member 'AC_jRPG_InventoryManager_C_AddItemInstanceToInventory::local_generatedItemInfo' has a wrong offset!");
static_assert(offsetof(AC_jRPG_InventoryManager_C_AddItemInstanceToInventory, local_isNewItem) == 0x000018, "Member 'AC_jRPG_InventoryManager_C_AddItemInstanceToInventory::local_isNewItem' has a wrong offset!");
static_assert(offsetof(AC_jRPG_InventoryManager_C_AddItemInstanceToInventory, local_lootContext) == 0x00001C, "Member 'AC_jRPG_InventoryManager_C_AddItemInstanceToInventory::local_lootContext' has a wrong offset!");
static_assert(offsetof(AC_jRPG_InventoryManager_C_AddItemInstanceToInventory, SurplusLOCAL) == 0x000020, "Member 'AC_jRPG_InventoryManager_C_AddItemInstanceToInventory::SurplusLOCAL' has a wrong offset!");
static_assert(offsetof(AC_jRPG_InventoryManager_C_AddItemInstanceToInventory, AmountToAddLOCAL) == 0x000024, "Member 'AC_jRPG_InventoryManager_C_AddItemInstanceToInventory::AmountToAddLOCAL' has a wrong offset!");
static_assert(offsetof(AC_jRPG_InventoryManager_C_AddItemInstanceToInventory, ItemHardcodedNameLOCAL) == 0x000028, "Member 'AC_jRPG_InventoryManager_C_AddItemInstanceToInventory::ItemHardcodedNameLOCAL' has a wrong offset!");
static_assert(offsetof(AC_jRPG_InventoryManager_C_AddItemInstanceToInventory, ItemStructLOCAL) == 0x000030, "Member 'AC_jRPG_InventoryManager_C_AddItemInstanceToInventory::ItemStructLOCAL' has a wrong offset!");
static_assert(offsetof(AC_jRPG_InventoryManager_C_AddItemInstanceToInventory, CallFunc_GetItemUpgradeSystem_ReturnValue) == 0x000160, "Member 'AC_jRPG_InventoryManager_C_AddItemInstanceToInventory::CallFunc_GetItemUpgradeSystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_InventoryManager_C_AddItemInstanceToInventory, CallFunc_GetItemDefinitionID_ReturnValue) == 0x000168, "Member 'AC_jRPG_InventoryManager_C_AddItemInstanceToInventory::CallFunc_GetItemDefinitionID_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_InventoryManager_C_AddItemInstanceToInventory, CallFunc_AddItemToInventory_GeneratedItem) == 0x000170, "Member 'AC_jRPG_InventoryManager_C_AddItemInstanceToInventory::CallFunc_AddItemToInventory_GeneratedItem' has a wrong offset!");
static_assert(offsetof(AC_jRPG_InventoryManager_C_AddItemInstanceToInventory, CallFunc_FindItemInstanceByID_ItemInstance) == 0x000178, "Member 'AC_jRPG_InventoryManager_C_AddItemInstanceToInventory::CallFunc_FindItemInstanceByID_ItemInstance' has a wrong offset!");

// Function AC_jRPG_InventoryManager.AC_jRPG_InventoryManager_C.AddItemToInventory
// 0x0748 (0x0748 - 0x0000)
struct AC_jRPG_InventoryManager_C_AddItemToInventory final
{
public:
	class FName                                   ItemHardcodedName;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Amount;                                            // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_LootContext                         LootContext;                                       // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_GeneratedItemInfo_Base_C*           GeneratedItem;                                     // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_GeneratedItemInfo_Base_C*           local_generatedItemInfo;                           // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          local_isNewItem;                                   // 0x0020(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_LootContext                         local_lootContext;                                 // 0x0024(0x0004)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SurplusLOCAL;                                      // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AmountToAddLOCAL;                                  // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ItemHardcodedNameLOCAL;                            // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_jRPG_Item_StaticData                ItemStructLOCAL;                                   // 0x0038(0x0130)(Edit, BlueprintVisible, ContainsInstancedReference, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0170(0x0048)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_NameToText_ReturnValue;              // 0x01B8(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x01C8(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0210(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0220(0x0010)()
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0234(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0238(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x023C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23D[0x3];                                      // 0x023D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_NameToText_ReturnValue_1;            // 0x0240(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0250(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0298(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Format_ReturnValue_1;                     // 0x02A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B9[0x7];                                      // 0x02B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_jRPG_GI_Custom_C*                   CallFunc_GetCustomGI_ReturnValue;                  // 0x02C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C9[0x7];                                      // 0x02C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_GeneratedItemInfo_Base_C*           CallFunc_OnItemAddedToInventory_GeneratedItemInfo; // 0x02D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsNameValid_ReturnValue;                  // 0x02D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x02DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x02DB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x02DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2DD[0x3];                                      // 0x02DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_GeneratedItemInfo_Base_C*           CallFunc_OnAddedToInventory_GeneratedItem;         // 0x02E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x02E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x02E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x02EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2EB[0x5];                                      // 0x02EB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UBP_CharacterData_C*>            CallFunc_Map_Values_Values;                        // 0x02F0(0x0010)(ReferenceParm)
	class UBP_CharacterData_C*                    CallFunc_Array_Get_Item;                           // 0x0300(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0308(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x030C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30D[0x3];                                      // 0x030D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_GeneratedItemInfo_Base_C*           CallFunc_AddItemToInventory_GeneratedItem;         // 0x0310(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0318(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_319[0x7];                                      // 0x0319(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_GeneratedItemInfo_Base_C*           CallFunc_AddItemToInventory_GeneratedItem_1;       // 0x0320(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x0328(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_329[0x3];                                      // 0x0329(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetItemStackMaxCount_ReturnValue;         // 0x032C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_2;             // 0x0330(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_331[0x7];                                      // 0x0331(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_GeneratedItemInfo_Item_C*           CallFunc_SpawnObject_ReturnValue;                  // 0x0338(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0340(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue;                        // 0x0344(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckIfThereIsFreeSlotInInventory_Success_; // 0x0348(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_349[0x7];                                      // 0x0349(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_jRPG_Item_DynamicData               K2Node_MakeStruct_S_jRPG_Item_DynamicData;         // 0x0350(0x0138)(ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0488(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckIfThereIsItemInInventory_Success_;   // 0x048C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckIfThereIsItemInInventory_IsItemFullyStacked_; // 0x048D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_48E[0x2];                                      // 0x048E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_CheckIfThereIsItemInInventory_ItemIndex;  // 0x0490(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue_1;                      // 0x0494(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_jRPG_Item_DynamicData               K2Node_MakeStruct_S_jRPG_Item_DynamicData_1;       // 0x0498(0x0138)(ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x05D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x05D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x05D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D9[0x3];                                      // 0x05D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Clamp_ReturnValue_2;                      // 0x05DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckIfThereIsFreeSlotInInventory_Success__1; // 0x05E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetStacksLeftForItem_HasExistingStack;    // 0x05E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E2[0x2];                                      // 0x05E2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetStacksLeftForItem_ItemIndex;           // 0x05E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetStacksLeftForItem_StackLeft;           // 0x05E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetStacksLeftForItem_StackCount;          // 0x05EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetItemDefinitionFromID_Found;            // 0x05F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5F1[0x7];                                      // 0x05F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_jRPG_Item_StaticData                CallFunc_GetItemDefinitionFromID_ReturnValue;      // 0x05F8(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_3;             // 0x0728(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0729(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_72A[0x2];                                      // 0x072A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x072C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetItemQuantityInInventory_ReturnValue;   // 0x0730(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0734(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_735[0x3];                                      // 0x0735(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetItemStackMaxCount_ReturnValue_1;       // 0x0738(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x073C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue_3;                      // 0x0740(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AC_jRPG_InventoryManager_C_AddItemToInventory) == 0x000008, "Wrong alignment on AC_jRPG_InventoryManager_C_AddItemToInventory");
static_assert(sizeof(AC_jRPG_InventoryManager_C_AddItemToInventory) == 0x000748, "Wrong size on AC_jRPG_InventoryManager_C_AddItemToInventory");
static_assert(offsetof(AC_jRPG_InventoryManager_C_AddItemToInventory, ItemHardcodedName) == 0x000000, "Member 'AC_jRPG_InventoryManager_C_AddItemToInventory::ItemHardcodedName' has a wrong offset!");
static_assert(offsetof(AC_jRPG_InventoryManager_C_AddItemToInventory, Amount) == 0x000008, "Member 'AC_jRPG_InventoryManager_C_AddItemToInventory::Amount' has a wrong offset!");
static_assert(offsetof(AC_jRPG_InventoryManager_C_AddItemToInventory, LootContext) == 0x00000C, "Member 'AC_jRPG_InventoryManager_C_AddItemToInventory::LootContext' has a wrong offset!");
static_assert(offsetof(AC_jRPG_InventoryManager_C_AddItemToInventory, GeneratedItem) == 0x000010, "Member 'AC_jRPG_InventoryManager_C_AddItemToInventory::GeneratedItem' has a wrong offset!");
static_assert(offsetof(AC_jRPG_InventoryManager_C_AddItemToInventory, local_generatedItemInfo) == 0x000018, "Member 'AC_jRPG_InventoryManager_C_AddItemToInventory::local_generatedItemInfo' has a wrong offset!");
static_assert(offsetof(AC_jRPG_InventoryManager_C_AddItemToInventory, local_isNewItem) == 0x000020, "Member 'AC_jRPG_InventoryManager_C_AddItemToInventory::local_isNewItem' has a wrong offset!");
static_assert(offsetof(AC_jRPG_InventoryManager_C_AddItemToInventory, local_lootContext) == 0x000024, "Member 'AC_jRPG_InventoryManager_C_AddItemToInventory::local_lootContext' has a wrong offset!");
static_assert(offsetof(AC_jRPG_InventoryManager_C_AddItemToInventory, SurplusLOCAL) == 0x000028, "Member 'AC_jRPG_InventoryManager_C_AddItemToInventory::SurplusLOCAL' has a wrong offset!");
static_assert(offsetof(AC_jRPG_InventoryManager_C_AddItemToInventory, AmountToAddLOCAL) == 0x00002C, "Member 'AC_jRPG_InventoryManager_C_AddItemToInventory::AmountToAddLOCAL' has a wrong offset!");
static_assert(offsetof(AC_jRPG_InventoryManager_C_AddItemToInventory, ItemHardcodedNameLOCAL) == 0x000030, "Member 'AC_jRPG_InventoryManager_C_AddItemToInventory::ItemHardcodedNameLOCAL' has a wrong offset!");
static_assert(offsetof(AC_jRPG_InventoryManager_C_AddItemToInventory, ItemStructLOCAL) == 0x000038, "Member 'AC_jRPG_InventoryManager_C_AddItemToInventory::ItemStructLOCAL' has a wrong offset!");
static_assert(offsetof(AC_jRPG_InventoryManager_C_AddItemToInventory, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000168, "Member 'AC_jRPG_InventoryManager_C_AddItemToInventory::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_InventoryManager_C_AddItemToInventory, K2Node_MakeStruct_FormatArgumentData) == 0x000170, "Member 'AC_jRPG_InventoryManager_C_AddItemToInventory::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(AC_jRPG_InventoryManager_C_AddItemToInventory, CallFunc_Conv_NameToText_ReturnValue) == 0x0001B8, "Member 'AC_jRPG_InventoryManager_C_AddItemToInventory::CallFunc_Conv_NameToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_InventoryManager_C_AddItemToInventory, K2Node_MakeStruct_FormatArgumentData_1) == 0x0001C8, "Member 'AC_jRPG_InventoryManager_C_AddItemToInventory::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(AC_jRPG_InventoryManager_C_AddItemToInventory, K2Node_MakeArray_Array) == 0x000210, "Member 'AC_jRPG_InventoryManager_C_AddItemToInventory::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(AC_jRPG_InventoryManager_C_AddItemToInventory, CallFunc_Format_ReturnValue) == 0x000220, "Member 'AC_jRPG_InventoryManager_C_AddItemToInventory::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_InventoryManager_C_AddItemToInventory, Temp_int_Array_Index_Variable) == 0x000230, "Member 'AC_jRPG_InventoryManager_C_AddItemToInventory::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(AC_jRPG_InventoryManager_C_AddItemToInventory, Temp_int_Loop_Counter_Variable) == 0x000234, "Member 'AC_jRPG_InventoryManager_C_AddItemToInventory::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(AC_jRPG_InventoryManager_C_AddItemToInventory, CallFunc_Add_IntInt_ReturnValue) == 0x000238, "Member 'AC_jRPG_InventoryManager_C_AddItemToInventory::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_InventoryManager_C_AddItemToInventory, CallFunc_IsValid_ReturnValue) == 0x00023C, "Member 'AC_jRPG_InventoryManager_C_AddItemToInventory::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_InventoryManager_C_AddItemToInventory, CallFunc_Conv_NameToText_ReturnValue_1) == 0x000240, "Member 'AC_jRPG_InventoryManager_C_AddItemToInventory::CallFunc_Conv_NameToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AC_jRPG_InventoryManager_C_AddItemToInventory, K2Node_MakeStruct_FormatArgumentData_2) == 0x000250, "Member 'AC_jRPG_InventoryManager_C_AddItemToInventory::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(AC_jRPG_InventoryManager_C_AddItemToInventory, K2Node_MakeArray_Array_1) == 0x000298, "Member 'AC_jRPG_InventoryManager_C_AddItemToInventory::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(AC_jRPG_InventoryManager_C_AddItemToInventory, CallFunc_Format_ReturnValue_1) == 0x0002A8, "Member 'AC_jRPG_InventoryManager_C_AddItemToInventory::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AC_jRPG_InventoryManager_C_AddItemToInventory, CallFunc_IsValid_ReturnValue_1) == 0x0002B8, "Member 'AC_jRPG_InventoryManager_C_AddItemToInventory::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AC_jRPG_InventoryManager_C_AddItemToInventory, CallFunc_GetCustomGI_ReturnValue) == 0x0002C0, "Member 'AC_jRPG_InventoryManager_C_AddItemToInventory::CallFunc_GetCustomGI_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_InventoryManager_C_AddItemToInventory, CallFunc_Not_PreBool_ReturnValue) == 0x0002C8, "Member 'AC_jRPG_InventoryManager_C_AddItemToInventory::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_InventoryManager_C_AddItemToInventory, CallFunc_OnItemAddedToInventory_GeneratedItemInfo) == 0x0002D0, "Member 'AC_jRPG_InventoryManager_C_AddItemToInventory::CallFunc_OnItemAddedToInventory_GeneratedItemInfo' has a wrong offset!");
static_assert(offsetof(AC_jRPG_InventoryManager_C_AddItemToInventory, CallFunc_IsValid_ReturnValue_2) == 0x0002D8, "Member 'AC_jRPG_InventoryManager_C_AddItemToInventory::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AC_jRPG_InventoryManager_C_AddItemToInventory, CallFunc_IsNameValid_ReturnValue) == 0x0002D9, "Member 'AC_jRPG_InventoryManager_C_AddItemToInventory::CallFunc_IsNameValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_InventoryManager_C_AddItemToInventory, CallFunc_IsValid_ReturnValue_3) == 0x0002DA, "Member 'AC_jRPG_InventoryManager_C_AddItemToInventory::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(AC_jRPG_InventoryManager_C_AddItemToInventory, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0002DB, "Member 'AC_jRPG_InventoryManager_C_AddItemToInventory::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_InventoryManager_C_AddItemToInventory, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x0002DC, "Member 'AC_jRPG_InventoryManager_C_AddItemToInventory::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AC_jRPG_InventoryManager_C_AddItemToInventory, CallFunc_OnAddedToInventory_GeneratedItem) == 0x0002E0, "Member 'AC_jRPG_InventoryManager_C_AddItemToInventory::CallFunc_OnAddedToInventory_GeneratedItem' has a wrong offset!");
static_assert(offsetof(AC_jRPG_InventoryManager_C_AddItemToInventory, CallFunc_BooleanOR_ReturnValue) == 0x0002E8, "Member 'AC_jRPG_InventoryManager_C_AddItemToInventory::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_InventoryManager_C_AddItemToInventory, CallFunc_Not_PreBool_ReturnValue_1) == 0x0002E9, "Member 'AC_jRPG_InventoryManager_C_AddItemToInventory::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AC_jRPG_InventoryManager_C_AddItemToInventory, CallFunc_BooleanOR_ReturnValue_1) == 0x0002EA, "Member 'AC_jRPG_InventoryManager_C_AddItemToInventory::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AC_jRPG_InventoryManager_C_AddItemToInventory, CallFunc_Map_Values_Values) == 0x0002F0, "Member 'AC_jRPG_InventoryManager_C_AddItemToInventory::CallFunc_Map_Values_Values' has a wrong offset!");
static_assert(offsetof(AC_jRPG_InventoryManager_C_AddItemToInventory, CallFunc_Array_Get_Item) == 0x000300, "Member 'AC_jRPG_InventoryManager_C_AddItemToInventory::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(AC_jRPG_InventoryManager_C_AddItemToInventory, CallFunc_Array_Length_ReturnValue) == 0x000308, "Member 'AC_jRPG_InventoryManager_C_AddItemToInventory::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_InventoryManager_C_AddItemToInventory, CallFunc_Less_IntInt_ReturnValue) == 0x00030C, "Member 'AC_jRPG_InventoryManager_C_AddItemToInventory::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_InventoryManager_C_AddItemToInventory, CallFunc_AddItemToInventory_GeneratedItem) == 0x000310, "Member 'AC_jRPG_InventoryManager_C_AddItemToInventory::CallFunc_AddItemToInventory_GeneratedItem' has a wrong offset!");
static_assert(offsetof(AC_jRPG_InventoryManager_C_AddItemToInventory, CallFunc_Greater_IntInt_ReturnValue) == 0x000318, "Member 'AC_jRPG_InventoryManager_C_AddItemToInventory::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_InventoryManager_C_AddItemToInventory, CallFunc_AddItemToInventory_GeneratedItem_1) == 0x000320, "Member 'AC_jRPG_InventoryManager_C_AddItemToInventory::CallFunc_AddItemToInventory_GeneratedItem_1' has a wrong offset!");
static_assert(offsetof(AC_jRPG_InventoryManager_C_AddItemToInventory, CallFunc_Greater_IntInt_ReturnValue_1) == 0x000328, "Member 'AC_jRPG_InventoryManager_C_AddItemToInventory::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AC_jRPG_InventoryManager_C_AddItemToInventory, CallFunc_GetItemStackMaxCount_ReturnValue) == 0x00032C, "Member 'AC_jRPG_InventoryManager_C_AddItemToInventory::CallFunc_GetItemStackMaxCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_InventoryManager_C_AddItemToInventory, CallFunc_Greater_IntInt_ReturnValue_2) == 0x000330, "Member 'AC_jRPG_InventoryManager_C_AddItemToInventory::CallFunc_Greater_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AC_jRPG_InventoryManager_C_AddItemToInventory, CallFunc_SpawnObject_ReturnValue) == 0x000338, "Member 'AC_jRPG_InventoryManager_C_AddItemToInventory::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_InventoryManager_C_AddItemToInventory, CallFunc_Subtract_IntInt_ReturnValue) == 0x000340, "Member 'AC_jRPG_InventoryManager_C_AddItemToInventory::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_InventoryManager_C_AddItemToInventory, CallFunc_Clamp_ReturnValue) == 0x000344, "Member 'AC_jRPG_InventoryManager_C_AddItemToInventory::CallFunc_Clamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_InventoryManager_C_AddItemToInventory, CallFunc_CheckIfThereIsFreeSlotInInventory_Success_) == 0x000348, "Member 'AC_jRPG_InventoryManager_C_AddItemToInventory::CallFunc_CheckIfThereIsFreeSlotInInventory_Success_' has a wrong offset!");
static_assert(offsetof(AC_jRPG_InventoryManager_C_AddItemToInventory, K2Node_MakeStruct_S_jRPG_Item_DynamicData) == 0x000350, "Member 'AC_jRPG_InventoryManager_C_AddItemToInventory::K2Node_MakeStruct_S_jRPG_Item_DynamicData' has a wrong offset!");
static_assert(offsetof(AC_jRPG_InventoryManager_C_AddItemToInventory, CallFunc_Array_Add_ReturnValue) == 0x000488, "Member 'AC_jRPG_InventoryManager_C_AddItemToInventory::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_InventoryManager_C_AddItemToInventory, CallFunc_CheckIfThereIsItemInInventory_Success_) == 0x00048C, "Member 'AC_jRPG_InventoryManager_C_AddItemToInventory::CallFunc_CheckIfThereIsItemInInventory_Success_' has a wrong offset!");
static_assert(offsetof(AC_jRPG_InventoryManager_C_AddItemToInventory, CallFunc_CheckIfThereIsItemInInventory_IsItemFullyStacked_) == 0x00048D, "Member 'AC_jRPG_InventoryManager_C_AddItemToInventory::CallFunc_CheckIfThereIsItemInInventory_IsItemFullyStacked_' has a wrong offset!");
static_assert(offsetof(AC_jRPG_InventoryManager_C_AddItemToInventory, CallFunc_CheckIfThereIsItemInInventory_ItemIndex) == 0x000490, "Member 'AC_jRPG_InventoryManager_C_AddItemToInventory::CallFunc_CheckIfThereIsItemInInventory_ItemIndex' has a wrong offset!");
static_assert(offsetof(AC_jRPG_InventoryManager_C_AddItemToInventory, CallFunc_Clamp_ReturnValue_1) == 0x000494, "Member 'AC_jRPG_InventoryManager_C_AddItemToInventory::CallFunc_Clamp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AC_jRPG_InventoryManager_C_AddItemToInventory, K2Node_MakeStruct_S_jRPG_Item_DynamicData_1) == 0x000498, "Member 'AC_jRPG_InventoryManager_C_AddItemToInventory::K2Node_MakeStruct_S_jRPG_Item_DynamicData_1' has a wrong offset!");
static_assert(offsetof(AC_jRPG_InventoryManager_C_AddItemToInventory, CallFunc_Array_Add_ReturnValue_1) == 0x0005D0, "Member 'AC_jRPG_InventoryManager_C_AddItemToInventory::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AC_jRPG_InventoryManager_C_AddItemToInventory, CallFunc_Add_IntInt_ReturnValue_1) == 0x0005D4, "Member 'AC_jRPG_InventoryManager_C_AddItemToInventory::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AC_jRPG_InventoryManager_C_AddItemToInventory, CallFunc_Not_PreBool_ReturnValue_2) == 0x0005D8, "Member 'AC_jRPG_InventoryManager_C_AddItemToInventory::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AC_jRPG_InventoryManager_C_AddItemToInventory, CallFunc_Clamp_ReturnValue_2) == 0x0005DC, "Member 'AC_jRPG_InventoryManager_C_AddItemToInventory::CallFunc_Clamp_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AC_jRPG_InventoryManager_C_AddItemToInventory, CallFunc_CheckIfThereIsFreeSlotInInventory_Success__1) == 0x0005E0, "Member 'AC_jRPG_InventoryManager_C_AddItemToInventory::CallFunc_CheckIfThereIsFreeSlotInInventory_Success__1' has a wrong offset!");
static_assert(offsetof(AC_jRPG_InventoryManager_C_AddItemToInventory, CallFunc_GetStacksLeftForItem_HasExistingStack) == 0x0005E1, "Member 'AC_jRPG_InventoryManager_C_AddItemToInventory::CallFunc_GetStacksLeftForItem_HasExistingStack' has a wrong offset!");
static_assert(offsetof(AC_jRPG_InventoryManager_C_AddItemToInventory, CallFunc_GetStacksLeftForItem_ItemIndex) == 0x0005E4, "Member 'AC_jRPG_InventoryManager_C_AddItemToInventory::CallFunc_GetStacksLeftForItem_ItemIndex' has a wrong offset!");
static_assert(offsetof(AC_jRPG_InventoryManager_C_AddItemToInventory, CallFunc_GetStacksLeftForItem_StackLeft) == 0x0005E8, "Member 'AC_jRPG_InventoryManager_C_AddItemToInventory::CallFunc_GetStacksLeftForItem_StackLeft' has a wrong offset!");
static_assert(offsetof(AC_jRPG_InventoryManager_C_AddItemToInventory, CallFunc_GetStacksLeftForItem_StackCount) == 0x0005EC, "Member 'AC_jRPG_InventoryManager_C_AddItemToInventory::CallFunc_GetStacksLeftForItem_StackCount' has a wrong offset!");
static_assert(offsetof(AC_jRPG_InventoryManager_C_AddItemToInventory, CallFunc_GetItemDefinitionFromID_Found) == 0x0005F0, "Member 'AC_jRPG_InventoryManager_C_AddItemToInventory::CallFunc_GetItemDefinitionFromID_Found' has a wrong offset!");
static_assert(offsetof(AC_jRPG_InventoryManager_C_AddItemToInventory, CallFunc_GetItemDefinitionFromID_ReturnValue) == 0x0005F8, "Member 'AC_jRPG_InventoryManager_C_AddItemToInventory::CallFunc_GetItemDefinitionFromID_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_InventoryManager_C_AddItemToInventory, CallFunc_Greater_IntInt_ReturnValue_3) == 0x000728, "Member 'AC_jRPG_InventoryManager_C_AddItemToInventory::CallFunc_Greater_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(AC_jRPG_InventoryManager_C_AddItemToInventory, CallFunc_BooleanAND_ReturnValue) == 0x000729, "Member 'AC_jRPG_InventoryManager_C_AddItemToInventory::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_InventoryManager_C_AddItemToInventory, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x00072C, "Member 'AC_jRPG_InventoryManager_C_AddItemToInventory::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AC_jRPG_InventoryManager_C_AddItemToInventory, CallFunc_GetItemQuantityInInventory_ReturnValue) == 0x000730, "Member 'AC_jRPG_InventoryManager_C_AddItemToInventory::CallFunc_GetItemQuantityInInventory_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_InventoryManager_C_AddItemToInventory, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000734, "Member 'AC_jRPG_InventoryManager_C_AddItemToInventory::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_InventoryManager_C_AddItemToInventory, CallFunc_GetItemStackMaxCount_ReturnValue_1) == 0x000738, "Member 'AC_jRPG_InventoryManager_C_AddItemToInventory::CallFunc_GetItemStackMaxCount_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AC_jRPG_InventoryManager_C_AddItemToInventory, CallFunc_Add_IntInt_ReturnValue_2) == 0x00073C, "Member 'AC_jRPG_InventoryManager_C_AddItemToInventory::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AC_jRPG_InventoryManager_C_AddItemToInventory, CallFunc_Clamp_ReturnValue_3) == 0x000740, "Member 'AC_jRPG_InventoryManager_C_AddItemToInventory::CallFunc_Clamp_ReturnValue_3' has a wrong offset!");

// Function AC_jRPG_InventoryManager.AC_jRPG_InventoryManager_C.AddMissingItemsFromCharacterSave
// 0x0208 (0x0208 - 0x0000)
struct AC_jRPG_InventoryManager_C_AddMissingItemsFromCharacterSave final
{
public:
	struct FS_jRPG_CharacterSaveState             CharacterSaveState;                                // 0x0000(0x01C0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C4[0x4];                                      // 0x01C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_Map_Values_Values;                        // 0x01C8(0x0010)(ReferenceParm)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FindItemCountFromInventory_Quantity;      // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_LootContext                         K2Node_MakeStruct_S_LootContext;                   // 0x01E8(0x0004)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x01EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1ED[0x3];                                      // 0x01ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_GeneratedItemInfo_Base_C*           CallFunc_AddItemToInventory_GeneratedItem;         // 0x01F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1FD[0x3];                                      // 0x01FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AC_jRPG_InventoryManager_C_AddMissingItemsFromCharacterSave) == 0x000008, "Wrong alignment on AC_jRPG_InventoryManager_C_AddMissingItemsFromCharacterSave");
static_assert(sizeof(AC_jRPG_InventoryManager_C_AddMissingItemsFromCharacterSave) == 0x000208, "Wrong size on AC_jRPG_InventoryManager_C_AddMissingItemsFromCharacterSave");
static_assert(offsetof(AC_jRPG_InventoryManager_C_AddMissingItemsFromCharacterSave, CharacterSaveState) == 0x000000, "Member 'AC_jRPG_InventoryManager_C_AddMissingItemsFromCharacterSave::CharacterSaveState' has a wrong offset!");
static_assert(offsetof(AC_jRPG_InventoryManager_C_AddMissingItemsFromCharacterSave, Temp_int_Array_Index_Variable) == 0x0001C0, "Member 'AC_jRPG_InventoryManager_C_AddMissingItemsFromCharacterSave::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(AC_jRPG_InventoryManager_C_AddMissingItemsFromCharacterSave, CallFunc_Map_Values_Values) == 0x0001C8, "Member 'AC_jRPG_InventoryManager_C_AddMissingItemsFromCharacterSave::CallFunc_Map_Values_Values' has a wrong offset!");
static_assert(offsetof(AC_jRPG_InventoryManager_C_AddMissingItemsFromCharacterSave, CallFunc_Array_Get_Item) == 0x0001D8, "Member 'AC_jRPG_InventoryManager_C_AddMissingItemsFromCharacterSave::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(AC_jRPG_InventoryManager_C_AddMissingItemsFromCharacterSave, CallFunc_Array_Length_ReturnValue) == 0x0001E0, "Member 'AC_jRPG_InventoryManager_C_AddMissingItemsFromCharacterSave::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_InventoryManager_C_AddMissingItemsFromCharacterSave, CallFunc_FindItemCountFromInventory_Quantity) == 0x0001E4, "Member 'AC_jRPG_InventoryManager_C_AddMissingItemsFromCharacterSave::CallFunc_FindItemCountFromInventory_Quantity' has a wrong offset!");
static_assert(offsetof(AC_jRPG_InventoryManager_C_AddMissingItemsFromCharacterSave, K2Node_MakeStruct_S_LootContext) == 0x0001E8, "Member 'AC_jRPG_InventoryManager_C_AddMissingItemsFromCharacterSave::K2Node_MakeStruct_S_LootContext' has a wrong offset!");
static_assert(offsetof(AC_jRPG_InventoryManager_C_AddMissingItemsFromCharacterSave, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0001EC, "Member 'AC_jRPG_InventoryManager_C_AddMissingItemsFromCharacterSave::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_InventoryManager_C_AddMissingItemsFromCharacterSave, CallFunc_AddItemToInventory_GeneratedItem) == 0x0001F0, "Member 'AC_jRPG_InventoryManager_C_AddMissingItemsFromCharacterSave::CallFunc_AddItemToInventory_GeneratedItem' has a wrong offset!");
static_assert(offsetof(AC_jRPG_InventoryManager_C_AddMissingItemsFromCharacterSave, Temp_int_Loop_Counter_Variable) == 0x0001F8, "Member 'AC_jRPG_InventoryManager_C_AddMissingItemsFromCharacterSave::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(AC_jRPG_InventoryManager_C_AddMissingItemsFromCharacterSave, CallFunc_Less_IntInt_ReturnValue) == 0x0001FC, "Member 'AC_jRPG_InventoryManager_C_AddMissingItemsFromCharacterSave::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_InventoryManager_C_AddMissingItemsFromCharacterSave, CallFunc_Add_IntInt_ReturnValue) == 0x000200, "Member 'AC_jRPG_InventoryManager_C_AddMissingItemsFromCharacterSave::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function AC_jRPG_InventoryManager.AC_jRPG_InventoryManager_C.BuyItem
// 0x0160 (0x0160 - 0x0000)
struct AC_jRPG_InventoryManager_C_BuyItem final
{
public:
	class FName                                   ItemHardcodedName;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Success;                                           // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ItemToBuyLOCAL;                                    // 0x000C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_GeneratedItemInfo_Base_C*           CallFunc_AddItemToInventory_GeneratedItem;         // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetItemDefinitionFromID_Found;            // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_jRPG_Item_StaticData                CallFunc_GetItemDefinitionFromID_ReturnValue;      // 0x0028(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_CheckIfItemCanBeBought_CanBeBought;       // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TrySpendGold_Success;                     // 0x0159(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AC_jRPG_InventoryManager_C_BuyItem) == 0x000008, "Wrong alignment on AC_jRPG_InventoryManager_C_BuyItem");
static_assert(sizeof(AC_jRPG_InventoryManager_C_BuyItem) == 0x000160, "Wrong size on AC_jRPG_InventoryManager_C_BuyItem");
static_assert(offsetof(AC_jRPG_InventoryManager_C_BuyItem, ItemHardcodedName) == 0x000000, "Member 'AC_jRPG_InventoryManager_C_BuyItem::ItemHardcodedName' has a wrong offset!");
static_assert(offsetof(AC_jRPG_InventoryManager_C_BuyItem, Success) == 0x000008, "Member 'AC_jRPG_InventoryManager_C_BuyItem::Success' has a wrong offset!");
static_assert(offsetof(AC_jRPG_InventoryManager_C_BuyItem, ItemToBuyLOCAL) == 0x00000C, "Member 'AC_jRPG_InventoryManager_C_BuyItem::ItemToBuyLOCAL' has a wrong offset!");
static_assert(offsetof(AC_jRPG_InventoryManager_C_BuyItem, CallFunc_AddItemToInventory_GeneratedItem) == 0x000018, "Member 'AC_jRPG_InventoryManager_C_BuyItem::CallFunc_AddItemToInventory_GeneratedItem' has a wrong offset!");
static_assert(offsetof(AC_jRPG_InventoryManager_C_BuyItem, CallFunc_GetItemDefinitionFromID_Found) == 0x000020, "Member 'AC_jRPG_InventoryManager_C_BuyItem::CallFunc_GetItemDefinitionFromID_Found' has a wrong offset!");
static_assert(offsetof(AC_jRPG_InventoryManager_C_BuyItem, CallFunc_GetItemDefinitionFromID_ReturnValue) == 0x000028, "Member 'AC_jRPG_InventoryManager_C_BuyItem::CallFunc_GetItemDefinitionFromID_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_InventoryManager_C_BuyItem, CallFunc_CheckIfItemCanBeBought_CanBeBought) == 0x000158, "Member 'AC_jRPG_InventoryManager_C_BuyItem::CallFunc_CheckIfItemCanBeBought_CanBeBought' has a wrong offset!");
static_assert(offsetof(AC_jRPG_InventoryManager_C_BuyItem, CallFunc_TrySpendGold_Success) == 0x000159, "Member 'AC_jRPG_InventoryManager_C_BuyItem::CallFunc_TrySpendGold_Success' has a wrong offset!");

// Function AC_jRPG_InventoryManager.AC_jRPG_InventoryManager_C.CalculateStatsComparisonOnEquip
// 0x02C8 (0x02C8 - 0x0000)
struct AC_jRPG_InventoryManager_C_CalculateStatsComparisonOnEquip final
{
public:
	class FName                                   ItemHardcodedName;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<E_jRPG_StatType, double>                 StatsAfterEquippingLOCAL;                          // 0x0008(0x0050)(Edit, BlueprintVisible)
	TMap<E_jRPG_StatType, double>                 NewItemStatsLOCAL;                                 // 0x0058(0x0050)(Edit, BlueprintVisible)
	TMap<E_jRPG_StatType, double>                 CurrentItemStatsLOCAL;                             // 0x00A8(0x0050)(Edit, BlueprintVisible)
	TMap<E_jRPG_StatType, double>                 CharacterStatsLOCAL;                               // 0x00F8(0x0050)(Edit, BlueprintVisible)
	struct FS_jRPG_Item_StaticData                ItemToEquipLOCAL;                                  // 0x0148(0x0130)(Edit, BlueprintVisible, ContainsInstancedReference, HasGetValueTypeHash)
	TMap<E_jRPG_StatType, double>                 K2Node_MakeVariable_MakeVariableOutput;            // 0x0278(0x0050)()
};
static_assert(alignof(AC_jRPG_InventoryManager_C_CalculateStatsComparisonOnEquip) == 0x000008, "Wrong alignment on AC_jRPG_InventoryManager_C_CalculateStatsComparisonOnEquip");
static_assert(sizeof(AC_jRPG_InventoryManager_C_CalculateStatsComparisonOnEquip) == 0x0002C8, "Wrong size on AC_jRPG_InventoryManager_C_CalculateStatsComparisonOnEquip");
static_assert(offsetof(AC_jRPG_InventoryManager_C_CalculateStatsComparisonOnEquip, ItemHardcodedName) == 0x000000, "Member 'AC_jRPG_InventoryManager_C_CalculateStatsComparisonOnEquip::ItemHardcodedName' has a wrong offset!");
static_assert(offsetof(AC_jRPG_InventoryManager_C_CalculateStatsComparisonOnEquip, StatsAfterEquippingLOCAL) == 0x000008, "Member 'AC_jRPG_InventoryManager_C_CalculateStatsComparisonOnEquip::StatsAfterEquippingLOCAL' has a wrong offset!");
static_assert(offsetof(AC_jRPG_InventoryManager_C_CalculateStatsComparisonOnEquip, NewItemStatsLOCAL) == 0x000058, "Member 'AC_jRPG_InventoryManager_C_CalculateStatsComparisonOnEquip::NewItemStatsLOCAL' has a wrong offset!");
static_assert(offsetof(AC_jRPG_InventoryManager_C_CalculateStatsComparisonOnEquip, CurrentItemStatsLOCAL) == 0x0000A8, "Member 'AC_jRPG_InventoryManager_C_CalculateStatsComparisonOnEquip::CurrentItemStatsLOCAL' has a wrong offset!");
static_assert(offsetof(AC_jRPG_InventoryManager_C_CalculateStatsComparisonOnEquip, CharacterStatsLOCAL) == 0x0000F8, "Member 'AC_jRPG_InventoryManager_C_CalculateStatsComparisonOnEquip::CharacterStatsLOCAL' has a wrong offset!");
static_assert(offsetof(AC_jRPG_InventoryManager_C_CalculateStatsComparisonOnEquip, ItemToEquipLOCAL) == 0x000148, "Member 'AC_jRPG_InventoryManager_C_CalculateStatsComparisonOnEquip::ItemToEquipLOCAL' has a wrong offset!");
static_assert(offsetof(AC_jRPG_InventoryManager_C_CalculateStatsComparisonOnEquip, K2Node_MakeVariable_MakeVariableOutput) == 0x000278, "Member 'AC_jRPG_InventoryManager_C_CalculateStatsComparisonOnEquip::K2Node_MakeVariable_MakeVariableOutput' has a wrong offset!");

// Function AC_jRPG_InventoryManager.AC_jRPG_InventoryManager_C.CanAffordItemCosts
// 0x0180 (0x0180 - 0x0000)
struct AC_jRPG_InventoryManager_C_CanAffordItemCosts final
{
public:
	TArray<struct FS_ItemQuantity>                RequiredItem;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_ItemQuantity                        CallFunc_Array_Get_Item;                           // 0x0020(0x0018)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FindItemDynamicFromInventory_Found;       // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_jRPG_Item_DynamicData               CallFunc_FindItemDynamicFromInventory_ItemStruct;  // 0x0040(0x0138)(ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x017C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AC_jRPG_InventoryManager_C_CanAffordItemCosts) == 0x000008, "Wrong alignment on AC_jRPG_InventoryManager_C_CanAffordItemCosts");
static_assert(sizeof(AC_jRPG_InventoryManager_C_CanAffordItemCosts) == 0x000180, "Wrong size on AC_jRPG_InventoryManager_C_CanAffordItemCosts");
static_assert(offsetof(AC_jRPG_InventoryManager_C_CanAffordItemCosts, RequiredItem) == 0x000000, "Member 'AC_jRPG_InventoryManager_C_CanAffordItemCosts::RequiredItem' has a wrong offset!");
static_assert(offsetof(AC_jRPG_InventoryManager_C_CanAffordItemCosts, ReturnValue) == 0x000010, "Member 'AC_jRPG_InventoryManager_C_CanAffordItemCosts::ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_InventoryManager_C_CanAffordItemCosts, CallFunc_Array_Length_ReturnValue) == 0x000014, "Member 'AC_jRPG_InventoryManager_C_CanAffordItemCosts::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_InventoryManager_C_CanAffordItemCosts, Temp_int_Array_Index_Variable) == 0x000018, "Member 'AC_jRPG_InventoryManager_C_CanAffordItemCosts::Temp_int_Array_Index_Variable' has a wrong offset!");
