#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AC_jRPG_BattleManager

#include "Basic.hpp"

#include "GameplayCameras_structs.hpp"
#include "S_RolledLootEntry_structs.hpp"
#include "Engine_structs.hpp"
#include "S_InteractiveMusicParameters_structs.hpp"
#include "S_LootTableEntry_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "S_LootContext_structs.hpp"
#include "E_jRPG_ItemType_structs.hpp"
#include "FBattleCharacterStoredState_structs.hpp"
#include "S_jRPG_PartySlot_structs.hpp"
#include "E_GameDifficulty_structs.hpp"
#include "EnhancedInput_structs.hpp"
#include "S_jRPG_Item_DynamicData_structs.hpp"
#include "ETeamMotivationLevelType_structs.hpp"
#include "S_jRPG_Item_StaticData_structs.hpp"
#include "S_BattleSummaryStats_structs.hpp"
#include "E_jRPG_FormationType_structs.hpp"
#include "S_jRPG_Encounter_structs.hpp"
#include "EBattleEndResult_structs.hpp"
#include "EFreeAimType_structs.hpp"
#include "ECharacterTeamSelector_structs.hpp"
#include "SandFall_structs.hpp"
#include "S_BattleRewards_structs.hpp"
#include "EDamageReason_structs.hpp"
#include "S_Loot_structs.hpp"
#include "S_jRPG_Action_structs.hpp"
#include "E_FreezeFrame_structs.hpp"
#include "S_FreezeFrame_structs.hpp"
#include "EBattleTurnState_structs.hpp"
#include "S_jRPG_Enemy_structs.hpp"
#include "S_Cameras_BattleFinish_structs.hpp"
#include "FEnemyDataRow_structs.hpp"
#include "FCharacterBattleAudioProfile_structs.hpp"
#include "E_jRPG_StatType_structs.hpp"
#include "S_EnemyScalingDataLevel_structs.hpp"
#include "S_BalancingTableFloatEntry_structs.hpp"
#include "E_jRPG_EngageTypes_structs.hpp"
#include "E_jRPG_ActionType_structs.hpp"
#include "FBattleStartParams_structs.hpp"


namespace SDK::Params
{

// Function AC_jRPG_BattleManager.AC_jRPG_BattleManager_C.ActivateCharacterCamera
// 0x0030 (0x0030 - 0x0000)
struct AC_jRPG_BattleManager_C_ActivateCharacterCamera final
{
public:
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0010(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAC_jRPG_DynamicCameraManager_C*        CallFunc_GetComponentByClass_ReturnValue;          // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AC_jRPG_BattleManager_C_ActivateCharacterCamera) == 0x000008, "Wrong alignment on AC_jRPG_BattleManager_C_ActivateCharacterCamera");
static_assert(sizeof(AC_jRPG_BattleManager_C_ActivateCharacterCamera) == 0x000030, "Wrong size on AC_jRPG_BattleManager_C_ActivateCharacterCamera");
static_assert(offsetof(AC_jRPG_BattleManager_C_ActivateCharacterCamera, CallFunc_GetPlayerController_ReturnValue) == 0x000000, "Member 'AC_jRPG_BattleManager_C_ActivateCharacterCamera::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_BattleManager_C_ActivateCharacterCamera, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'AC_jRPG_BattleManager_C_ActivateCharacterCamera::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_BattleManager_C_ActivateCharacterCamera, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000010, "Member 'AC_jRPG_BattleManager_C_ActivateCharacterCamera::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_BattleManager_C_ActivateCharacterCamera, CallFunc_GetComponentByClass_ReturnValue) == 0x000028, "Member 'AC_jRPG_BattleManager_C_ActivateCharacterCamera::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");

// Function AC_jRPG_BattleManager.AC_jRPG_BattleManager_C.AdaptSpawnedCharacterLocation
// 0x0250 (0x0250 - 0x0000)
struct AC_jRPG_BattleManager_C_AdaptSpawnedCharacterLocation final
{
public:
	struct FVector                                BaseLocation;                                      // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         ActorsToIgnore;                                    // 0x0018(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FVector                                GroundLocation;                                    // 0x0028(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EObjectTypeQuery>                      K2Node_MakeArray_Array;                            // 0x0040(0x0010)(ConstParm, ReferenceParm)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0050(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0068(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingleForObjects_OutHit;         // 0x0080(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingleForObjects_ReturnValue;    // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0179(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x017A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17B[0x1];                                      // 0x017B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_184[0x4];                                      // 0x0184(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0188(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x01A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x01B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x01D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x01E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x01F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x01F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x0214(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21C[0x4];                                      // 0x021C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0220(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0238(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AC_jRPG_BattleManager_C_AdaptSpawnedCharacterLocation) == 0x000008, "Wrong alignment on AC_jRPG_BattleManager_C_AdaptSpawnedCharacterLocation");
static_assert(sizeof(AC_jRPG_BattleManager_C_AdaptSpawnedCharacterLocation) == 0x000250, "Wrong size on AC_jRPG_BattleManager_C_AdaptSpawnedCharacterLocation");
static_assert(offsetof(AC_jRPG_BattleManager_C_AdaptSpawnedCharacterLocation, BaseLocation) == 0x000000, "Member 'AC_jRPG_BattleManager_C_AdaptSpawnedCharacterLocation::BaseLocation' has a wrong offset!");
static_assert(offsetof(AC_jRPG_BattleManager_C_AdaptSpawnedCharacterLocation, ActorsToIgnore) == 0x000018, "Member 'AC_jRPG_BattleManager_C_AdaptSpawnedCharacterLocation::ActorsToIgnore' has a wrong offset!");
static_assert(offsetof(AC_jRPG_BattleManager_C_AdaptSpawnedCharacterLocation, GroundLocation) == 0x000028, "Member 'AC_jRPG_BattleManager_C_AdaptSpawnedCharacterLocation::GroundLocation' has a wrong offset!");
static_assert(offsetof(AC_jRPG_BattleManager_C_AdaptSpawnedCharacterLocation, K2Node_MakeArray_Array) == 0x000040, "Member 'AC_jRPG_BattleManager_C_AdaptSpawnedCharacterLocation::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(AC_jRPG_BattleManager_C_AdaptSpawnedCharacterLocation, CallFunc_Add_VectorVector_ReturnValue) == 0x000050, "Member 'AC_jRPG_BattleManager_C_AdaptSpawnedCharacterLocation::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_BattleManager_C_AdaptSpawnedCharacterLocation, CallFunc_Add_VectorVector_ReturnValue_1) == 0x000068, "Member 'AC_jRPG_BattleManager_C_AdaptSpawnedCharacterLocation::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AC_jRPG_BattleManager_C_AdaptSpawnedCharacterLocation, CallFunc_LineTraceSingleForObjects_OutHit) == 0x000080, "Member 'AC_jRPG_BattleManager_C_AdaptSpawnedCharacterLocation::CallFunc_LineTraceSingleForObjects_OutHit' has a wrong offset!");
static_assert(offsetof(AC_jRPG_BattleManager_C_AdaptSpawnedCharacterLocation, CallFunc_LineTraceSingleForObjects_ReturnValue) == 0x000178, "Member 'AC_jRPG_BattleManager_C_AdaptSpawnedCharacterLocation::CallFunc_LineTraceSingleForObjects_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_BattleManager_C_AdaptSpawnedCharacterLocation, CallFunc_BreakHitResult_bBlockingHit) == 0x000179, "Member 'AC_jRPG_BattleManager_C_AdaptSpawnedCharacterLocation::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(AC_jRPG_BattleManager_C_AdaptSpawnedCharacterLocation, CallFunc_BreakHitResult_bInitialOverlap) == 0x00017A, "Member 'AC_jRPG_BattleManager_C_AdaptSpawnedCharacterLocation::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(AC_jRPG_BattleManager_C_AdaptSpawnedCharacterLocation, CallFunc_BreakHitResult_Time) == 0x00017C, "Member 'AC_jRPG_BattleManager_C_AdaptSpawnedCharacterLocation::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(AC_jRPG_BattleManager_C_AdaptSpawnedCharacterLocation, CallFunc_BreakHitResult_Distance) == 0x000180, "Member 'AC_jRPG_BattleManager_C_AdaptSpawnedCharacterLocation::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(AC_jRPG_BattleManager_C_AdaptSpawnedCharacterLocation, CallFunc_BreakHitResult_Location) == 0x000188, "Member 'AC_jRPG_BattleManager_C_AdaptSpawnedCharacterLocation::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(AC_jRPG_BattleManager_C_AdaptSpawnedCharacterLocation, CallFunc_BreakHitResult_ImpactPoint) == 0x0001A0, "Member 'AC_jRPG_BattleManager_C_AdaptSpawnedCharacterLocation::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(AC_jRPG_BattleManager_C_AdaptSpawnedCharacterLocation, CallFunc_BreakHitResult_Normal) == 0x0001B8, "Member 'AC_jRPG_BattleManager_C_AdaptSpawnedCharacterLocation::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(AC_jRPG_BattleManager_C_AdaptSpawnedCharacterLocation, CallFunc_BreakHitResult_ImpactNormal) == 0x0001D0, "Member 'AC_jRPG_BattleManager_C_AdaptSpawnedCharacterLocation::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(AC_jRPG_BattleManager_C_AdaptSpawnedCharacterLocation, CallFunc_BreakHitResult_PhysMat) == 0x0001E8, "Member 'AC_jRPG_BattleManager_C_AdaptSpawnedCharacterLocation::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(AC_jRPG_BattleManager_C_AdaptSpawnedCharacterLocation, CallFunc_BreakHitResult_HitActor) == 0x0001F0, "Member 'AC_jRPG_BattleManager_C_AdaptSpawnedCharacterLocation::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(AC_jRPG_BattleManager_C_AdaptSpawnedCharacterLocation, CallFunc_BreakHitResult_HitComponent) == 0x0001F8, "Member 'AC_jRPG_BattleManager_C_AdaptSpawnedCharacterLocation::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(AC_jRPG_BattleManager_C_AdaptSpawnedCharacterLocation, CallFunc_BreakHitResult_HitBoneName) == 0x000200, "Member 'AC_jRPG_BattleManager_C_AdaptSpawnedCharacterLocation::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(AC_jRPG_BattleManager_C_AdaptSpawnedCharacterLocation, CallFunc_BreakHitResult_BoneName) == 0x000208, "Member 'AC_jRPG_BattleManager_C_AdaptSpawnedCharacterLocation::CallFunc_BreakHitResult_BoneName' has a wrong offset!");
static_assert(offsetof(AC_jRPG_BattleManager_C_AdaptSpawnedCharacterLocation, CallFunc_BreakHitResult_HitItem) == 0x000210, "Member 'AC_jRPG_BattleManager_C_AdaptSpawnedCharacterLocation::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(AC_jRPG_BattleManager_C_AdaptSpawnedCharacterLocation, CallFunc_BreakHitResult_ElementIndex) == 0x000214, "Member 'AC_jRPG_BattleManager_C_AdaptSpawnedCharacterLocation::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(AC_jRPG_BattleManager_C_AdaptSpawnedCharacterLocation, CallFunc_BreakHitResult_FaceIndex) == 0x000218, "Member 'AC_jRPG_BattleManager_C_AdaptSpawnedCharacterLocation::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(AC_jRPG_BattleManager_C_AdaptSpawnedCharacterLocation, CallFunc_BreakHitResult_TraceStart) == 0x000220, "Member 'AC_jRPG_BattleManager_C_AdaptSpawnedCharacterLocation::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(AC_jRPG_BattleManager_C_AdaptSpawnedCharacterLocation, CallFunc_BreakHitResult_TraceEnd) == 0x000238, "Member 'AC_jRPG_BattleManager_C_AdaptSpawnedCharacterLocation::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");

// Function AC_jRPG_BattleManager.AC_jRPG_BattleManager_C.AddBattleModifierBuff
// 0x0028 (0x0028 - 0x0000)
struct AC_jRPG_BattleManager_C_AddBattleModifierBuff final
{
public:
	class UBP_BattleBuffInstance_C*               BuffInstance;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ForcePermanent;                                    // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAC_jRPG_CharacterBattleStats_C*        Temp_object_Variable;                              // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UBP_BattleBuffInstanceWrapper_C*        CallFunc_ActivateBuff_BuffInstanceWrapper;         // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ActivateBuff_Success;                     // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AC_jRPG_BattleManager_C_AddBattleModifierBuff) == 0x000008, "Wrong alignment on AC_jRPG_BattleManager_C_AddBattleModifierBuff");
static_assert(sizeof(AC_jRPG_BattleManager_C_AddBattleModifierBuff) == 0x000028, "Wrong size on AC_jRPG_BattleManager_C_AddBattleModifierBuff");
static_assert(offsetof(AC_jRPG_BattleManager_C_AddBattleModifierBuff, BuffInstance) == 0x000000, "Member 'AC_jRPG_BattleManager_C_AddBattleModifierBuff::BuffInstance' has a wrong offset!");
static_assert(offsetof(AC_jRPG_BattleManager_C_AddBattleModifierBuff, ForcePermanent) == 0x000008, "Member 'AC_jRPG_BattleManager_C_AddBattleModifierBuff::ForcePermanent' has a wrong offset!");
static_assert(offsetof(AC_jRPG_BattleManager_C_AddBattleModifierBuff, Temp_object_Variable) == 0x000010, "Member 'AC_jRPG_BattleManager_C_AddBattleModifierBuff::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(AC_jRPG_BattleManager_C_AddBattleModifierBuff, CallFunc_ActivateBuff_BuffInstanceWrapper) == 0x000018, "Member 'AC_jRPG_BattleManager_C_AddBattleModifierBuff::CallFunc_ActivateBuff_BuffInstanceWrapper' has a wrong offset!");
static_assert(offsetof(AC_jRPG_BattleManager_C_AddBattleModifierBuff, CallFunc_ActivateBuff_Success) == 0x000020, "Member 'AC_jRPG_BattleManager_C_AddBattleModifierBuff::CallFunc_ActivateBuff_Success' has a wrong offset!");

// Function AC_jRPG_BattleManager.AC_jRPG_BattleManager_C.AddExtraLootItem
// 0x01D8 (0x01D8 - 0x0000)
struct AC_jRPG_BattleManager_C_AddExtraLootItem final
{
public:
	class FName                                   ItemId;                                            // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Quantity;                                          // 0x0008(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Reason;                                            // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	int32                                         local_existingCount;                               // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0028(0x0010)()
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0040(0x0048)(HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_NameToText_ReturnValue;              // 0x0090(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00A0(0x0048)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x00E8(0x0048)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_NameToText_ReturnValue_1;            // 0x0130(0x0010)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0140(0x0010)(ReferenceParm)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x0150(0x0048)(HasGetValueTypeHash)
	class FString                                 CallFunc_Format_ReturnValue;                       // 0x0198(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x01A8(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Format_ReturnValue_1;                     // 0x01B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsNameValid_ReturnValue;                  // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x01C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1CA[0x2];                                      // 0x01CA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x01CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Map_Find_Value;                           // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x01D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AC_jRPG_BattleManager_C_AddExtraLootItem) == 0x000008, "Wrong alignment on AC_jRPG_BattleManager_C_AddExtraLootItem");
static_assert(sizeof(AC_jRPG_BattleManager_C_AddExtraLootItem) == 0x0001D8, "Wrong size on AC_jRPG_BattleManager_C_AddExtraLootItem");
static_assert(offsetof(AC_jRPG_BattleManager_C_AddExtraLootItem, ItemId) == 0x000000, "Member 'AC_jRPG_BattleManager_C_AddExtraLootItem::ItemId' has a wrong offset!");
static_assert(offsetof(AC_jRPG_BattleManager_C_AddExtraLootItem, Quantity) == 0x000008, "Member 'AC_jRPG_BattleManager_C_AddExtraLootItem::Quantity' has a wrong offset!");
static_assert(offsetof(AC_jRPG_BattleManager_C_AddExtraLootItem, Reason) == 0x000010, "Member 'AC_jRPG_BattleManager_C_AddExtraLootItem::Reason' has a wrong offset!");
static_assert(offsetof(AC_jRPG_BattleManager_C_AddExtraLootItem, local_existingCount) == 0x000020, "Member 'AC_jRPG_BattleManager_C_AddExtraLootItem::local_existingCount' has a wrong offset!");
static_assert(offsetof(AC_jRPG_BattleManager_C_AddExtraLootItem, CallFunc_Conv_StringToText_ReturnValue) == 0x000028, "Member 'AC_jRPG_BattleManager_C_AddExtraLootItem::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_BattleManager_C_AddExtraLootItem, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000038, "Member 'AC_jRPG_BattleManager_C_AddExtraLootItem::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_BattleManager_C_AddExtraLootItem, K2Node_MakeStruct_FormatArgumentData) == 0x000040, "Member 'AC_jRPG_BattleManager_C_AddExtraLootItem::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(AC_jRPG_BattleManager_C_AddExtraLootItem, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000088, "Member 'AC_jRPG_BattleManager_C_AddExtraLootItem::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_BattleManager_C_AddExtraLootItem, CallFunc_Conv_NameToText_ReturnValue) == 0x000090, "Member 'AC_jRPG_BattleManager_C_AddExtraLootItem::CallFunc_Conv_NameToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_BattleManager_C_AddExtraLootItem, K2Node_MakeStruct_FormatArgumentData_1) == 0x0000A0, "Member 'AC_jRPG_BattleManager_C_AddExtraLootItem::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(AC_jRPG_BattleManager_C_AddExtraLootItem, K2Node_MakeStruct_FormatArgumentData_2) == 0x0000E8, "Member 'AC_jRPG_BattleManager_C_AddExtraLootItem::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(AC_jRPG_BattleManager_C_AddExtraLootItem, CallFunc_Conv_NameToText_ReturnValue_1) == 0x000130, "Member 'AC_jRPG_BattleManager_C_AddExtraLootItem::CallFunc_Conv_NameToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AC_jRPG_BattleManager_C_AddExtraLootItem, K2Node_MakeArray_Array) == 0x000140, "Member 'AC_jRPG_BattleManager_C_AddExtraLootItem::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(AC_jRPG_BattleManager_C_AddExtraLootItem, K2Node_MakeStruct_FormatArgumentData_3) == 0x000150, "Member 'AC_jRPG_BattleManager_C_AddExtraLootItem::K2Node_MakeStruct_FormatArgumentData_3' has a wrong offset!");
static_assert(offsetof(AC_jRPG_BattleManager_C_AddExtraLootItem, CallFunc_Format_ReturnValue) == 0x000198, "Member 'AC_jRPG_BattleManager_C_AddExtraLootItem::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_BattleManager_C_AddExtraLootItem, K2Node_MakeArray_Array_1) == 0x0001A8, "Member 'AC_jRPG_BattleManager_C_AddExtraLootItem::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(AC_jRPG_BattleManager_C_AddExtraLootItem, CallFunc_Format_ReturnValue_1) == 0x0001B8, "Member 'AC_jRPG_BattleManager_C_AddExtraLootItem::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AC_jRPG_BattleManager_C_AddExtraLootItem, CallFunc_IsNameValid_ReturnValue) == 0x0001C8, "Member 'AC_jRPG_BattleManager_C_AddExtraLootItem::CallFunc_IsNameValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_BattleManager_C_AddExtraLootItem, CallFunc_Not_PreBool_ReturnValue) == 0x0001C9, "Member 'AC_jRPG_BattleManager_C_AddExtraLootItem::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_BattleManager_C_AddExtraLootItem, CallFunc_Add_IntInt_ReturnValue) == 0x0001CC, "Member 'AC_jRPG_BattleManager_C_AddExtraLootItem::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_BattleManager_C_AddExtraLootItem, CallFunc_Map_Find_Value) == 0x0001D0, "Member 'AC_jRPG_BattleManager_C_AddExtraLootItem::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(AC_jRPG_BattleManager_C_AddExtraLootItem, CallFunc_Map_Find_ReturnValue) == 0x0001D4, "Member 'AC_jRPG_BattleManager_C_AddExtraLootItem::CallFunc_Map_Find_ReturnValue' has a wrong offset!");

// Function AC_jRPG_BattleManager.AC_jRPG_BattleManager_C.AddGlobalDodgeWindowModifier
// 0x0048 (0x0048 - 0x0000)
struct AC_jRPG_BattleManager_C_AddGlobalDodgeWindowModifier final
{
public:
	float                                         Multiplier;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSF_ModifierStackEntryHandle           OutModifierHandle;                                 // 0x0008(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FString                                 DebugName;                                         // 0x0038(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(AC_jRPG_BattleManager_C_AddGlobalDodgeWindowModifier) == 0x000008, "Wrong alignment on AC_jRPG_BattleManager_C_AddGlobalDodgeWindowModifier");
static_assert(sizeof(AC_jRPG_BattleManager_C_AddGlobalDodgeWindowModifier) == 0x000048, "Wrong size on AC_jRPG_BattleManager_C_AddGlobalDodgeWindowModifier");
static_assert(offsetof(AC_jRPG_BattleManager_C_AddGlobalDodgeWindowModifier, Multiplier) == 0x000000, "Member 'AC_jRPG_BattleManager_C_AddGlobalDodgeWindowModifier::Multiplier' has a wrong offset!");
static_assert(offsetof(AC_jRPG_BattleManager_C_AddGlobalDodgeWindowModifier, OutModifierHandle) == 0x000008, "Member 'AC_jRPG_BattleManager_C_AddGlobalDodgeWindowModifier::OutModifierHandle' has a wrong offset!");
static_assert(offsetof(AC_jRPG_BattleManager_C_AddGlobalDodgeWindowModifier, DebugName) == 0x000038, "Member 'AC_jRPG_BattleManager_C_AddGlobalDodgeWindowModifier::DebugName' has a wrong offset!");

// Function AC_jRPG_BattleManager.AC_jRPG_BattleManager_C.AddGlobalParryWindowModifier
// 0x0048 (0x0048 - 0x0000)
struct AC_jRPG_BattleManager_C_AddGlobalParryWindowModifier final
{
public:
	float                                         Multiplier;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSF_ModifierStackEntryHandle           OutModifierHandle;                                 // 0x0008(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FString                                 DebugName;                                         // 0x0038(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(AC_jRPG_BattleManager_C_AddGlobalParryWindowModifier) == 0x000008, "Wrong alignment on AC_jRPG_BattleManager_C_AddGlobalParryWindowModifier");
static_assert(sizeof(AC_jRPG_BattleManager_C_AddGlobalParryWindowModifier) == 0x000048, "Wrong size on AC_jRPG_BattleManager_C_AddGlobalParryWindowModifier");
static_assert(offsetof(AC_jRPG_BattleManager_C_AddGlobalParryWindowModifier, Multiplier) == 0x000000, "Member 'AC_jRPG_BattleManager_C_AddGlobalParryWindowModifier::Multiplier' has a wrong offset!");
static_assert(offsetof(AC_jRPG_BattleManager_C_AddGlobalParryWindowModifier, OutModifierHandle) == 0x000008, "Member 'AC_jRPG_BattleManager_C_AddGlobalParryWindowModifier::OutModifierHandle' has a wrong offset!");
static_assert(offsetof(AC_jRPG_BattleManager_C_AddGlobalParryWindowModifier, DebugName) == 0x000038, "Member 'AC_jRPG_BattleManager_C_AddGlobalParryWindowModifier::DebugName' has a wrong offset!");

// Function AC_jRPG_BattleManager.AC_jRPG_BattleManager_C.AreAllKickedCharacterStateHandleValid
// 0x0038 (0x0038 - 0x0000)
struct AC_jRPG_BattleManager_C_AreAllKickedCharacterStateHandleValid final
{
public:
	TArray<struct FGuid>                          KickedCharacterHandle;                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          Success;                                           // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGuid                                  CallFunc_Array_Get_Item;                           // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsKickedCharacterStateHandleValid_Success; // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33[0x1];                                       // 0x0033(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AC_jRPG_BattleManager_C_AreAllKickedCharacterStateHandleValid) == 0x000008, "Wrong alignment on AC_jRPG_BattleManager_C_AreAllKickedCharacterStateHandleValid");
static_assert(sizeof(AC_jRPG_BattleManager_C_AreAllKickedCharacterStateHandleValid) == 0x000038, "Wrong size on AC_jRPG_BattleManager_C_AreAllKickedCharacterStateHandleValid");
static_assert(offsetof(AC_jRPG_BattleManager_C_AreAllKickedCharacterStateHandleValid, KickedCharacterHandle) == 0x000000, "Member 'AC_jRPG_BattleManager_C_AreAllKickedCharacterStateHandleValid::KickedCharacterHandle' has a wrong offset!");
static_assert(offsetof(AC_jRPG_BattleManager_C_AreAllKickedCharacterStateHandleValid, Success) == 0x000010, "Member 'AC_jRPG_BattleManager_C_AreAllKickedCharacterStateHandleValid::Success' has a wrong offset!");
static_assert(offsetof(AC_jRPG_BattleManager_C_AreAllKickedCharacterStateHandleValid, CallFunc_Array_Length_ReturnValue) == 0x000014, "Member 'AC_jRPG_BattleManager_C_AreAllKickedCharacterStateHandleValid::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_BattleManager_C_AreAllKickedCharacterStateHandleValid, Temp_int_Array_Index_Variable) == 0x000018, "Member 'AC_jRPG_BattleManager_C_AreAllKickedCharacterStateHandleValid::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(AC_jRPG_BattleManager_C_AreAllKickedCharacterStateHandleValid, Temp_int_Loop_Counter_Variable) == 0x00001C, "Member 'AC_jRPG_BattleManager_C_AreAllKickedCharacterStateHandleValid::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(AC_jRPG_BattleManager_C_AreAllKickedCharacterStateHandleValid, CallFunc_Array_Get_Item) == 0x000020, "Member 'AC_jRPG_BattleManager_C_AreAllKickedCharacterStateHandleValid::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(AC_jRPG_BattleManager_C_AreAllKickedCharacterStateHandleValid, CallFunc_IsKickedCharacterStateHandleValid_Success) == 0x000030, "Member 'AC_jRPG_BattleManager_C_AreAllKickedCharacterStateHandleValid::CallFunc_IsKickedCharacterStateHandleValid_Success' has a wrong offset!");
static_assert(offsetof(AC_jRPG_BattleManager_C_AreAllKickedCharacterStateHandleValid, CallFunc_Less_IntInt_ReturnValue) == 0x000031, "Member 'AC_jRPG_BattleManager_C_AreAllKickedCharacterStateHandleValid::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_BattleManager_C_AreAllKickedCharacterStateHandleValid, CallFunc_Not_PreBool_ReturnValue) == 0x000032, "Member 'AC_jRPG_BattleManager_C_AreAllKickedCharacterStateHandleValid::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_BattleManager_C_AreAllKickedCharacterStateHandleValid, CallFunc_Add_IntInt_ReturnValue) == 0x000034, "Member 'AC_jRPG_BattleManager_C_AreAllKickedCharacterStateHandleValid::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function AC_jRPG_BattleManager.AC_jRPG_BattleManager_C.BeginAOECounterAttack
// 0x0010 (0x0010 - 0x0000)
struct AC_jRPG_BattleManager_C_BeginAOECounterAttack final
{
public:
	TArray<class UAC_jRPG_CharacterBattleStats_C*> CallFunc_ComputeCharactersForAOECounterAttack_ReturnValue; // 0x0000(0x0010)(ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(AC_jRPG_BattleManager_C_BeginAOECounterAttack) == 0x000008, "Wrong alignment on AC_jRPG_BattleManager_C_BeginAOECounterAttack");
static_assert(sizeof(AC_jRPG_BattleManager_C_BeginAOECounterAttack) == 0x000010, "Wrong size on AC_jRPG_BattleManager_C_BeginAOECounterAttack");
static_assert(offsetof(AC_jRPG_BattleManager_C_BeginAOECounterAttack, CallFunc_ComputeCharactersForAOECounterAttack_ReturnValue) == 0x000000, "Member 'AC_jRPG_BattleManager_C_BeginAOECounterAttack::CallFunc_ComputeCharactersForAOECounterAttack_ReturnValue' has a wrong offset!");

// Function AC_jRPG_BattleManager.AC_jRPG_BattleManager_C.CanCharactersCounterAttackEnemySkill
// 0x0058 (0x0058 - 0x0000)
struct AC_jRPG_BattleManager_C_CanCharactersCounterAttackEnemySkill final
{
public:
	class ABP_jRPG_Character_Battle_Base_C*       EnemyCharacter;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_jRPG_Character_Battle_Base_C*> TargetedCharacters;                              // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          CanCounter;                                        // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_jRPG_Character_Battle_Base_C*       CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanCounterAttackCurrentEnemy_ReturnValue; // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x2];                                       // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_jRPG_Character_Battle_Base_C*> CallFunc_GetAllPlayerCharacters_AllCharacters;   // 0x0038(0x0010)(ReferenceParm)
	class ABP_jRPG_Character_Battle_Base_C*       CallFunc_Array_Get_Item_1;                         // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0055(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanCounterAttackCurrentEnemy_ReturnValue_1; // 0x0056(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0057(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AC_jRPG_BattleManager_C_CanCharactersCounterAttackEnemySkill) == 0x000008, "Wrong alignment on AC_jRPG_BattleManager_C_CanCharactersCounterAttackEnemySkill");
static_assert(sizeof(AC_jRPG_BattleManager_C_CanCharactersCounterAttackEnemySkill) == 0x000058, "Wrong size on AC_jRPG_BattleManager_C_CanCharactersCounterAttackEnemySkill");
static_assert(offsetof(AC_jRPG_BattleManager_C_CanCharactersCounterAttackEnemySkill, EnemyCharacter) == 0x000000, "Member 'AC_jRPG_BattleManager_C_CanCharactersCounterAttackEnemySkill::EnemyCharacter' has a wrong offset!");
static_assert(offsetof(AC_jRPG_BattleManager_C_CanCharactersCounterAttackEnemySkill, TargetedCharacters) == 0x000008, "Member 'AC_jRPG_BattleManager_C_CanCharactersCounterAttackEnemySkill::TargetedCharacters' has a wrong offset!");
static_assert(offsetof(AC_jRPG_BattleManager_C_CanCharactersCounterAttackEnemySkill, CanCounter) == 0x000018, "Member 'AC_jRPG_BattleManager_C_CanCharactersCounterAttackEnemySkill::CanCounter' has a wrong offset!");
static_assert(offsetof(AC_jRPG_BattleManager_C_CanCharactersCounterAttackEnemySkill, CallFunc_Array_Get_Item) == 0x000020, "Member 'AC_jRPG_BattleManager_C_CanCharactersCounterAttackEnemySkill::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(AC_jRPG_BattleManager_C_CanCharactersCounterAttackEnemySkill, CallFunc_CanCounterAttackCurrentEnemy_ReturnValue) == 0x000028, "Member 'AC_jRPG_BattleManager_C_CanCharactersCounterAttackEnemySkill::CallFunc_CanCounterAttackCurrentEnemy_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_BattleManager_C_CanCharactersCounterAttackEnemySkill, K2Node_SwitchEnum_CmpSuccess) == 0x000029, "Member 'AC_jRPG_BattleManager_C_CanCharactersCounterAttackEnemySkill::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(AC_jRPG_BattleManager_C_CanCharactersCounterAttackEnemySkill, Temp_int_Array_Index_Variable) == 0x00002C, "Member 'AC_jRPG_BattleManager_C_CanCharactersCounterAttackEnemySkill::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(AC_jRPG_BattleManager_C_CanCharactersCounterAttackEnemySkill, Temp_int_Loop_Counter_Variable) == 0x000030, "Member 'AC_jRPG_BattleManager_C_CanCharactersCounterAttackEnemySkill::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(AC_jRPG_BattleManager_C_CanCharactersCounterAttackEnemySkill, CallFunc_Add_IntInt_ReturnValue) == 0x000034, "Member 'AC_jRPG_BattleManager_C_CanCharactersCounterAttackEnemySkill::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_BattleManager_C_CanCharactersCounterAttackEnemySkill, CallFunc_GetAllPlayerCharacters_AllCharacters) == 0x000038, "Member 'AC_jRPG_BattleManager_C_CanCharactersCounterAttackEnemySkill::CallFunc_GetAllPlayerCharacters_AllCharacters' has a wrong offset!");
static_assert(offsetof(AC_jRPG_BattleManager_C_CanCharactersCounterAttackEnemySkill, CallFunc_Array_Get_Item_1) == 0x000048, "Member 'AC_jRPG_BattleManager_C_CanCharactersCounterAttackEnemySkill::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(AC_jRPG_BattleManager_C_CanCharactersCounterAttackEnemySkill, CallFunc_Array_Length_ReturnValue) == 0x000050, "Member 'AC_jRPG_BattleManager_C_CanCharactersCounterAttackEnemySkill::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_BattleManager_C_CanCharactersCounterAttackEnemySkill, CallFunc_Array_Contains_ReturnValue) == 0x000054, "Member 'AC_jRPG_BattleManager_C_CanCharactersCounterAttackEnemySkill::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_BattleManager_C_CanCharactersCounterAttackEnemySkill, CallFunc_Less_IntInt_ReturnValue) == 0x000055, "Member 'AC_jRPG_BattleManager_C_CanCharactersCounterAttackEnemySkill::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_BattleManager_C_CanCharactersCounterAttackEnemySkill, CallFunc_CanCounterAttackCurrentEnemy_ReturnValue_1) == 0x000056, "Member 'AC_jRPG_BattleManager_C_CanCharactersCounterAttackEnemySkill::CallFunc_CanCounterAttackCurrentEnemy_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AC_jRPG_BattleManager_C_CanCharactersCounterAttackEnemySkill, CallFunc_Not_PreBool_ReturnValue) == 0x000057, "Member 'AC_jRPG_BattleManager_C_CanCharactersCounterAttackEnemySkill::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function AC_jRPG_BattleManager.AC_jRPG_BattleManager_C.CanFleeCurrentFight
// 0x0001 (0x0001 - 0x0000)
struct AC_jRPG_BattleManager_C_CanFleeCurrentFight final
{
public:
	bool                                          FleeImpossible_0;                                  // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AC_jRPG_BattleManager_C_CanFleeCurrentFight) == 0x000001, "Wrong alignment on AC_jRPG_BattleManager_C_CanFleeCurrentFight");
static_assert(sizeof(AC_jRPG_BattleManager_C_CanFleeCurrentFight) == 0x000001, "Wrong size on AC_jRPG_BattleManager_C_CanFleeCurrentFight");
static_assert(offsetof(AC_jRPG_BattleManager_C_CanFleeCurrentFight, FleeImpossible_0) == 0x000000, "Member 'AC_jRPG_BattleManager_C_CanFleeCurrentFight::FleeImpossible_0' has a wrong offset!");

// Function AC_jRPG_BattleManager.AC_jRPG_BattleManager_C.CanPlayReactionBattleLines
// 0x0002 (0x0002 - 0x0000)
struct AC_jRPG_BattleManager_C_CanPlayReactionBattleLines final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AC_jRPG_BattleManager_C_CanPlayReactionBattleLines) == 0x000001, "Wrong alignment on AC_jRPG_BattleManager_C_CanPlayReactionBattleLines");
static_assert(sizeof(AC_jRPG_BattleManager_C_CanPlayReactionBattleLines) == 0x000002, "Wrong size on AC_jRPG_BattleManager_C_CanPlayReactionBattleLines");
static_assert(offsetof(AC_jRPG_BattleManager_C_CanPlayReactionBattleLines, ReturnValue) == 0x000000, "Member 'AC_jRPG_BattleManager_C_CanPlayReactionBattleLines::ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_BattleManager_C_CanPlayReactionBattleLines, CallFunc_Not_PreBool_ReturnValue) == 0x000001, "Member 'AC_jRPG_BattleManager_C_CanPlayReactionBattleLines::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function AC_jRPG_BattleManager.AC_jRPG_BattleManager_C.CanResumeBattle
// 0x000B (0x000B - 0x0000)
struct AC_jRPG_BattleManager_C_CanResumeBattle final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsBattleEnding_ReturnValue;               // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLastStandActive_ReturnValue;            // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AC_jRPG_BattleManager_C_CanResumeBattle) == 0x000001, "Wrong alignment on AC_jRPG_BattleManager_C_CanResumeBattle");
static_assert(sizeof(AC_jRPG_BattleManager_C_CanResumeBattle) == 0x00000B, "Wrong size on AC_jRPG_BattleManager_C_CanResumeBattle");
static_assert(offsetof(AC_jRPG_BattleManager_C_CanResumeBattle, ReturnValue) == 0x000000, "Member 'AC_jRPG_BattleManager_C_CanResumeBattle::ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_BattleManager_C_CanResumeBattle, CallFunc_IsBattleEnding_ReturnValue) == 0x000001, "Member 'AC_jRPG_BattleManager_C_CanResumeBattle::CallFunc_IsBattleEnding_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_BattleManager_C_CanResumeBattle, CallFunc_IsLastStandActive_ReturnValue) == 0x000002, "Member 'AC_jRPG_BattleManager_C_CanResumeBattle::CallFunc_IsLastStandActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_BattleManager_C_CanResumeBattle, CallFunc_Not_PreBool_ReturnValue) == 0x000003, "Member 'AC_jRPG_BattleManager_C_CanResumeBattle::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_BattleManager_C_CanResumeBattle, CallFunc_Not_PreBool_ReturnValue_1) == 0x000004, "Member 'AC_jRPG_BattleManager_C_CanResumeBattle::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AC_jRPG_BattleManager_C_CanResumeBattle, CallFunc_Not_PreBool_ReturnValue_2) == 0x000005, "Member 'AC_jRPG_BattleManager_C_CanResumeBattle::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AC_jRPG_BattleManager_C_CanResumeBattle, CallFunc_Not_PreBool_ReturnValue_3) == 0x000006, "Member 'AC_jRPG_BattleManager_C_CanResumeBattle::CallFunc_Not_PreBool_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(AC_jRPG_BattleManager_C_CanResumeBattle, CallFunc_BooleanAND_ReturnValue) == 0x000007, "Member 'AC_jRPG_BattleManager_C_CanResumeBattle::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_BattleManager_C_CanResumeBattle, CallFunc_BooleanAND_ReturnValue_1) == 0x000008, "Member 'AC_jRPG_BattleManager_C_CanResumeBattle::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AC_jRPG_BattleManager_C_CanResumeBattle, CallFunc_BooleanAND_ReturnValue_2) == 0x000009, "Member 'AC_jRPG_BattleManager_C_CanResumeBattle::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AC_jRPG_BattleManager_C_CanResumeBattle, CallFunc_BooleanAND_ReturnValue_3) == 0x00000A, "Member 'AC_jRPG_BattleManager_C_CanResumeBattle::CallFunc_BooleanAND_ReturnValue_3' has a wrong offset!");

// Function AC_jRPG_BattleManager.AC_jRPG_BattleManager_C.CanSendReserveTeam
// 0x0068 (0x0068 - 0x0000)
struct AC_jRPG_BattleManager_C_CanSendReserveTeam final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLastStandActive_ReturnValue;            // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Map_Length_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_jRPG_Character_Battle_Base_C*       CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDead_ReturnValue;                       // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_27[0x1];                                       // 0x0027(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_jRPG_GI_Custom_C*                   CallFunc_GetCustomGI_ReturnValue;                  // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UBP_CharacterData_C*>            CallFunc_GetCharacterCollection_Characters;        // 0x0040(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0065(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0066(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AC_jRPG_BattleManager_C_CanSendReserveTeam) == 0x000008, "Wrong alignment on AC_jRPG_BattleManager_C_CanSendReserveTeam");
static_assert(sizeof(AC_jRPG_BattleManager_C_CanSendReserveTeam) == 0x000068, "Wrong size on AC_jRPG_BattleManager_C_CanSendReserveTeam");
static_assert(offsetof(AC_jRPG_BattleManager_C_CanSendReserveTeam, ReturnValue) == 0x000000, "Member 'AC_jRPG_BattleManager_C_CanSendReserveTeam::ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_BattleManager_C_CanSendReserveTeam, Temp_int_Array_Index_Variable) == 0x000004, "Member 'AC_jRPG_BattleManager_C_CanSendReserveTeam::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(AC_jRPG_BattleManager_C_CanSendReserveTeam, CallFunc_IsLastStandActive_ReturnValue) == 0x000008, "Member 'AC_jRPG_BattleManager_C_CanSendReserveTeam::CallFunc_IsLastStandActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_jRPG_BattleManager_C_CanSendReserveTeam, CallFunc_Map_Length_ReturnValue) == 0x00000C, "Member 'AC_jRPG_BattleManager_C_CanSendReserveTeam::CallFunc_Map_Length_ReturnValue' has a wrong offset!");
