#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ActorDetectionParameters

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct ActorDetectionParameters.ActorDetectionParameters
// 0x0028 (0x0028 - 0x0000)
struct FActorDetectionParameters final
{
public:
	class AActor*                                 ActorToDetect_4_E903F8294B26E7E64905BDAE30E9337B;  // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	struct FVector                                DeltaVectorWithActor_10_1F3BDAA0495A1AE20FB0CEB3761A409C; // 0x0008(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DistanceToActor_9_6B5DDB644A994E4B2CE38BBB94C0FB70; // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FActorDetectionParameters) == 0x000008, "Wrong alignment on FActorDetectionParameters");
static_assert(sizeof(FActorDetectionParameters) == 0x000028, "Wrong size on FActorDetectionParameters");
static_assert(offsetof(FActorDetectionParameters, ActorToDetect_4_E903F8294B26E7E64905BDAE30E9337B) == 0x000000, "Member 'FActorDetectionParameters::ActorToDetect_4_E903F8294B26E7E64905BDAE30E9337B' has a wrong offset!");
static_assert(offsetof(FActorDetectionParameters, DeltaVectorWithActor_10_1F3BDAA0495A1AE20FB0CEB3761A409C) == 0x000008, "Member 'FActorDetectionParameters::DeltaVectorWithActor_10_1F3BDAA0495A1AE20FB0CEB3761A409C' has a wrong offset!");
static_assert(offsetof(FActorDetectionParameters, DistanceToActor_9_6B5DDB644A994E4B2CE38BBB94C0FB70) == 0x000020, "Member 'FActorDetectionParameters::DistanceToActor_9_6B5DDB644A994E4B2CE38BBB94C0FB70' has a wrong offset!");

}

