#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ALS_PlayerCameraBehavior

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct ALS_PlayerCameraBehavior.ALS_PlayerCameraBehavior_C.AnimBlueprintGeneratedConstantData
// 0x1007 (0x1008 - 0x0001)
struct ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_308;                                // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_309;                                // 0x000C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_310;                               // 0x0018(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<float>                                 __ArrayProperty_311;                               // 0x0028(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_312;                                // 0x0038(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_313;                                 // 0x0040(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_314;                               // 0x0048(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<float>                                 __ArrayProperty_315;                               // 0x0058(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<float>                                 __ArrayProperty_316;                               // 0x0068(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_317;                                // 0x0078(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_318;                                 // 0x0080(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_319;                               // 0x0088(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<float>                                 __ArrayProperty_320;                               // 0x0098(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<int32>                                 __ArrayProperty_321;                               // 0x00A8(0x0010)(BlueprintVisible)
	class FName                                   __NameProperty_322;                                // 0x00B8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_323;                                // 0x00C0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_324;                                 // 0x00C8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_325;                               // 0x00D0(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<float>                                 __ArrayProperty_326;                               // 0x00E0(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<int32>                                 __ArrayProperty_327;                               // 0x00F0(0x0010)(BlueprintVisible)
	EAlphaBlendOption                             __EnumProperty_328;                                // 0x0100(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_329;                               // 0x0108(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<float>                                 __ArrayProperty_330;                               // 0x0118(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<int32>                                 __ArrayProperty_331;                               // 0x0128(0x0010)(BlueprintVisible)
	struct FAnimNodeFunctionRef                   __StructProperty_332;                              // 0x0138(0x0020)(BlueprintVisible, NoDestructor)
	class UBlendProfile*                          __BlendProfile_333;                                // 0x0158(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_334;                                  // 0x0160(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          __BoolProperty_335;                                // 0x0168(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_336;                                // 0x0169(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_337;                                // 0x016A(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16B[0x5];                                      // 0x016B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_338;                               // 0x0170(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<int32>                                 __ArrayProperty_339;                               // 0x0180(0x0010)(BlueprintVisible)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0190(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0210(0x0018)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root;                           // 0x0228(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose_4;               // 0x0258(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyCurve_35;                 // 0x0288(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyCurve_34;                 // 0x02B8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyCurve_33;                 // 0x02E8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyCurve_32;                 // 0x0318(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose_3;               // 0x0348(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_10;               // 0x0378(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyCurve_31;                 // 0x03A8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_9;                // 0x03D8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_2;             // 0x0408(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_1;             // 0x0438(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult;               // 0x0468(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum_11;             // 0x0498(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum_10;             // 0x04C8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum_9;              // 0x04F8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyCurve_30;                 // 0x0528(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyCurve_29;                 // 0x0558(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyCurve_28;                 // 0x0588(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyCurve_27;                 // 0x05B8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyCurve_26;                 // 0x05E8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyCurve_25;                 // 0x0618(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyCurve_24;                 // 0x0648(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyCurve_23;                 // 0x0678(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyCurve_22;                 // 0x06A8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_2;                  // 0x06D8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum_8;              // 0x0708(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum_7;              // 0x0738(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum_6;              // 0x0768(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyCurve_21;                 // 0x0798(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyCurve_20;                 // 0x07C8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyCurve_19;                 // 0x07F8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyCurve_18;                 // 0x0828(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyCurve_17;                 // 0x0858(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyCurve_16;                 // 0x0888(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyCurve_15;                 // 0x08B8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyCurve_14;                 // 0x08E8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyCurve_13;                 // 0x0918(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_1;                  // 0x0948(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum_5;              // 0x0978(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum_4;              // 0x09A8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum_3;              // 0x09D8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyCurve_12;                 // 0x0A08(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyCurve_11;                 // 0x0A38(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyCurve_10;                 // 0x0A68(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyCurve_9;                  // 0x0A98(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyCurve_8;                  // 0x0AC8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyCurve_7;                  // 0x0AF8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyCurve_6;                  // 0x0B28(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyCurve_5;                  // 0x0B58(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyCurve_4;                  // 0x0B88(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult;                    // 0x0BB8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine;                   // 0x0BE8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose_2;               // 0x0C18(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_1;              // 0x0C48(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose_1;               // 0x0C78(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_8;                // 0x0CA8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum_2;              // 0x0CD8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyCurve_3;                  // 0x0D08(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool;                // 0x0D38(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_7;                // 0x0D68(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_6;                // 0x0D98(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_5;                // 0x0DC8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_4;                // 0x0DF8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyCurve_2;                  // 0x0E28(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose;                 // 0x0E58(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_3;                // 0x0E88(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_2;                // 0x0EB8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyCurve_1;                  // 0x0EE8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_1;                // 0x0F18(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose;                  // 0x0F48(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyCurve;                    // 0x0F78(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum_1;              // 0x0FA8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum;                // 0x0FD8(0x0030)()
};
static_assert(alignof(ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData) == 0x001008, "Wrong size on ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData, __NameProperty_308) == 0x000004, "Member 'ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData::__NameProperty_308' has a wrong offset!");
static_assert(offsetof(ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData, __NameProperty_309) == 0x00000C, "Member 'ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData::__NameProperty_309' has a wrong offset!");
static_assert(offsetof(ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData, __ArrayProperty_310) == 0x000018, "Member 'ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData::__ArrayProperty_310' has a wrong offset!");
static_assert(offsetof(ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData, __ArrayProperty_311) == 0x000028, "Member 'ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData::__ArrayProperty_311' has a wrong offset!");
static_assert(offsetof(ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData, __NameProperty_312) == 0x000038, "Member 'ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData::__NameProperty_312' has a wrong offset!");
static_assert(offsetof(ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData, __IntProperty_313) == 0x000040, "Member 'ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData::__IntProperty_313' has a wrong offset!");
static_assert(offsetof(ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData, __ArrayProperty_314) == 0x000048, "Member 'ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData::__ArrayProperty_314' has a wrong offset!");
static_assert(offsetof(ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData, __ArrayProperty_315) == 0x000058, "Member 'ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData::__ArrayProperty_315' has a wrong offset!");
static_assert(offsetof(ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData, __ArrayProperty_316) == 0x000068, "Member 'ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData::__ArrayProperty_316' has a wrong offset!");
static_assert(offsetof(ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData, __NameProperty_317) == 0x000078, "Member 'ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData::__NameProperty_317' has a wrong offset!");
static_assert(offsetof(ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData, __IntProperty_318) == 0x000080, "Member 'ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData::__IntProperty_318' has a wrong offset!");
static_assert(offsetof(ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData, __ArrayProperty_319) == 0x000088, "Member 'ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData::__ArrayProperty_319' has a wrong offset!");
static_assert(offsetof(ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData, __ArrayProperty_320) == 0x000098, "Member 'ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData::__ArrayProperty_320' has a wrong offset!");
static_assert(offsetof(ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData, __ArrayProperty_321) == 0x0000A8, "Member 'ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData::__ArrayProperty_321' has a wrong offset!");
static_assert(offsetof(ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData, __NameProperty_322) == 0x0000B8, "Member 'ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData::__NameProperty_322' has a wrong offset!");
static_assert(offsetof(ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData, __NameProperty_323) == 0x0000C0, "Member 'ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData::__NameProperty_323' has a wrong offset!");
static_assert(offsetof(ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData, __IntProperty_324) == 0x0000C8, "Member 'ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData::__IntProperty_324' has a wrong offset!");
static_assert(offsetof(ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData, __ArrayProperty_325) == 0x0000D0, "Member 'ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData::__ArrayProperty_325' has a wrong offset!");
static_assert(offsetof(ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData, __ArrayProperty_326) == 0x0000E0, "Member 'ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData::__ArrayProperty_326' has a wrong offset!");
static_assert(offsetof(ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData, __ArrayProperty_327) == 0x0000F0, "Member 'ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData::__ArrayProperty_327' has a wrong offset!");
static_assert(offsetof(ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData, __EnumProperty_328) == 0x000100, "Member 'ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData::__EnumProperty_328' has a wrong offset!");
static_assert(offsetof(ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData, __ArrayProperty_329) == 0x000108, "Member 'ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData::__ArrayProperty_329' has a wrong offset!");
static_assert(offsetof(ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData, __ArrayProperty_330) == 0x000118, "Member 'ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData::__ArrayProperty_330' has a wrong offset!");
static_assert(offsetof(ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData, __ArrayProperty_331) == 0x000128, "Member 'ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData::__ArrayProperty_331' has a wrong offset!");
static_assert(offsetof(ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData, __StructProperty_332) == 0x000138, "Member 'ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData::__StructProperty_332' has a wrong offset!");
static_assert(offsetof(ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData, __BlendProfile_333) == 0x000158, "Member 'ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData::__BlendProfile_333' has a wrong offset!");
static_assert(offsetof(ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData, __CurveFloat_334) == 0x000160, "Member 'ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData::__CurveFloat_334' has a wrong offset!");
static_assert(offsetof(ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData, __BoolProperty_335) == 0x000168, "Member 'ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData::__BoolProperty_335' has a wrong offset!");
static_assert(offsetof(ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData, __EnumProperty_336) == 0x000169, "Member 'ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData::__EnumProperty_336' has a wrong offset!");
static_assert(offsetof(ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData, __EnumProperty_337) == 0x00016A, "Member 'ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData::__EnumProperty_337' has a wrong offset!");
static_assert(offsetof(ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData, __ArrayProperty_338) == 0x000170, "Member 'ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData::__ArrayProperty_338' has a wrong offset!");
static_assert(offsetof(ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData, __ArrayProperty_339) == 0x000180, "Member 'ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData::__ArrayProperty_339' has a wrong offset!");
static_assert(offsetof(ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000190, "Member 'ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000210, "Member 'ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root) == 0x000228, "Member 'ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SaveCachedPose_4) == 0x000258, "Member 'ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SaveCachedPose_4' has a wrong offset!");
static_assert(offsetof(ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ModifyCurve_35) == 0x000288, "Member 'ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ModifyCurve_35' has a wrong offset!");
static_assert(offsetof(ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ModifyCurve_34) == 0x0002B8, "Member 'ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ModifyCurve_34' has a wrong offset!");
static_assert(offsetof(ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ModifyCurve_33) == 0x0002E8, "Member 'ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ModifyCurve_33' has a wrong offset!");
static_assert(offsetof(ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ModifyCurve_32) == 0x000318, "Member 'ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ModifyCurve_32' has a wrong offset!");
static_assert(offsetof(ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SaveCachedPose_3) == 0x000348, "Member 'ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SaveCachedPose_3' has a wrong offset!");
static_assert(offsetof(ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData, AnimGraphNode_UseCachedPose_10) == 0x000378, "Member 'ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData::AnimGraphNode_UseCachedPose_10' has a wrong offset!");
static_assert(offsetof(ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ModifyCurve_31) == 0x0003A8, "Member 'ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ModifyCurve_31' has a wrong offset!");
static_assert(offsetof(ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData, AnimGraphNode_UseCachedPose_9) == 0x0003D8, "Member 'ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData::AnimGraphNode_UseCachedPose_9' has a wrong offset!");
static_assert(offsetof(ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_2) == 0x000408, "Member 'ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_2' has a wrong offset!");
static_assert(offsetof(ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_1) == 0x000438, "Member 'ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult) == 0x000468, "Member 'ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendListByEnum_11) == 0x000498, "Member 'ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendListByEnum_11' has a wrong offset!");
static_assert(offsetof(ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendListByEnum_10) == 0x0004C8, "Member 'ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendListByEnum_10' has a wrong offset!");
static_assert(offsetof(ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendListByEnum_9) == 0x0004F8, "Member 'ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendListByEnum_9' has a wrong offset!");
static_assert(offsetof(ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ModifyCurve_30) == 0x000528, "Member 'ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ModifyCurve_30' has a wrong offset!");
static_assert(offsetof(ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ModifyCurve_29) == 0x000558, "Member 'ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ModifyCurve_29' has a wrong offset!");
static_assert(offsetof(ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ModifyCurve_28) == 0x000588, "Member 'ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ModifyCurve_28' has a wrong offset!");
static_assert(offsetof(ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ModifyCurve_27) == 0x0005B8, "Member 'ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ModifyCurve_27' has a wrong offset!");
static_assert(offsetof(ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ModifyCurve_26) == 0x0005E8, "Member 'ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ModifyCurve_26' has a wrong offset!");
static_assert(offsetof(ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ModifyCurve_25) == 0x000618, "Member 'ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ModifyCurve_25' has a wrong offset!");
static_assert(offsetof(ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ModifyCurve_24) == 0x000648, "Member 'ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ModifyCurve_24' has a wrong offset!");
static_assert(offsetof(ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ModifyCurve_23) == 0x000678, "Member 'ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ModifyCurve_23' has a wrong offset!");
static_assert(offsetof(ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ModifyCurve_22) == 0x0006A8, "Member 'ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ModifyCurve_22' has a wrong offset!");
static_assert(offsetof(ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult_2) == 0x0006D8, "Member 'ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult_2' has a wrong offset!");
static_assert(offsetof(ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendListByEnum_8) == 0x000708, "Member 'ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendListByEnum_8' has a wrong offset!");
static_assert(offsetof(ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendListByEnum_7) == 0x000738, "Member 'ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendListByEnum_7' has a wrong offset!");
static_assert(offsetof(ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendListByEnum_6) == 0x000768, "Member 'ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendListByEnum_6' has a wrong offset!");
static_assert(offsetof(ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ModifyCurve_21) == 0x000798, "Member 'ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ModifyCurve_21' has a wrong offset!");
static_assert(offsetof(ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ModifyCurve_20) == 0x0007C8, "Member 'ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ModifyCurve_20' has a wrong offset!");
static_assert(offsetof(ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ModifyCurve_19) == 0x0007F8, "Member 'ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ModifyCurve_19' has a wrong offset!");
static_assert(offsetof(ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ModifyCurve_18) == 0x000828, "Member 'ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ModifyCurve_18' has a wrong offset!");
static_assert(offsetof(ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ModifyCurve_17) == 0x000858, "Member 'ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ModifyCurve_17' has a wrong offset!");
static_assert(offsetof(ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ModifyCurve_16) == 0x000888, "Member 'ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ModifyCurve_16' has a wrong offset!");
static_assert(offsetof(ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ModifyCurve_15) == 0x0008B8, "Member 'ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ModifyCurve_15' has a wrong offset!");
static_assert(offsetof(ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ModifyCurve_14) == 0x0008E8, "Member 'ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ModifyCurve_14' has a wrong offset!");
static_assert(offsetof(ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ModifyCurve_13) == 0x000918, "Member 'ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ModifyCurve_13' has a wrong offset!");
static_assert(offsetof(ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult_1) == 0x000948, "Member 'ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendListByEnum_5) == 0x000978, "Member 'ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendListByEnum_5' has a wrong offset!");
static_assert(offsetof(ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendListByEnum_4) == 0x0009A8, "Member 'ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendListByEnum_4' has a wrong offset!");
static_assert(offsetof(ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendListByEnum_3) == 0x0009D8, "Member 'ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendListByEnum_3' has a wrong offset!");
static_assert(offsetof(ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ModifyCurve_12) == 0x000A08, "Member 'ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ModifyCurve_12' has a wrong offset!");
static_assert(offsetof(ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ModifyCurve_11) == 0x000A38, "Member 'ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ModifyCurve_11' has a wrong offset!");
static_assert(offsetof(ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ModifyCurve_10) == 0x000A68, "Member 'ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ModifyCurve_10' has a wrong offset!");
static_assert(offsetof(ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ModifyCurve_9) == 0x000A98, "Member 'ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ModifyCurve_9' has a wrong offset!");
static_assert(offsetof(ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ModifyCurve_8) == 0x000AC8, "Member 'ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ModifyCurve_8' has a wrong offset!");
static_assert(offsetof(ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ModifyCurve_7) == 0x000AF8, "Member 'ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ModifyCurve_7' has a wrong offset!");
static_assert(offsetof(ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ModifyCurve_6) == 0x000B28, "Member 'ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ModifyCurve_6' has a wrong offset!");
static_assert(offsetof(ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ModifyCurve_5) == 0x000B58, "Member 'ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ModifyCurve_5' has a wrong offset!");
static_assert(offsetof(ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ModifyCurve_4) == 0x000B88, "Member 'ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ModifyCurve_4' has a wrong offset!");
static_assert(offsetof(ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult) == 0x000BB8, "Member 'ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateMachine) == 0x000BE8, "Member 'ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SaveCachedPose_2) == 0x000C18, "Member 'ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SaveCachedPose_2' has a wrong offset!");
static_assert(offsetof(ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendListByBool_1) == 0x000C48, "Member 'ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendListByBool_1' has a wrong offset!");
static_assert(offsetof(ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SaveCachedPose_1) == 0x000C78, "Member 'ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SaveCachedPose_1' has a wrong offset!");
static_assert(offsetof(ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData, AnimGraphNode_UseCachedPose_8) == 0x000CA8, "Member 'ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData::AnimGraphNode_UseCachedPose_8' has a wrong offset!");
static_assert(offsetof(ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendListByEnum_2) == 0x000CD8, "Member 'ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendListByEnum_2' has a wrong offset!");
static_assert(offsetof(ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ModifyCurve_3) == 0x000D08, "Member 'ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ModifyCurve_3' has a wrong offset!");
static_assert(offsetof(ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendListByBool) == 0x000D38, "Member 'ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData, AnimGraphNode_UseCachedPose_7) == 0x000D68, "Member 'ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData::AnimGraphNode_UseCachedPose_7' has a wrong offset!");
static_assert(offsetof(ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData, AnimGraphNode_UseCachedPose_6) == 0x000D98, "Member 'ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData::AnimGraphNode_UseCachedPose_6' has a wrong offset!");
static_assert(offsetof(ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData, AnimGraphNode_UseCachedPose_5) == 0x000DC8, "Member 'ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData::AnimGraphNode_UseCachedPose_5' has a wrong offset!");
static_assert(offsetof(ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData, AnimGraphNode_UseCachedPose_4) == 0x000DF8, "Member 'ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData::AnimGraphNode_UseCachedPose_4' has a wrong offset!");
static_assert(offsetof(ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ModifyCurve_2) == 0x000E28, "Member 'ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ModifyCurve_2' has a wrong offset!");
static_assert(offsetof(ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SaveCachedPose) == 0x000E58, "Member 'ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData, AnimGraphNode_UseCachedPose_3) == 0x000E88, "Member 'ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData::AnimGraphNode_UseCachedPose_3' has a wrong offset!");
static_assert(offsetof(ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData, AnimGraphNode_UseCachedPose_2) == 0x000EB8, "Member 'ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData::AnimGraphNode_UseCachedPose_2' has a wrong offset!");
static_assert(offsetof(ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ModifyCurve_1) == 0x000EE8, "Member 'ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ModifyCurve_1' has a wrong offset!");
static_assert(offsetof(ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData, AnimGraphNode_UseCachedPose_1) == 0x000F18, "Member 'ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData::AnimGraphNode_UseCachedPose_1' has a wrong offset!");
static_assert(offsetof(ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData, AnimGraphNode_UseCachedPose) == 0x000F48, "Member 'ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ModifyCurve) == 0x000F78, "Member 'ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ModifyCurve' has a wrong offset!");
static_assert(offsetof(ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendListByEnum_1) == 0x000FA8, "Member 'ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendListByEnum_1' has a wrong offset!");
static_assert(offsetof(ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendListByEnum) == 0x000FD8, "Member 'ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendListByEnum' has a wrong offset!");

// ScriptStruct ALS_PlayerCameraBehavior.ALS_PlayerCameraBehavior_C.AnimBlueprintGeneratedMutableData
// 0x000E (0x000F - 0x0001)
struct ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	uint8                                         __ByteProperty;                                    // 0x0001(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __ByteProperty_0;                                  // 0x0002(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __ByteProperty_1;                                  // 0x0003(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __ByteProperty_2;                                  // 0x0004(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __ByteProperty_3;                                  // 0x0005(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __ByteProperty_4;                                  // 0x0006(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __ByteProperty_5;                                  // 0x0007(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __ByteProperty_6;                                  // 0x0008(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __ByteProperty_7;                                  // 0x0009(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_8;                                  // 0x000A(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __ByteProperty_9;                                  // 0x000B(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_10;                                 // 0x000C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __ByteProperty_11;                                 // 0x000D(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __ByteProperty_12;                                 // 0x000E(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedMutableData) == 0x000001, "Wrong alignment on ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedMutableData) == 0x00000F, "Wrong size on ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedMutableData, __ByteProperty) == 0x000001, "Member 'ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedMutableData::__ByteProperty' has a wrong offset!");
static_assert(offsetof(ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedMutableData, __ByteProperty_0) == 0x000002, "Member 'ALS_PlayerCameraBehavior::FAnimBlueprintGeneratedMutableData::__ByteProperty_0' has a wrong offset!");
