#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AN_BattleWeaponLeft

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function AN_BattleWeaponLeft.AN_BattleWeaponLeft_C.Received_Notify
// 0x0090 (0x0090 - 0x0000)
struct AN_BattleWeaponLeft_C_Received_Notify final
{
public:
	class USkeletalMeshComponent*                 MeshComp;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Animation;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FAnimNotifyEventReference              EventReference;                                    // 0x0010(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          ReturnValue;                                       // 0x0040(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_BattleAudioCharacter_GetComponents_C> K2Node_DynamicCast_AsBPI_Battle_Audio_Character_Get_Components; // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AudioCharacter_BattleManager_C*     CallFunc_GetBattleAudioCharacterManager_AudioCharacterBattleManager; // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_AudioBattleCharacterManager_C> K2Node_DynamicCast_AsBPI_Audio_Battle_Character_Manager; // 0x0078(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AN_BattleWeaponLeft_C_Received_Notify) == 0x000008, "Wrong alignment on AN_BattleWeaponLeft_C_Received_Notify");
static_assert(sizeof(AN_BattleWeaponLeft_C_Received_Notify) == 0x000090, "Wrong size on AN_BattleWeaponLeft_C_Received_Notify");
static_assert(offsetof(AN_BattleWeaponLeft_C_Received_Notify, MeshComp) == 0x000000, "Member 'AN_BattleWeaponLeft_C_Received_Notify::MeshComp' has a wrong offset!");
static_assert(offsetof(AN_BattleWeaponLeft_C_Received_Notify, Animation) == 0x000008, "Member 'AN_BattleWeaponLeft_C_Received_Notify::Animation' has a wrong offset!");
static_assert(offsetof(AN_BattleWeaponLeft_C_Received_Notify, EventReference) == 0x000010, "Member 'AN_BattleWeaponLeft_C_Received_Notify::EventReference' has a wrong offset!");
static_assert(offsetof(AN_BattleWeaponLeft_C_Received_Notify, ReturnValue) == 0x000040, "Member 'AN_BattleWeaponLeft_C_Received_Notify::ReturnValue' has a wrong offset!");
static_assert(offsetof(AN_BattleWeaponLeft_C_Received_Notify, CallFunc_GetOwner_ReturnValue) == 0x000048, "Member 'AN_BattleWeaponLeft_C_Received_Notify::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(AN_BattleWeaponLeft_C_Received_Notify, K2Node_DynamicCast_AsBPI_Battle_Audio_Character_Get_Components) == 0x000050, "Member 'AN_BattleWeaponLeft_C_Received_Notify::K2Node_DynamicCast_AsBPI_Battle_Audio_Character_Get_Components' has a wrong offset!");
static_assert(offsetof(AN_BattleWeaponLeft_C_Received_Notify, K2Node_DynamicCast_bSuccess) == 0x000060, "Member 'AN_BattleWeaponLeft_C_Received_Notify::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AN_BattleWeaponLeft_C_Received_Notify, CallFunc_GetBattleAudioCharacterManager_AudioCharacterBattleManager) == 0x000068, "Member 'AN_BattleWeaponLeft_C_Received_Notify::CallFunc_GetBattleAudioCharacterManager_AudioCharacterBattleManager' has a wrong offset!");
static_assert(offsetof(AN_BattleWeaponLeft_C_Received_Notify, CallFunc_IsValid_ReturnValue) == 0x000070, "Member 'AN_BattleWeaponLeft_C_Received_Notify::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AN_BattleWeaponLeft_C_Received_Notify, K2Node_DynamicCast_AsBPI_Audio_Battle_Character_Manager) == 0x000078, "Member 'AN_BattleWeaponLeft_C_Received_Notify::K2Node_DynamicCast_AsBPI_Audio_Battle_Character_Manager' has a wrong offset!");
static_assert(offsetof(AN_BattleWeaponLeft_C_Received_Notify, K2Node_DynamicCast_bSuccess_1) == 0x000088, "Member 'AN_BattleWeaponLeft_C_Received_Notify::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

}

