#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AN_ExploFoley

#include "Basic.hpp"

#include "EFoleyType_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass AN_ExploFoley.AN_ExploFoley_C
// 0x0010 (0x0048 - 0x0038)
class UAN_ExploFoley_C final : public UAnimNotify
{
public:
	EFoleyType                                    FoleyType;                                         // 0x0038(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShouldPlaySpecificSound;                           // 0x0039(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             SpecificSound;                                     // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)

public:
	void Play_Foley_Sound(class ABP_jRPG_Character_World_C* BP_JRPG_CharacterWorld, class UObject* Owner) const;
	bool Received_Notify(class USkeletalMeshComponent* MeshComp, class UAnimSequenceBase* Animation, const struct FAnimNotifyEventReference& EventReference) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AN_ExploFoley_C">();
	}
	static class UAN_ExploFoley_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAN_ExploFoley_C>();
	}
};
static_assert(alignof(UAN_ExploFoley_C) == 0x000008, "Wrong alignment on UAN_ExploFoley_C");
static_assert(sizeof(UAN_ExploFoley_C) == 0x000048, "Wrong size on UAN_ExploFoley_C");
static_assert(offsetof(UAN_ExploFoley_C, FoleyType) == 0x000038, "Member 'UAN_ExploFoley_C::FoleyType' has a wrong offset!");
static_assert(offsetof(UAN_ExploFoley_C, ShouldPlaySpecificSound) == 0x000039, "Member 'UAN_ExploFoley_C::ShouldPlaySpecificSound' has a wrong offset!");
static_assert(offsetof(UAN_ExploFoley_C, SpecificSound) == 0x000040, "Member 'UAN_ExploFoley_C::SpecificSound' has a wrong offset!");

}

