#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AN_ExploFoley

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function AN_ExploFoley.AN_ExploFoley_C.Play Foley Sound
// 0x0088 (0x0088 - 0x0000)
struct AN_ExploFoley_C_Play_Foley_Sound final
{
public:
	class ABP_jRPG_Character_World_C*             BP_JRPG_CharacterWorld;                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Owner;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_AudioCharacter_GetComponents_C> K2Node_DynamicCast_AsBPI_Audio_Character_Get_Components; // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_GetAudioComponentByType_AudioComponent;   // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue;           // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetFoleyAudioValuesFromOwner_FoleyLowCut; // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetFoleyAudioValuesFromOwner_FoleyVolume; // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IAudioParameterControllerInterface> CallFunc_SetTriggerParameter_self_CastInput; // 0x0070(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetFloatParameter_InFloat_ImplicitCast;   // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetFloatParameter_InFloat_ImplicitCast_1; // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AN_ExploFoley_C_Play_Foley_Sound) == 0x000008, "Wrong alignment on AN_ExploFoley_C_Play_Foley_Sound");
static_assert(sizeof(AN_ExploFoley_C_Play_Foley_Sound) == 0x000088, "Wrong size on AN_ExploFoley_C_Play_Foley_Sound");
static_assert(offsetof(AN_ExploFoley_C_Play_Foley_Sound, BP_JRPG_CharacterWorld) == 0x000000, "Member 'AN_ExploFoley_C_Play_Foley_Sound::BP_JRPG_CharacterWorld' has a wrong offset!");
static_assert(offsetof(AN_ExploFoley_C_Play_Foley_Sound, Owner) == 0x000008, "Member 'AN_ExploFoley_C_Play_Foley_Sound::Owner' has a wrong offset!");
static_assert(offsetof(AN_ExploFoley_C_Play_Foley_Sound, K2Node_DynamicCast_AsBPI_Audio_Character_Get_Components) == 0x000010, "Member 'AN_ExploFoley_C_Play_Foley_Sound::K2Node_DynamicCast_AsBPI_Audio_Character_Get_Components' has a wrong offset!");
static_assert(offsetof(AN_ExploFoley_C_Play_Foley_Sound, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'AN_ExploFoley_C_Play_Foley_Sound::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AN_ExploFoley_C_Play_Foley_Sound, CallFunc_GetAudioComponentByType_AudioComponent) == 0x000028, "Member 'AN_ExploFoley_C_Play_Foley_Sound::CallFunc_GetAudioComponentByType_AudioComponent' has a wrong offset!");
static_assert(offsetof(AN_ExploFoley_C_Play_Foley_Sound, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'AN_ExploFoley_C_Play_Foley_Sound::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AN_ExploFoley_C_Play_Foley_Sound, CallFunc_SpawnSoundAttached_ReturnValue) == 0x000038, "Member 'AN_ExploFoley_C_Play_Foley_Sound::CallFunc_SpawnSoundAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(AN_ExploFoley_C_Play_Foley_Sound, CallFunc_GetFoleyAudioValuesFromOwner_FoleyLowCut) == 0x000040, "Member 'AN_ExploFoley_C_Play_Foley_Sound::CallFunc_GetFoleyAudioValuesFromOwner_FoleyLowCut' has a wrong offset!");
static_assert(offsetof(AN_ExploFoley_C_Play_Foley_Sound, CallFunc_GetFoleyAudioValuesFromOwner_FoleyVolume) == 0x000048, "Member 'AN_ExploFoley_C_Play_Foley_Sound::CallFunc_GetFoleyAudioValuesFromOwner_FoleyVolume' has a wrong offset!");
static_assert(offsetof(AN_ExploFoley_C_Play_Foley_Sound, CallFunc_Not_PreBool_ReturnValue) == 0x000050, "Member 'AN_ExploFoley_C_Play_Foley_Sound::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(AN_ExploFoley_C_Play_Foley_Sound, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x000058, "Member 'AN_ExploFoley_C_Play_Foley_Sound::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(AN_ExploFoley_C_Play_Foley_Sound, CallFunc_Conv_StringToName_ReturnValue) == 0x000068, "Member 'AN_ExploFoley_C_Play_Foley_Sound::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(AN_ExploFoley_C_Play_Foley_Sound, CallFunc_SetTriggerParameter_self_CastInput) == 0x000070, "Member 'AN_ExploFoley_C_Play_Foley_Sound::CallFunc_SetTriggerParameter_self_CastInput' has a wrong offset!");
static_assert(offsetof(AN_ExploFoley_C_Play_Foley_Sound, CallFunc_SetFloatParameter_InFloat_ImplicitCast) == 0x000080, "Member 'AN_ExploFoley_C_Play_Foley_Sound::CallFunc_SetFloatParameter_InFloat_ImplicitCast' has a wrong offset!");
static_assert(offsetof(AN_ExploFoley_C_Play_Foley_Sound, CallFunc_SetFloatParameter_InFloat_ImplicitCast_1) == 0x000084, "Member 'AN_ExploFoley_C_Play_Foley_Sound::CallFunc_SetFloatParameter_InFloat_ImplicitCast_1' has a wrong offset!");

// Function AN_ExploFoley.AN_ExploFoley_C.Received_Notify
// 0x0060 (0x0060 - 0x0000)
struct AN_ExploFoley_C_Received_Notify final
{
public:
	class USkeletalMeshComponent*                 MeshComp;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Animation;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FAnimNotifyEventReference              EventReference;                                    // 0x0010(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          ReturnValue;                                       // 0x0040(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_jRPG_Character_World_C*             K2Node_DynamicCast_AsBP_J_RPG_Character_World;     // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AN_ExploFoley_C_Received_Notify) == 0x000008, "Wrong alignment on AN_ExploFoley_C_Received_Notify");
static_assert(sizeof(AN_ExploFoley_C_Received_Notify) == 0x000060, "Wrong size on AN_ExploFoley_C_Received_Notify");
static_assert(offsetof(AN_ExploFoley_C_Received_Notify, MeshComp) == 0x000000, "Member 'AN_ExploFoley_C_Received_Notify::MeshComp' has a wrong offset!");
static_assert(offsetof(AN_ExploFoley_C_Received_Notify, Animation) == 0x000008, "Member 'AN_ExploFoley_C_Received_Notify::Animation' has a wrong offset!");
static_assert(offsetof(AN_ExploFoley_C_Received_Notify, EventReference) == 0x000010, "Member 'AN_ExploFoley_C_Received_Notify::EventReference' has a wrong offset!");
static_assert(offsetof(AN_ExploFoley_C_Received_Notify, ReturnValue) == 0x000040, "Member 'AN_ExploFoley_C_Received_Notify::ReturnValue' has a wrong offset!");
static_assert(offsetof(AN_ExploFoley_C_Received_Notify, CallFunc_GetOwner_ReturnValue) == 0x000048, "Member 'AN_ExploFoley_C_Received_Notify::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(AN_ExploFoley_C_Received_Notify, K2Node_DynamicCast_AsBP_J_RPG_Character_World) == 0x000050, "Member 'AN_ExploFoley_C_Received_Notify::K2Node_DynamicCast_AsBP_J_RPG_Character_World' has a wrong offset!");
static_assert(offsetof(AN_ExploFoley_C_Received_Notify, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'AN_ExploFoley_C_Received_Notify::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

