#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AN_ExploFootstep

#include "Basic.hpp"

#include "EFootstepsType_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass AN_ExploFootstep.AN_ExploFootstep_C
// 0x0030 (0x0068 - 0x0038)
class UAN_ExploFootstep_C final : public UAnimNotify
{
public:
	class USoundBase*                             Sound;                                             // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FName                                   AttachPointName;                                   // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFootstepsType                                FootstepType;                                      // 0x0048(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        VolumeMultiplier;                                  // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        PitchMultiplier;                                   // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          OverrideMaskCurve;                                 // 0x0060(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsRightFoot;                                       // 0x0061(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	bool Received_Notify(class USkeletalMeshComponent* MeshComp, class UAnimSequenceBase* Animation, const struct FAnimNotifyEventReference& EventReference) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AN_ExploFootstep_C">();
	}
	static class UAN_ExploFootstep_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAN_ExploFootstep_C>();
	}
};
static_assert(alignof(UAN_ExploFootstep_C) == 0x000008, "Wrong alignment on UAN_ExploFootstep_C");
static_assert(sizeof(UAN_ExploFootstep_C) == 0x000068, "Wrong size on UAN_ExploFootstep_C");
static_assert(offsetof(UAN_ExploFootstep_C, Sound) == 0x000038, "Member 'UAN_ExploFootstep_C::Sound' has a wrong offset!");
static_assert(offsetof(UAN_ExploFootstep_C, AttachPointName) == 0x000040, "Member 'UAN_ExploFootstep_C::AttachPointName' has a wrong offset!");
static_assert(offsetof(UAN_ExploFootstep_C, FootstepType) == 0x000048, "Member 'UAN_ExploFootstep_C::FootstepType' has a wrong offset!");
static_assert(offsetof(UAN_ExploFootstep_C, VolumeMultiplier) == 0x000050, "Member 'UAN_ExploFootstep_C::VolumeMultiplier' has a wrong offset!");
static_assert(offsetof(UAN_ExploFootstep_C, PitchMultiplier) == 0x000058, "Member 'UAN_ExploFootstep_C::PitchMultiplier' has a wrong offset!");
static_assert(offsetof(UAN_ExploFootstep_C, OverrideMaskCurve) == 0x000060, "Member 'UAN_ExploFootstep_C::OverrideMaskCurve' has a wrong offset!");
static_assert(offsetof(UAN_ExploFootstep_C, IsRightFoot) == 0x000061, "Member 'UAN_ExploFootstep_C::IsRightFoot' has a wrong offset!");

}

