#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AN_Ono

#include "Basic.hpp"

#include "EOnoType_structs.hpp"
#include "EInWorldAudioContainerComponents_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass AN_Ono.AN_Ono_C
// 0x0020 (0x0058 - 0x0038)
class UAN_Ono_C final : public UAnimNotify
{
public:
	EInWorldAudioContainerComponents              AttachToComponentInWorld;                          // 0x0038(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EOnoType                                      OnoType;                                           // 0x0039(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        PercentageChanceToTrigger;                         // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_DataAsset_CharacterExplorationAudioProfile_C* Audio_Profile_Asset;                     // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USoundAttenuation*                      AttnEnmOverrideBattleHitByCommonEvent;             // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)

public:
	void PlayEnmOnoInBattle(class UObject* Owner) const;
	void PlayMcOnoFromData(class USceneComponent* AttachToComponent, const struct FS_OnoSoundData& OnoSoundData) const;
	void PlayMcOnoInBattle(class ABP_jRPG_Character_Battle_Base_C* Owner) const;
	void PlayMcOnoInWorld(class ABP_jRPG_Character_World_C* BPReference, class UObject* Owner) const;
	bool Received_Notify(class USkeletalMeshComponent* MeshComp, class UAnimSequenceBase* Animation, const struct FAnimNotifyEventReference& EventReference) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AN_Ono_C">();
	}
	static class UAN_Ono_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAN_Ono_C>();
	}
};
static_assert(alignof(UAN_Ono_C) == 0x000008, "Wrong alignment on UAN_Ono_C");
static_assert(sizeof(UAN_Ono_C) == 0x000058, "Wrong size on UAN_Ono_C");
static_assert(offsetof(UAN_Ono_C, AttachToComponentInWorld) == 0x000038, "Member 'UAN_Ono_C::AttachToComponentInWorld' has a wrong offset!");
static_assert(offsetof(UAN_Ono_C, OnoType) == 0x000039, "Member 'UAN_Ono_C::OnoType' has a wrong offset!");
static_assert(offsetof(UAN_Ono_C, PercentageChanceToTrigger) == 0x000040, "Member 'UAN_Ono_C::PercentageChanceToTrigger' has a wrong offset!");
static_assert(offsetof(UAN_Ono_C, Audio_Profile_Asset) == 0x000048, "Member 'UAN_Ono_C::Audio_Profile_Asset' has a wrong offset!");
static_assert(offsetof(UAN_Ono_C, AttnEnmOverrideBattleHitByCommonEvent) == 0x000050, "Member 'UAN_Ono_C::AttnEnmOverrideBattleHitByCommonEvent' has a wrong offset!");

}

