#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AN_PlaySoundDelay

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EInWorldAudioContainerComponents_structs.hpp"


namespace SDK::Params
{

// Function AN_PlaySoundDelay.AN_PlaySoundDelay_C.Received_Notify
// 0x0128 (0x0128 - 0x0000)
struct AN_PlaySoundDelay_C_Received_Notify final
{
public:
	class USkeletalMeshComponent*                 MeshComp;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Animation;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FAnimNotifyEventReference              EventReference;                                    // 0x0010(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          ReturnValue;                                       // 0x0040(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Random_range;                                      // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        Component_Audio;                                   // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        Temp_object_Variable;                              // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_AudioCharacter_GetComponents_C> K2Node_DynamicCast_AsBPI_Audio_Character_Get_Components; // 0x0068(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        Temp_object_Variable_1;                            // 0x0080(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_GetAudioComponents_AC_SFX_01;             // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_GetAudioComponents_AC_Foleys_01;          // 0x0090(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_GetAudioComponents_AC_FT_L;               // 0x0098(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_GetAudioComponents_AC_Vocals_01;          // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_GetAudioComponents_AC_SFX_02;             // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_GetAudioComponents_AC_Foleys_02;          // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_GetAudioComponents_AC_FT_R;               // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_GetAudioComponents_AC_Vocals_02;          // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_GetAudioComponents_AC_Idle;               // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_GetAudioComponents_AC_Weapon_L_01;        // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_GetAudioComponents_AC_Weapon_L_02;        // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_GetAudioComponents_AC_Weapon_R_01;        // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_GetAudioComponents_AC_Hand_L_01;          // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_GetAudioComponents_AC_Hand_R_01;          // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        Temp_object_Variable_2;                            // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EInWorldAudioContainerComponents              Temp_byte_Variable;                                // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_RandomFloatInRange_ReturnValue;           // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        K2Node_Select_Default;                             // 0x0110(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue;           // 0x0118(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SpawnSoundAttached_StartTime_ImplicitCast; // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AN_PlaySoundDelay_C_Received_Notify) == 0x000008, "Wrong alignment on AN_PlaySoundDelay_C_Received_Notify");
static_assert(sizeof(AN_PlaySoundDelay_C_Received_Notify) == 0x000128, "Wrong size on AN_PlaySoundDelay_C_Received_Notify");
static_assert(offsetof(AN_PlaySoundDelay_C_Received_Notify, MeshComp) == 0x000000, "Member 'AN_PlaySoundDelay_C_Received_Notify::MeshComp' has a wrong offset!");
static_assert(offsetof(AN_PlaySoundDelay_C_Received_Notify, Animation) == 0x000008, "Member 'AN_PlaySoundDelay_C_Received_Notify::Animation' has a wrong offset!");
static_assert(offsetof(AN_PlaySoundDelay_C_Received_Notify, EventReference) == 0x000010, "Member 'AN_PlaySoundDelay_C_Received_Notify::EventReference' has a wrong offset!");
static_assert(offsetof(AN_PlaySoundDelay_C_Received_Notify, ReturnValue) == 0x000040, "Member 'AN_PlaySoundDelay_C_Received_Notify::ReturnValue' has a wrong offset!");
static_assert(offsetof(AN_PlaySoundDelay_C_Received_Notify, Random_range) == 0x000048, "Member 'AN_PlaySoundDelay_C_Received_Notify::Random_range' has a wrong offset!");
static_assert(offsetof(AN_PlaySoundDelay_C_Received_Notify, Component_Audio) == 0x000050, "Member 'AN_PlaySoundDelay_C_Received_Notify::Component_Audio' has a wrong offset!");
static_assert(offsetof(AN_PlaySoundDelay_C_Received_Notify, Temp_object_Variable) == 0x000058, "Member 'AN_PlaySoundDelay_C_Received_Notify::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(AN_PlaySoundDelay_C_Received_Notify, CallFunc_GetOwner_ReturnValue) == 0x000060, "Member 'AN_PlaySoundDelay_C_Received_Notify::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(AN_PlaySoundDelay_C_Received_Notify, K2Node_DynamicCast_AsBPI_Audio_Character_Get_Components) == 0x000068, "Member 'AN_PlaySoundDelay_C_Received_Notify::K2Node_DynamicCast_AsBPI_Audio_Character_Get_Components' has a wrong offset!");
static_assert(offsetof(AN_PlaySoundDelay_C_Received_Notify, K2Node_DynamicCast_bSuccess) == 0x000078, "Member 'AN_PlaySoundDelay_C_Received_Notify::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AN_PlaySoundDelay_C_Received_Notify, Temp_object_Variable_1) == 0x000080, "Member 'AN_PlaySoundDelay_C_Received_Notify::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(AN_PlaySoundDelay_C_Received_Notify, CallFunc_GetAudioComponents_AC_SFX_01) == 0x000088, "Member 'AN_PlaySoundDelay_C_Received_Notify::CallFunc_GetAudioComponents_AC_SFX_01' has a wrong offset!");
static_assert(offsetof(AN_PlaySoundDelay_C_Received_Notify, CallFunc_GetAudioComponents_AC_Foleys_01) == 0x000090, "Member 'AN_PlaySoundDelay_C_Received_Notify::CallFunc_GetAudioComponents_AC_Foleys_01' has a wrong offset!");
static_assert(offsetof(AN_PlaySoundDelay_C_Received_Notify, CallFunc_GetAudioComponents_AC_FT_L) == 0x000098, "Member 'AN_PlaySoundDelay_C_Received_Notify::CallFunc_GetAudioComponents_AC_FT_L' has a wrong offset!");
static_assert(offsetof(AN_PlaySoundDelay_C_Received_Notify, CallFunc_GetAudioComponents_AC_Vocals_01) == 0x0000A0, "Member 'AN_PlaySoundDelay_C_Received_Notify::CallFunc_GetAudioComponents_AC_Vocals_01' has a wrong offset!");
static_assert(offsetof(AN_PlaySoundDelay_C_Received_Notify, CallFunc_GetAudioComponents_AC_SFX_02) == 0x0000A8, "Member 'AN_PlaySoundDelay_C_Received_Notify::CallFunc_GetAudioComponents_AC_SFX_02' has a wrong offset!");
static_assert(offsetof(AN_PlaySoundDelay_C_Received_Notify, CallFunc_GetAudioComponents_AC_Foleys_02) == 0x0000B0, "Member 'AN_PlaySoundDelay_C_Received_Notify::CallFunc_GetAudioComponents_AC_Foleys_02' has a wrong offset!");
static_assert(offsetof(AN_PlaySoundDelay_C_Received_Notify, CallFunc_GetAudioComponents_AC_FT_R) == 0x0000B8, "Member 'AN_PlaySoundDelay_C_Received_Notify::CallFunc_GetAudioComponents_AC_FT_R' has a wrong offset!");
static_assert(offsetof(AN_PlaySoundDelay_C_Received_Notify, CallFunc_GetAudioComponents_AC_Vocals_02) == 0x0000C0, "Member 'AN_PlaySoundDelay_C_Received_Notify::CallFunc_GetAudioComponents_AC_Vocals_02' has a wrong offset!");
static_assert(offsetof(AN_PlaySoundDelay_C_Received_Notify, CallFunc_GetAudioComponents_AC_Idle) == 0x0000C8, "Member 'AN_PlaySoundDelay_C_Received_Notify::CallFunc_GetAudioComponents_AC_Idle' has a wrong offset!");
static_assert(offsetof(AN_PlaySoundDelay_C_Received_Notify, CallFunc_GetAudioComponents_AC_Weapon_L_01) == 0x0000D0, "Member 'AN_PlaySoundDelay_C_Received_Notify::CallFunc_GetAudioComponents_AC_Weapon_L_01' has a wrong offset!");
static_assert(offsetof(AN_PlaySoundDelay_C_Received_Notify, CallFunc_GetAudioComponents_AC_Weapon_L_02) == 0x0000D8, "Member 'AN_PlaySoundDelay_C_Received_Notify::CallFunc_GetAudioComponents_AC_Weapon_L_02' has a wrong offset!");
static_assert(offsetof(AN_PlaySoundDelay_C_Received_Notify, CallFunc_GetAudioComponents_AC_Weapon_R_01) == 0x0000E0, "Member 'AN_PlaySoundDelay_C_Received_Notify::CallFunc_GetAudioComponents_AC_Weapon_R_01' has a wrong offset!");
static_assert(offsetof(AN_PlaySoundDelay_C_Received_Notify, CallFunc_GetAudioComponents_AC_Hand_L_01) == 0x0000E8, "Member 'AN_PlaySoundDelay_C_Received_Notify::CallFunc_GetAudioComponents_AC_Hand_L_01' has a wrong offset!");
static_assert(offsetof(AN_PlaySoundDelay_C_Received_Notify, CallFunc_GetAudioComponents_AC_Hand_R_01) == 0x0000F0, "Member 'AN_PlaySoundDelay_C_Received_Notify::CallFunc_GetAudioComponents_AC_Hand_R_01' has a wrong offset!");
static_assert(offsetof(AN_PlaySoundDelay_C_Received_Notify, Temp_object_Variable_2) == 0x0000F8, "Member 'AN_PlaySoundDelay_C_Received_Notify::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(AN_PlaySoundDelay_C_Received_Notify, Temp_byte_Variable) == 0x000100, "Member 'AN_PlaySoundDelay_C_Received_Notify::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AN_PlaySoundDelay_C_Received_Notify, CallFunc_RandomFloatInRange_ReturnValue) == 0x000108, "Member 'AN_PlaySoundDelay_C_Received_Notify::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(AN_PlaySoundDelay_C_Received_Notify, K2Node_Select_Default) == 0x000110, "Member 'AN_PlaySoundDelay_C_Received_Notify::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AN_PlaySoundDelay_C_Received_Notify, CallFunc_SpawnSoundAttached_ReturnValue) == 0x000118, "Member 'AN_PlaySoundDelay_C_Received_Notify::CallFunc_SpawnSoundAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(AN_PlaySoundDelay_C_Received_Notify, CallFunc_SpawnSoundAttached_StartTime_ImplicitCast) == 0x000120, "Member 'AN_PlaySoundDelay_C_Received_Notify::CallFunc_SpawnSoundAttached_StartTime_ImplicitCast' has a wrong offset!");

}

