#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimBlueprint_SpermWhale

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function AnimBlueprint_SpermWhale.AnimBlueprint_SpermWhale_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct AnimBlueprint_SpermWhale_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(AnimBlueprint_SpermWhale_C_AnimGraph) == 0x000008, "Wrong alignment on AnimBlueprint_SpermWhale_C_AnimGraph");
static_assert(sizeof(AnimBlueprint_SpermWhale_C_AnimGraph) == 0x000010, "Wrong size on AnimBlueprint_SpermWhale_C_AnimGraph");
static_assert(offsetof(AnimBlueprint_SpermWhale_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'AnimBlueprint_SpermWhale_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function AnimBlueprint_SpermWhale.AnimBlueprint_SpermWhale_C.ExecuteUbergraph_AnimBlueprint_SpermWhale
// 0x0048 (0x0048 - 0x0000)
struct AnimBlueprint_SpermWhale_C_ExecuteUbergraph_AnimBlueprint_SpermWhale final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Abs_ReturnValue;                          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MultiplyMultiply_FloatFloat_ReturnValue;  // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloat_ReturnValue;                  // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue;                         // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_StructMemberSet___FloatProperty_2_ImplicitCast; // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_StructMemberSet___FloatProperty_1_ImplicitCast; // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_StructMemberSet___FloatProperty_0_ImplicitCast; // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_StructMemberSet___FloatProperty_ImplicitCast; // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Array_Set_Item_ImplicitCast;              // 0x0040(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AnimBlueprint_SpermWhale_C_ExecuteUbergraph_AnimBlueprint_SpermWhale) == 0x000008, "Wrong alignment on AnimBlueprint_SpermWhale_C_ExecuteUbergraph_AnimBlueprint_SpermWhale");
static_assert(sizeof(AnimBlueprint_SpermWhale_C_ExecuteUbergraph_AnimBlueprint_SpermWhale) == 0x000048, "Wrong size on AnimBlueprint_SpermWhale_C_ExecuteUbergraph_AnimBlueprint_SpermWhale");
static_assert(offsetof(AnimBlueprint_SpermWhale_C_ExecuteUbergraph_AnimBlueprint_SpermWhale, EntryPoint) == 0x000000, "Member 'AnimBlueprint_SpermWhale_C_ExecuteUbergraph_AnimBlueprint_SpermWhale::EntryPoint' has a wrong offset!");
static_assert(offsetof(AnimBlueprint_SpermWhale_C_ExecuteUbergraph_AnimBlueprint_SpermWhale, CallFunc_Abs_ReturnValue) == 0x000008, "Member 'AnimBlueprint_SpermWhale_C_ExecuteUbergraph_AnimBlueprint_SpermWhale::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBlueprint_SpermWhale_C_ExecuteUbergraph_AnimBlueprint_SpermWhale, CallFunc_MultiplyMultiply_FloatFloat_ReturnValue) == 0x000010, "Member 'AnimBlueprint_SpermWhale_C_ExecuteUbergraph_AnimBlueprint_SpermWhale::CallFunc_MultiplyMultiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBlueprint_SpermWhale_C_ExecuteUbergraph_AnimBlueprint_SpermWhale, CallFunc_RandomFloat_ReturnValue) == 0x000018, "Member 'AnimBlueprint_SpermWhale_C_ExecuteUbergraph_AnimBlueprint_SpermWhale::CallFunc_RandomFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBlueprint_SpermWhale_C_ExecuteUbergraph_AnimBlueprint_SpermWhale, CallFunc_FClamp_ReturnValue) == 0x000020, "Member 'AnimBlueprint_SpermWhale_C_ExecuteUbergraph_AnimBlueprint_SpermWhale::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBlueprint_SpermWhale_C_ExecuteUbergraph_AnimBlueprint_SpermWhale, CallFunc_Lerp_ReturnValue) == 0x000028, "Member 'AnimBlueprint_SpermWhale_C_ExecuteUbergraph_AnimBlueprint_SpermWhale::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBlueprint_SpermWhale_C_ExecuteUbergraph_AnimBlueprint_SpermWhale, K2Node_StructMemberSet___FloatProperty_2_ImplicitCast) == 0x000030, "Member 'AnimBlueprint_SpermWhale_C_ExecuteUbergraph_AnimBlueprint_SpermWhale::K2Node_StructMemberSet___FloatProperty_2_ImplicitCast' has a wrong offset!");
static_assert(offsetof(AnimBlueprint_SpermWhale_C_ExecuteUbergraph_AnimBlueprint_SpermWhale, K2Node_StructMemberSet___FloatProperty_1_ImplicitCast) == 0x000034, "Member 'AnimBlueprint_SpermWhale_C_ExecuteUbergraph_AnimBlueprint_SpermWhale::K2Node_StructMemberSet___FloatProperty_1_ImplicitCast' has a wrong offset!");
static_assert(offsetof(AnimBlueprint_SpermWhale_C_ExecuteUbergraph_AnimBlueprint_SpermWhale, K2Node_StructMemberSet___FloatProperty_0_ImplicitCast) == 0x000038, "Member 'AnimBlueprint_SpermWhale_C_ExecuteUbergraph_AnimBlueprint_SpermWhale::K2Node_StructMemberSet___FloatProperty_0_ImplicitCast' has a wrong offset!");
static_assert(offsetof(AnimBlueprint_SpermWhale_C_ExecuteUbergraph_AnimBlueprint_SpermWhale, K2Node_StructMemberSet___FloatProperty_ImplicitCast) == 0x00003C, "Member 'AnimBlueprint_SpermWhale_C_ExecuteUbergraph_AnimBlueprint_SpermWhale::K2Node_StructMemberSet___FloatProperty_ImplicitCast' has a wrong offset!");
static_assert(offsetof(AnimBlueprint_SpermWhale_C_ExecuteUbergraph_AnimBlueprint_SpermWhale, CallFunc_Array_Set_Item_ImplicitCast) == 0x000040, "Member 'AnimBlueprint_SpermWhale_C_ExecuteUbergraph_AnimBlueprint_SpermWhale::CallFunc_Array_Set_Item_ImplicitCast' has a wrong offset!");

}

