#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimBlueprint_SpermWhale

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "AnimBlueprint_SpermWhale_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass AnimBlueprint_SpermWhale.AnimBlueprint_SpermWhale_C
// 0x0360 (0x06D0 - 0x0370)
class UAnimBlueprint_SpermWhale_C final : public UAnimInstance
{
public:
	uint8                                         Pad_368[0x8];                                      // 0x0368(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0370(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct AnimBlueprint_SpermWhale::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;     // 0x0378(0x0014)(HasGetValueTypeHash)
	uint8                                         Pad_38C[0x4];                                      // 0x038C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0390(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0398(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x03A0(0x0020)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer;                    // 0x03C0(0x0070)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x0430(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0478(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_1;                  // 0x04C0(0x00F0)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend;                    // 0x05B0(0x00F0)()
	double                                        Direction;                                         // 0x06A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Animation_Blendspace;                              // 0x06A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Swim_Anim_Play_Rate;                               // 0x06B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Mouth;                                             // 0x06B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        SideFins;                                          // 0x06C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBlueprint_SpermWhale_AnimGraphNode_BlendSpacePlayer_40A1AC9F471140EEC30C83B20550FED5();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBlueprint_SpermWhale_AnimGraphNode_LayeredBoneBlend_5CA90F65443B238D5D75D89CE46D5338();
	void ExecuteUbergraph_AnimBlueprint_SpermWhale(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AnimBlueprint_SpermWhale_C">();
	}
	static class UAnimBlueprint_SpermWhale_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimBlueprint_SpermWhale_C>();
	}
};
static_assert(alignof(UAnimBlueprint_SpermWhale_C) == 0x000010, "Wrong alignment on UAnimBlueprint_SpermWhale_C");
static_assert(sizeof(UAnimBlueprint_SpermWhale_C) == 0x0006D0, "Wrong size on UAnimBlueprint_SpermWhale_C");
static_assert(offsetof(UAnimBlueprint_SpermWhale_C, UberGraphFrame) == 0x000370, "Member 'UAnimBlueprint_SpermWhale_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAnimBlueprint_SpermWhale_C, __AnimBlueprintMutables) == 0x000378, "Member 'UAnimBlueprint_SpermWhale_C::__AnimBlueprintMutables' has a wrong offset!");
static_assert(offsetof(UAnimBlueprint_SpermWhale_C, AnimBlueprintExtension_PropertyAccess) == 0x000390, "Member 'UAnimBlueprint_SpermWhale_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UAnimBlueprint_SpermWhale_C, AnimBlueprintExtension_Base) == 0x000398, "Member 'UAnimBlueprint_SpermWhale_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UAnimBlueprint_SpermWhale_C, AnimGraphNode_Root) == 0x0003A0, "Member 'UAnimBlueprint_SpermWhale_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UAnimBlueprint_SpermWhale_C, AnimGraphNode_BlendSpacePlayer) == 0x0003C0, "Member 'UAnimBlueprint_SpermWhale_C::AnimGraphNode_BlendSpacePlayer' has a wrong offset!");
static_assert(offsetof(UAnimBlueprint_SpermWhale_C, AnimGraphNode_SequencePlayer_1) == 0x000430, "Member 'UAnimBlueprint_SpermWhale_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UAnimBlueprint_SpermWhale_C, AnimGraphNode_SequencePlayer) == 0x000478, "Member 'UAnimBlueprint_SpermWhale_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UAnimBlueprint_SpermWhale_C, AnimGraphNode_LayeredBoneBlend_1) == 0x0004C0, "Member 'UAnimBlueprint_SpermWhale_C::AnimGraphNode_LayeredBoneBlend_1' has a wrong offset!");
static_assert(offsetof(UAnimBlueprint_SpermWhale_C, AnimGraphNode_LayeredBoneBlend) == 0x0005B0, "Member 'UAnimBlueprint_SpermWhale_C::AnimGraphNode_LayeredBoneBlend' has a wrong offset!");
static_assert(offsetof(UAnimBlueprint_SpermWhale_C, Direction) == 0x0006A0, "Member 'UAnimBlueprint_SpermWhale_C::Direction' has a wrong offset!");
static_assert(offsetof(UAnimBlueprint_SpermWhale_C, Animation_Blendspace) == 0x0006A8, "Member 'UAnimBlueprint_SpermWhale_C::Animation_Blendspace' has a wrong offset!");
static_assert(offsetof(UAnimBlueprint_SpermWhale_C, Swim_Anim_Play_Rate) == 0x0006B0, "Member 'UAnimBlueprint_SpermWhale_C::Swim_Anim_Play_Rate' has a wrong offset!");
static_assert(offsetof(UAnimBlueprint_SpermWhale_C, Mouth) == 0x0006B8, "Member 'UAnimBlueprint_SpermWhale_C::Mouth' has a wrong offset!");
static_assert(offsetof(UAnimBlueprint_SpermWhale_C, SideFins) == 0x0006C0, "Member 'UAnimBlueprint_SpermWhale_C::SideFins' has a wrong offset!");

}

