#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: APPBP_Hair_Maelle_Hair_Attach

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass APPBP_Hair_Maelle_Hair_Attach.APPBP_Hair_Maelle_Hair_Attach_C
// 0x0190 (0x0500 - 0x0370)
class UAPPBP_Hair_Maelle_Hair_Attach_C final : public UAnimInstance
{
public:
	uint8                                         Pad_368[0x8];                                      // 0x0368(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0370(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0378(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0380(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0388(0x0020)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh;                    // 0x03A8(0x0158)(ContainsInstancedReference)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void ExecuteUbergraph_APPBP_Hair_Maelle_Hair_Attach(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"APPBP_Hair_Maelle_Hair_Attach_C">();
	}
	static class UAPPBP_Hair_Maelle_Hair_Attach_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAPPBP_Hair_Maelle_Hair_Attach_C>();
	}
};
static_assert(alignof(UAPPBP_Hair_Maelle_Hair_Attach_C) == 0x000010, "Wrong alignment on UAPPBP_Hair_Maelle_Hair_Attach_C");
static_assert(sizeof(UAPPBP_Hair_Maelle_Hair_Attach_C) == 0x000500, "Wrong size on UAPPBP_Hair_Maelle_Hair_Attach_C");
static_assert(offsetof(UAPPBP_Hair_Maelle_Hair_Attach_C, UberGraphFrame) == 0x000370, "Member 'UAPPBP_Hair_Maelle_Hair_Attach_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAPPBP_Hair_Maelle_Hair_Attach_C, AnimBlueprintExtension_PropertyAccess) == 0x000378, "Member 'UAPPBP_Hair_Maelle_Hair_Attach_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UAPPBP_Hair_Maelle_Hair_Attach_C, AnimBlueprintExtension_Base) == 0x000380, "Member 'UAPPBP_Hair_Maelle_Hair_Attach_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UAPPBP_Hair_Maelle_Hair_Attach_C, AnimGraphNode_Root) == 0x000388, "Member 'UAPPBP_Hair_Maelle_Hair_Attach_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UAPPBP_Hair_Maelle_Hair_Attach_C, AnimGraphNode_CopyPoseFromMesh) == 0x0003A8, "Member 'UAPPBP_Hair_Maelle_Hair_Attach_C::AnimGraphNode_CopyPoseFromMesh' has a wrong offset!");

}

