#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: APPBP_Hair_Maelle_Hair_Attach

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function APPBP_Hair_Maelle_Hair_Attach.APPBP_Hair_Maelle_Hair_Attach_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct APPBP_Hair_Maelle_Hair_Attach_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(APPBP_Hair_Maelle_Hair_Attach_C_AnimGraph) == 0x000008, "Wrong alignment on APPBP_Hair_Maelle_Hair_Attach_C_AnimGraph");
static_assert(sizeof(APPBP_Hair_Maelle_Hair_Attach_C_AnimGraph) == 0x000010, "Wrong size on APPBP_Hair_Maelle_Hair_Attach_C_AnimGraph");
static_assert(offsetof(APPBP_Hair_Maelle_Hair_Attach_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'APPBP_Hair_Maelle_Hair_Attach_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function APPBP_Hair_Maelle_Hair_Attach.APPBP_Hair_Maelle_Hair_Attach_C.ExecuteUbergraph_APPBP_Hair_Maelle_Hair_Attach
// 0x0004 (0x0004 - 0x0000)
struct APPBP_Hair_Maelle_Hair_Attach_C_ExecuteUbergraph_APPBP_Hair_Maelle_Hair_Attach final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(APPBP_Hair_Maelle_Hair_Attach_C_ExecuteUbergraph_APPBP_Hair_Maelle_Hair_Attach) == 0x000004, "Wrong alignment on APPBP_Hair_Maelle_Hair_Attach_C_ExecuteUbergraph_APPBP_Hair_Maelle_Hair_Attach");
static_assert(sizeof(APPBP_Hair_Maelle_Hair_Attach_C_ExecuteUbergraph_APPBP_Hair_Maelle_Hair_Attach) == 0x000004, "Wrong size on APPBP_Hair_Maelle_Hair_Attach_C_ExecuteUbergraph_APPBP_Hair_Maelle_Hair_Attach");
static_assert(offsetof(APPBP_Hair_Maelle_Hair_Attach_C_ExecuteUbergraph_APPBP_Hair_Maelle_Hair_Attach, EntryPoint) == 0x000000, "Member 'APPBP_Hair_Maelle_Hair_Attach_C_ExecuteUbergraph_APPBP_Hair_Maelle_Hair_Attach::EntryPoint' has a wrong offset!");

}

