#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: APPBP_Hair_Maelle_Ponytail_V3_Metahumansk

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct APPBP_Hair_Maelle_Ponytail_V3_Metahumansk.APPBP_Hair_Maelle_Ponytail_V3_Metahumansk_C.AnimBlueprintGeneratedConstantData
// 0x0647 (0x0648 - 0x0001)
struct APPBP_Hair_Maelle_Ponytail_V3_Metahumansk::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_88;                                 // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_89;                                 // 0x000C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_90;                               // 0x0018(0x0020)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0038(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x00B8(0x0018)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_KawaiiPhysics_25;               // 0x00D0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_KawaiiPhysics_24;               // 0x0100(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_KawaiiPhysics_23;               // 0x0130(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_KawaiiPhysics_22;               // 0x0160(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_KawaiiPhysics_21;               // 0x0190(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_KawaiiPhysics_20;               // 0x01C0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_KawaiiPhysics_19;               // 0x01F0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_KawaiiPhysics_18;               // 0x0220(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_KawaiiPhysics_17;               // 0x0250(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_KawaiiPhysics_16;               // 0x0280(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_KawaiiPhysics_15;               // 0x02B0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalToComponentSpace;          // 0x02E0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_KawaiiPhysics_14;               // 0x0310(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_KawaiiPhysics_13;               // 0x0340(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_KawaiiPhysics_12;               // 0x0370(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_KawaiiPhysics_11;               // 0x03A0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_KawaiiPhysics_10;               // 0x03D0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_KawaiiPhysics_9;                // 0x0400(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_KawaiiPhysics_8;                // 0x0430(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ComponentToLocalSpace;          // 0x0460(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_KawaiiPhysics_7;                // 0x0490(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_KawaiiPhysics_6;                // 0x04C0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_KawaiiPhysics_5;                // 0x04F0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_KawaiiPhysics_4;                // 0x0520(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_KawaiiPhysics_3;                // 0x0550(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_KawaiiPhysics_2;                // 0x0580(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_KawaiiPhysics_1;                // 0x05B0(0x0030)()
	struct FAnimNodeExposedValueHandler           AnimGraphNode_LinkedInputPose;                     // 0x05E0(0x0008)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root;                           // 0x05E8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_KawaiiPhysics;                  // 0x0618(0x0030)()
};
static_assert(alignof(APPBP_Hair_Maelle_Ponytail_V3_Metahumansk::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on APPBP_Hair_Maelle_Ponytail_V3_Metahumansk::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(APPBP_Hair_Maelle_Ponytail_V3_Metahumansk::FAnimBlueprintGeneratedConstantData) == 0x000648, "Wrong size on APPBP_Hair_Maelle_Ponytail_V3_Metahumansk::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(APPBP_Hair_Maelle_Ponytail_V3_Metahumansk::FAnimBlueprintGeneratedConstantData, __NameProperty_88) == 0x000004, "Member 'APPBP_Hair_Maelle_Ponytail_V3_Metahumansk::FAnimBlueprintGeneratedConstantData::__NameProperty_88' has a wrong offset!");
static_assert(offsetof(APPBP_Hair_Maelle_Ponytail_V3_Metahumansk::FAnimBlueprintGeneratedConstantData, __NameProperty_89) == 0x00000C, "Member 'APPBP_Hair_Maelle_Ponytail_V3_Metahumansk::FAnimBlueprintGeneratedConstantData::__NameProperty_89' has a wrong offset!");
static_assert(offsetof(APPBP_Hair_Maelle_Ponytail_V3_Metahumansk::FAnimBlueprintGeneratedConstantData, __StructProperty_90) == 0x000018, "Member 'APPBP_Hair_Maelle_Ponytail_V3_Metahumansk::FAnimBlueprintGeneratedConstantData::__StructProperty_90' has a wrong offset!");
static_assert(offsetof(APPBP_Hair_Maelle_Ponytail_V3_Metahumansk::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000038, "Member 'APPBP_Hair_Maelle_Ponytail_V3_Metahumansk::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(APPBP_Hair_Maelle_Ponytail_V3_Metahumansk::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x0000B8, "Member 'APPBP_Hair_Maelle_Ponytail_V3_Metahumansk::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(APPBP_Hair_Maelle_Ponytail_V3_Metahumansk::FAnimBlueprintGeneratedConstantData, AnimGraphNode_KawaiiPhysics_25) == 0x0000D0, "Member 'APPBP_Hair_Maelle_Ponytail_V3_Metahumansk::FAnimBlueprintGeneratedConstantData::AnimGraphNode_KawaiiPhysics_25' has a wrong offset!");
static_assert(offsetof(APPBP_Hair_Maelle_Ponytail_V3_Metahumansk::FAnimBlueprintGeneratedConstantData, AnimGraphNode_KawaiiPhysics_24) == 0x000100, "Member 'APPBP_Hair_Maelle_Ponytail_V3_Metahumansk::FAnimBlueprintGeneratedConstantData::AnimGraphNode_KawaiiPhysics_24' has a wrong offset!");
static_assert(offsetof(APPBP_Hair_Maelle_Ponytail_V3_Metahumansk::FAnimBlueprintGeneratedConstantData, AnimGraphNode_KawaiiPhysics_23) == 0x000130, "Member 'APPBP_Hair_Maelle_Ponytail_V3_Metahumansk::FAnimBlueprintGeneratedConstantData::AnimGraphNode_KawaiiPhysics_23' has a wrong offset!");
static_assert(offsetof(APPBP_Hair_Maelle_Ponytail_V3_Metahumansk::FAnimBlueprintGeneratedConstantData, AnimGraphNode_KawaiiPhysics_22) == 0x000160, "Member 'APPBP_Hair_Maelle_Ponytail_V3_Metahumansk::FAnimBlueprintGeneratedConstantData::AnimGraphNode_KawaiiPhysics_22' has a wrong offset!");
static_assert(offsetof(APPBP_Hair_Maelle_Ponytail_V3_Metahumansk::FAnimBlueprintGeneratedConstantData, AnimGraphNode_KawaiiPhysics_21) == 0x000190, "Member 'APPBP_Hair_Maelle_Ponytail_V3_Metahumansk::FAnimBlueprintGeneratedConstantData::AnimGraphNode_KawaiiPhysics_21' has a wrong offset!");
static_assert(offsetof(APPBP_Hair_Maelle_Ponytail_V3_Metahumansk::FAnimBlueprintGeneratedConstantData, AnimGraphNode_KawaiiPhysics_20) == 0x0001C0, "Member 'APPBP_Hair_Maelle_Ponytail_V3_Metahumansk::FAnimBlueprintGeneratedConstantData::AnimGraphNode_KawaiiPhysics_20' has a wrong offset!");
static_assert(offsetof(APPBP_Hair_Maelle_Ponytail_V3_Metahumansk::FAnimBlueprintGeneratedConstantData, AnimGraphNode_KawaiiPhysics_19) == 0x0001F0, "Member 'APPBP_Hair_Maelle_Ponytail_V3_Metahumansk::FAnimBlueprintGeneratedConstantData::AnimGraphNode_KawaiiPhysics_19' has a wrong offset!");
static_assert(offsetof(APPBP_Hair_Maelle_Ponytail_V3_Metahumansk::FAnimBlueprintGeneratedConstantData, AnimGraphNode_KawaiiPhysics_18) == 0x000220, "Member 'APPBP_Hair_Maelle_Ponytail_V3_Metahumansk::FAnimBlueprintGeneratedConstantData::AnimGraphNode_KawaiiPhysics_18' has a wrong offset!");
static_assert(offsetof(APPBP_Hair_Maelle_Ponytail_V3_Metahumansk::FAnimBlueprintGeneratedConstantData, AnimGraphNode_KawaiiPhysics_17) == 0x000250, "Member 'APPBP_Hair_Maelle_Ponytail_V3_Metahumansk::FAnimBlueprintGeneratedConstantData::AnimGraphNode_KawaiiPhysics_17' has a wrong offset!");
static_assert(offsetof(APPBP_Hair_Maelle_Ponytail_V3_Metahumansk::FAnimBlueprintGeneratedConstantData, AnimGraphNode_KawaiiPhysics_16) == 0x000280, "Member 'APPBP_Hair_Maelle_Ponytail_V3_Metahumansk::FAnimBlueprintGeneratedConstantData::AnimGraphNode_KawaiiPhysics_16' has a wrong offset!");
static_assert(offsetof(APPBP_Hair_Maelle_Ponytail_V3_Metahumansk::FAnimBlueprintGeneratedConstantData, AnimGraphNode_KawaiiPhysics_15) == 0x0002B0, "Member 'APPBP_Hair_Maelle_Ponytail_V3_Metahumansk::FAnimBlueprintGeneratedConstantData::AnimGraphNode_KawaiiPhysics_15' has a wrong offset!");
static_assert(offsetof(APPBP_Hair_Maelle_Ponytail_V3_Metahumansk::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LocalToComponentSpace) == 0x0002E0, "Member 'APPBP_Hair_Maelle_Ponytail_V3_Metahumansk::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(APPBP_Hair_Maelle_Ponytail_V3_Metahumansk::FAnimBlueprintGeneratedConstantData, AnimGraphNode_KawaiiPhysics_14) == 0x000310, "Member 'APPBP_Hair_Maelle_Ponytail_V3_Metahumansk::FAnimBlueprintGeneratedConstantData::AnimGraphNode_KawaiiPhysics_14' has a wrong offset!");
static_assert(offsetof(APPBP_Hair_Maelle_Ponytail_V3_Metahumansk::FAnimBlueprintGeneratedConstantData, AnimGraphNode_KawaiiPhysics_13) == 0x000340, "Member 'APPBP_Hair_Maelle_Ponytail_V3_Metahumansk::FAnimBlueprintGeneratedConstantData::AnimGraphNode_KawaiiPhysics_13' has a wrong offset!");
static_assert(offsetof(APPBP_Hair_Maelle_Ponytail_V3_Metahumansk::FAnimBlueprintGeneratedConstantData, AnimGraphNode_KawaiiPhysics_12) == 0x000370, "Member 'APPBP_Hair_Maelle_Ponytail_V3_Metahumansk::FAnimBlueprintGeneratedConstantData::AnimGraphNode_KawaiiPhysics_12' has a wrong offset!");
static_assert(offsetof(APPBP_Hair_Maelle_Ponytail_V3_Metahumansk::FAnimBlueprintGeneratedConstantData, AnimGraphNode_KawaiiPhysics_11) == 0x0003A0, "Member 'APPBP_Hair_Maelle_Ponytail_V3_Metahumansk::FAnimBlueprintGeneratedConstantData::AnimGraphNode_KawaiiPhysics_11' has a wrong offset!");
static_assert(offsetof(APPBP_Hair_Maelle_Ponytail_V3_Metahumansk::FAnimBlueprintGeneratedConstantData, AnimGraphNode_KawaiiPhysics_10) == 0x0003D0, "Member 'APPBP_Hair_Maelle_Ponytail_V3_Metahumansk::FAnimBlueprintGeneratedConstantData::AnimGraphNode_KawaiiPhysics_10' has a wrong offset!");
static_assert(offsetof(APPBP_Hair_Maelle_Ponytail_V3_Metahumansk::FAnimBlueprintGeneratedConstantData, AnimGraphNode_KawaiiPhysics_9) == 0x000400, "Member 'APPBP_Hair_Maelle_Ponytail_V3_Metahumansk::FAnimBlueprintGeneratedConstantData::AnimGraphNode_KawaiiPhysics_9' has a wrong offset!");
static_assert(offsetof(APPBP_Hair_Maelle_Ponytail_V3_Metahumansk::FAnimBlueprintGeneratedConstantData, AnimGraphNode_KawaiiPhysics_8) == 0x000430, "Member 'APPBP_Hair_Maelle_Ponytail_V3_Metahumansk::FAnimBlueprintGeneratedConstantData::AnimGraphNode_KawaiiPhysics_8' has a wrong offset!");
static_assert(offsetof(APPBP_Hair_Maelle_Ponytail_V3_Metahumansk::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ComponentToLocalSpace) == 0x000460, "Member 'APPBP_Hair_Maelle_Ponytail_V3_Metahumansk::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(APPBP_Hair_Maelle_Ponytail_V3_Metahumansk::FAnimBlueprintGeneratedConstantData, AnimGraphNode_KawaiiPhysics_7) == 0x000490, "Member 'APPBP_Hair_Maelle_Ponytail_V3_Metahumansk::FAnimBlueprintGeneratedConstantData::AnimGraphNode_KawaiiPhysics_7' has a wrong offset!");
static_assert(offsetof(APPBP_Hair_Maelle_Ponytail_V3_Metahumansk::FAnimBlueprintGeneratedConstantData, AnimGraphNode_KawaiiPhysics_6) == 0x0004C0, "Member 'APPBP_Hair_Maelle_Ponytail_V3_Metahumansk::FAnimBlueprintGeneratedConstantData::AnimGraphNode_KawaiiPhysics_6' has a wrong offset!");
static_assert(offsetof(APPBP_Hair_Maelle_Ponytail_V3_Metahumansk::FAnimBlueprintGeneratedConstantData, AnimGraphNode_KawaiiPhysics_5) == 0x0004F0, "Member 'APPBP_Hair_Maelle_Ponytail_V3_Metahumansk::FAnimBlueprintGeneratedConstantData::AnimGraphNode_KawaiiPhysics_5' has a wrong offset!");
static_assert(offsetof(APPBP_Hair_Maelle_Ponytail_V3_Metahumansk::FAnimBlueprintGeneratedConstantData, AnimGraphNode_KawaiiPhysics_4) == 0x000520, "Member 'APPBP_Hair_Maelle_Ponytail_V3_Metahumansk::FAnimBlueprintGeneratedConstantData::AnimGraphNode_KawaiiPhysics_4' has a wrong offset!");
static_assert(offsetof(APPBP_Hair_Maelle_Ponytail_V3_Metahumansk::FAnimBlueprintGeneratedConstantData, AnimGraphNode_KawaiiPhysics_3) == 0x000550, "Member 'APPBP_Hair_Maelle_Ponytail_V3_Metahumansk::FAnimBlueprintGeneratedConstantData::AnimGraphNode_KawaiiPhysics_3' has a wrong offset!");
static_assert(offsetof(APPBP_Hair_Maelle_Ponytail_V3_Metahumansk::FAnimBlueprintGeneratedConstantData, AnimGraphNode_KawaiiPhysics_2) == 0x000580, "Member 'APPBP_Hair_Maelle_Ponytail_V3_Metahumansk::FAnimBlueprintGeneratedConstantData::AnimGraphNode_KawaiiPhysics_2' has a wrong offset!");
static_assert(offsetof(APPBP_Hair_Maelle_Ponytail_V3_Metahumansk::FAnimBlueprintGeneratedConstantData, AnimGraphNode_KawaiiPhysics_1) == 0x0005B0, "Member 'APPBP_Hair_Maelle_Ponytail_V3_Metahumansk::FAnimBlueprintGeneratedConstantData::AnimGraphNode_KawaiiPhysics_1' has a wrong offset!");
static_assert(offsetof(APPBP_Hair_Maelle_Ponytail_V3_Metahumansk::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LinkedInputPose) == 0x0005E0, "Member 'APPBP_Hair_Maelle_Ponytail_V3_Metahumansk::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LinkedInputPose' has a wrong offset!");
static_assert(offsetof(APPBP_Hair_Maelle_Ponytail_V3_Metahumansk::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root) == 0x0005E8, "Member 'APPBP_Hair_Maelle_Ponytail_V3_Metahumansk::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(APPBP_Hair_Maelle_Ponytail_V3_Metahumansk::FAnimBlueprintGeneratedConstantData, AnimGraphNode_KawaiiPhysics) == 0x000618, "Member 'APPBP_Hair_Maelle_Ponytail_V3_Metahumansk::FAnimBlueprintGeneratedConstantData::AnimGraphNode_KawaiiPhysics' has a wrong offset!");

}

