#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BlueWhale_Reference_AnimBP

#include "Basic.hpp"

#include "BlueWhale_Reference_AnimBP_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass BlueWhale_Reference_AnimBP.BlueWhale_Reference_AnimBP_C
// 0x02C0 (0x0630 - 0x0370)
class UBlueWhale_Reference_AnimBP_C final : public UAnimInstance
{
public:
	uint8                                         Pad_368[0x8];                                      // 0x0368(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0370(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct BlueWhale_Reference_AnimBP::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;   // 0x0378(0x0010)(HasGetValueTypeHash)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0388(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0390(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0398(0x0020)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend;                    // 0x03B8(0x00F0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x04A8(0x0048)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer;                    // 0x04F0(0x0070)()
	double                                        Mouth;                                             // 0x0560(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Swim_Anim_Play_Rate;                               // 0x0568(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Animation_Blendspace;                              // 0x0570(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        StartPosition;                                     // 0x0578(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               Chest_0_Rotation;                                  // 0x0580(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FRotator                               Tail_0_Rotation;                                   // 0x0598(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FRotator                               Tail_1_Rotation;                                   // 0x05B0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FRotator                               Tail_2_Rotation;                                   // 0x05C8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FRotator                               Tail_3_Rotation;                                   // 0x05E0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FRotator                               Head_Rotation;                                     // 0x05F8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FRotator                               Tail_4_Rotation;                                   // 0x0610(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BlueWhale_Reference_AnimBP(int32 EntryPoint);
	void AnimGraph(struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BlueWhale_Reference_AnimBP_C">();
	}
	static class UBlueWhale_Reference_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBlueWhale_Reference_AnimBP_C>();
	}
};
static_assert(alignof(UBlueWhale_Reference_AnimBP_C) == 0x000010, "Wrong alignment on UBlueWhale_Reference_AnimBP_C");
static_assert(sizeof(UBlueWhale_Reference_AnimBP_C) == 0x000630, "Wrong size on UBlueWhale_Reference_AnimBP_C");
static_assert(offsetof(UBlueWhale_Reference_AnimBP_C, UberGraphFrame) == 0x000370, "Member 'UBlueWhale_Reference_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBlueWhale_Reference_AnimBP_C, __AnimBlueprintMutables) == 0x000378, "Member 'UBlueWhale_Reference_AnimBP_C::__AnimBlueprintMutables' has a wrong offset!");
static_assert(offsetof(UBlueWhale_Reference_AnimBP_C, AnimBlueprintExtension_PropertyAccess) == 0x000388, "Member 'UBlueWhale_Reference_AnimBP_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UBlueWhale_Reference_AnimBP_C, AnimBlueprintExtension_Base) == 0x000390, "Member 'UBlueWhale_Reference_AnimBP_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UBlueWhale_Reference_AnimBP_C, AnimGraphNode_Root) == 0x000398, "Member 'UBlueWhale_Reference_AnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UBlueWhale_Reference_AnimBP_C, AnimGraphNode_LayeredBoneBlend) == 0x0003B8, "Member 'UBlueWhale_Reference_AnimBP_C::AnimGraphNode_LayeredBoneBlend' has a wrong offset!");
static_assert(offsetof(UBlueWhale_Reference_AnimBP_C, AnimGraphNode_SequencePlayer) == 0x0004A8, "Member 'UBlueWhale_Reference_AnimBP_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UBlueWhale_Reference_AnimBP_C, AnimGraphNode_BlendSpacePlayer) == 0x0004F0, "Member 'UBlueWhale_Reference_AnimBP_C::AnimGraphNode_BlendSpacePlayer' has a wrong offset!");
static_assert(offsetof(UBlueWhale_Reference_AnimBP_C, Mouth) == 0x000560, "Member 'UBlueWhale_Reference_AnimBP_C::Mouth' has a wrong offset!");
static_assert(offsetof(UBlueWhale_Reference_AnimBP_C, Swim_Anim_Play_Rate) == 0x000568, "Member 'UBlueWhale_Reference_AnimBP_C::Swim_Anim_Play_Rate' has a wrong offset!");
static_assert(offsetof(UBlueWhale_Reference_AnimBP_C, Animation_Blendspace) == 0x000570, "Member 'UBlueWhale_Reference_AnimBP_C::Animation_Blendspace' has a wrong offset!");
static_assert(offsetof(UBlueWhale_Reference_AnimBP_C, StartPosition) == 0x000578, "Member 'UBlueWhale_Reference_AnimBP_C::StartPosition' has a wrong offset!");
static_assert(offsetof(UBlueWhale_Reference_AnimBP_C, Chest_0_Rotation) == 0x000580, "Member 'UBlueWhale_Reference_AnimBP_C::Chest_0_Rotation' has a wrong offset!");
static_assert(offsetof(UBlueWhale_Reference_AnimBP_C, Tail_0_Rotation) == 0x000598, "Member 'UBlueWhale_Reference_AnimBP_C::Tail_0_Rotation' has a wrong offset!");
static_assert(offsetof(UBlueWhale_Reference_AnimBP_C, Tail_1_Rotation) == 0x0005B0, "Member 'UBlueWhale_Reference_AnimBP_C::Tail_1_Rotation' has a wrong offset!");
static_assert(offsetof(UBlueWhale_Reference_AnimBP_C, Tail_2_Rotation) == 0x0005C8, "Member 'UBlueWhale_Reference_AnimBP_C::Tail_2_Rotation' has a wrong offset!");
static_assert(offsetof(UBlueWhale_Reference_AnimBP_C, Tail_3_Rotation) == 0x0005E0, "Member 'UBlueWhale_Reference_AnimBP_C::Tail_3_Rotation' has a wrong offset!");
static_assert(offsetof(UBlueWhale_Reference_AnimBP_C, Head_Rotation) == 0x0005F8, "Member 'UBlueWhale_Reference_AnimBP_C::Head_Rotation' has a wrong offset!");
static_assert(offsetof(UBlueWhale_Reference_AnimBP_C, Tail_4_Rotation) == 0x000610, "Member 'UBlueWhale_Reference_AnimBP_C::Tail_4_Rotation' has a wrong offset!");

}

