#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Bow_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "Bow_AnimBP_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass Bow_AnimBP.Bow_AnimBP_C
// 0x0090 (0x0400 - 0x0370)
class UBow_AnimBP_C final : public UAnimInstance
{
public:
	uint8                                         Pad_368[0x8];                                      // 0x0368(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0370(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct Bow_AnimBP::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;                   // 0x0378(0x0008)(HasGetValueTypeHash)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0380(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0388(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0390(0x0020)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator;                   // 0x03B0(0x0040)()
	double                                        Draw;                                              // 0x03F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void ExecuteUbergraph_Bow_AnimBP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Bow_AnimBP_C">();
	}
	static class UBow_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBow_AnimBP_C>();
	}
};
static_assert(alignof(UBow_AnimBP_C) == 0x000010, "Wrong alignment on UBow_AnimBP_C");
static_assert(sizeof(UBow_AnimBP_C) == 0x000400, "Wrong size on UBow_AnimBP_C");
static_assert(offsetof(UBow_AnimBP_C, UberGraphFrame) == 0x000370, "Member 'UBow_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBow_AnimBP_C, __AnimBlueprintMutables) == 0x000378, "Member 'UBow_AnimBP_C::__AnimBlueprintMutables' has a wrong offset!");
static_assert(offsetof(UBow_AnimBP_C, AnimBlueprintExtension_PropertyAccess) == 0x000380, "Member 'UBow_AnimBP_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UBow_AnimBP_C, AnimBlueprintExtension_Base) == 0x000388, "Member 'UBow_AnimBP_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UBow_AnimBP_C, AnimGraphNode_Root) == 0x000390, "Member 'UBow_AnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UBow_AnimBP_C, AnimGraphNode_SequenceEvaluator) == 0x0003B0, "Member 'UBow_AnimBP_C::AnimGraphNode_SequenceEvaluator' has a wrong offset!");
static_assert(offsetof(UBow_AnimBP_C, Draw) == 0x0003F0, "Member 'UBow_AnimBP_C::Draw' has a wrong offset!");

}

