#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Bow_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct Bow_AnimBP.Bow_AnimBP_C.AnimBlueprintGeneratedConstantData
// 0x014F (0x0150 - 0x0001)
struct Bow_AnimBP::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_7;                                  // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_8;                                // 0x0010(0x0020)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_9;                                 // 0x0030(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESequenceEvalReinit                           __ByteProperty_10;                                 // 0x0034(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_11;                                 // 0x0035(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36[0x2];                                       // 0x0036(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         __IntProperty_12;                                  // 0x0038(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      __AnimSequenceBase_13;                             // 0x0040(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          __BoolProperty_14;                                 // 0x0048(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_15;                                 // 0x0049(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_16;                                 // 0x004A(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B[0x1];                                       // 0x004B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_17;                                 // 0x004C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0058(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x00D8(0x0018)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root;                           // 0x00F0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequenceEvaluator;              // 0x0120(0x0030)()
};
static_assert(alignof(Bow_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on Bow_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(Bow_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x000150, "Wrong size on Bow_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(Bow_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_7) == 0x000004, "Member 'Bow_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_7' has a wrong offset!");
static_assert(offsetof(Bow_AnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_8) == 0x000010, "Member 'Bow_AnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_8' has a wrong offset!");
static_assert(offsetof(Bow_AnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_9) == 0x000030, "Member 'Bow_AnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_9' has a wrong offset!");
static_assert(offsetof(Bow_AnimBP::FAnimBlueprintGeneratedConstantData, __ByteProperty_10) == 0x000034, "Member 'Bow_AnimBP::FAnimBlueprintGeneratedConstantData::__ByteProperty_10' has a wrong offset!");
static_assert(offsetof(Bow_AnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_11) == 0x000035, "Member 'Bow_AnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_11' has a wrong offset!");
static_assert(offsetof(Bow_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_12) == 0x000038, "Member 'Bow_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_12' has a wrong offset!");
static_assert(offsetof(Bow_AnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_13) == 0x000040, "Member 'Bow_AnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_13' has a wrong offset!");
static_assert(offsetof(Bow_AnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_14) == 0x000048, "Member 'Bow_AnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_14' has a wrong offset!");
static_assert(offsetof(Bow_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_15) == 0x000049, "Member 'Bow_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_15' has a wrong offset!");
static_assert(offsetof(Bow_AnimBP::FAnimBlueprintGeneratedConstantData, __ByteProperty_16) == 0x00004A, "Member 'Bow_AnimBP::FAnimBlueprintGeneratedConstantData::__ByteProperty_16' has a wrong offset!");
static_assert(offsetof(Bow_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_17) == 0x00004C, "Member 'Bow_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_17' has a wrong offset!");
static_assert(offsetof(Bow_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000058, "Member 'Bow_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(Bow_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x0000D8, "Member 'Bow_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(Bow_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root) == 0x0000F0, "Member 'Bow_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(Bow_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequenceEvaluator) == 0x000120, "Member 'Bow_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequenceEvaluator' has a wrong offset!");

// ScriptStruct Bow_AnimBP.Bow_AnimBP_C.AnimBlueprintGeneratedMutableData
// 0x0007 (0x0008 - 0x0001)
struct Bow_AnimBP::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty;                                   // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Bow_AnimBP::FAnimBlueprintGeneratedMutableData) == 0x000004, "Wrong alignment on Bow_AnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(Bow_AnimBP::FAnimBlueprintGeneratedMutableData) == 0x000008, "Wrong size on Bow_AnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(Bow_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty) == 0x000004, "Member 'Bow_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty' has a wrong offset!");

}

