#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AudioCharacter_BattleManager

#include "Basic.hpp"

#include "S_BattleLine_structs.hpp"
#include "EUiBattleType_structs.hpp"
#include "ECharacterTeamSelector_structs.hpp"
#include "SandFall_structs.hpp"
#include "Engine_structs.hpp"
#include "EOnoType_structs.hpp"
#include "S_BattleHitSoundOverrideHandle_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "EBattleHitBy_structs.hpp"
#include "EBattleCommonSFX_structs.hpp"
#include "PhysicsCore_structs.hpp"
#include "EFootstepsType_structs.hpp"


namespace SDK::Params
{

// Function BP_AudioCharacter_BattleManager.BP_AudioCharacter_BattleManager_C.PlayEventBattleLine
// 0x00A8 (0x00A8 - 0x0000)
struct BP_AudioCharacter_BattleManager_C_PlayEventBattleLine final
{
public:
	struct FS_BattleLine                          BattleLine;                                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	class UAC_jRPG_BattleManager_C*               CallFunc_GetBattleManager_ReturnValue;             // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanPlayReactionBattleLines_ReturnValue;   // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_ObjectToText_ReturnValue;            // 0x0020(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0030(0x0048)(HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSound2D_ReturnValue;                 // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0080(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Format_ReturnValue;                       // 0x0090(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasActiveSkillBattleLine_Active;          // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AudioCharacter_BattleManager_C_PlayEventBattleLine) == 0x000008, "Wrong alignment on BP_AudioCharacter_BattleManager_C_PlayEventBattleLine");
static_assert(sizeof(BP_AudioCharacter_BattleManager_C_PlayEventBattleLine) == 0x0000A8, "Wrong size on BP_AudioCharacter_BattleManager_C_PlayEventBattleLine");
static_assert(offsetof(BP_AudioCharacter_BattleManager_C_PlayEventBattleLine, BattleLine) == 0x000000, "Member 'BP_AudioCharacter_BattleManager_C_PlayEventBattleLine::BattleLine' has a wrong offset!");
static_assert(offsetof(BP_AudioCharacter_BattleManager_C_PlayEventBattleLine, CallFunc_GetBattleManager_ReturnValue) == 0x000010, "Member 'BP_AudioCharacter_BattleManager_C_PlayEventBattleLine::CallFunc_GetBattleManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AudioCharacter_BattleManager_C_PlayEventBattleLine, CallFunc_CanPlayReactionBattleLines_ReturnValue) == 0x000018, "Member 'BP_AudioCharacter_BattleManager_C_PlayEventBattleLine::CallFunc_CanPlayReactionBattleLines_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AudioCharacter_BattleManager_C_PlayEventBattleLine, CallFunc_Conv_ObjectToText_ReturnValue) == 0x000020, "Member 'BP_AudioCharacter_BattleManager_C_PlayEventBattleLine::CallFunc_Conv_ObjectToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AudioCharacter_BattleManager_C_PlayEventBattleLine, K2Node_MakeStruct_FormatArgumentData) == 0x000030, "Member 'BP_AudioCharacter_BattleManager_C_PlayEventBattleLine::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_AudioCharacter_BattleManager_C_PlayEventBattleLine, CallFunc_SpawnSound2D_ReturnValue) == 0x000078, "Member 'BP_AudioCharacter_BattleManager_C_PlayEventBattleLine::CallFunc_SpawnSound2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AudioCharacter_BattleManager_C_PlayEventBattleLine, K2Node_MakeArray_Array) == 0x000080, "Member 'BP_AudioCharacter_BattleManager_C_PlayEventBattleLine::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_AudioCharacter_BattleManager_C_PlayEventBattleLine, CallFunc_Format_ReturnValue) == 0x000090, "Member 'BP_AudioCharacter_BattleManager_C_PlayEventBattleLine::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AudioCharacter_BattleManager_C_PlayEventBattleLine, CallFunc_HasActiveSkillBattleLine_Active) == 0x0000A0, "Member 'BP_AudioCharacter_BattleManager_C_PlayEventBattleLine::CallFunc_HasActiveSkillBattleLine_Active' has a wrong offset!");
static_assert(offsetof(BP_AudioCharacter_BattleManager_C_PlayEventBattleLine, CallFunc_Not_PreBool_ReturnValue) == 0x0000A1, "Member 'BP_AudioCharacter_BattleManager_C_PlayEventBattleLine::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function BP_AudioCharacter_BattleManager.BP_AudioCharacter_BattleManager_C.OnDamageReceived
// 0x0028 (0x0028 - 0x0000)
struct BP_AudioCharacter_BattleManager_C_OnDamageReceived final
{
public:
	class UBP_BattleDamages_C*                    BattleDamage;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAC_jRPG_CharacterBattleStats_C*        CallFunc_GetTargetCharacter_NewParam;              // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ECharacterTeamSelector                        CallFunc_GetTeam_Team;                             // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_jRPG_Character_Battle_Base_C*> CallFunc_GetAllCharactersFromTeam_Characters;    // 0x0018(0x0010)(ReferenceParm)
};
static_assert(alignof(BP_AudioCharacter_BattleManager_C_OnDamageReceived) == 0x000008, "Wrong alignment on BP_AudioCharacter_BattleManager_C_OnDamageReceived");
static_assert(sizeof(BP_AudioCharacter_BattleManager_C_OnDamageReceived) == 0x000028, "Wrong size on BP_AudioCharacter_BattleManager_C_OnDamageReceived");
static_assert(offsetof(BP_AudioCharacter_BattleManager_C_OnDamageReceived, BattleDamage) == 0x000000, "Member 'BP_AudioCharacter_BattleManager_C_OnDamageReceived::BattleDamage' has a wrong offset!");
static_assert(offsetof(BP_AudioCharacter_BattleManager_C_OnDamageReceived, CallFunc_GetTargetCharacter_NewParam) == 0x000008, "Member 'BP_AudioCharacter_BattleManager_C_OnDamageReceived::CallFunc_GetTargetCharacter_NewParam' has a wrong offset!");
static_assert(offsetof(BP_AudioCharacter_BattleManager_C_OnDamageReceived, CallFunc_GetTeam_Team) == 0x000010, "Member 'BP_AudioCharacter_BattleManager_C_OnDamageReceived::CallFunc_GetTeam_Team' has a wrong offset!");
static_assert(offsetof(BP_AudioCharacter_BattleManager_C_OnDamageReceived, CallFunc_GetAllCharactersFromTeam_Characters) == 0x000018, "Member 'BP_AudioCharacter_BattleManager_C_OnDamageReceived::CallFunc_GetAllCharactersFromTeam_Characters' has a wrong offset!");

// Function BP_AudioCharacter_BattleManager.BP_AudioCharacter_BattleManager_C.PlayDialogueBattleLineInternal
// 0x0010 (0x0010 - 0x0000)
struct BP_AudioCharacter_BattleManager_C_PlayDialogueBattleLineInternal final
{
public:
	class USoundBase*                             SoundAsset;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSound2D_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AudioCharacter_BattleManager_C_PlayDialogueBattleLineInternal) == 0x000008, "Wrong alignment on BP_AudioCharacter_BattleManager_C_PlayDialogueBattleLineInternal");
static_assert(sizeof(BP_AudioCharacter_BattleManager_C_PlayDialogueBattleLineInternal) == 0x000010, "Wrong size on BP_AudioCharacter_BattleManager_C_PlayDialogueBattleLineInternal");
static_assert(offsetof(BP_AudioCharacter_BattleManager_C_PlayDialogueBattleLineInternal, SoundAsset) == 0x000000, "Member 'BP_AudioCharacter_BattleManager_C_PlayDialogueBattleLineInternal::SoundAsset' has a wrong offset!");
static_assert(offsetof(BP_AudioCharacter_BattleManager_C_PlayDialogueBattleLineInternal, CallFunc_SpawnSound2D_ReturnValue) == 0x000008, "Member 'BP_AudioCharacter_BattleManager_C_PlayDialogueBattleLineInternal::CallFunc_SpawnSound2D_ReturnValue' has a wrong offset!");

// Function BP_AudioCharacter_BattleManager.BP_AudioCharacter_BattleManager_C.GetBattleLineModel
// 0x0008 (0x0008 - 0x0000)
struct BP_AudioCharacter_BattleManager_C_GetBattleLineModel final
{
public:
	class UBP_BattleLinesModel_Base_C*            ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AudioCharacter_BattleManager_C_GetBattleLineModel) == 0x000008, "Wrong alignment on BP_AudioCharacter_BattleManager_C_GetBattleLineModel");
static_assert(sizeof(BP_AudioCharacter_BattleManager_C_GetBattleLineModel) == 0x000008, "Wrong size on BP_AudioCharacter_BattleManager_C_GetBattleLineModel");
static_assert(offsetof(BP_AudioCharacter_BattleManager_C_GetBattleLineModel, ReturnValue) == 0x000000, "Member 'BP_AudioCharacter_BattleManager_C_GetBattleLineModel::ReturnValue' has a wrong offset!");

// Function BP_AudioCharacter_BattleManager.BP_AudioCharacter_BattleManager_C.TryInterruptActiveSkillBattleLine
// 0x0002 (0x0002 - 0x0000)
struct BP_AudioCharacter_BattleManager_C_TryInterruptActiveSkillBattleLine final
{
public:
	bool                                          HasInterrupted;                                    // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasActiveSkillBattleLine_Active;          // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AudioCharacter_BattleManager_C_TryInterruptActiveSkillBattleLine) == 0x000001, "Wrong alignment on BP_AudioCharacter_BattleManager_C_TryInterruptActiveSkillBattleLine");
static_assert(sizeof(BP_AudioCharacter_BattleManager_C_TryInterruptActiveSkillBattleLine) == 0x000002, "Wrong size on BP_AudioCharacter_BattleManager_C_TryInterruptActiveSkillBattleLine");
static_assert(offsetof(BP_AudioCharacter_BattleManager_C_TryInterruptActiveSkillBattleLine, HasInterrupted) == 0x000000, "Member 'BP_AudioCharacter_BattleManager_C_TryInterruptActiveSkillBattleLine::HasInterrupted' has a wrong offset!");
static_assert(offsetof(BP_AudioCharacter_BattleManager_C_TryInterruptActiveSkillBattleLine, CallFunc_HasActiveSkillBattleLine_Active) == 0x000001, "Member 'BP_AudioCharacter_BattleManager_C_TryInterruptActiveSkillBattleLine::CallFunc_HasActiveSkillBattleLine_Active' has a wrong offset!");

// Function BP_AudioCharacter_BattleManager.BP_AudioCharacter_BattleManager_C.HasActiveSkillBattleLine
// 0x0003 (0x0003 - 0x0000)
struct BP_AudioCharacter_BattleManager_C_HasActiveSkillBattleLine final
{
public:
	bool                                          Active;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlaying_ReturnValue;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AudioCharacter_BattleManager_C_HasActiveSkillBattleLine) == 0x000001, "Wrong alignment on BP_AudioCharacter_BattleManager_C_HasActiveSkillBattleLine");
static_assert(sizeof(BP_AudioCharacter_BattleManager_C_HasActiveSkillBattleLine) == 0x000003, "Wrong size on BP_AudioCharacter_BattleManager_C_HasActiveSkillBattleLine");
static_assert(offsetof(BP_AudioCharacter_BattleManager_C_HasActiveSkillBattleLine, Active) == 0x000000, "Member 'BP_AudioCharacter_BattleManager_C_HasActiveSkillBattleLine::Active' has a wrong offset!");
static_assert(offsetof(BP_AudioCharacter_BattleManager_C_HasActiveSkillBattleLine, CallFunc_IsPlaying_ReturnValue) == 0x000001, "Member 'BP_AudioCharacter_BattleManager_C_HasActiveSkillBattleLine::CallFunc_IsPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AudioCharacter_BattleManager_C_HasActiveSkillBattleLine, CallFunc_IsValid_ReturnValue) == 0x000002, "Member 'BP_AudioCharacter_BattleManager_C_HasActiveSkillBattleLine::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_AudioCharacter_BattleManager.BP_AudioCharacter_BattleManager_C.PlaySkillBattleLineInternal
// 0x0010 (0x0010 - 0x0000)
struct BP_AudioCharacter_BattleManager_C_PlaySkillBattleLineInternal final
{
public:
	class USoundBase*                             SoundAsset;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSound2D_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AudioCharacter_BattleManager_C_PlaySkillBattleLineInternal) == 0x000008, "Wrong alignment on BP_AudioCharacter_BattleManager_C_PlaySkillBattleLineInternal");
static_assert(sizeof(BP_AudioCharacter_BattleManager_C_PlaySkillBattleLineInternal) == 0x000010, "Wrong size on BP_AudioCharacter_BattleManager_C_PlaySkillBattleLineInternal");
static_assert(offsetof(BP_AudioCharacter_BattleManager_C_PlaySkillBattleLineInternal, SoundAsset) == 0x000000, "Member 'BP_AudioCharacter_BattleManager_C_PlaySkillBattleLineInternal::SoundAsset' has a wrong offset!");
static_assert(offsetof(BP_AudioCharacter_BattleManager_C_PlaySkillBattleLineInternal, CallFunc_SpawnSound2D_ReturnValue) == 0x000008, "Member 'BP_AudioCharacter_BattleManager_C_PlaySkillBattleLineInternal::CallFunc_SpawnSound2D_ReturnValue' has a wrong offset!");

// Function BP_AudioCharacter_BattleManager.BP_AudioCharacter_BattleManager_C.StopAllSFXs
// 0x0020 (0x0020 - 0x0000)
struct BP_AudioCharacter_BattleManager_C_StopAllSFXs final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AudioCharacter_BattleManager_C_StopAllSFXs) == 0x000008, "Wrong alignment on BP_AudioCharacter_BattleManager_C_StopAllSFXs");
static_assert(sizeof(BP_AudioCharacter_BattleManager_C_StopAllSFXs) == 0x000020, "Wrong size on BP_AudioCharacter_BattleManager_C_StopAllSFXs");
static_assert(offsetof(BP_AudioCharacter_BattleManager_C_StopAllSFXs, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BP_AudioCharacter_BattleManager_C_StopAllSFXs::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_AudioCharacter_BattleManager_C_StopAllSFXs, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_AudioCharacter_BattleManager_C_StopAllSFXs::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_AudioCharacter_BattleManager_C_StopAllSFXs, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_AudioCharacter_BattleManager_C_StopAllSFXs::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AudioCharacter_BattleManager_C_StopAllSFXs, CallFunc_Array_Get_Item) == 0x000010, "Member 'BP_AudioCharacter_BattleManager_C_StopAllSFXs::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_AudioCharacter_BattleManager_C_StopAllSFXs, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'BP_AudioCharacter_BattleManager_C_StopAllSFXs::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AudioCharacter_BattleManager_C_StopAllSFXs, CallFunc_IsValid_ReturnValue) == 0x00001C, "Member 'BP_AudioCharacter_BattleManager_C_StopAllSFXs::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AudioCharacter_BattleManager_C_StopAllSFXs, CallFunc_Less_IntInt_ReturnValue) == 0x00001D, "Member 'BP_AudioCharacter_BattleManager_C_StopAllSFXs::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function BP_AudioCharacter_BattleManager.BP_AudioCharacter_BattleManager_C.ProcessTaggedGameplayEvent
// 0x0080 (0x0080 - 0x0000)
struct BP_AudioCharacter_BattleManager_C_ProcessTaggedGameplayEvent final
{
public:
	struct FTaggedGameplayEvent                   Event;                                             // 0x0000(0x0080)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(BP_AudioCharacter_BattleManager_C_ProcessTaggedGameplayEvent) == 0x000008, "Wrong alignment on BP_AudioCharacter_BattleManager_C_ProcessTaggedGameplayEvent");
static_assert(sizeof(BP_AudioCharacter_BattleManager_C_ProcessTaggedGameplayEvent) == 0x000080, "Wrong size on BP_AudioCharacter_BattleManager_C_ProcessTaggedGameplayEvent");
static_assert(offsetof(BP_AudioCharacter_BattleManager_C_ProcessTaggedGameplayEvent, Event) == 0x000000, "Member 'BP_AudioCharacter_BattleManager_C_ProcessTaggedGameplayEvent::Event' has a wrong offset!");

// Function BP_AudioCharacter_BattleManager.BP_AudioCharacter_BattleManager_C.RemoveHitOverride
// 0x00B8 (0x00B8 - 0x0000)
struct BP_AudioCharacter_BattleManager_C_RemoveHitOverride final
{
public:
	struct FS_BattleHitSoundOverrideHandle        OutHitOverrideHandle;                              // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	struct FS_BattleHitSoundOverrideHandle        K2Node_MakeStruct_S_BattleHitSoundOverrideHandle;  // 0x0018(0x0018)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_ObjectToText_ReturnValue;            // 0x0030(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0040(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0088(0x0010)(ReferenceParm)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Format_ReturnValue;                       // 0x00A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AudioCharacter_BattleManager_C_RemoveHitOverride) == 0x000008, "Wrong alignment on BP_AudioCharacter_BattleManager_C_RemoveHitOverride");
static_assert(sizeof(BP_AudioCharacter_BattleManager_C_RemoveHitOverride) == 0x0000B8, "Wrong size on BP_AudioCharacter_BattleManager_C_RemoveHitOverride");
static_assert(offsetof(BP_AudioCharacter_BattleManager_C_RemoveHitOverride, OutHitOverrideHandle) == 0x000000, "Member 'BP_AudioCharacter_BattleManager_C_RemoveHitOverride::OutHitOverrideHandle' has a wrong offset!");
static_assert(offsetof(BP_AudioCharacter_BattleManager_C_RemoveHitOverride, K2Node_MakeStruct_S_BattleHitSoundOverrideHandle) == 0x000018, "Member 'BP_AudioCharacter_BattleManager_C_RemoveHitOverride::K2Node_MakeStruct_S_BattleHitSoundOverrideHandle' has a wrong offset!");
static_assert(offsetof(BP_AudioCharacter_BattleManager_C_RemoveHitOverride, CallFunc_Conv_ObjectToText_ReturnValue) == 0x000030, "Member 'BP_AudioCharacter_BattleManager_C_RemoveHitOverride::CallFunc_Conv_ObjectToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AudioCharacter_BattleManager_C_RemoveHitOverride, K2Node_MakeStruct_FormatArgumentData) == 0x000040, "Member 'BP_AudioCharacter_BattleManager_C_RemoveHitOverride::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_AudioCharacter_BattleManager_C_RemoveHitOverride, K2Node_MakeArray_Array) == 0x000088, "Member 'BP_AudioCharacter_BattleManager_C_RemoveHitOverride::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_AudioCharacter_BattleManager_C_RemoveHitOverride, CallFunc_Array_RemoveItem_ReturnValue) == 0x000098, "Member 'BP_AudioCharacter_BattleManager_C_RemoveHitOverride::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AudioCharacter_BattleManager_C_RemoveHitOverride, CallFunc_Format_ReturnValue) == 0x0000A0, "Member 'BP_AudioCharacter_BattleManager_C_RemoveHitOverride::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AudioCharacter_BattleManager_C_RemoveHitOverride, CallFunc_Not_PreBool_ReturnValue) == 0x0000B0, "Member 'BP_AudioCharacter_BattleManager_C_RemoveHitOverride::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function BP_AudioCharacter_BattleManager.BP_AudioCharacter_BattleManager_C.PlayHitSoundFromDamageObject
// 0x0018 (0x0018 - 0x0000)
struct BP_AudioCharacter_BattleManager_C_PlayHitSoundFromDamageObject final
{
public:
	class UBP_BattleDamages_C*                    BattleDamages;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             CallFunc_ResolveHitSound_Sound;                    // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AudioCharacter_BattleManager_C_PlayHitSoundFromDamageObject) == 0x000008, "Wrong alignment on BP_AudioCharacter_BattleManager_C_PlayHitSoundFromDamageObject");
static_assert(sizeof(BP_AudioCharacter_BattleManager_C_PlayHitSoundFromDamageObject) == 0x000018, "Wrong size on BP_AudioCharacter_BattleManager_C_PlayHitSoundFromDamageObject");
static_assert(offsetof(BP_AudioCharacter_BattleManager_C_PlayHitSoundFromDamageObject, BattleDamages) == 0x000000, "Member 'BP_AudioCharacter_BattleManager_C_PlayHitSoundFromDamageObject::BattleDamages' has a wrong offset!");
static_assert(offsetof(BP_AudioCharacter_BattleManager_C_PlayHitSoundFromDamageObject, CallFunc_ResolveHitSound_Sound) == 0x000008, "Member 'BP_AudioCharacter_BattleManager_C_PlayHitSoundFromDamageObject::CallFunc_ResolveHitSound_Sound' has a wrong offset!");
static_assert(offsetof(BP_AudioCharacter_BattleManager_C_PlayHitSoundFromDamageObject, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'BP_AudioCharacter_BattleManager_C_PlayHitSoundFromDamageObject::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_AudioCharacter_BattleManager.BP_AudioCharacter_BattleManager_C.PushHitOverride
// 0x0180 (0x0180 - 0x0000)
struct BP_AudioCharacter_BattleManager_C_PushHitOverride final
{
public:
	class UBP_DataAsset_BattleHitSound_C*         HitSoundAsset;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FS_BattleHitSoundOverrideHandle        OutHitOverrideHandle;                              // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	struct FS_BattleHitSoundOverrideHandle        local_pushedElement;                               // 0x0020(0x0018)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_ObjectToText_ReturnValue;            // 0x0038(0x0010)()
	bool                                          CallFunc_IsValid_Guid_ReturnValue;                 // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0050(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0098(0x0010)(ReferenceParm)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Format_ReturnValue;                       // 0x00B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetGameContentAssetFromCallStackDebugString_DebugString; // 0x00C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FGuid                                  CallFunc_NewGuid_ReturnValue;                      // 0x00D8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x00E8(0x0010)()
	struct FS_BattleHitSoundOverrideHandle        K2Node_MakeStruct_S_BattleHitSoundOverrideHandle;  // 0x00F8(0x0018)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0110(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0158(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Format_ReturnValue_1;                     // 0x0168(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AudioCharacter_BattleManager_C_PushHitOverride) == 0x000008, "Wrong alignment on BP_AudioCharacter_BattleManager_C_PushHitOverride");
static_assert(sizeof(BP_AudioCharacter_BattleManager_C_PushHitOverride) == 0x000180, "Wrong size on BP_AudioCharacter_BattleManager_C_PushHitOverride");
static_assert(offsetof(BP_AudioCharacter_BattleManager_C_PushHitOverride, HitSoundAsset) == 0x000000, "Member 'BP_AudioCharacter_BattleManager_C_PushHitOverride::HitSoundAsset' has a wrong offset!");
static_assert(offsetof(BP_AudioCharacter_BattleManager_C_PushHitOverride, OutHitOverrideHandle) == 0x000008, "Member 'BP_AudioCharacter_BattleManager_C_PushHitOverride::OutHitOverrideHandle' has a wrong offset!");
static_assert(offsetof(BP_AudioCharacter_BattleManager_C_PushHitOverride, local_pushedElement) == 0x000020, "Member 'BP_AudioCharacter_BattleManager_C_PushHitOverride::local_pushedElement' has a wrong offset!");
static_assert(offsetof(BP_AudioCharacter_BattleManager_C_PushHitOverride, CallFunc_Conv_ObjectToText_ReturnValue) == 0x000038, "Member 'BP_AudioCharacter_BattleManager_C_PushHitOverride::CallFunc_Conv_ObjectToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AudioCharacter_BattleManager_C_PushHitOverride, CallFunc_IsValid_Guid_ReturnValue) == 0x000048, "Member 'BP_AudioCharacter_BattleManager_C_PushHitOverride::CallFunc_IsValid_Guid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AudioCharacter_BattleManager_C_PushHitOverride, K2Node_MakeStruct_FormatArgumentData) == 0x000050, "Member 'BP_AudioCharacter_BattleManager_C_PushHitOverride::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_AudioCharacter_BattleManager_C_PushHitOverride, K2Node_MakeArray_Array) == 0x000098, "Member 'BP_AudioCharacter_BattleManager_C_PushHitOverride::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_AudioCharacter_BattleManager_C_PushHitOverride, CallFunc_IsValid_ReturnValue) == 0x0000A8, "Member 'BP_AudioCharacter_BattleManager_C_PushHitOverride::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AudioCharacter_BattleManager_C_PushHitOverride, CallFunc_Format_ReturnValue) == 0x0000B0, "Member 'BP_AudioCharacter_BattleManager_C_PushHitOverride::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AudioCharacter_BattleManager_C_PushHitOverride, CallFunc_Not_PreBool_ReturnValue) == 0x0000C0, "Member 'BP_AudioCharacter_BattleManager_C_PushHitOverride::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AudioCharacter_BattleManager_C_PushHitOverride, CallFunc_GetGameContentAssetFromCallStackDebugString_DebugString) == 0x0000C8, "Member 'BP_AudioCharacter_BattleManager_C_PushHitOverride::CallFunc_GetGameContentAssetFromCallStackDebugString_DebugString' has a wrong offset!");
static_assert(offsetof(BP_AudioCharacter_BattleManager_C_PushHitOverride, CallFunc_NewGuid_ReturnValue) == 0x0000D8, "Member 'BP_AudioCharacter_BattleManager_C_PushHitOverride::CallFunc_NewGuid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AudioCharacter_BattleManager_C_PushHitOverride, CallFunc_Conv_StringToText_ReturnValue) == 0x0000E8, "Member 'BP_AudioCharacter_BattleManager_C_PushHitOverride::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AudioCharacter_BattleManager_C_PushHitOverride, K2Node_MakeStruct_S_BattleHitSoundOverrideHandle) == 0x0000F8, "Member 'BP_AudioCharacter_BattleManager_C_PushHitOverride::K2Node_MakeStruct_S_BattleHitSoundOverrideHandle' has a wrong offset!");
static_assert(offsetof(BP_AudioCharacter_BattleManager_C_PushHitOverride, K2Node_MakeStruct_FormatArgumentData_1) == 0x000110, "Member 'BP_AudioCharacter_BattleManager_C_PushHitOverride::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BP_AudioCharacter_BattleManager_C_PushHitOverride, K2Node_MakeArray_Array_1) == 0x000158, "Member 'BP_AudioCharacter_BattleManager_C_PushHitOverride::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BP_AudioCharacter_BattleManager_C_PushHitOverride, CallFunc_Format_ReturnValue_1) == 0x000168, "Member 'BP_AudioCharacter_BattleManager_C_PushHitOverride::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AudioCharacter_BattleManager_C_PushHitOverride, CallFunc_Array_Add_ReturnValue) == 0x000178, "Member 'BP_AudioCharacter_BattleManager_C_PushHitOverride::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function BP_AudioCharacter_BattleManager.BP_AudioCharacter_BattleManager_C.ResolveHitSound
// 0x0030 (0x0030 - 0x0000)
struct BP_AudioCharacter_BattleManager_C_ResolveHitSound final
{
public:
	class UBP_BattleDamages_C*                    BattleDamage;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Sound;                                             // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_DataAsset_BattleHitSound_C*         CallFunc_ResolveHitSoundAsset_HitSoundAsset;       // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             CallFunc_GetHitSoundOverride_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             CallFunc_GetSoundForDamage_Sound;                  // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AudioCharacter_BattleManager_C_ResolveHitSound) == 0x000008, "Wrong alignment on BP_AudioCharacter_BattleManager_C_ResolveHitSound");
static_assert(sizeof(BP_AudioCharacter_BattleManager_C_ResolveHitSound) == 0x000030, "Wrong size on BP_AudioCharacter_BattleManager_C_ResolveHitSound");
static_assert(offsetof(BP_AudioCharacter_BattleManager_C_ResolveHitSound, BattleDamage) == 0x000000, "Member 'BP_AudioCharacter_BattleManager_C_ResolveHitSound::BattleDamage' has a wrong offset!");
static_assert(offsetof(BP_AudioCharacter_BattleManager_C_ResolveHitSound, Sound) == 0x000008, "Member 'BP_AudioCharacter_BattleManager_C_ResolveHitSound::Sound' has a wrong offset!");
static_assert(offsetof(BP_AudioCharacter_BattleManager_C_ResolveHitSound, CallFunc_ResolveHitSoundAsset_HitSoundAsset) == 0x000010, "Member 'BP_AudioCharacter_BattleManager_C_ResolveHitSound::CallFunc_ResolveHitSoundAsset_HitSoundAsset' has a wrong offset!");
static_assert(offsetof(BP_AudioCharacter_BattleManager_C_ResolveHitSound, CallFunc_GetHitSoundOverride_ReturnValue) == 0x000018, "Member 'BP_AudioCharacter_BattleManager_C_ResolveHitSound::CallFunc_GetHitSoundOverride_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AudioCharacter_BattleManager_C_ResolveHitSound, CallFunc_GetSoundForDamage_Sound) == 0x000020, "Member 'BP_AudioCharacter_BattleManager_C_ResolveHitSound::CallFunc_GetSoundForDamage_Sound' has a wrong offset!");
static_assert(offsetof(BP_AudioCharacter_BattleManager_C_ResolveHitSound, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'BP_AudioCharacter_BattleManager_C_ResolveHitSound::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AudioCharacter_BattleManager_C_ResolveHitSound, CallFunc_IsValid_ReturnValue_1) == 0x000029, "Member 'BP_AudioCharacter_BattleManager_C_ResolveHitSound::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function BP_AudioCharacter_BattleManager.BP_AudioCharacter_BattleManager_C.ResolveHitSoundAsset
// 0x0048 (0x0048 - 0x0000)
struct BP_AudioCharacter_BattleManager_C_ResolveHitSoundAsset final
{
public:
	class UBP_BattleDamages_C*                    BattleDamage;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UBP_DataAsset_BattleHitSound_C*         HitSoundAsset;                                     // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_DataAsset_BattleHitSound_C*         local_HitSound;                                    // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_DataAsset_BattleHitSound_C*         CallFunc_GetCharacterBaseHitSound_DefaultHitSound; // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FS_BattleHitSoundOverrideHandle        CallFunc_Array_Get_Item;                           // 0x0028(0x0018)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AudioCharacter_BattleManager_C_ResolveHitSoundAsset) == 0x000008, "Wrong alignment on BP_AudioCharacter_BattleManager_C_ResolveHitSoundAsset");
static_assert(sizeof(BP_AudioCharacter_BattleManager_C_ResolveHitSoundAsset) == 0x000048, "Wrong size on BP_AudioCharacter_BattleManager_C_ResolveHitSoundAsset");
static_assert(offsetof(BP_AudioCharacter_BattleManager_C_ResolveHitSoundAsset, BattleDamage) == 0x000000, "Member 'BP_AudioCharacter_BattleManager_C_ResolveHitSoundAsset::BattleDamage' has a wrong offset!");
static_assert(offsetof(BP_AudioCharacter_BattleManager_C_ResolveHitSoundAsset, HitSoundAsset) == 0x000008, "Member 'BP_AudioCharacter_BattleManager_C_ResolveHitSoundAsset::HitSoundAsset' has a wrong offset!");
static_assert(offsetof(BP_AudioCharacter_BattleManager_C_ResolveHitSoundAsset, local_HitSound) == 0x000010, "Member 'BP_AudioCharacter_BattleManager_C_ResolveHitSoundAsset::local_HitSound' has a wrong offset!");
static_assert(offsetof(BP_AudioCharacter_BattleManager_C_ResolveHitSoundAsset, CallFunc_Array_LastIndex_ReturnValue) == 0x000018, "Member 'BP_AudioCharacter_BattleManager_C_ResolveHitSoundAsset::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AudioCharacter_BattleManager_C_ResolveHitSoundAsset, CallFunc_GetCharacterBaseHitSound_DefaultHitSound) == 0x000020, "Member 'BP_AudioCharacter_BattleManager_C_ResolveHitSoundAsset::CallFunc_GetCharacterBaseHitSound_DefaultHitSound' has a wrong offset!");
static_assert(offsetof(BP_AudioCharacter_BattleManager_C_ResolveHitSoundAsset, CallFunc_Array_Get_Item) == 0x000028, "Member 'BP_AudioCharacter_BattleManager_C_ResolveHitSoundAsset::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_AudioCharacter_BattleManager_C_ResolveHitSoundAsset, CallFunc_IsValid_ReturnValue) == 0x000040, "Member 'BP_AudioCharacter_BattleManager_C_ResolveHitSoundAsset::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AudioCharacter_BattleManager_C_ResolveHitSoundAsset, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000041, "Member 'BP_AudioCharacter_BattleManager_C_ResolveHitSoundAsset::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AudioCharacter_BattleManager_C_ResolveHitSoundAsset, CallFunc_IsValid_ReturnValue_1) == 0x000042, "Member 'BP_AudioCharacter_BattleManager_C_ResolveHitSoundAsset::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function BP_AudioCharacter_BattleManager.BP_AudioCharacter_BattleManager_C.Internal_PlayOnoFromData
// 0x0098 (0x0098 - 0x0000)
struct BP_AudioCharacter_BattleManager_C_Internal_PlayOnoFromData final
{
public:
	EOnoType                                      OnoType;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_BattleAudioCharacter_GetComponents_C> K2Node_DynamicCast_AsBPI_Battle_Audio_Character_Get_Components; // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_DataAsset_CharacterBattleAudioProfile_C* CallFunc_GetBattleAudioProfile_AudioProfile;  // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_jRPG_Character_Battle_Base_C*       K2Node_DynamicCast_AsBP_J_RPG_Character_Battle_Base; // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_GetBattleAudioContainerComponents_SFX;    // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_GetBattleAudioContainerComponents_Weapon_L; // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_GetBattleAudioContainerComponents_Weapon_R; // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_GetBattleAudioContainerComponents_Foley;  // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_GetBattleAudioContainerComponents_Vocal;  // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_GetBattleAudioContainerComponents_Foot_L; // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_GetBattleAudioContainerComponents_Foot_R; // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_GetBattleAudioContainerComponents_HitBy;  // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UMetaSoundSource*                       CallFunc_Map_Find_Value;                           // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue;           // 0x0090(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AudioCharacter_BattleManager_C_Internal_PlayOnoFromData) == 0x000008, "Wrong alignment on BP_AudioCharacter_BattleManager_C_Internal_PlayOnoFromData");
static_assert(sizeof(BP_AudioCharacter_BattleManager_C_Internal_PlayOnoFromData) == 0x000098, "Wrong size on BP_AudioCharacter_BattleManager_C_Internal_PlayOnoFromData");
static_assert(offsetof(BP_AudioCharacter_BattleManager_C_Internal_PlayOnoFromData, OnoType) == 0x000000, "Member 'BP_AudioCharacter_BattleManager_C_Internal_PlayOnoFromData::OnoType' has a wrong offset!");
static_assert(offsetof(BP_AudioCharacter_BattleManager_C_Internal_PlayOnoFromData, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'BP_AudioCharacter_BattleManager_C_Internal_PlayOnoFromData::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AudioCharacter_BattleManager_C_Internal_PlayOnoFromData, K2Node_DynamicCast_AsBPI_Battle_Audio_Character_Get_Components) == 0x000010, "Member 'BP_AudioCharacter_BattleManager_C_Internal_PlayOnoFromData::K2Node_DynamicCast_AsBPI_Battle_Audio_Character_Get_Components' has a wrong offset!");
static_assert(offsetof(BP_AudioCharacter_BattleManager_C_Internal_PlayOnoFromData, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_AudioCharacter_BattleManager_C_Internal_PlayOnoFromData::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AudioCharacter_BattleManager_C_Internal_PlayOnoFromData, CallFunc_GetBattleAudioProfile_AudioProfile) == 0x000028, "Member 'BP_AudioCharacter_BattleManager_C_Internal_PlayOnoFromData::CallFunc_GetBattleAudioProfile_AudioProfile' has a wrong offset!");
static_assert(offsetof(BP_AudioCharacter_BattleManager_C_Internal_PlayOnoFromData, K2Node_DynamicCast_AsBP_J_RPG_Character_Battle_Base) == 0x000030, "Member 'BP_AudioCharacter_BattleManager_C_Internal_PlayOnoFromData::K2Node_DynamicCast_AsBP_J_RPG_Character_Battle_Base' has a wrong offset!");
static_assert(offsetof(BP_AudioCharacter_BattleManager_C_Internal_PlayOnoFromData, K2Node_DynamicCast_bSuccess_1) == 0x000038, "Member 'BP_AudioCharacter_BattleManager_C_Internal_PlayOnoFromData::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_AudioCharacter_BattleManager_C_Internal_PlayOnoFromData, CallFunc_IsValid_ReturnValue) == 0x000039, "Member 'BP_AudioCharacter_BattleManager_C_Internal_PlayOnoFromData::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AudioCharacter_BattleManager_C_Internal_PlayOnoFromData, CallFunc_GetBattleAudioContainerComponents_SFX) == 0x000040, "Member 'BP_AudioCharacter_BattleManager_C_Internal_PlayOnoFromData::CallFunc_GetBattleAudioContainerComponents_SFX' has a wrong offset!");
static_assert(offsetof(BP_AudioCharacter_BattleManager_C_Internal_PlayOnoFromData, CallFunc_GetBattleAudioContainerComponents_Weapon_L) == 0x000048, "Member 'BP_AudioCharacter_BattleManager_C_Internal_PlayOnoFromData::CallFunc_GetBattleAudioContainerComponents_Weapon_L' has a wrong offset!");
static_assert(offsetof(BP_AudioCharacter_BattleManager_C_Internal_PlayOnoFromData, CallFunc_GetBattleAudioContainerComponents_Weapon_R) == 0x000050, "Member 'BP_AudioCharacter_BattleManager_C_Internal_PlayOnoFromData::CallFunc_GetBattleAudioContainerComponents_Weapon_R' has a wrong offset!");
static_assert(offsetof(BP_AudioCharacter_BattleManager_C_Internal_PlayOnoFromData, CallFunc_GetBattleAudioContainerComponents_Foley) == 0x000058, "Member 'BP_AudioCharacter_BattleManager_C_Internal_PlayOnoFromData::CallFunc_GetBattleAudioContainerComponents_Foley' has a wrong offset!");
static_assert(offsetof(BP_AudioCharacter_BattleManager_C_Internal_PlayOnoFromData, CallFunc_GetBattleAudioContainerComponents_Vocal) == 0x000060, "Member 'BP_AudioCharacter_BattleManager_C_Internal_PlayOnoFromData::CallFunc_GetBattleAudioContainerComponents_Vocal' has a wrong offset!");
static_assert(offsetof(BP_AudioCharacter_BattleManager_C_Internal_PlayOnoFromData, CallFunc_GetBattleAudioContainerComponents_Foot_L) == 0x000068, "Member 'BP_AudioCharacter_BattleManager_C_Internal_PlayOnoFromData::CallFunc_GetBattleAudioContainerComponents_Foot_L' has a wrong offset!");
static_assert(offsetof(BP_AudioCharacter_BattleManager_C_Internal_PlayOnoFromData, CallFunc_GetBattleAudioContainerComponents_Foot_R) == 0x000070, "Member 'BP_AudioCharacter_BattleManager_C_Internal_PlayOnoFromData::CallFunc_GetBattleAudioContainerComponents_Foot_R' has a wrong offset!");
static_assert(offsetof(BP_AudioCharacter_BattleManager_C_Internal_PlayOnoFromData, CallFunc_GetBattleAudioContainerComponents_HitBy) == 0x000078, "Member 'BP_AudioCharacter_BattleManager_C_Internal_PlayOnoFromData::CallFunc_GetBattleAudioContainerComponents_HitBy' has a wrong offset!");
static_assert(offsetof(BP_AudioCharacter_BattleManager_C_Internal_PlayOnoFromData, CallFunc_Map_Find_Value) == 0x000080, "Member 'BP_AudioCharacter_BattleManager_C_Internal_PlayOnoFromData::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BP_AudioCharacter_BattleManager_C_Internal_PlayOnoFromData, CallFunc_Map_Find_ReturnValue) == 0x000088, "Member 'BP_AudioCharacter_BattleManager_C_Internal_PlayOnoFromData::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AudioCharacter_BattleManager_C_Internal_PlayOnoFromData, CallFunc_SpawnSoundAttached_ReturnValue) == 0x000090, "Member 'BP_AudioCharacter_BattleManager_C_Internal_PlayOnoFromData::CallFunc_SpawnSoundAttached_ReturnValue' has a wrong offset!");

// Function BP_AudioCharacter_BattleManager.BP_AudioCharacter_BattleManager_C.Battle_PlaySeqOno
// 0x0001 (0x0001 - 0x0000)
struct BP_AudioCharacter_BattleManager_C_Battle_PlaySeqOno final
{
public:
	EOnoType                                      OnoType;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AudioCharacter_BattleManager_C_Battle_PlaySeqOno) == 0x000001, "Wrong alignment on BP_AudioCharacter_BattleManager_C_Battle_PlaySeqOno");
static_assert(sizeof(BP_AudioCharacter_BattleManager_C_Battle_PlaySeqOno) == 0x000001, "Wrong size on BP_AudioCharacter_BattleManager_C_Battle_PlaySeqOno");
static_assert(offsetof(BP_AudioCharacter_BattleManager_C_Battle_PlaySeqOno, OnoType) == 0x000000, "Member 'BP_AudioCharacter_BattleManager_C_Battle_PlaySeqOno::OnoType' has a wrong offset!");

// Function BP_AudioCharacter_BattleManager.BP_AudioCharacter_BattleManager_C.CleanSpawnedAudioComponentList
// 0x0060 (0x0060 - 0x0000)
struct BP_AudioCharacter_BattleManager_C_CleanSpawnedAudioComponentList final
{
public:
	TArray<int32>                                 Temp_wildcard_Temp_buffer_array_Variable;          // 0x0000(0x0010)(ConstParm, ReferenceParm)
	TArray<int32>                                 Temp_wildcard_We_need_a_second_array_to_store_the_result_and_be_able_to_wipe_the_first__buffer__array_Variable; // 0x0010(0x0010)(ConstParm, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue;                          // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Get_Item;                           // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_Array_Get_Item_1;                         // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x005D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x005E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AudioCharacter_BattleManager_C_CleanSpawnedAudioComponentList) == 0x000008, "Wrong alignment on BP_AudioCharacter_BattleManager_C_CleanSpawnedAudioComponentList");
static_assert(sizeof(BP_AudioCharacter_BattleManager_C_CleanSpawnedAudioComponentList) == 0x000060, "Wrong size on BP_AudioCharacter_BattleManager_C_CleanSpawnedAudioComponentList");
static_assert(offsetof(BP_AudioCharacter_BattleManager_C_CleanSpawnedAudioComponentList, Temp_wildcard_Temp_buffer_array_Variable) == 0x000000, "Member 'BP_AudioCharacter_BattleManager_C_CleanSpawnedAudioComponentList::Temp_wildcard_Temp_buffer_array_Variable' has a wrong offset!");
static_assert(offsetof(BP_AudioCharacter_BattleManager_C_CleanSpawnedAudioComponentList, Temp_wildcard_We_need_a_second_array_to_store_the_result_and_be_able_to_wipe_the_first__buffer__array_Variable) == 0x000010, "Member 'BP_AudioCharacter_BattleManager_C_CleanSpawnedAudioComponentList::Temp_wildcard_We_need_a_second_array_to_store_the_result_and_be_able_to_wipe_the_first__buffer__array_Variable' has a wrong offset!");
static_assert(offsetof(BP_AudioCharacter_BattleManager_C_CleanSpawnedAudioComponentList, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'BP_AudioCharacter_BattleManager_C_CleanSpawnedAudioComponentList::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AudioCharacter_BattleManager_C_CleanSpawnedAudioComponentList, CallFunc_Subtract_IntInt_ReturnValue) == 0x000024, "Member 'BP_AudioCharacter_BattleManager_C_CleanSpawnedAudioComponentList::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AudioCharacter_BattleManager_C_CleanSpawnedAudioComponentList, CallFunc_Max_ReturnValue) == 0x000028, "Member 'BP_AudioCharacter_BattleManager_C_CleanSpawnedAudioComponentList::CallFunc_Max_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AudioCharacter_BattleManager_C_CleanSpawnedAudioComponentList, Temp_int_Array_Index_Variable) == 0x00002C, "Member 'BP_AudioCharacter_BattleManager_C_CleanSpawnedAudioComponentList::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_AudioCharacter_BattleManager_C_CleanSpawnedAudioComponentList, CallFunc_Array_Get_Item) == 0x000030, "Member 'BP_AudioCharacter_BattleManager_C_CleanSpawnedAudioComponentList::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_AudioCharacter_BattleManager_C_CleanSpawnedAudioComponentList, Temp_int_Loop_Counter_Variable) == 0x000034, "Member 'BP_AudioCharacter_BattleManager_C_CleanSpawnedAudioComponentList::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_AudioCharacter_BattleManager_C_CleanSpawnedAudioComponentList, CallFunc_Add_IntInt_ReturnValue) == 0x000038, "Member 'BP_AudioCharacter_BattleManager_C_CleanSpawnedAudioComponentList::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AudioCharacter_BattleManager_C_CleanSpawnedAudioComponentList, Temp_int_Array_Index_Variable_1) == 0x00003C, "Member 'BP_AudioCharacter_BattleManager_C_CleanSpawnedAudioComponentList::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_AudioCharacter_BattleManager_C_CleanSpawnedAudioComponentList, Temp_int_Loop_Counter_Variable_1) == 0x000040, "Member 'BP_AudioCharacter_BattleManager_C_CleanSpawnedAudioComponentList::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_AudioCharacter_BattleManager_C_CleanSpawnedAudioComponentList, CallFunc_Array_Add_ReturnValue) == 0x000044, "Member 'BP_AudioCharacter_BattleManager_C_CleanSpawnedAudioComponentList::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
