#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AchievementValidator

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_AchievementValidator.BP_AchievementValidator_C.GetWorldContext
// 0x0008 (0x0008 - 0x0000)
struct BP_AchievementValidator_C_GetWorldContext final
{
public:
	class UObject*                                WorldContext;                                      // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AchievementValidator_C_GetWorldContext) == 0x000008, "Wrong alignment on BP_AchievementValidator_C_GetWorldContext");
static_assert(sizeof(BP_AchievementValidator_C_GetWorldContext) == 0x000008, "Wrong size on BP_AchievementValidator_C_GetWorldContext");
static_assert(offsetof(BP_AchievementValidator_C_GetWorldContext, WorldContext) == 0x000000, "Member 'BP_AchievementValidator_C_GetWorldContext::WorldContext' has a wrong offset!");

// Function BP_AchievementValidator.BP_AchievementValidator_C.Initialize
// 0x0008 (0x0008 - 0x0000)
struct BP_AchievementValidator_C_Initialize final
{
public:
	class UGameInstance*                          GameInstance;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AchievementValidator_C_Initialize) == 0x000008, "Wrong alignment on BP_AchievementValidator_C_Initialize");
static_assert(sizeof(BP_AchievementValidator_C_Initialize) == 0x000008, "Wrong size on BP_AchievementValidator_C_Initialize");
static_assert(offsetof(BP_AchievementValidator_C_Initialize, GameInstance) == 0x000000, "Member 'BP_AchievementValidator_C_Initialize::GameInstance' has a wrong offset!");

}

