#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AudioControlSystem

#include "Basic.hpp"

#include "FLevelDataEntry_structs.hpp"


namespace SDK::Params
{

// Function BP_AudioControlSystem.BP_AudioControlSystem_C.ActivateBusMixForMainMenu
// 0x01C8 (0x01C8 - 0x0000)
struct BP_AudioControlSystem_C_ActivateBusMixForMainMenu final
{
public:
	bool                                          CallFunc_GetCurrentLevelData_Found;                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFLevelDataEntry                       CallFunc_GetCurrentLevelData_LevelData;            // 0x0008(0x01B0)(HasGetValueTypeHash)
	class FName                                   CallFunc_GetCurrentLevelData_RowName;              // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AudioControlSystem_C_ActivateBusMixForMainMenu) == 0x000008, "Wrong alignment on BP_AudioControlSystem_C_ActivateBusMixForMainMenu");
static_assert(sizeof(BP_AudioControlSystem_C_ActivateBusMixForMainMenu) == 0x0001C8, "Wrong size on BP_AudioControlSystem_C_ActivateBusMixForMainMenu");
static_assert(offsetof(BP_AudioControlSystem_C_ActivateBusMixForMainMenu, CallFunc_GetCurrentLevelData_Found) == 0x000000, "Member 'BP_AudioControlSystem_C_ActivateBusMixForMainMenu::CallFunc_GetCurrentLevelData_Found' has a wrong offset!");
static_assert(offsetof(BP_AudioControlSystem_C_ActivateBusMixForMainMenu, CallFunc_GetCurrentLevelData_LevelData) == 0x000008, "Member 'BP_AudioControlSystem_C_ActivateBusMixForMainMenu::CallFunc_GetCurrentLevelData_LevelData' has a wrong offset!");
static_assert(offsetof(BP_AudioControlSystem_C_ActivateBusMixForMainMenu, CallFunc_GetCurrentLevelData_RowName) == 0x0001B8, "Member 'BP_AudioControlSystem_C_ActivateBusMixForMainMenu::CallFunc_GetCurrentLevelData_RowName' has a wrong offset!");
static_assert(offsetof(BP_AudioControlSystem_C_ActivateBusMixForMainMenu, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0001C0, "Member 'BP_AudioControlSystem_C_ActivateBusMixForMainMenu::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function BP_AudioControlSystem.BP_AudioControlSystem_C.ActivateExplorationControlBusMix
// 0x0008 (0x0008 - 0x0000)
struct BP_AudioControlSystem_C_ActivateExplorationControlBusMix final
{
public:
	class USoundControlBusMix*                    Mix;                                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AudioControlSystem_C_ActivateExplorationControlBusMix) == 0x000008, "Wrong alignment on BP_AudioControlSystem_C_ActivateExplorationControlBusMix");
static_assert(sizeof(BP_AudioControlSystem_C_ActivateExplorationControlBusMix) == 0x000008, "Wrong size on BP_AudioControlSystem_C_ActivateExplorationControlBusMix");
static_assert(offsetof(BP_AudioControlSystem_C_ActivateExplorationControlBusMix, Mix) == 0x000000, "Member 'BP_AudioControlSystem_C_ActivateExplorationControlBusMix::Mix' has a wrong offset!");

// Function BP_AudioControlSystem.BP_AudioControlSystem_C.ApplySoundUserSettings
// 0x0020 (0x0020 - 0x0000)
struct BP_AudioControlSystem_C_ApplySoundUserSettings final
{
public:
	class UConfigurableGameUserSettings*          CallFunc_GetConfigurableGameUserSettings_GameUserSettings; // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetMasterVolume_ReturnValue;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetSpecialEffectsVolume_ReturnValue;      // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetUserInterfaceVolume_ReturnValue;       // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetVoiceVolume_ReturnValue;               // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetMusicVolume_ReturnValue;               // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AudioControlSystem_C_ApplySoundUserSettings) == 0x000008, "Wrong alignment on BP_AudioControlSystem_C_ApplySoundUserSettings");
static_assert(sizeof(BP_AudioControlSystem_C_ApplySoundUserSettings) == 0x000020, "Wrong size on BP_AudioControlSystem_C_ApplySoundUserSettings");
static_assert(offsetof(BP_AudioControlSystem_C_ApplySoundUserSettings, CallFunc_GetConfigurableGameUserSettings_GameUserSettings) == 0x000000, "Member 'BP_AudioControlSystem_C_ApplySoundUserSettings::CallFunc_GetConfigurableGameUserSettings_GameUserSettings' has a wrong offset!");
static_assert(offsetof(BP_AudioControlSystem_C_ApplySoundUserSettings, CallFunc_GetMasterVolume_ReturnValue) == 0x000008, "Member 'BP_AudioControlSystem_C_ApplySoundUserSettings::CallFunc_GetMasterVolume_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AudioControlSystem_C_ApplySoundUserSettings, CallFunc_GetSpecialEffectsVolume_ReturnValue) == 0x00000C, "Member 'BP_AudioControlSystem_C_ApplySoundUserSettings::CallFunc_GetSpecialEffectsVolume_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AudioControlSystem_C_ApplySoundUserSettings, CallFunc_GetUserInterfaceVolume_ReturnValue) == 0x000010, "Member 'BP_AudioControlSystem_C_ApplySoundUserSettings::CallFunc_GetUserInterfaceVolume_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AudioControlSystem_C_ApplySoundUserSettings, CallFunc_GetVoiceVolume_ReturnValue) == 0x000014, "Member 'BP_AudioControlSystem_C_ApplySoundUserSettings::CallFunc_GetVoiceVolume_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AudioControlSystem_C_ApplySoundUserSettings, CallFunc_GetMusicVolume_ReturnValue) == 0x000018, "Member 'BP_AudioControlSystem_C_ApplySoundUserSettings::CallFunc_GetMusicVolume_ReturnValue' has a wrong offset!");

// Function BP_AudioControlSystem.BP_AudioControlSystem_C.DeactivateExplorationControlBusMix
// 0x0010 (0x0010 - 0x0000)
struct BP_AudioControlSystem_C_DeactivateExplorationControlBusMix final
{
public:
	class USoundControlBusMix*                    Mix;                                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AudioControlSystem_C_DeactivateExplorationControlBusMix) == 0x000008, "Wrong alignment on BP_AudioControlSystem_C_DeactivateExplorationControlBusMix");
static_assert(sizeof(BP_AudioControlSystem_C_DeactivateExplorationControlBusMix) == 0x000010, "Wrong size on BP_AudioControlSystem_C_DeactivateExplorationControlBusMix");
static_assert(offsetof(BP_AudioControlSystem_C_DeactivateExplorationControlBusMix, Mix) == 0x000000, "Member 'BP_AudioControlSystem_C_DeactivateExplorationControlBusMix::Mix' has a wrong offset!");
static_assert(offsetof(BP_AudioControlSystem_C_DeactivateExplorationControlBusMix, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000008, "Member 'BP_AudioControlSystem_C_DeactivateExplorationControlBusMix::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");

// Function BP_AudioControlSystem.BP_AudioControlSystem_C.GetLastActivatedExplorationControlBusMix
// 0x0008 (0x0008 - 0x0000)
struct BP_AudioControlSystem_C_GetLastActivatedExplorationControlBusMix final
{
public:
	class USoundControlBusMix*                    ControlBusMix;                                     // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AudioControlSystem_C_GetLastActivatedExplorationControlBusMix) == 0x000008, "Wrong alignment on BP_AudioControlSystem_C_GetLastActivatedExplorationControlBusMix");
static_assert(sizeof(BP_AudioControlSystem_C_GetLastActivatedExplorationControlBusMix) == 0x000008, "Wrong size on BP_AudioControlSystem_C_GetLastActivatedExplorationControlBusMix");
static_assert(offsetof(BP_AudioControlSystem_C_GetLastActivatedExplorationControlBusMix, ControlBusMix) == 0x000000, "Member 'BP_AudioControlSystem_C_GetLastActivatedExplorationControlBusMix::ControlBusMix' has a wrong offset!");

// Function BP_AudioControlSystem.BP_AudioControlSystem_C.OnChangeMapProcessFinished
// 0x01C8 (0x01C8 - 0x0000)
struct BP_AudioControlSystem_C_OnChangeMapProcessFinished final
{
public:
	class FName                                   LevelDestination;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetLevelData_Found;                       // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFLevelDataEntry                       CallFunc_GetLevelData_LevelData;                   // 0x0010(0x01B0)(HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AudioControlSystem_C_OnChangeMapProcessFinished) == 0x000008, "Wrong alignment on BP_AudioControlSystem_C_OnChangeMapProcessFinished");
static_assert(sizeof(BP_AudioControlSystem_C_OnChangeMapProcessFinished) == 0x0001C8, "Wrong size on BP_AudioControlSystem_C_OnChangeMapProcessFinished");
static_assert(offsetof(BP_AudioControlSystem_C_OnChangeMapProcessFinished, LevelDestination) == 0x000000, "Member 'BP_AudioControlSystem_C_OnChangeMapProcessFinished::LevelDestination' has a wrong offset!");
static_assert(offsetof(BP_AudioControlSystem_C_OnChangeMapProcessFinished, CallFunc_GetLevelData_Found) == 0x000008, "Member 'BP_AudioControlSystem_C_OnChangeMapProcessFinished::CallFunc_GetLevelData_Found' has a wrong offset!");
static_assert(offsetof(BP_AudioControlSystem_C_OnChangeMapProcessFinished, CallFunc_GetLevelData_LevelData) == 0x000010, "Member 'BP_AudioControlSystem_C_OnChangeMapProcessFinished::CallFunc_GetLevelData_LevelData' has a wrong offset!");
static_assert(offsetof(BP_AudioControlSystem_C_OnChangeMapProcessFinished, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x0001C0, "Member 'BP_AudioControlSystem_C_OnChangeMapProcessFinished::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function BP_AudioControlSystem.BP_AudioControlSystem_C.OnChangeMapProcessStarted
// 0x0008 (0x0008 - 0x0000)
struct BP_AudioControlSystem_C_OnChangeMapProcessStarted final
{
public:
	class FName                                   LevelDestination;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AudioControlSystem_C_OnChangeMapProcessStarted) == 0x000004, "Wrong alignment on BP_AudioControlSystem_C_OnChangeMapProcessStarted");
static_assert(sizeof(BP_AudioControlSystem_C_OnChangeMapProcessStarted) == 0x000008, "Wrong size on BP_AudioControlSystem_C_OnChangeMapProcessStarted");
static_assert(offsetof(BP_AudioControlSystem_C_OnChangeMapProcessStarted, LevelDestination) == 0x000000, "Member 'BP_AudioControlSystem_C_OnChangeMapProcessStarted::LevelDestination' has a wrong offset!");

// Function BP_AudioControlSystem.BP_AudioControlSystem_C.OnDialogueFinished
// 0x0008 (0x0008 - 0x0000)
struct BP_AudioControlSystem_C_OnDialogueFinished final
{
public:
	class ABP_Dialogue_C*                         Dialogue;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AudioControlSystem_C_OnDialogueFinished) == 0x000008, "Wrong alignment on BP_AudioControlSystem_C_OnDialogueFinished");
static_assert(sizeof(BP_AudioControlSystem_C_OnDialogueFinished) == 0x000008, "Wrong size on BP_AudioControlSystem_C_OnDialogueFinished");
static_assert(offsetof(BP_AudioControlSystem_C_OnDialogueFinished, Dialogue) == 0x000000, "Member 'BP_AudioControlSystem_C_OnDialogueFinished::Dialogue' has a wrong offset!");

// Function BP_AudioControlSystem.BP_AudioControlSystem_C.OnDialogueStarted
// 0x0008 (0x0008 - 0x0000)
struct BP_AudioControlSystem_C_OnDialogueStarted final
{
public:
	class ABP_Dialogue_C*                         Dialogue;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AudioControlSystem_C_OnDialogueStarted) == 0x000008, "Wrong alignment on BP_AudioControlSystem_C_OnDialogueStarted");
static_assert(sizeof(BP_AudioControlSystem_C_OnDialogueStarted) == 0x000008, "Wrong size on BP_AudioControlSystem_C_OnDialogueStarted");
static_assert(offsetof(BP_AudioControlSystem_C_OnDialogueStarted, Dialogue) == 0x000000, "Member 'BP_AudioControlSystem_C_OnDialogueStarted::Dialogue' has a wrong offset!");

// Function BP_AudioControlSystem.BP_AudioControlSystem_C.RegisterCinematicEvents
// 0x0028 (0x0028 - 0x0000)
struct BP_AudioControlSystem_C_RegisterCinematicEvents final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_CinematicSystem_C*                  CallFunc_GetCinematicsSystem_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AudioControlSystem_C_RegisterCinematicEvents) == 0x000008, "Wrong alignment on BP_AudioControlSystem_C_RegisterCinematicEvents");
static_assert(sizeof(BP_AudioControlSystem_C_RegisterCinematicEvents) == 0x000028, "Wrong size on BP_AudioControlSystem_C_RegisterCinematicEvents");
static_assert(offsetof(BP_AudioControlSystem_C_RegisterCinematicEvents, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'BP_AudioControlSystem_C_RegisterCinematicEvents::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_AudioControlSystem_C_RegisterCinematicEvents, K2Node_CreateDelegate_OutputDelegate_1) == 0x000010, "Member 'BP_AudioControlSystem_C_RegisterCinematicEvents::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_AudioControlSystem_C_RegisterCinematicEvents, CallFunc_GetCinematicsSystem_ReturnValue) == 0x000020, "Member 'BP_AudioControlSystem_C_RegisterCinematicEvents::CallFunc_GetCinematicsSystem_ReturnValue' has a wrong offset!");

// Function BP_AudioControlSystem.BP_AudioControlSystem_C.RegisterControllerEvents
// 0x0098 (0x0098 - 0x0000)
struct BP_AudioControlSystem_C_RegisterControllerEvents final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0020(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0030(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x0040(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x0050(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_6;            // 0x0060(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_7;            // 0x0070(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_jRPG_Controller_World_C*            K2Node_DynamicCast_AsBP_J_RPG_Controller_World;    // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AudioControlSystem_C_RegisterControllerEvents) == 0x000008, "Wrong alignment on BP_AudioControlSystem_C_RegisterControllerEvents");
static_assert(sizeof(BP_AudioControlSystem_C_RegisterControllerEvents) == 0x000098, "Wrong size on BP_AudioControlSystem_C_RegisterControllerEvents");
static_assert(offsetof(BP_AudioControlSystem_C_RegisterControllerEvents, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'BP_AudioControlSystem_C_RegisterControllerEvents::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_AudioControlSystem_C_RegisterControllerEvents, K2Node_CreateDelegate_OutputDelegate_1) == 0x000010, "Member 'BP_AudioControlSystem_C_RegisterControllerEvents::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_AudioControlSystem_C_RegisterControllerEvents, K2Node_CreateDelegate_OutputDelegate_2) == 0x000020, "Member 'BP_AudioControlSystem_C_RegisterControllerEvents::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_AudioControlSystem_C_RegisterControllerEvents, K2Node_CreateDelegate_OutputDelegate_3) == 0x000030, "Member 'BP_AudioControlSystem_C_RegisterControllerEvents::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BP_AudioControlSystem_C_RegisterControllerEvents, K2Node_CreateDelegate_OutputDelegate_4) == 0x000040, "Member 'BP_AudioControlSystem_C_RegisterControllerEvents::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(BP_AudioControlSystem_C_RegisterControllerEvents, K2Node_CreateDelegate_OutputDelegate_5) == 0x000050, "Member 'BP_AudioControlSystem_C_RegisterControllerEvents::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(BP_AudioControlSystem_C_RegisterControllerEvents, K2Node_CreateDelegate_OutputDelegate_6) == 0x000060, "Member 'BP_AudioControlSystem_C_RegisterControllerEvents::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(BP_AudioControlSystem_C_RegisterControllerEvents, K2Node_CreateDelegate_OutputDelegate_7) == 0x000070, "Member 'BP_AudioControlSystem_C_RegisterControllerEvents::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(BP_AudioControlSystem_C_RegisterControllerEvents, CallFunc_GetPlayerController_ReturnValue) == 0x000080, "Member 'BP_AudioControlSystem_C_RegisterControllerEvents::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AudioControlSystem_C_RegisterControllerEvents, K2Node_DynamicCast_AsBP_J_RPG_Controller_World) == 0x000088, "Member 'BP_AudioControlSystem_C_RegisterControllerEvents::K2Node_DynamicCast_AsBP_J_RPG_Controller_World' has a wrong offset!");
static_assert(offsetof(BP_AudioControlSystem_C_RegisterControllerEvents, K2Node_DynamicCast_bSuccess) == 0x000090, "Member 'BP_AudioControlSystem_C_RegisterControllerEvents::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BP_AudioControlSystem.BP_AudioControlSystem_C.RegisterDialogueEvents
// 0x0050 (0x0050 - 0x0000)
struct BP_AudioControlSystem_C_RegisterDialogueEvents final
{
public:
	TDelegate<void(class ABP_Dialogue_C* Dialogue)> K2Node_CreateDelegate_OutputDelegate;            // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class ABP_Dialogue_C* Dialogue)> K2Node_CreateDelegate_OutputDelegate_1;          // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0020(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0030(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue;          // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AudioControlSystem_C_RegisterDialogueEvents) == 0x000008, "Wrong alignment on BP_AudioControlSystem_C_RegisterDialogueEvents");
static_assert(sizeof(BP_AudioControlSystem_C_RegisterDialogueEvents) == 0x000050, "Wrong size on BP_AudioControlSystem_C_RegisterDialogueEvents");
static_assert(offsetof(BP_AudioControlSystem_C_RegisterDialogueEvents, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'BP_AudioControlSystem_C_RegisterDialogueEvents::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_AudioControlSystem_C_RegisterDialogueEvents, K2Node_CreateDelegate_OutputDelegate_1) == 0x000010, "Member 'BP_AudioControlSystem_C_RegisterDialogueEvents::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_AudioControlSystem_C_RegisterDialogueEvents, K2Node_CreateDelegate_OutputDelegate_2) == 0x000020, "Member 'BP_AudioControlSystem_C_RegisterDialogueEvents::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_AudioControlSystem_C_RegisterDialogueEvents, K2Node_CreateDelegate_OutputDelegate_3) == 0x000030, "Member 'BP_AudioControlSystem_C_RegisterDialogueEvents::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BP_AudioControlSystem_C_RegisterDialogueEvents, CallFunc_GetPlayerController_ReturnValue) == 0x000040, "Member 'BP_AudioControlSystem_C_RegisterDialogueEvents::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AudioControlSystem_C_RegisterDialogueEvents, CallFunc_GetComponentByClass_ReturnValue) == 0x000048, "Member 'BP_AudioControlSystem_C_RegisterDialogueEvents::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");

// Function BP_AudioControlSystem.BP_AudioControlSystem_C.RegisterGameInstanceEvents
// 0x0028 (0x0028 - 0x0000)
struct BP_AudioControlSystem_C_RegisterGameInstanceEvents final
{
public:
	TDelegate<void(class FName LevelDestination)> K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName LevelDestination)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_jRPG_GI_Custom_C*                   CallFunc_GetCustomGI_ReturnValue;                  // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AudioControlSystem_C_RegisterGameInstanceEvents) == 0x000008, "Wrong alignment on BP_AudioControlSystem_C_RegisterGameInstanceEvents");
static_assert(sizeof(BP_AudioControlSystem_C_RegisterGameInstanceEvents) == 0x000028, "Wrong size on BP_AudioControlSystem_C_RegisterGameInstanceEvents");
static_assert(offsetof(BP_AudioControlSystem_C_RegisterGameInstanceEvents, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'BP_AudioControlSystem_C_RegisterGameInstanceEvents::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_AudioControlSystem_C_RegisterGameInstanceEvents, K2Node_CreateDelegate_OutputDelegate_1) == 0x000010, "Member 'BP_AudioControlSystem_C_RegisterGameInstanceEvents::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_AudioControlSystem_C_RegisterGameInstanceEvents, CallFunc_GetCustomGI_ReturnValue) == 0x000020, "Member 'BP_AudioControlSystem_C_RegisterGameInstanceEvents::CallFunc_GetCustomGI_ReturnValue' has a wrong offset!");

}

