#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AudioControlSystem_Battle

#include "Basic.hpp"

#include "SandFall_structs.hpp"
#include "ECharacterTeamSelector_structs.hpp"


namespace SDK::Params
{

// Function BP_AudioControlSystem_Battle.BP_AudioControlSystem_Battle_C.OnCharacterActionEnd
// 0x0008 (0x0008 - 0x0000)
struct BP_AudioControlSystem_Battle_C_OnCharacterActionEnd final
{
public:
	class UAC_jRPG_CharacterBattleStats_C*        CharacterStats;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AudioControlSystem_Battle_C_OnCharacterActionEnd) == 0x000008, "Wrong alignment on BP_AudioControlSystem_Battle_C_OnCharacterActionEnd");
static_assert(sizeof(BP_AudioControlSystem_Battle_C_OnCharacterActionEnd) == 0x000008, "Wrong size on BP_AudioControlSystem_Battle_C_OnCharacterActionEnd");
static_assert(offsetof(BP_AudioControlSystem_Battle_C_OnCharacterActionEnd, CharacterStats) == 0x000000, "Member 'BP_AudioControlSystem_Battle_C_OnCharacterActionEnd::CharacterStats' has a wrong offset!");

// Function BP_AudioControlSystem_Battle.BP_AudioControlSystem_Battle_C.OnCharacterActionStart
// 0x0038 (0x0038 - 0x0000)
struct BP_AudioControlSystem_Battle_C_OnCharacterActionStart final
{
public:
	class UAC_jRPG_CharacterBattleStats_C*        CharacterStats;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ECharacterTeamSelector                        Temp_byte_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECharacterTeamSelector                        CallFunc_GetTeam_Team;                             // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundControlBusMix*                    Temp_object_Variable;                              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundControlBusMix*                    Temp_object_Variable_1;                            // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundControlBusMix*                    Temp_object_Variable_2;                            // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundControlBusMix*                    Temp_object_Variable_3;                            // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundControlBusMix*                    K2Node_Select_Default;                             // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AudioControlSystem_Battle_C_OnCharacterActionStart) == 0x000008, "Wrong alignment on BP_AudioControlSystem_Battle_C_OnCharacterActionStart");
static_assert(sizeof(BP_AudioControlSystem_Battle_C_OnCharacterActionStart) == 0x000038, "Wrong size on BP_AudioControlSystem_Battle_C_OnCharacterActionStart");
static_assert(offsetof(BP_AudioControlSystem_Battle_C_OnCharacterActionStart, CharacterStats) == 0x000000, "Member 'BP_AudioControlSystem_Battle_C_OnCharacterActionStart::CharacterStats' has a wrong offset!");
static_assert(offsetof(BP_AudioControlSystem_Battle_C_OnCharacterActionStart, Temp_byte_Variable) == 0x000008, "Member 'BP_AudioControlSystem_Battle_C_OnCharacterActionStart::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_AudioControlSystem_Battle_C_OnCharacterActionStart, CallFunc_GetTeam_Team) == 0x000009, "Member 'BP_AudioControlSystem_Battle_C_OnCharacterActionStart::CallFunc_GetTeam_Team' has a wrong offset!");
static_assert(offsetof(BP_AudioControlSystem_Battle_C_OnCharacterActionStart, Temp_object_Variable) == 0x000010, "Member 'BP_AudioControlSystem_Battle_C_OnCharacterActionStart::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_AudioControlSystem_Battle_C_OnCharacterActionStart, Temp_object_Variable_1) == 0x000018, "Member 'BP_AudioControlSystem_Battle_C_OnCharacterActionStart::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_AudioControlSystem_Battle_C_OnCharacterActionStart, Temp_object_Variable_2) == 0x000020, "Member 'BP_AudioControlSystem_Battle_C_OnCharacterActionStart::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_AudioControlSystem_Battle_C_OnCharacterActionStart, Temp_object_Variable_3) == 0x000028, "Member 'BP_AudioControlSystem_Battle_C_OnCharacterActionStart::Temp_object_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_AudioControlSystem_Battle_C_OnCharacterActionStart, K2Node_Select_Default) == 0x000030, "Member 'BP_AudioControlSystem_Battle_C_OnCharacterActionStart::K2Node_Select_Default' has a wrong offset!");

// Function BP_AudioControlSystem_Battle.BP_AudioControlSystem_Battle_C.OnCharacterTurnStart
// 0x0028 (0x0028 - 0x0000)
struct BP_AudioControlSystem_Battle_C_OnCharacterTurnStart final
{
public:
	class UAC_jRPG_CharacterBattleStats_C*        CharacterStats;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ECharacterTeamSelector                        CallFunc_GetTeam_Team;                             // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B[0x5];                                        // 0x000B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSoundEventDataTableRowHandle          K2Node_Select_Default;                             // 0x0010(0x0010)(NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AudioControlSystem_Battle_C_OnCharacterTurnStart) == 0x000008, "Wrong alignment on BP_AudioControlSystem_Battle_C_OnCharacterTurnStart");
static_assert(sizeof(BP_AudioControlSystem_Battle_C_OnCharacterTurnStart) == 0x000028, "Wrong size on BP_AudioControlSystem_Battle_C_OnCharacterTurnStart");
static_assert(offsetof(BP_AudioControlSystem_Battle_C_OnCharacterTurnStart, CharacterStats) == 0x000000, "Member 'BP_AudioControlSystem_Battle_C_OnCharacterTurnStart::CharacterStats' has a wrong offset!");
static_assert(offsetof(BP_AudioControlSystem_Battle_C_OnCharacterTurnStart, CallFunc_GetTeam_Team) == 0x000008, "Member 'BP_AudioControlSystem_Battle_C_OnCharacterTurnStart::CallFunc_GetTeam_Team' has a wrong offset!");
static_assert(offsetof(BP_AudioControlSystem_Battle_C_OnCharacterTurnStart, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000009, "Member 'BP_AudioControlSystem_Battle_C_OnCharacterTurnStart::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AudioControlSystem_Battle_C_OnCharacterTurnStart, Temp_bool_Variable) == 0x00000A, "Member 'BP_AudioControlSystem_Battle_C_OnCharacterTurnStart::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_AudioControlSystem_Battle_C_OnCharacterTurnStart, K2Node_Select_Default) == 0x000010, "Member 'BP_AudioControlSystem_Battle_C_OnCharacterTurnStart::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_AudioControlSystem_Battle_C_OnCharacterTurnStart, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000020, "Member 'BP_AudioControlSystem_Battle_C_OnCharacterTurnStart::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");

}

