#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ACTIVATELightingScenario

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_ACTIVATELightingScenario.BP_ACTIVATELightingScenario_C.ExecuteUbergraph_BP_ACTIVATELightingScenario
// 0x0340 (0x0340 - 0x0000)
struct BP_ACTIVATELightingScenario_C_ExecuteUbergraph_BP_ACTIVATELightingScenario final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent_1;  // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor_1;           // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp_1;            // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex_1;       // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep_1;           // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult_1;          // 0x0028(0x00F8)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x0120(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0130(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x013C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13D[0x3];                                      // 0x013D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x0140(0x00F8)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class ABP_jRPG_Character_World_C*             K2Node_DynamicCast_AsBP_J_RPG_Character_World;     // 0x0238(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_241[0x7];                                      // 0x0241(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_jRPG_Character_World_C*             K2Node_DynamicCast_AsBP_J_RPG_Character_World_1;   // 0x0248(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_251[0x7];                                      // 0x0251(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_LighingScenarioMain_DONOTTOUCH_C*   CallFunc_GetActorOfClass_ReturnValue;              // 0x0258(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x0260(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_LightingScenarioReference_C*        K2Node_DynamicCast_AsBP_Lighting_Scenario_Reference; // 0x0268(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_271[0x7];                                      // 0x0271(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_LighingScenarioMain_DONOTTOUCH_C*   CallFunc_GetActorOfClass_ReturnValue_1;            // 0x0278(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_281[0x7];                                      // 0x0281(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_1; // 0x0288(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_2; // 0x0290(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_LightingScenarioReference_C*        K2Node_DynamicCast_AsBP_Lighting_Scenario_Reference_1; // 0x0298(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A1[0x7];                                      // 0x02A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_LightingScenarioReference_C*        K2Node_DynamicCast_AsBP_Lighting_Scenario_Reference_2; // 0x02A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue_1;      // 0x02B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B2[0x6];                                      // 0x02B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_3; // 0x02B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NearlyEqual_FloatFloat_ReturnValue;       // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C1[0x7];                                      // 0x02C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_LightingScenarioReference_C*        K2Node_DynamicCast_AsBP_Lighting_Scenario_Reference_3; // 0x02C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x02D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D1[0x7];                                      // 0x02D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x02E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NearlyEqual_FloatFloat_ReturnValue_1;     // 0x02E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E9[0x7];                                      // 0x02E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue_1;                // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue_1;                     // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_Value_ImplicitCast;                // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_A_ImplicitCast;               // 0x0308(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_NearlyEqual_FloatFloat_A_ImplicitCast;    // 0x0310(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_ChangeLightingToScenario_ChangeSpeedMultiplier_ImplicitCast; // 0x0318(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31C[0x4];                                      // 0x031C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FClamp_Value_ImplicitCast_1;              // 0x0320(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_A_ImplicitCast_1;             // 0x0328(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_NearlyEqual_FloatFloat_A_ImplicitCast_1;  // 0x0330(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_ChangeLightingToScenario_ChangeSpeedMultiplier_ImplicitCast_1; // 0x0338(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ACTIVATELightingScenario_C_ExecuteUbergraph_BP_ACTIVATELightingScenario) == 0x000008, "Wrong alignment on BP_ACTIVATELightingScenario_C_ExecuteUbergraph_BP_ACTIVATELightingScenario");
static_assert(sizeof(BP_ACTIVATELightingScenario_C_ExecuteUbergraph_BP_ACTIVATELightingScenario) == 0x000340, "Wrong size on BP_ACTIVATELightingScenario_C_ExecuteUbergraph_BP_ACTIVATELightingScenario");
static_assert(offsetof(BP_ACTIVATELightingScenario_C_ExecuteUbergraph_BP_ACTIVATELightingScenario, EntryPoint) == 0x000000, "Member 'BP_ACTIVATELightingScenario_C_ExecuteUbergraph_BP_ACTIVATELightingScenario::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ACTIVATELightingScenario_C_ExecuteUbergraph_BP_ACTIVATELightingScenario, K2Node_ComponentBoundEvent_OverlappedComponent_1) == 0x000008, "Member 'BP_ACTIVATELightingScenario_C_ExecuteUbergraph_BP_ACTIVATELightingScenario::K2Node_ComponentBoundEvent_OverlappedComponent_1' has a wrong offset!");
static_assert(offsetof(BP_ACTIVATELightingScenario_C_ExecuteUbergraph_BP_ACTIVATELightingScenario, K2Node_ComponentBoundEvent_OtherActor_1) == 0x000010, "Member 'BP_ACTIVATELightingScenario_C_ExecuteUbergraph_BP_ACTIVATELightingScenario::K2Node_ComponentBoundEvent_OtherActor_1' has a wrong offset!");
static_assert(offsetof(BP_ACTIVATELightingScenario_C_ExecuteUbergraph_BP_ACTIVATELightingScenario, K2Node_ComponentBoundEvent_OtherComp_1) == 0x000018, "Member 'BP_ACTIVATELightingScenario_C_ExecuteUbergraph_BP_ACTIVATELightingScenario::K2Node_ComponentBoundEvent_OtherComp_1' has a wrong offset!");
static_assert(offsetof(BP_ACTIVATELightingScenario_C_ExecuteUbergraph_BP_ACTIVATELightingScenario, K2Node_ComponentBoundEvent_OtherBodyIndex_1) == 0x000020, "Member 'BP_ACTIVATELightingScenario_C_ExecuteUbergraph_BP_ACTIVATELightingScenario::K2Node_ComponentBoundEvent_OtherBodyIndex_1' has a wrong offset!");
static_assert(offsetof(BP_ACTIVATELightingScenario_C_ExecuteUbergraph_BP_ACTIVATELightingScenario, K2Node_ComponentBoundEvent_bFromSweep_1) == 0x000024, "Member 'BP_ACTIVATELightingScenario_C_ExecuteUbergraph_BP_ACTIVATELightingScenario::K2Node_ComponentBoundEvent_bFromSweep_1' has a wrong offset!");
static_assert(offsetof(BP_ACTIVATELightingScenario_C_ExecuteUbergraph_BP_ACTIVATELightingScenario, K2Node_ComponentBoundEvent_SweepResult_1) == 0x000028, "Member 'BP_ACTIVATELightingScenario_C_ExecuteUbergraph_BP_ACTIVATELightingScenario::K2Node_ComponentBoundEvent_SweepResult_1' has a wrong offset!");
static_assert(offsetof(BP_ACTIVATELightingScenario_C_ExecuteUbergraph_BP_ACTIVATELightingScenario, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x000120, "Member 'BP_ACTIVATELightingScenario_C_ExecuteUbergraph_BP_ACTIVATELightingScenario::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_ACTIVATELightingScenario_C_ExecuteUbergraph_BP_ACTIVATELightingScenario, K2Node_ComponentBoundEvent_OtherActor) == 0x000128, "Member 'BP_ACTIVATELightingScenario_C_ExecuteUbergraph_BP_ACTIVATELightingScenario::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(BP_ACTIVATELightingScenario_C_ExecuteUbergraph_BP_ACTIVATELightingScenario, K2Node_ComponentBoundEvent_OtherComp) == 0x000130, "Member 'BP_ACTIVATELightingScenario_C_ExecuteUbergraph_BP_ACTIVATELightingScenario::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(BP_ACTIVATELightingScenario_C_ExecuteUbergraph_BP_ACTIVATELightingScenario, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x000138, "Member 'BP_ACTIVATELightingScenario_C_ExecuteUbergraph_BP_ACTIVATELightingScenario::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_ACTIVATELightingScenario_C_ExecuteUbergraph_BP_ACTIVATELightingScenario, K2Node_ComponentBoundEvent_bFromSweep) == 0x00013C, "Member 'BP_ACTIVATELightingScenario_C_ExecuteUbergraph_BP_ACTIVATELightingScenario::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_ACTIVATELightingScenario_C_ExecuteUbergraph_BP_ACTIVATELightingScenario, K2Node_ComponentBoundEvent_SweepResult) == 0x000140, "Member 'BP_ACTIVATELightingScenario_C_ExecuteUbergraph_BP_ACTIVATELightingScenario::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(BP_ACTIVATELightingScenario_C_ExecuteUbergraph_BP_ACTIVATELightingScenario, K2Node_DynamicCast_AsBP_J_RPG_Character_World) == 0x000238, "Member 'BP_ACTIVATELightingScenario_C_ExecuteUbergraph_BP_ACTIVATELightingScenario::K2Node_DynamicCast_AsBP_J_RPG_Character_World' has a wrong offset!");
static_assert(offsetof(BP_ACTIVATELightingScenario_C_ExecuteUbergraph_BP_ACTIVATELightingScenario, K2Node_DynamicCast_bSuccess) == 0x000240, "Member 'BP_ACTIVATELightingScenario_C_ExecuteUbergraph_BP_ACTIVATELightingScenario::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ACTIVATELightingScenario_C_ExecuteUbergraph_BP_ACTIVATELightingScenario, K2Node_DynamicCast_AsBP_J_RPG_Character_World_1) == 0x000248, "Member 'BP_ACTIVATELightingScenario_C_ExecuteUbergraph_BP_ACTIVATELightingScenario::K2Node_DynamicCast_AsBP_J_RPG_Character_World_1' has a wrong offset!");
static_assert(offsetof(BP_ACTIVATELightingScenario_C_ExecuteUbergraph_BP_ACTIVATELightingScenario, K2Node_DynamicCast_bSuccess_1) == 0x000250, "Member 'BP_ACTIVATELightingScenario_C_ExecuteUbergraph_BP_ACTIVATELightingScenario::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_ACTIVATELightingScenario_C_ExecuteUbergraph_BP_ACTIVATELightingScenario, CallFunc_GetActorOfClass_ReturnValue) == 0x000258, "Member 'BP_ACTIVATELightingScenario_C_ExecuteUbergraph_BP_ACTIVATELightingScenario::CallFunc_GetActorOfClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ACTIVATELightingScenario_C_ExecuteUbergraph_BP_ACTIVATELightingScenario, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue) == 0x000260, "Member 'BP_ACTIVATELightingScenario_C_ExecuteUbergraph_BP_ACTIVATELightingScenario::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ACTIVATELightingScenario_C_ExecuteUbergraph_BP_ACTIVATELightingScenario, K2Node_DynamicCast_AsBP_Lighting_Scenario_Reference) == 0x000268, "Member 'BP_ACTIVATELightingScenario_C_ExecuteUbergraph_BP_ACTIVATELightingScenario::K2Node_DynamicCast_AsBP_Lighting_Scenario_Reference' has a wrong offset!");
static_assert(offsetof(BP_ACTIVATELightingScenario_C_ExecuteUbergraph_BP_ACTIVATELightingScenario, K2Node_DynamicCast_bSuccess_2) == 0x000270, "Member 'BP_ACTIVATELightingScenario_C_ExecuteUbergraph_BP_ACTIVATELightingScenario::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_ACTIVATELightingScenario_C_ExecuteUbergraph_BP_ACTIVATELightingScenario, CallFunc_GetActorOfClass_ReturnValue_1) == 0x000278, "Member 'BP_ACTIVATELightingScenario_C_ExecuteUbergraph_BP_ACTIVATELightingScenario::CallFunc_GetActorOfClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ACTIVATELightingScenario_C_ExecuteUbergraph_BP_ACTIVATELightingScenario, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000280, "Member 'BP_ACTIVATELightingScenario_C_ExecuteUbergraph_BP_ACTIVATELightingScenario::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ACTIVATELightingScenario_C_ExecuteUbergraph_BP_ACTIVATELightingScenario, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_1) == 0x000288, "Member 'BP_ACTIVATELightingScenario_C_ExecuteUbergraph_BP_ACTIVATELightingScenario::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ACTIVATELightingScenario_C_ExecuteUbergraph_BP_ACTIVATELightingScenario, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_2) == 0x000290, "Member 'BP_ACTIVATELightingScenario_C_ExecuteUbergraph_BP_ACTIVATELightingScenario::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ACTIVATELightingScenario_C_ExecuteUbergraph_BP_ACTIVATELightingScenario, K2Node_DynamicCast_AsBP_Lighting_Scenario_Reference_1) == 0x000298, "Member 'BP_ACTIVATELightingScenario_C_ExecuteUbergraph_BP_ACTIVATELightingScenario::K2Node_DynamicCast_AsBP_Lighting_Scenario_Reference_1' has a wrong offset!");
static_assert(offsetof(BP_ACTIVATELightingScenario_C_ExecuteUbergraph_BP_ACTIVATELightingScenario, K2Node_DynamicCast_bSuccess_3) == 0x0002A0, "Member 'BP_ACTIVATELightingScenario_C_ExecuteUbergraph_BP_ACTIVATELightingScenario::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BP_ACTIVATELightingScenario_C_ExecuteUbergraph_BP_ACTIVATELightingScenario, K2Node_DynamicCast_AsBP_Lighting_Scenario_Reference_2) == 0x0002A8, "Member 'BP_ACTIVATELightingScenario_C_ExecuteUbergraph_BP_ACTIVATELightingScenario::K2Node_DynamicCast_AsBP_Lighting_Scenario_Reference_2' has a wrong offset!");
static_assert(offsetof(BP_ACTIVATELightingScenario_C_ExecuteUbergraph_BP_ACTIVATELightingScenario, K2Node_DynamicCast_bSuccess_4) == 0x0002B0, "Member 'BP_ACTIVATELightingScenario_C_ExecuteUbergraph_BP_ACTIVATELightingScenario::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(BP_ACTIVATELightingScenario_C_ExecuteUbergraph_BP_ACTIVATELightingScenario, CallFunc_NotEqual_ObjectObject_ReturnValue_1) == 0x0002B1, "Member 'BP_ACTIVATELightingScenario_C_ExecuteUbergraph_BP_ACTIVATELightingScenario::CallFunc_NotEqual_ObjectObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ACTIVATELightingScenario_C_ExecuteUbergraph_BP_ACTIVATELightingScenario, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_3) == 0x0002B8, "Member 'BP_ACTIVATELightingScenario_C_ExecuteUbergraph_BP_ACTIVATELightingScenario::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_ACTIVATELightingScenario_C_ExecuteUbergraph_BP_ACTIVATELightingScenario, CallFunc_NearlyEqual_FloatFloat_ReturnValue) == 0x0002C0, "Member 'BP_ACTIVATELightingScenario_C_ExecuteUbergraph_BP_ACTIVATELightingScenario::CallFunc_NearlyEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ACTIVATELightingScenario_C_ExecuteUbergraph_BP_ACTIVATELightingScenario, K2Node_DynamicCast_AsBP_Lighting_Scenario_Reference_3) == 0x0002C8, "Member 'BP_ACTIVATELightingScenario_C_ExecuteUbergraph_BP_ACTIVATELightingScenario::K2Node_DynamicCast_AsBP_Lighting_Scenario_Reference_3' has a wrong offset!");
static_assert(offsetof(BP_ACTIVATELightingScenario_C_ExecuteUbergraph_BP_ACTIVATELightingScenario, K2Node_DynamicCast_bSuccess_5) == 0x0002D0, "Member 'BP_ACTIVATELightingScenario_C_ExecuteUbergraph_BP_ACTIVATELightingScenario::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(BP_ACTIVATELightingScenario_C_ExecuteUbergraph_BP_ACTIVATELightingScenario, CallFunc_SelectFloat_ReturnValue) == 0x0002D8, "Member 'BP_ACTIVATELightingScenario_C_ExecuteUbergraph_BP_ACTIVATELightingScenario::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ACTIVATELightingScenario_C_ExecuteUbergraph_BP_ACTIVATELightingScenario, CallFunc_FClamp_ReturnValue) == 0x0002E0, "Member 'BP_ACTIVATELightingScenario_C_ExecuteUbergraph_BP_ACTIVATELightingScenario::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ACTIVATELightingScenario_C_ExecuteUbergraph_BP_ACTIVATELightingScenario, CallFunc_NearlyEqual_FloatFloat_ReturnValue_1) == 0x0002E8, "Member 'BP_ACTIVATELightingScenario_C_ExecuteUbergraph_BP_ACTIVATELightingScenario::CallFunc_NearlyEqual_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ACTIVATELightingScenario_C_ExecuteUbergraph_BP_ACTIVATELightingScenario, CallFunc_SelectFloat_ReturnValue_1) == 0x0002F0, "Member 'BP_ACTIVATELightingScenario_C_ExecuteUbergraph_BP_ACTIVATELightingScenario::CallFunc_SelectFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ACTIVATELightingScenario_C_ExecuteUbergraph_BP_ACTIVATELightingScenario, CallFunc_FClamp_ReturnValue_1) == 0x0002F8, "Member 'BP_ACTIVATELightingScenario_C_ExecuteUbergraph_BP_ACTIVATELightingScenario::CallFunc_FClamp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ACTIVATELightingScenario_C_ExecuteUbergraph_BP_ACTIVATELightingScenario, CallFunc_FClamp_Value_ImplicitCast) == 0x000300, "Member 'BP_ACTIVATELightingScenario_C_ExecuteUbergraph_BP_ACTIVATELightingScenario::CallFunc_FClamp_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_ACTIVATELightingScenario_C_ExecuteUbergraph_BP_ACTIVATELightingScenario, CallFunc_SelectFloat_A_ImplicitCast) == 0x000308, "Member 'BP_ACTIVATELightingScenario_C_ExecuteUbergraph_BP_ACTIVATELightingScenario::CallFunc_SelectFloat_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_ACTIVATELightingScenario_C_ExecuteUbergraph_BP_ACTIVATELightingScenario, CallFunc_NearlyEqual_FloatFloat_A_ImplicitCast) == 0x000310, "Member 'BP_ACTIVATELightingScenario_C_ExecuteUbergraph_BP_ACTIVATELightingScenario::CallFunc_NearlyEqual_FloatFloat_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_ACTIVATELightingScenario_C_ExecuteUbergraph_BP_ACTIVATELightingScenario, CallFunc_ChangeLightingToScenario_ChangeSpeedMultiplier_ImplicitCast) == 0x000318, "Member 'BP_ACTIVATELightingScenario_C_ExecuteUbergraph_BP_ACTIVATELightingScenario::CallFunc_ChangeLightingToScenario_ChangeSpeedMultiplier_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_ACTIVATELightingScenario_C_ExecuteUbergraph_BP_ACTIVATELightingScenario, CallFunc_FClamp_Value_ImplicitCast_1) == 0x000320, "Member 'BP_ACTIVATELightingScenario_C_ExecuteUbergraph_BP_ACTIVATELightingScenario::CallFunc_FClamp_Value_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_ACTIVATELightingScenario_C_ExecuteUbergraph_BP_ACTIVATELightingScenario, CallFunc_SelectFloat_A_ImplicitCast_1) == 0x000328, "Member 'BP_ACTIVATELightingScenario_C_ExecuteUbergraph_BP_ACTIVATELightingScenario::CallFunc_SelectFloat_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_ACTIVATELightingScenario_C_ExecuteUbergraph_BP_ACTIVATELightingScenario, CallFunc_NearlyEqual_FloatFloat_A_ImplicitCast_1) == 0x000330, "Member 'BP_ACTIVATELightingScenario_C_ExecuteUbergraph_BP_ACTIVATELightingScenario::CallFunc_NearlyEqual_FloatFloat_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_ACTIVATELightingScenario_C_ExecuteUbergraph_BP_ACTIVATELightingScenario, CallFunc_ChangeLightingToScenario_ChangeSpeedMultiplier_ImplicitCast_1) == 0x000338, "Member 'BP_ACTIVATELightingScenario_C_ExecuteUbergraph_BP_ACTIVATELightingScenario::CallFunc_ChangeLightingToScenario_ChangeSpeedMultiplier_ImplicitCast_1' has a wrong offset!");

// Function BP_ACTIVATELightingScenario.BP_ACTIVATELightingScenario_C.BndEvt__BP_LightingScenarioActivator_LightingScenario2_Trigger_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature
// 0x0118 (0x0118 - 0x0000)
struct BP_ACTIVATELightingScenario_C_BndEvt__BP_LightingScenarioActivator_LightingScenario2_Trigger_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x00F8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_ACTIVATELightingScenario_C_BndEvt__BP_LightingScenarioActivator_LightingScenario2_Trigger_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_ACTIVATELightingScenario_C_BndEvt__BP_LightingScenarioActivator_LightingScenario2_Trigger_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_ACTIVATELightingScenario_C_BndEvt__BP_LightingScenarioActivator_LightingScenario2_Trigger_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature) == 0x000118, "Wrong size on BP_ACTIVATELightingScenario_C_BndEvt__BP_LightingScenarioActivator_LightingScenario2_Trigger_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_ACTIVATELightingScenario_C_BndEvt__BP_LightingScenarioActivator_LightingScenario2_Trigger_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_ACTIVATELightingScenario_C_BndEvt__BP_LightingScenarioActivator_LightingScenario2_Trigger_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_ACTIVATELightingScenario_C_BndEvt__BP_LightingScenarioActivator_LightingScenario2_Trigger_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_ACTIVATELightingScenario_C_BndEvt__BP_LightingScenarioActivator_LightingScenario2_Trigger_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_ACTIVATELightingScenario_C_BndEvt__BP_LightingScenarioActivator_LightingScenario2_Trigger_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_ACTIVATELightingScenario_C_BndEvt__BP_LightingScenarioActivator_LightingScenario2_Trigger_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_ACTIVATELightingScenario_C_BndEvt__BP_LightingScenarioActivator_LightingScenario2_Trigger_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_ACTIVATELightingScenario_C_BndEvt__BP_LightingScenarioActivator_LightingScenario2_Trigger_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_ACTIVATELightingScenario_C_BndEvt__BP_LightingScenarioActivator_LightingScenario2_Trigger_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'BP_ACTIVATELightingScenario_C_BndEvt__BP_LightingScenarioActivator_LightingScenario2_Trigger_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_ACTIVATELightingScenario_C_BndEvt__BP_LightingScenarioActivator_LightingScenario2_Trigger_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'BP_ACTIVATELightingScenario_C_BndEvt__BP_LightingScenarioActivator_LightingScenario2_Trigger_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function BP_ACTIVATELightingScenario.BP_ACTIVATELightingScenario_C.BndEvt__BP_LightingScenarioActivator_LightingScenario1_Trigger_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
// 0x0118 (0x0118 - 0x0000)
struct BP_ACTIVATELightingScenario_C_BndEvt__BP_LightingScenarioActivator_LightingScenario1_Trigger_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x00F8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_ACTIVATELightingScenario_C_BndEvt__BP_LightingScenarioActivator_LightingScenario1_Trigger_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_ACTIVATELightingScenario_C_BndEvt__BP_LightingScenarioActivator_LightingScenario1_Trigger_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_ACTIVATELightingScenario_C_BndEvt__BP_LightingScenarioActivator_LightingScenario1_Trigger_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000118, "Wrong size on BP_ACTIVATELightingScenario_C_BndEvt__BP_LightingScenarioActivator_LightingScenario1_Trigger_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
