#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AudioCharacter_Manager

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "EFootstepsType_structs.hpp"
#include "ESfxType_structs.hpp"
#include "FAudioCharacter_ExplorationSFXType_structs.hpp"
#include "PhysicsCore_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_AudioCharacter_Manager.BP_AudioCharacter_Manager_C
// 0x0128 (0x01C8 - 0x00A0)
class UBP_AudioCharacter_Manager_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAudioComponent*                        AC_FT_L;                                           // 0x00A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        AC_Foley_01;                                       // 0x00B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        AC_SFX_01;                                         // 0x00B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        AC_Vocal_01;                                       // 0x00C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ABP_jRPG_Character_World_C*             BP_CharacterWorld;                                 // 0x00C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ABP_jRPG_Character_Battle_Base_C*       BP_CharacterBattle;                                // 0x00D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	EFootstepsType                                FootstepsType;                                     // 0x00D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x3];                                       // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   StepPlayed;                                        // 0x00DC(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        AC_Footsteps;                                      // 0x00E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Debug;                                             // 0x00F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundAttenuation*                      ATT_Footsteps;                                     // 0x00F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UBP_DataAsset_CharacterExplorationAudioProfile_C* DataAsset_Exploration;                   // 0x0100(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	ESfxType                                      SfxType;                                           // 0x0108(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFAudioCharacter_ExplorationSFXType    StructureSfxType;                                  // 0x0110(0x0038)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        AC_FT_R;                                           // 0x0148(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        AC_Foley_02;                                       // 0x0150(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        AC_SFX_02;                                         // 0x0158(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        AC_Vocal_02;                                       // 0x0160(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        AC_Idle;                                           // 0x0168(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        ACWeaponR01;                                       // 0x0170(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        ACWeaponR02;                                       // 0x0178(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        ACWeaponL01;                                       // 0x0180(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        ACWeaponL02;                                       // 0x0188(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        ACHandL01;                                         // 0x0190(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        ACHandL02;                                         // 0x0198(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        ACHandR01;                                         // 0x01A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        ACHandR02;                                         // 0x01A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             ExploSoundPlayed;                                  // 0x01B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ABP_jRPG_Enemy_World_Base_Seamless_C*   EnemyRef;                                          // 0x01B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             DefaultFootstep;                                   // 0x01C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void GetFootStepToPlay(const EPhysicalSurface SurfaceType, class USoundBase** Value);
	void SetupDefaultFootstep();
	void HandleFootsteps(const EFootstepsType& FootstepsType_0, struct FVector& Location, EPhysicalSurface SurfaceType);
	void OnCharacterSwitch(class UBP_CharacterData_C* CharacterData);
	void Initialize();
	void HandleSFX(ESfxType SfxType_0);
	void PlayFoleyEvent();
	void PlayVocalEvent();
	void PlaySFXEvent(ESfxType SfxType_0);
	void ResetState();
	void ReceiveBeginPlay();
	void PlayFootstepEvent(const EFootstepsType& FootstepsType_0, const struct FVector& Location, EPhysicalSurface SurfaceType);
	void ExecuteUbergraph_BP_AudioCharacter_Manager(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_AudioCharacter_Manager_C">();
	}
	static class UBP_AudioCharacter_Manager_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_AudioCharacter_Manager_C>();
	}
};
static_assert(alignof(UBP_AudioCharacter_Manager_C) == 0x000008, "Wrong alignment on UBP_AudioCharacter_Manager_C");
static_assert(sizeof(UBP_AudioCharacter_Manager_C) == 0x0001C8, "Wrong size on UBP_AudioCharacter_Manager_C");
static_assert(offsetof(UBP_AudioCharacter_Manager_C, UberGraphFrame) == 0x0000A0, "Member 'UBP_AudioCharacter_Manager_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_AudioCharacter_Manager_C, AC_FT_L) == 0x0000A8, "Member 'UBP_AudioCharacter_Manager_C::AC_FT_L' has a wrong offset!");
static_assert(offsetof(UBP_AudioCharacter_Manager_C, AC_Foley_01) == 0x0000B0, "Member 'UBP_AudioCharacter_Manager_C::AC_Foley_01' has a wrong offset!");
static_assert(offsetof(UBP_AudioCharacter_Manager_C, AC_SFX_01) == 0x0000B8, "Member 'UBP_AudioCharacter_Manager_C::AC_SFX_01' has a wrong offset!");
static_assert(offsetof(UBP_AudioCharacter_Manager_C, AC_Vocal_01) == 0x0000C0, "Member 'UBP_AudioCharacter_Manager_C::AC_Vocal_01' has a wrong offset!");
static_assert(offsetof(UBP_AudioCharacter_Manager_C, BP_CharacterWorld) == 0x0000C8, "Member 'UBP_AudioCharacter_Manager_C::BP_CharacterWorld' has a wrong offset!");
static_assert(offsetof(UBP_AudioCharacter_Manager_C, BP_CharacterBattle) == 0x0000D0, "Member 'UBP_AudioCharacter_Manager_C::BP_CharacterBattle' has a wrong offset!");
static_assert(offsetof(UBP_AudioCharacter_Manager_C, FootstepsType) == 0x0000D8, "Member 'UBP_AudioCharacter_Manager_C::FootstepsType' has a wrong offset!");
static_assert(offsetof(UBP_AudioCharacter_Manager_C, StepPlayed) == 0x0000DC, "Member 'UBP_AudioCharacter_Manager_C::StepPlayed' has a wrong offset!");
static_assert(offsetof(UBP_AudioCharacter_Manager_C, AC_Footsteps) == 0x0000E8, "Member 'UBP_AudioCharacter_Manager_C::AC_Footsteps' has a wrong offset!");
static_assert(offsetof(UBP_AudioCharacter_Manager_C, Debug) == 0x0000F0, "Member 'UBP_AudioCharacter_Manager_C::Debug' has a wrong offset!");
static_assert(offsetof(UBP_AudioCharacter_Manager_C, ATT_Footsteps) == 0x0000F8, "Member 'UBP_AudioCharacter_Manager_C::ATT_Footsteps' has a wrong offset!");
static_assert(offsetof(UBP_AudioCharacter_Manager_C, DataAsset_Exploration) == 0x000100, "Member 'UBP_AudioCharacter_Manager_C::DataAsset_Exploration' has a wrong offset!");
static_assert(offsetof(UBP_AudioCharacter_Manager_C, SfxType) == 0x000108, "Member 'UBP_AudioCharacter_Manager_C::SfxType' has a wrong offset!");
static_assert(offsetof(UBP_AudioCharacter_Manager_C, StructureSfxType) == 0x000110, "Member 'UBP_AudioCharacter_Manager_C::StructureSfxType' has a wrong offset!");
static_assert(offsetof(UBP_AudioCharacter_Manager_C, AC_FT_R) == 0x000148, "Member 'UBP_AudioCharacter_Manager_C::AC_FT_R' has a wrong offset!");
static_assert(offsetof(UBP_AudioCharacter_Manager_C, AC_Foley_02) == 0x000150, "Member 'UBP_AudioCharacter_Manager_C::AC_Foley_02' has a wrong offset!");
static_assert(offsetof(UBP_AudioCharacter_Manager_C, AC_SFX_02) == 0x000158, "Member 'UBP_AudioCharacter_Manager_C::AC_SFX_02' has a wrong offset!");
static_assert(offsetof(UBP_AudioCharacter_Manager_C, AC_Vocal_02) == 0x000160, "Member 'UBP_AudioCharacter_Manager_C::AC_Vocal_02' has a wrong offset!");
static_assert(offsetof(UBP_AudioCharacter_Manager_C, AC_Idle) == 0x000168, "Member 'UBP_AudioCharacter_Manager_C::AC_Idle' has a wrong offset!");
static_assert(offsetof(UBP_AudioCharacter_Manager_C, ACWeaponR01) == 0x000170, "Member 'UBP_AudioCharacter_Manager_C::ACWeaponR01' has a wrong offset!");
static_assert(offsetof(UBP_AudioCharacter_Manager_C, ACWeaponR02) == 0x000178, "Member 'UBP_AudioCharacter_Manager_C::ACWeaponR02' has a wrong offset!");
static_assert(offsetof(UBP_AudioCharacter_Manager_C, ACWeaponL01) == 0x000180, "Member 'UBP_AudioCharacter_Manager_C::ACWeaponL01' has a wrong offset!");
static_assert(offsetof(UBP_AudioCharacter_Manager_C, ACWeaponL02) == 0x000188, "Member 'UBP_AudioCharacter_Manager_C::ACWeaponL02' has a wrong offset!");
static_assert(offsetof(UBP_AudioCharacter_Manager_C, ACHandL01) == 0x000190, "Member 'UBP_AudioCharacter_Manager_C::ACHandL01' has a wrong offset!");
static_assert(offsetof(UBP_AudioCharacter_Manager_C, ACHandL02) == 0x000198, "Member 'UBP_AudioCharacter_Manager_C::ACHandL02' has a wrong offset!");
static_assert(offsetof(UBP_AudioCharacter_Manager_C, ACHandR01) == 0x0001A0, "Member 'UBP_AudioCharacter_Manager_C::ACHandR01' has a wrong offset!");
static_assert(offsetof(UBP_AudioCharacter_Manager_C, ACHandR02) == 0x0001A8, "Member 'UBP_AudioCharacter_Manager_C::ACHandR02' has a wrong offset!");
static_assert(offsetof(UBP_AudioCharacter_Manager_C, ExploSoundPlayed) == 0x0001B0, "Member 'UBP_AudioCharacter_Manager_C::ExploSoundPlayed' has a wrong offset!");
static_assert(offsetof(UBP_AudioCharacter_Manager_C, EnemyRef) == 0x0001B8, "Member 'UBP_AudioCharacter_Manager_C::EnemyRef' has a wrong offset!");
static_assert(offsetof(UBP_AudioCharacter_Manager_C, DefaultFootstep) == 0x0001C0, "Member 'UBP_AudioCharacter_Manager_C::DefaultFootstep' has a wrong offset!");

}

