#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BattleFeedbackState

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_BattleFeedbackState.BP_BattleFeedbackState_C.AddEntry
// 0x0018 (0x0018 - 0x0000)
struct BP_BattleFeedbackState_C_AddEntry final
{
public:
	class ABP_jRPG_Character_Battle_Base_C*       Hero;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_jRPG_Character_Battle_Base_C*       Enemy;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue_1;            // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BattleFeedbackState_C_AddEntry) == 0x000008, "Wrong alignment on BP_BattleFeedbackState_C_AddEntry");
static_assert(sizeof(BP_BattleFeedbackState_C_AddEntry) == 0x000018, "Wrong size on BP_BattleFeedbackState_C_AddEntry");
static_assert(offsetof(BP_BattleFeedbackState_C_AddEntry, Hero) == 0x000000, "Member 'BP_BattleFeedbackState_C_AddEntry::Hero' has a wrong offset!");
static_assert(offsetof(BP_BattleFeedbackState_C_AddEntry, Enemy) == 0x000008, "Member 'BP_BattleFeedbackState_C_AddEntry::Enemy' has a wrong offset!");
static_assert(offsetof(BP_BattleFeedbackState_C_AddEntry, CallFunc_Array_AddUnique_ReturnValue) == 0x000010, "Member 'BP_BattleFeedbackState_C_AddEntry::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleFeedbackState_C_AddEntry, CallFunc_Array_AddUnique_ReturnValue_1) == 0x000014, "Member 'BP_BattleFeedbackState_C_AddEntry::CallFunc_Array_AddUnique_ReturnValue_1' has a wrong offset!");

// Function BP_BattleFeedbackState.BP_BattleFeedbackState_C.IsSet
// 0x0010 (0x0010 - 0x0000)
struct BP_BattleFeedbackState_C_IsSet final
{
public:
	bool                                          IsSet_0;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BattleFeedbackState_C_IsSet) == 0x000004, "Wrong alignment on BP_BattleFeedbackState_C_IsSet");
static_assert(sizeof(BP_BattleFeedbackState_C_IsSet) == 0x000010, "Wrong size on BP_BattleFeedbackState_C_IsSet");
static_assert(offsetof(BP_BattleFeedbackState_C_IsSet, IsSet_0) == 0x000000, "Member 'BP_BattleFeedbackState_C_IsSet::IsSet_0' has a wrong offset!");
static_assert(offsetof(BP_BattleFeedbackState_C_IsSet, CallFunc_Array_Length_ReturnValue) == 0x000004, "Member 'BP_BattleFeedbackState_C_IsSet::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleFeedbackState_C_IsSet, CallFunc_Array_Length_ReturnValue_1) == 0x000008, "Member 'BP_BattleFeedbackState_C_IsSet::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BattleFeedbackState_C_IsSet, CallFunc_Greater_IntInt_ReturnValue) == 0x00000C, "Member 'BP_BattleFeedbackState_C_IsSet::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleFeedbackState_C_IsSet, CallFunc_Greater_IntInt_ReturnValue_1) == 0x00000D, "Member 'BP_BattleFeedbackState_C_IsSet::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BattleFeedbackState_C_IsSet, CallFunc_BooleanAND_ReturnValue) == 0x00000E, "Member 'BP_BattleFeedbackState_C_IsSet::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

}

