#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BattleSummaryStatsManager

#include "Basic.hpp"

#include "S_BattleSummaryStats_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_BattleSummaryStatsManager.BP_BattleSummaryStatsManager_C.BPI_OnAnyCharacterAP_Changed
// 0x0008 (0x0008 - 0x0000)
struct BP_BattleSummaryStatsManager_C_BPI_OnAnyCharacterAP_Changed final
{
public:
	class UBP_BattleEvent_APChange_C*             AP_Change;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BattleSummaryStatsManager_C_BPI_OnAnyCharacterAP_Changed) == 0x000008, "Wrong alignment on BP_BattleSummaryStatsManager_C_BPI_OnAnyCharacterAP_Changed");
static_assert(sizeof(BP_BattleSummaryStatsManager_C_BPI_OnAnyCharacterAP_Changed) == 0x000008, "Wrong size on BP_BattleSummaryStatsManager_C_BPI_OnAnyCharacterAP_Changed");
static_assert(offsetof(BP_BattleSummaryStatsManager_C_BPI_OnAnyCharacterAP_Changed, AP_Change) == 0x000000, "Member 'BP_BattleSummaryStatsManager_C_BPI_OnAnyCharacterAP_Changed::AP_Change' has a wrong offset!");

// Function BP_BattleSummaryStatsManager.BP_BattleSummaryStatsManager_C.BPI_OnAnyCharacterDamaged
// 0x0008 (0x0008 - 0x0000)
struct BP_BattleSummaryStatsManager_C_BPI_OnAnyCharacterDamaged final
{
public:
	class UBP_BattleDamages_C*                    BattleDamage;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BattleSummaryStatsManager_C_BPI_OnAnyCharacterDamaged) == 0x000008, "Wrong alignment on BP_BattleSummaryStatsManager_C_BPI_OnAnyCharacterDamaged");
static_assert(sizeof(BP_BattleSummaryStatsManager_C_BPI_OnAnyCharacterDamaged) == 0x000008, "Wrong size on BP_BattleSummaryStatsManager_C_BPI_OnAnyCharacterDamaged");
static_assert(offsetof(BP_BattleSummaryStatsManager_C_BPI_OnAnyCharacterDamaged, BattleDamage) == 0x000000, "Member 'BP_BattleSummaryStatsManager_C_BPI_OnAnyCharacterDamaged::BattleDamage' has a wrong offset!");

// Function BP_BattleSummaryStatsManager.BP_BattleSummaryStatsManager_C.ExecuteUbergraph_BP_BattleSummaryStatsManager
// 0x00B0 (0x00B0 - 0x0000)
struct BP_BattleSummaryStatsManager_C_ExecuteUbergraph_BP_BattleSummaryStatsManager final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAC_jRPG_CharacterBattleStats_C*        K2Node_Event_CharacterStats_1;                     // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	const class UAction_AddBuff_C*                K2Node_Event_BuffAddAction;                        // 0x0010(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAC_jRPG_CharacterBattleStats_C*        K2Node_Event_CharacterStats;                       // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	const class UBP_DependencyRefCounter_C*       K2Node_Event_TurnStartDependencies;                // 0x0020(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_BattleDamages_C*                    K2Node_Event_BattleDamage;                         // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UBP_BattleEvent_APChange_C*             K2Node_Event_AP_Change;                            // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FDateTime                              CallFunc_Now_ReturnValue;                          // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FDateTime                              CallFunc_Now_ReturnValue_1;                        // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAC_jRPG_CharacterBattleStats_C*        K2Node_Event_TargetCharacter;                      // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAC_jRPG_CharacterBattleStats_C*        K2Node_Event_SourceCharacter;                      // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Event_ReceivedDamages;                      // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_BattleDamages_C*                    K2Node_Event_BattleDamages;                        // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_jRPG_Character_Battle_Base_C*       K2Node_DynamicCast_AsBP_J_RPG_Character_Battle_Base; // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayerTeamCharacter_IsPlayerTeam;       // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x3];                                       // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BattleSummaryStatsManager_C_ExecuteUbergraph_BP_BattleSummaryStatsManager) == 0x000008, "Wrong alignment on BP_BattleSummaryStatsManager_C_ExecuteUbergraph_BP_BattleSummaryStatsManager");
static_assert(sizeof(BP_BattleSummaryStatsManager_C_ExecuteUbergraph_BP_BattleSummaryStatsManager) == 0x0000B0, "Wrong size on BP_BattleSummaryStatsManager_C_ExecuteUbergraph_BP_BattleSummaryStatsManager");
static_assert(offsetof(BP_BattleSummaryStatsManager_C_ExecuteUbergraph_BP_BattleSummaryStatsManager, EntryPoint) == 0x000000, "Member 'BP_BattleSummaryStatsManager_C_ExecuteUbergraph_BP_BattleSummaryStatsManager::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_BattleSummaryStatsManager_C_ExecuteUbergraph_BP_BattleSummaryStatsManager, K2Node_Event_CharacterStats_1) == 0x000008, "Member 'BP_BattleSummaryStatsManager_C_ExecuteUbergraph_BP_BattleSummaryStatsManager::K2Node_Event_CharacterStats_1' has a wrong offset!");
static_assert(offsetof(BP_BattleSummaryStatsManager_C_ExecuteUbergraph_BP_BattleSummaryStatsManager, K2Node_Event_BuffAddAction) == 0x000010, "Member 'BP_BattleSummaryStatsManager_C_ExecuteUbergraph_BP_BattleSummaryStatsManager::K2Node_Event_BuffAddAction' has a wrong offset!");
static_assert(offsetof(BP_BattleSummaryStatsManager_C_ExecuteUbergraph_BP_BattleSummaryStatsManager, K2Node_Event_CharacterStats) == 0x000018, "Member 'BP_BattleSummaryStatsManager_C_ExecuteUbergraph_BP_BattleSummaryStatsManager::K2Node_Event_CharacterStats' has a wrong offset!");
static_assert(offsetof(BP_BattleSummaryStatsManager_C_ExecuteUbergraph_BP_BattleSummaryStatsManager, K2Node_Event_TurnStartDependencies) == 0x000020, "Member 'BP_BattleSummaryStatsManager_C_ExecuteUbergraph_BP_BattleSummaryStatsManager::K2Node_Event_TurnStartDependencies' has a wrong offset!");
static_assert(offsetof(BP_BattleSummaryStatsManager_C_ExecuteUbergraph_BP_BattleSummaryStatsManager, K2Node_Event_BattleDamage) == 0x000028, "Member 'BP_BattleSummaryStatsManager_C_ExecuteUbergraph_BP_BattleSummaryStatsManager::K2Node_Event_BattleDamage' has a wrong offset!");
static_assert(offsetof(BP_BattleSummaryStatsManager_C_ExecuteUbergraph_BP_BattleSummaryStatsManager, K2Node_Event_AP_Change) == 0x000030, "Member 'BP_BattleSummaryStatsManager_C_ExecuteUbergraph_BP_BattleSummaryStatsManager::K2Node_Event_AP_Change' has a wrong offset!");
static_assert(offsetof(BP_BattleSummaryStatsManager_C_ExecuteUbergraph_BP_BattleSummaryStatsManager, CallFunc_Now_ReturnValue) == 0x000038, "Member 'BP_BattleSummaryStatsManager_C_ExecuteUbergraph_BP_BattleSummaryStatsManager::CallFunc_Now_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleSummaryStatsManager_C_ExecuteUbergraph_BP_BattleSummaryStatsManager, CallFunc_Now_ReturnValue_1) == 0x000040, "Member 'BP_BattleSummaryStatsManager_C_ExecuteUbergraph_BP_BattleSummaryStatsManager::CallFunc_Now_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BattleSummaryStatsManager_C_ExecuteUbergraph_BP_BattleSummaryStatsManager, CallFunc_Add_IntInt_ReturnValue) == 0x000048, "Member 'BP_BattleSummaryStatsManager_C_ExecuteUbergraph_BP_BattleSummaryStatsManager::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleSummaryStatsManager_C_ExecuteUbergraph_BP_BattleSummaryStatsManager, K2Node_Event_TargetCharacter) == 0x000050, "Member 'BP_BattleSummaryStatsManager_C_ExecuteUbergraph_BP_BattleSummaryStatsManager::K2Node_Event_TargetCharacter' has a wrong offset!");
static_assert(offsetof(BP_BattleSummaryStatsManager_C_ExecuteUbergraph_BP_BattleSummaryStatsManager, K2Node_Event_SourceCharacter) == 0x000058, "Member 'BP_BattleSummaryStatsManager_C_ExecuteUbergraph_BP_BattleSummaryStatsManager::K2Node_Event_SourceCharacter' has a wrong offset!");
static_assert(offsetof(BP_BattleSummaryStatsManager_C_ExecuteUbergraph_BP_BattleSummaryStatsManager, K2Node_Event_ReceivedDamages) == 0x000060, "Member 'BP_BattleSummaryStatsManager_C_ExecuteUbergraph_BP_BattleSummaryStatsManager::K2Node_Event_ReceivedDamages' has a wrong offset!");
static_assert(offsetof(BP_BattleSummaryStatsManager_C_ExecuteUbergraph_BP_BattleSummaryStatsManager, K2Node_Event_BattleDamages) == 0x000068, "Member 'BP_BattleSummaryStatsManager_C_ExecuteUbergraph_BP_BattleSummaryStatsManager::K2Node_Event_BattleDamages' has a wrong offset!");
static_assert(offsetof(BP_BattleSummaryStatsManager_C_ExecuteUbergraph_BP_BattleSummaryStatsManager, CallFunc_Add_IntInt_ReturnValue_1) == 0x000070, "Member 'BP_BattleSummaryStatsManager_C_ExecuteUbergraph_BP_BattleSummaryStatsManager::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BattleSummaryStatsManager_C_ExecuteUbergraph_BP_BattleSummaryStatsManager, CallFunc_GetOwner_ReturnValue) == 0x000078, "Member 'BP_BattleSummaryStatsManager_C_ExecuteUbergraph_BP_BattleSummaryStatsManager::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleSummaryStatsManager_C_ExecuteUbergraph_BP_BattleSummaryStatsManager, K2Node_DynamicCast_AsBP_J_RPG_Character_Battle_Base) == 0x000080, "Member 'BP_BattleSummaryStatsManager_C_ExecuteUbergraph_BP_BattleSummaryStatsManager::K2Node_DynamicCast_AsBP_J_RPG_Character_Battle_Base' has a wrong offset!");
static_assert(offsetof(BP_BattleSummaryStatsManager_C_ExecuteUbergraph_BP_BattleSummaryStatsManager, K2Node_DynamicCast_bSuccess) == 0x000088, "Member 'BP_BattleSummaryStatsManager_C_ExecuteUbergraph_BP_BattleSummaryStatsManager::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_BattleSummaryStatsManager_C_ExecuteUbergraph_BP_BattleSummaryStatsManager, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000090, "Member 'BP_BattleSummaryStatsManager_C_ExecuteUbergraph_BP_BattleSummaryStatsManager::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleSummaryStatsManager_C_ExecuteUbergraph_BP_BattleSummaryStatsManager, CallFunc_IsPlayerTeamCharacter_IsPlayerTeam) == 0x000098, "Member 'BP_BattleSummaryStatsManager_C_ExecuteUbergraph_BP_BattleSummaryStatsManager::CallFunc_IsPlayerTeamCharacter_IsPlayerTeam' has a wrong offset!");
static_assert(offsetof(BP_BattleSummaryStatsManager_C_ExecuteUbergraph_BP_BattleSummaryStatsManager, Temp_int_Variable) == 0x00009C, "Member 'BP_BattleSummaryStatsManager_C_ExecuteUbergraph_BP_BattleSummaryStatsManager::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_BattleSummaryStatsManager_C_ExecuteUbergraph_BP_BattleSummaryStatsManager, CallFunc_Add_DoubleDouble_ReturnValue_1) == 0x0000A0, "Member 'BP_BattleSummaryStatsManager_C_ExecuteUbergraph_BP_BattleSummaryStatsManager::CallFunc_Add_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BattleSummaryStatsManager_C_ExecuteUbergraph_BP_BattleSummaryStatsManager, Temp_int_Variable_1) == 0x0000A8, "Member 'BP_BattleSummaryStatsManager_C_ExecuteUbergraph_BP_BattleSummaryStatsManager::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_BattleSummaryStatsManager_C_ExecuteUbergraph_BP_BattleSummaryStatsManager, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x0000AC, "Member 'BP_BattleSummaryStatsManager_C_ExecuteUbergraph_BP_BattleSummaryStatsManager::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");

// Function BP_BattleSummaryStatsManager.BP_BattleSummaryStatsManager_C.GetBattleSummaryStats
// 0x0058 (0x0058 - 0x0000)
struct BP_BattleSummaryStatsManager_C_GetBattleSummaryStats final
{
public:
	struct FS_BattleSummaryStats                  BattleSummaryStats;                                // 0x0000(0x0028)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              CallFunc_GetBattleTotalTime_Timespan;              // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FS_BattleSummaryStats                  K2Node_MakeStruct_S_BattleSummaryStats;            // 0x0030(0x0028)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BattleSummaryStatsManager_C_GetBattleSummaryStats) == 0x000008, "Wrong alignment on BP_BattleSummaryStatsManager_C_GetBattleSummaryStats");
static_assert(sizeof(BP_BattleSummaryStatsManager_C_GetBattleSummaryStats) == 0x000058, "Wrong size on BP_BattleSummaryStatsManager_C_GetBattleSummaryStats");
static_assert(offsetof(BP_BattleSummaryStatsManager_C_GetBattleSummaryStats, BattleSummaryStats) == 0x000000, "Member 'BP_BattleSummaryStatsManager_C_GetBattleSummaryStats::BattleSummaryStats' has a wrong offset!");
static_assert(offsetof(BP_BattleSummaryStatsManager_C_GetBattleSummaryStats, CallFunc_GetBattleTotalTime_Timespan) == 0x000028, "Member 'BP_BattleSummaryStatsManager_C_GetBattleSummaryStats::CallFunc_GetBattleTotalTime_Timespan' has a wrong offset!");
static_assert(offsetof(BP_BattleSummaryStatsManager_C_GetBattleSummaryStats, K2Node_MakeStruct_S_BattleSummaryStats) == 0x000030, "Member 'BP_BattleSummaryStatsManager_C_GetBattleSummaryStats::K2Node_MakeStruct_S_BattleSummaryStats' has a wrong offset!");

// Function BP_BattleSummaryStatsManager.BP_BattleSummaryStatsManager_C.GetBattleTotalTime
// 0x0010 (0x0010 - 0x0000)
struct BP_BattleSummaryStatsManager_C_GetBattleTotalTime final
{
public:
	struct FTimespan                              Timespan;                                          // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              CallFunc_Subtract_DateTimeDateTime_ReturnValue;    // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BattleSummaryStatsManager_C_GetBattleTotalTime) == 0x000008, "Wrong alignment on BP_BattleSummaryStatsManager_C_GetBattleTotalTime");
static_assert(sizeof(BP_BattleSummaryStatsManager_C_GetBattleTotalTime) == 0x000010, "Wrong size on BP_BattleSummaryStatsManager_C_GetBattleTotalTime");
static_assert(offsetof(BP_BattleSummaryStatsManager_C_GetBattleTotalTime, Timespan) == 0x000000, "Member 'BP_BattleSummaryStatsManager_C_GetBattleTotalTime::Timespan' has a wrong offset!");
static_assert(offsetof(BP_BattleSummaryStatsManager_C_GetBattleTotalTime, CallFunc_Subtract_DateTimeDateTime_ReturnValue) == 0x000008, "Member 'BP_BattleSummaryStatsManager_C_GetBattleTotalTime::CallFunc_Subtract_DateTimeDateTime_ReturnValue' has a wrong offset!");

// Function BP_BattleSummaryStatsManager.BP_BattleSummaryStatsManager_C.IsTurnStartInProgress
// 0x0001 (0x0001 - 0x0000)
struct BP_BattleSummaryStatsManager_C_IsTurnStartInProgress final
{
public:
	bool                                          InProgress;                                        // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BattleSummaryStatsManager_C_IsTurnStartInProgress) == 0x000001, "Wrong alignment on BP_BattleSummaryStatsManager_C_IsTurnStartInProgress");
static_assert(sizeof(BP_BattleSummaryStatsManager_C_IsTurnStartInProgress) == 0x000001, "Wrong size on BP_BattleSummaryStatsManager_C_IsTurnStartInProgress");
static_assert(offsetof(BP_BattleSummaryStatsManager_C_IsTurnStartInProgress, InProgress) == 0x000000, "Member 'BP_BattleSummaryStatsManager_C_IsTurnStartInProgress::InProgress' has a wrong offset!");

// Function BP_BattleSummaryStatsManager.BP_BattleSummaryStatsManager_C.OnCharacterDealtDamages
// 0x0018 (0x0018 - 0x0000)
struct BP_BattleSummaryStatsManager_C_OnCharacterDealtDamages final
{
public:
	class UAC_jRPG_CharacterBattleStats_C*        CharacterStats;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        Damages;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ProcessedDamages;                                  // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BattleSummaryStatsManager_C_OnCharacterDealtDamages) == 0x000008, "Wrong alignment on BP_BattleSummaryStatsManager_C_OnCharacterDealtDamages");
static_assert(sizeof(BP_BattleSummaryStatsManager_C_OnCharacterDealtDamages) == 0x000018, "Wrong size on BP_BattleSummaryStatsManager_C_OnCharacterDealtDamages");
static_assert(offsetof(BP_BattleSummaryStatsManager_C_OnCharacterDealtDamages, CharacterStats) == 0x000000, "Member 'BP_BattleSummaryStatsManager_C_OnCharacterDealtDamages::CharacterStats' has a wrong offset!");
static_assert(offsetof(BP_BattleSummaryStatsManager_C_OnCharacterDealtDamages, Damages) == 0x000008, "Member 'BP_BattleSummaryStatsManager_C_OnCharacterDealtDamages::Damages' has a wrong offset!");
static_assert(offsetof(BP_BattleSummaryStatsManager_C_OnCharacterDealtDamages, ProcessedDamages) == 0x000010, "Member 'BP_BattleSummaryStatsManager_C_OnCharacterDealtDamages::ProcessedDamages' has a wrong offset!");

// Function BP_BattleSummaryStatsManager.BP_BattleSummaryStatsManager_C.OnCharacterKilled
// 0x0008 (0x0008 - 0x0000)
struct BP_BattleSummaryStatsManager_C_OnCharacterKilled final
{
public:
	class UAC_jRPG_CharacterBattleStats_C*        CharacterStats;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BattleSummaryStatsManager_C_OnCharacterKilled) == 0x000008, "Wrong alignment on BP_BattleSummaryStatsManager_C_OnCharacterKilled");
static_assert(sizeof(BP_BattleSummaryStatsManager_C_OnCharacterKilled) == 0x000008, "Wrong size on BP_BattleSummaryStatsManager_C_OnCharacterKilled");
static_assert(offsetof(BP_BattleSummaryStatsManager_C_OnCharacterKilled, CharacterStats) == 0x000000, "Member 'BP_BattleSummaryStatsManager_C_OnCharacterKilled::CharacterStats' has a wrong offset!");

// Function BP_BattleSummaryStatsManager.BP_BattleSummaryStatsManager_C.OnCharacterReceivedDamages
// 0x0020 (0x0020 - 0x0000)
struct BP_BattleSummaryStatsManager_C_OnCharacterReceivedDamages final
{
public:
	class UAC_jRPG_CharacterBattleStats_C*        TargetCharacter;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAC_jRPG_CharacterBattleStats_C*        SourceCharacter;                                   // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        ReceivedDamages;                                   // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_BattleDamages_C*                    BattleDamages;                                     // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BattleSummaryStatsManager_C_OnCharacterReceivedDamages) == 0x000008, "Wrong alignment on BP_BattleSummaryStatsManager_C_OnCharacterReceivedDamages");
static_assert(sizeof(BP_BattleSummaryStatsManager_C_OnCharacterReceivedDamages) == 0x000020, "Wrong size on BP_BattleSummaryStatsManager_C_OnCharacterReceivedDamages");
static_assert(offsetof(BP_BattleSummaryStatsManager_C_OnCharacterReceivedDamages, TargetCharacter) == 0x000000, "Member 'BP_BattleSummaryStatsManager_C_OnCharacterReceivedDamages::TargetCharacter' has a wrong offset!");
static_assert(offsetof(BP_BattleSummaryStatsManager_C_OnCharacterReceivedDamages, SourceCharacter) == 0x000008, "Member 'BP_BattleSummaryStatsManager_C_OnCharacterReceivedDamages::SourceCharacter' has a wrong offset!");
static_assert(offsetof(BP_BattleSummaryStatsManager_C_OnCharacterReceivedDamages, ReceivedDamages) == 0x000010, "Member 'BP_BattleSummaryStatsManager_C_OnCharacterReceivedDamages::ReceivedDamages' has a wrong offset!");
static_assert(offsetof(BP_BattleSummaryStatsManager_C_OnCharacterReceivedDamages, BattleDamages) == 0x000018, "Member 'BP_BattleSummaryStatsManager_C_OnCharacterReceivedDamages::BattleDamages' has a wrong offset!");

// Function BP_BattleSummaryStatsManager.BP_BattleSummaryStatsManager_C.OnCharacterTurnStart
// 0x0010 (0x0010 - 0x0000)
struct BP_BattleSummaryStatsManager_C_OnCharacterTurnStart final
{
public:
	class UAC_jRPG_CharacterBattleStats_C*        CharacterStats;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	const class UBP_DependencyRefCounter_C*       TurnStartDependencies;                             // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BattleSummaryStatsManager_C_OnCharacterTurnStart) == 0x000008, "Wrong alignment on BP_BattleSummaryStatsManager_C_OnCharacterTurnStart");
static_assert(sizeof(BP_BattleSummaryStatsManager_C_OnCharacterTurnStart) == 0x000010, "Wrong size on BP_BattleSummaryStatsManager_C_OnCharacterTurnStart");
static_assert(offsetof(BP_BattleSummaryStatsManager_C_OnCharacterTurnStart, CharacterStats) == 0x000000, "Member 'BP_BattleSummaryStatsManager_C_OnCharacterTurnStart::CharacterStats' has a wrong offset!");
static_assert(offsetof(BP_BattleSummaryStatsManager_C_OnCharacterTurnStart, TurnStartDependencies) == 0x000008, "Member 'BP_BattleSummaryStatsManager_C_OnCharacterTurnStart::TurnStartDependencies' has a wrong offset!");

// Function BP_BattleSummaryStatsManager.BP_BattleSummaryStatsManager_C.ProcessAddBuffAction
// 0x0008 (0x0008 - 0x0000)
struct BP_BattleSummaryStatsManager_C_ProcessAddBuffAction final
{
public:
	const class UAction_AddBuff_C*                BuffAddAction;                                     // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BattleSummaryStatsManager_C_ProcessAddBuffAction) == 0x000008, "Wrong alignment on BP_BattleSummaryStatsManager_C_ProcessAddBuffAction");
static_assert(sizeof(BP_BattleSummaryStatsManager_C_ProcessAddBuffAction) == 0x000008, "Wrong size on BP_BattleSummaryStatsManager_C_ProcessAddBuffAction");
static_assert(offsetof(BP_BattleSummaryStatsManager_C_ProcessAddBuffAction, BuffAddAction) == 0x000000, "Member 'BP_BattleSummaryStatsManager_C_ProcessAddBuffAction::BuffAddAction' has a wrong offset!");

}

