#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BattleAction_DataAsset

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_BattleAction_DataAsset.BP_BattleAction_DataAsset_C.GetUniqueMechanicIcons
// 0x0010 (0x0010 - 0x0000)
struct BP_BattleAction_DataAsset_C_GetUniqueMechanicIcons final
{
public:
	TArray<class UTexture*>                       Textures;                                          // 0x0000(0x0010)(Parm, OutParm)
};
static_assert(alignof(BP_BattleAction_DataAsset_C_GetUniqueMechanicIcons) == 0x000008, "Wrong alignment on BP_BattleAction_DataAsset_C_GetUniqueMechanicIcons");
static_assert(sizeof(BP_BattleAction_DataAsset_C_GetUniqueMechanicIcons) == 0x000010, "Wrong size on BP_BattleAction_DataAsset_C_GetUniqueMechanicIcons");
static_assert(offsetof(BP_BattleAction_DataAsset_C_GetUniqueMechanicIcons, Textures) == 0x000000, "Member 'BP_BattleAction_DataAsset_C_GetUniqueMechanicIcons::Textures' has a wrong offset!");

// Function BP_BattleAction_DataAsset.BP_BattleAction_DataAsset_C.ModifyNewSkillWheelWidget
// 0x0008 (0x0008 - 0x0000)
struct BP_BattleAction_DataAsset_C_ModifyNewSkillWheelWidget final
{
public:
	class UWBP_HUD_SkillButton_Big_C*             SkillWheelButton;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BattleAction_DataAsset_C_ModifyNewSkillWheelWidget) == 0x000008, "Wrong alignment on BP_BattleAction_DataAsset_C_ModifyNewSkillWheelWidget");
static_assert(sizeof(BP_BattleAction_DataAsset_C_ModifyNewSkillWheelWidget) == 0x000008, "Wrong size on BP_BattleAction_DataAsset_C_ModifyNewSkillWheelWidget");
static_assert(offsetof(BP_BattleAction_DataAsset_C_ModifyNewSkillWheelWidget, SkillWheelButton) == 0x000000, "Member 'BP_BattleAction_DataAsset_C_ModifyNewSkillWheelWidget::SkillWheelButton' has a wrong offset!");

// Function BP_BattleAction_DataAsset.BP_BattleAction_DataAsset_C.ValidateAction
// 0x0008 (0x0008 - 0x0000)
struct BP_BattleAction_DataAsset_C_ValidateAction final
{
public:
	class ABP_jRPG_Character_Battle_Base_C*       CharacterBattle;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BattleAction_DataAsset_C_ValidateAction) == 0x000008, "Wrong alignment on BP_BattleAction_DataAsset_C_ValidateAction");
static_assert(sizeof(BP_BattleAction_DataAsset_C_ValidateAction) == 0x000008, "Wrong size on BP_BattleAction_DataAsset_C_ValidateAction");
static_assert(offsetof(BP_BattleAction_DataAsset_C_ValidateAction, CharacterBattle) == 0x000000, "Member 'BP_BattleAction_DataAsset_C_ValidateAction::CharacterBattle' has a wrong offset!");

}

