#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BlueWhale_Spline

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_BlueWhale_Spline.BP_BlueWhale_Spline_C.Set Meshes initial Transform
// 0x01D0 (0x01D0 - 0x0000)
struct BP_BlueWhale_Spline_C_Set_Meshes_initial_Transform final
{
public:
	double                                        RandomFloat_0;                                     // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetRotationAtDistanceAlongSpline_ReturnValue; // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue; // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0060(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldTransform_SweepHitResult;      // 0x00C0(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_GetRotationAtDistanceAlongSpline_Distance_ImplicitCast; // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetLocationAtDistanceAlongSpline_Distance_ImplicitCast; // 0x01BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_Pitch_ImplicitCast;             // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BlueWhale_Spline_C_Set_Meshes_initial_Transform) == 0x000010, "Wrong alignment on BP_BlueWhale_Spline_C_Set_Meshes_initial_Transform");
static_assert(sizeof(BP_BlueWhale_Spline_C_Set_Meshes_initial_Transform) == 0x0001D0, "Wrong size on BP_BlueWhale_Spline_C_Set_Meshes_initial_Transform");
static_assert(offsetof(BP_BlueWhale_Spline_C_Set_Meshes_initial_Transform, RandomFloat_0) == 0x000000, "Member 'BP_BlueWhale_Spline_C_Set_Meshes_initial_Transform::RandomFloat_0' has a wrong offset!");
static_assert(offsetof(BP_BlueWhale_Spline_C_Set_Meshes_initial_Transform, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x000008, "Member 'BP_BlueWhale_Spline_C_Set_Meshes_initial_Transform::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BlueWhale_Spline_C_Set_Meshes_initial_Transform, CallFunc_GetRotationAtDistanceAlongSpline_ReturnValue) == 0x000020, "Member 'BP_BlueWhale_Spline_C_Set_Meshes_initial_Transform::CallFunc_GetRotationAtDistanceAlongSpline_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BlueWhale_Spline_C_Set_Meshes_initial_Transform, CallFunc_BreakRotator_Roll) == 0x000038, "Member 'BP_BlueWhale_Spline_C_Set_Meshes_initial_Transform::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(BP_BlueWhale_Spline_C_Set_Meshes_initial_Transform, CallFunc_BreakRotator_Pitch) == 0x00003C, "Member 'BP_BlueWhale_Spline_C_Set_Meshes_initial_Transform::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(BP_BlueWhale_Spline_C_Set_Meshes_initial_Transform, CallFunc_BreakRotator_Yaw) == 0x000040, "Member 'BP_BlueWhale_Spline_C_Set_Meshes_initial_Transform::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(BP_BlueWhale_Spline_C_Set_Meshes_initial_Transform, CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue) == 0x000048, "Member 'BP_BlueWhale_Spline_C_Set_Meshes_initial_Transform::CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BlueWhale_Spline_C_Set_Meshes_initial_Transform, CallFunc_MakeTransform_ReturnValue) == 0x000060, "Member 'BP_BlueWhale_Spline_C_Set_Meshes_initial_Transform::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BlueWhale_Spline_C_Set_Meshes_initial_Transform, CallFunc_K2_SetWorldTransform_SweepHitResult) == 0x0000C0, "Member 'BP_BlueWhale_Spline_C_Set_Meshes_initial_Transform::CallFunc_K2_SetWorldTransform_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_BlueWhale_Spline_C_Set_Meshes_initial_Transform, CallFunc_GetRotationAtDistanceAlongSpline_Distance_ImplicitCast) == 0x0001B8, "Member 'BP_BlueWhale_Spline_C_Set_Meshes_initial_Transform::CallFunc_GetRotationAtDistanceAlongSpline_Distance_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_BlueWhale_Spline_C_Set_Meshes_initial_Transform, CallFunc_GetLocationAtDistanceAlongSpline_Distance_ImplicitCast) == 0x0001BC, "Member 'BP_BlueWhale_Spline_C_Set_Meshes_initial_Transform::CallFunc_GetLocationAtDistanceAlongSpline_Distance_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_BlueWhale_Spline_C_Set_Meshes_initial_Transform, K2Node_VariableSet_Pitch_ImplicitCast) == 0x0001C0, "Member 'BP_BlueWhale_Spline_C_Set_Meshes_initial_Transform::K2Node_VariableSet_Pitch_ImplicitCast' has a wrong offset!");

// Function BP_BlueWhale_Spline.BP_BlueWhale_Spline_C.Set Mesh to Distance along Spline
// 0x0600 (0x0600 - 0x0000)
struct BP_BlueWhale_Spline_C_Set_Mesh_to_Distance_along_Spline final
{
public:
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0000(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Square_ReturnValue;                       // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_2;    // 0x0070(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x0088(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_3;    // 0x00A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x00B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x00D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_4;    // 0x00E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_VSize_ReturnValue;                        // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0108(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_1;      // 0x0128(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Square_ReturnValue_1;                     // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_VSize_ReturnValue_1;                      // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Square_ReturnValue_2;                     // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_5;    // 0x0168(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_1;                          // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_1;                          // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_1;                          // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_DegAcos_ReturnValue;                      // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x01A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue_1;           // 0x01C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_2;      // 0x01D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x01F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue_1;                     // 0x0208(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Cross_VectorVector_ReturnValue;           // 0x0220(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_2;                          // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_2;                          // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_2;                          // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue;                         // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_259[0x7];                                      // 0x0259(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue_1;                // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_3;      // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x0280(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_4;      // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_6;    // 0x02A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetWorldDeltaSeconds_ReturnValue_1;       // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue;      // 0x02D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_GetRotationAtDistanceAlongSpline_ReturnValue; // 0x02E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0300(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0304(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0308(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30C[0x4];                                      // 0x030C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue; // 0x0310(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VInterpTo_ReturnValue;                    // 0x0328(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_RInterpTo_ReturnValue;                    // 0x0340(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_358[0x8];                                      // 0x0358(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0360(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetWorldDeltaSeconds_ReturnValue_2;       // 0x03C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldTransform_SweepHitResult;      // 0x03C8(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	double                                        CallFunc_FInterpTo_ReturnValue;                    // 0x04C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x04C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x04E0(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_VInterpTo_DeltaTime_ImplicitCast;         // 0x05D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VInterpTo_InterpSpeed_ImplicitCast;       // 0x05DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RInterpTo_InterpSpeed_ImplicitCast;       // 0x05E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RInterpTo_DeltaTime_ImplicitCast;         // 0x05E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRotationAtDistanceAlongSpline_Distance_ImplicitCast; // 0x05E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetLocationAtDistanceAlongSpline_Distance_ImplicitCast; // 0x05EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_Pitch_ImplicitCast;             // 0x05F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Roll_ImplicitCast;            // 0x05F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BlueWhale_Spline_C_Set_Mesh_to_Distance_along_Spline) == 0x000010, "Wrong alignment on BP_BlueWhale_Spline_C_Set_Mesh_to_Distance_along_Spline");
static_assert(sizeof(BP_BlueWhale_Spline_C_Set_Mesh_to_Distance_along_Spline) == 0x000600, "Wrong size on BP_BlueWhale_Spline_C_Set_Mesh_to_Distance_along_Spline");
static_assert(offsetof(BP_BlueWhale_Spline_C_Set_Mesh_to_Distance_along_Spline, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000000, "Member 'BP_BlueWhale_Spline_C_Set_Mesh_to_Distance_along_Spline::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BlueWhale_Spline_C_Set_Mesh_to_Distance_along_Spline, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000018, "Member 'BP_BlueWhale_Spline_C_Set_Mesh_to_Distance_along_Spline::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BlueWhale_Spline_C_Set_Mesh_to_Distance_along_Spline, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x000020, "Member 'BP_BlueWhale_Spline_C_Set_Mesh_to_Distance_along_Spline::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BlueWhale_Spline_C_Set_Mesh_to_Distance_along_Spline, CallFunc_Square_ReturnValue) == 0x000038, "Member 'BP_BlueWhale_Spline_C_Set_Mesh_to_Distance_along_Spline::CallFunc_Square_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BlueWhale_Spline_C_Set_Mesh_to_Distance_along_Spline, CallFunc_BreakVector_X) == 0x000040, "Member 'BP_BlueWhale_Spline_C_Set_Mesh_to_Distance_along_Spline::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_BlueWhale_Spline_C_Set_Mesh_to_Distance_along_Spline, CallFunc_BreakVector_Y) == 0x000048, "Member 'BP_BlueWhale_Spline_C_Set_Mesh_to_Distance_along_Spline::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_BlueWhale_Spline_C_Set_Mesh_to_Distance_along_Spline, CallFunc_BreakVector_Z) == 0x000050, "Member 'BP_BlueWhale_Spline_C_Set_Mesh_to_Distance_along_Spline::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_BlueWhale_Spline_C_Set_Mesh_to_Distance_along_Spline, CallFunc_MakeVector_ReturnValue) == 0x000058, "Member 'BP_BlueWhale_Spline_C_Set_Mesh_to_Distance_along_Spline::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BlueWhale_Spline_C_Set_Mesh_to_Distance_along_Spline, CallFunc_K2_GetComponentLocation_ReturnValue_2) == 0x000070, "Member 'BP_BlueWhale_Spline_C_Set_Mesh_to_Distance_along_Spline::CallFunc_K2_GetComponentLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BlueWhale_Spline_C_Set_Mesh_to_Distance_along_Spline, CallFunc_GetForwardVector_ReturnValue) == 0x000088, "Member 'BP_BlueWhale_Spline_C_Set_Mesh_to_Distance_along_Spline::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BlueWhale_Spline_C_Set_Mesh_to_Distance_along_Spline, CallFunc_K2_GetComponentLocation_ReturnValue_3) == 0x0000A0, "Member 'BP_BlueWhale_Spline_C_Set_Mesh_to_Distance_along_Spline::CallFunc_K2_GetComponentLocation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_BlueWhale_Spline_C_Set_Mesh_to_Distance_along_Spline, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x0000B8, "Member 'BP_BlueWhale_Spline_C_Set_Mesh_to_Distance_along_Spline::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BlueWhale_Spline_C_Set_Mesh_to_Distance_along_Spline, CallFunc_Subtract_VectorVector_ReturnValue) == 0x0000D0, "Member 'BP_BlueWhale_Spline_C_Set_Mesh_to_Distance_along_Spline::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BlueWhale_Spline_C_Set_Mesh_to_Distance_along_Spline, CallFunc_K2_GetComponentLocation_ReturnValue_4) == 0x0000E8, "Member 'BP_BlueWhale_Spline_C_Set_Mesh_to_Distance_along_Spline::CallFunc_K2_GetComponentLocation_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_BlueWhale_Spline_C_Set_Mesh_to_Distance_along_Spline, CallFunc_VSize_ReturnValue) == 0x000100, "Member 'BP_BlueWhale_Spline_C_Set_Mesh_to_Distance_along_Spline::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BlueWhale_Spline_C_Set_Mesh_to_Distance_along_Spline, CallFunc_Add_VectorVector_ReturnValue) == 0x000108, "Member 'BP_BlueWhale_Spline_C_Set_Mesh_to_Distance_along_Spline::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BlueWhale_Spline_C_Set_Mesh_to_Distance_along_Spline, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000120, "Member 'BP_BlueWhale_Spline_C_Set_Mesh_to_Distance_along_Spline::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BlueWhale_Spline_C_Set_Mesh_to_Distance_along_Spline, CallFunc_Subtract_VectorVector_ReturnValue_1) == 0x000128, "Member 'BP_BlueWhale_Spline_C_Set_Mesh_to_Distance_along_Spline::CallFunc_Subtract_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BlueWhale_Spline_C_Set_Mesh_to_Distance_along_Spline, CallFunc_Square_ReturnValue_1) == 0x000140, "Member 'BP_BlueWhale_Spline_C_Set_Mesh_to_Distance_along_Spline::CallFunc_Square_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BlueWhale_Spline_C_Set_Mesh_to_Distance_along_Spline, CallFunc_VSize_ReturnValue_1) == 0x000148, "Member 'BP_BlueWhale_Spline_C_Set_Mesh_to_Distance_along_Spline::CallFunc_VSize_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BlueWhale_Spline_C_Set_Mesh_to_Distance_along_Spline, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000150, "Member 'BP_BlueWhale_Spline_C_Set_Mesh_to_Distance_along_Spline::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BlueWhale_Spline_C_Set_Mesh_to_Distance_along_Spline, CallFunc_Square_ReturnValue_2) == 0x000158, "Member 'BP_BlueWhale_Spline_C_Set_Mesh_to_Distance_along_Spline::CallFunc_Square_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BlueWhale_Spline_C_Set_Mesh_to_Distance_along_Spline, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000160, "Member 'BP_BlueWhale_Spline_C_Set_Mesh_to_Distance_along_Spline::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BlueWhale_Spline_C_Set_Mesh_to_Distance_along_Spline, CallFunc_K2_GetComponentLocation_ReturnValue_5) == 0x000168, "Member 'BP_BlueWhale_Spline_C_Set_Mesh_to_Distance_along_Spline::CallFunc_K2_GetComponentLocation_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_BlueWhale_Spline_C_Set_Mesh_to_Distance_along_Spline, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000180, "Member 'BP_BlueWhale_Spline_C_Set_Mesh_to_Distance_along_Spline::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BlueWhale_Spline_C_Set_Mesh_to_Distance_along_Spline, CallFunc_BreakVector_X_1) == 0x000188, "Member 'BP_BlueWhale_Spline_C_Set_Mesh_to_Distance_along_Spline::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(BP_BlueWhale_Spline_C_Set_Mesh_to_Distance_along_Spline, CallFunc_BreakVector_Y_1) == 0x000190, "Member 'BP_BlueWhale_Spline_C_Set_Mesh_to_Distance_along_Spline::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(BP_BlueWhale_Spline_C_Set_Mesh_to_Distance_along_Spline, CallFunc_BreakVector_Z_1) == 0x000198, "Member 'BP_BlueWhale_Spline_C_Set_Mesh_to_Distance_along_Spline::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(BP_BlueWhale_Spline_C_Set_Mesh_to_Distance_along_Spline, CallFunc_DegAcos_ReturnValue) == 0x0001A0, "Member 'BP_BlueWhale_Spline_C_Set_Mesh_to_Distance_along_Spline::CallFunc_DegAcos_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BlueWhale_Spline_C_Set_Mesh_to_Distance_along_Spline, CallFunc_MakeVector_ReturnValue_1) == 0x0001A8, "Member 'BP_BlueWhale_Spline_C_Set_Mesh_to_Distance_along_Spline::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BlueWhale_Spline_C_Set_Mesh_to_Distance_along_Spline, CallFunc_GetForwardVector_ReturnValue_1) == 0x0001C0, "Member 'BP_BlueWhale_Spline_C_Set_Mesh_to_Distance_along_Spline::CallFunc_GetForwardVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BlueWhale_Spline_C_Set_Mesh_to_Distance_along_Spline, CallFunc_Subtract_VectorVector_ReturnValue_2) == 0x0001D8, "Member 'BP_BlueWhale_Spline_C_Set_Mesh_to_Distance_along_Spline::CallFunc_Subtract_VectorVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BlueWhale_Spline_C_Set_Mesh_to_Distance_along_Spline, CallFunc_Normal_ReturnValue) == 0x0001F0, "Member 'BP_BlueWhale_Spline_C_Set_Mesh_to_Distance_along_Spline::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BlueWhale_Spline_C_Set_Mesh_to_Distance_along_Spline, CallFunc_Normal_ReturnValue_1) == 0x000208, "Member 'BP_BlueWhale_Spline_C_Set_Mesh_to_Distance_along_Spline::CallFunc_Normal_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BlueWhale_Spline_C_Set_Mesh_to_Distance_along_Spline, CallFunc_Cross_VectorVector_ReturnValue) == 0x000220, "Member 'BP_BlueWhale_Spline_C_Set_Mesh_to_Distance_along_Spline::CallFunc_Cross_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BlueWhale_Spline_C_Set_Mesh_to_Distance_along_Spline, CallFunc_BreakVector_X_2) == 0x000238, "Member 'BP_BlueWhale_Spline_C_Set_Mesh_to_Distance_along_Spline::CallFunc_BreakVector_X_2' has a wrong offset!");
static_assert(offsetof(BP_BlueWhale_Spline_C_Set_Mesh_to_Distance_along_Spline, CallFunc_BreakVector_Y_2) == 0x000240, "Member 'BP_BlueWhale_Spline_C_Set_Mesh_to_Distance_along_Spline::CallFunc_BreakVector_Y_2' has a wrong offset!");
static_assert(offsetof(BP_BlueWhale_Spline_C_Set_Mesh_to_Distance_along_Spline, CallFunc_BreakVector_Z_2) == 0x000248, "Member 'BP_BlueWhale_Spline_C_Set_Mesh_to_Distance_along_Spline::CallFunc_BreakVector_Z_2' has a wrong offset!");
static_assert(offsetof(BP_BlueWhale_Spline_C_Set_Mesh_to_Distance_along_Spline, CallFunc_Lerp_ReturnValue) == 0x000250, "Member 'BP_BlueWhale_Spline_C_Set_Mesh_to_Distance_along_Spline::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BlueWhale_Spline_C_Set_Mesh_to_Distance_along_Spline, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000258, "Member 'BP_BlueWhale_Spline_C_Set_Mesh_to_Distance_along_Spline::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BlueWhale_Spline_C_Set_Mesh_to_Distance_along_Spline, CallFunc_SelectFloat_ReturnValue) == 0x000260, "Member 'BP_BlueWhale_Spline_C_Set_Mesh_to_Distance_along_Spline::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BlueWhale_Spline_C_Set_Mesh_to_Distance_along_Spline, CallFunc_SelectFloat_ReturnValue_1) == 0x000268, "Member 'BP_BlueWhale_Spline_C_Set_Mesh_to_Distance_along_Spline::CallFunc_SelectFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BlueWhale_Spline_C_Set_Mesh_to_Distance_along_Spline, CallFunc_Multiply_DoubleDouble_ReturnValue_2) == 0x000270, "Member 'BP_BlueWhale_Spline_C_Set_Mesh_to_Distance_along_Spline::CallFunc_Multiply_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BlueWhale_Spline_C_Set_Mesh_to_Distance_along_Spline, CallFunc_Multiply_DoubleDouble_ReturnValue_3) == 0x000278, "Member 'BP_BlueWhale_Spline_C_Set_Mesh_to_Distance_along_Spline::CallFunc_Multiply_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_BlueWhale_Spline_C_Set_Mesh_to_Distance_along_Spline, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x000280, "Member 'BP_BlueWhale_Spline_C_Set_Mesh_to_Distance_along_Spline::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BlueWhale_Spline_C_Set_Mesh_to_Distance_along_Spline, CallFunc_Multiply_DoubleDouble_ReturnValue_4) == 0x000298, "Member 'BP_BlueWhale_Spline_C_Set_Mesh_to_Distance_along_Spline::CallFunc_Multiply_DoubleDouble_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_BlueWhale_Spline_C_Set_Mesh_to_Distance_along_Spline, CallFunc_FClamp_ReturnValue) == 0x0002A0, "Member 'BP_BlueWhale_Spline_C_Set_Mesh_to_Distance_along_Spline::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BlueWhale_Spline_C_Set_Mesh_to_Distance_along_Spline, CallFunc_K2_GetComponentLocation_ReturnValue_6) == 0x0002A8, "Member 'BP_BlueWhale_Spline_C_Set_Mesh_to_Distance_along_Spline::CallFunc_K2_GetComponentLocation_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_BlueWhale_Spline_C_Set_Mesh_to_Distance_along_Spline, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x0002C0, "Member 'BP_BlueWhale_Spline_C_Set_Mesh_to_Distance_along_Spline::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BlueWhale_Spline_C_Set_Mesh_to_Distance_along_Spline, CallFunc_GetWorldDeltaSeconds_ReturnValue_1) == 0x0002C8, "Member 'BP_BlueWhale_Spline_C_Set_Mesh_to_Distance_along_Spline::CallFunc_GetWorldDeltaSeconds_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BlueWhale_Spline_C_Set_Mesh_to_Distance_along_Spline, CallFunc_K2_GetComponentRotation_ReturnValue) == 0x0002D0, "Member 'BP_BlueWhale_Spline_C_Set_Mesh_to_Distance_along_Spline::CallFunc_K2_GetComponentRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BlueWhale_Spline_C_Set_Mesh_to_Distance_along_Spline, CallFunc_GetRotationAtDistanceAlongSpline_ReturnValue) == 0x0002E8, "Member 'BP_BlueWhale_Spline_C_Set_Mesh_to_Distance_along_Spline::CallFunc_GetRotationAtDistanceAlongSpline_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BlueWhale_Spline_C_Set_Mesh_to_Distance_along_Spline, CallFunc_BreakRotator_Roll) == 0x000300, "Member 'BP_BlueWhale_Spline_C_Set_Mesh_to_Distance_along_Spline::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(BP_BlueWhale_Spline_C_Set_Mesh_to_Distance_along_Spline, CallFunc_BreakRotator_Pitch) == 0x000304, "Member 'BP_BlueWhale_Spline_C_Set_Mesh_to_Distance_along_Spline::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(BP_BlueWhale_Spline_C_Set_Mesh_to_Distance_along_Spline, CallFunc_BreakRotator_Yaw) == 0x000308, "Member 'BP_BlueWhale_Spline_C_Set_Mesh_to_Distance_along_Spline::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(BP_BlueWhale_Spline_C_Set_Mesh_to_Distance_along_Spline, CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue) == 0x000310, "Member 'BP_BlueWhale_Spline_C_Set_Mesh_to_Distance_along_Spline::CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BlueWhale_Spline_C_Set_Mesh_to_Distance_along_Spline, CallFunc_VInterpTo_ReturnValue) == 0x000328, "Member 'BP_BlueWhale_Spline_C_Set_Mesh_to_Distance_along_Spline::CallFunc_VInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BlueWhale_Spline_C_Set_Mesh_to_Distance_along_Spline, CallFunc_RInterpTo_ReturnValue) == 0x000340, "Member 'BP_BlueWhale_Spline_C_Set_Mesh_to_Distance_along_Spline::CallFunc_RInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BlueWhale_Spline_C_Set_Mesh_to_Distance_along_Spline, CallFunc_MakeTransform_ReturnValue) == 0x000360, "Member 'BP_BlueWhale_Spline_C_Set_Mesh_to_Distance_along_Spline::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BlueWhale_Spline_C_Set_Mesh_to_Distance_along_Spline, CallFunc_GetWorldDeltaSeconds_ReturnValue_2) == 0x0003C0, "Member 'BP_BlueWhale_Spline_C_Set_Mesh_to_Distance_along_Spline::CallFunc_GetWorldDeltaSeconds_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BlueWhale_Spline_C_Set_Mesh_to_Distance_along_Spline, CallFunc_K2_SetWorldTransform_SweepHitResult) == 0x0003C8, "Member 'BP_BlueWhale_Spline_C_Set_Mesh_to_Distance_along_Spline::CallFunc_K2_SetWorldTransform_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_BlueWhale_Spline_C_Set_Mesh_to_Distance_along_Spline, CallFunc_FInterpTo_ReturnValue) == 0x0004C0, "Member 'BP_BlueWhale_Spline_C_Set_Mesh_to_Distance_along_Spline::CallFunc_FInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BlueWhale_Spline_C_Set_Mesh_to_Distance_along_Spline, CallFunc_MakeRotator_ReturnValue) == 0x0004C8, "Member 'BP_BlueWhale_Spline_C_Set_Mesh_to_Distance_along_Spline::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BlueWhale_Spline_C_Set_Mesh_to_Distance_along_Spline, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x0004E0, "Member 'BP_BlueWhale_Spline_C_Set_Mesh_to_Distance_along_Spline::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_BlueWhale_Spline_C_Set_Mesh_to_Distance_along_Spline, CallFunc_VInterpTo_DeltaTime_ImplicitCast) == 0x0005D8, "Member 'BP_BlueWhale_Spline_C_Set_Mesh_to_Distance_along_Spline::CallFunc_VInterpTo_DeltaTime_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_BlueWhale_Spline_C_Set_Mesh_to_Distance_along_Spline, CallFunc_VInterpTo_InterpSpeed_ImplicitCast) == 0x0005DC, "Member 'BP_BlueWhale_Spline_C_Set_Mesh_to_Distance_along_Spline::CallFunc_VInterpTo_InterpSpeed_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_BlueWhale_Spline_C_Set_Mesh_to_Distance_along_Spline, CallFunc_RInterpTo_InterpSpeed_ImplicitCast) == 0x0005E0, "Member 'BP_BlueWhale_Spline_C_Set_Mesh_to_Distance_along_Spline::CallFunc_RInterpTo_InterpSpeed_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_BlueWhale_Spline_C_Set_Mesh_to_Distance_along_Spline, CallFunc_RInterpTo_DeltaTime_ImplicitCast) == 0x0005E4, "Member 'BP_BlueWhale_Spline_C_Set_Mesh_to_Distance_along_Spline::CallFunc_RInterpTo_DeltaTime_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_BlueWhale_Spline_C_Set_Mesh_to_Distance_along_Spline, CallFunc_GetRotationAtDistanceAlongSpline_Distance_ImplicitCast) == 0x0005E8, "Member 'BP_BlueWhale_Spline_C_Set_Mesh_to_Distance_along_Spline::CallFunc_GetRotationAtDistanceAlongSpline_Distance_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_BlueWhale_Spline_C_Set_Mesh_to_Distance_along_Spline, CallFunc_GetLocationAtDistanceAlongSpline_Distance_ImplicitCast) == 0x0005EC, "Member 'BP_BlueWhale_Spline_C_Set_Mesh_to_Distance_along_Spline::CallFunc_GetLocationAtDistanceAlongSpline_Distance_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_BlueWhale_Spline_C_Set_Mesh_to_Distance_along_Spline, K2Node_VariableSet_Pitch_ImplicitCast) == 0x0005F0, "Member 'BP_BlueWhale_Spline_C_Set_Mesh_to_Distance_along_Spline::K2Node_VariableSet_Pitch_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_BlueWhale_Spline_C_Set_Mesh_to_Distance_along_Spline, CallFunc_MakeRotator_Roll_ImplicitCast) == 0x0005F8, "Member 'BP_BlueWhale_Spline_C_Set_Mesh_to_Distance_along_Spline::CallFunc_MakeRotator_Roll_ImplicitCast' has a wrong offset!");

// Function BP_BlueWhale_Spline.BP_BlueWhale_Spline_C.Set LookAt_Front's initial Position
// 0x0008 (0x0008 - 0x0000)
struct BP_BlueWhale_Spline_C_Set_LookAt_Front_s_initial_Position final
{
public:
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BlueWhale_Spline_C_Set_LookAt_Front_s_initial_Position) == 0x000008, "Wrong alignment on BP_BlueWhale_Spline_C_Set_LookAt_Front_s_initial_Position");
static_assert(sizeof(BP_BlueWhale_Spline_C_Set_LookAt_Front_s_initial_Position) == 0x000008, "Wrong size on BP_BlueWhale_Spline_C_Set_LookAt_Front_s_initial_Position");
static_assert(offsetof(BP_BlueWhale_Spline_C_Set_LookAt_Front_s_initial_Position, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000000, "Member 'BP_BlueWhale_Spline_C_Set_LookAt_Front_s_initial_Position::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");

// Function BP_BlueWhale_Spline.BP_BlueWhale_Spline_C.Set Lookat Positions
// 0x00B0 (0x00B0 - 0x0000)
struct BP_BlueWhale_Spline_C_Set_Lookat_Positions final
{
public:
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0000(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue_1;          // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_1;      // 0x0078(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_VSize_ReturnValue;                        // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_VSize_ReturnValue_1;                      // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BlueWhale_Spline_C_Set_Lookat_Positions) == 0x000008, "Wrong alignment on BP_BlueWhale_Spline_C_Set_Lookat_Positions");
static_assert(sizeof(BP_BlueWhale_Spline_C_Set_Lookat_Positions) == 0x0000B0, "Wrong size on BP_BlueWhale_Spline_C_Set_Lookat_Positions");
static_assert(offsetof(BP_BlueWhale_Spline_C_Set_Lookat_Positions, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000000, "Member 'BP_BlueWhale_Spline_C_Set_Lookat_Positions::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BlueWhale_Spline_C_Set_Lookat_Positions, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x000018, "Member 'BP_BlueWhale_Spline_C_Set_Lookat_Positions::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BlueWhale_Spline_C_Set_Lookat_Positions, CallFunc_GetSocketLocation_ReturnValue) == 0x000030, "Member 'BP_BlueWhale_Spline_C_Set_Lookat_Positions::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BlueWhale_Spline_C_Set_Lookat_Positions, CallFunc_GetSocketLocation_ReturnValue_1) == 0x000048, "Member 'BP_BlueWhale_Spline_C_Set_Lookat_Positions::CallFunc_GetSocketLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BlueWhale_Spline_C_Set_Lookat_Positions, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000060, "Member 'BP_BlueWhale_Spline_C_Set_Lookat_Positions::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BlueWhale_Spline_C_Set_Lookat_Positions, CallFunc_Subtract_VectorVector_ReturnValue_1) == 0x000078, "Member 'BP_BlueWhale_Spline_C_Set_Lookat_Positions::CallFunc_Subtract_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BlueWhale_Spline_C_Set_Lookat_Positions, CallFunc_VSize_ReturnValue) == 0x000090, "Member 'BP_BlueWhale_Spline_C_Set_Lookat_Positions::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BlueWhale_Spline_C_Set_Lookat_Positions, CallFunc_VSize_ReturnValue_1) == 0x000098, "Member 'BP_BlueWhale_Spline_C_Set_Lookat_Positions::CallFunc_VSize_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BlueWhale_Spline_C_Set_Lookat_Positions, CallFunc_Add_DoubleDouble_ReturnValue) == 0x0000A0, "Member 'BP_BlueWhale_Spline_C_Set_Lookat_Positions::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BlueWhale_Spline_C_Set_Lookat_Positions, CallFunc_Add_DoubleDouble_ReturnValue_1) == 0x0000A8, "Member 'BP_BlueWhale_Spline_C_Set_Lookat_Positions::CallFunc_Add_DoubleDouble_ReturnValue_1' has a wrong offset!");

// Function BP_BlueWhale_Spline.BP_BlueWhale_Spline_C.Set Initial Speed
// 0x0020 (0x0020 - 0x0000)
struct BP_BlueWhale_Spline_C_Set_Initial_Speed final
{
public:
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BlueWhale_Spline_C_Set_Initial_Speed) == 0x000008, "Wrong alignment on BP_BlueWhale_Spline_C_Set_Initial_Speed");
static_assert(sizeof(BP_BlueWhale_Spline_C_Set_Initial_Speed) == 0x000020, "Wrong size on BP_BlueWhale_Spline_C_Set_Initial_Speed");
static_assert(offsetof(BP_BlueWhale_Spline_C_Set_Initial_Speed, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000000, "Member 'BP_BlueWhale_Spline_C_Set_Initial_Speed::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BlueWhale_Spline_C_Set_Initial_Speed, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000008, "Member 'BP_BlueWhale_Spline_C_Set_Initial_Speed::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BlueWhale_Spline_C_Set_Initial_Speed, CallFunc_Add_DoubleDouble_ReturnValue_1) == 0x000010, "Member 'BP_BlueWhale_Spline_C_Set_Initial_Speed::CallFunc_Add_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BlueWhale_Spline_C_Set_Initial_Speed, CallFunc_Divide_DoubleDouble_ReturnValue_1) == 0x000018, "Member 'BP_BlueWhale_Spline_C_Set_Initial_Speed::CallFunc_Divide_DoubleDouble_ReturnValue_1' has a wrong offset!");

// Function BP_BlueWhale_Spline.BP_BlueWhale_Spline_C.Rotate Bones to LookAt Objects
// 0x04F0 (0x04F0 - 0x0000)
struct BP_BlueWhale_Spline_C_Rotate_Bones_to_LookAt_Objects final
{
public:
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x0000(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetSocketRotation_ReturnValue;            // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue;           // 0x0068(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll_1;                      // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_1;                     // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_1;                       // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_GetSocketRotation_ReturnValue_1;          // 0x0090(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll_2;                      // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_2;                     // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_2;                       // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x00B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_1;      // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetSocketRotation_ReturnValue_2;          // 0x00E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll_3;                      // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_3;                     // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_3;                       // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue_1;          // 0x0108(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_2;      // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue_1;         // 0x0128(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll_4;                      // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_4;                     // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_4;                       // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14C[0x4];                                      // 0x014C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_2;    // 0x0150(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0168(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_GetSocketRotation_ReturnValue_3;          // 0x0180(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll_5;                      // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_5;                     // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_5;                       // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A4[0x4];                                      // 0x01A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue_2;          // 0x01A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_3;      // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue_2;         // 0x01C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll_6;                      // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_6;                     // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_6;                       // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1EC[0x4];                                      // 0x01EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_3;    // 0x01F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_1;                // 0x0208(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_2;                // 0x0220(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_GetSocketRotation_ReturnValue_4;          // 0x0238(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue_3;          // 0x0250(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll_7;                      // 0x0268(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_7;                     // 0x026C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_7;                       // 0x0270(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_274[0x4];                                      // 0x0274(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue_3;         // 0x0278(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_4;      // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll_8;                      // 0x0298(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_8;                     // 0x029C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_8;                       // 0x02A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A4[0x4];                                      // 0x02A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_3;                // 0x02A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_4;    // 0x02C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetSocketRotation_ReturnValue_5;          // 0x02D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll_9;                      // 0x02F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_9;                     // 0x02F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_9;                       // 0x02F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2FC[0x4];                                      // 0x02FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue_4;          // 0x0300(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_5;      // 0x0318(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue_4;         // 0x0320(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
