#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BattleFeedbackState

#include "Basic.hpp"

#include "E_DefenseMoveType_structs.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_BattleFeedbackState.BP_BattleFeedbackState_C
// 0x0028 (0x0050 - 0x0028)
class UBP_BattleFeedbackState_C final : public UObject
{
public:
	TArray<class ABP_jRPG_Character_Battle_Base_C*> Heroes;                                          // 0x0028(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	TArray<class ABP_jRPG_Character_Battle_Base_C*> Enemies;                                         // 0x0038(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	E_DefenseMoveType                             DefenseMoveType;                                   // 0x0048(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void AddEntry(class ABP_jRPG_Character_Battle_Base_C* Hero, class ABP_jRPG_Character_Battle_Base_C* Enemy);
	void Clear();
	void IsSet(bool* IsSet_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_BattleFeedbackState_C">();
	}
	static class UBP_BattleFeedbackState_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_BattleFeedbackState_C>();
	}
};
static_assert(alignof(UBP_BattleFeedbackState_C) == 0x000008, "Wrong alignment on UBP_BattleFeedbackState_C");
static_assert(sizeof(UBP_BattleFeedbackState_C) == 0x000050, "Wrong size on UBP_BattleFeedbackState_C");
static_assert(offsetof(UBP_BattleFeedbackState_C, Heroes) == 0x000028, "Member 'UBP_BattleFeedbackState_C::Heroes' has a wrong offset!");
static_assert(offsetof(UBP_BattleFeedbackState_C, Enemies) == 0x000038, "Member 'UBP_BattleFeedbackState_C::Enemies' has a wrong offset!");
static_assert(offsetof(UBP_BattleFeedbackState_C, DefenseMoveType) == 0x000048, "Member 'UBP_BattleFeedbackState_C::DefenseMoveType' has a wrong offset!");

}

