#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BattleBuff_Flee

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_BattleBuffInstance_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_BattleBuff_Flee.BP_BattleBuff_Flee_C
// 0x0028 (0x0180 - 0x0158)
class UBP_BattleBuff_Flee_C final : public UBP_BattleBuffInstance_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_BattleBuff_Flee_C;               // 0x0158(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UParticleSystemComponent*               Particle_System_Component;                         // 0x0160(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         NumberOfCharactersAliveFleeing;                    // 0x0168(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16C[0x4];                                      // 0x016C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    SoundEventFleeActivation;                          // 0x0170(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)

public:
	void ActivateBuff(const class UAC_jRPG_CharacterBattleStats_C*& CharacterStats);
	void DeactivateBuff();
	void ExecuteUbergraph_BP_BattleBuff_Flee(int32 EntryPoint);
	void FleeSuccessActivation();
	void OnCharacterTurnStart(class UAC_jRPG_CharacterBattleStats_C* CharacterStats, const class UBP_DependencyRefCounter_C*& TurnStartDependencies);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_BattleBuff_Flee_C">();
	}
	static class UBP_BattleBuff_Flee_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_BattleBuff_Flee_C>();
	}
};
static_assert(alignof(UBP_BattleBuff_Flee_C) == 0x000008, "Wrong alignment on UBP_BattleBuff_Flee_C");
static_assert(sizeof(UBP_BattleBuff_Flee_C) == 0x000180, "Wrong size on UBP_BattleBuff_Flee_C");
static_assert(offsetof(UBP_BattleBuff_Flee_C, UberGraphFrame_BP_BattleBuff_Flee_C) == 0x000158, "Member 'UBP_BattleBuff_Flee_C::UberGraphFrame_BP_BattleBuff_Flee_C' has a wrong offset!");
static_assert(offsetof(UBP_BattleBuff_Flee_C, Particle_System_Component) == 0x000160, "Member 'UBP_BattleBuff_Flee_C::Particle_System_Component' has a wrong offset!");
static_assert(offsetof(UBP_BattleBuff_Flee_C, NumberOfCharactersAliveFleeing) == 0x000168, "Member 'UBP_BattleBuff_Flee_C::NumberOfCharactersAliveFleeing' has a wrong offset!");
static_assert(offsetof(UBP_BattleBuff_Flee_C, SoundEventFleeActivation) == 0x000170, "Member 'UBP_BattleBuff_Flee_C::SoundEventFleeActivation' has a wrong offset!");

}

