#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BattleBuffComponent

#include "Basic.hpp"

#include "EAPChangeReason_structs.hpp"
#include "Engine_structs.hpp"
#include "E_StanceType_structs.hpp"
#include "E_BuffAndStatusEffectTypes_structs.hpp"
#include "E_PerfectionUpdateType_structs.hpp"
#include "EPerfectionReason_structs.hpp"


namespace SDK::Params
{

// Function BP_BattleBuffComponent.BP_BattleBuffComponent_C.ActivateBuff
// 0x03D0 (0x03D0 - 0x0000)
struct BP_BattleBuffComponent_C_ActivateBuff final
{
public:
	class UBP_BattleBuffInstance_C*               BuffInstance;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	class UAC_jRPG_CharacterBattleStats_C*        SourceCharacter;                                   // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, InstancedReference, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	class UBP_BattleBuffInstanceWrapper_C*        BuffInstanceWrapper;                               // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Success;                                           // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetGameContentAssetFromCallStackDebugString_DebugString; // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_ObjectToText_ReturnValue;            // 0x0030(0x0010)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0040(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0050(0x0048)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0098(0x0048)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_ObjectToText_ReturnValue_1;          // 0x00E0(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x00F0(0x0048)(HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0140(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0150(0x0010)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0161(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_1;          // 0x0162(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_163[0x1];                                      // 0x0163(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_NameToText_ReturnValue;              // 0x0168(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x0178(0x0048)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_ObjectToText_ReturnValue_2;          // 0x01C0(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_4;            // 0x01D0(0x0048)(HasGetValueTypeHash)
	bool                                          CallFunc_IsReadyToAddBuffs_ReturnValue;            // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0219(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21A[0x6];                                      // 0x021A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_NameToText_ReturnValue_1;            // 0x0220(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_5;            // 0x0230(0x0048)(HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_279[0x7];                                      // 0x0279(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0280(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Format_ReturnValue_1;                     // 0x0290(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x02A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetGameContentAssetFromCallStackDebugString_DebugString_1; // 0x02B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x02C0(0x0010)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_2;          // 0x02D0(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_6;            // 0x02E0(0x0048)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_7;            // 0x0328(0x0048)(HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0370(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_374[0x4];                                      // 0x0374(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_2;                          // 0x0378(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Format_ReturnValue_2;                     // 0x0388(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UAC_jRPG_BattleManager_C*               CallFunc_GetBattleManager_ReturnValue;             // 0x0398(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_AppendStack__Content__Result;             // 0x03A0(0x0010)()
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x03B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x03B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B2[0x6];                                      // 0x03B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_jRPG_Controller_World_C*            CallFunc_GetJRPGControllerWorld_JRPG_Controller;   // 0x03B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_BattleBuffInstanceWrapper_C*        CallFunc_SpawnObject_ReturnValue;                  // 0x03C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AddBuff_Added;                            // 0x03C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BattleBuffComponent_C_ActivateBuff) == 0x000008, "Wrong alignment on BP_BattleBuffComponent_C_ActivateBuff");
static_assert(sizeof(BP_BattleBuffComponent_C_ActivateBuff) == 0x0003D0, "Wrong size on BP_BattleBuffComponent_C_ActivateBuff");
static_assert(offsetof(BP_BattleBuffComponent_C_ActivateBuff, BuffInstance) == 0x000000, "Member 'BP_BattleBuffComponent_C_ActivateBuff::BuffInstance' has a wrong offset!");
static_assert(offsetof(BP_BattleBuffComponent_C_ActivateBuff, SourceCharacter) == 0x000008, "Member 'BP_BattleBuffComponent_C_ActivateBuff::SourceCharacter' has a wrong offset!");
static_assert(offsetof(BP_BattleBuffComponent_C_ActivateBuff, BuffInstanceWrapper) == 0x000010, "Member 'BP_BattleBuffComponent_C_ActivateBuff::BuffInstanceWrapper' has a wrong offset!");
static_assert(offsetof(BP_BattleBuffComponent_C_ActivateBuff, Success) == 0x000018, "Member 'BP_BattleBuffComponent_C_ActivateBuff::Success' has a wrong offset!");
static_assert(offsetof(BP_BattleBuffComponent_C_ActivateBuff, CallFunc_GetGameContentAssetFromCallStackDebugString_DebugString) == 0x000020, "Member 'BP_BattleBuffComponent_C_ActivateBuff::CallFunc_GetGameContentAssetFromCallStackDebugString_DebugString' has a wrong offset!");
static_assert(offsetof(BP_BattleBuffComponent_C_ActivateBuff, CallFunc_Conv_ObjectToText_ReturnValue) == 0x000030, "Member 'BP_BattleBuffComponent_C_ActivateBuff::CallFunc_Conv_ObjectToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleBuffComponent_C_ActivateBuff, CallFunc_Conv_StringToText_ReturnValue) == 0x000040, "Member 'BP_BattleBuffComponent_C_ActivateBuff::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleBuffComponent_C_ActivateBuff, K2Node_MakeStruct_FormatArgumentData) == 0x000050, "Member 'BP_BattleBuffComponent_C_ActivateBuff::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_BattleBuffComponent_C_ActivateBuff, K2Node_MakeStruct_FormatArgumentData_1) == 0x000098, "Member 'BP_BattleBuffComponent_C_ActivateBuff::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BP_BattleBuffComponent_C_ActivateBuff, CallFunc_Conv_ObjectToText_ReturnValue_1) == 0x0000E0, "Member 'BP_BattleBuffComponent_C_ActivateBuff::CallFunc_Conv_ObjectToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BattleBuffComponent_C_ActivateBuff, K2Node_MakeStruct_FormatArgumentData_2) == 0x0000F0, "Member 'BP_BattleBuffComponent_C_ActivateBuff::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(BP_BattleBuffComponent_C_ActivateBuff, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000138, "Member 'BP_BattleBuffComponent_C_ActivateBuff::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleBuffComponent_C_ActivateBuff, K2Node_MakeArray_Array) == 0x000140, "Member 'BP_BattleBuffComponent_C_ActivateBuff::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_BattleBuffComponent_C_ActivateBuff, CallFunc_Format_ReturnValue) == 0x000150, "Member 'BP_BattleBuffComponent_C_ActivateBuff::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleBuffComponent_C_ActivateBuff, CallFunc_IsValid_ReturnValue) == 0x000160, "Member 'BP_BattleBuffComponent_C_ActivateBuff::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleBuffComponent_C_ActivateBuff, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000161, "Member 'BP_BattleBuffComponent_C_ActivateBuff::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleBuffComponent_C_ActivateBuff, CallFunc_NotEqual_ByteByte_ReturnValue_1) == 0x000162, "Member 'BP_BattleBuffComponent_C_ActivateBuff::CallFunc_NotEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BattleBuffComponent_C_ActivateBuff, CallFunc_Add_IntInt_ReturnValue) == 0x000164, "Member 'BP_BattleBuffComponent_C_ActivateBuff::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleBuffComponent_C_ActivateBuff, CallFunc_Conv_NameToText_ReturnValue) == 0x000168, "Member 'BP_BattleBuffComponent_C_ActivateBuff::CallFunc_Conv_NameToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleBuffComponent_C_ActivateBuff, K2Node_MakeStruct_FormatArgumentData_3) == 0x000178, "Member 'BP_BattleBuffComponent_C_ActivateBuff::K2Node_MakeStruct_FormatArgumentData_3' has a wrong offset!");
static_assert(offsetof(BP_BattleBuffComponent_C_ActivateBuff, CallFunc_Conv_ObjectToText_ReturnValue_2) == 0x0001C0, "Member 'BP_BattleBuffComponent_C_ActivateBuff::CallFunc_Conv_ObjectToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BattleBuffComponent_C_ActivateBuff, K2Node_MakeStruct_FormatArgumentData_4) == 0x0001D0, "Member 'BP_BattleBuffComponent_C_ActivateBuff::K2Node_MakeStruct_FormatArgumentData_4' has a wrong offset!");
static_assert(offsetof(BP_BattleBuffComponent_C_ActivateBuff, CallFunc_IsReadyToAddBuffs_ReturnValue) == 0x000218, "Member 'BP_BattleBuffComponent_C_ActivateBuff::CallFunc_IsReadyToAddBuffs_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleBuffComponent_C_ActivateBuff, CallFunc_BooleanOR_ReturnValue) == 0x000219, "Member 'BP_BattleBuffComponent_C_ActivateBuff::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleBuffComponent_C_ActivateBuff, CallFunc_Conv_NameToText_ReturnValue_1) == 0x000220, "Member 'BP_BattleBuffComponent_C_ActivateBuff::CallFunc_Conv_NameToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BattleBuffComponent_C_ActivateBuff, K2Node_MakeStruct_FormatArgumentData_5) == 0x000230, "Member 'BP_BattleBuffComponent_C_ActivateBuff::K2Node_MakeStruct_FormatArgumentData_5' has a wrong offset!");
static_assert(offsetof(BP_BattleBuffComponent_C_ActivateBuff, CallFunc_IsValid_ReturnValue_1) == 0x000278, "Member 'BP_BattleBuffComponent_C_ActivateBuff::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BattleBuffComponent_C_ActivateBuff, K2Node_MakeArray_Array_1) == 0x000280, "Member 'BP_BattleBuffComponent_C_ActivateBuff::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BP_BattleBuffComponent_C_ActivateBuff, CallFunc_Format_ReturnValue_1) == 0x000290, "Member 'BP_BattleBuffComponent_C_ActivateBuff::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BattleBuffComponent_C_ActivateBuff, CallFunc_GetDisplayName_ReturnValue) == 0x0002A0, "Member 'BP_BattleBuffComponent_C_ActivateBuff::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleBuffComponent_C_ActivateBuff, CallFunc_GetGameContentAssetFromCallStackDebugString_DebugString_1) == 0x0002B0, "Member 'BP_BattleBuffComponent_C_ActivateBuff::CallFunc_GetGameContentAssetFromCallStackDebugString_DebugString_1' has a wrong offset!");
static_assert(offsetof(BP_BattleBuffComponent_C_ActivateBuff, CallFunc_Conv_StringToText_ReturnValue_1) == 0x0002C0, "Member 'BP_BattleBuffComponent_C_ActivateBuff::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BattleBuffComponent_C_ActivateBuff, CallFunc_Conv_StringToText_ReturnValue_2) == 0x0002D0, "Member 'BP_BattleBuffComponent_C_ActivateBuff::CallFunc_Conv_StringToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BattleBuffComponent_C_ActivateBuff, K2Node_MakeStruct_FormatArgumentData_6) == 0x0002E0, "Member 'BP_BattleBuffComponent_C_ActivateBuff::K2Node_MakeStruct_FormatArgumentData_6' has a wrong offset!");
static_assert(offsetof(BP_BattleBuffComponent_C_ActivateBuff, K2Node_MakeStruct_FormatArgumentData_7) == 0x000328, "Member 'BP_BattleBuffComponent_C_ActivateBuff::K2Node_MakeStruct_FormatArgumentData_7' has a wrong offset!");
static_assert(offsetof(BP_BattleBuffComponent_C_ActivateBuff, Temp_int_Variable) == 0x000370, "Member 'BP_BattleBuffComponent_C_ActivateBuff::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_BattleBuffComponent_C_ActivateBuff, K2Node_MakeArray_Array_2) == 0x000378, "Member 'BP_BattleBuffComponent_C_ActivateBuff::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(BP_BattleBuffComponent_C_ActivateBuff, CallFunc_Format_ReturnValue_2) == 0x000388, "Member 'BP_BattleBuffComponent_C_ActivateBuff::CallFunc_Format_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BattleBuffComponent_C_ActivateBuff, CallFunc_GetBattleManager_ReturnValue) == 0x000398, "Member 'BP_BattleBuffComponent_C_ActivateBuff::CallFunc_GetBattleManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleBuffComponent_C_ActivateBuff, CallFunc_AppendStack__Content__Result) == 0x0003A0, "Member 'BP_BattleBuffComponent_C_ActivateBuff::CallFunc_AppendStack__Content__Result' has a wrong offset!");
static_assert(offsetof(BP_BattleBuffComponent_C_ActivateBuff, CallFunc_IsValid_ReturnValue_2) == 0x0003B0, "Member 'BP_BattleBuffComponent_C_ActivateBuff::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BattleBuffComponent_C_ActivateBuff, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0003B1, "Member 'BP_BattleBuffComponent_C_ActivateBuff::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleBuffComponent_C_ActivateBuff, CallFunc_GetJRPGControllerWorld_JRPG_Controller) == 0x0003B8, "Member 'BP_BattleBuffComponent_C_ActivateBuff::CallFunc_GetJRPGControllerWorld_JRPG_Controller' has a wrong offset!");
static_assert(offsetof(BP_BattleBuffComponent_C_ActivateBuff, CallFunc_SpawnObject_ReturnValue) == 0x0003C0, "Member 'BP_BattleBuffComponent_C_ActivateBuff::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleBuffComponent_C_ActivateBuff, CallFunc_AddBuff_Added) == 0x0003C8, "Member 'BP_BattleBuffComponent_C_ActivateBuff::CallFunc_AddBuff_Added' has a wrong offset!");

// Function BP_BattleBuffComponent.BP_BattleBuffComponent_C.AddBuff
// 0x02F8 (0x02F8 - 0x0000)
struct BP_BattleBuffComponent_C_AddBuff final
{
public:
	class UBP_BattleBuffInstanceWrapper_C*        BuffInstanceWrapper;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	bool                                          Added;                                             // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_ObjectToText_ReturnValue;            // 0x0010(0x0010)()
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0030(0x0048)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0078(0x0010)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0088(0x0010)(ReferenceParm)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0098(0x0048)(HasGetValueTypeHash)
	class FString                                 CallFunc_Format_ReturnValue;                       // 0x00E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_ObjectToText_ReturnValue_1;          // 0x00F0(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0100(0x0048)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_ObjectToText_ReturnValue_2;          // 0x0148(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x0158(0x0048)(HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A1[0x7];                                      // 0x01A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x01A8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x01B8(0x0010)()
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x01C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1CA[0x6];                                      // 0x01CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_1; // 0x01D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x01E0(0x0010)()
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F1[0x7];                                      // 0x01F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_4;            // 0x01F8(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_2;                          // 0x0240(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Format_ReturnValue_2;                     // 0x0250(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UBP_BattleBuffInstance_AggregatorBase_C* CallFunc_GetOrCreateAggregatorBuff_AggregatorInstance; // 0x0260(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidClass_ReturnValue;                 // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_269[0x3];                                      // 0x0269(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x026C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0271(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_272[0x2];                                      // 0x0272(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0274(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0278(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_27C[0x4];                                      // 0x027C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UBP_BattleBuffInstanceWrapper_C*> CallFunc_FindExistingSameBuffs_ActiveBuffInstanceWrappers; // 0x0280(0x0010)(ReferenceParm)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0290(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_294[0x4];                                      // 0x0294(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_BattleBuffInstanceWrapper_C*        CallFunc_Array_Get_Item;                           // 0x0298(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsNotEmpty_ReturnValue;             // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A1[0x3];                                      // 0x02A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetStackCount_StackCount;                 // 0x02A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A9[0x3];                                      // 0x02A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x02AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B1[0x7];                                      // 0x02B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UBP_BattleBuffInstanceWrapper_C*> CallFunc_FindExistingSameBuffs_ActiveBuffInstanceWrappers_1; // 0x02B8(0x0010)(ReferenceParm)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsEmpty_ReturnValue;                // 0x02C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2CA[0x2];                                      // 0x02CA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x02CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UBP_BattleBuffInstanceWrapper_C*> CallFunc_FindExistingSameBuffs_ActiveBuffInstanceWrappers_2; // 0x02D0(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x02E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E4[0x4];                                      // 0x02E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_BattleBuffInstanceWrapper_C*        CallFunc_Array_Get_Item_1;                         // 0x02E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x02F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveBuffWrapper_Success;                // 0x02F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BattleBuffComponent_C_AddBuff) == 0x000008, "Wrong alignment on BP_BattleBuffComponent_C_AddBuff");
static_assert(sizeof(BP_BattleBuffComponent_C_AddBuff) == 0x0002F8, "Wrong size on BP_BattleBuffComponent_C_AddBuff");
static_assert(offsetof(BP_BattleBuffComponent_C_AddBuff, BuffInstanceWrapper) == 0x000000, "Member 'BP_BattleBuffComponent_C_AddBuff::BuffInstanceWrapper' has a wrong offset!");
static_assert(offsetof(BP_BattleBuffComponent_C_AddBuff, Added) == 0x000008, "Member 'BP_BattleBuffComponent_C_AddBuff::Added' has a wrong offset!");
static_assert(offsetof(BP_BattleBuffComponent_C_AddBuff, CallFunc_Conv_ObjectToText_ReturnValue) == 0x000010, "Member 'BP_BattleBuffComponent_C_AddBuff::CallFunc_Conv_ObjectToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleBuffComponent_C_AddBuff, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x000020, "Member 'BP_BattleBuffComponent_C_AddBuff::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleBuffComponent_C_AddBuff, K2Node_MakeStruct_FormatArgumentData) == 0x000030, "Member 'BP_BattleBuffComponent_C_AddBuff::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_BattleBuffComponent_C_AddBuff, CallFunc_Conv_StringToText_ReturnValue) == 0x000078, "Member 'BP_BattleBuffComponent_C_AddBuff::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleBuffComponent_C_AddBuff, K2Node_MakeArray_Array) == 0x000088, "Member 'BP_BattleBuffComponent_C_AddBuff::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_BattleBuffComponent_C_AddBuff, K2Node_MakeStruct_FormatArgumentData_1) == 0x000098, "Member 'BP_BattleBuffComponent_C_AddBuff::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BP_BattleBuffComponent_C_AddBuff, CallFunc_Format_ReturnValue) == 0x0000E0, "Member 'BP_BattleBuffComponent_C_AddBuff::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleBuffComponent_C_AddBuff, CallFunc_Conv_ObjectToText_ReturnValue_1) == 0x0000F0, "Member 'BP_BattleBuffComponent_C_AddBuff::CallFunc_Conv_ObjectToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BattleBuffComponent_C_AddBuff, K2Node_MakeStruct_FormatArgumentData_2) == 0x000100, "Member 'BP_BattleBuffComponent_C_AddBuff::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(BP_BattleBuffComponent_C_AddBuff, CallFunc_Conv_ObjectToText_ReturnValue_2) == 0x000148, "Member 'BP_BattleBuffComponent_C_AddBuff::CallFunc_Conv_ObjectToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BattleBuffComponent_C_AddBuff, K2Node_MakeStruct_FormatArgumentData_3) == 0x000158, "Member 'BP_BattleBuffComponent_C_AddBuff::K2Node_MakeStruct_FormatArgumentData_3' has a wrong offset!");
static_assert(offsetof(BP_BattleBuffComponent_C_AddBuff, CallFunc_Not_PreBool_ReturnValue) == 0x0001A0, "Member 'BP_BattleBuffComponent_C_AddBuff::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleBuffComponent_C_AddBuff, K2Node_MakeArray_Array_1) == 0x0001A8, "Member 'BP_BattleBuffComponent_C_AddBuff::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BP_BattleBuffComponent_C_AddBuff, CallFunc_Format_ReturnValue_1) == 0x0001B8, "Member 'BP_BattleBuffComponent_C_AddBuff::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BattleBuffComponent_C_AddBuff, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x0001C8, "Member 'BP_BattleBuffComponent_C_AddBuff::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleBuffComponent_C_AddBuff, CallFunc_BooleanAND_ReturnValue) == 0x0001C9, "Member 'BP_BattleBuffComponent_C_AddBuff::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleBuffComponent_C_AddBuff, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_1) == 0x0001D0, "Member 'BP_BattleBuffComponent_C_AddBuff::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BattleBuffComponent_C_AddBuff, CallFunc_Conv_StringToText_ReturnValue_1) == 0x0001E0, "Member 'BP_BattleBuffComponent_C_AddBuff::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BattleBuffComponent_C_AddBuff, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x0001F0, "Member 'BP_BattleBuffComponent_C_AddBuff::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleBuffComponent_C_AddBuff, K2Node_MakeStruct_FormatArgumentData_4) == 0x0001F8, "Member 'BP_BattleBuffComponent_C_AddBuff::K2Node_MakeStruct_FormatArgumentData_4' has a wrong offset!");
static_assert(offsetof(BP_BattleBuffComponent_C_AddBuff, K2Node_MakeArray_Array_2) == 0x000240, "Member 'BP_BattleBuffComponent_C_AddBuff::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(BP_BattleBuffComponent_C_AddBuff, CallFunc_Format_ReturnValue_2) == 0x000250, "Member 'BP_BattleBuffComponent_C_AddBuff::CallFunc_Format_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BattleBuffComponent_C_AddBuff, CallFunc_GetOrCreateAggregatorBuff_AggregatorInstance) == 0x000260, "Member 'BP_BattleBuffComponent_C_AddBuff::CallFunc_GetOrCreateAggregatorBuff_AggregatorInstance' has a wrong offset!");
static_assert(offsetof(BP_BattleBuffComponent_C_AddBuff, CallFunc_IsValidClass_ReturnValue) == 0x000268, "Member 'BP_BattleBuffComponent_C_AddBuff::CallFunc_IsValidClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleBuffComponent_C_AddBuff, Temp_int_Array_Index_Variable) == 0x00026C, "Member 'BP_BattleBuffComponent_C_AddBuff::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_BattleBuffComponent_C_AddBuff, K2Node_SwitchEnum_CmpSuccess) == 0x000270, "Member 'BP_BattleBuffComponent_C_AddBuff::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_BattleBuffComponent_C_AddBuff, CallFunc_IsValid_ReturnValue) == 0x000271, "Member 'BP_BattleBuffComponent_C_AddBuff::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleBuffComponent_C_AddBuff, CallFunc_Array_Add_ReturnValue) == 0x000274, "Member 'BP_BattleBuffComponent_C_AddBuff::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleBuffComponent_C_AddBuff, Temp_int_Loop_Counter_Variable) == 0x000278, "Member 'BP_BattleBuffComponent_C_AddBuff::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_BattleBuffComponent_C_AddBuff, CallFunc_FindExistingSameBuffs_ActiveBuffInstanceWrappers) == 0x000280, "Member 'BP_BattleBuffComponent_C_AddBuff::CallFunc_FindExistingSameBuffs_ActiveBuffInstanceWrappers' has a wrong offset!");
static_assert(offsetof(BP_BattleBuffComponent_C_AddBuff, CallFunc_Add_IntInt_ReturnValue) == 0x000290, "Member 'BP_BattleBuffComponent_C_AddBuff::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleBuffComponent_C_AddBuff, CallFunc_Array_Get_Item) == 0x000298, "Member 'BP_BattleBuffComponent_C_AddBuff::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_BattleBuffComponent_C_AddBuff, CallFunc_Array_IsNotEmpty_ReturnValue) == 0x0002A0, "Member 'BP_BattleBuffComponent_C_AddBuff::CallFunc_Array_IsNotEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleBuffComponent_C_AddBuff, CallFunc_GetStackCount_StackCount) == 0x0002A4, "Member 'BP_BattleBuffComponent_C_AddBuff::CallFunc_GetStackCount_StackCount' has a wrong offset!");
static_assert(offsetof(BP_BattleBuffComponent_C_AddBuff, CallFunc_Less_IntInt_ReturnValue) == 0x0002A8, "Member 'BP_BattleBuffComponent_C_AddBuff::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleBuffComponent_C_AddBuff, CallFunc_Add_IntInt_ReturnValue_1) == 0x0002AC, "Member 'BP_BattleBuffComponent_C_AddBuff::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BattleBuffComponent_C_AddBuff, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x0002B0, "Member 'BP_BattleBuffComponent_C_AddBuff::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleBuffComponent_C_AddBuff, CallFunc_FindExistingSameBuffs_ActiveBuffInstanceWrappers_1) == 0x0002B8, "Member 'BP_BattleBuffComponent_C_AddBuff::CallFunc_FindExistingSameBuffs_ActiveBuffInstanceWrappers_1' has a wrong offset!");
static_assert(offsetof(BP_BattleBuffComponent_C_AddBuff, CallFunc_BooleanOR_ReturnValue) == 0x0002C8, "Member 'BP_BattleBuffComponent_C_AddBuff::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleBuffComponent_C_AddBuff, CallFunc_Array_IsEmpty_ReturnValue) == 0x0002C9, "Member 'BP_BattleBuffComponent_C_AddBuff::CallFunc_Array_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleBuffComponent_C_AddBuff, CallFunc_Array_Add_ReturnValue_1) == 0x0002CC, "Member 'BP_BattleBuffComponent_C_AddBuff::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BattleBuffComponent_C_AddBuff, CallFunc_FindExistingSameBuffs_ActiveBuffInstanceWrappers_2) == 0x0002D0, "Member 'BP_BattleBuffComponent_C_AddBuff::CallFunc_FindExistingSameBuffs_ActiveBuffInstanceWrappers_2' has a wrong offset!");
static_assert(offsetof(BP_BattleBuffComponent_C_AddBuff, CallFunc_Array_Length_ReturnValue) == 0x0002E0, "Member 'BP_BattleBuffComponent_C_AddBuff::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleBuffComponent_C_AddBuff, CallFunc_Array_Get_Item_1) == 0x0002E8, "Member 'BP_BattleBuffComponent_C_AddBuff::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_BattleBuffComponent_C_AddBuff, CallFunc_Less_IntInt_ReturnValue_1) == 0x0002F0, "Member 'BP_BattleBuffComponent_C_AddBuff::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BattleBuffComponent_C_AddBuff, CallFunc_RemoveBuffWrapper_Success) == 0x0002F1, "Member 'BP_BattleBuffComponent_C_AddBuff::CallFunc_RemoveBuffWrapper_Success' has a wrong offset!");

// Function BP_BattleBuffComponent.BP_BattleBuffComponent_C.CreateBuffStack
// 0x0158 (0x0158 - 0x0000)
struct BP_BattleBuffComponent_C_CreateBuffStack final
{
public:
	class UClass*                                 BuffClass;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Count;                                             // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TurnDuration;                                      // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAC_jRPG_CharacterBattleStats_C*        SourceCharacter;                                   // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UBP_BattleBuffInstance_C*>       CreatedInstances;                                  // 0x0018(0x0010)(Parm, OutParm)
	TArray<class UBP_BattleBuffInstance_C*>       local_createdInstances;                            // 0x0028(0x0010)(Edit, BlueprintVisible)
	int32                                         Temp_int_Variable;                                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetClassDisplayName_ReturnValue;          // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0050(0x0010)()
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0068(0x0048)(HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x00B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x00D0(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00E0(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0128(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0138(0x0010)()
	class UBP_BattleBuffInstance_C*               CallFunc_SpawnObject_ReturnValue;                  // 0x0148(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ActivateBuff_Success;                     // 0x0154(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BattleBuffComponent_C_CreateBuffStack) == 0x000008, "Wrong alignment on BP_BattleBuffComponent_C_CreateBuffStack");
static_assert(sizeof(BP_BattleBuffComponent_C_CreateBuffStack) == 0x000158, "Wrong size on BP_BattleBuffComponent_C_CreateBuffStack");
static_assert(offsetof(BP_BattleBuffComponent_C_CreateBuffStack, BuffClass) == 0x000000, "Member 'BP_BattleBuffComponent_C_CreateBuffStack::BuffClass' has a wrong offset!");
static_assert(offsetof(BP_BattleBuffComponent_C_CreateBuffStack, Count) == 0x000008, "Member 'BP_BattleBuffComponent_C_CreateBuffStack::Count' has a wrong offset!");
static_assert(offsetof(BP_BattleBuffComponent_C_CreateBuffStack, TurnDuration) == 0x00000C, "Member 'BP_BattleBuffComponent_C_CreateBuffStack::TurnDuration' has a wrong offset!");
static_assert(offsetof(BP_BattleBuffComponent_C_CreateBuffStack, SourceCharacter) == 0x000010, "Member 'BP_BattleBuffComponent_C_CreateBuffStack::SourceCharacter' has a wrong offset!");
static_assert(offsetof(BP_BattleBuffComponent_C_CreateBuffStack, CreatedInstances) == 0x000018, "Member 'BP_BattleBuffComponent_C_CreateBuffStack::CreatedInstances' has a wrong offset!");
static_assert(offsetof(BP_BattleBuffComponent_C_CreateBuffStack, local_createdInstances) == 0x000028, "Member 'BP_BattleBuffComponent_C_CreateBuffStack::local_createdInstances' has a wrong offset!");
static_assert(offsetof(BP_BattleBuffComponent_C_CreateBuffStack, Temp_int_Variable) == 0x000038, "Member 'BP_BattleBuffComponent_C_CreateBuffStack::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_BattleBuffComponent_C_CreateBuffStack, CallFunc_GetClassDisplayName_ReturnValue) == 0x000040, "Member 'BP_BattleBuffComponent_C_CreateBuffStack::CallFunc_GetClassDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleBuffComponent_C_CreateBuffStack, CallFunc_Conv_StringToText_ReturnValue) == 0x000050, "Member 'BP_BattleBuffComponent_C_CreateBuffStack::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleBuffComponent_C_CreateBuffStack, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000060, "Member 'BP_BattleBuffComponent_C_CreateBuffStack::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleBuffComponent_C_CreateBuffStack, K2Node_MakeStruct_FormatArgumentData) == 0x000068, "Member 'BP_BattleBuffComponent_C_CreateBuffStack::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_BattleBuffComponent_C_CreateBuffStack, CallFunc_Add_IntInt_ReturnValue) == 0x0000B0, "Member 'BP_BattleBuffComponent_C_CreateBuffStack::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleBuffComponent_C_CreateBuffStack, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x0000B8, "Member 'BP_BattleBuffComponent_C_CreateBuffStack::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleBuffComponent_C_CreateBuffStack, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000C8, "Member 'BP_BattleBuffComponent_C_CreateBuffStack::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleBuffComponent_C_CreateBuffStack, CallFunc_Conv_StringToText_ReturnValue_1) == 0x0000D0, "Member 'BP_BattleBuffComponent_C_CreateBuffStack::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BattleBuffComponent_C_CreateBuffStack, K2Node_MakeStruct_FormatArgumentData_1) == 0x0000E0, "Member 'BP_BattleBuffComponent_C_CreateBuffStack::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BP_BattleBuffComponent_C_CreateBuffStack, K2Node_MakeArray_Array) == 0x000128, "Member 'BP_BattleBuffComponent_C_CreateBuffStack::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_BattleBuffComponent_C_CreateBuffStack, CallFunc_Format_ReturnValue) == 0x000138, "Member 'BP_BattleBuffComponent_C_CreateBuffStack::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleBuffComponent_C_CreateBuffStack, CallFunc_SpawnObject_ReturnValue) == 0x000148, "Member 'BP_BattleBuffComponent_C_CreateBuffStack::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleBuffComponent_C_CreateBuffStack, CallFunc_Array_Add_ReturnValue) == 0x000150, "Member 'BP_BattleBuffComponent_C_CreateBuffStack::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleBuffComponent_C_CreateBuffStack, CallFunc_ActivateBuff_Success) == 0x000154, "Member 'BP_BattleBuffComponent_C_CreateBuffStack::CallFunc_ActivateBuff_Success' has a wrong offset!");

// Function BP_BattleBuffComponent.BP_BattleBuffComponent_C.DeactivateOnOwnerKilled
// 0x0050 (0x0050 - 0x0000)
struct BP_BattleBuffComponent_C_DeactivateOnOwnerKilled final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UBP_BattleBuffInstanceWrapper_C*> Temp_wildcard_Variable;                           // 0x0008(0x0010)(ReferenceParm)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_BattleBuffInstanceWrapper_C*        CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveBuffWrapper_Success;                // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsChildOfClass_ReturnValue;               // 0x002E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldKeepOnDeath_Keep;                   // 0x002F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33[0x1];                                       // 0x0033(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Max_ReturnValue;                          // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BattleBuffComponent_C_DeactivateOnOwnerKilled) == 0x000008, "Wrong alignment on BP_BattleBuffComponent_C_DeactivateOnOwnerKilled");
static_assert(sizeof(BP_BattleBuffComponent_C_DeactivateOnOwnerKilled) == 0x000050, "Wrong size on BP_BattleBuffComponent_C_DeactivateOnOwnerKilled");
static_assert(offsetof(BP_BattleBuffComponent_C_DeactivateOnOwnerKilled, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BP_BattleBuffComponent_C_DeactivateOnOwnerKilled::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_BattleBuffComponent_C_DeactivateOnOwnerKilled, Temp_wildcard_Variable) == 0x000008, "Member 'BP_BattleBuffComponent_C_DeactivateOnOwnerKilled::Temp_wildcard_Variable' has a wrong offset!");
static_assert(offsetof(BP_BattleBuffComponent_C_DeactivateOnOwnerKilled, Temp_int_Loop_Counter_Variable) == 0x000018, "Member 'BP_BattleBuffComponent_C_DeactivateOnOwnerKilled::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_BattleBuffComponent_C_DeactivateOnOwnerKilled, CallFunc_Array_Get_Item) == 0x000020, "Member 'BP_BattleBuffComponent_C_DeactivateOnOwnerKilled::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_BattleBuffComponent_C_DeactivateOnOwnerKilled, CallFunc_Subtract_IntInt_ReturnValue) == 0x000028, "Member 'BP_BattleBuffComponent_C_DeactivateOnOwnerKilled::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleBuffComponent_C_DeactivateOnOwnerKilled, CallFunc_RemoveBuffWrapper_Success) == 0x00002C, "Member 'BP_BattleBuffComponent_C_DeactivateOnOwnerKilled::CallFunc_RemoveBuffWrapper_Success' has a wrong offset!");
static_assert(offsetof(BP_BattleBuffComponent_C_DeactivateOnOwnerKilled, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x00002D, "Member 'BP_BattleBuffComponent_C_DeactivateOnOwnerKilled::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleBuffComponent_C_DeactivateOnOwnerKilled, CallFunc_IsChildOfClass_ReturnValue) == 0x00002E, "Member 'BP_BattleBuffComponent_C_DeactivateOnOwnerKilled::CallFunc_IsChildOfClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleBuffComponent_C_DeactivateOnOwnerKilled, CallFunc_ShouldKeepOnDeath_Keep) == 0x00002F, "Member 'BP_BattleBuffComponent_C_DeactivateOnOwnerKilled::CallFunc_ShouldKeepOnDeath_Keep' has a wrong offset!");
static_assert(offsetof(BP_BattleBuffComponent_C_DeactivateOnOwnerKilled, CallFunc_Not_PreBool_ReturnValue) == 0x000030, "Member 'BP_BattleBuffComponent_C_DeactivateOnOwnerKilled::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleBuffComponent_C_DeactivateOnOwnerKilled, CallFunc_Not_PreBool_ReturnValue_1) == 0x000031, "Member 'BP_BattleBuffComponent_C_DeactivateOnOwnerKilled::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BattleBuffComponent_C_DeactivateOnOwnerKilled, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000032, "Member 'BP_BattleBuffComponent_C_DeactivateOnOwnerKilled::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleBuffComponent_C_DeactivateOnOwnerKilled, CallFunc_Array_Length_ReturnValue) == 0x000034, "Member 'BP_BattleBuffComponent_C_DeactivateOnOwnerKilled::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleBuffComponent_C_DeactivateOnOwnerKilled, CallFunc_BooleanAND_ReturnValue) == 0x000038, "Member 'BP_BattleBuffComponent_C_DeactivateOnOwnerKilled::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleBuffComponent_C_DeactivateOnOwnerKilled, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x00003C, "Member 'BP_BattleBuffComponent_C_DeactivateOnOwnerKilled::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BattleBuffComponent_C_DeactivateOnOwnerKilled, CallFunc_BooleanOR_ReturnValue) == 0x000040, "Member 'BP_BattleBuffComponent_C_DeactivateOnOwnerKilled::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleBuffComponent_C_DeactivateOnOwnerKilled, CallFunc_Max_ReturnValue) == 0x000044, "Member 'BP_BattleBuffComponent_C_DeactivateOnOwnerKilled::CallFunc_Max_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleBuffComponent_C_DeactivateOnOwnerKilled, CallFunc_BooleanOR_ReturnValue_1) == 0x000048, "Member 'BP_BattleBuffComponent_C_DeactivateOnOwnerKilled::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");

// Function BP_BattleBuffComponent.BP_BattleBuffComponent_C.ExecuteUbergraph_BP_BattleBuffComponent
// 0x0004 (0x0004 - 0x0000)
struct BP_BattleBuffComponent_C_ExecuteUbergraph_BP_BattleBuffComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BattleBuffComponent_C_ExecuteUbergraph_BP_BattleBuffComponent) == 0x000004, "Wrong alignment on BP_BattleBuffComponent_C_ExecuteUbergraph_BP_BattleBuffComponent");
static_assert(sizeof(BP_BattleBuffComponent_C_ExecuteUbergraph_BP_BattleBuffComponent) == 0x000004, "Wrong size on BP_BattleBuffComponent_C_ExecuteUbergraph_BP_BattleBuffComponent");
static_assert(offsetof(BP_BattleBuffComponent_C_ExecuteUbergraph_BP_BattleBuffComponent, EntryPoint) == 0x000000, "Member 'BP_BattleBuffComponent_C_ExecuteUbergraph_BP_BattleBuffComponent::EntryPoint' has a wrong offset!");

// Function BP_BattleBuffComponent.BP_BattleBuffComponent_C.FindActiveBuffsByInstigator
// 0x0088 (0x0088 - 0x0000)
struct BP_BattleBuffComponent_C_FindActiveBuffsByInstigator final
{
public:
	class UObject*                                Instigator;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 BuffClass;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UBP_BattleBuffInstance_C*>       BuffInstances;                                     // 0x0010(0x0010)(Parm, OutParm)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UBP_BattleBuffInstanceWrapper_C*> CallFunc_GetActiveBuffsByClass_ActiveBuffInstanceWrappers; // 0x0028(0x0010)(ReferenceParm)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
