#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BattleBuff_BurnAggregator

#include "Basic.hpp"

#include "ECharacterTeamSelector_structs.hpp"
#include "Engine_structs.hpp"
#include "BP_BattleBuffInstance_AggregatorBase_classes.hpp"
#include "E_jRPG_StatType_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_BattleBuff_BurnAggregator.BP_BattleBuff_BurnAggregator_C
// 0x0030 (0x01A8 - 0x0178)
class UBP_BattleBuff_BurnAggregator_C final : public UBP_BattleBuffInstance_AggregatorBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_BattleBuff_BurnAggregator_C;     // 0x0178(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	double                                        BurnDamageMultiplier;                              // 0x0180(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWBP_Buff_Burn_StackCounter_C*>  BurnCounterWidgets;                                // 0x0188(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class UAudioComponent*                        Sound_Fire_loop;                                   // 0x0198(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      Niagara_System;                                    // 0x01A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void ActivateBuff(const class UAC_jRPG_CharacterBattleStats_C*& CharacterStats);
	void Compute_Burn_Damage_Total(double* TotalDamage);
	void DeactivateBuff();
	void Event_Play_Sound_Feedback();
	void ExecuteUbergraph_BP_BattleBuff_BurnAggregator(int32 EntryPoint);
	void InitializeCustomBuffWidget(class UWBP_jRPG_BuffSlot_C* BuffWidget, bool* DummyOut);
	void OnCharacterTurnStart(class UAC_jRPG_CharacterBattleStats_C* CharacterStats, const class UBP_DependencyRefCounter_C*& TurnStartDependencies);
	void OnChildBuffInstanceAdded();
	void OnChildBuffInstanceRemoved();
	void OnChildBuffInstanceStackChanged(class UBP_BattleBuffInstance_C* BuffInstance);
	void OnVisualEffectDimChange(bool IsDimmed);
	void RefreshBurnCounterWidget();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_BattleBuff_BurnAggregator_C">();
	}
	static class UBP_BattleBuff_BurnAggregator_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_BattleBuff_BurnAggregator_C>();
	}
};
static_assert(alignof(UBP_BattleBuff_BurnAggregator_C) == 0x000008, "Wrong alignment on UBP_BattleBuff_BurnAggregator_C");
static_assert(sizeof(UBP_BattleBuff_BurnAggregator_C) == 0x0001A8, "Wrong size on UBP_BattleBuff_BurnAggregator_C");
static_assert(offsetof(UBP_BattleBuff_BurnAggregator_C, UberGraphFrame_BP_BattleBuff_BurnAggregator_C) == 0x000178, "Member 'UBP_BattleBuff_BurnAggregator_C::UberGraphFrame_BP_BattleBuff_BurnAggregator_C' has a wrong offset!");
static_assert(offsetof(UBP_BattleBuff_BurnAggregator_C, BurnDamageMultiplier) == 0x000180, "Member 'UBP_BattleBuff_BurnAggregator_C::BurnDamageMultiplier' has a wrong offset!");
static_assert(offsetof(UBP_BattleBuff_BurnAggregator_C, BurnCounterWidgets) == 0x000188, "Member 'UBP_BattleBuff_BurnAggregator_C::BurnCounterWidgets' has a wrong offset!");
static_assert(offsetof(UBP_BattleBuff_BurnAggregator_C, Sound_Fire_loop) == 0x000198, "Member 'UBP_BattleBuff_BurnAggregator_C::Sound_Fire_loop' has a wrong offset!");
static_assert(offsetof(UBP_BattleBuff_BurnAggregator_C, Niagara_System) == 0x0001A0, "Member 'UBP_BattleBuff_BurnAggregator_C::Niagara_System' has a wrong offset!");

}

