#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BattleBuffInstance_AggregatorBase

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_BattleBuffInstance_AggregatorBase.BP_BattleBuffInstance_AggregatorBase_C.OnChildBuffInstanceStackChanged
// 0x0008 (0x0008 - 0x0000)
struct BP_BattleBuffInstance_AggregatorBase_C_OnChildBuffInstanceStackChanged final
{
public:
	class UBP_BattleBuffInstance_C*               BuffInstance;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BattleBuffInstance_AggregatorBase_C_OnChildBuffInstanceStackChanged) == 0x000008, "Wrong alignment on BP_BattleBuffInstance_AggregatorBase_C_OnChildBuffInstanceStackChanged");
static_assert(sizeof(BP_BattleBuffInstance_AggregatorBase_C_OnChildBuffInstanceStackChanged) == 0x000008, "Wrong size on BP_BattleBuffInstance_AggregatorBase_C_OnChildBuffInstanceStackChanged");
static_assert(offsetof(BP_BattleBuffInstance_AggregatorBase_C_OnChildBuffInstanceStackChanged, BuffInstance) == 0x000000, "Member 'BP_BattleBuffInstance_AggregatorBase_C_OnChildBuffInstanceStackChanged::BuffInstance' has a wrong offset!");

// Function BP_BattleBuffInstance_AggregatorBase.BP_BattleBuffInstance_AggregatorBase_C.GetDamageSourceCharacter
// 0x0010 (0x0010 - 0x0000)
struct BP_BattleBuffInstance_AggregatorBase_C_GetDamageSourceCharacter final
{
public:
	class UAC_jRPG_CharacterBattleStats_C*        CharacterStats;                                    // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UBP_BattleBuffInstance_C*               CallFunc_Array_Get_Item;                           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BattleBuffInstance_AggregatorBase_C_GetDamageSourceCharacter) == 0x000008, "Wrong alignment on BP_BattleBuffInstance_AggregatorBase_C_GetDamageSourceCharacter");
static_assert(sizeof(BP_BattleBuffInstance_AggregatorBase_C_GetDamageSourceCharacter) == 0x000010, "Wrong size on BP_BattleBuffInstance_AggregatorBase_C_GetDamageSourceCharacter");
static_assert(offsetof(BP_BattleBuffInstance_AggregatorBase_C_GetDamageSourceCharacter, CharacterStats) == 0x000000, "Member 'BP_BattleBuffInstance_AggregatorBase_C_GetDamageSourceCharacter::CharacterStats' has a wrong offset!");
static_assert(offsetof(BP_BattleBuffInstance_AggregatorBase_C_GetDamageSourceCharacter, CallFunc_Array_Get_Item) == 0x000008, "Member 'BP_BattleBuffInstance_AggregatorBase_C_GetDamageSourceCharacter::CallFunc_Array_Get_Item' has a wrong offset!");

// Function BP_BattleBuffInstance_AggregatorBase.BP_BattleBuffInstance_AggregatorBase_C.ComputeAggregatorStackCount
// 0x0030 (0x0030 - 0x0000)
struct BP_BattleBuffInstance_AggregatorBase_C_ComputeAggregatorStackCount final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         local_sum;                                         // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_BattleBuffInstance_C*               CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetStackCount_StackCount;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BattleBuffInstance_AggregatorBase_C_ComputeAggregatorStackCount) == 0x000008, "Wrong alignment on BP_BattleBuffInstance_AggregatorBase_C_ComputeAggregatorStackCount");
static_assert(sizeof(BP_BattleBuffInstance_AggregatorBase_C_ComputeAggregatorStackCount) == 0x000030, "Wrong size on BP_BattleBuffInstance_AggregatorBase_C_ComputeAggregatorStackCount");
static_assert(offsetof(BP_BattleBuffInstance_AggregatorBase_C_ComputeAggregatorStackCount, ReturnValue) == 0x000000, "Member 'BP_BattleBuffInstance_AggregatorBase_C_ComputeAggregatorStackCount::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleBuffInstance_AggregatorBase_C_ComputeAggregatorStackCount, local_sum) == 0x000004, "Member 'BP_BattleBuffInstance_AggregatorBase_C_ComputeAggregatorStackCount::local_sum' has a wrong offset!");
static_assert(offsetof(BP_BattleBuffInstance_AggregatorBase_C_ComputeAggregatorStackCount, Temp_int_Array_Index_Variable) == 0x000008, "Member 'BP_BattleBuffInstance_AggregatorBase_C_ComputeAggregatorStackCount::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_BattleBuffInstance_AggregatorBase_C_ComputeAggregatorStackCount, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'BP_BattleBuffInstance_AggregatorBase_C_ComputeAggregatorStackCount::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_BattleBuffInstance_AggregatorBase_C_ComputeAggregatorStackCount, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'BP_BattleBuffInstance_AggregatorBase_C_ComputeAggregatorStackCount::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleBuffInstance_AggregatorBase_C_ComputeAggregatorStackCount, CallFunc_Array_Length_ReturnValue) == 0x000014, "Member 'BP_BattleBuffInstance_AggregatorBase_C_ComputeAggregatorStackCount::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleBuffInstance_AggregatorBase_C_ComputeAggregatorStackCount, CallFunc_Array_Get_Item) == 0x000018, "Member 'BP_BattleBuffInstance_AggregatorBase_C_ComputeAggregatorStackCount::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_BattleBuffInstance_AggregatorBase_C_ComputeAggregatorStackCount, CallFunc_Less_IntInt_ReturnValue) == 0x000020, "Member 'BP_BattleBuffInstance_AggregatorBase_C_ComputeAggregatorStackCount::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleBuffInstance_AggregatorBase_C_ComputeAggregatorStackCount, CallFunc_GetStackCount_StackCount) == 0x000024, "Member 'BP_BattleBuffInstance_AggregatorBase_C_ComputeAggregatorStackCount::CallFunc_GetStackCount_StackCount' has a wrong offset!");
static_assert(offsetof(BP_BattleBuffInstance_AggregatorBase_C_ComputeAggregatorStackCount, CallFunc_Add_IntInt_ReturnValue_1) == 0x000028, "Member 'BP_BattleBuffInstance_AggregatorBase_C_ComputeAggregatorStackCount::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");

// Function BP_BattleBuffInstance_AggregatorBase.BP_BattleBuffInstance_AggregatorBase_C.GetBuffDisplayName
// 0x00E0 (0x00E0 - 0x0000)
struct BP_BattleBuffInstance_AggregatorBase_C_GetBuffDisplayName final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm)
	int32                                         local_sum;                                         // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_ComputeAggregatorStackCount_ReturnValue;  // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetBuffDisplayName_ReturnValue;           // 0x0018(0x0010)()
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0030(0x0048)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0078(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00C0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00D0(0x0010)()
};
static_assert(alignof(BP_BattleBuffInstance_AggregatorBase_C_GetBuffDisplayName) == 0x000008, "Wrong alignment on BP_BattleBuffInstance_AggregatorBase_C_GetBuffDisplayName");
static_assert(sizeof(BP_BattleBuffInstance_AggregatorBase_C_GetBuffDisplayName) == 0x0000E0, "Wrong size on BP_BattleBuffInstance_AggregatorBase_C_GetBuffDisplayName");
static_assert(offsetof(BP_BattleBuffInstance_AggregatorBase_C_GetBuffDisplayName, ReturnValue) == 0x000000, "Member 'BP_BattleBuffInstance_AggregatorBase_C_GetBuffDisplayName::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleBuffInstance_AggregatorBase_C_GetBuffDisplayName, local_sum) == 0x000010, "Member 'BP_BattleBuffInstance_AggregatorBase_C_GetBuffDisplayName::local_sum' has a wrong offset!");
static_assert(offsetof(BP_BattleBuffInstance_AggregatorBase_C_GetBuffDisplayName, CallFunc_ComputeAggregatorStackCount_ReturnValue) == 0x000014, "Member 'BP_BattleBuffInstance_AggregatorBase_C_GetBuffDisplayName::CallFunc_ComputeAggregatorStackCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleBuffInstance_AggregatorBase_C_GetBuffDisplayName, CallFunc_GetBuffDisplayName_ReturnValue) == 0x000018, "Member 'BP_BattleBuffInstance_AggregatorBase_C_GetBuffDisplayName::CallFunc_GetBuffDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleBuffInstance_AggregatorBase_C_GetBuffDisplayName, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000028, "Member 'BP_BattleBuffInstance_AggregatorBase_C_GetBuffDisplayName::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleBuffInstance_AggregatorBase_C_GetBuffDisplayName, K2Node_MakeStruct_FormatArgumentData) == 0x000030, "Member 'BP_BattleBuffInstance_AggregatorBase_C_GetBuffDisplayName::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_BattleBuffInstance_AggregatorBase_C_GetBuffDisplayName, K2Node_MakeStruct_FormatArgumentData_1) == 0x000078, "Member 'BP_BattleBuffInstance_AggregatorBase_C_GetBuffDisplayName::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BP_BattleBuffInstance_AggregatorBase_C_GetBuffDisplayName, K2Node_MakeArray_Array) == 0x0000C0, "Member 'BP_BattleBuffInstance_AggregatorBase_C_GetBuffDisplayName::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_BattleBuffInstance_AggregatorBase_C_GetBuffDisplayName, CallFunc_Format_ReturnValue) == 0x0000D0, "Member 'BP_BattleBuffInstance_AggregatorBase_C_GetBuffDisplayName::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function BP_BattleBuffInstance_AggregatorBase.BP_BattleBuffInstance_AggregatorBase_C.RemoveChildBuffInstance
// 0x0010 (0x0010 - 0x0000)
struct BP_BattleBuffInstance_AggregatorBase_C_RemoveChildBuffInstance final
{
public:
	const class UBP_BattleBuffInstance_C*         ChildBuffInstance;                                 // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsEmpty_ReturnValue;                // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BattleBuffInstance_AggregatorBase_C_RemoveChildBuffInstance) == 0x000008, "Wrong alignment on BP_BattleBuffInstance_AggregatorBase_C_RemoveChildBuffInstance");
static_assert(sizeof(BP_BattleBuffInstance_AggregatorBase_C_RemoveChildBuffInstance) == 0x000010, "Wrong size on BP_BattleBuffInstance_AggregatorBase_C_RemoveChildBuffInstance");
static_assert(offsetof(BP_BattleBuffInstance_AggregatorBase_C_RemoveChildBuffInstance, ChildBuffInstance) == 0x000000, "Member 'BP_BattleBuffInstance_AggregatorBase_C_RemoveChildBuffInstance::ChildBuffInstance' has a wrong offset!");
static_assert(offsetof(BP_BattleBuffInstance_AggregatorBase_C_RemoveChildBuffInstance, CallFunc_Array_RemoveItem_ReturnValue) == 0x000008, "Member 'BP_BattleBuffInstance_AggregatorBase_C_RemoveChildBuffInstance::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleBuffInstance_AggregatorBase_C_RemoveChildBuffInstance, CallFunc_Array_IsEmpty_ReturnValue) == 0x000009, "Member 'BP_BattleBuffInstance_AggregatorBase_C_RemoveChildBuffInstance::CallFunc_Array_IsEmpty_ReturnValue' has a wrong offset!");

// Function BP_BattleBuffInstance_AggregatorBase.BP_BattleBuffInstance_AggregatorBase_C.AddChildBuffInstance
// 0x0020 (0x0020 - 0x0000)
struct BP_BattleBuffInstance_AggregatorBase_C_AddChildBuffInstance final
{
public:
	const class UBP_BattleBuffInstance_C*         ChildBuff;                                         // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UBP_BattleBuffInstance_C* BuffInstance)> K2Node_CreateDelegate_OutputDelegate; // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BattleBuffInstance_AggregatorBase_C_AddChildBuffInstance) == 0x000008, "Wrong alignment on BP_BattleBuffInstance_AggregatorBase_C_AddChildBuffInstance");
static_assert(sizeof(BP_BattleBuffInstance_AggregatorBase_C_AddChildBuffInstance) == 0x000020, "Wrong size on BP_BattleBuffInstance_AggregatorBase_C_AddChildBuffInstance");
static_assert(offsetof(BP_BattleBuffInstance_AggregatorBase_C_AddChildBuffInstance, ChildBuff) == 0x000000, "Member 'BP_BattleBuffInstance_AggregatorBase_C_AddChildBuffInstance::ChildBuff' has a wrong offset!");
static_assert(offsetof(BP_BattleBuffInstance_AggregatorBase_C_AddChildBuffInstance, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'BP_BattleBuffInstance_AggregatorBase_C_AddChildBuffInstance::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_BattleBuffInstance_AggregatorBase_C_AddChildBuffInstance, CallFunc_Array_Add_ReturnValue) == 0x000018, "Member 'BP_BattleBuffInstance_AggregatorBase_C_AddChildBuffInstance::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

}

