#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BattleDamagePerfectionChangeEvent

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_BattleDamagePerfectionChangeEvent.BP_BattleDamagePerfectionChangeEvent_C.GetCurrentNewPerfection
// 0x0004 (0x0004 - 0x0000)
struct BP_BattleDamagePerfectionChangeEvent_C_GetCurrentNewPerfection final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BattleDamagePerfectionChangeEvent_C_GetCurrentNewPerfection) == 0x000004, "Wrong alignment on BP_BattleDamagePerfectionChangeEvent_C_GetCurrentNewPerfection");
static_assert(sizeof(BP_BattleDamagePerfectionChangeEvent_C_GetCurrentNewPerfection) == 0x000004, "Wrong size on BP_BattleDamagePerfectionChangeEvent_C_GetCurrentNewPerfection");
static_assert(offsetof(BP_BattleDamagePerfectionChangeEvent_C_GetCurrentNewPerfection, ReturnValue) == 0x000000, "Member 'BP_BattleDamagePerfectionChangeEvent_C_GetCurrentNewPerfection::ReturnValue' has a wrong offset!");

// Function BP_BattleDamagePerfectionChangeEvent.BP_BattleDamagePerfectionChangeEvent_C.GetInitialNewPerfection
// 0x0004 (0x0004 - 0x0000)
struct BP_BattleDamagePerfectionChangeEvent_C_GetInitialNewPerfection final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BattleDamagePerfectionChangeEvent_C_GetInitialNewPerfection) == 0x000004, "Wrong alignment on BP_BattleDamagePerfectionChangeEvent_C_GetInitialNewPerfection");
static_assert(sizeof(BP_BattleDamagePerfectionChangeEvent_C_GetInitialNewPerfection) == 0x000004, "Wrong size on BP_BattleDamagePerfectionChangeEvent_C_GetInitialNewPerfection");
static_assert(offsetof(BP_BattleDamagePerfectionChangeEvent_C_GetInitialNewPerfection, ReturnValue) == 0x000000, "Member 'BP_BattleDamagePerfectionChangeEvent_C_GetInitialNewPerfection::ReturnValue' has a wrong offset!");

// Function BP_BattleDamagePerfectionChangeEvent.BP_BattleDamagePerfectionChangeEvent_C.OverrideNewPerfection
// 0x0130 (0x0130 - 0x0000)
struct BP_BattleDamagePerfectionChangeEvent_C_OverrideNewPerfection final
{
public:
	int32                                         CurrentNewPerfection_0;                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 DebugReason;                                       // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0018(0x0010)()
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0030(0x0048)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0078(0x0048)(HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue_1;            // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x00C8(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0110(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Format_ReturnValue;                       // 0x0120(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BattleDamagePerfectionChangeEvent_C_OverrideNewPerfection) == 0x000008, "Wrong alignment on BP_BattleDamagePerfectionChangeEvent_C_OverrideNewPerfection");
static_assert(sizeof(BP_BattleDamagePerfectionChangeEvent_C_OverrideNewPerfection) == 0x000130, "Wrong size on BP_BattleDamagePerfectionChangeEvent_C_OverrideNewPerfection");
static_assert(offsetof(BP_BattleDamagePerfectionChangeEvent_C_OverrideNewPerfection, CurrentNewPerfection_0) == 0x000000, "Member 'BP_BattleDamagePerfectionChangeEvent_C_OverrideNewPerfection::CurrentNewPerfection_0' has a wrong offset!");
static_assert(offsetof(BP_BattleDamagePerfectionChangeEvent_C_OverrideNewPerfection, DebugReason) == 0x000008, "Member 'BP_BattleDamagePerfectionChangeEvent_C_OverrideNewPerfection::DebugReason' has a wrong offset!");
static_assert(offsetof(BP_BattleDamagePerfectionChangeEvent_C_OverrideNewPerfection, CallFunc_Conv_StringToText_ReturnValue) == 0x000018, "Member 'BP_BattleDamagePerfectionChangeEvent_C_OverrideNewPerfection::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleDamagePerfectionChangeEvent_C_OverrideNewPerfection, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000028, "Member 'BP_BattleDamagePerfectionChangeEvent_C_OverrideNewPerfection::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleDamagePerfectionChangeEvent_C_OverrideNewPerfection, K2Node_MakeStruct_FormatArgumentData) == 0x000030, "Member 'BP_BattleDamagePerfectionChangeEvent_C_OverrideNewPerfection::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_BattleDamagePerfectionChangeEvent_C_OverrideNewPerfection, K2Node_MakeStruct_FormatArgumentData_1) == 0x000078, "Member 'BP_BattleDamagePerfectionChangeEvent_C_OverrideNewPerfection::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BP_BattleDamagePerfectionChangeEvent_C_OverrideNewPerfection, CallFunc_Conv_IntToInt64_ReturnValue_1) == 0x0000C0, "Member 'BP_BattleDamagePerfectionChangeEvent_C_OverrideNewPerfection::CallFunc_Conv_IntToInt64_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BattleDamagePerfectionChangeEvent_C_OverrideNewPerfection, K2Node_MakeStruct_FormatArgumentData_2) == 0x0000C8, "Member 'BP_BattleDamagePerfectionChangeEvent_C_OverrideNewPerfection::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(BP_BattleDamagePerfectionChangeEvent_C_OverrideNewPerfection, K2Node_MakeArray_Array) == 0x000110, "Member 'BP_BattleDamagePerfectionChangeEvent_C_OverrideNewPerfection::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_BattleDamagePerfectionChangeEvent_C_OverrideNewPerfection, CallFunc_Format_ReturnValue) == 0x000120, "Member 'BP_BattleDamagePerfectionChangeEvent_C_OverrideNewPerfection::CallFunc_Format_ReturnValue' has a wrong offset!");

}

