#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BattleBuff_Followup_FreeAimCount

#include "Basic.hpp"

#include "S_BalancingTableFloatEntry_structs.hpp"


namespace SDK::Params
{

// Function BP_BattleBuff_Followup_FreeAimCount.BP_BattleBuff_Followup_FreeAimCount_C.ExecuteUbergraph_BP_BattleBuff_Followup_FreeAimCount
// 0x0020 (0x0020 - 0x0000)
struct BP_BattleBuff_Followup_FreeAimCount_C_ExecuteUbergraph_BP_BattleBuff_Followup_FreeAimCount final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAC_jRPG_CharacterBattleStats_C*        K2Node_Event_CharacterStats;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	const class UBP_DependencyRefCounter_C*       K2Node_Event_TurnStartDependencies;                // 0x0010(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsBuffTarget_IsTarget;                    // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BattleBuff_Followup_FreeAimCount_C_ExecuteUbergraph_BP_BattleBuff_Followup_FreeAimCount) == 0x000008, "Wrong alignment on BP_BattleBuff_Followup_FreeAimCount_C_ExecuteUbergraph_BP_BattleBuff_Followup_FreeAimCount");
static_assert(sizeof(BP_BattleBuff_Followup_FreeAimCount_C_ExecuteUbergraph_BP_BattleBuff_Followup_FreeAimCount) == 0x000020, "Wrong size on BP_BattleBuff_Followup_FreeAimCount_C_ExecuteUbergraph_BP_BattleBuff_Followup_FreeAimCount");
static_assert(offsetof(BP_BattleBuff_Followup_FreeAimCount_C_ExecuteUbergraph_BP_BattleBuff_Followup_FreeAimCount, EntryPoint) == 0x000000, "Member 'BP_BattleBuff_Followup_FreeAimCount_C_ExecuteUbergraph_BP_BattleBuff_Followup_FreeAimCount::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_BattleBuff_Followup_FreeAimCount_C_ExecuteUbergraph_BP_BattleBuff_Followup_FreeAimCount, K2Node_Event_CharacterStats) == 0x000008, "Member 'BP_BattleBuff_Followup_FreeAimCount_C_ExecuteUbergraph_BP_BattleBuff_Followup_FreeAimCount::K2Node_Event_CharacterStats' has a wrong offset!");
static_assert(offsetof(BP_BattleBuff_Followup_FreeAimCount_C_ExecuteUbergraph_BP_BattleBuff_Followup_FreeAimCount, K2Node_Event_TurnStartDependencies) == 0x000010, "Member 'BP_BattleBuff_Followup_FreeAimCount_C_ExecuteUbergraph_BP_BattleBuff_Followup_FreeAimCount::K2Node_Event_TurnStartDependencies' has a wrong offset!");
static_assert(offsetof(BP_BattleBuff_Followup_FreeAimCount_C_ExecuteUbergraph_BP_BattleBuff_Followup_FreeAimCount, CallFunc_IsBuffTarget_IsTarget) == 0x000018, "Member 'BP_BattleBuff_Followup_FreeAimCount_C_ExecuteUbergraph_BP_BattleBuff_Followup_FreeAimCount::CallFunc_IsBuffTarget_IsTarget' has a wrong offset!");

// Function BP_BattleBuff_Followup_FreeAimCount.BP_BattleBuff_Followup_FreeAimCount_C.OnCharacterTurnStart
// 0x0010 (0x0010 - 0x0000)
struct BP_BattleBuff_Followup_FreeAimCount_C_OnCharacterTurnStart final
{
public:
	class UAC_jRPG_CharacterBattleStats_C*        CharacterStats;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	const class UBP_DependencyRefCounter_C*       TurnStartDependencies;                             // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BattleBuff_Followup_FreeAimCount_C_OnCharacterTurnStart) == 0x000008, "Wrong alignment on BP_BattleBuff_Followup_FreeAimCount_C_OnCharacterTurnStart");
static_assert(sizeof(BP_BattleBuff_Followup_FreeAimCount_C_OnCharacterTurnStart) == 0x000010, "Wrong size on BP_BattleBuff_Followup_FreeAimCount_C_OnCharacterTurnStart");
static_assert(offsetof(BP_BattleBuff_Followup_FreeAimCount_C_OnCharacterTurnStart, CharacterStats) == 0x000000, "Member 'BP_BattleBuff_Followup_FreeAimCount_C_OnCharacterTurnStart::CharacterStats' has a wrong offset!");
static_assert(offsetof(BP_BattleBuff_Followup_FreeAimCount_C_OnCharacterTurnStart, TurnStartDependencies) == 0x000008, "Member 'BP_BattleBuff_Followup_FreeAimCount_C_OnCharacterTurnStart::TurnStartDependencies' has a wrong offset!");

// Function BP_BattleBuff_Followup_FreeAimCount.BP_BattleBuff_Followup_FreeAimCount_C.ProcessDealtRawDamages
// 0x0028 (0x0028 - 0x0000)
struct BP_BattleBuff_Followup_FreeAimCount_C_ProcessDealtRawDamages final
{
public:
	class UBP_BattleDamages_C*                    BattleDamages;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, InstancedReference, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	bool                                          Out;                                               // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_BalancingTableFloatEntry            CallFunc_GetDataTableRowFromName_OutRow;           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue;                        // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BattleBuff_Followup_FreeAimCount_C_ProcessDealtRawDamages) == 0x000008, "Wrong alignment on BP_BattleBuff_Followup_FreeAimCount_C_ProcessDealtRawDamages");
static_assert(sizeof(BP_BattleBuff_Followup_FreeAimCount_C_ProcessDealtRawDamages) == 0x000028, "Wrong size on BP_BattleBuff_Followup_FreeAimCount_C_ProcessDealtRawDamages");
static_assert(offsetof(BP_BattleBuff_Followup_FreeAimCount_C_ProcessDealtRawDamages, BattleDamages) == 0x000000, "Member 'BP_BattleBuff_Followup_FreeAimCount_C_ProcessDealtRawDamages::BattleDamages' has a wrong offset!");
static_assert(offsetof(BP_BattleBuff_Followup_FreeAimCount_C_ProcessDealtRawDamages, Out) == 0x000008, "Member 'BP_BattleBuff_Followup_FreeAimCount_C_ProcessDealtRawDamages::Out' has a wrong offset!");
static_assert(offsetof(BP_BattleBuff_Followup_FreeAimCount_C_ProcessDealtRawDamages, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'BP_BattleBuff_Followup_FreeAimCount_C_ProcessDealtRawDamages::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleBuff_Followup_FreeAimCount_C_ProcessDealtRawDamages, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000010, "Member 'BP_BattleBuff_Followup_FreeAimCount_C_ProcessDealtRawDamages::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleBuff_Followup_FreeAimCount_C_ProcessDealtRawDamages, CallFunc_GetDataTableRowFromName_OutRow) == 0x000018, "Member 'BP_BattleBuff_Followup_FreeAimCount_C_ProcessDealtRawDamages::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BP_BattleBuff_Followup_FreeAimCount_C_ProcessDealtRawDamages, CallFunc_FTrunc_ReturnValue) == 0x000020, "Member 'BP_BattleBuff_Followup_FreeAimCount_C_ProcessDealtRawDamages::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleBuff_Followup_FreeAimCount_C_ProcessDealtRawDamages, CallFunc_Clamp_ReturnValue) == 0x000024, "Member 'BP_BattleBuff_Followup_FreeAimCount_C_ProcessDealtRawDamages::CallFunc_Clamp_ReturnValue' has a wrong offset!");

}

