#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BattleBuff_Stun

#include "Basic.hpp"

#include "FDamageModifier_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_BattleBuff_Stun.BP_BattleBuff_Stun_C.ActivateBuff
// 0x0008 (0x0008 - 0x0000)
struct BP_BattleBuff_Stun_C_ActivateBuff final
{
public:
	const class UAC_jRPG_CharacterBattleStats_C*  CharacterStats;                                    // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, InstancedReference, ReferenceParm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BattleBuff_Stun_C_ActivateBuff) == 0x000008, "Wrong alignment on BP_BattleBuff_Stun_C_ActivateBuff");
static_assert(sizeof(BP_BattleBuff_Stun_C_ActivateBuff) == 0x000008, "Wrong size on BP_BattleBuff_Stun_C_ActivateBuff");
static_assert(offsetof(BP_BattleBuff_Stun_C_ActivateBuff, CharacterStats) == 0x000000, "Member 'BP_BattleBuff_Stun_C_ActivateBuff::CharacterStats' has a wrong offset!");

// Function BP_BattleBuff_Stun.BP_BattleBuff_Stun_C.ExecuteUbergraph_BP_BattleBuff_Stun
// 0x0288 (0x0288 - 0x0000)
struct BP_BattleBuff_Stun_C_ExecuteUbergraph_BP_BattleBuff_Stun final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   Temp_text_Variable;                                // 0x0020(0x0010)()
	class FName                                   Temp_name_Variable;                                // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_1;                              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAC_jRPG_CharacterBattleStats_C*        K2Node_Event_CharacterStats_1;                     // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	const class UBP_DependencyRefCounter_C*       K2Node_Event_TurnStartDependencies;                // 0x0048(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0050(0x0048)(HasGetValueTypeHash)
	bool                                          CallFunc_IsBuffTarget_IsTarget;                    // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00A0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00B0(0x0010)()
	class FText                                   CallFunc_AddSentenceGenderTags__SubjectOnly__OutText; // 0x00C0(0x0010)()
	class FText                                   Temp_text_Variable_1;                              // 0x00D0(0x0010)()
	class UAC_jRPG_BattleManager_C*               CallFunc_GetBattleManager_ReturnValue;             // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAC_jRPG_BattleManager_C*               CallFunc_GetBattleManager_ReturnValue_1;           // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00F0(0x0048)(HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0140(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0150(0x0010)()
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_AddSentenceGenderTags__SubjectOnly__OutText_1; // 0x0168(0x0010)()
	bool                                          CallFunc_RemoveReference_ReturnValue;              // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AddReference_ReturnValue;                 // 0x0179(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInTeam_ReturnValue;                     // 0x017A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17B[0x5];                                      // 0x017B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0180(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0188(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Select_Default;                             // 0x01A0(0x0010)()
	const class UAC_jRPG_CharacterBattleStats_C*  K2Node_Event_CharacterStats;                       // 0x01B0(0x0008)(ConstParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ABP_jRPG_Character_Battle_Base_C*       CallFunc_GetCharacterBattleBase_jRPG_CharacterBattleBase; // 0x01B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetCharacterBattleBase_IsValid;           // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C1[0x7];                                      // 0x01C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x01C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x01D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x01E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0200(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetComponentBounds_Origin;                // 0x0218(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetComponentBounds_BoxExtent;             // 0x0230(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetComponentBounds_SphereRadius;          // 0x0248(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24C[0x4];                                      // 0x024C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0258(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x0270(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_A_ImplicitCast;       // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetFloatParameter_Param_ImplicitCast;     // 0x0280(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BattleBuff_Stun_C_ExecuteUbergraph_BP_BattleBuff_Stun) == 0x000008, "Wrong alignment on BP_BattleBuff_Stun_C_ExecuteUbergraph_BP_BattleBuff_Stun");
static_assert(sizeof(BP_BattleBuff_Stun_C_ExecuteUbergraph_BP_BattleBuff_Stun) == 0x000288, "Wrong size on BP_BattleBuff_Stun_C_ExecuteUbergraph_BP_BattleBuff_Stun");
static_assert(offsetof(BP_BattleBuff_Stun_C_ExecuteUbergraph_BP_BattleBuff_Stun, EntryPoint) == 0x000000, "Member 'BP_BattleBuff_Stun_C_ExecuteUbergraph_BP_BattleBuff_Stun::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_BattleBuff_Stun_C_ExecuteUbergraph_BP_BattleBuff_Stun, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x000008, "Member 'BP_BattleBuff_Stun_C_ExecuteUbergraph_BP_BattleBuff_Stun::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleBuff_Stun_C_ExecuteUbergraph_BP_BattleBuff_Stun, Temp_text_Variable) == 0x000020, "Member 'BP_BattleBuff_Stun_C_ExecuteUbergraph_BP_BattleBuff_Stun::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(BP_BattleBuff_Stun_C_ExecuteUbergraph_BP_BattleBuff_Stun, Temp_name_Variable) == 0x000030, "Member 'BP_BattleBuff_Stun_C_ExecuteUbergraph_BP_BattleBuff_Stun::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(BP_BattleBuff_Stun_C_ExecuteUbergraph_BP_BattleBuff_Stun, Temp_name_Variable_1) == 0x000038, "Member 'BP_BattleBuff_Stun_C_ExecuteUbergraph_BP_BattleBuff_Stun::Temp_name_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_BattleBuff_Stun_C_ExecuteUbergraph_BP_BattleBuff_Stun, K2Node_Event_CharacterStats_1) == 0x000040, "Member 'BP_BattleBuff_Stun_C_ExecuteUbergraph_BP_BattleBuff_Stun::K2Node_Event_CharacterStats_1' has a wrong offset!");
static_assert(offsetof(BP_BattleBuff_Stun_C_ExecuteUbergraph_BP_BattleBuff_Stun, K2Node_Event_TurnStartDependencies) == 0x000048, "Member 'BP_BattleBuff_Stun_C_ExecuteUbergraph_BP_BattleBuff_Stun::K2Node_Event_TurnStartDependencies' has a wrong offset!");
static_assert(offsetof(BP_BattleBuff_Stun_C_ExecuteUbergraph_BP_BattleBuff_Stun, K2Node_MakeStruct_FormatArgumentData) == 0x000050, "Member 'BP_BattleBuff_Stun_C_ExecuteUbergraph_BP_BattleBuff_Stun::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_BattleBuff_Stun_C_ExecuteUbergraph_BP_BattleBuff_Stun, CallFunc_IsBuffTarget_IsTarget) == 0x000098, "Member 'BP_BattleBuff_Stun_C_ExecuteUbergraph_BP_BattleBuff_Stun::CallFunc_IsBuffTarget_IsTarget' has a wrong offset!");
static_assert(offsetof(BP_BattleBuff_Stun_C_ExecuteUbergraph_BP_BattleBuff_Stun, K2Node_MakeArray_Array) == 0x0000A0, "Member 'BP_BattleBuff_Stun_C_ExecuteUbergraph_BP_BattleBuff_Stun::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_BattleBuff_Stun_C_ExecuteUbergraph_BP_BattleBuff_Stun, CallFunc_Format_ReturnValue) == 0x0000B0, "Member 'BP_BattleBuff_Stun_C_ExecuteUbergraph_BP_BattleBuff_Stun::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleBuff_Stun_C_ExecuteUbergraph_BP_BattleBuff_Stun, CallFunc_AddSentenceGenderTags__SubjectOnly__OutText) == 0x0000C0, "Member 'BP_BattleBuff_Stun_C_ExecuteUbergraph_BP_BattleBuff_Stun::CallFunc_AddSentenceGenderTags__SubjectOnly__OutText' has a wrong offset!");
static_assert(offsetof(BP_BattleBuff_Stun_C_ExecuteUbergraph_BP_BattleBuff_Stun, Temp_text_Variable_1) == 0x0000D0, "Member 'BP_BattleBuff_Stun_C_ExecuteUbergraph_BP_BattleBuff_Stun::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_BattleBuff_Stun_C_ExecuteUbergraph_BP_BattleBuff_Stun, CallFunc_GetBattleManager_ReturnValue) == 0x0000E0, "Member 'BP_BattleBuff_Stun_C_ExecuteUbergraph_BP_BattleBuff_Stun::CallFunc_GetBattleManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleBuff_Stun_C_ExecuteUbergraph_BP_BattleBuff_Stun, CallFunc_GetBattleManager_ReturnValue_1) == 0x0000E8, "Member 'BP_BattleBuff_Stun_C_ExecuteUbergraph_BP_BattleBuff_Stun::CallFunc_GetBattleManager_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BattleBuff_Stun_C_ExecuteUbergraph_BP_BattleBuff_Stun, K2Node_MakeStruct_FormatArgumentData_1) == 0x0000F0, "Member 'BP_BattleBuff_Stun_C_ExecuteUbergraph_BP_BattleBuff_Stun::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BP_BattleBuff_Stun_C_ExecuteUbergraph_BP_BattleBuff_Stun, Temp_bool_Variable) == 0x000138, "Member 'BP_BattleBuff_Stun_C_ExecuteUbergraph_BP_BattleBuff_Stun::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_BattleBuff_Stun_C_ExecuteUbergraph_BP_BattleBuff_Stun, K2Node_MakeArray_Array_1) == 0x000140, "Member 'BP_BattleBuff_Stun_C_ExecuteUbergraph_BP_BattleBuff_Stun::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BP_BattleBuff_Stun_C_ExecuteUbergraph_BP_BattleBuff_Stun, CallFunc_Format_ReturnValue_1) == 0x000150, "Member 'BP_BattleBuff_Stun_C_ExecuteUbergraph_BP_BattleBuff_Stun::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BattleBuff_Stun_C_ExecuteUbergraph_BP_BattleBuff_Stun, CallFunc_Greater_IntInt_ReturnValue) == 0x000160, "Member 'BP_BattleBuff_Stun_C_ExecuteUbergraph_BP_BattleBuff_Stun::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleBuff_Stun_C_ExecuteUbergraph_BP_BattleBuff_Stun, CallFunc_AddSentenceGenderTags__SubjectOnly__OutText_1) == 0x000168, "Member 'BP_BattleBuff_Stun_C_ExecuteUbergraph_BP_BattleBuff_Stun::CallFunc_AddSentenceGenderTags__SubjectOnly__OutText_1' has a wrong offset!");
static_assert(offsetof(BP_BattleBuff_Stun_C_ExecuteUbergraph_BP_BattleBuff_Stun, CallFunc_RemoveReference_ReturnValue) == 0x000178, "Member 'BP_BattleBuff_Stun_C_ExecuteUbergraph_BP_BattleBuff_Stun::CallFunc_RemoveReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleBuff_Stun_C_ExecuteUbergraph_BP_BattleBuff_Stun, CallFunc_AddReference_ReturnValue) == 0x000179, "Member 'BP_BattleBuff_Stun_C_ExecuteUbergraph_BP_BattleBuff_Stun::CallFunc_AddReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleBuff_Stun_C_ExecuteUbergraph_BP_BattleBuff_Stun, CallFunc_IsInTeam_ReturnValue) == 0x00017A, "Member 'BP_BattleBuff_Stun_C_ExecuteUbergraph_BP_BattleBuff_Stun::CallFunc_IsInTeam_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleBuff_Stun_C_ExecuteUbergraph_BP_BattleBuff_Stun, CallFunc_GetOwner_ReturnValue) == 0x000180, "Member 'BP_BattleBuff_Stun_C_ExecuteUbergraph_BP_BattleBuff_Stun::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleBuff_Stun_C_ExecuteUbergraph_BP_BattleBuff_Stun, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000188, "Member 'BP_BattleBuff_Stun_C_ExecuteUbergraph_BP_BattleBuff_Stun::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleBuff_Stun_C_ExecuteUbergraph_BP_BattleBuff_Stun, K2Node_Select_Default) == 0x0001A0, "Member 'BP_BattleBuff_Stun_C_ExecuteUbergraph_BP_BattleBuff_Stun::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_BattleBuff_Stun_C_ExecuteUbergraph_BP_BattleBuff_Stun, K2Node_Event_CharacterStats) == 0x0001B0, "Member 'BP_BattleBuff_Stun_C_ExecuteUbergraph_BP_BattleBuff_Stun::K2Node_Event_CharacterStats' has a wrong offset!");
static_assert(offsetof(BP_BattleBuff_Stun_C_ExecuteUbergraph_BP_BattleBuff_Stun, CallFunc_GetCharacterBattleBase_jRPG_CharacterBattleBase) == 0x0001B8, "Member 'BP_BattleBuff_Stun_C_ExecuteUbergraph_BP_BattleBuff_Stun::CallFunc_GetCharacterBattleBase_jRPG_CharacterBattleBase' has a wrong offset!");
static_assert(offsetof(BP_BattleBuff_Stun_C_ExecuteUbergraph_BP_BattleBuff_Stun, CallFunc_GetCharacterBattleBase_IsValid) == 0x0001C0, "Member 'BP_BattleBuff_Stun_C_ExecuteUbergraph_BP_BattleBuff_Stun::CallFunc_GetCharacterBattleBase_IsValid' has a wrong offset!");
static_assert(offsetof(BP_BattleBuff_Stun_C_ExecuteUbergraph_BP_BattleBuff_Stun, CallFunc_GetOwner_ReturnValue_1) == 0x0001C8, "Member 'BP_BattleBuff_Stun_C_ExecuteUbergraph_BP_BattleBuff_Stun::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BattleBuff_Stun_C_ExecuteUbergraph_BP_BattleBuff_Stun, CallFunc_GetActorForwardVector_ReturnValue) == 0x0001D0, "Member 'BP_BattleBuff_Stun_C_ExecuteUbergraph_BP_BattleBuff_Stun::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleBuff_Stun_C_ExecuteUbergraph_BP_BattleBuff_Stun, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x0001E8, "Member 'BP_BattleBuff_Stun_C_ExecuteUbergraph_BP_BattleBuff_Stun::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BattleBuff_Stun_C_ExecuteUbergraph_BP_BattleBuff_Stun, CallFunc_Multiply_VectorVector_ReturnValue) == 0x000200, "Member 'BP_BattleBuff_Stun_C_ExecuteUbergraph_BP_BattleBuff_Stun::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleBuff_Stun_C_ExecuteUbergraph_BP_BattleBuff_Stun, CallFunc_GetComponentBounds_Origin) == 0x000218, "Member 'BP_BattleBuff_Stun_C_ExecuteUbergraph_BP_BattleBuff_Stun::CallFunc_GetComponentBounds_Origin' has a wrong offset!");
static_assert(offsetof(BP_BattleBuff_Stun_C_ExecuteUbergraph_BP_BattleBuff_Stun, CallFunc_GetComponentBounds_BoxExtent) == 0x000230, "Member 'BP_BattleBuff_Stun_C_ExecuteUbergraph_BP_BattleBuff_Stun::CallFunc_GetComponentBounds_BoxExtent' has a wrong offset!");
static_assert(offsetof(BP_BattleBuff_Stun_C_ExecuteUbergraph_BP_BattleBuff_Stun, CallFunc_GetComponentBounds_SphereRadius) == 0x000248, "Member 'BP_BattleBuff_Stun_C_ExecuteUbergraph_BP_BattleBuff_Stun::CallFunc_GetComponentBounds_SphereRadius' has a wrong offset!");
static_assert(offsetof(BP_BattleBuff_Stun_C_ExecuteUbergraph_BP_BattleBuff_Stun, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000250, "Member 'BP_BattleBuff_Stun_C_ExecuteUbergraph_BP_BattleBuff_Stun::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleBuff_Stun_C_ExecuteUbergraph_BP_BattleBuff_Stun, CallFunc_Add_VectorVector_ReturnValue) == 0x000258, "Member 'BP_BattleBuff_Stun_C_ExecuteUbergraph_BP_BattleBuff_Stun::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleBuff_Stun_C_ExecuteUbergraph_BP_BattleBuff_Stun, CallFunc_SpawnSystemAtLocation_ReturnValue) == 0x000270, "Member 'BP_BattleBuff_Stun_C_ExecuteUbergraph_BP_BattleBuff_Stun::CallFunc_SpawnSystemAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleBuff_Stun_C_ExecuteUbergraph_BP_BattleBuff_Stun, CallFunc_Divide_DoubleDouble_A_ImplicitCast) == 0x000278, "Member 'BP_BattleBuff_Stun_C_ExecuteUbergraph_BP_BattleBuff_Stun::CallFunc_Divide_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_BattleBuff_Stun_C_ExecuteUbergraph_BP_BattleBuff_Stun, CallFunc_SetFloatParameter_Param_ImplicitCast) == 0x000280, "Member 'BP_BattleBuff_Stun_C_ExecuteUbergraph_BP_BattleBuff_Stun::CallFunc_SetFloatParameter_Param_ImplicitCast' has a wrong offset!");

// Function BP_BattleBuff_Stun.BP_BattleBuff_Stun_C.OnCharacterTurnStart
// 0x0010 (0x0010 - 0x0000)
struct BP_BattleBuff_Stun_C_OnCharacterTurnStart final
{
public:
	class UAC_jRPG_CharacterBattleStats_C*        CharacterStats;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	const class UBP_DependencyRefCounter_C*       TurnStartDependencies;                             // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BattleBuff_Stun_C_OnCharacterTurnStart) == 0x000008, "Wrong alignment on BP_BattleBuff_Stun_C_OnCharacterTurnStart");
static_assert(sizeof(BP_BattleBuff_Stun_C_OnCharacterTurnStart) == 0x000010, "Wrong size on BP_BattleBuff_Stun_C_OnCharacterTurnStart");
static_assert(offsetof(BP_BattleBuff_Stun_C_OnCharacterTurnStart, CharacterStats) == 0x000000, "Member 'BP_BattleBuff_Stun_C_OnCharacterTurnStart::CharacterStats' has a wrong offset!");
static_assert(offsetof(BP_BattleBuff_Stun_C_OnCharacterTurnStart, TurnStartDependencies) == 0x000008, "Member 'BP_BattleBuff_Stun_C_OnCharacterTurnStart::TurnStartDependencies' has a wrong offset!");

// Function BP_BattleBuff_Stun.BP_BattleBuff_Stun_C.ProcessReceivedRawDamages
// 0x0038 (0x0038 - 0x0000)
struct BP_BattleBuff_Stun_C_ProcessReceivedRawDamages final
{
public:
	class UBP_BattleDamages_C*                    BattleDamages;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, InstancedReference, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	bool                                          Out;                                               // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFDamageModifier                       K2Node_MakeStruct_FDamageModifier;                 // 0x0010(0x0028)(HasGetValueTypeHash)
};
static_assert(alignof(BP_BattleBuff_Stun_C_ProcessReceivedRawDamages) == 0x000008, "Wrong alignment on BP_BattleBuff_Stun_C_ProcessReceivedRawDamages");
static_assert(sizeof(BP_BattleBuff_Stun_C_ProcessReceivedRawDamages) == 0x000038, "Wrong size on BP_BattleBuff_Stun_C_ProcessReceivedRawDamages");
static_assert(offsetof(BP_BattleBuff_Stun_C_ProcessReceivedRawDamages, BattleDamages) == 0x000000, "Member 'BP_BattleBuff_Stun_C_ProcessReceivedRawDamages::BattleDamages' has a wrong offset!");
static_assert(offsetof(BP_BattleBuff_Stun_C_ProcessReceivedRawDamages, Out) == 0x000008, "Member 'BP_BattleBuff_Stun_C_ProcessReceivedRawDamages::Out' has a wrong offset!");
static_assert(offsetof(BP_BattleBuff_Stun_C_ProcessReceivedRawDamages, K2Node_MakeStruct_FDamageModifier) == 0x000010, "Member 'BP_BattleBuff_Stun_C_ProcessReceivedRawDamages::K2Node_MakeStruct_FDamageModifier' has a wrong offset!");

}

