#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BattleBuff_Stance_Stanceless

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_BattleBuff_Stance_Stanceless.BP_BattleBuff_Stance_Stanceless_C.ActivateBuff
// 0x0008 (0x0008 - 0x0000)
struct BP_BattleBuff_Stance_Stanceless_C_ActivateBuff final
{
public:
	const class UAC_jRPG_CharacterBattleStats_C*  CharacterStats;                                    // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, InstancedReference, ReferenceParm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BattleBuff_Stance_Stanceless_C_ActivateBuff) == 0x000008, "Wrong alignment on BP_BattleBuff_Stance_Stanceless_C_ActivateBuff");
static_assert(sizeof(BP_BattleBuff_Stance_Stanceless_C_ActivateBuff) == 0x000008, "Wrong size on BP_BattleBuff_Stance_Stanceless_C_ActivateBuff");
static_assert(offsetof(BP_BattleBuff_Stance_Stanceless_C_ActivateBuff, CharacterStats) == 0x000000, "Member 'BP_BattleBuff_Stance_Stanceless_C_ActivateBuff::CharacterStats' has a wrong offset!");

// Function BP_BattleBuff_Stance_Stanceless.BP_BattleBuff_Stance_Stanceless_C.ExecuteUbergraph_BP_BattleBuff_Stance_Stanceless
// 0x0010 (0x0010 - 0x0000)
struct BP_BattleBuff_Stance_Stanceless_C_ExecuteUbergraph_BP_BattleBuff_Stance_Stanceless final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UAC_jRPG_CharacterBattleStats_C*  K2Node_Event_CharacterStats;                       // 0x0008(0x0008)(ConstParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BattleBuff_Stance_Stanceless_C_ExecuteUbergraph_BP_BattleBuff_Stance_Stanceless) == 0x000008, "Wrong alignment on BP_BattleBuff_Stance_Stanceless_C_ExecuteUbergraph_BP_BattleBuff_Stance_Stanceless");
static_assert(sizeof(BP_BattleBuff_Stance_Stanceless_C_ExecuteUbergraph_BP_BattleBuff_Stance_Stanceless) == 0x000010, "Wrong size on BP_BattleBuff_Stance_Stanceless_C_ExecuteUbergraph_BP_BattleBuff_Stance_Stanceless");
static_assert(offsetof(BP_BattleBuff_Stance_Stanceless_C_ExecuteUbergraph_BP_BattleBuff_Stance_Stanceless, EntryPoint) == 0x000000, "Member 'BP_BattleBuff_Stance_Stanceless_C_ExecuteUbergraph_BP_BattleBuff_Stance_Stanceless::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_BattleBuff_Stance_Stanceless_C_ExecuteUbergraph_BP_BattleBuff_Stance_Stanceless, K2Node_Event_CharacterStats) == 0x000008, "Member 'BP_BattleBuff_Stance_Stanceless_C_ExecuteUbergraph_BP_BattleBuff_Stance_Stanceless::K2Node_Event_CharacterStats' has a wrong offset!");

}

