#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BattleSequenceTimeline

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "EBattleActionEvent_structs.hpp"
#include "SandFall_structs.hpp"
#include "FBattleSequenceTimelineKeyframe_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_BattleSequenceTimeline.BP_BattleSequenceTimeline_C.AddBattleSequenceActionKeyframe
// 0x01C0 (0x01C0 - 0x0000)
struct BP_BattleSequenceTimeline_C_AddBattleSequenceActionKeyframe final
{
public:
	double                                        Time;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBattleActionEvent                            ActionType;                                        // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FFBattleSequenceTimelineKeyframe       K2Node_MakeStruct_FBattleSequenceTimelineKeyframe; // 0x0020(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0028(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0038(0x0048)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0080(0x0048)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x00C8(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0110(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0120(0x0010)()
	struct FFBattleSequenceTimelineKeyframe       CallFunc_Map_Find_Value;                           // 0x0130(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0132(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_133[0x5];                                      // 0x0133(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_1; // 0x0138(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0148(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x0158(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x01A0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x01B0(0x0010)()
};
static_assert(alignof(BP_BattleSequenceTimeline_C_AddBattleSequenceActionKeyframe) == 0x000008, "Wrong alignment on BP_BattleSequenceTimeline_C_AddBattleSequenceActionKeyframe");
static_assert(sizeof(BP_BattleSequenceTimeline_C_AddBattleSequenceActionKeyframe) == 0x0001C0, "Wrong size on BP_BattleSequenceTimeline_C_AddBattleSequenceActionKeyframe");
static_assert(offsetof(BP_BattleSequenceTimeline_C_AddBattleSequenceActionKeyframe, Time) == 0x000000, "Member 'BP_BattleSequenceTimeline_C_AddBattleSequenceActionKeyframe::Time' has a wrong offset!");
static_assert(offsetof(BP_BattleSequenceTimeline_C_AddBattleSequenceActionKeyframe, ActionType) == 0x000008, "Member 'BP_BattleSequenceTimeline_C_AddBattleSequenceActionKeyframe::ActionType' has a wrong offset!");
static_assert(offsetof(BP_BattleSequenceTimeline_C_AddBattleSequenceActionKeyframe, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x000010, "Member 'BP_BattleSequenceTimeline_C_AddBattleSequenceActionKeyframe::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleSequenceTimeline_C_AddBattleSequenceActionKeyframe, K2Node_MakeStruct_FBattleSequenceTimelineKeyframe) == 0x000020, "Member 'BP_BattleSequenceTimeline_C_AddBattleSequenceActionKeyframe::K2Node_MakeStruct_FBattleSequenceTimelineKeyframe' has a wrong offset!");
static_assert(offsetof(BP_BattleSequenceTimeline_C_AddBattleSequenceActionKeyframe, CallFunc_Conv_StringToText_ReturnValue) == 0x000028, "Member 'BP_BattleSequenceTimeline_C_AddBattleSequenceActionKeyframe::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleSequenceTimeline_C_AddBattleSequenceActionKeyframe, K2Node_MakeStruct_FormatArgumentData) == 0x000038, "Member 'BP_BattleSequenceTimeline_C_AddBattleSequenceActionKeyframe::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_BattleSequenceTimeline_C_AddBattleSequenceActionKeyframe, K2Node_MakeStruct_FormatArgumentData_1) == 0x000080, "Member 'BP_BattleSequenceTimeline_C_AddBattleSequenceActionKeyframe::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BP_BattleSequenceTimeline_C_AddBattleSequenceActionKeyframe, K2Node_MakeStruct_FormatArgumentData_2) == 0x0000C8, "Member 'BP_BattleSequenceTimeline_C_AddBattleSequenceActionKeyframe::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(BP_BattleSequenceTimeline_C_AddBattleSequenceActionKeyframe, K2Node_MakeArray_Array) == 0x000110, "Member 'BP_BattleSequenceTimeline_C_AddBattleSequenceActionKeyframe::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_BattleSequenceTimeline_C_AddBattleSequenceActionKeyframe, CallFunc_Format_ReturnValue) == 0x000120, "Member 'BP_BattleSequenceTimeline_C_AddBattleSequenceActionKeyframe::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleSequenceTimeline_C_AddBattleSequenceActionKeyframe, CallFunc_Map_Find_Value) == 0x000130, "Member 'BP_BattleSequenceTimeline_C_AddBattleSequenceActionKeyframe::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BP_BattleSequenceTimeline_C_AddBattleSequenceActionKeyframe, CallFunc_Map_Find_ReturnValue) == 0x000132, "Member 'BP_BattleSequenceTimeline_C_AddBattleSequenceActionKeyframe::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleSequenceTimeline_C_AddBattleSequenceActionKeyframe, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_1) == 0x000138, "Member 'BP_BattleSequenceTimeline_C_AddBattleSequenceActionKeyframe::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BattleSequenceTimeline_C_AddBattleSequenceActionKeyframe, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000148, "Member 'BP_BattleSequenceTimeline_C_AddBattleSequenceActionKeyframe::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BattleSequenceTimeline_C_AddBattleSequenceActionKeyframe, K2Node_MakeStruct_FormatArgumentData_3) == 0x000158, "Member 'BP_BattleSequenceTimeline_C_AddBattleSequenceActionKeyframe::K2Node_MakeStruct_FormatArgumentData_3' has a wrong offset!");
static_assert(offsetof(BP_BattleSequenceTimeline_C_AddBattleSequenceActionKeyframe, K2Node_MakeArray_Array_1) == 0x0001A0, "Member 'BP_BattleSequenceTimeline_C_AddBattleSequenceActionKeyframe::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BP_BattleSequenceTimeline_C_AddBattleSequenceActionKeyframe, CallFunc_Format_ReturnValue_1) == 0x0001B0, "Member 'BP_BattleSequenceTimeline_C_AddBattleSequenceActionKeyframe::CallFunc_Format_ReturnValue_1' has a wrong offset!");

// Function BP_BattleSequenceTimeline.BP_BattleSequenceTimeline_C.AddBattleSequenceCameraKeyframe
// 0x0080 (0x0080 - 0x0000)
struct BP_BattleSequenceTimeline_C_AddBattleSequenceCameraKeyframe final
{
public:
	double                                        Time;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBattleSequenceCameraType                     CameraType;                                        // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFBattleSequenceTimelineKeyframe       K2Node_MakeStruct_FBattleSequenceTimelineKeyframe; // 0x0009(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B[0x5];                                        // 0x000B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0010(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0058(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0068(0x0010)()
	struct FFBattleSequenceTimelineKeyframe       CallFunc_Map_Find_Value;                           // 0x0078(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BattleSequenceTimeline_C_AddBattleSequenceCameraKeyframe) == 0x000008, "Wrong alignment on BP_BattleSequenceTimeline_C_AddBattleSequenceCameraKeyframe");
static_assert(sizeof(BP_BattleSequenceTimeline_C_AddBattleSequenceCameraKeyframe) == 0x000080, "Wrong size on BP_BattleSequenceTimeline_C_AddBattleSequenceCameraKeyframe");
static_assert(offsetof(BP_BattleSequenceTimeline_C_AddBattleSequenceCameraKeyframe, Time) == 0x000000, "Member 'BP_BattleSequenceTimeline_C_AddBattleSequenceCameraKeyframe::Time' has a wrong offset!");
static_assert(offsetof(BP_BattleSequenceTimeline_C_AddBattleSequenceCameraKeyframe, CameraType) == 0x000008, "Member 'BP_BattleSequenceTimeline_C_AddBattleSequenceCameraKeyframe::CameraType' has a wrong offset!");
static_assert(offsetof(BP_BattleSequenceTimeline_C_AddBattleSequenceCameraKeyframe, K2Node_MakeStruct_FBattleSequenceTimelineKeyframe) == 0x000009, "Member 'BP_BattleSequenceTimeline_C_AddBattleSequenceCameraKeyframe::K2Node_MakeStruct_FBattleSequenceTimelineKeyframe' has a wrong offset!");
static_assert(offsetof(BP_BattleSequenceTimeline_C_AddBattleSequenceCameraKeyframe, K2Node_MakeStruct_FormatArgumentData) == 0x000010, "Member 'BP_BattleSequenceTimeline_C_AddBattleSequenceCameraKeyframe::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_BattleSequenceTimeline_C_AddBattleSequenceCameraKeyframe, K2Node_MakeArray_Array) == 0x000058, "Member 'BP_BattleSequenceTimeline_C_AddBattleSequenceCameraKeyframe::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_BattleSequenceTimeline_C_AddBattleSequenceCameraKeyframe, CallFunc_Format_ReturnValue) == 0x000068, "Member 'BP_BattleSequenceTimeline_C_AddBattleSequenceCameraKeyframe::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleSequenceTimeline_C_AddBattleSequenceCameraKeyframe, CallFunc_Map_Find_Value) == 0x000078, "Member 'BP_BattleSequenceTimeline_C_AddBattleSequenceCameraKeyframe::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BP_BattleSequenceTimeline_C_AddBattleSequenceCameraKeyframe, CallFunc_Map_Find_ReturnValue) == 0x00007A, "Member 'BP_BattleSequenceTimeline_C_AddBattleSequenceCameraKeyframe::CallFunc_Map_Find_ReturnValue' has a wrong offset!");

// Function BP_BattleSequenceTimeline.BP_BattleSequenceTimeline_C.AddQTEPresetKeyframes
// 0x0148 (0x0148 - 0x0000)
struct BP_BattleSequenceTimeline_C_AddQTEPresetKeyframes final
{
public:
	double                                        WindowStartTime;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        AnticipationDuration_0;                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ValidityDuration_0;                                // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        NowTime;                                           // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0030(0x0048)(HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_1;      // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_2;      // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0088(0x0048)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x00D0(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0118(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12C[0x4];                                      // 0x012C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0130(0x0010)()
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_2;                  // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BattleSequenceTimeline_C_AddQTEPresetKeyframes) == 0x000008, "Wrong alignment on BP_BattleSequenceTimeline_C_AddQTEPresetKeyframes");
static_assert(sizeof(BP_BattleSequenceTimeline_C_AddQTEPresetKeyframes) == 0x000148, "Wrong size on BP_BattleSequenceTimeline_C_AddQTEPresetKeyframes");
static_assert(offsetof(BP_BattleSequenceTimeline_C_AddQTEPresetKeyframes, WindowStartTime) == 0x000000, "Member 'BP_BattleSequenceTimeline_C_AddQTEPresetKeyframes::WindowStartTime' has a wrong offset!");
static_assert(offsetof(BP_BattleSequenceTimeline_C_AddQTEPresetKeyframes, AnticipationDuration_0) == 0x000008, "Member 'BP_BattleSequenceTimeline_C_AddQTEPresetKeyframes::AnticipationDuration_0' has a wrong offset!");
static_assert(offsetof(BP_BattleSequenceTimeline_C_AddQTEPresetKeyframes, ValidityDuration_0) == 0x000010, "Member 'BP_BattleSequenceTimeline_C_AddQTEPresetKeyframes::ValidityDuration_0' has a wrong offset!");
static_assert(offsetof(BP_BattleSequenceTimeline_C_AddQTEPresetKeyframes, NowTime) == 0x000018, "Member 'BP_BattleSequenceTimeline_C_AddQTEPresetKeyframes::NowTime' has a wrong offset!");
static_assert(offsetof(BP_BattleSequenceTimeline_C_AddQTEPresetKeyframes, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000020, "Member 'BP_BattleSequenceTimeline_C_AddQTEPresetKeyframes::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleSequenceTimeline_C_AddQTEPresetKeyframes, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000028, "Member 'BP_BattleSequenceTimeline_C_AddQTEPresetKeyframes::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleSequenceTimeline_C_AddQTEPresetKeyframes, K2Node_MakeStruct_FormatArgumentData) == 0x000030, "Member 'BP_BattleSequenceTimeline_C_AddQTEPresetKeyframes::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_BattleSequenceTimeline_C_AddQTEPresetKeyframes, CallFunc_Subtract_DoubleDouble_ReturnValue_1) == 0x000078, "Member 'BP_BattleSequenceTimeline_C_AddQTEPresetKeyframes::CallFunc_Subtract_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BattleSequenceTimeline_C_AddQTEPresetKeyframes, CallFunc_Subtract_DoubleDouble_ReturnValue_2) == 0x000080, "Member 'BP_BattleSequenceTimeline_C_AddQTEPresetKeyframes::CallFunc_Subtract_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BattleSequenceTimeline_C_AddQTEPresetKeyframes, K2Node_MakeStruct_FormatArgumentData_1) == 0x000088, "Member 'BP_BattleSequenceTimeline_C_AddQTEPresetKeyframes::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BP_BattleSequenceTimeline_C_AddQTEPresetKeyframes, K2Node_MakeStruct_FormatArgumentData_2) == 0x0000D0, "Member 'BP_BattleSequenceTimeline_C_AddQTEPresetKeyframes::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(BP_BattleSequenceTimeline_C_AddQTEPresetKeyframes, K2Node_MakeArray_Array) == 0x000118, "Member 'BP_BattleSequenceTimeline_C_AddQTEPresetKeyframes::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_BattleSequenceTimeline_C_AddQTEPresetKeyframes, CallFunc_Array_Add_ReturnValue) == 0x000128, "Member 'BP_BattleSequenceTimeline_C_AddQTEPresetKeyframes::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleSequenceTimeline_C_AddQTEPresetKeyframes, CallFunc_Format_ReturnValue) == 0x000130, "Member 'BP_BattleSequenceTimeline_C_AddQTEPresetKeyframes::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleSequenceTimeline_C_AddQTEPresetKeyframes, CallFunc_Array_Add_ReturnValue_1) == 0x000140, "Member 'BP_BattleSequenceTimeline_C_AddQTEPresetKeyframes::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BattleSequenceTimeline_C_AddQTEPresetKeyframes, CallFunc_Array_Add_ReturnValue_2) == 0x000144, "Member 'BP_BattleSequenceTimeline_C_AddQTEPresetKeyframes::CallFunc_Array_Add_ReturnValue_2' has a wrong offset!");

// Function BP_BattleSequenceTimeline.BP_BattleSequenceTimeline_C.AddQTEPresetKeyframes_Legacy
// 0x0148 (0x0148 - 0x0000)
struct BP_BattleSequenceTimeline_C_AddQTEPresetKeyframes_Legacy final
{
public:
	double                                        WindowStartTime;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        AnticipationDuration_0;                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ValidityDuration_0;                                // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        NowTime;                                           // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0030(0x0048)(HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_1;      // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_2;      // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0088(0x0048)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x00D8(0x0048)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_2;                  // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_124[0x4];                                      // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0128(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0138(0x0010)()
};
static_assert(alignof(BP_BattleSequenceTimeline_C_AddQTEPresetKeyframes_Legacy) == 0x000008, "Wrong alignment on BP_BattleSequenceTimeline_C_AddQTEPresetKeyframes_Legacy");
static_assert(sizeof(BP_BattleSequenceTimeline_C_AddQTEPresetKeyframes_Legacy) == 0x000148, "Wrong size on BP_BattleSequenceTimeline_C_AddQTEPresetKeyframes_Legacy");
static_assert(offsetof(BP_BattleSequenceTimeline_C_AddQTEPresetKeyframes_Legacy, WindowStartTime) == 0x000000, "Member 'BP_BattleSequenceTimeline_C_AddQTEPresetKeyframes_Legacy::WindowStartTime' has a wrong offset!");
static_assert(offsetof(BP_BattleSequenceTimeline_C_AddQTEPresetKeyframes_Legacy, AnticipationDuration_0) == 0x000008, "Member 'BP_BattleSequenceTimeline_C_AddQTEPresetKeyframes_Legacy::AnticipationDuration_0' has a wrong offset!");
static_assert(offsetof(BP_BattleSequenceTimeline_C_AddQTEPresetKeyframes_Legacy, ValidityDuration_0) == 0x000010, "Member 'BP_BattleSequenceTimeline_C_AddQTEPresetKeyframes_Legacy::ValidityDuration_0' has a wrong offset!");
static_assert(offsetof(BP_BattleSequenceTimeline_C_AddQTEPresetKeyframes_Legacy, NowTime) == 0x000018, "Member 'BP_BattleSequenceTimeline_C_AddQTEPresetKeyframes_Legacy::NowTime' has a wrong offset!");
static_assert(offsetof(BP_BattleSequenceTimeline_C_AddQTEPresetKeyframes_Legacy, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000020, "Member 'BP_BattleSequenceTimeline_C_AddQTEPresetKeyframes_Legacy::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleSequenceTimeline_C_AddQTEPresetKeyframes_Legacy, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000028, "Member 'BP_BattleSequenceTimeline_C_AddQTEPresetKeyframes_Legacy::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleSequenceTimeline_C_AddQTEPresetKeyframes_Legacy, K2Node_MakeStruct_FormatArgumentData) == 0x000030, "Member 'BP_BattleSequenceTimeline_C_AddQTEPresetKeyframes_Legacy::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_BattleSequenceTimeline_C_AddQTEPresetKeyframes_Legacy, CallFunc_Subtract_DoubleDouble_ReturnValue_1) == 0x000078, "Member 'BP_BattleSequenceTimeline_C_AddQTEPresetKeyframes_Legacy::CallFunc_Subtract_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BattleSequenceTimeline_C_AddQTEPresetKeyframes_Legacy, CallFunc_Subtract_DoubleDouble_ReturnValue_2) == 0x000080, "Member 'BP_BattleSequenceTimeline_C_AddQTEPresetKeyframes_Legacy::CallFunc_Subtract_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BattleSequenceTimeline_C_AddQTEPresetKeyframes_Legacy, K2Node_MakeStruct_FormatArgumentData_1) == 0x000088, "Member 'BP_BattleSequenceTimeline_C_AddQTEPresetKeyframes_Legacy::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BP_BattleSequenceTimeline_C_AddQTEPresetKeyframes_Legacy, CallFunc_Array_Add_ReturnValue) == 0x0000D0, "Member 'BP_BattleSequenceTimeline_C_AddQTEPresetKeyframes_Legacy::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleSequenceTimeline_C_AddQTEPresetKeyframes_Legacy, CallFunc_Array_Add_ReturnValue_1) == 0x0000D4, "Member 'BP_BattleSequenceTimeline_C_AddQTEPresetKeyframes_Legacy::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BattleSequenceTimeline_C_AddQTEPresetKeyframes_Legacy, K2Node_MakeStruct_FormatArgumentData_2) == 0x0000D8, "Member 'BP_BattleSequenceTimeline_C_AddQTEPresetKeyframes_Legacy::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(BP_BattleSequenceTimeline_C_AddQTEPresetKeyframes_Legacy, CallFunc_Array_Add_ReturnValue_2) == 0x000120, "Member 'BP_BattleSequenceTimeline_C_AddQTEPresetKeyframes_Legacy::CallFunc_Array_Add_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BattleSequenceTimeline_C_AddQTEPresetKeyframes_Legacy, K2Node_MakeArray_Array) == 0x000128, "Member 'BP_BattleSequenceTimeline_C_AddQTEPresetKeyframes_Legacy::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_BattleSequenceTimeline_C_AddQTEPresetKeyframes_Legacy, CallFunc_Format_ReturnValue) == 0x000138, "Member 'BP_BattleSequenceTimeline_C_AddQTEPresetKeyframes_Legacy::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function BP_BattleSequenceTimeline.BP_BattleSequenceTimeline_C.DeclareBattleSequenceTimingsAsList
// 0x03A0 (0x03A0 - 0x0000)
struct BP_BattleSequenceTimeline_C_DeclareBattleSequenceTimingsAsList final
{
public:
	class ABP_EpicBattleSequenceActor_C*          BattleSequence;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FBattleSequenceKeyframe>        BattleSequenceKeyframes;                           // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TMap<double, EBattleSequenceCameraType>       CameraKeyframes;                                   // 0x0018(0x0050)(BlueprintVisible, BlueprintReadOnly, Parm)
	int32                                         local_actionEffectCount;                           // 0x0068(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBattleSequenceKeyframeType                   lastKeyframeType;                                  // 0x006C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        local_Now;                                         // 0x0070(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<double>                                CallFunc_Map_Keys_Keys;                            // 0x0080(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9D[0x3];                                       // 0x009D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Array_Get_Item;                           // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B5[0x3];                                       // 0x00B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBattleSequenceKeyframe                CallFunc_Array_Get_Item_1;                         // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x00C8(0x0048)(HasGetValueTypeHash)
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0110(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_1; // 0x0120(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0130(0x0010)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0140(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0150(0x0048)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0198(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x01E0(0x0010)(ReferenceParm)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F1[0x7];                                      // 0x01F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Format_ReturnValue;                       // 0x01F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	EBattleActionEvent                            Temp_byte_Variable;                                // 0x0208(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_209[0x7];                                      // 0x0209(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x0210(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0258(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0268(0x0010)()
	EBattleSequenceKeyframeType                   Temp_byte_Variable_1;                              // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_279[0x3];                                      // 0x0279(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x027C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_HUD_QTE_Base_C*                    CallFunc_GetQTEWidget_Output;                      // 0x0280(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFBattleSequenceTimelineKeyframe> CallFunc_Map_Values_Values;                      // 0x0288(0x0010)(ReferenceParm)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFBattleSequenceTimelineKeyframe       CallFunc_Array_Get_Item_2;                         // 0x0299(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29B[0x1];                                      // 0x029B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x029C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x02A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A2[0x2];                                      // 0x02A2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x02A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A9[0x3];                                      // 0x02A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x02AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBattleSequenceCameraType                     CallFunc_Map_Find_Value;                           // 0x02B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x02B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B3[0x1];                                      // 0x02B3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x02B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_4;            // 0x02C0(0x0048)(HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x0308(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0309(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBattleActionEvent                            K2Node_Select_Default;                             // 0x030A(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30B[0x5];                                      // 0x030B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_2; // 0x0310(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_2;          // 0x0320(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_5;            // 0x0330(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_2;                          // 0x0378(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_2;                     // 0x0388(0x0010)()
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast;          // 0x0398(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BattleSequenceTimeline_C_DeclareBattleSequenceTimingsAsList) == 0x000008, "Wrong alignment on BP_BattleSequenceTimeline_C_DeclareBattleSequenceTimingsAsList");
static_assert(sizeof(BP_BattleSequenceTimeline_C_DeclareBattleSequenceTimingsAsList) == 0x0003A0, "Wrong size on BP_BattleSequenceTimeline_C_DeclareBattleSequenceTimingsAsList");
static_assert(offsetof(BP_BattleSequenceTimeline_C_DeclareBattleSequenceTimingsAsList, BattleSequence) == 0x000000, "Member 'BP_BattleSequenceTimeline_C_DeclareBattleSequenceTimingsAsList::BattleSequence' has a wrong offset!");
static_assert(offsetof(BP_BattleSequenceTimeline_C_DeclareBattleSequenceTimingsAsList, BattleSequenceKeyframes) == 0x000008, "Member 'BP_BattleSequenceTimeline_C_DeclareBattleSequenceTimingsAsList::BattleSequenceKeyframes' has a wrong offset!");
static_assert(offsetof(BP_BattleSequenceTimeline_C_DeclareBattleSequenceTimingsAsList, CameraKeyframes) == 0x000018, "Member 'BP_BattleSequenceTimeline_C_DeclareBattleSequenceTimingsAsList::CameraKeyframes' has a wrong offset!");
static_assert(offsetof(BP_BattleSequenceTimeline_C_DeclareBattleSequenceTimingsAsList, local_actionEffectCount) == 0x000068, "Member 'BP_BattleSequenceTimeline_C_DeclareBattleSequenceTimingsAsList::local_actionEffectCount' has a wrong offset!");
static_assert(offsetof(BP_BattleSequenceTimeline_C_DeclareBattleSequenceTimingsAsList, lastKeyframeType) == 0x00006C, "Member 'BP_BattleSequenceTimeline_C_DeclareBattleSequenceTimingsAsList::lastKeyframeType' has a wrong offset!");
static_assert(offsetof(BP_BattleSequenceTimeline_C_DeclareBattleSequenceTimingsAsList, local_Now) == 0x000070, "Member 'BP_BattleSequenceTimeline_C_DeclareBattleSequenceTimingsAsList::local_Now' has a wrong offset!");
static_assert(offsetof(BP_BattleSequenceTimeline_C_DeclareBattleSequenceTimingsAsList, Temp_int_Array_Index_Variable) == 0x000078, "Member 'BP_BattleSequenceTimeline_C_DeclareBattleSequenceTimingsAsList::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_BattleSequenceTimeline_C_DeclareBattleSequenceTimingsAsList, CallFunc_Map_Keys_Keys) == 0x000080, "Member 'BP_BattleSequenceTimeline_C_DeclareBattleSequenceTimingsAsList::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(BP_BattleSequenceTimeline_C_DeclareBattleSequenceTimingsAsList, CallFunc_Array_Length_ReturnValue) == 0x000090, "Member 'BP_BattleSequenceTimeline_C_DeclareBattleSequenceTimingsAsList::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleSequenceTimeline_C_DeclareBattleSequenceTimingsAsList, CallFunc_Array_Length_ReturnValue_1) == 0x000094, "Member 'BP_BattleSequenceTimeline_C_DeclareBattleSequenceTimingsAsList::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BattleSequenceTimeline_C_DeclareBattleSequenceTimingsAsList, Temp_int_Loop_Counter_Variable) == 0x000098, "Member 'BP_BattleSequenceTimeline_C_DeclareBattleSequenceTimingsAsList::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_BattleSequenceTimeline_C_DeclareBattleSequenceTimingsAsList, CallFunc_Less_IntInt_ReturnValue) == 0x00009C, "Member 'BP_BattleSequenceTimeline_C_DeclareBattleSequenceTimingsAsList::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleSequenceTimeline_C_DeclareBattleSequenceTimingsAsList, CallFunc_Add_IntInt_ReturnValue) == 0x0000A0, "Member 'BP_BattleSequenceTimeline_C_DeclareBattleSequenceTimingsAsList::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleSequenceTimeline_C_DeclareBattleSequenceTimingsAsList, Temp_int_Array_Index_Variable_1) == 0x0000A4, "Member 'BP_BattleSequenceTimeline_C_DeclareBattleSequenceTimingsAsList::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_BattleSequenceTimeline_C_DeclareBattleSequenceTimingsAsList, CallFunc_Array_Get_Item) == 0x0000A8, "Member 'BP_BattleSequenceTimeline_C_DeclareBattleSequenceTimingsAsList::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_BattleSequenceTimeline_C_DeclareBattleSequenceTimingsAsList, Temp_int_Loop_Counter_Variable_1) == 0x0000B0, "Member 'BP_BattleSequenceTimeline_C_DeclareBattleSequenceTimingsAsList::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_BattleSequenceTimeline_C_DeclareBattleSequenceTimingsAsList, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000B4, "Member 'BP_BattleSequenceTimeline_C_DeclareBattleSequenceTimingsAsList::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BattleSequenceTimeline_C_DeclareBattleSequenceTimingsAsList, CallFunc_Add_IntInt_ReturnValue_1) == 0x0000B8, "Member 'BP_BattleSequenceTimeline_C_DeclareBattleSequenceTimingsAsList::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BattleSequenceTimeline_C_DeclareBattleSequenceTimingsAsList, Temp_int_Array_Index_Variable_2) == 0x0000BC, "Member 'BP_BattleSequenceTimeline_C_DeclareBattleSequenceTimingsAsList::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_BattleSequenceTimeline_C_DeclareBattleSequenceTimingsAsList, CallFunc_Array_Get_Item_1) == 0x0000C0, "Member 'BP_BattleSequenceTimeline_C_DeclareBattleSequenceTimingsAsList::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_BattleSequenceTimeline_C_DeclareBattleSequenceTimingsAsList, K2Node_MakeStruct_FormatArgumentData) == 0x0000C8, "Member 'BP_BattleSequenceTimeline_C_DeclareBattleSequenceTimingsAsList::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_BattleSequenceTimeline_C_DeclareBattleSequenceTimingsAsList, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x000110, "Member 'BP_BattleSequenceTimeline_C_DeclareBattleSequenceTimingsAsList::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleSequenceTimeline_C_DeclareBattleSequenceTimingsAsList, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_1) == 0x000120, "Member 'BP_BattleSequenceTimeline_C_DeclareBattleSequenceTimingsAsList::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BattleSequenceTimeline_C_DeclareBattleSequenceTimingsAsList, CallFunc_Conv_StringToText_ReturnValue) == 0x000130, "Member 'BP_BattleSequenceTimeline_C_DeclareBattleSequenceTimingsAsList::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleSequenceTimeline_C_DeclareBattleSequenceTimingsAsList, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000140, "Member 'BP_BattleSequenceTimeline_C_DeclareBattleSequenceTimingsAsList::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BattleSequenceTimeline_C_DeclareBattleSequenceTimingsAsList, K2Node_MakeStruct_FormatArgumentData_1) == 0x000150, "Member 'BP_BattleSequenceTimeline_C_DeclareBattleSequenceTimingsAsList::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BP_BattleSequenceTimeline_C_DeclareBattleSequenceTimingsAsList, K2Node_MakeStruct_FormatArgumentData_2) == 0x000198, "Member 'BP_BattleSequenceTimeline_C_DeclareBattleSequenceTimingsAsList::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(BP_BattleSequenceTimeline_C_DeclareBattleSequenceTimingsAsList, K2Node_MakeArray_Array) == 0x0001E0, "Member 'BP_BattleSequenceTimeline_C_DeclareBattleSequenceTimingsAsList::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_BattleSequenceTimeline_C_DeclareBattleSequenceTimingsAsList, K2Node_SwitchEnum_CmpSuccess) == 0x0001F0, "Member 'BP_BattleSequenceTimeline_C_DeclareBattleSequenceTimingsAsList::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_BattleSequenceTimeline_C_DeclareBattleSequenceTimingsAsList, CallFunc_Format_ReturnValue) == 0x0001F8, "Member 'BP_BattleSequenceTimeline_C_DeclareBattleSequenceTimingsAsList::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleSequenceTimeline_C_DeclareBattleSequenceTimingsAsList, Temp_byte_Variable) == 0x000208, "Member 'BP_BattleSequenceTimeline_C_DeclareBattleSequenceTimingsAsList::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_BattleSequenceTimeline_C_DeclareBattleSequenceTimingsAsList, K2Node_MakeStruct_FormatArgumentData_3) == 0x000210, "Member 'BP_BattleSequenceTimeline_C_DeclareBattleSequenceTimingsAsList::K2Node_MakeStruct_FormatArgumentData_3' has a wrong offset!");
static_assert(offsetof(BP_BattleSequenceTimeline_C_DeclareBattleSequenceTimingsAsList, K2Node_MakeArray_Array_1) == 0x000258, "Member 'BP_BattleSequenceTimeline_C_DeclareBattleSequenceTimingsAsList::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BP_BattleSequenceTimeline_C_DeclareBattleSequenceTimingsAsList, CallFunc_Format_ReturnValue_1) == 0x000268, "Member 'BP_BattleSequenceTimeline_C_DeclareBattleSequenceTimingsAsList::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BattleSequenceTimeline_C_DeclareBattleSequenceTimingsAsList, Temp_byte_Variable_1) == 0x000278, "Member 'BP_BattleSequenceTimeline_C_DeclareBattleSequenceTimingsAsList::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_BattleSequenceTimeline_C_DeclareBattleSequenceTimingsAsList, CallFunc_Add_IntInt_ReturnValue_2) == 0x00027C, "Member 'BP_BattleSequenceTimeline_C_DeclareBattleSequenceTimingsAsList::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BattleSequenceTimeline_C_DeclareBattleSequenceTimingsAsList, CallFunc_GetQTEWidget_Output) == 0x000280, "Member 'BP_BattleSequenceTimeline_C_DeclareBattleSequenceTimingsAsList::CallFunc_GetQTEWidget_Output' has a wrong offset!");
static_assert(offsetof(BP_BattleSequenceTimeline_C_DeclareBattleSequenceTimingsAsList, CallFunc_Map_Values_Values) == 0x000288, "Member 'BP_BattleSequenceTimeline_C_DeclareBattleSequenceTimingsAsList::CallFunc_Map_Values_Values' has a wrong offset!");
static_assert(offsetof(BP_BattleSequenceTimeline_C_DeclareBattleSequenceTimingsAsList, CallFunc_IsValid_ReturnValue) == 0x000298, "Member 'BP_BattleSequenceTimeline_C_DeclareBattleSequenceTimingsAsList::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleSequenceTimeline_C_DeclareBattleSequenceTimingsAsList, CallFunc_Array_Get_Item_2) == 0x000299, "Member 'BP_BattleSequenceTimeline_C_DeclareBattleSequenceTimingsAsList::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(BP_BattleSequenceTimeline_C_DeclareBattleSequenceTimingsAsList, CallFunc_Array_Length_ReturnValue_2) == 0x00029C, "Member 'BP_BattleSequenceTimeline_C_DeclareBattleSequenceTimingsAsList::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BattleSequenceTimeline_C_DeclareBattleSequenceTimingsAsList, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0002A0, "Member 'BP_BattleSequenceTimeline_C_DeclareBattleSequenceTimingsAsList::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleSequenceTimeline_C_DeclareBattleSequenceTimingsAsList, CallFunc_MakeLiteralByte_ReturnValue) == 0x0002A1, "Member 'BP_BattleSequenceTimeline_C_DeclareBattleSequenceTimingsAsList::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleSequenceTimeline_C_DeclareBattleSequenceTimingsAsList, Temp_int_Loop_Counter_Variable_2) == 0x0002A4, "Member 'BP_BattleSequenceTimeline_C_DeclareBattleSequenceTimingsAsList::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_BattleSequenceTimeline_C_DeclareBattleSequenceTimingsAsList, CallFunc_Less_IntInt_ReturnValue_2) == 0x0002A8, "Member 'BP_BattleSequenceTimeline_C_DeclareBattleSequenceTimingsAsList::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BattleSequenceTimeline_C_DeclareBattleSequenceTimingsAsList, CallFunc_Add_IntInt_ReturnValue_3) == 0x0002AC, "Member 'BP_BattleSequenceTimeline_C_DeclareBattleSequenceTimingsAsList::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_BattleSequenceTimeline_C_DeclareBattleSequenceTimingsAsList, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x0002B0, "Member 'BP_BattleSequenceTimeline_C_DeclareBattleSequenceTimingsAsList::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BattleSequenceTimeline_C_DeclareBattleSequenceTimingsAsList, CallFunc_Map_Find_Value) == 0x0002B1, "Member 'BP_BattleSequenceTimeline_C_DeclareBattleSequenceTimingsAsList::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BP_BattleSequenceTimeline_C_DeclareBattleSequenceTimingsAsList, CallFunc_Map_Find_ReturnValue) == 0x0002B2, "Member 'BP_BattleSequenceTimeline_C_DeclareBattleSequenceTimingsAsList::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleSequenceTimeline_C_DeclareBattleSequenceTimingsAsList, Temp_int_Variable) == 0x0002B4, "Member 'BP_BattleSequenceTimeline_C_DeclareBattleSequenceTimingsAsList::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_BattleSequenceTimeline_C_DeclareBattleSequenceTimingsAsList, CallFunc_Add_DoubleDouble_ReturnValue) == 0x0002B8, "Member 'BP_BattleSequenceTimeline_C_DeclareBattleSequenceTimingsAsList::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleSequenceTimeline_C_DeclareBattleSequenceTimingsAsList, K2Node_MakeStruct_FormatArgumentData_4) == 0x0002C0, "Member 'BP_BattleSequenceTimeline_C_DeclareBattleSequenceTimingsAsList::K2Node_MakeStruct_FormatArgumentData_4' has a wrong offset!");
static_assert(offsetof(BP_BattleSequenceTimeline_C_DeclareBattleSequenceTimingsAsList, CallFunc_MakeLiteralByte_ReturnValue_2) == 0x000308, "Member 'BP_BattleSequenceTimeline_C_DeclareBattleSequenceTimingsAsList::CallFunc_MakeLiteralByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BattleSequenceTimeline_C_DeclareBattleSequenceTimingsAsList, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000309, "Member 'BP_BattleSequenceTimeline_C_DeclareBattleSequenceTimingsAsList::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BattleSequenceTimeline_C_DeclareBattleSequenceTimingsAsList, K2Node_Select_Default) == 0x00030A, "Member 'BP_BattleSequenceTimeline_C_DeclareBattleSequenceTimingsAsList::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_BattleSequenceTimeline_C_DeclareBattleSequenceTimingsAsList, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_2) == 0x000310, "Member 'BP_BattleSequenceTimeline_C_DeclareBattleSequenceTimingsAsList::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BattleSequenceTimeline_C_DeclareBattleSequenceTimingsAsList, CallFunc_Conv_StringToText_ReturnValue_2) == 0x000320, "Member 'BP_BattleSequenceTimeline_C_DeclareBattleSequenceTimingsAsList::CallFunc_Conv_StringToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BattleSequenceTimeline_C_DeclareBattleSequenceTimingsAsList, K2Node_MakeStruct_FormatArgumentData_5) == 0x000330, "Member 'BP_BattleSequenceTimeline_C_DeclareBattleSequenceTimingsAsList::K2Node_MakeStruct_FormatArgumentData_5' has a wrong offset!");
static_assert(offsetof(BP_BattleSequenceTimeline_C_DeclareBattleSequenceTimingsAsList, K2Node_MakeArray_Array_2) == 0x000378, "Member 'BP_BattleSequenceTimeline_C_DeclareBattleSequenceTimingsAsList::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(BP_BattleSequenceTimeline_C_DeclareBattleSequenceTimingsAsList, CallFunc_Format_ReturnValue_2) == 0x000388, "Member 'BP_BattleSequenceTimeline_C_DeclareBattleSequenceTimingsAsList::CallFunc_Format_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BattleSequenceTimeline_C_DeclareBattleSequenceTimingsAsList, CallFunc_Add_DoubleDouble_A_ImplicitCast) == 0x000398, "Member 'BP_BattleSequenceTimeline_C_DeclareBattleSequenceTimingsAsList::CallFunc_Add_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function BP_BattleSequenceTimeline.BP_BattleSequenceTimeline_C.ExecuteUbergraph_BP_BattleSequenceTimeline
// 0x0058 (0x0058 - 0x0000)
struct BP_BattleSequenceTimeline_C_ExecuteUbergraph_BP_BattleSequenceTimeline final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_DoubleDouble_ReturnValue;        // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetUndilatedTimeSeconds_UndilatedTime;    // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UBP_UINavigationFocusEvent_C*     K2Node_Event_FocusEventBP;                         // 0x0010(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B[0x5];                                       // 0x001B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetUndilatedTimeSeconds_UndilatedTime_1;  // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetUndilatedTimeSeconds_UndilatedTime_2;  // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_DoubleDouble_ReturnValue_1;      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetUndilatedTimeSeconds_UndilatedTime_3;  // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1;  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BattleSequenceTimeline_C_ExecuteUbergraph_BP_BattleSequenceTimeline) == 0x000008, "Wrong alignment on BP_BattleSequenceTimeline_C_ExecuteUbergraph_BP_BattleSequenceTimeline");
static_assert(sizeof(BP_BattleSequenceTimeline_C_ExecuteUbergraph_BP_BattleSequenceTimeline) == 0x000058, "Wrong size on BP_BattleSequenceTimeline_C_ExecuteUbergraph_BP_BattleSequenceTimeline");
