#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BattleTowerSystem

#include "Basic.hpp"

#include "SandFall_structs.hpp"
#include "Engine_structs.hpp"
#include "S_Loot_structs.hpp"
#include "S_BattleTowerStageData_structs.hpp"
#include "S_BattleTowerSaveData_structs.hpp"
#include "S_BattleRewardParameters_structs.hpp"
#include "FBattleStartParams_structs.hpp"


namespace SDK::Params
{

// Function BP_BattleTowerSystem.BP_BattleTowerSystem_C.ComputeBattleParametersByIndex
// 0x0470 (0x0470 - 0x0000)
struct BP_BattleTowerSystem_C_ComputeBattleParametersByIndex final
{
public:
	int32                                         BattleIndex;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFBattleStartParams                    BattleParameters;                                  // 0x0008(0x0158)(Parm, OutParm, ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_VerifyBattleIndex_IsValid;                // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_BattleTowerStageData                Temp_wildcard_Variable;                            // 0x0168(0x0098)(HasGetValueTypeHash)
	struct FS_BattleRewardParameters              CallFunc_ComputeBattleRewardParameters_BattleRewardParameters; // 0x0200(0x0068)(HasGetValueTypeHash)
	struct FFBattleStartParams                    K2Node_MakeStruct_FBattleStartParams;              // 0x0268(0x0158)(ContainsInstancedReference, HasGetValueTypeHash)
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames;         // 0x03C0(0x0010)(ReferenceParm)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x03D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_BattleTowerStageData                CallFunc_GetDataTableRowFromName_OutRow;           // 0x03D8(0x0098)(HasGetValueTypeHash)
};
static_assert(alignof(BP_BattleTowerSystem_C_ComputeBattleParametersByIndex) == 0x000008, "Wrong alignment on BP_BattleTowerSystem_C_ComputeBattleParametersByIndex");
static_assert(sizeof(BP_BattleTowerSystem_C_ComputeBattleParametersByIndex) == 0x000470, "Wrong size on BP_BattleTowerSystem_C_ComputeBattleParametersByIndex");
static_assert(offsetof(BP_BattleTowerSystem_C_ComputeBattleParametersByIndex, BattleIndex) == 0x000000, "Member 'BP_BattleTowerSystem_C_ComputeBattleParametersByIndex::BattleIndex' has a wrong offset!");
static_assert(offsetof(BP_BattleTowerSystem_C_ComputeBattleParametersByIndex, BattleParameters) == 0x000008, "Member 'BP_BattleTowerSystem_C_ComputeBattleParametersByIndex::BattleParameters' has a wrong offset!");
static_assert(offsetof(BP_BattleTowerSystem_C_ComputeBattleParametersByIndex, CallFunc_VerifyBattleIndex_IsValid) == 0x000160, "Member 'BP_BattleTowerSystem_C_ComputeBattleParametersByIndex::CallFunc_VerifyBattleIndex_IsValid' has a wrong offset!");
static_assert(offsetof(BP_BattleTowerSystem_C_ComputeBattleParametersByIndex, Temp_wildcard_Variable) == 0x000168, "Member 'BP_BattleTowerSystem_C_ComputeBattleParametersByIndex::Temp_wildcard_Variable' has a wrong offset!");
static_assert(offsetof(BP_BattleTowerSystem_C_ComputeBattleParametersByIndex, CallFunc_ComputeBattleRewardParameters_BattleRewardParameters) == 0x000200, "Member 'BP_BattleTowerSystem_C_ComputeBattleParametersByIndex::CallFunc_ComputeBattleRewardParameters_BattleRewardParameters' has a wrong offset!");
static_assert(offsetof(BP_BattleTowerSystem_C_ComputeBattleParametersByIndex, K2Node_MakeStruct_FBattleStartParams) == 0x000268, "Member 'BP_BattleTowerSystem_C_ComputeBattleParametersByIndex::K2Node_MakeStruct_FBattleStartParams' has a wrong offset!");
static_assert(offsetof(BP_BattleTowerSystem_C_ComputeBattleParametersByIndex, CallFunc_GetDataTableRowNames_OutRowNames) == 0x0003C0, "Member 'BP_BattleTowerSystem_C_ComputeBattleParametersByIndex::CallFunc_GetDataTableRowNames_OutRowNames' has a wrong offset!");
static_assert(offsetof(BP_BattleTowerSystem_C_ComputeBattleParametersByIndex, CallFunc_Array_Get_Item) == 0x0003D0, "Member 'BP_BattleTowerSystem_C_ComputeBattleParametersByIndex::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_BattleTowerSystem_C_ComputeBattleParametersByIndex, CallFunc_GetDataTableRowFromName_OutRow) == 0x0003D8, "Member 'BP_BattleTowerSystem_C_ComputeBattleParametersByIndex::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");

// Function BP_BattleTowerSystem.BP_BattleTowerSystem_C.ComputeBattleRewardParameters
// 0x02C8 (0x02C8 - 0x0000)
struct BP_BattleTowerSystem_C_ComputeBattleRewardParameters final
{
public:
	int32                                         BattleIndex;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_BattleTowerStageData                BattleTowerStageData;                              // 0x0008(0x0098)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)
	struct FS_BattleRewardParameters              BattleRewardParameters;                            // 0x00A0(0x0068)(Parm, OutParm, HasGetValueTypeHash)
	TMap<class FName, int32>                      local_LootItems;                                   // 0x0108(0x0050)(Edit, BlueprintVisible)
	class FName                                   CallFunc_FindBattleIDFromIndex_BattleID;           // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16C[0x4];                                      // 0x016C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_Loot                                CallFunc_Array_Get_Item;                           // 0x0170(0x0028)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_199[0x3];                                      // 0x0199(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_BattleRewardParameters              K2Node_MakeStruct_S_BattleRewardParameters;        // 0x01A0(0x0068)(HasGetValueTypeHash)
	int32                                         CallFunc_Map_Find_Value;                           // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x020C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x020D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_20E[0x2];                                      // 0x020E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_BattleRewardParameters              K2Node_MakeStruct_S_BattleRewardParameters_1;      // 0x0210(0x0068)(HasGetValueTypeHash)
	TMap<class FName, int32>                      K2Node_MakeVariable_MakeVariableOutput;            // 0x0278(0x0050)()
};
static_assert(alignof(BP_BattleTowerSystem_C_ComputeBattleRewardParameters) == 0x000008, "Wrong alignment on BP_BattleTowerSystem_C_ComputeBattleRewardParameters");
static_assert(sizeof(BP_BattleTowerSystem_C_ComputeBattleRewardParameters) == 0x0002C8, "Wrong size on BP_BattleTowerSystem_C_ComputeBattleRewardParameters");
static_assert(offsetof(BP_BattleTowerSystem_C_ComputeBattleRewardParameters, BattleIndex) == 0x000000, "Member 'BP_BattleTowerSystem_C_ComputeBattleRewardParameters::BattleIndex' has a wrong offset!");
static_assert(offsetof(BP_BattleTowerSystem_C_ComputeBattleRewardParameters, BattleTowerStageData) == 0x000008, "Member 'BP_BattleTowerSystem_C_ComputeBattleRewardParameters::BattleTowerStageData' has a wrong offset!");
static_assert(offsetof(BP_BattleTowerSystem_C_ComputeBattleRewardParameters, BattleRewardParameters) == 0x0000A0, "Member 'BP_BattleTowerSystem_C_ComputeBattleRewardParameters::BattleRewardParameters' has a wrong offset!");
static_assert(offsetof(BP_BattleTowerSystem_C_ComputeBattleRewardParameters, local_LootItems) == 0x000108, "Member 'BP_BattleTowerSystem_C_ComputeBattleRewardParameters::local_LootItems' has a wrong offset!");
static_assert(offsetof(BP_BattleTowerSystem_C_ComputeBattleRewardParameters, CallFunc_FindBattleIDFromIndex_BattleID) == 0x000158, "Member 'BP_BattleTowerSystem_C_ComputeBattleRewardParameters::CallFunc_FindBattleIDFromIndex_BattleID' has a wrong offset!");
static_assert(offsetof(BP_BattleTowerSystem_C_ComputeBattleRewardParameters, CallFunc_Array_Length_ReturnValue) == 0x000160, "Member 'BP_BattleTowerSystem_C_ComputeBattleRewardParameters::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleTowerSystem_C_ComputeBattleRewardParameters, Temp_int_Array_Index_Variable) == 0x000164, "Member 'BP_BattleTowerSystem_C_ComputeBattleRewardParameters::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_BattleTowerSystem_C_ComputeBattleRewardParameters, Temp_int_Loop_Counter_Variable) == 0x000168, "Member 'BP_BattleTowerSystem_C_ComputeBattleRewardParameters::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_BattleTowerSystem_C_ComputeBattleRewardParameters, CallFunc_Array_Get_Item) == 0x000170, "Member 'BP_BattleTowerSystem_C_ComputeBattleRewardParameters::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_BattleTowerSystem_C_ComputeBattleRewardParameters, CallFunc_Less_IntInt_ReturnValue) == 0x000198, "Member 'BP_BattleTowerSystem_C_ComputeBattleRewardParameters::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleTowerSystem_C_ComputeBattleRewardParameters, CallFunc_Add_IntInt_ReturnValue) == 0x00019C, "Member 'BP_BattleTowerSystem_C_ComputeBattleRewardParameters::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleTowerSystem_C_ComputeBattleRewardParameters, K2Node_MakeStruct_S_BattleRewardParameters) == 0x0001A0, "Member 'BP_BattleTowerSystem_C_ComputeBattleRewardParameters::K2Node_MakeStruct_S_BattleRewardParameters' has a wrong offset!");
static_assert(offsetof(BP_BattleTowerSystem_C_ComputeBattleRewardParameters, CallFunc_Map_Find_Value) == 0x000208, "Member 'BP_BattleTowerSystem_C_ComputeBattleRewardParameters::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BP_BattleTowerSystem_C_ComputeBattleRewardParameters, CallFunc_Map_Find_ReturnValue) == 0x00020C, "Member 'BP_BattleTowerSystem_C_ComputeBattleRewardParameters::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleTowerSystem_C_ComputeBattleRewardParameters, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00020D, "Member 'BP_BattleTowerSystem_C_ComputeBattleRewardParameters::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleTowerSystem_C_ComputeBattleRewardParameters, K2Node_MakeStruct_S_BattleRewardParameters_1) == 0x000210, "Member 'BP_BattleTowerSystem_C_ComputeBattleRewardParameters::K2Node_MakeStruct_S_BattleRewardParameters_1' has a wrong offset!");
static_assert(offsetof(BP_BattleTowerSystem_C_ComputeBattleRewardParameters, K2Node_MakeVariable_MakeVariableOutput) == 0x000278, "Member 'BP_BattleTowerSystem_C_ComputeBattleRewardParameters::K2Node_MakeVariable_MakeVariableOutput' has a wrong offset!");

// Function BP_BattleTowerSystem.BP_BattleTowerSystem_C.DEBUG_UnlockAllBattles
// 0x0004 (0x0004 - 0x0000)
struct BP_BattleTowerSystem_C_DEBUG_UnlockAllBattles final
{
public:
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BattleTowerSystem_C_DEBUG_UnlockAllBattles) == 0x000004, "Wrong alignment on BP_BattleTowerSystem_C_DEBUG_UnlockAllBattles");
static_assert(sizeof(BP_BattleTowerSystem_C_DEBUG_UnlockAllBattles) == 0x000004, "Wrong size on BP_BattleTowerSystem_C_DEBUG_UnlockAllBattles");
static_assert(offsetof(BP_BattleTowerSystem_C_DEBUG_UnlockAllBattles, CallFunc_Subtract_IntInt_ReturnValue) == 0x000000, "Member 'BP_BattleTowerSystem_C_DEBUG_UnlockAllBattles::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");

// Function BP_BattleTowerSystem.BP_BattleTowerSystem_C.FindBattleIDFromIndex
// 0x00C0 (0x00C0 - 0x0000)
struct BP_BattleTowerSystem_C_FindBattleIDFromIndex final
{
public:
	int32                                         BattleIndex;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   BattleID;                                          // 0x0004(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_VerifyBattleIndex_IsValid;                // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames;         // 0x0010(0x0010)(ReferenceParm)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_BattleTowerStageData                CallFunc_GetDataTableRowFromName_OutRow;           // 0x0028(0x0098)(HasGetValueTypeHash)
};
static_assert(alignof(BP_BattleTowerSystem_C_FindBattleIDFromIndex) == 0x000008, "Wrong alignment on BP_BattleTowerSystem_C_FindBattleIDFromIndex");
static_assert(sizeof(BP_BattleTowerSystem_C_FindBattleIDFromIndex) == 0x0000C0, "Wrong size on BP_BattleTowerSystem_C_FindBattleIDFromIndex");
static_assert(offsetof(BP_BattleTowerSystem_C_FindBattleIDFromIndex, BattleIndex) == 0x000000, "Member 'BP_BattleTowerSystem_C_FindBattleIDFromIndex::BattleIndex' has a wrong offset!");
static_assert(offsetof(BP_BattleTowerSystem_C_FindBattleIDFromIndex, BattleID) == 0x000004, "Member 'BP_BattleTowerSystem_C_FindBattleIDFromIndex::BattleID' has a wrong offset!");
static_assert(offsetof(BP_BattleTowerSystem_C_FindBattleIDFromIndex, CallFunc_VerifyBattleIndex_IsValid) == 0x00000C, "Member 'BP_BattleTowerSystem_C_FindBattleIDFromIndex::CallFunc_VerifyBattleIndex_IsValid' has a wrong offset!");
static_assert(offsetof(BP_BattleTowerSystem_C_FindBattleIDFromIndex, CallFunc_GetDataTableRowNames_OutRowNames) == 0x000010, "Member 'BP_BattleTowerSystem_C_FindBattleIDFromIndex::CallFunc_GetDataTableRowNames_OutRowNames' has a wrong offset!");
static_assert(offsetof(BP_BattleTowerSystem_C_FindBattleIDFromIndex, CallFunc_Array_Get_Item) == 0x000020, "Member 'BP_BattleTowerSystem_C_FindBattleIDFromIndex::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_BattleTowerSystem_C_FindBattleIDFromIndex, CallFunc_GetDataTableRowFromName_OutRow) == 0x000028, "Member 'BP_BattleTowerSystem_C_FindBattleIDFromIndex::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");

// Function BP_BattleTowerSystem.BP_BattleTowerSystem_C.Initialize
// 0x0018 (0x0018 - 0x0000)
struct BP_BattleTowerSystem_C_Initialize final
{
public:
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames;         // 0x0000(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BattleTowerSystem_C_Initialize) == 0x000008, "Wrong alignment on BP_BattleTowerSystem_C_Initialize");
static_assert(sizeof(BP_BattleTowerSystem_C_Initialize) == 0x000018, "Wrong size on BP_BattleTowerSystem_C_Initialize");
static_assert(offsetof(BP_BattleTowerSystem_C_Initialize, CallFunc_GetDataTableRowNames_OutRowNames) == 0x000000, "Member 'BP_BattleTowerSystem_C_Initialize::CallFunc_GetDataTableRowNames_OutRowNames' has a wrong offset!");
static_assert(offsetof(BP_BattleTowerSystem_C_Initialize, CallFunc_Array_Length_ReturnValue) == 0x000010, "Member 'BP_BattleTowerSystem_C_Initialize::CallFunc_Array_Length_ReturnValue' has a wrong offset!");

// Function BP_BattleTowerSystem.BP_BattleTowerSystem_C.LoadState
// 0x0058 (0x0058 - 0x0000)
struct BP_BattleTowerSystem_C_LoadState final
{
public:
	struct FS_BattleTowerSaveData                 SaveData;                                          // 0x0000(0x0058)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(BP_BattleTowerSystem_C_LoadState) == 0x000008, "Wrong alignment on BP_BattleTowerSystem_C_LoadState");
static_assert(sizeof(BP_BattleTowerSystem_C_LoadState) == 0x000058, "Wrong size on BP_BattleTowerSystem_C_LoadState");
static_assert(offsetof(BP_BattleTowerSystem_C_LoadState, SaveData) == 0x000000, "Member 'BP_BattleTowerSystem_C_LoadState::SaveData' has a wrong offset!");

// Function BP_BattleTowerSystem.BP_BattleTowerSystem_C.OnBattleVictory
// 0x0060 (0x0060 - 0x0000)
struct BP_BattleTowerSystem_C_OnBattleVictory final
{
public:
	int32                                         BattleIndex;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_QuestSystem_C*                      CallFunc_GetQuestSystem_QuestSystem;               // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_FindBattleIDFromIndex_BattleID;           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_VerifyBattleIndex_IsValid;                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_QuestSystem_C*                      CallFunc_GetQuestSystem_QuestSystem_1;             // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FQuestObjectiveIdentifier              CallFunc_CreateQuestObjectiveIdentifier_ReturnValue; // 0x0030(0x0010)(NoDestructor)
	struct FQuestObjectiveIdentifier              CallFunc_CreateQuestObjectiveIdentifier_ReturnValue_1; // 0x0040(0x0010)(NoDestructor)
	int32                                         CallFunc_Map_Find_Value;                           // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Max_ReturnValue;                          // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BattleTowerSystem_C_OnBattleVictory) == 0x000008, "Wrong alignment on BP_BattleTowerSystem_C_OnBattleVictory");
static_assert(sizeof(BP_BattleTowerSystem_C_OnBattleVictory) == 0x000060, "Wrong size on BP_BattleTowerSystem_C_OnBattleVictory");
static_assert(offsetof(BP_BattleTowerSystem_C_OnBattleVictory, BattleIndex) == 0x000000, "Member 'BP_BattleTowerSystem_C_OnBattleVictory::BattleIndex' has a wrong offset!");
static_assert(offsetof(BP_BattleTowerSystem_C_OnBattleVictory, CallFunc_GetQuestSystem_QuestSystem) == 0x000008, "Member 'BP_BattleTowerSystem_C_OnBattleVictory::CallFunc_GetQuestSystem_QuestSystem' has a wrong offset!");
static_assert(offsetof(BP_BattleTowerSystem_C_OnBattleVictory, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000010, "Member 'BP_BattleTowerSystem_C_OnBattleVictory::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleTowerSystem_C_OnBattleVictory, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000011, "Member 'BP_BattleTowerSystem_C_OnBattleVictory::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BattleTowerSystem_C_OnBattleVictory, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'BP_BattleTowerSystem_C_OnBattleVictory::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleTowerSystem_C_OnBattleVictory, CallFunc_FindBattleIDFromIndex_BattleID) == 0x000018, "Member 'BP_BattleTowerSystem_C_OnBattleVictory::CallFunc_FindBattleIDFromIndex_BattleID' has a wrong offset!");
static_assert(offsetof(BP_BattleTowerSystem_C_OnBattleVictory, CallFunc_VerifyBattleIndex_IsValid) == 0x000020, "Member 'BP_BattleTowerSystem_C_OnBattleVictory::CallFunc_VerifyBattleIndex_IsValid' has a wrong offset!");
static_assert(offsetof(BP_BattleTowerSystem_C_OnBattleVictory, CallFunc_GetQuestSystem_QuestSystem_1) == 0x000028, "Member 'BP_BattleTowerSystem_C_OnBattleVictory::CallFunc_GetQuestSystem_QuestSystem_1' has a wrong offset!");
static_assert(offsetof(BP_BattleTowerSystem_C_OnBattleVictory, CallFunc_CreateQuestObjectiveIdentifier_ReturnValue) == 0x000030, "Member 'BP_BattleTowerSystem_C_OnBattleVictory::CallFunc_CreateQuestObjectiveIdentifier_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleTowerSystem_C_OnBattleVictory, CallFunc_CreateQuestObjectiveIdentifier_ReturnValue_1) == 0x000040, "Member 'BP_BattleTowerSystem_C_OnBattleVictory::CallFunc_CreateQuestObjectiveIdentifier_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BattleTowerSystem_C_OnBattleVictory, CallFunc_Map_Find_Value) == 0x000050, "Member 'BP_BattleTowerSystem_C_OnBattleVictory::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BP_BattleTowerSystem_C_OnBattleVictory, CallFunc_Map_Find_ReturnValue) == 0x000054, "Member 'BP_BattleTowerSystem_C_OnBattleVictory::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleTowerSystem_C_OnBattleVictory, CallFunc_Max_ReturnValue) == 0x000058, "Member 'BP_BattleTowerSystem_C_OnBattleVictory::CallFunc_Max_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleTowerSystem_C_OnBattleVictory, CallFunc_Add_IntInt_ReturnValue_1) == 0x00005C, "Member 'BP_BattleTowerSystem_C_OnBattleVictory::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");

// Function BP_BattleTowerSystem.BP_BattleTowerSystem_C.RetrieveUnlockedBattles
// 0x00F8 (0x00F8 - 0x0000)
struct BP_BattleTowerSystem_C_RetrieveUnlockedBattles final
{
public:
	TArray<struct FS_BattleTowerStageData>        BatteTowerStageDatas;                              // 0x0000(0x0010)(Parm, OutParm)
	TArray<struct FS_BattleTowerStageData>        local_StageDatas;                                  // 0x0010(0x0010)(Edit, BlueprintVisible)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames;         // 0x0030(0x0010)(ReferenceParm)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0044(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_BattleTowerStageData                CallFunc_GetDataTableRowFromName_OutRow;           // 0x0050(0x0098)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_ED[0x3];                                       // 0x00ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BattleTowerSystem_C_RetrieveUnlockedBattles) == 0x000008, "Wrong alignment on BP_BattleTowerSystem_C_RetrieveUnlockedBattles");
static_assert(sizeof(BP_BattleTowerSystem_C_RetrieveUnlockedBattles) == 0x0000F8, "Wrong size on BP_BattleTowerSystem_C_RetrieveUnlockedBattles");
static_assert(offsetof(BP_BattleTowerSystem_C_RetrieveUnlockedBattles, BatteTowerStageDatas) == 0x000000, "Member 'BP_BattleTowerSystem_C_RetrieveUnlockedBattles::BatteTowerStageDatas' has a wrong offset!");
static_assert(offsetof(BP_BattleTowerSystem_C_RetrieveUnlockedBattles, local_StageDatas) == 0x000010, "Member 'BP_BattleTowerSystem_C_RetrieveUnlockedBattles::local_StageDatas' has a wrong offset!");
static_assert(offsetof(BP_BattleTowerSystem_C_RetrieveUnlockedBattles, Temp_int_Array_Index_Variable) == 0x000020, "Member 'BP_BattleTowerSystem_C_RetrieveUnlockedBattles::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_BattleTowerSystem_C_RetrieveUnlockedBattles, Temp_int_Loop_Counter_Variable) == 0x000024, "Member 'BP_BattleTowerSystem_C_RetrieveUnlockedBattles::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_BattleTowerSystem_C_RetrieveUnlockedBattles, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'BP_BattleTowerSystem_C_RetrieveUnlockedBattles::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleTowerSystem_C_RetrieveUnlockedBattles, CallFunc_GetDataTableRowNames_OutRowNames) == 0x000030, "Member 'BP_BattleTowerSystem_C_RetrieveUnlockedBattles::CallFunc_GetDataTableRowNames_OutRowNames' has a wrong offset!");
static_assert(offsetof(BP_BattleTowerSystem_C_RetrieveUnlockedBattles, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000040, "Member 'BP_BattleTowerSystem_C_RetrieveUnlockedBattles::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleTowerSystem_C_RetrieveUnlockedBattles, CallFunc_Array_Get_Item) == 0x000044, "Member 'BP_BattleTowerSystem_C_RetrieveUnlockedBattles::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_BattleTowerSystem_C_RetrieveUnlockedBattles, CallFunc_GetDataTableRowFromName_OutRow) == 0x000050, "Member 'BP_BattleTowerSystem_C_RetrieveUnlockedBattles::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BP_BattleTowerSystem_C_RetrieveUnlockedBattles, CallFunc_Array_Length_ReturnValue) == 0x0000E8, "Member 'BP_BattleTowerSystem_C_RetrieveUnlockedBattles::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleTowerSystem_C_RetrieveUnlockedBattles, CallFunc_Less_IntInt_ReturnValue) == 0x0000EC, "Member 'BP_BattleTowerSystem_C_RetrieveUnlockedBattles::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleTowerSystem_C_RetrieveUnlockedBattles, CallFunc_Array_Add_ReturnValue) == 0x0000F0, "Member 'BP_BattleTowerSystem_C_RetrieveUnlockedBattles::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function BP_BattleTowerSystem.BP_BattleTowerSystem_C.SaveState
// 0x0058 (0x0058 - 0x0000)
struct BP_BattleTowerSystem_C_SaveState final
{
public:
	struct FS_BattleTowerSaveData                 SaveData;                                          // 0x0000(0x0058)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)
};
static_assert(alignof(BP_BattleTowerSystem_C_SaveState) == 0x000008, "Wrong alignment on BP_BattleTowerSystem_C_SaveState");
static_assert(sizeof(BP_BattleTowerSystem_C_SaveState) == 0x000058, "Wrong size on BP_BattleTowerSystem_C_SaveState");
static_assert(offsetof(BP_BattleTowerSystem_C_SaveState, SaveData) == 0x000000, "Member 'BP_BattleTowerSystem_C_SaveState::SaveData' has a wrong offset!");

// Function BP_BattleTowerSystem.BP_BattleTowerSystem_C.VerifyBattleIndex
// 0x0080 (0x0080 - 0x0000)
struct BP_BattleTowerSystem_C_VerifyBattleIndex final
{
public:
	int32                                         BattleIndex;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsValid;                                           // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0018(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0060(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Format_ReturnValue;                       // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BattleTowerSystem_C_VerifyBattleIndex) == 0x000008, "Wrong alignment on BP_BattleTowerSystem_C_VerifyBattleIndex");
static_assert(sizeof(BP_BattleTowerSystem_C_VerifyBattleIndex) == 0x000080, "Wrong size on BP_BattleTowerSystem_C_VerifyBattleIndex");
static_assert(offsetof(BP_BattleTowerSystem_C_VerifyBattleIndex, BattleIndex) == 0x000000, "Member 'BP_BattleTowerSystem_C_VerifyBattleIndex::BattleIndex' has a wrong offset!");
static_assert(offsetof(BP_BattleTowerSystem_C_VerifyBattleIndex, IsValid) == 0x000004, "Member 'BP_BattleTowerSystem_C_VerifyBattleIndex::IsValid' has a wrong offset!");
static_assert(offsetof(BP_BattleTowerSystem_C_VerifyBattleIndex, CallFunc_Less_IntInt_ReturnValue) == 0x000005, "Member 'BP_BattleTowerSystem_C_VerifyBattleIndex::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
