#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BattleDamages

#include "Basic.hpp"

#include "EMissReason_structs.hpp"
#include "EDamageReason_structs.hpp"
#include "Engine_structs.hpp"
#include "EDamageValueState_structs.hpp"
#include "EElementalAffinity_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "EAttackType_structs.hpp"
#include "FDamageModifier_structs.hpp"
#include "E_jRPG_StatType_structs.hpp"
#include "ECharacterTeamSelector_structs.hpp"


namespace SDK::Params
{

// Function BP_BattleDamages.BP_BattleDamages_C.AddAttackPowerModifier
// 0x00A8 (0x00A8 - 0x0000)
struct BP_BattleDamages_C_AddAttackPowerModifier final
{
public:
	struct FFDamageModifier                       Modifier;                                          // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0030(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0078(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0088(0x0010)()
	class FText                                   CallFunc_AppendStack__Content__Result;             // 0x0098(0x0010)()
};
static_assert(alignof(BP_BattleDamages_C_AddAttackPowerModifier) == 0x000008, "Wrong alignment on BP_BattleDamages_C_AddAttackPowerModifier");
static_assert(sizeof(BP_BattleDamages_C_AddAttackPowerModifier) == 0x0000A8, "Wrong size on BP_BattleDamages_C_AddAttackPowerModifier");
static_assert(offsetof(BP_BattleDamages_C_AddAttackPowerModifier, Modifier) == 0x000000, "Member 'BP_BattleDamages_C_AddAttackPowerModifier::Modifier' has a wrong offset!");
static_assert(offsetof(BP_BattleDamages_C_AddAttackPowerModifier, CallFunc_Not_PreBool_ReturnValue) == 0x000028, "Member 'BP_BattleDamages_C_AddAttackPowerModifier::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleDamages_C_AddAttackPowerModifier, K2Node_MakeStruct_FormatArgumentData) == 0x000030, "Member 'BP_BattleDamages_C_AddAttackPowerModifier::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_BattleDamages_C_AddAttackPowerModifier, K2Node_MakeArray_Array) == 0x000078, "Member 'BP_BattleDamages_C_AddAttackPowerModifier::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_BattleDamages_C_AddAttackPowerModifier, CallFunc_Format_ReturnValue) == 0x000088, "Member 'BP_BattleDamages_C_AddAttackPowerModifier::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleDamages_C_AddAttackPowerModifier, CallFunc_AppendStack__Content__Result) == 0x000098, "Member 'BP_BattleDamages_C_AddAttackPowerModifier::CallFunc_AppendStack__Content__Result' has a wrong offset!");

// Function BP_BattleDamages.BP_BattleDamages_C.AddBreakBarDamageMultiplier
// 0x0178 (0x0178 - 0x0000)
struct BP_BattleDamages_C_AddBreakBarDamageMultiplier final
{
public:
	double                                        Multiplier;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Reason;                                            // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPackagedForDistribution_ReturnValue;    // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0020(0x0010)()
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0038(0x0048)(HasGetValueTypeHash)
	bool                                          CallFunc_IsEmpty_ReturnValue;                      // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_DoubleDouble_ReturnValue;        // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_82[0x6];                                       // 0x0082(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0088(0x0048)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x00D0(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0118(0x0010)(ReferenceParm)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0128(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Format_ReturnValue;                       // 0x0138(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Format_ReturnValue_1;                     // 0x0148(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0158(0x0010)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BattleDamages_C_AddBreakBarDamageMultiplier) == 0x000008, "Wrong alignment on BP_BattleDamages_C_AddBreakBarDamageMultiplier");
static_assert(sizeof(BP_BattleDamages_C_AddBreakBarDamageMultiplier) == 0x000178, "Wrong size on BP_BattleDamages_C_AddBreakBarDamageMultiplier");
static_assert(offsetof(BP_BattleDamages_C_AddBreakBarDamageMultiplier, Multiplier) == 0x000000, "Member 'BP_BattleDamages_C_AddBreakBarDamageMultiplier::Multiplier' has a wrong offset!");
static_assert(offsetof(BP_BattleDamages_C_AddBreakBarDamageMultiplier, Reason) == 0x000008, "Member 'BP_BattleDamages_C_AddBreakBarDamageMultiplier::Reason' has a wrong offset!");
static_assert(offsetof(BP_BattleDamages_C_AddBreakBarDamageMultiplier, CallFunc_IsPackagedForDistribution_ReturnValue) == 0x000018, "Member 'BP_BattleDamages_C_AddBreakBarDamageMultiplier::CallFunc_IsPackagedForDistribution_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleDamages_C_AddBreakBarDamageMultiplier, CallFunc_Conv_StringToText_ReturnValue) == 0x000020, "Member 'BP_BattleDamages_C_AddBreakBarDamageMultiplier::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleDamages_C_AddBreakBarDamageMultiplier, CallFunc_Not_PreBool_ReturnValue) == 0x000030, "Member 'BP_BattleDamages_C_AddBreakBarDamageMultiplier::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleDamages_C_AddBreakBarDamageMultiplier, K2Node_MakeStruct_FormatArgumentData) == 0x000038, "Member 'BP_BattleDamages_C_AddBreakBarDamageMultiplier::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_BattleDamages_C_AddBreakBarDamageMultiplier, CallFunc_IsEmpty_ReturnValue) == 0x000080, "Member 'BP_BattleDamages_C_AddBreakBarDamageMultiplier::CallFunc_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleDamages_C_AddBreakBarDamageMultiplier, CallFunc_NotEqual_DoubleDouble_ReturnValue) == 0x000081, "Member 'BP_BattleDamages_C_AddBreakBarDamageMultiplier::CallFunc_NotEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleDamages_C_AddBreakBarDamageMultiplier, K2Node_MakeStruct_FormatArgumentData_1) == 0x000088, "Member 'BP_BattleDamages_C_AddBreakBarDamageMultiplier::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BP_BattleDamages_C_AddBreakBarDamageMultiplier, K2Node_MakeStruct_FormatArgumentData_2) == 0x0000D0, "Member 'BP_BattleDamages_C_AddBreakBarDamageMultiplier::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(BP_BattleDamages_C_AddBreakBarDamageMultiplier, K2Node_MakeArray_Array) == 0x000118, "Member 'BP_BattleDamages_C_AddBreakBarDamageMultiplier::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_BattleDamages_C_AddBreakBarDamageMultiplier, K2Node_MakeArray_Array_1) == 0x000128, "Member 'BP_BattleDamages_C_AddBreakBarDamageMultiplier::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BP_BattleDamages_C_AddBreakBarDamageMultiplier, CallFunc_Format_ReturnValue) == 0x000138, "Member 'BP_BattleDamages_C_AddBreakBarDamageMultiplier::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleDamages_C_AddBreakBarDamageMultiplier, CallFunc_Format_ReturnValue_1) == 0x000148, "Member 'BP_BattleDamages_C_AddBreakBarDamageMultiplier::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BattleDamages_C_AddBreakBarDamageMultiplier, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000158, "Member 'BP_BattleDamages_C_AddBreakBarDamageMultiplier::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BattleDamages_C_AddBreakBarDamageMultiplier, CallFunc_IsValid_ReturnValue) == 0x000168, "Member 'BP_BattleDamages_C_AddBreakBarDamageMultiplier::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleDamages_C_AddBreakBarDamageMultiplier, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000170, "Member 'BP_BattleDamages_C_AddBreakBarDamageMultiplier::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");

// Function BP_BattleDamages.BP_BattleDamages_C.AddCriticalHitExtraChance
// 0x0038 (0x0038 - 0x0000)
struct BP_BattleDamages_C_AddCriticalHitExtraChance final
{
public:
	double                                        Chance__0_0_1_0;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 DebugReason;                                       // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0018(0x0010)()
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckEditableValue_Modify_Allowed;        // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BattleDamages_C_AddCriticalHitExtraChance) == 0x000008, "Wrong alignment on BP_BattleDamages_C_AddCriticalHitExtraChance");
static_assert(sizeof(BP_BattleDamages_C_AddCriticalHitExtraChance) == 0x000038, "Wrong size on BP_BattleDamages_C_AddCriticalHitExtraChance");
static_assert(offsetof(BP_BattleDamages_C_AddCriticalHitExtraChance, Chance__0_0_1_0) == 0x000000, "Member 'BP_BattleDamages_C_AddCriticalHitExtraChance::Chance__0_0_1_0' has a wrong offset!");
static_assert(offsetof(BP_BattleDamages_C_AddCriticalHitExtraChance, DebugReason) == 0x000008, "Member 'BP_BattleDamages_C_AddCriticalHitExtraChance::DebugReason' has a wrong offset!");
static_assert(offsetof(BP_BattleDamages_C_AddCriticalHitExtraChance, CallFunc_Conv_StringToText_ReturnValue) == 0x000018, "Member 'BP_BattleDamages_C_AddCriticalHitExtraChance::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleDamages_C_AddCriticalHitExtraChance, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000028, "Member 'BP_BattleDamages_C_AddCriticalHitExtraChance::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleDamages_C_AddCriticalHitExtraChance, CallFunc_CheckEditableValue_Modify_Allowed) == 0x000030, "Member 'BP_BattleDamages_C_AddCriticalHitExtraChance::CallFunc_CheckEditableValue_Modify_Allowed' has a wrong offset!");

// Function BP_BattleDamages.BP_BattleDamages_C.AddDamageModifier
// 0x0028 (0x0028 - 0x0000)
struct BP_BattleDamages_C_AddDamageModifier final
{
public:
	struct FFDamageModifier                       Modifier;                                          // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)
};
static_assert(alignof(BP_BattleDamages_C_AddDamageModifier) == 0x000008, "Wrong alignment on BP_BattleDamages_C_AddDamageModifier");
static_assert(sizeof(BP_BattleDamages_C_AddDamageModifier) == 0x000028, "Wrong size on BP_BattleDamages_C_AddDamageModifier");
static_assert(offsetof(BP_BattleDamages_C_AddDamageModifier, Modifier) == 0x000000, "Member 'BP_BattleDamages_C_AddDamageModifier::Modifier' has a wrong offset!");

// Function BP_BattleDamages.BP_BattleDamages_C.AddModifierInternal
// 0x0030 (0x0030 - 0x0000)
struct BP_BattleDamages_C_AddModifierInternal final
{
public:
	struct FFDamageModifier                       Modifier;                                          // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BattleDamages_C_AddModifierInternal) == 0x000008, "Wrong alignment on BP_BattleDamages_C_AddModifierInternal");
static_assert(sizeof(BP_BattleDamages_C_AddModifierInternal) == 0x000030, "Wrong size on BP_BattleDamages_C_AddModifierInternal");
static_assert(offsetof(BP_BattleDamages_C_AddModifierInternal, Modifier) == 0x000000, "Member 'BP_BattleDamages_C_AddModifierInternal::Modifier' has a wrong offset!");
static_assert(offsetof(BP_BattleDamages_C_AddModifierInternal, CallFunc_Array_Add_ReturnValue) == 0x000028, "Member 'BP_BattleDamages_C_AddModifierInternal::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function BP_BattleDamages.BP_BattleDamages_C.ApplyActiveModifiers
// 0x00B0 (0x00B0 - 0x0000)
struct BP_BattleDamages_C_ApplyActiveModifiers final
{
public:
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0000(0x0048)(HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0050(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0060(0x0010)()
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_ComputeDamageModifiers_Base;              // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FText>                           CallFunc_ComputeDamageModifiers_DamageLogs;        // 0x0088(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Array_Get_Item;                           // 0x0098(0x0010)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BattleDamages_C_ApplyActiveModifiers) == 0x000008, "Wrong alignment on BP_BattleDamages_C_ApplyActiveModifiers");
static_assert(sizeof(BP_BattleDamages_C_ApplyActiveModifiers) == 0x0000B0, "Wrong size on BP_BattleDamages_C_ApplyActiveModifiers");
static_assert(offsetof(BP_BattleDamages_C_ApplyActiveModifiers, K2Node_MakeStruct_FormatArgumentData) == 0x000000, "Member 'BP_BattleDamages_C_ApplyActiveModifiers::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_BattleDamages_C_ApplyActiveModifiers, Temp_int_Array_Index_Variable) == 0x000048, "Member 'BP_BattleDamages_C_ApplyActiveModifiers::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_BattleDamages_C_ApplyActiveModifiers, K2Node_MakeArray_Array) == 0x000050, "Member 'BP_BattleDamages_C_ApplyActiveModifiers::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_BattleDamages_C_ApplyActiveModifiers, CallFunc_Format_ReturnValue) == 0x000060, "Member 'BP_BattleDamages_C_ApplyActiveModifiers::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleDamages_C_ApplyActiveModifiers, Temp_int_Loop_Counter_Variable) == 0x000070, "Member 'BP_BattleDamages_C_ApplyActiveModifiers::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_BattleDamages_C_ApplyActiveModifiers, CallFunc_IsValid_ReturnValue) == 0x000074, "Member 'BP_BattleDamages_C_ApplyActiveModifiers::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleDamages_C_ApplyActiveModifiers, CallFunc_Add_IntInt_ReturnValue) == 0x000078, "Member 'BP_BattleDamages_C_ApplyActiveModifiers::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleDamages_C_ApplyActiveModifiers, CallFunc_ComputeDamageModifiers_Base) == 0x000080, "Member 'BP_BattleDamages_C_ApplyActiveModifiers::CallFunc_ComputeDamageModifiers_Base' has a wrong offset!");
static_assert(offsetof(BP_BattleDamages_C_ApplyActiveModifiers, CallFunc_ComputeDamageModifiers_DamageLogs) == 0x000088, "Member 'BP_BattleDamages_C_ApplyActiveModifiers::CallFunc_ComputeDamageModifiers_DamageLogs' has a wrong offset!");
static_assert(offsetof(BP_BattleDamages_C_ApplyActiveModifiers, CallFunc_Array_Get_Item) == 0x000098, "Member 'BP_BattleDamages_C_ApplyActiveModifiers::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_BattleDamages_C_ApplyActiveModifiers, CallFunc_Array_Length_ReturnValue) == 0x0000A8, "Member 'BP_BattleDamages_C_ApplyActiveModifiers::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleDamages_C_ApplyActiveModifiers, CallFunc_Less_IntInt_ReturnValue) == 0x0000AC, "Member 'BP_BattleDamages_C_ApplyActiveModifiers::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function BP_BattleDamages.BP_BattleDamages_C.ApplyAffinitiesModifiers
// 0x0188 (0x0188 - 0x0000)
struct BP_BattleDamages_C_ApplyAffinitiesModifiers final
{
public:
	EElementalAffinity                            Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable;                                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1;                              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_2;                              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_3;                              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_4;                              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_5;                              // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EElementalAffinity                            Temp_byte_Variable_1;                              // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_6;                              // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_7;                              // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_8;                              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_9;                              // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_10;                             // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_11;                             // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Select_Default;                             // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0078(0x0048)(HasGetValueTypeHash)
	double                                        K2Node_Select_Default_1;                           // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00C8(0x0010)(ReferenceParm)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00D8(0x0048)(HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0120(0x0010)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0130(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0140(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0150(0x0010)()
	struct FFDamageModifier                       K2Node_MakeStruct_FDamageModifier;                 // 0x0160(0x0028)(HasGetValueTypeHash)
};
static_assert(alignof(BP_BattleDamages_C_ApplyAffinitiesModifiers) == 0x000008, "Wrong alignment on BP_BattleDamages_C_ApplyAffinitiesModifiers");
static_assert(sizeof(BP_BattleDamages_C_ApplyAffinitiesModifiers) == 0x000188, "Wrong size on BP_BattleDamages_C_ApplyAffinitiesModifiers");
static_assert(offsetof(BP_BattleDamages_C_ApplyAffinitiesModifiers, Temp_byte_Variable) == 0x000000, "Member 'BP_BattleDamages_C_ApplyAffinitiesModifiers::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_BattleDamages_C_ApplyAffinitiesModifiers, Temp_real_Variable) == 0x000008, "Member 'BP_BattleDamages_C_ApplyAffinitiesModifiers::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(BP_BattleDamages_C_ApplyAffinitiesModifiers, Temp_real_Variable_1) == 0x000010, "Member 'BP_BattleDamages_C_ApplyAffinitiesModifiers::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_BattleDamages_C_ApplyAffinitiesModifiers, Temp_real_Variable_2) == 0x000018, "Member 'BP_BattleDamages_C_ApplyAffinitiesModifiers::Temp_real_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_BattleDamages_C_ApplyAffinitiesModifiers, Temp_real_Variable_3) == 0x000020, "Member 'BP_BattleDamages_C_ApplyAffinitiesModifiers::Temp_real_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_BattleDamages_C_ApplyAffinitiesModifiers, Temp_real_Variable_4) == 0x000028, "Member 'BP_BattleDamages_C_ApplyAffinitiesModifiers::Temp_real_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_BattleDamages_C_ApplyAffinitiesModifiers, Temp_real_Variable_5) == 0x000030, "Member 'BP_BattleDamages_C_ApplyAffinitiesModifiers::Temp_real_Variable_5' has a wrong offset!");
static_assert(offsetof(BP_BattleDamages_C_ApplyAffinitiesModifiers, Temp_byte_Variable_1) == 0x000038, "Member 'BP_BattleDamages_C_ApplyAffinitiesModifiers::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_BattleDamages_C_ApplyAffinitiesModifiers, Temp_real_Variable_6) == 0x000040, "Member 'BP_BattleDamages_C_ApplyAffinitiesModifiers::Temp_real_Variable_6' has a wrong offset!");
static_assert(offsetof(BP_BattleDamages_C_ApplyAffinitiesModifiers, Temp_real_Variable_7) == 0x000048, "Member 'BP_BattleDamages_C_ApplyAffinitiesModifiers::Temp_real_Variable_7' has a wrong offset!");
static_assert(offsetof(BP_BattleDamages_C_ApplyAffinitiesModifiers, Temp_real_Variable_8) == 0x000050, "Member 'BP_BattleDamages_C_ApplyAffinitiesModifiers::Temp_real_Variable_8' has a wrong offset!");
static_assert(offsetof(BP_BattleDamages_C_ApplyAffinitiesModifiers, Temp_real_Variable_9) == 0x000058, "Member 'BP_BattleDamages_C_ApplyAffinitiesModifiers::Temp_real_Variable_9' has a wrong offset!");
static_assert(offsetof(BP_BattleDamages_C_ApplyAffinitiesModifiers, Temp_real_Variable_10) == 0x000060, "Member 'BP_BattleDamages_C_ApplyAffinitiesModifiers::Temp_real_Variable_10' has a wrong offset!");
static_assert(offsetof(BP_BattleDamages_C_ApplyAffinitiesModifiers, Temp_real_Variable_11) == 0x000068, "Member 'BP_BattleDamages_C_ApplyAffinitiesModifiers::Temp_real_Variable_11' has a wrong offset!");
static_assert(offsetof(BP_BattleDamages_C_ApplyAffinitiesModifiers, K2Node_Select_Default) == 0x000070, "Member 'BP_BattleDamages_C_ApplyAffinitiesModifiers::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_BattleDamages_C_ApplyAffinitiesModifiers, K2Node_MakeStruct_FormatArgumentData) == 0x000078, "Member 'BP_BattleDamages_C_ApplyAffinitiesModifiers::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_BattleDamages_C_ApplyAffinitiesModifiers, K2Node_Select_Default_1) == 0x0000C0, "Member 'BP_BattleDamages_C_ApplyAffinitiesModifiers::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(BP_BattleDamages_C_ApplyAffinitiesModifiers, K2Node_MakeArray_Array) == 0x0000C8, "Member 'BP_BattleDamages_C_ApplyAffinitiesModifiers::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_BattleDamages_C_ApplyAffinitiesModifiers, K2Node_MakeStruct_FormatArgumentData_1) == 0x0000D8, "Member 'BP_BattleDamages_C_ApplyAffinitiesModifiers::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BP_BattleDamages_C_ApplyAffinitiesModifiers, CallFunc_Format_ReturnValue) == 0x000120, "Member 'BP_BattleDamages_C_ApplyAffinitiesModifiers::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleDamages_C_ApplyAffinitiesModifiers, K2Node_MakeArray_Array_1) == 0x000130, "Member 'BP_BattleDamages_C_ApplyAffinitiesModifiers::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BP_BattleDamages_C_ApplyAffinitiesModifiers, CallFunc_Conv_TextToString_ReturnValue) == 0x000140, "Member 'BP_BattleDamages_C_ApplyAffinitiesModifiers::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleDamages_C_ApplyAffinitiesModifiers, CallFunc_Format_ReturnValue_1) == 0x000150, "Member 'BP_BattleDamages_C_ApplyAffinitiesModifiers::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BattleDamages_C_ApplyAffinitiesModifiers, K2Node_MakeStruct_FDamageModifier) == 0x000160, "Member 'BP_BattleDamages_C_ApplyAffinitiesModifiers::K2Node_MakeStruct_FDamageModifier' has a wrong offset!");

// Function BP_BattleDamages.BP_BattleDamages_C.ApplyClamp
// 0x0018 (0x0018 - 0x0000)
struct BP_BattleDamages_C_ApplyClamp final
{
public:
	ECharacterTeamSelector                        CallFunc_GetTeam_Team;                             // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetReferenceCounterState_ReturnValue;     // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BattleDamages_C_ApplyClamp) == 0x000008, "Wrong alignment on BP_BattleDamages_C_ApplyClamp");
static_assert(sizeof(BP_BattleDamages_C_ApplyClamp) == 0x000018, "Wrong size on BP_BattleDamages_C_ApplyClamp");
static_assert(offsetof(BP_BattleDamages_C_ApplyClamp, CallFunc_GetTeam_Team) == 0x000000, "Member 'BP_BattleDamages_C_ApplyClamp::CallFunc_GetTeam_Team' has a wrong offset!");
static_assert(offsetof(BP_BattleDamages_C_ApplyClamp, CallFunc_FClamp_ReturnValue) == 0x000008, "Member 'BP_BattleDamages_C_ApplyClamp::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleDamages_C_ApplyClamp, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000010, "Member 'BP_BattleDamages_C_ApplyClamp::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleDamages_C_ApplyClamp, CallFunc_GetReferenceCounterState_ReturnValue) == 0x000011, "Member 'BP_BattleDamages_C_ApplyClamp::CallFunc_GetReferenceCounterState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleDamages_C_ApplyClamp, CallFunc_Not_PreBool_ReturnValue) == 0x000012, "Member 'BP_BattleDamages_C_ApplyClamp::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function BP_BattleDamages.BP_BattleDamages_C.ApplyCommonDamageMultipliers
// 0x0160 (0x0160 - 0x0000)
struct BP_BattleDamages_C_ApplyCommonDamageMultipliers final
{
public:
	class FString                                 Temp_string_Variable;                              // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable_1;                            // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_wildcard_Variable;                            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0038(0x0048)(HasGetValueTypeHash)
	TArray<EDamageReason>                         K2Node_MakeArray_Array;                            // 0x0080(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_92[0x6];                                       // 0x0092(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_Select_Default;                             // 0x0098(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x00B0(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00C0(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0108(0x0010)(ReferenceParm)
	class UAC_jRPG_CharacterBattleStats_C*        CallFunc_GetTargetCharacter_NewParam;              // 0x0118(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0120(0x0010)()
	double                                        K2Node_Select_Default_1;                           // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFDamageModifier                       K2Node_MakeStruct_FDamageModifier;                 // 0x0138(0x0028)(HasGetValueTypeHash)
};
static_assert(alignof(BP_BattleDamages_C_ApplyCommonDamageMultipliers) == 0x000008, "Wrong alignment on BP_BattleDamages_C_ApplyCommonDamageMultipliers");
static_assert(sizeof(BP_BattleDamages_C_ApplyCommonDamageMultipliers) == 0x000160, "Wrong size on BP_BattleDamages_C_ApplyCommonDamageMultipliers");
static_assert(offsetof(BP_BattleDamages_C_ApplyCommonDamageMultipliers, Temp_string_Variable) == 0x000000, "Member 'BP_BattleDamages_C_ApplyCommonDamageMultipliers::Temp_string_Variable' has a wrong offset!");
static_assert(offsetof(BP_BattleDamages_C_ApplyCommonDamageMultipliers, Temp_string_Variable_1) == 0x000010, "Member 'BP_BattleDamages_C_ApplyCommonDamageMultipliers::Temp_string_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_BattleDamages_C_ApplyCommonDamageMultipliers, Temp_bool_Variable) == 0x000020, "Member 'BP_BattleDamages_C_ApplyCommonDamageMultipliers::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_BattleDamages_C_ApplyCommonDamageMultipliers, Temp_wildcard_Variable) == 0x000028, "Member 'BP_BattleDamages_C_ApplyCommonDamageMultipliers::Temp_wildcard_Variable' has a wrong offset!");
static_assert(offsetof(BP_BattleDamages_C_ApplyCommonDamageMultipliers, Temp_bool_Variable_1) == 0x000030, "Member 'BP_BattleDamages_C_ApplyCommonDamageMultipliers::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_BattleDamages_C_ApplyCommonDamageMultipliers, K2Node_MakeStruct_FormatArgumentData) == 0x000038, "Member 'BP_BattleDamages_C_ApplyCommonDamageMultipliers::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_BattleDamages_C_ApplyCommonDamageMultipliers, K2Node_MakeArray_Array) == 0x000080, "Member 'BP_BattleDamages_C_ApplyCommonDamageMultipliers::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_BattleDamages_C_ApplyCommonDamageMultipliers, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000090, "Member 'BP_BattleDamages_C_ApplyCommonDamageMultipliers::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleDamages_C_ApplyCommonDamageMultipliers, CallFunc_Array_Contains_ReturnValue) == 0x000091, "Member 'BP_BattleDamages_C_ApplyCommonDamageMultipliers::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleDamages_C_ApplyCommonDamageMultipliers, K2Node_Select_Default) == 0x000098, "Member 'BP_BattleDamages_C_ApplyCommonDamageMultipliers::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_BattleDamages_C_ApplyCommonDamageMultipliers, CallFunc_Not_PreBool_ReturnValue) == 0x0000A8, "Member 'BP_BattleDamages_C_ApplyCommonDamageMultipliers::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleDamages_C_ApplyCommonDamageMultipliers, CallFunc_Conv_StringToText_ReturnValue) == 0x0000B0, "Member 'BP_BattleDamages_C_ApplyCommonDamageMultipliers::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleDamages_C_ApplyCommonDamageMultipliers, K2Node_MakeStruct_FormatArgumentData_1) == 0x0000C0, "Member 'BP_BattleDamages_C_ApplyCommonDamageMultipliers::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BP_BattleDamages_C_ApplyCommonDamageMultipliers, K2Node_MakeArray_Array_1) == 0x000108, "Member 'BP_BattleDamages_C_ApplyCommonDamageMultipliers::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BP_BattleDamages_C_ApplyCommonDamageMultipliers, CallFunc_GetTargetCharacter_NewParam) == 0x000118, "Member 'BP_BattleDamages_C_ApplyCommonDamageMultipliers::CallFunc_GetTargetCharacter_NewParam' has a wrong offset!");
static_assert(offsetof(BP_BattleDamages_C_ApplyCommonDamageMultipliers, CallFunc_Format_ReturnValue) == 0x000120, "Member 'BP_BattleDamages_C_ApplyCommonDamageMultipliers::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleDamages_C_ApplyCommonDamageMultipliers, K2Node_Select_Default_1) == 0x000130, "Member 'BP_BattleDamages_C_ApplyCommonDamageMultipliers::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(BP_BattleDamages_C_ApplyCommonDamageMultipliers, K2Node_MakeStruct_FDamageModifier) == 0x000138, "Member 'BP_BattleDamages_C_ApplyCommonDamageMultipliers::K2Node_MakeStruct_FDamageModifier' has a wrong offset!");

// Function BP_BattleDamages.BP_BattleDamages_C.ApplyCriticalHitModifiers
// 0x0288 (0x0288 - 0x0000)
struct BP_BattleDamages_C_ApplyCriticalHitModifiers final
{
public:
	bool                                          IsCriticalHit_0;                                   // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          local_forceCritical;                               // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0008(0x0010)()
	class FText                                   Temp_text_Variable_1;                              // 0x0018(0x0010)()
	bool                                          Temp_bool_Variable;                                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetCriticalRollToBeat_Value;              // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0040(0x0048)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0088(0x0048)(HasGetValueTypeHash)
	class FText                                   K2Node_Select_Default;                             // 0x00D0(0x0010)()
	double                                        CallFunc_GetCriticalRollToBeat_Value_1;            // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x00E8(0x0048)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x0130(0x0048)(HasGetValueTypeHash)
	double                                        CallFunc_MakeLiteralDouble_ReturnValue;            // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_4;            // 0x0188(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x01D0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x01E0(0x0010)()
	struct FFDamageModifier                       K2Node_MakeStruct_FDamageModifier;                 // 0x01F0(0x0028)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_5;            // 0x0218(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0260(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0270(0x0010)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetConsoleVariableBoolValue_ReturnValue;  // 0x0281(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BattleDamages_C_ApplyCriticalHitModifiers) == 0x000008, "Wrong alignment on BP_BattleDamages_C_ApplyCriticalHitModifiers");
static_assert(sizeof(BP_BattleDamages_C_ApplyCriticalHitModifiers) == 0x000288, "Wrong size on BP_BattleDamages_C_ApplyCriticalHitModifiers");
static_assert(offsetof(BP_BattleDamages_C_ApplyCriticalHitModifiers, IsCriticalHit_0) == 0x000000, "Member 'BP_BattleDamages_C_ApplyCriticalHitModifiers::IsCriticalHit_0' has a wrong offset!");
static_assert(offsetof(BP_BattleDamages_C_ApplyCriticalHitModifiers, local_forceCritical) == 0x000001, "Member 'BP_BattleDamages_C_ApplyCriticalHitModifiers::local_forceCritical' has a wrong offset!");
static_assert(offsetof(BP_BattleDamages_C_ApplyCriticalHitModifiers, Temp_text_Variable) == 0x000008, "Member 'BP_BattleDamages_C_ApplyCriticalHitModifiers::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(BP_BattleDamages_C_ApplyCriticalHitModifiers, Temp_text_Variable_1) == 0x000018, "Member 'BP_BattleDamages_C_ApplyCriticalHitModifiers::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_BattleDamages_C_ApplyCriticalHitModifiers, Temp_bool_Variable) == 0x000028, "Member 'BP_BattleDamages_C_ApplyCriticalHitModifiers::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_BattleDamages_C_ApplyCriticalHitModifiers, CallFunc_GetCriticalRollToBeat_Value) == 0x000030, "Member 'BP_BattleDamages_C_ApplyCriticalHitModifiers::CallFunc_GetCriticalRollToBeat_Value' has a wrong offset!");
static_assert(offsetof(BP_BattleDamages_C_ApplyCriticalHitModifiers, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000038, "Member 'BP_BattleDamages_C_ApplyCriticalHitModifiers::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleDamages_C_ApplyCriticalHitModifiers, K2Node_MakeStruct_FormatArgumentData) == 0x000040, "Member 'BP_BattleDamages_C_ApplyCriticalHitModifiers::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_BattleDamages_C_ApplyCriticalHitModifiers, K2Node_MakeStruct_FormatArgumentData_1) == 0x000088, "Member 'BP_BattleDamages_C_ApplyCriticalHitModifiers::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BP_BattleDamages_C_ApplyCriticalHitModifiers, K2Node_Select_Default) == 0x0000D0, "Member 'BP_BattleDamages_C_ApplyCriticalHitModifiers::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_BattleDamages_C_ApplyCriticalHitModifiers, CallFunc_GetCriticalRollToBeat_Value_1) == 0x0000E0, "Member 'BP_BattleDamages_C_ApplyCriticalHitModifiers::CallFunc_GetCriticalRollToBeat_Value_1' has a wrong offset!");
static_assert(offsetof(BP_BattleDamages_C_ApplyCriticalHitModifiers, K2Node_MakeStruct_FormatArgumentData_2) == 0x0000E8, "Member 'BP_BattleDamages_C_ApplyCriticalHitModifiers::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(BP_BattleDamages_C_ApplyCriticalHitModifiers, K2Node_MakeStruct_FormatArgumentData_3) == 0x000130, "Member 'BP_BattleDamages_C_ApplyCriticalHitModifiers::K2Node_MakeStruct_FormatArgumentData_3' has a wrong offset!");
static_assert(offsetof(BP_BattleDamages_C_ApplyCriticalHitModifiers, CallFunc_MakeLiteralDouble_ReturnValue) == 0x000178, "Member 'BP_BattleDamages_C_ApplyCriticalHitModifiers::CallFunc_MakeLiteralDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleDamages_C_ApplyCriticalHitModifiers, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000180, "Member 'BP_BattleDamages_C_ApplyCriticalHitModifiers::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleDamages_C_ApplyCriticalHitModifiers, K2Node_MakeStruct_FormatArgumentData_4) == 0x000188, "Member 'BP_BattleDamages_C_ApplyCriticalHitModifiers::K2Node_MakeStruct_FormatArgumentData_4' has a wrong offset!");
static_assert(offsetof(BP_BattleDamages_C_ApplyCriticalHitModifiers, K2Node_MakeArray_Array) == 0x0001D0, "Member 'BP_BattleDamages_C_ApplyCriticalHitModifiers::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_BattleDamages_C_ApplyCriticalHitModifiers, CallFunc_Format_ReturnValue) == 0x0001E0, "Member 'BP_BattleDamages_C_ApplyCriticalHitModifiers::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleDamages_C_ApplyCriticalHitModifiers, K2Node_MakeStruct_FDamageModifier) == 0x0001F0, "Member 'BP_BattleDamages_C_ApplyCriticalHitModifiers::K2Node_MakeStruct_FDamageModifier' has a wrong offset!");
static_assert(offsetof(BP_BattleDamages_C_ApplyCriticalHitModifiers, K2Node_MakeStruct_FormatArgumentData_5) == 0x000218, "Member 'BP_BattleDamages_C_ApplyCriticalHitModifiers::K2Node_MakeStruct_FormatArgumentData_5' has a wrong offset!");
static_assert(offsetof(BP_BattleDamages_C_ApplyCriticalHitModifiers, K2Node_MakeArray_Array_1) == 0x000260, "Member 'BP_BattleDamages_C_ApplyCriticalHitModifiers::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BP_BattleDamages_C_ApplyCriticalHitModifiers, CallFunc_Format_ReturnValue_1) == 0x000270, "Member 'BP_BattleDamages_C_ApplyCriticalHitModifiers::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BattleDamages_C_ApplyCriticalHitModifiers, CallFunc_IsValid_ReturnValue) == 0x000280, "Member 'BP_BattleDamages_C_ApplyCriticalHitModifiers::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleDamages_C_ApplyCriticalHitModifiers, CallFunc_GetConsoleVariableBoolValue_ReturnValue) == 0x000281, "Member 'BP_BattleDamages_C_ApplyCriticalHitModifiers::CallFunc_GetConsoleVariableBoolValue_ReturnValue' has a wrong offset!");

// Function BP_BattleDamages.BP_BattleDamages_C.ApplyDeathtouch
// 0x0070 (0x0070 - 0x0000)
struct BP_BattleDamages_C_ApplyDeathtouch final
{
public:
	bool                                          CallFunc_IsDeathTouch_ReturnValue;                 // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0008(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0050(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0060(0x0010)()
};
static_assert(alignof(BP_BattleDamages_C_ApplyDeathtouch) == 0x000008, "Wrong alignment on BP_BattleDamages_C_ApplyDeathtouch");
static_assert(sizeof(BP_BattleDamages_C_ApplyDeathtouch) == 0x000070, "Wrong size on BP_BattleDamages_C_ApplyDeathtouch");
static_assert(offsetof(BP_BattleDamages_C_ApplyDeathtouch, CallFunc_IsDeathTouch_ReturnValue) == 0x000000, "Member 'BP_BattleDamages_C_ApplyDeathtouch::CallFunc_IsDeathTouch_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleDamages_C_ApplyDeathtouch, K2Node_MakeStruct_FormatArgumentData) == 0x000008, "Member 'BP_BattleDamages_C_ApplyDeathtouch::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_BattleDamages_C_ApplyDeathtouch, K2Node_MakeArray_Array) == 0x000050, "Member 'BP_BattleDamages_C_ApplyDeathtouch::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_BattleDamages_C_ApplyDeathtouch, CallFunc_Format_ReturnValue) == 0x000060, "Member 'BP_BattleDamages_C_ApplyDeathtouch::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function BP_BattleDamages.BP_BattleDamages_C.ApplyDebugOverrides
// 0x0040 (0x0040 - 0x0000)
struct BP_BattleDamages_C_ApplyDebugOverrides final
{
public:
	bool                                          CallFunc_GetConsoleVariableBoolValue_ReturnValue;  // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECharacterTeamSelector                        CallFunc_GetTeam_Team;                             // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FMin_ReturnValue;                         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FMin_ReturnValue_1;                       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_jRPG_Character_Battle_Base_C*       CallFunc_GetCharacterBattleBase_jRPG_CharacterBattleBase; // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetCharacterBattleBase_IsValid;           // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayerTeamCharacter_IsPlayerTeam;       // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_jRPG_Character_Battle_Base_C*       CallFunc_GetCharacterBattleBase_jRPG_CharacterBattleBase_1; // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetCharacterBattleBase_IsValid_1;         // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetConsoleVariableBoolValue_ReturnValue_1; // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayerTeamCharacter_IsPlayerTeam_1;     // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetConsoleVariableBoolValue_ReturnValue_2; // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetConsoleVariableBoolValue_ReturnValue_3; // 0x003E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x003F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BattleDamages_C_ApplyDebugOverrides) == 0x000008, "Wrong alignment on BP_BattleDamages_C_ApplyDebugOverrides");
static_assert(sizeof(BP_BattleDamages_C_ApplyDebugOverrides) == 0x000040, "Wrong size on BP_BattleDamages_C_ApplyDebugOverrides");
static_assert(offsetof(BP_BattleDamages_C_ApplyDebugOverrides, CallFunc_GetConsoleVariableBoolValue_ReturnValue) == 0x000000, "Member 'BP_BattleDamages_C_ApplyDebugOverrides::CallFunc_GetConsoleVariableBoolValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleDamages_C_ApplyDebugOverrides, CallFunc_GetTeam_Team) == 0x000001, "Member 'BP_BattleDamages_C_ApplyDebugOverrides::CallFunc_GetTeam_Team' has a wrong offset!");
static_assert(offsetof(BP_BattleDamages_C_ApplyDebugOverrides, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000002, "Member 'BP_BattleDamages_C_ApplyDebugOverrides::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleDamages_C_ApplyDebugOverrides, CallFunc_FMin_ReturnValue) == 0x000008, "Member 'BP_BattleDamages_C_ApplyDebugOverrides::CallFunc_FMin_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleDamages_C_ApplyDebugOverrides, CallFunc_BooleanAND_ReturnValue) == 0x000010, "Member 'BP_BattleDamages_C_ApplyDebugOverrides::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleDamages_C_ApplyDebugOverrides, CallFunc_FMin_ReturnValue_1) == 0x000018, "Member 'BP_BattleDamages_C_ApplyDebugOverrides::CallFunc_FMin_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BattleDamages_C_ApplyDebugOverrides, CallFunc_GetCharacterBattleBase_jRPG_CharacterBattleBase) == 0x000020, "Member 'BP_BattleDamages_C_ApplyDebugOverrides::CallFunc_GetCharacterBattleBase_jRPG_CharacterBattleBase' has a wrong offset!");
static_assert(offsetof(BP_BattleDamages_C_ApplyDebugOverrides, CallFunc_GetCharacterBattleBase_IsValid) == 0x000028, "Member 'BP_BattleDamages_C_ApplyDebugOverrides::CallFunc_GetCharacterBattleBase_IsValid' has a wrong offset!");
static_assert(offsetof(BP_BattleDamages_C_ApplyDebugOverrides, CallFunc_IsPlayerTeamCharacter_IsPlayerTeam) == 0x000029, "Member 'BP_BattleDamages_C_ApplyDebugOverrides::CallFunc_IsPlayerTeamCharacter_IsPlayerTeam' has a wrong offset!");
static_assert(offsetof(BP_BattleDamages_C_ApplyDebugOverrides, CallFunc_GetCharacterBattleBase_jRPG_CharacterBattleBase_1) == 0x000030, "Member 'BP_BattleDamages_C_ApplyDebugOverrides::CallFunc_GetCharacterBattleBase_jRPG_CharacterBattleBase_1' has a wrong offset!");
static_assert(offsetof(BP_BattleDamages_C_ApplyDebugOverrides, CallFunc_GetCharacterBattleBase_IsValid_1) == 0x000038, "Member 'BP_BattleDamages_C_ApplyDebugOverrides::CallFunc_GetCharacterBattleBase_IsValid_1' has a wrong offset!");
