#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BattleEvent_APChange

#include "Basic.hpp"

#include "EAPChangeReason_structs.hpp"


namespace SDK::Params
{

// Function BP_BattleEvent_APChange.BP_BattleEvent_APChange_C.BroadcastBattleEvent
// 0x0030 (0x0030 - 0x0000)
struct BP_BattleEvent_APChange_C_BroadcastBattleEvent final
{
public:
	class UAC_jRPG_BattleManager_C*               BattleManager;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, InstancedReference, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_BattleListener_C> CallFunc_Array_Get_Item;                           // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BattleEvent_APChange_C_BroadcastBattleEvent) == 0x000008, "Wrong alignment on BP_BattleEvent_APChange_C_BroadcastBattleEvent");
static_assert(sizeof(BP_BattleEvent_APChange_C_BroadcastBattleEvent) == 0x000030, "Wrong size on BP_BattleEvent_APChange_C_BroadcastBattleEvent");
static_assert(offsetof(BP_BattleEvent_APChange_C_BroadcastBattleEvent, BattleManager) == 0x000000, "Member 'BP_BattleEvent_APChange_C_BroadcastBattleEvent::BattleManager' has a wrong offset!");
static_assert(offsetof(BP_BattleEvent_APChange_C_BroadcastBattleEvent, Temp_int_Array_Index_Variable) == 0x000008, "Member 'BP_BattleEvent_APChange_C_BroadcastBattleEvent::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_BattleEvent_APChange_C_BroadcastBattleEvent, CallFunc_Array_Length_ReturnValue) == 0x00000C, "Member 'BP_BattleEvent_APChange_C_BroadcastBattleEvent::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleEvent_APChange_C_BroadcastBattleEvent, CallFunc_Array_Get_Item) == 0x000010, "Member 'BP_BattleEvent_APChange_C_BroadcastBattleEvent::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_BattleEvent_APChange_C_BroadcastBattleEvent, Temp_int_Loop_Counter_Variable) == 0x000020, "Member 'BP_BattleEvent_APChange_C_BroadcastBattleEvent::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_BattleEvent_APChange_C_BroadcastBattleEvent, CallFunc_Less_IntInt_ReturnValue) == 0x000024, "Member 'BP_BattleEvent_APChange_C_BroadcastBattleEvent::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleEvent_APChange_C_BroadcastBattleEvent, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'BP_BattleEvent_APChange_C_BroadcastBattleEvent::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function BP_BattleEvent_APChange.BP_BattleEvent_APChange_C.GetAffectedCharacterStats
// 0x0008 (0x0008 - 0x0000)
struct BP_BattleEvent_APChange_C_GetAffectedCharacterStats final
{
public:
	class UAC_jRPG_CharacterBattleStats_C*        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BattleEvent_APChange_C_GetAffectedCharacterStats) == 0x000008, "Wrong alignment on BP_BattleEvent_APChange_C_GetAffectedCharacterStats");
static_assert(sizeof(BP_BattleEvent_APChange_C_GetAffectedCharacterStats) == 0x000008, "Wrong size on BP_BattleEvent_APChange_C_GetAffectedCharacterStats");
static_assert(offsetof(BP_BattleEvent_APChange_C_GetAffectedCharacterStats, ReturnValue) == 0x000000, "Member 'BP_BattleEvent_APChange_C_GetAffectedCharacterStats::ReturnValue' has a wrong offset!");

// Function BP_BattleEvent_APChange.BP_BattleEvent_APChange_C.GetChangeReason
// 0x0001 (0x0001 - 0x0000)
struct BP_BattleEvent_APChange_C_GetChangeReason final
{
public:
	EAPChangeReason                               ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BattleEvent_APChange_C_GetChangeReason) == 0x000001, "Wrong alignment on BP_BattleEvent_APChange_C_GetChangeReason");
static_assert(sizeof(BP_BattleEvent_APChange_C_GetChangeReason) == 0x000001, "Wrong size on BP_BattleEvent_APChange_C_GetChangeReason");
static_assert(offsetof(BP_BattleEvent_APChange_C_GetChangeReason, ReturnValue) == 0x000000, "Member 'BP_BattleEvent_APChange_C_GetChangeReason::ReturnValue' has a wrong offset!");

// Function BP_BattleEvent_APChange.BP_BattleEvent_APChange_C.GetDelta
// 0x0008 (0x0008 - 0x0000)
struct BP_BattleEvent_APChange_C_GetDelta final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BattleEvent_APChange_C_GetDelta) == 0x000004, "Wrong alignment on BP_BattleEvent_APChange_C_GetDelta");
static_assert(sizeof(BP_BattleEvent_APChange_C_GetDelta) == 0x000008, "Wrong size on BP_BattleEvent_APChange_C_GetDelta");
static_assert(offsetof(BP_BattleEvent_APChange_C_GetDelta, ReturnValue) == 0x000000, "Member 'BP_BattleEvent_APChange_C_GetDelta::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleEvent_APChange_C_GetDelta, CallFunc_Subtract_IntInt_ReturnValue) == 0x000004, "Member 'BP_BattleEvent_APChange_C_GetDelta::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");

// Function BP_BattleEvent_APChange.BP_BattleEvent_APChange_C.GetNewValue
// 0x0004 (0x0004 - 0x0000)
struct BP_BattleEvent_APChange_C_GetNewValue final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BattleEvent_APChange_C_GetNewValue) == 0x000004, "Wrong alignment on BP_BattleEvent_APChange_C_GetNewValue");
static_assert(sizeof(BP_BattleEvent_APChange_C_GetNewValue) == 0x000004, "Wrong size on BP_BattleEvent_APChange_C_GetNewValue");
static_assert(offsetof(BP_BattleEvent_APChange_C_GetNewValue, ReturnValue) == 0x000000, "Member 'BP_BattleEvent_APChange_C_GetNewValue::ReturnValue' has a wrong offset!");

// Function BP_BattleEvent_APChange.BP_BattleEvent_APChange_C.GetPreviousValue
// 0x0004 (0x0004 - 0x0000)
struct BP_BattleEvent_APChange_C_GetPreviousValue final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BattleEvent_APChange_C_GetPreviousValue) == 0x000004, "Wrong alignment on BP_BattleEvent_APChange_C_GetPreviousValue");
static_assert(sizeof(BP_BattleEvent_APChange_C_GetPreviousValue) == 0x000004, "Wrong size on BP_BattleEvent_APChange_C_GetPreviousValue");
static_assert(offsetof(BP_BattleEvent_APChange_C_GetPreviousValue, ReturnValue) == 0x000000, "Member 'BP_BattleEvent_APChange_C_GetPreviousValue::ReturnValue' has a wrong offset!");

// Function BP_BattleEvent_APChange.BP_BattleEvent_APChange_C.IsGain
// 0x000C (0x000C - 0x0000)
struct BP_BattleEvent_APChange_C_IsGain final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetDelta_ReturnValue;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BattleEvent_APChange_C_IsGain) == 0x000004, "Wrong alignment on BP_BattleEvent_APChange_C_IsGain");
static_assert(sizeof(BP_BattleEvent_APChange_C_IsGain) == 0x00000C, "Wrong size on BP_BattleEvent_APChange_C_IsGain");
static_assert(offsetof(BP_BattleEvent_APChange_C_IsGain, ReturnValue) == 0x000000, "Member 'BP_BattleEvent_APChange_C_IsGain::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleEvent_APChange_C_IsGain, CallFunc_GetDelta_ReturnValue) == 0x000004, "Member 'BP_BattleEvent_APChange_C_IsGain::CallFunc_GetDelta_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleEvent_APChange_C_IsGain, CallFunc_Greater_IntInt_ReturnValue) == 0x000008, "Member 'BP_BattleEvent_APChange_C_IsGain::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

// Function BP_BattleEvent_APChange.BP_BattleEvent_APChange_C.IsLoss
// 0x000C (0x000C - 0x0000)
struct BP_BattleEvent_APChange_C_IsLoss final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetDelta_ReturnValue;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BattleEvent_APChange_C_IsLoss) == 0x000004, "Wrong alignment on BP_BattleEvent_APChange_C_IsLoss");
static_assert(sizeof(BP_BattleEvent_APChange_C_IsLoss) == 0x00000C, "Wrong size on BP_BattleEvent_APChange_C_IsLoss");
static_assert(offsetof(BP_BattleEvent_APChange_C_IsLoss, ReturnValue) == 0x000000, "Member 'BP_BattleEvent_APChange_C_IsLoss::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleEvent_APChange_C_IsLoss, CallFunc_GetDelta_ReturnValue) == 0x000004, "Member 'BP_BattleEvent_APChange_C_IsLoss::CallFunc_GetDelta_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleEvent_APChange_C_IsLoss, CallFunc_Less_IntInt_ReturnValue) == 0x000008, "Member 'BP_BattleEvent_APChange_C_IsLoss::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

}

