#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BattleProp_Base

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_BattleProp_Base.BP_BattleProp_Base_C.TryGetEnemyAtSpot
// 0x0030 (0x0030 - 0x0000)
struct BP_BattleProp_Base_C_TryGetEnemyAtSpot final
{
public:
	class ABP_jRPG_EnemyBattleSpot_C*             BattleSpot;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_jRPG_Character_Battle_Base_C*       CharacterBase;                                     // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Found;                                             // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAC_jRPG_BattleManager_C*               CallFunc_GetBattleManager_ReturnValue;             // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ABP_jRPG_Character_Battle_Base_C*       CallFunc_FindCharacterAtBattleSpot_Character;      // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BattleProp_Base_C_TryGetEnemyAtSpot) == 0x000008, "Wrong alignment on BP_BattleProp_Base_C_TryGetEnemyAtSpot");
static_assert(sizeof(BP_BattleProp_Base_C_TryGetEnemyAtSpot) == 0x000030, "Wrong size on BP_BattleProp_Base_C_TryGetEnemyAtSpot");
static_assert(offsetof(BP_BattleProp_Base_C_TryGetEnemyAtSpot, BattleSpot) == 0x000000, "Member 'BP_BattleProp_Base_C_TryGetEnemyAtSpot::BattleSpot' has a wrong offset!");
static_assert(offsetof(BP_BattleProp_Base_C_TryGetEnemyAtSpot, CharacterBase) == 0x000008, "Member 'BP_BattleProp_Base_C_TryGetEnemyAtSpot::CharacterBase' has a wrong offset!");
static_assert(offsetof(BP_BattleProp_Base_C_TryGetEnemyAtSpot, Found) == 0x000010, "Member 'BP_BattleProp_Base_C_TryGetEnemyAtSpot::Found' has a wrong offset!");
static_assert(offsetof(BP_BattleProp_Base_C_TryGetEnemyAtSpot, CallFunc_GetBattleManager_ReturnValue) == 0x000018, "Member 'BP_BattleProp_Base_C_TryGetEnemyAtSpot::CallFunc_GetBattleManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleProp_Base_C_TryGetEnemyAtSpot, CallFunc_FindCharacterAtBattleSpot_Character) == 0x000020, "Member 'BP_BattleProp_Base_C_TryGetEnemyAtSpot::CallFunc_FindCharacterAtBattleSpot_Character' has a wrong offset!");
static_assert(offsetof(BP_BattleProp_Base_C_TryGetEnemyAtSpot, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'BP_BattleProp_Base_C_TryGetEnemyAtSpot::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

