#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Component_WorldAnimationProfile

#include "Basic.hpp"

#include "S_AnimationProfile_Skins_structs.hpp"


namespace SDK::Params
{

// Function BP_Component_WorldAnimationProfile.BP_Component_WorldAnimationProfile_C.SetAnimationProfileAndUpdateFromSkeletalMeshComponent
// 0x0060 (0x0060 - 0x0000)
struct BP_Component_WorldAnimationProfile_C_SetAnimationProfileAndUpdateFromSkeletalMeshComponent final
{
public:
	struct FS_AnimationProfile_Skins              AnimationProfile_0;                                // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SkeletalMeshComponent;                             // 0x0040(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UALS_UE5_AnimBP_C*                      K2Node_DynamicCast_AsALS_UE5_Anim_BP;              // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Component_WorldAnimationProfile_C_SetAnimationProfileAndUpdateFromSkeletalMeshComponent) == 0x000008, "Wrong alignment on BP_Component_WorldAnimationProfile_C_SetAnimationProfileAndUpdateFromSkeletalMeshComponent");
static_assert(sizeof(BP_Component_WorldAnimationProfile_C_SetAnimationProfileAndUpdateFromSkeletalMeshComponent) == 0x000060, "Wrong size on BP_Component_WorldAnimationProfile_C_SetAnimationProfileAndUpdateFromSkeletalMeshComponent");
static_assert(offsetof(BP_Component_WorldAnimationProfile_C_SetAnimationProfileAndUpdateFromSkeletalMeshComponent, AnimationProfile_0) == 0x000000, "Member 'BP_Component_WorldAnimationProfile_C_SetAnimationProfileAndUpdateFromSkeletalMeshComponent::AnimationProfile_0' has a wrong offset!");
static_assert(offsetof(BP_Component_WorldAnimationProfile_C_SetAnimationProfileAndUpdateFromSkeletalMeshComponent, SkeletalMeshComponent) == 0x000040, "Member 'BP_Component_WorldAnimationProfile_C_SetAnimationProfileAndUpdateFromSkeletalMeshComponent::SkeletalMeshComponent' has a wrong offset!");
static_assert(offsetof(BP_Component_WorldAnimationProfile_C_SetAnimationProfileAndUpdateFromSkeletalMeshComponent, CallFunc_GetAnimInstance_ReturnValue) == 0x000048, "Member 'BP_Component_WorldAnimationProfile_C_SetAnimationProfileAndUpdateFromSkeletalMeshComponent::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Component_WorldAnimationProfile_C_SetAnimationProfileAndUpdateFromSkeletalMeshComponent, K2Node_DynamicCast_AsALS_UE5_Anim_BP) == 0x000050, "Member 'BP_Component_WorldAnimationProfile_C_SetAnimationProfileAndUpdateFromSkeletalMeshComponent::K2Node_DynamicCast_AsALS_UE5_Anim_BP' has a wrong offset!");
static_assert(offsetof(BP_Component_WorldAnimationProfile_C_SetAnimationProfileAndUpdateFromSkeletalMeshComponent, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'BP_Component_WorldAnimationProfile_C_SetAnimationProfileAndUpdateFromSkeletalMeshComponent::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BP_Component_WorldAnimationProfile.BP_Component_WorldAnimationProfile_C.SetAnimationProfileAndUpdate
// 0x0070 (0x0070 - 0x0000)
struct BP_Component_WorldAnimationProfile_C_SetAnimationProfileAndUpdate final
{
public:
	struct FS_AnimationProfile_Skins              AnimationProfile_0;                                // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             K2Node_DynamicCast_AsCharacter;                    // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UALS_UE5_AnimBP_C*                      K2Node_DynamicCast_AsALS_UE5_Anim_BP;              // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Component_WorldAnimationProfile_C_SetAnimationProfileAndUpdate) == 0x000008, "Wrong alignment on BP_Component_WorldAnimationProfile_C_SetAnimationProfileAndUpdate");
static_assert(sizeof(BP_Component_WorldAnimationProfile_C_SetAnimationProfileAndUpdate) == 0x000070, "Wrong size on BP_Component_WorldAnimationProfile_C_SetAnimationProfileAndUpdate");
static_assert(offsetof(BP_Component_WorldAnimationProfile_C_SetAnimationProfileAndUpdate, AnimationProfile_0) == 0x000000, "Member 'BP_Component_WorldAnimationProfile_C_SetAnimationProfileAndUpdate::AnimationProfile_0' has a wrong offset!");
static_assert(offsetof(BP_Component_WorldAnimationProfile_C_SetAnimationProfileAndUpdate, CallFunc_GetOwner_ReturnValue) == 0x000040, "Member 'BP_Component_WorldAnimationProfile_C_SetAnimationProfileAndUpdate::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Component_WorldAnimationProfile_C_SetAnimationProfileAndUpdate, K2Node_DynamicCast_AsCharacter) == 0x000048, "Member 'BP_Component_WorldAnimationProfile_C_SetAnimationProfileAndUpdate::K2Node_DynamicCast_AsCharacter' has a wrong offset!");
static_assert(offsetof(BP_Component_WorldAnimationProfile_C_SetAnimationProfileAndUpdate, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'BP_Component_WorldAnimationProfile_C_SetAnimationProfileAndUpdate::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Component_WorldAnimationProfile_C_SetAnimationProfileAndUpdate, CallFunc_GetAnimInstance_ReturnValue) == 0x000058, "Member 'BP_Component_WorldAnimationProfile_C_SetAnimationProfileAndUpdate::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Component_WorldAnimationProfile_C_SetAnimationProfileAndUpdate, K2Node_DynamicCast_AsALS_UE5_Anim_BP) == 0x000060, "Member 'BP_Component_WorldAnimationProfile_C_SetAnimationProfileAndUpdate::K2Node_DynamicCast_AsALS_UE5_Anim_BP' has a wrong offset!");
static_assert(offsetof(BP_Component_WorldAnimationProfile_C_SetAnimationProfileAndUpdate, K2Node_DynamicCast_bSuccess_1) == 0x000068, "Member 'BP_Component_WorldAnimationProfile_C_SetAnimationProfileAndUpdate::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

}

