#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ClimbingComponent

#include "Basic.hpp"

#include "E_ClimbingComponentState_structs.hpp"
#include "E_Climbing_Direction_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "EnhancedInput_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_ClimbingComponent.BP_ClimbingComponent_C.CameraShake
// 0x0078 (0x0078 - 0x0000)
struct BP_ClimbingComponent_C_CameraShake final
{
public:
	E_Climbing_Direction                          Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UCameraShakeBase>           Temp_class_Variable;                               // 0x0008(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TSubclassOf<class UCameraShakeBase>           Temp_class_Variable_1;                             // 0x0010(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TSubclassOf<class UCameraShakeBase>           Temp_class_Variable_2;                             // 0x0018(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TSubclassOf<class UCameraShakeBase>           Temp_class_Variable_3;                             // 0x0020(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TSubclassOf<class UCameraShakeBase>           Temp_class_Variable_4;                             // 0x0028(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TSubclassOf<class UCameraShakeBase>           Temp_class_Variable_5;                             // 0x0030(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TSubclassOf<class UCameraShakeBase>           Temp_class_Variable_6;                             // 0x0038(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TSubclassOf<class UCameraShakeBase>           Temp_class_Variable_7;                             // 0x0040(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TSubclassOf<class UCameraShakeBase>           Temp_class_Variable_8;                             // 0x0048(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TSubclassOf<class UCameraShakeBase>           Temp_class_Variable_9;                             // 0x0050(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_jRPG_Controller_World_C*            K2Node_DynamicCast_AsBP_J_RPG_Controller_World;    // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UCameraShakeBase>           K2Node_Select_Default;                             // 0x0070(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(BP_ClimbingComponent_C_CameraShake) == 0x000008, "Wrong alignment on BP_ClimbingComponent_C_CameraShake");
static_assert(sizeof(BP_ClimbingComponent_C_CameraShake) == 0x000078, "Wrong size on BP_ClimbingComponent_C_CameraShake");
static_assert(offsetof(BP_ClimbingComponent_C_CameraShake, Temp_byte_Variable) == 0x000000, "Member 'BP_ClimbingComponent_C_CameraShake::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_ClimbingComponent_C_CameraShake, Temp_class_Variable) == 0x000008, "Member 'BP_ClimbingComponent_C_CameraShake::Temp_class_Variable' has a wrong offset!");
static_assert(offsetof(BP_ClimbingComponent_C_CameraShake, Temp_class_Variable_1) == 0x000010, "Member 'BP_ClimbingComponent_C_CameraShake::Temp_class_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ClimbingComponent_C_CameraShake, Temp_class_Variable_2) == 0x000018, "Member 'BP_ClimbingComponent_C_CameraShake::Temp_class_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_ClimbingComponent_C_CameraShake, Temp_class_Variable_3) == 0x000020, "Member 'BP_ClimbingComponent_C_CameraShake::Temp_class_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_ClimbingComponent_C_CameraShake, Temp_class_Variable_4) == 0x000028, "Member 'BP_ClimbingComponent_C_CameraShake::Temp_class_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_ClimbingComponent_C_CameraShake, Temp_class_Variable_5) == 0x000030, "Member 'BP_ClimbingComponent_C_CameraShake::Temp_class_Variable_5' has a wrong offset!");
static_assert(offsetof(BP_ClimbingComponent_C_CameraShake, Temp_class_Variable_6) == 0x000038, "Member 'BP_ClimbingComponent_C_CameraShake::Temp_class_Variable_6' has a wrong offset!");
static_assert(offsetof(BP_ClimbingComponent_C_CameraShake, Temp_class_Variable_7) == 0x000040, "Member 'BP_ClimbingComponent_C_CameraShake::Temp_class_Variable_7' has a wrong offset!");
static_assert(offsetof(BP_ClimbingComponent_C_CameraShake, Temp_class_Variable_8) == 0x000048, "Member 'BP_ClimbingComponent_C_CameraShake::Temp_class_Variable_8' has a wrong offset!");
static_assert(offsetof(BP_ClimbingComponent_C_CameraShake, Temp_class_Variable_9) == 0x000050, "Member 'BP_ClimbingComponent_C_CameraShake::Temp_class_Variable_9' has a wrong offset!");
static_assert(offsetof(BP_ClimbingComponent_C_CameraShake, CallFunc_GetPlayerController_ReturnValue) == 0x000058, "Member 'BP_ClimbingComponent_C_CameraShake::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ClimbingComponent_C_CameraShake, K2Node_DynamicCast_AsBP_J_RPG_Controller_World) == 0x000060, "Member 'BP_ClimbingComponent_C_CameraShake::K2Node_DynamicCast_AsBP_J_RPG_Controller_World' has a wrong offset!");
static_assert(offsetof(BP_ClimbingComponent_C_CameraShake, K2Node_DynamicCast_bSuccess) == 0x000068, "Member 'BP_ClimbingComponent_C_CameraShake::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ClimbingComponent_C_CameraShake, K2Node_Select_Default) == 0x000070, "Member 'BP_ClimbingComponent_C_CameraShake::K2Node_Select_Default' has a wrong offset!");

// Function BP_ClimbingComponent.BP_ClimbingComponent_C.CanUseClimbingElement
// 0x0004 (0x0004 - 0x0000)
struct BP_ClimbingComponent_C_CanUseClimbingElement final
{
public:
	bool                                          CanClimb;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCapabilityAllowed_isAllowed;            // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ClimbingComponent_C_CanUseClimbingElement) == 0x000001, "Wrong alignment on BP_ClimbingComponent_C_CanUseClimbingElement");
static_assert(sizeof(BP_ClimbingComponent_C_CanUseClimbingElement) == 0x000004, "Wrong size on BP_ClimbingComponent_C_CanUseClimbingElement");
static_assert(offsetof(BP_ClimbingComponent_C_CanUseClimbingElement, CanClimb) == 0x000000, "Member 'BP_ClimbingComponent_C_CanUseClimbingElement::CanClimb' has a wrong offset!");
static_assert(offsetof(BP_ClimbingComponent_C_CanUseClimbingElement, CallFunc_IsCapabilityAllowed_isAllowed) == 0x000001, "Member 'BP_ClimbingComponent_C_CanUseClimbingElement::CallFunc_IsCapabilityAllowed_isAllowed' has a wrong offset!");
static_assert(offsetof(BP_ClimbingComponent_C_CanUseClimbingElement, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000002, "Member 'BP_ClimbingComponent_C_CanUseClimbingElement::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ClimbingComponent_C_CanUseClimbingElement, CallFunc_BooleanAND_ReturnValue) == 0x000003, "Member 'BP_ClimbingComponent_C_CanUseClimbingElement::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BP_ClimbingComponent.BP_ClimbingComponent_C.ChangeState
// 0x0001 (0x0001 - 0x0000)
struct BP_ClimbingComponent_C_ChangeState final
{
public:
	E_ClimbingComponentState                      NewState;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ClimbingComponent_C_ChangeState) == 0x000001, "Wrong alignment on BP_ClimbingComponent_C_ChangeState");
static_assert(sizeof(BP_ClimbingComponent_C_ChangeState) == 0x000001, "Wrong size on BP_ClimbingComponent_C_ChangeState");
static_assert(offsetof(BP_ClimbingComponent_C_ChangeState, NewState) == 0x000000, "Member 'BP_ClimbingComponent_C_ChangeState::NewState' has a wrong offset!");

// Function BP_ClimbingComponent.BP_ClimbingComponent_C.CheckExitingClimbing
// 0x00A8 (0x00A8 - 0x0000)
struct BP_ClimbingComponent_C_CheckExitingClimbing final
{
public:
	struct FVector                                CallFunc_ComputeInputDirections_InputDirectionHorizontal; // 0x0000(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_ComputeInputDirections_InputDirectionVertical; // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_ComputeInputDirections_InputScale;        // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckCanExitToTop_CanExit;                // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_CheckCanExitToTop_Location;               // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_CheckCanExitToTop_Rotation;               // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckCanExitToBottom_CanExit;             // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_CheckCanExitToBottom_Location;            // 0x0078(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_CheckCanExitToBottom_Rotation;            // 0x0090(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ClimbingComponent_C_CheckExitingClimbing) == 0x000008, "Wrong alignment on BP_ClimbingComponent_C_CheckExitingClimbing");
static_assert(sizeof(BP_ClimbingComponent_C_CheckExitingClimbing) == 0x0000A8, "Wrong size on BP_ClimbingComponent_C_CheckExitingClimbing");
static_assert(offsetof(BP_ClimbingComponent_C_CheckExitingClimbing, CallFunc_ComputeInputDirections_InputDirectionHorizontal) == 0x000000, "Member 'BP_ClimbingComponent_C_CheckExitingClimbing::CallFunc_ComputeInputDirections_InputDirectionHorizontal' has a wrong offset!");
static_assert(offsetof(BP_ClimbingComponent_C_CheckExitingClimbing, CallFunc_ComputeInputDirections_InputDirectionVertical) == 0x000018, "Member 'BP_ClimbingComponent_C_CheckExitingClimbing::CallFunc_ComputeInputDirections_InputDirectionVertical' has a wrong offset!");
static_assert(offsetof(BP_ClimbingComponent_C_CheckExitingClimbing, CallFunc_ComputeInputDirections_InputScale) == 0x000030, "Member 'BP_ClimbingComponent_C_CheckExitingClimbing::CallFunc_ComputeInputDirections_InputScale' has a wrong offset!");
static_assert(offsetof(BP_ClimbingComponent_C_CheckExitingClimbing, CallFunc_CheckCanExitToTop_CanExit) == 0x000038, "Member 'BP_ClimbingComponent_C_CheckExitingClimbing::CallFunc_CheckCanExitToTop_CanExit' has a wrong offset!");
static_assert(offsetof(BP_ClimbingComponent_C_CheckExitingClimbing, CallFunc_CheckCanExitToTop_Location) == 0x000040, "Member 'BP_ClimbingComponent_C_CheckExitingClimbing::CallFunc_CheckCanExitToTop_Location' has a wrong offset!");
static_assert(offsetof(BP_ClimbingComponent_C_CheckExitingClimbing, CallFunc_CheckCanExitToTop_Rotation) == 0x000058, "Member 'BP_ClimbingComponent_C_CheckExitingClimbing::CallFunc_CheckCanExitToTop_Rotation' has a wrong offset!");
static_assert(offsetof(BP_ClimbingComponent_C_CheckExitingClimbing, CallFunc_CheckCanExitToBottom_CanExit) == 0x000070, "Member 'BP_ClimbingComponent_C_CheckExitingClimbing::CallFunc_CheckCanExitToBottom_CanExit' has a wrong offset!");
static_assert(offsetof(BP_ClimbingComponent_C_CheckExitingClimbing, CallFunc_CheckCanExitToBottom_Location) == 0x000078, "Member 'BP_ClimbingComponent_C_CheckExitingClimbing::CallFunc_CheckCanExitToBottom_Location' has a wrong offset!");
static_assert(offsetof(BP_ClimbingComponent_C_CheckExitingClimbing, CallFunc_CheckCanExitToBottom_Rotation) == 0x000090, "Member 'BP_ClimbingComponent_C_CheckExitingClimbing::CallFunc_CheckCanExitToBottom_Rotation' has a wrong offset!");

// Function BP_ClimbingComponent.BP_ClimbingComponent_C.CheckNextHold
// 0x0050 (0x0050 - 0x0000)
struct BP_ClimbingComponent_C_CheckNextHold final
{
public:
	struct FVector                                CallFunc_ComputeInputDirections_InputDirectionHorizontal; // 0x0000(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_ComputeInputDirections_InputDirectionVertical; // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_ComputeInputDirections_InputScale;        // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckMoveToNextClimbingElement_CanMove;   // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_ClimbingElement_C> CallFunc_CheckMoveToNextClimbingElement_NextHold; // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ClimbingComponent_C_CheckNextHold) == 0x000008, "Wrong alignment on BP_ClimbingComponent_C_CheckNextHold");
static_assert(sizeof(BP_ClimbingComponent_C_CheckNextHold) == 0x000050, "Wrong size on BP_ClimbingComponent_C_CheckNextHold");
static_assert(offsetof(BP_ClimbingComponent_C_CheckNextHold, CallFunc_ComputeInputDirections_InputDirectionHorizontal) == 0x000000, "Member 'BP_ClimbingComponent_C_CheckNextHold::CallFunc_ComputeInputDirections_InputDirectionHorizontal' has a wrong offset!");
static_assert(offsetof(BP_ClimbingComponent_C_CheckNextHold, CallFunc_ComputeInputDirections_InputDirectionVertical) == 0x000018, "Member 'BP_ClimbingComponent_C_CheckNextHold::CallFunc_ComputeInputDirections_InputDirectionVertical' has a wrong offset!");
static_assert(offsetof(BP_ClimbingComponent_C_CheckNextHold, CallFunc_ComputeInputDirections_InputScale) == 0x000030, "Member 'BP_ClimbingComponent_C_CheckNextHold::CallFunc_ComputeInputDirections_InputScale' has a wrong offset!");
static_assert(offsetof(BP_ClimbingComponent_C_CheckNextHold, CallFunc_CheckMoveToNextClimbingElement_CanMove) == 0x000038, "Member 'BP_ClimbingComponent_C_CheckNextHold::CallFunc_CheckMoveToNextClimbingElement_CanMove' has a wrong offset!");
static_assert(offsetof(BP_ClimbingComponent_C_CheckNextHold, CallFunc_CheckMoveToNextClimbingElement_NextHold) == 0x000040, "Member 'BP_ClimbingComponent_C_CheckNextHold::CallFunc_CheckMoveToNextClimbingElement_NextHold' has a wrong offset!");

// Function BP_ClimbingComponent.BP_ClimbingComponent_C.ComputeAlpha
// 0x0038 (0x0038 - 0x0000)
struct BP_ClimbingComponent_C_ComputeAlpha final
{
public:
	double                                        Time;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCurveFloat*                            Curve;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Alpha;                                             // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_ReturnValue;                // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_InTime_ImplicitCast;        // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FClamp_Value_ImplicitCast;                // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ClimbingComponent_C_ComputeAlpha) == 0x000008, "Wrong alignment on BP_ClimbingComponent_C_ComputeAlpha");
static_assert(sizeof(BP_ClimbingComponent_C_ComputeAlpha) == 0x000038, "Wrong size on BP_ClimbingComponent_C_ComputeAlpha");
static_assert(offsetof(BP_ClimbingComponent_C_ComputeAlpha, Time) == 0x000000, "Member 'BP_ClimbingComponent_C_ComputeAlpha::Time' has a wrong offset!");
static_assert(offsetof(BP_ClimbingComponent_C_ComputeAlpha, Curve) == 0x000008, "Member 'BP_ClimbingComponent_C_ComputeAlpha::Curve' has a wrong offset!");
static_assert(offsetof(BP_ClimbingComponent_C_ComputeAlpha, Alpha) == 0x000010, "Member 'BP_ClimbingComponent_C_ComputeAlpha::Alpha' has a wrong offset!");
static_assert(offsetof(BP_ClimbingComponent_C_ComputeAlpha, CallFunc_GetFloatValue_ReturnValue) == 0x000018, "Member 'BP_ClimbingComponent_C_ComputeAlpha::CallFunc_GetFloatValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ClimbingComponent_C_ComputeAlpha, CallFunc_FClamp_ReturnValue) == 0x000020, "Member 'BP_ClimbingComponent_C_ComputeAlpha::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ClimbingComponent_C_ComputeAlpha, CallFunc_GetFloatValue_InTime_ImplicitCast) == 0x000028, "Member 'BP_ClimbingComponent_C_ComputeAlpha::CallFunc_GetFloatValue_InTime_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_ClimbingComponent_C_ComputeAlpha, CallFunc_FClamp_Value_ImplicitCast) == 0x000030, "Member 'BP_ClimbingComponent_C_ComputeAlpha::CallFunc_FClamp_Value_ImplicitCast' has a wrong offset!");

// Function BP_ClimbingComponent.BP_ClimbingComponent_C.ComputeClimbingAngle
// 0x0180 (0x0180 - 0x0000)
struct BP_ClimbingComponent_C_ComputeClimbingAngle final
{
public:
	double                                        Angle;                                             // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        local_DirectionAngle;                              // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0010(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Temp_wildcard_Variable;                            // 0x0070(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Vector_Up_ReturnValue;                    // 0x0088(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Cross_VectorVector_ReturnValue;           // 0x00A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Vector_Up_ReturnValue_1;                  // 0x00D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Dot_VectorVector_ReturnValue;             // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_DegAcos_ReturnValue;                      // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0108(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_InverseTransformDirection_ReturnValue;    // 0x0120(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_1;                          // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_1;                          // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_1;                          // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0150(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x0168(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ClimbingComponent_C_ComputeClimbingAngle) == 0x000010, "Wrong alignment on BP_ClimbingComponent_C_ComputeClimbingAngle");
static_assert(sizeof(BP_ClimbingComponent_C_ComputeClimbingAngle) == 0x000180, "Wrong size on BP_ClimbingComponent_C_ComputeClimbingAngle");
static_assert(offsetof(BP_ClimbingComponent_C_ComputeClimbingAngle, Angle) == 0x000000, "Member 'BP_ClimbingComponent_C_ComputeClimbingAngle::Angle' has a wrong offset!");
static_assert(offsetof(BP_ClimbingComponent_C_ComputeClimbingAngle, local_DirectionAngle) == 0x000008, "Member 'BP_ClimbingComponent_C_ComputeClimbingAngle::local_DirectionAngle' has a wrong offset!");
static_assert(offsetof(BP_ClimbingComponent_C_ComputeClimbingAngle, CallFunc_GetTransform_ReturnValue) == 0x000010, "Member 'BP_ClimbingComponent_C_ComputeClimbingAngle::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ClimbingComponent_C_ComputeClimbingAngle, Temp_wildcard_Variable) == 0x000070, "Member 'BP_ClimbingComponent_C_ComputeClimbingAngle::Temp_wildcard_Variable' has a wrong offset!");
static_assert(offsetof(BP_ClimbingComponent_C_ComputeClimbingAngle, CallFunc_Vector_Up_ReturnValue) == 0x000088, "Member 'BP_ClimbingComponent_C_ComputeClimbingAngle::CallFunc_Vector_Up_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ClimbingComponent_C_ComputeClimbingAngle, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x0000A0, "Member 'BP_ClimbingComponent_C_ComputeClimbingAngle::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ClimbingComponent_C_ComputeClimbingAngle, CallFunc_Cross_VectorVector_ReturnValue) == 0x0000A8, "Member 'BP_ClimbingComponent_C_ComputeClimbingAngle::CallFunc_Cross_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ClimbingComponent_C_ComputeClimbingAngle, CallFunc_BreakVector_X) == 0x0000C0, "Member 'BP_ClimbingComponent_C_ComputeClimbingAngle::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_ClimbingComponent_C_ComputeClimbingAngle, CallFunc_BreakVector_Y) == 0x0000C8, "Member 'BP_ClimbingComponent_C_ComputeClimbingAngle::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_ClimbingComponent_C_ComputeClimbingAngle, CallFunc_BreakVector_Z) == 0x0000D0, "Member 'BP_ClimbingComponent_C_ComputeClimbingAngle::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_ClimbingComponent_C_ComputeClimbingAngle, CallFunc_Vector_Up_ReturnValue_1) == 0x0000D8, "Member 'BP_ClimbingComponent_C_ComputeClimbingAngle::CallFunc_Vector_Up_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ClimbingComponent_C_ComputeClimbingAngle, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x0000F0, "Member 'BP_ClimbingComponent_C_ComputeClimbingAngle::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ClimbingComponent_C_ComputeClimbingAngle, CallFunc_Dot_VectorVector_ReturnValue) == 0x0000F8, "Member 'BP_ClimbingComponent_C_ComputeClimbingAngle::CallFunc_Dot_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ClimbingComponent_C_ComputeClimbingAngle, CallFunc_DegAcos_ReturnValue) == 0x000100, "Member 'BP_ClimbingComponent_C_ComputeClimbingAngle::CallFunc_DegAcos_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ClimbingComponent_C_ComputeClimbingAngle, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000108, "Member 'BP_ClimbingComponent_C_ComputeClimbingAngle::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ClimbingComponent_C_ComputeClimbingAngle, CallFunc_InverseTransformDirection_ReturnValue) == 0x000120, "Member 'BP_ClimbingComponent_C_ComputeClimbingAngle::CallFunc_InverseTransformDirection_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ClimbingComponent_C_ComputeClimbingAngle, CallFunc_BreakVector_X_1) == 0x000138, "Member 'BP_ClimbingComponent_C_ComputeClimbingAngle::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(BP_ClimbingComponent_C_ComputeClimbingAngle, CallFunc_BreakVector_Y_1) == 0x000140, "Member 'BP_ClimbingComponent_C_ComputeClimbingAngle::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(BP_ClimbingComponent_C_ComputeClimbingAngle, CallFunc_BreakVector_Z_1) == 0x000148, "Member 'BP_ClimbingComponent_C_ComputeClimbingAngle::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(BP_ClimbingComponent_C_ComputeClimbingAngle, CallFunc_MakeVector_ReturnValue) == 0x000150, "Member 'BP_ClimbingComponent_C_ComputeClimbingAngle::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ClimbingComponent_C_ComputeClimbingAngle, CallFunc_Normal_ReturnValue) == 0x000168, "Member 'BP_ClimbingComponent_C_ComputeClimbingAngle::CallFunc_Normal_ReturnValue' has a wrong offset!");

// Function BP_ClimbingComponent.BP_ClimbingComponent_C.ComputeClimbingDirection
// 0x0110 (0x0110 - 0x0000)
struct BP_ClimbingComponent_C_ComputeClimbingDirection final
{
public:
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class ABP_Holds_C*                            K2Node_DynamicCast_AsBP_Holds;                     // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0020(0x0010)()
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0040(0x0048)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0088(0x0010)()
	double                                        CallFunc_ComputeClimbingAngle_Angle;               // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00A0(0x0048)(HasGetValueTypeHash)
	E_Climbing_Direction                          CallFunc_GetClimbingDirectionFromAngle_ClimbingDirection; // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00F0(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Format_ReturnValue;                       // 0x0100(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ClimbingComponent_C_ComputeClimbingDirection) == 0x000008, "Wrong alignment on BP_ClimbingComponent_C_ComputeClimbingDirection");
static_assert(sizeof(BP_ClimbingComponent_C_ComputeClimbingDirection) == 0x000110, "Wrong size on BP_ClimbingComponent_C_ComputeClimbingDirection");
static_assert(offsetof(BP_ClimbingComponent_C_ComputeClimbingDirection, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x000000, "Member 'BP_ClimbingComponent_C_ComputeClimbingDirection::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ClimbingComponent_C_ComputeClimbingDirection, K2Node_DynamicCast_AsBP_Holds) == 0x000010, "Member 'BP_ClimbingComponent_C_ComputeClimbingDirection::K2Node_DynamicCast_AsBP_Holds' has a wrong offset!");
static_assert(offsetof(BP_ClimbingComponent_C_ComputeClimbingDirection, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_ClimbingComponent_C_ComputeClimbingDirection::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ClimbingComponent_C_ComputeClimbingDirection, CallFunc_Conv_StringToText_ReturnValue) == 0x000020, "Member 'BP_ClimbingComponent_C_ComputeClimbingDirection::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ClimbingComponent_C_ComputeClimbingDirection, CallFunc_GetDisplayName_ReturnValue) == 0x000030, "Member 'BP_ClimbingComponent_C_ComputeClimbingDirection::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ClimbingComponent_C_ComputeClimbingDirection, K2Node_MakeStruct_FormatArgumentData) == 0x000040, "Member 'BP_ClimbingComponent_C_ComputeClimbingDirection::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_ClimbingComponent_C_ComputeClimbingDirection, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000088, "Member 'BP_ClimbingComponent_C_ComputeClimbingDirection::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ClimbingComponent_C_ComputeClimbingDirection, CallFunc_ComputeClimbingAngle_Angle) == 0x000098, "Member 'BP_ClimbingComponent_C_ComputeClimbingDirection::CallFunc_ComputeClimbingAngle_Angle' has a wrong offset!");
static_assert(offsetof(BP_ClimbingComponent_C_ComputeClimbingDirection, K2Node_MakeStruct_FormatArgumentData_1) == 0x0000A0, "Member 'BP_ClimbingComponent_C_ComputeClimbingDirection::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BP_ClimbingComponent_C_ComputeClimbingDirection, CallFunc_GetClimbingDirectionFromAngle_ClimbingDirection) == 0x0000E8, "Member 'BP_ClimbingComponent_C_ComputeClimbingDirection::CallFunc_GetClimbingDirectionFromAngle_ClimbingDirection' has a wrong offset!");
static_assert(offsetof(BP_ClimbingComponent_C_ComputeClimbingDirection, K2Node_MakeArray_Array) == 0x0000F0, "Member 'BP_ClimbingComponent_C_ComputeClimbingDirection::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_ClimbingComponent_C_ComputeClimbingDirection, CallFunc_Format_ReturnValue) == 0x000100, "Member 'BP_ClimbingComponent_C_ComputeClimbingDirection::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function BP_ClimbingComponent.BP_ClimbingComponent_C.ComputeClimbingLocation
// 0x0098 (0x0098 - 0x0000)
struct BP_ClimbingComponent_C_ComputeClimbingLocation final
{
public:
	double                                        DeltaSeconds;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLastInputVector_ReturnValue;           // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_VSize_ReturnValue;                        // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetTimeRange_MinTime;                     // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTimeRange_MaxTime;                     // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_ComputeTime_Time;                         // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_LerpLocationAndRotation_Alpha;            // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_LerpLocationAndRotation_Location;         // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_LerpLocationAndRotation_Rotation;         // 0x0070(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8A[0x6];                                       // 0x008A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_ComputeTime_MaxTime_ImplicitCast;         // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ClimbingComponent_C_ComputeClimbingLocation) == 0x000008, "Wrong alignment on BP_ClimbingComponent_C_ComputeClimbingLocation");
static_assert(sizeof(BP_ClimbingComponent_C_ComputeClimbingLocation) == 0x000098, "Wrong size on BP_ClimbingComponent_C_ComputeClimbingLocation");
static_assert(offsetof(BP_ClimbingComponent_C_ComputeClimbingLocation, DeltaSeconds) == 0x000000, "Member 'BP_ClimbingComponent_C_ComputeClimbingLocation::DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_ClimbingComponent_C_ComputeClimbingLocation, CallFunc_GetLastInputVector_ReturnValue) == 0x000008, "Member 'BP_ClimbingComponent_C_ComputeClimbingLocation::CallFunc_GetLastInputVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ClimbingComponent_C_ComputeClimbingLocation, CallFunc_VSize_ReturnValue) == 0x000020, "Member 'BP_ClimbingComponent_C_ComputeClimbingLocation::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ClimbingComponent_C_ComputeClimbingLocation, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000028, "Member 'BP_ClimbingComponent_C_ComputeClimbingLocation::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ClimbingComponent_C_ComputeClimbingLocation, CallFunc_GetTimeRange_MinTime) == 0x00002C, "Member 'BP_ClimbingComponent_C_ComputeClimbingLocation::CallFunc_GetTimeRange_MinTime' has a wrong offset!");
static_assert(offsetof(BP_ClimbingComponent_C_ComputeClimbingLocation, CallFunc_GetTimeRange_MaxTime) == 0x000030, "Member 'BP_ClimbingComponent_C_ComputeClimbingLocation::CallFunc_GetTimeRange_MaxTime' has a wrong offset!");
static_assert(offsetof(BP_ClimbingComponent_C_ComputeClimbingLocation, CallFunc_ComputeTime_Time) == 0x000038, "Member 'BP_ClimbingComponent_C_ComputeClimbingLocation::CallFunc_ComputeTime_Time' has a wrong offset!");
static_assert(offsetof(BP_ClimbingComponent_C_ComputeClimbingLocation, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000040, "Member 'BP_ClimbingComponent_C_ComputeClimbingLocation::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ClimbingComponent_C_ComputeClimbingLocation, CallFunc_FClamp_ReturnValue) == 0x000048, "Member 'BP_ClimbingComponent_C_ComputeClimbingLocation::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ClimbingComponent_C_ComputeClimbingLocation, CallFunc_LerpLocationAndRotation_Alpha) == 0x000050, "Member 'BP_ClimbingComponent_C_ComputeClimbingLocation::CallFunc_LerpLocationAndRotation_Alpha' has a wrong offset!");
static_assert(offsetof(BP_ClimbingComponent_C_ComputeClimbingLocation, CallFunc_LerpLocationAndRotation_Location) == 0x000058, "Member 'BP_ClimbingComponent_C_ComputeClimbingLocation::CallFunc_LerpLocationAndRotation_Location' has a wrong offset!");
static_assert(offsetof(BP_ClimbingComponent_C_ComputeClimbingLocation, CallFunc_LerpLocationAndRotation_Rotation) == 0x000070, "Member 'BP_ClimbingComponent_C_ComputeClimbingLocation::CallFunc_LerpLocationAndRotation_Rotation' has a wrong offset!");
static_assert(offsetof(BP_ClimbingComponent_C_ComputeClimbingLocation, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x000088, "Member 'BP_ClimbingComponent_C_ComputeClimbingLocation::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ClimbingComponent_C_ComputeClimbingLocation, CallFunc_BooleanAND_ReturnValue) == 0x000089, "Member 'BP_ClimbingComponent_C_ComputeClimbingLocation::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ClimbingComponent_C_ComputeClimbingLocation, CallFunc_ComputeTime_MaxTime_ImplicitCast) == 0x000090, "Member 'BP_ClimbingComponent_C_ComputeClimbingLocation::CallFunc_ComputeTime_MaxTime_ImplicitCast' has a wrong offset!");

// Function BP_ClimbingComponent.BP_ClimbingComponent_C.ComputeFootRaycast
// 0x0288 (0x0288 - 0x0000)
struct BP_ClimbingComponent_C_ComputeFootRaycast final
{
public:
	class FName                                   SocketName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HasHit;                                            // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Location;                                          // 0x0010(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         K2Node_MakeArray_Array;                            // 0x0048(0x0010)(ConstParm, ReferenceParm)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x0070(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0088(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingle_OutHit;                   // 0x00B8(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingle_ReturnValue;              // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x01B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x01B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B3[0x1];                                      // 0x01B3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1BC[0x4];                                      // 0x01BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x01C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x01D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x01F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0208(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0220(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0228(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0230(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0248(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x024C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0250(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_254[0x4];                                      // 0x0254(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0258(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0270(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ClimbingComponent_C_ComputeFootRaycast) == 0x000008, "Wrong alignment on BP_ClimbingComponent_C_ComputeFootRaycast");
static_assert(sizeof(BP_ClimbingComponent_C_ComputeFootRaycast) == 0x000288, "Wrong size on BP_ClimbingComponent_C_ComputeFootRaycast");
static_assert(offsetof(BP_ClimbingComponent_C_ComputeFootRaycast, SocketName) == 0x000000, "Member 'BP_ClimbingComponent_C_ComputeFootRaycast::SocketName' has a wrong offset!");
static_assert(offsetof(BP_ClimbingComponent_C_ComputeFootRaycast, HasHit) == 0x000008, "Member 'BP_ClimbingComponent_C_ComputeFootRaycast::HasHit' has a wrong offset!");
static_assert(offsetof(BP_ClimbingComponent_C_ComputeFootRaycast, Location) == 0x000010, "Member 'BP_ClimbingComponent_C_ComputeFootRaycast::Location' has a wrong offset!");
static_assert(offsetof(BP_ClimbingComponent_C_ComputeFootRaycast, CallFunc_GetOwner_ReturnValue) == 0x000028, "Member 'BP_ClimbingComponent_C_ComputeFootRaycast::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ClimbingComponent_C_ComputeFootRaycast, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x000030, "Member 'BP_ClimbingComponent_C_ComputeFootRaycast::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ClimbingComponent_C_ComputeFootRaycast, K2Node_MakeArray_Array) == 0x000048, "Member 'BP_ClimbingComponent_C_ComputeFootRaycast::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_ClimbingComponent_C_ComputeFootRaycast, CallFunc_GetSocketLocation_ReturnValue) == 0x000058, "Member 'BP_ClimbingComponent_C_ComputeFootRaycast::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ClimbingComponent_C_ComputeFootRaycast, CallFunc_GetForwardVector_ReturnValue) == 0x000070, "Member 'BP_ClimbingComponent_C_ComputeFootRaycast::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ClimbingComponent_C_ComputeFootRaycast, CallFunc_Multiply_VectorVector_ReturnValue) == 0x000088, "Member 'BP_ClimbingComponent_C_ComputeFootRaycast::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ClimbingComponent_C_ComputeFootRaycast, CallFunc_Add_VectorVector_ReturnValue) == 0x0000A0, "Member 'BP_ClimbingComponent_C_ComputeFootRaycast::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ClimbingComponent_C_ComputeFootRaycast, CallFunc_LineTraceSingle_OutHit) == 0x0000B8, "Member 'BP_ClimbingComponent_C_ComputeFootRaycast::CallFunc_LineTraceSingle_OutHit' has a wrong offset!");
static_assert(offsetof(BP_ClimbingComponent_C_ComputeFootRaycast, CallFunc_LineTraceSingle_ReturnValue) == 0x0001B0, "Member 'BP_ClimbingComponent_C_ComputeFootRaycast::CallFunc_LineTraceSingle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ClimbingComponent_C_ComputeFootRaycast, CallFunc_BreakHitResult_bBlockingHit) == 0x0001B1, "Member 'BP_ClimbingComponent_C_ComputeFootRaycast::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(BP_ClimbingComponent_C_ComputeFootRaycast, CallFunc_BreakHitResult_bInitialOverlap) == 0x0001B2, "Member 'BP_ClimbingComponent_C_ComputeFootRaycast::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(BP_ClimbingComponent_C_ComputeFootRaycast, CallFunc_BreakHitResult_Time) == 0x0001B4, "Member 'BP_ClimbingComponent_C_ComputeFootRaycast::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(BP_ClimbingComponent_C_ComputeFootRaycast, CallFunc_BreakHitResult_Distance) == 0x0001B8, "Member 'BP_ClimbingComponent_C_ComputeFootRaycast::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(BP_ClimbingComponent_C_ComputeFootRaycast, CallFunc_BreakHitResult_Location) == 0x0001C0, "Member 'BP_ClimbingComponent_C_ComputeFootRaycast::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(BP_ClimbingComponent_C_ComputeFootRaycast, CallFunc_BreakHitResult_ImpactPoint) == 0x0001D8, "Member 'BP_ClimbingComponent_C_ComputeFootRaycast::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(BP_ClimbingComponent_C_ComputeFootRaycast, CallFunc_BreakHitResult_Normal) == 0x0001F0, "Member 'BP_ClimbingComponent_C_ComputeFootRaycast::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(BP_ClimbingComponent_C_ComputeFootRaycast, CallFunc_BreakHitResult_ImpactNormal) == 0x000208, "Member 'BP_ClimbingComponent_C_ComputeFootRaycast::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(BP_ClimbingComponent_C_ComputeFootRaycast, CallFunc_BreakHitResult_PhysMat) == 0x000220, "Member 'BP_ClimbingComponent_C_ComputeFootRaycast::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(BP_ClimbingComponent_C_ComputeFootRaycast, CallFunc_BreakHitResult_HitActor) == 0x000228, "Member 'BP_ClimbingComponent_C_ComputeFootRaycast::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(BP_ClimbingComponent_C_ComputeFootRaycast, CallFunc_BreakHitResult_HitComponent) == 0x000230, "Member 'BP_ClimbingComponent_C_ComputeFootRaycast::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(BP_ClimbingComponent_C_ComputeFootRaycast, CallFunc_BreakHitResult_HitBoneName) == 0x000238, "Member 'BP_ClimbingComponent_C_ComputeFootRaycast::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(BP_ClimbingComponent_C_ComputeFootRaycast, CallFunc_BreakHitResult_BoneName) == 0x000240, "Member 'BP_ClimbingComponent_C_ComputeFootRaycast::CallFunc_BreakHitResult_BoneName' has a wrong offset!");
static_assert(offsetof(BP_ClimbingComponent_C_ComputeFootRaycast, CallFunc_BreakHitResult_HitItem) == 0x000248, "Member 'BP_ClimbingComponent_C_ComputeFootRaycast::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(BP_ClimbingComponent_C_ComputeFootRaycast, CallFunc_BreakHitResult_ElementIndex) == 0x00024C, "Member 'BP_ClimbingComponent_C_ComputeFootRaycast::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(BP_ClimbingComponent_C_ComputeFootRaycast, CallFunc_BreakHitResult_FaceIndex) == 0x000250, "Member 'BP_ClimbingComponent_C_ComputeFootRaycast::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(BP_ClimbingComponent_C_ComputeFootRaycast, CallFunc_BreakHitResult_TraceStart) == 0x000258, "Member 'BP_ClimbingComponent_C_ComputeFootRaycast::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(BP_ClimbingComponent_C_ComputeFootRaycast, CallFunc_BreakHitResult_TraceEnd) == 0x000270, "Member 'BP_ClimbingComponent_C_ComputeFootRaycast::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");

// Function BP_ClimbingComponent.BP_ClimbingComponent_C.ComputeFootRaycasts
// 0x0040 (0x0040 - 0x0000)
struct BP_ClimbingComponent_C_ComputeFootRaycasts final
{
public:
	bool                                          CallFunc_ComputeFootRaycast_HasHit;                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_ComputeFootRaycast_Location;              // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ComputeFootRaycast_HasHit_1;              // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_ComputeFootRaycast_Location_1;            // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ClimbingComponent_C_ComputeFootRaycasts) == 0x000008, "Wrong alignment on BP_ClimbingComponent_C_ComputeFootRaycasts");
static_assert(sizeof(BP_ClimbingComponent_C_ComputeFootRaycasts) == 0x000040, "Wrong size on BP_ClimbingComponent_C_ComputeFootRaycasts");
static_assert(offsetof(BP_ClimbingComponent_C_ComputeFootRaycasts, CallFunc_ComputeFootRaycast_HasHit) == 0x000000, "Member 'BP_ClimbingComponent_C_ComputeFootRaycasts::CallFunc_ComputeFootRaycast_HasHit' has a wrong offset!");
static_assert(offsetof(BP_ClimbingComponent_C_ComputeFootRaycasts, CallFunc_ComputeFootRaycast_Location) == 0x000008, "Member 'BP_ClimbingComponent_C_ComputeFootRaycasts::CallFunc_ComputeFootRaycast_Location' has a wrong offset!");
static_assert(offsetof(BP_ClimbingComponent_C_ComputeFootRaycasts, CallFunc_ComputeFootRaycast_HasHit_1) == 0x000020, "Member 'BP_ClimbingComponent_C_ComputeFootRaycasts::CallFunc_ComputeFootRaycast_HasHit_1' has a wrong offset!");
static_assert(offsetof(BP_ClimbingComponent_C_ComputeFootRaycasts, CallFunc_ComputeFootRaycast_Location_1) == 0x000028, "Member 'BP_ClimbingComponent_C_ComputeFootRaycasts::CallFunc_ComputeFootRaycast_Location_1' has a wrong offset!");

// Function BP_ClimbingComponent.BP_ClimbingComponent_C.ComputeInputDirections
// 0x0220 (0x0220 - 0x0000)
struct BP_ClimbingComponent_C_ComputeInputDirections final
{
public:
	struct FVector                                InputDirectionHorizontal;                          // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                InputDirectionVertical;                            // 0x0018(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        InputScale;                                        // 0x0030(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetCurrentClimbingElementTransform_ReturnValue; // 0x0040(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x00A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetCameraRotation_ReturnValue;            // 0x00C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetLastInputVector_ReturnValue;           // 0x00D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
