#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ConditionChecker_AtLeastAmountOfItemTypeInInventory

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_ConditionChecker_AtLeastAmountOfItemTypeInInventory.BP_ConditionChecker_AtLeastAmountOfItemTypeInInventory_C.UnbindEventOnGameStateChanged
// 0x0018 (0x0018 - 0x0000)
struct BP_ConditionChecker_AtLeastAmountOfItemTypeInInventory_C_UnbindEventOnGameStateChanged final
{
public:
	TDelegate<void()>                             Event;                                             // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	class UAC_jRPG_InventoryManager_C*            CallFunc_GetInventoryManager_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ConditionChecker_AtLeastAmountOfItemTypeInInventory_C_UnbindEventOnGameStateChanged) == 0x000008, "Wrong alignment on BP_ConditionChecker_AtLeastAmountOfItemTypeInInventory_C_UnbindEventOnGameStateChanged");
static_assert(sizeof(BP_ConditionChecker_AtLeastAmountOfItemTypeInInventory_C_UnbindEventOnGameStateChanged) == 0x000018, "Wrong size on BP_ConditionChecker_AtLeastAmountOfItemTypeInInventory_C_UnbindEventOnGameStateChanged");
static_assert(offsetof(BP_ConditionChecker_AtLeastAmountOfItemTypeInInventory_C_UnbindEventOnGameStateChanged, Event) == 0x000000, "Member 'BP_ConditionChecker_AtLeastAmountOfItemTypeInInventory_C_UnbindEventOnGameStateChanged::Event' has a wrong offset!");
static_assert(offsetof(BP_ConditionChecker_AtLeastAmountOfItemTypeInInventory_C_UnbindEventOnGameStateChanged, CallFunc_GetInventoryManager_ReturnValue) == 0x000010, "Member 'BP_ConditionChecker_AtLeastAmountOfItemTypeInInventory_C_UnbindEventOnGameStateChanged::CallFunc_GetInventoryManager_ReturnValue' has a wrong offset!");

// Function BP_ConditionChecker_AtLeastAmountOfItemTypeInInventory.BP_ConditionChecker_AtLeastAmountOfItemTypeInInventory_C.BindEventOnGameStateChanged
// 0x0018 (0x0018 - 0x0000)
struct BP_ConditionChecker_AtLeastAmountOfItemTypeInInventory_C_BindEventOnGameStateChanged final
{
public:
	TDelegate<void()>                             Event;                                             // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	class UAC_jRPG_InventoryManager_C*            CallFunc_GetInventoryManager_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ConditionChecker_AtLeastAmountOfItemTypeInInventory_C_BindEventOnGameStateChanged) == 0x000008, "Wrong alignment on BP_ConditionChecker_AtLeastAmountOfItemTypeInInventory_C_BindEventOnGameStateChanged");
static_assert(sizeof(BP_ConditionChecker_AtLeastAmountOfItemTypeInInventory_C_BindEventOnGameStateChanged) == 0x000018, "Wrong size on BP_ConditionChecker_AtLeastAmountOfItemTypeInInventory_C_BindEventOnGameStateChanged");
static_assert(offsetof(BP_ConditionChecker_AtLeastAmountOfItemTypeInInventory_C_BindEventOnGameStateChanged, Event) == 0x000000, "Member 'BP_ConditionChecker_AtLeastAmountOfItemTypeInInventory_C_BindEventOnGameStateChanged::Event' has a wrong offset!");
static_assert(offsetof(BP_ConditionChecker_AtLeastAmountOfItemTypeInInventory_C_BindEventOnGameStateChanged, CallFunc_GetInventoryManager_ReturnValue) == 0x000010, "Member 'BP_ConditionChecker_AtLeastAmountOfItemTypeInInventory_C_BindEventOnGameStateChanged::CallFunc_GetInventoryManager_ReturnValue' has a wrong offset!");

// Function BP_ConditionChecker_AtLeastAmountOfItemTypeInInventory.BP_ConditionChecker_AtLeastAmountOfItemTypeInInventory_C.CheckInternal
// 0x000C (0x000C - 0x0000)
struct BP_ConditionChecker_AtLeastAmountOfItemTypeInInventory_C_CheckInternal final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetAmountOfItemTypeInInventory_ItemAmount; // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ConditionChecker_AtLeastAmountOfItemTypeInInventory_C_CheckInternal) == 0x000004, "Wrong alignment on BP_ConditionChecker_AtLeastAmountOfItemTypeInInventory_C_CheckInternal");
static_assert(sizeof(BP_ConditionChecker_AtLeastAmountOfItemTypeInInventory_C_CheckInternal) == 0x00000C, "Wrong size on BP_ConditionChecker_AtLeastAmountOfItemTypeInInventory_C_CheckInternal");
static_assert(offsetof(BP_ConditionChecker_AtLeastAmountOfItemTypeInInventory_C_CheckInternal, ReturnValue) == 0x000000, "Member 'BP_ConditionChecker_AtLeastAmountOfItemTypeInInventory_C_CheckInternal::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConditionChecker_AtLeastAmountOfItemTypeInInventory_C_CheckInternal, CallFunc_GetAmountOfItemTypeInInventory_ItemAmount) == 0x000004, "Member 'BP_ConditionChecker_AtLeastAmountOfItemTypeInInventory_C_CheckInternal::CallFunc_GetAmountOfItemTypeInInventory_ItemAmount' has a wrong offset!");
static_assert(offsetof(BP_ConditionChecker_AtLeastAmountOfItemTypeInInventory_C_CheckInternal, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000008, "Member 'BP_ConditionChecker_AtLeastAmountOfItemTypeInInventory_C_CheckInternal::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");

}

