#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CinematicSystem

#include "Basic.hpp"

#include "S_PostCinematicParameters_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "UMG_structs.hpp"
#include "S_PreCinematicParameters_structs.hpp"
#include "ALSV4_CPP_structs.hpp"
#include "S_InteractiveMusicParameters_structs.hpp"
#include "S_InputLockParameters_structs.hpp"
#include "MovieScene_structs.hpp"
#include "S_TriggerCinematicVariables_structs.hpp"
#include "E_jRPG_CharacterWorldCapability_structs.hpp"
#include "S_GameFlowTransitionRequest_structs.hpp"
#include "S_jRPG_Character_World_Movement_Data_structs.hpp"


namespace SDK::Params
{

// Function BP_CinematicSystem.BP_CinematicSystem_C.AddLevelSequenceActorToDestroy
// 0x0010 (0x0010 - 0x0000)
struct BP_CinematicSystem_C_AddLevelSequenceActorToDestroy final
{
public:
	class ALevelSequenceActor*                    ToDestroy;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CinematicSystem_C_AddLevelSequenceActorToDestroy) == 0x000008, "Wrong alignment on BP_CinematicSystem_C_AddLevelSequenceActorToDestroy");
static_assert(sizeof(BP_CinematicSystem_C_AddLevelSequenceActorToDestroy) == 0x000010, "Wrong size on BP_CinematicSystem_C_AddLevelSequenceActorToDestroy");
static_assert(offsetof(BP_CinematicSystem_C_AddLevelSequenceActorToDestroy, ToDestroy) == 0x000000, "Member 'BP_CinematicSystem_C_AddLevelSequenceActorToDestroy::ToDestroy' has a wrong offset!");
static_assert(offsetof(BP_CinematicSystem_C_AddLevelSequenceActorToDestroy, CallFunc_Array_AddUnique_ReturnValue) == 0x000008, "Member 'BP_CinematicSystem_C_AddLevelSequenceActorToDestroy::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");

// Function BP_CinematicSystem.BP_CinematicSystem_C.ApplyFrameRateLimit
// 0x0008 (0x0008 - 0x0000)
struct BP_CinematicSystem_C_ApplyFrameRateLimit final
{
public:
	class UConfigurableGameUserSettings*          CallFunc_GetConfigurableGameUserSettings_GameUserSettings; // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CinematicSystem_C_ApplyFrameRateLimit) == 0x000008, "Wrong alignment on BP_CinematicSystem_C_ApplyFrameRateLimit");
static_assert(sizeof(BP_CinematicSystem_C_ApplyFrameRateLimit) == 0x000008, "Wrong size on BP_CinematicSystem_C_ApplyFrameRateLimit");
static_assert(offsetof(BP_CinematicSystem_C_ApplyFrameRateLimit, CallFunc_GetConfigurableGameUserSettings_GameUserSettings) == 0x000000, "Member 'BP_CinematicSystem_C_ApplyFrameRateLimit::CallFunc_GetConfigurableGameUserSettings_GameUserSettings' has a wrong offset!");

// Function BP_CinematicSystem.BP_CinematicSystem_C.ApplyLODSettingsOnGroom
// 0x0068 (0x0068 - 0x0000)
struct BP_CinematicSystem_C_ApplyLODSettingsOnGroom final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_3;                               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_4;                               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UConfigurableGameUserSettings*          CallFunc_GetConfigurableGameUserSettings_GameUserSettings; // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UConfigurableGameUserSettings*          CallFunc_GetConfigurableGameUserSettings_GameUserSettings_1; // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_5;                               // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCurrentConsoleTypeLockheart_ReturnValue; // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UConfigurableGameUserSettings*          CallFunc_GetConfigurableGameUserSettings_GameUserSettings_2; // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UConfigurableGameUserSettings*          CallFunc_GetConfigurableGameUserSettings_GameUserSettings_3; // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UConfigurableGameUserSettings*          CallFunc_GetConfigurableGameUserSettings_GameUserSettings_4; // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCurrentPlatformConsole_CurrentPlatformIsConsole; // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_6;                               // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetConsoleVariableIntValue_ReturnValue;   // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue;                        // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default;                             // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CinematicSystem_C_ApplyLODSettingsOnGroom) == 0x000008, "Wrong alignment on BP_CinematicSystem_C_ApplyLODSettingsOnGroom");
static_assert(sizeof(BP_CinematicSystem_C_ApplyLODSettingsOnGroom) == 0x000068, "Wrong size on BP_CinematicSystem_C_ApplyLODSettingsOnGroom");
static_assert(offsetof(BP_CinematicSystem_C_ApplyLODSettingsOnGroom, Temp_int_Variable) == 0x000000, "Member 'BP_CinematicSystem_C_ApplyLODSettingsOnGroom::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_CinematicSystem_C_ApplyLODSettingsOnGroom, Temp_int_Variable_1) == 0x000004, "Member 'BP_CinematicSystem_C_ApplyLODSettingsOnGroom::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_CinematicSystem_C_ApplyLODSettingsOnGroom, Temp_int_Variable_2) == 0x000008, "Member 'BP_CinematicSystem_C_ApplyLODSettingsOnGroom::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_CinematicSystem_C_ApplyLODSettingsOnGroom, Temp_int_Variable_3) == 0x00000C, "Member 'BP_CinematicSystem_C_ApplyLODSettingsOnGroom::Temp_int_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_CinematicSystem_C_ApplyLODSettingsOnGroom, Temp_int_Variable_4) == 0x000010, "Member 'BP_CinematicSystem_C_ApplyLODSettingsOnGroom::Temp_int_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_CinematicSystem_C_ApplyLODSettingsOnGroom, CallFunc_GetConfigurableGameUserSettings_GameUserSettings) == 0x000018, "Member 'BP_CinematicSystem_C_ApplyLODSettingsOnGroom::CallFunc_GetConfigurableGameUserSettings_GameUserSettings' has a wrong offset!");
static_assert(offsetof(BP_CinematicSystem_C_ApplyLODSettingsOnGroom, CallFunc_GetConfigurableGameUserSettings_GameUserSettings_1) == 0x000020, "Member 'BP_CinematicSystem_C_ApplyLODSettingsOnGroom::CallFunc_GetConfigurableGameUserSettings_GameUserSettings_1' has a wrong offset!");
static_assert(offsetof(BP_CinematicSystem_C_ApplyLODSettingsOnGroom, Temp_int_Variable_5) == 0x000028, "Member 'BP_CinematicSystem_C_ApplyLODSettingsOnGroom::Temp_int_Variable_5' has a wrong offset!");
static_assert(offsetof(BP_CinematicSystem_C_ApplyLODSettingsOnGroom, CallFunc_IsCurrentConsoleTypeLockheart_ReturnValue) == 0x00002C, "Member 'BP_CinematicSystem_C_ApplyLODSettingsOnGroom::CallFunc_IsCurrentConsoleTypeLockheart_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CinematicSystem_C_ApplyLODSettingsOnGroom, CallFunc_GetConfigurableGameUserSettings_GameUserSettings_2) == 0x000030, "Member 'BP_CinematicSystem_C_ApplyLODSettingsOnGroom::CallFunc_GetConfigurableGameUserSettings_GameUserSettings_2' has a wrong offset!");
static_assert(offsetof(BP_CinematicSystem_C_ApplyLODSettingsOnGroom, CallFunc_Not_PreBool_ReturnValue) == 0x000038, "Member 'BP_CinematicSystem_C_ApplyLODSettingsOnGroom::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CinematicSystem_C_ApplyLODSettingsOnGroom, CallFunc_GetConfigurableGameUserSettings_GameUserSettings_3) == 0x000040, "Member 'BP_CinematicSystem_C_ApplyLODSettingsOnGroom::CallFunc_GetConfigurableGameUserSettings_GameUserSettings_3' has a wrong offset!");
static_assert(offsetof(BP_CinematicSystem_C_ApplyLODSettingsOnGroom, CallFunc_GetConfigurableGameUserSettings_GameUserSettings_4) == 0x000048, "Member 'BP_CinematicSystem_C_ApplyLODSettingsOnGroom::CallFunc_GetConfigurableGameUserSettings_GameUserSettings_4' has a wrong offset!");
static_assert(offsetof(BP_CinematicSystem_C_ApplyLODSettingsOnGroom, CallFunc_IsCurrentPlatformConsole_CurrentPlatformIsConsole) == 0x000050, "Member 'BP_CinematicSystem_C_ApplyLODSettingsOnGroom::CallFunc_IsCurrentPlatformConsole_CurrentPlatformIsConsole' has a wrong offset!");
static_assert(offsetof(BP_CinematicSystem_C_ApplyLODSettingsOnGroom, Temp_int_Variable_6) == 0x000054, "Member 'BP_CinematicSystem_C_ApplyLODSettingsOnGroom::Temp_int_Variable_6' has a wrong offset!");
static_assert(offsetof(BP_CinematicSystem_C_ApplyLODSettingsOnGroom, CallFunc_GetConsoleVariableIntValue_ReturnValue) == 0x000058, "Member 'BP_CinematicSystem_C_ApplyLODSettingsOnGroom::CallFunc_GetConsoleVariableIntValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CinematicSystem_C_ApplyLODSettingsOnGroom, CallFunc_Clamp_ReturnValue) == 0x00005C, "Member 'BP_CinematicSystem_C_ApplyLODSettingsOnGroom::CallFunc_Clamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CinematicSystem_C_ApplyLODSettingsOnGroom, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000060, "Member 'BP_CinematicSystem_C_ApplyLODSettingsOnGroom::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CinematicSystem_C_ApplyLODSettingsOnGroom, K2Node_Select_Default) == 0x000064, "Member 'BP_CinematicSystem_C_ApplyLODSettingsOnGroom::K2Node_Select_Default' has a wrong offset!");

// Function BP_CinematicSystem.BP_CinematicSystem_C.CleanUpAfterCinematic
// 0x0018 (0x0018 - 0x0000)
struct BP_CinematicSystem_C_CleanUpAfterCinematic final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USF_SubtitlesWorldSubsystem*            CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CinematicSystem_C_CleanUpAfterCinematic) == 0x000008, "Wrong alignment on BP_CinematicSystem_C_CleanUpAfterCinematic");
static_assert(sizeof(BP_CinematicSystem_C_CleanUpAfterCinematic) == 0x000018, "Wrong size on BP_CinematicSystem_C_CleanUpAfterCinematic");
static_assert(offsetof(BP_CinematicSystem_C_CleanUpAfterCinematic, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'BP_CinematicSystem_C_CleanUpAfterCinematic::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CinematicSystem_C_CleanUpAfterCinematic, CallFunc_GetWorldSubsystem_ReturnValue) == 0x000008, "Member 'BP_CinematicSystem_C_CleanUpAfterCinematic::CallFunc_GetWorldSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CinematicSystem_C_CleanUpAfterCinematic, CallFunc_IsValid_ReturnValue_1) == 0x000010, "Member 'BP_CinematicSystem_C_CleanUpAfterCinematic::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function BP_CinematicSystem.BP_CinematicSystem_C.CreateAssetLoadRequest
// 0x0008 (0x0008 - 0x0000)
struct BP_CinematicSystem_C_CreateAssetLoadRequest final
{
public:
	class UBP_LoadAssetRequest_C*                 CallFunc_SpawnObject_ReturnValue;                  // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CinematicSystem_C_CreateAssetLoadRequest) == 0x000008, "Wrong alignment on BP_CinematicSystem_C_CreateAssetLoadRequest");
static_assert(sizeof(BP_CinematicSystem_C_CreateAssetLoadRequest) == 0x000008, "Wrong size on BP_CinematicSystem_C_CreateAssetLoadRequest");
static_assert(offsetof(BP_CinematicSystem_C_CreateAssetLoadRequest, CallFunc_SpawnObject_ReturnValue) == 0x000000, "Member 'BP_CinematicSystem_C_CreateAssetLoadRequest::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");

// Function BP_CinematicSystem.BP_CinematicSystem_C.CreateCinematicControlsWidget
// 0x0038 (0x0038 - 0x0000)
struct BP_CinematicSystem_C_CreateCinematicControlsWidget final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_CinematicControls_C*               CallFunc_Create_ReturnValue;                       // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0028(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CinematicSystem_C_CreateCinematicControlsWidget) == 0x000008, "Wrong alignment on BP_CinematicSystem_C_CreateCinematicControlsWidget");
static_assert(sizeof(BP_CinematicSystem_C_CreateCinematicControlsWidget) == 0x000038, "Wrong size on BP_CinematicSystem_C_CreateCinematicControlsWidget");
static_assert(offsetof(BP_CinematicSystem_C_CreateCinematicControlsWidget, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'BP_CinematicSystem_C_CreateCinematicControlsWidget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_CinematicSystem_C_CreateCinematicControlsWidget, K2Node_CreateDelegate_OutputDelegate_1) == 0x000010, "Member 'BP_CinematicSystem_C_CreateCinematicControlsWidget::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_CinematicSystem_C_CreateCinematicControlsWidget, CallFunc_Create_ReturnValue) == 0x000020, "Member 'BP_CinematicSystem_C_CreateCinematicControlsWidget::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CinematicSystem_C_CreateCinematicControlsWidget, K2Node_CreateDelegate_OutputDelegate_2) == 0x000028, "Member 'BP_CinematicSystem_C_CreateCinematicControlsWidget::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");

// Function BP_CinematicSystem.BP_CinematicSystem_C.DEBUG_AutoSkipCinematicIfNeeded
// 0x0001 (0x0001 - 0x0000)
struct BP_CinematicSystem_C_DEBUG_AutoSkipCinematicIfNeeded final
{
public:
	bool                                          CallFunc_GetBoolCVar_ReturnValue;                  // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CinematicSystem_C_DEBUG_AutoSkipCinematicIfNeeded) == 0x000001, "Wrong alignment on BP_CinematicSystem_C_DEBUG_AutoSkipCinematicIfNeeded");
static_assert(sizeof(BP_CinematicSystem_C_DEBUG_AutoSkipCinematicIfNeeded) == 0x000001, "Wrong size on BP_CinematicSystem_C_DEBUG_AutoSkipCinematicIfNeeded");
static_assert(offsetof(BP_CinematicSystem_C_DEBUG_AutoSkipCinematicIfNeeded, CallFunc_GetBoolCVar_ReturnValue) == 0x000000, "Member 'BP_CinematicSystem_C_DEBUG_AutoSkipCinematicIfNeeded::CallFunc_GetBoolCVar_ReturnValue' has a wrong offset!");

// Function BP_CinematicSystem.BP_CinematicSystem_C.DEBUG_GetCurrentState
// 0x01B0 (0x01B0 - 0x0000)
struct BP_CinematicSystem_C_DEBUG_GetCurrentState final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
	class FString                                 CallFunc_GetSequenceTimeDebugInfo_ReturnValue;     // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0020(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0030(0x0048)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_ObjectToText_ReturnValue;            // 0x0078(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0088(0x0048)(HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00D8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00E8(0x0010)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x00F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class ULevelSequence*                         CallFunc_GetSequence_ReturnValue;                  // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_ObjectToText_ReturnValue_1;          // 0x0110(0x0010)()
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0128(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0170(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0180(0x0010)()
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_191[0x7];                                      // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x0198(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x01A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x01AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x01AB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CinematicSystem_C_DEBUG_GetCurrentState) == 0x000008, "Wrong alignment on BP_CinematicSystem_C_DEBUG_GetCurrentState");
static_assert(sizeof(BP_CinematicSystem_C_DEBUG_GetCurrentState) == 0x0001B0, "Wrong size on BP_CinematicSystem_C_DEBUG_GetCurrentState");
static_assert(offsetof(BP_CinematicSystem_C_DEBUG_GetCurrentState, ReturnValue) == 0x000000, "Member 'BP_CinematicSystem_C_DEBUG_GetCurrentState::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CinematicSystem_C_DEBUG_GetCurrentState, CallFunc_GetSequenceTimeDebugInfo_ReturnValue) == 0x000010, "Member 'BP_CinematicSystem_C_DEBUG_GetCurrentState::CallFunc_GetSequenceTimeDebugInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CinematicSystem_C_DEBUG_GetCurrentState, CallFunc_Conv_StringToText_ReturnValue) == 0x000020, "Member 'BP_CinematicSystem_C_DEBUG_GetCurrentState::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CinematicSystem_C_DEBUG_GetCurrentState, K2Node_MakeStruct_FormatArgumentData) == 0x000030, "Member 'BP_CinematicSystem_C_DEBUG_GetCurrentState::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_CinematicSystem_C_DEBUG_GetCurrentState, CallFunc_Conv_ObjectToText_ReturnValue) == 0x000078, "Member 'BP_CinematicSystem_C_DEBUG_GetCurrentState::CallFunc_Conv_ObjectToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CinematicSystem_C_DEBUG_GetCurrentState, K2Node_MakeStruct_FormatArgumentData_1) == 0x000088, "Member 'BP_CinematicSystem_C_DEBUG_GetCurrentState::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BP_CinematicSystem_C_DEBUG_GetCurrentState, CallFunc_IsValid_ReturnValue) == 0x0000D0, "Member 'BP_CinematicSystem_C_DEBUG_GetCurrentState::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CinematicSystem_C_DEBUG_GetCurrentState, K2Node_MakeArray_Array) == 0x0000D8, "Member 'BP_CinematicSystem_C_DEBUG_GetCurrentState::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_CinematicSystem_C_DEBUG_GetCurrentState, CallFunc_Format_ReturnValue) == 0x0000E8, "Member 'BP_CinematicSystem_C_DEBUG_GetCurrentState::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CinematicSystem_C_DEBUG_GetCurrentState, CallFunc_Conv_TextToString_ReturnValue) == 0x0000F8, "Member 'BP_CinematicSystem_C_DEBUG_GetCurrentState::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CinematicSystem_C_DEBUG_GetCurrentState, CallFunc_GetSequence_ReturnValue) == 0x000108, "Member 'BP_CinematicSystem_C_DEBUG_GetCurrentState::CallFunc_GetSequence_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CinematicSystem_C_DEBUG_GetCurrentState, CallFunc_Conv_ObjectToText_ReturnValue_1) == 0x000110, "Member 'BP_CinematicSystem_C_DEBUG_GetCurrentState::CallFunc_Conv_ObjectToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CinematicSystem_C_DEBUG_GetCurrentState, CallFunc_IsValid_ReturnValue_1) == 0x000120, "Member 'BP_CinematicSystem_C_DEBUG_GetCurrentState::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CinematicSystem_C_DEBUG_GetCurrentState, K2Node_MakeStruct_FormatArgumentData_2) == 0x000128, "Member 'BP_CinematicSystem_C_DEBUG_GetCurrentState::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(BP_CinematicSystem_C_DEBUG_GetCurrentState, K2Node_MakeArray_Array_1) == 0x000170, "Member 'BP_CinematicSystem_C_DEBUG_GetCurrentState::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BP_CinematicSystem_C_DEBUG_GetCurrentState, CallFunc_Format_ReturnValue_1) == 0x000180, "Member 'BP_CinematicSystem_C_DEBUG_GetCurrentState::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CinematicSystem_C_DEBUG_GetCurrentState, CallFunc_IsValid_ReturnValue_2) == 0x000190, "Member 'BP_CinematicSystem_C_DEBUG_GetCurrentState::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CinematicSystem_C_DEBUG_GetCurrentState, CallFunc_Conv_TextToString_ReturnValue_1) == 0x000198, "Member 'BP_CinematicSystem_C_DEBUG_GetCurrentState::CallFunc_Conv_TextToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CinematicSystem_C_DEBUG_GetCurrentState, CallFunc_Not_PreBool_ReturnValue) == 0x0001A8, "Member 'BP_CinematicSystem_C_DEBUG_GetCurrentState::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CinematicSystem_C_DEBUG_GetCurrentState, CallFunc_IsValid_ReturnValue_3) == 0x0001A9, "Member 'BP_CinematicSystem_C_DEBUG_GetCurrentState::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_CinematicSystem_C_DEBUG_GetCurrentState, CallFunc_Not_PreBool_ReturnValue_1) == 0x0001AA, "Member 'BP_CinematicSystem_C_DEBUG_GetCurrentState::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CinematicSystem_C_DEBUG_GetCurrentState, CallFunc_BooleanAND_ReturnValue) == 0x0001AB, "Member 'BP_CinematicSystem_C_DEBUG_GetCurrentState::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BP_CinematicSystem.BP_CinematicSystem_C.DEBUG_ModifyCinematicParameters
// 0x0068 (0x0068 - 0x0000)
struct BP_CinematicSystem_C_DEBUG_ModifyCinematicParameters final
{
public:
	struct FS_PostCinematicParameters             K2Node_MakeStruct_S_PostCinematicParameters;       // 0x0000(0x0060)(ContainsInstancedReference, HasGetValueTypeHash)
	struct FS_PreCinematicParameters              K2Node_MakeStruct_S_PreCinematicParameters;        // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetBoolCVar_ReturnValue;                  // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CinematicSystem_C_DEBUG_ModifyCinematicParameters) == 0x000008, "Wrong alignment on BP_CinematicSystem_C_DEBUG_ModifyCinematicParameters");
static_assert(sizeof(BP_CinematicSystem_C_DEBUG_ModifyCinematicParameters) == 0x000068, "Wrong size on BP_CinematicSystem_C_DEBUG_ModifyCinematicParameters");
static_assert(offsetof(BP_CinematicSystem_C_DEBUG_ModifyCinematicParameters, K2Node_MakeStruct_S_PostCinematicParameters) == 0x000000, "Member 'BP_CinematicSystem_C_DEBUG_ModifyCinematicParameters::K2Node_MakeStruct_S_PostCinematicParameters' has a wrong offset!");
static_assert(offsetof(BP_CinematicSystem_C_DEBUG_ModifyCinematicParameters, K2Node_MakeStruct_S_PreCinematicParameters) == 0x000060, "Member 'BP_CinematicSystem_C_DEBUG_ModifyCinematicParameters::K2Node_MakeStruct_S_PreCinematicParameters' has a wrong offset!");
static_assert(offsetof(BP_CinematicSystem_C_DEBUG_ModifyCinematicParameters, CallFunc_GetBoolCVar_ReturnValue) == 0x000061, "Member 'BP_CinematicSystem_C_DEBUG_ModifyCinematicParameters::CallFunc_GetBoolCVar_ReturnValue' has a wrong offset!");

// Function BP_CinematicSystem.BP_CinematicSystem_C.DisplayCinematicTransitionWidget
// 0x0010 (0x0010 - 0x0000)
struct BP_CinematicSystem_C_DisplayCinematicTransitionWidget final
{
public:
	EUMGSequencePlayMode                          PlayMode;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_CinematicTransition_C*             CallFunc_Create_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CinematicSystem_C_DisplayCinematicTransitionWidget) == 0x000008, "Wrong alignment on BP_CinematicSystem_C_DisplayCinematicTransitionWidget");
static_assert(sizeof(BP_CinematicSystem_C_DisplayCinematicTransitionWidget) == 0x000010, "Wrong size on BP_CinematicSystem_C_DisplayCinematicTransitionWidget");
static_assert(offsetof(BP_CinematicSystem_C_DisplayCinematicTransitionWidget, PlayMode) == 0x000000, "Member 'BP_CinematicSystem_C_DisplayCinematicTransitionWidget::PlayMode' has a wrong offset!");
static_assert(offsetof(BP_CinematicSystem_C_DisplayCinematicTransitionWidget, CallFunc_Create_ReturnValue) == 0x000008, "Member 'BP_CinematicSystem_C_DisplayCinematicTransitionWidget::CallFunc_Create_ReturnValue' has a wrong offset!");

// Function BP_CinematicSystem.BP_CinematicSystem_C.ExecuteGameActionIfNeeded
// 0x0001 (0x0001 - 0x0000)
struct BP_CinematicSystem_C_ExecuteGameActionIfNeeded final
{
public:
	bool                                          CallFunc_IsValidGameActionWrapper_IsValid;         // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CinematicSystem_C_ExecuteGameActionIfNeeded) == 0x000001, "Wrong alignment on BP_CinematicSystem_C_ExecuteGameActionIfNeeded");
static_assert(sizeof(BP_CinematicSystem_C_ExecuteGameActionIfNeeded) == 0x000001, "Wrong size on BP_CinematicSystem_C_ExecuteGameActionIfNeeded");
static_assert(offsetof(BP_CinematicSystem_C_ExecuteGameActionIfNeeded, CallFunc_IsValidGameActionWrapper_IsValid) == 0x000000, "Member 'BP_CinematicSystem_C_ExecuteGameActionIfNeeded::CallFunc_IsValidGameActionWrapper_IsValid' has a wrong offset!");

// Function BP_CinematicSystem.BP_CinematicSystem_C.ExecuteUbergraph_BP_CinematicSystem
// 0x0458 (0x0458 - 0x0000)
struct BP_CinematicSystem_C_ExecuteUbergraph_BP_CinematicSystem final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue_1;     // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_Cine_ExitPoint_C*                   K2Node_DynamicCast_AsBP_Cine_Exit_Point;           // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWorldPartitionStreamingSourceComponent*> K2Node_MakeArray_Array;                   // 0x0038(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_TriggerCinematicVariables           K2Node_CustomEvent_TriggerCinematicVariableStruct; // 0x0058(0x0150)(ContainsInstancedReference, HasGetValueTypeHash)
	class USF_BlueprintLatentAction*              K2Node_CustomEvent_LatentAction;                   // 0x01A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsNameValid_ReturnValue;                  // 0x01B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x01B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ValidateCinematicContext_IsValid;         // 0x01B3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B4[0x4];                                      // 0x01B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x01B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_jRPG_GI_Custom_C*                   K2Node_DynamicCast_AsBP_J_RPG_GI_Custom;           // 0x01C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Pause_ReturnValue;                        // 0x01C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1CA[0x2];                                      // 0x01CA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQualifiedFrameTime                    CallFunc_GetEndTime_ReturnValue;                   // 0x01CC(0x0010)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_QualifiedFrameTimeToSeconds_ReturnValue; // 0x01DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMovieSceneSequencePlaybackParams      K2Node_MakeStruct_MovieSceneSequencePlaybackParams; // 0x01E0(0x0038)()
	class FString                                 CallFunc_DEBUG_GetCurrentState_ReturnValue;        // 0x0218(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_229[0x7];                                      // 0x0229(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0230(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0240(0x0048)(HasGetValueTypeHash)
	class FString                                 CallFunc_DEBUG_GetCurrentState_ReturnValue_1;      // 0x0288(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0298(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x02A8(0x0010)()
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x02B8(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x02C8(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_2;                          // 0x0310(0x0010)(ReferenceParm)
	class FString                                 CallFunc_DEBUG_GetCurrentState_ReturnValue_2;      // 0x0320(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0330(0x0010)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_2;          // 0x0340(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0350(0x0048)(HasGetValueTypeHash)
	class UBP_InteractionSystem_C*                CallFunc_GetInteractionSystem_ReturnValue;         // 0x0398(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_3;                          // 0x03A0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_2;                     // 0x03B0(0x0010)()
	bool                                          CallFunc_SetGamePaused_ReturnValue;                // 0x03C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetGamePaused_ReturnValue_1;              // 0x03C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetGamePaused_ReturnValue_2;              // 0x03C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable_1;               // 0x03C3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x03C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_MultiGate_FirstRun;                         // 0x03C5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_MultiGate_ScratchBool;                      // 0x03C6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C7[0x1];                                      // 0x03C7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_MultiGate_ScratchIndex;                     // 0x03C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ValidateCinematicParameters_IsValid;      // 0x03CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3CD[0x3];                                      // 0x03CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool bShouldPause)>            K2Node_CreateDelegate_OutputDelegate;              // 0x03D0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x03E0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlatformsSubsystem*                    CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x03F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Play_ReturnValue;                         // 0x03F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x03F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidGameActionWrapper_IsValid;         // 0x03FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3FB[0x5];                                      // 0x03FB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class USF_BlueprintLatentAction*              CallFunc_ReleaseAndWaitGameFlowTransitionFadeOut_LatentAction; // 0x0400(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_ExecuteGameActionRequest_C*         CallFunc_SpawnObject_ReturnValue;                  // 0x0408(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable_1;                     // 0x0410(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_411[0x3];                                      // 0x0411(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0414(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USF_BlueprintLatentAction*              CallFunc_ReleaseAndWaitGameFlowTransition_LatentAction; // 0x0418(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bShouldPause;                   // 0x0420(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_421[0x7];                                      // 0x0421(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_InputLockComponent_C*               CallFunc_GetInputLockSystem_ReturnValue;           // 0x0428(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FS_InputLockParameters                 K2Node_MakeStruct_S_InputLockParameters;           // 0x0430(0x0002)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_432[0x2];                                      // 0x0432(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0434(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsNotEmpty_ReturnValue;             // 0x0438(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_439[0x7];                                      // 0x0439(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ALevelSequenceActor*                    CallFunc_Array_Get_Item;                           // 0x0440(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0448(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x044C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44D[0x3];                                      // 0x044D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Delay_Duration_ImplicitCast;              // 0x0450(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Delay_Duration_ImplicitCast_1;            // 0x0454(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CinematicSystem_C_ExecuteUbergraph_BP_CinematicSystem) == 0x000008, "Wrong alignment on BP_CinematicSystem_C_ExecuteUbergraph_BP_CinematicSystem");
static_assert(sizeof(BP_CinematicSystem_C_ExecuteUbergraph_BP_CinematicSystem) == 0x000458, "Wrong size on BP_CinematicSystem_C_ExecuteUbergraph_BP_CinematicSystem");
static_assert(offsetof(BP_CinematicSystem_C_ExecuteUbergraph_BP_CinematicSystem, EntryPoint) == 0x000000, "Member 'BP_CinematicSystem_C_ExecuteUbergraph_BP_CinematicSystem::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_CinematicSystem_C_ExecuteUbergraph_BP_CinematicSystem, CallFunc_GetPlayerCameraManager_ReturnValue) == 0x000008, "Member 'BP_CinematicSystem_C_ExecuteUbergraph_BP_CinematicSystem::CallFunc_GetPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CinematicSystem_C_ExecuteUbergraph_BP_CinematicSystem, CallFunc_GetPlayerCameraManager_ReturnValue_1) == 0x000010, "Member 'BP_CinematicSystem_C_ExecuteUbergraph_BP_CinematicSystem::CallFunc_GetPlayerCameraManager_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CinematicSystem_C_ExecuteUbergraph_BP_CinematicSystem, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'BP_CinematicSystem_C_ExecuteUbergraph_BP_CinematicSystem::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CinematicSystem_C_ExecuteUbergraph_BP_CinematicSystem, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue) == 0x000020, "Member 'BP_CinematicSystem_C_ExecuteUbergraph_BP_CinematicSystem::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CinematicSystem_C_ExecuteUbergraph_BP_CinematicSystem, K2Node_DynamicCast_AsBP_Cine_Exit_Point) == 0x000028, "Member 'BP_CinematicSystem_C_ExecuteUbergraph_BP_CinematicSystem::K2Node_DynamicCast_AsBP_Cine_Exit_Point' has a wrong offset!");
static_assert(offsetof(BP_CinematicSystem_C_ExecuteUbergraph_BP_CinematicSystem, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'BP_CinematicSystem_C_ExecuteUbergraph_BP_CinematicSystem::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_CinematicSystem_C_ExecuteUbergraph_BP_CinematicSystem, K2Node_MakeArray_Array) == 0x000038, "Member 'BP_CinematicSystem_C_ExecuteUbergraph_BP_CinematicSystem::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_CinematicSystem_C_ExecuteUbergraph_BP_CinematicSystem, Temp_bool_Has_Been_Initd_Variable) == 0x000048, "Member 'BP_CinematicSystem_C_ExecuteUbergraph_BP_CinematicSystem::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_CinematicSystem_C_ExecuteUbergraph_BP_CinematicSystem, Temp_int_Loop_Counter_Variable) == 0x00004C, "Member 'BP_CinematicSystem_C_ExecuteUbergraph_BP_CinematicSystem::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_CinematicSystem_C_ExecuteUbergraph_BP_CinematicSystem, CallFunc_Add_IntInt_ReturnValue) == 0x000050, "Member 'BP_CinematicSystem_C_ExecuteUbergraph_BP_CinematicSystem::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CinematicSystem_C_ExecuteUbergraph_BP_CinematicSystem, Temp_int_Array_Index_Variable) == 0x000054, "Member 'BP_CinematicSystem_C_ExecuteUbergraph_BP_CinematicSystem::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_CinematicSystem_C_ExecuteUbergraph_BP_CinematicSystem, K2Node_CustomEvent_TriggerCinematicVariableStruct) == 0x000058, "Member 'BP_CinematicSystem_C_ExecuteUbergraph_BP_CinematicSystem::K2Node_CustomEvent_TriggerCinematicVariableStruct' has a wrong offset!");
static_assert(offsetof(BP_CinematicSystem_C_ExecuteUbergraph_BP_CinematicSystem, K2Node_CustomEvent_LatentAction) == 0x0001A8, "Member 'BP_CinematicSystem_C_ExecuteUbergraph_BP_CinematicSystem::K2Node_CustomEvent_LatentAction' has a wrong offset!");
static_assert(offsetof(BP_CinematicSystem_C_ExecuteUbergraph_BP_CinematicSystem, CallFunc_IsValid_ReturnValue_1) == 0x0001B0, "Member 'BP_CinematicSystem_C_ExecuteUbergraph_BP_CinematicSystem::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CinematicSystem_C_ExecuteUbergraph_BP_CinematicSystem, CallFunc_IsNameValid_ReturnValue) == 0x0001B1, "Member 'BP_CinematicSystem_C_ExecuteUbergraph_BP_CinematicSystem::CallFunc_IsNameValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CinematicSystem_C_ExecuteUbergraph_BP_CinematicSystem, CallFunc_IsValid_ReturnValue_2) == 0x0001B2, "Member 'BP_CinematicSystem_C_ExecuteUbergraph_BP_CinematicSystem::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CinematicSystem_C_ExecuteUbergraph_BP_CinematicSystem, CallFunc_ValidateCinematicContext_IsValid) == 0x0001B3, "Member 'BP_CinematicSystem_C_ExecuteUbergraph_BP_CinematicSystem::CallFunc_ValidateCinematicContext_IsValid' has a wrong offset!");
static_assert(offsetof(BP_CinematicSystem_C_ExecuteUbergraph_BP_CinematicSystem, CallFunc_GetGameInstance_ReturnValue) == 0x0001B8, "Member 'BP_CinematicSystem_C_ExecuteUbergraph_BP_CinematicSystem::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CinematicSystem_C_ExecuteUbergraph_BP_CinematicSystem, K2Node_DynamicCast_AsBP_J_RPG_GI_Custom) == 0x0001C0, "Member 'BP_CinematicSystem_C_ExecuteUbergraph_BP_CinematicSystem::K2Node_DynamicCast_AsBP_J_RPG_GI_Custom' has a wrong offset!");
static_assert(offsetof(BP_CinematicSystem_C_ExecuteUbergraph_BP_CinematicSystem, K2Node_DynamicCast_bSuccess_1) == 0x0001C8, "Member 'BP_CinematicSystem_C_ExecuteUbergraph_BP_CinematicSystem::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_CinematicSystem_C_ExecuteUbergraph_BP_CinematicSystem, CallFunc_Pause_ReturnValue) == 0x0001C9, "Member 'BP_CinematicSystem_C_ExecuteUbergraph_BP_CinematicSystem::CallFunc_Pause_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CinematicSystem_C_ExecuteUbergraph_BP_CinematicSystem, CallFunc_GetEndTime_ReturnValue) == 0x0001CC, "Member 'BP_CinematicSystem_C_ExecuteUbergraph_BP_CinematicSystem::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CinematicSystem_C_ExecuteUbergraph_BP_CinematicSystem, CallFunc_Conv_QualifiedFrameTimeToSeconds_ReturnValue) == 0x0001DC, "Member 'BP_CinematicSystem_C_ExecuteUbergraph_BP_CinematicSystem::CallFunc_Conv_QualifiedFrameTimeToSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CinematicSystem_C_ExecuteUbergraph_BP_CinematicSystem, K2Node_MakeStruct_MovieSceneSequencePlaybackParams) == 0x0001E0, "Member 'BP_CinematicSystem_C_ExecuteUbergraph_BP_CinematicSystem::K2Node_MakeStruct_MovieSceneSequencePlaybackParams' has a wrong offset!");
static_assert(offsetof(BP_CinematicSystem_C_ExecuteUbergraph_BP_CinematicSystem, CallFunc_DEBUG_GetCurrentState_ReturnValue) == 0x000218, "Member 'BP_CinematicSystem_C_ExecuteUbergraph_BP_CinematicSystem::CallFunc_DEBUG_GetCurrentState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CinematicSystem_C_ExecuteUbergraph_BP_CinematicSystem, CallFunc_BooleanAND_ReturnValue) == 0x000228, "Member 'BP_CinematicSystem_C_ExecuteUbergraph_BP_CinematicSystem::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CinematicSystem_C_ExecuteUbergraph_BP_CinematicSystem, CallFunc_Conv_StringToText_ReturnValue) == 0x000230, "Member 'BP_CinematicSystem_C_ExecuteUbergraph_BP_CinematicSystem::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CinematicSystem_C_ExecuteUbergraph_BP_CinematicSystem, K2Node_MakeStruct_FormatArgumentData) == 0x000240, "Member 'BP_CinematicSystem_C_ExecuteUbergraph_BP_CinematicSystem::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_CinematicSystem_C_ExecuteUbergraph_BP_CinematicSystem, CallFunc_DEBUG_GetCurrentState_ReturnValue_1) == 0x000288, "Member 'BP_CinematicSystem_C_ExecuteUbergraph_BP_CinematicSystem::CallFunc_DEBUG_GetCurrentState_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CinematicSystem_C_ExecuteUbergraph_BP_CinematicSystem, K2Node_MakeArray_Array_1) == 0x000298, "Member 'BP_CinematicSystem_C_ExecuteUbergraph_BP_CinematicSystem::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BP_CinematicSystem_C_ExecuteUbergraph_BP_CinematicSystem, CallFunc_Conv_StringToText_ReturnValue_1) == 0x0002A8, "Member 'BP_CinematicSystem_C_ExecuteUbergraph_BP_CinematicSystem::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CinematicSystem_C_ExecuteUbergraph_BP_CinematicSystem, CallFunc_Format_ReturnValue) == 0x0002B8, "Member 'BP_CinematicSystem_C_ExecuteUbergraph_BP_CinematicSystem::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CinematicSystem_C_ExecuteUbergraph_BP_CinematicSystem, K2Node_MakeStruct_FormatArgumentData_1) == 0x0002C8, "Member 'BP_CinematicSystem_C_ExecuteUbergraph_BP_CinematicSystem::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BP_CinematicSystem_C_ExecuteUbergraph_BP_CinematicSystem, K2Node_MakeArray_Array_2) == 0x000310, "Member 'BP_CinematicSystem_C_ExecuteUbergraph_BP_CinematicSystem::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(BP_CinematicSystem_C_ExecuteUbergraph_BP_CinematicSystem, CallFunc_DEBUG_GetCurrentState_ReturnValue_2) == 0x000320, "Member 'BP_CinematicSystem_C_ExecuteUbergraph_BP_CinematicSystem::CallFunc_DEBUG_GetCurrentState_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CinematicSystem_C_ExecuteUbergraph_BP_CinematicSystem, CallFunc_Format_ReturnValue_1) == 0x000330, "Member 'BP_CinematicSystem_C_ExecuteUbergraph_BP_CinematicSystem::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CinematicSystem_C_ExecuteUbergraph_BP_CinematicSystem, CallFunc_Conv_StringToText_ReturnValue_2) == 0x000340, "Member 'BP_CinematicSystem_C_ExecuteUbergraph_BP_CinematicSystem::CallFunc_Conv_StringToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CinematicSystem_C_ExecuteUbergraph_BP_CinematicSystem, K2Node_MakeStruct_FormatArgumentData_2) == 0x000350, "Member 'BP_CinematicSystem_C_ExecuteUbergraph_BP_CinematicSystem::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(BP_CinematicSystem_C_ExecuteUbergraph_BP_CinematicSystem, CallFunc_GetInteractionSystem_ReturnValue) == 0x000398, "Member 'BP_CinematicSystem_C_ExecuteUbergraph_BP_CinematicSystem::CallFunc_GetInteractionSystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CinematicSystem_C_ExecuteUbergraph_BP_CinematicSystem, K2Node_MakeArray_Array_3) == 0x0003A0, "Member 'BP_CinematicSystem_C_ExecuteUbergraph_BP_CinematicSystem::K2Node_MakeArray_Array_3' has a wrong offset!");
static_assert(offsetof(BP_CinematicSystem_C_ExecuteUbergraph_BP_CinematicSystem, CallFunc_Format_ReturnValue_2) == 0x0003B0, "Member 'BP_CinematicSystem_C_ExecuteUbergraph_BP_CinematicSystem::CallFunc_Format_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CinematicSystem_C_ExecuteUbergraph_BP_CinematicSystem, CallFunc_SetGamePaused_ReturnValue) == 0x0003C0, "Member 'BP_CinematicSystem_C_ExecuteUbergraph_BP_CinematicSystem::CallFunc_SetGamePaused_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CinematicSystem_C_ExecuteUbergraph_BP_CinematicSystem, CallFunc_SetGamePaused_ReturnValue_1) == 0x0003C1, "Member 'BP_CinematicSystem_C_ExecuteUbergraph_BP_CinematicSystem::CallFunc_SetGamePaused_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CinematicSystem_C_ExecuteUbergraph_BP_CinematicSystem, CallFunc_SetGamePaused_ReturnValue_2) == 0x0003C2, "Member 'BP_CinematicSystem_C_ExecuteUbergraph_BP_CinematicSystem::CallFunc_SetGamePaused_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CinematicSystem_C_ExecuteUbergraph_BP_CinematicSystem, Temp_bool_Has_Been_Initd_Variable_1) == 0x0003C3, "Member 'BP_CinematicSystem_C_ExecuteUbergraph_BP_CinematicSystem::Temp_bool_Has_Been_Initd_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_CinematicSystem_C_ExecuteUbergraph_BP_CinematicSystem, Temp_bool_IsClosed_Variable) == 0x0003C4, "Member 'BP_CinematicSystem_C_ExecuteUbergraph_BP_CinematicSystem::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_CinematicSystem_C_ExecuteUbergraph_BP_CinematicSystem, K2Node_MultiGate_FirstRun) == 0x0003C5, "Member 'BP_CinematicSystem_C_ExecuteUbergraph_BP_CinematicSystem::K2Node_MultiGate_FirstRun' has a wrong offset!");
static_assert(offsetof(BP_CinematicSystem_C_ExecuteUbergraph_BP_CinematicSystem, K2Node_MultiGate_ScratchBool) == 0x0003C6, "Member 'BP_CinematicSystem_C_ExecuteUbergraph_BP_CinematicSystem::K2Node_MultiGate_ScratchBool' has a wrong offset!");
static_assert(offsetof(BP_CinematicSystem_C_ExecuteUbergraph_BP_CinematicSystem, K2Node_MultiGate_ScratchIndex) == 0x0003C8, "Member 'BP_CinematicSystem_C_ExecuteUbergraph_BP_CinematicSystem::K2Node_MultiGate_ScratchIndex' has a wrong offset!");
static_assert(offsetof(BP_CinematicSystem_C_ExecuteUbergraph_BP_CinematicSystem, CallFunc_ValidateCinematicParameters_IsValid) == 0x0003CC, "Member 'BP_CinematicSystem_C_ExecuteUbergraph_BP_CinematicSystem::CallFunc_ValidateCinematicParameters_IsValid' has a wrong offset!");
