#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CharacterData

#include "Basic.hpp"

#include "E_jRPG_StatType_structs.hpp"
#include "ECharacterAttribute_structs.hpp"
#include "S_jRPG_Item_StaticData_structs.hpp"
#include "FPassiveEffectProgression_structs.hpp"
#include "FSkillUnlockInfos_structs.hpp"
#include "E_jRPG_ItemSubtype_structs.hpp"
#include "EAttributeScalingGrade_structs.hpp"
#include "Engine_structs.hpp"
#include "FEquipmentSlot_structs.hpp"
#include "S_jRPG_CharacterDefinition_structs.hpp"
#include "FSkillUnlockData_structs.hpp"
#include "S_CharacterCustomization_structs.hpp"
#include "S_CharacterCustomizationItemData_structs.hpp"
#include "SandFall_classes.hpp"
#include "E_CustomizationItemType_structs.hpp"
#include "E_jRPG_ItemType_structs.hpp"
#include "EAttackType_structs.hpp"
#include "ESkillElementOverride_structs.hpp"
#include "ESkillNodeState_structs.hpp"
#include "ELearnSkillBlockedReason_structs.hpp"
#include "E_Characters_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_CharacterData.BP_CharacterData_C
// 0x0898 (0x08C0 - 0x0028)
class UBP_CharacterData_C final : public UExtendedObject
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0028(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class FName                                   HardcodedNameID;                                   // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<struct FFEquipmentSlot, struct FS_jRPG_Item_StaticData> EquipmentPerSlot;                   // 0x0038(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, Deprecated, ContainsInstancedReference)
	TMap<E_jRPG_StatType, double>                 BaseStats;                                         // 0x0088(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, Deprecated)
	TMap<E_jRPG_StatType, double>                 LevelingStats;                                     // 0x00D8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<E_jRPG_StatType, double>                 EquipmentStats;                                    // 0x0128(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<E_jRPG_StatType, double>                 AttributeStats;                                    // 0x0178(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<E_jRPG_StatType, double>                 ComputedStats;                                     // 0x01C8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         CurrentLevel;                                      // 0x0218(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentExperienceInLevel;                          // 0x021C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MaxActionPoints;                                   // 0x0220(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LuminaMaxPointsFromLevel;                          // 0x0224(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LuminaMaxPointsFromConsumables;                    // 0x0228(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentlyUsedLuminaPoints;                         // 0x022C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           EquippedPassiveEffects;                            // 0x0230(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class FName, struct FFPassiveEffectProgression> PassiveEffectProgressions;                  // 0x0240(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, Deprecated)
	double                                        CurrentHP;                                         // 0x0290(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CurrentAP;                                         // 0x0298(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_jRPG_CharacterDefinition            CharacterDefinition;                               // 0x02A0(0x0328)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference, HasGetValueTypeHash)
	TMap<ECharacterAttribute, int32>              AssignedCharacterAttributePoints;                  // 0x05C8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UBP_DA_CharacterAttributeScalingProfile_C* AttributeScalingProfile;                        // 0x0618(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, Deprecated, NoDestructor, HasGetValueTypeHash)
	TMap<class FName, int32>                      LearntSkills;                                      // 0x0620(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, Deprecated)
	int32                                         MaxAttributesPointsFromLeveling;                   // 0x0670(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MaxAttributesPointsFromItems;                      // 0x0674(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SkillPointsFromLeveling;                           // 0x0678(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SkillPointsFromItems;                              // 0x067C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentlyUsedSkillPoints;                          // 0x0680(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_684[0x4];                                      // 0x0684(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UBP_DataAsset_Skill_C*>          UnlockedSkills;                                    // 0x0688(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, Deprecated)
	TMap<class UBP_DataAsset_Skill_C*, struct FFSkillUnlockData> CurrentSkillTreeUnlocksMap;         // 0x0698(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, Deprecated)
	TMulticastInlineDelegate<void()>              OnSkillTreeChanged;                                // 0x06E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMap<class UBP_DataAsset_Skill_C*, class UBP_DataAsset_Skill_C*> CurrentSkillTreeParentsMap;     // 0x06F8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, Deprecated)
	TMap<class UBP_DataAsset_Skill_C*, struct FFSkillUnlockInfos> CurrentSkillTreeUnlockInfosMap;    // 0x0748(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, Deprecated)
	TArray<class UBP_DataAsset_Skill_C*>          EquippedSkills;                                    // 0x0798(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, Deprecated)
	TMulticastInlineDelegate<void()>              OnChange;                                          // 0x07A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(class UBP_CharacterData_C* CharacterData)> OnExplorationDeath;     // 0x07B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FS_CharacterCustomization              CharacterCustomization;                            // 0x07C8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct FS_CharacterCustomizationItemData      CharacterCustomizationItemData;                    // 0x0818(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShouldDeferUpdate;                                 // 0x0828(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsDeferredUpdateDirty;                             // 0x0829(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_82A[0x6];                                      // 0x082A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_CharacterSkillGraphSystem_C*        SkillGraphSystem;                                  // 0x0830(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          IsExcluded;                                        // 0x0838(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_839[0x7];                                      // 0x0839(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<struct FFEquipmentSlot, class UBP_ItemInstance_Gear_C*> EquipmentInstancePerSlot;           // 0x0840(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UBP_DA_CharacterStatsPerLevelScalingProfile_C* StatPerLevelProfile;                        // 0x0890(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UBP_DA_CharacterAttributeScalingProfile_DT_C* AttributeScalingProfile_DT;                  // 0x0898(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          ShouldDispatchModifications;                       // 0x08A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8A1[0x7];                                      // 0x08A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_DataAsset_SkillGraph_C*             SkillGraph;                                        // 0x08A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UBP_DataAsset_CharacterExplorationAudioProfile_C* LoadedAudioProfile_Exploration;          // 0x08B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UBP_DataAsset_CharacterBattleAudioProfile_C* LoadedAudioProfile_Battle;                    // 0x08B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void AddExperience(int32 XP);
	void AddLuminaPointFromConsumable();
	void ApplyCharacterCustomizationItem(class FName ItemName);
	void AssignPointToAttribute(ECharacterAttribute Attribute);
	void BPI_GetDependencies(TArray<TSoftClassPtr<class UClass>>* Classes, TArray<TSoftObjectPtr<class UObject>>* Assets, TArray<TScriptInterface<class IBPI_LoadingDependenciesSource_C>>* ExternalDependencies);
	bool CanAffordLuminaCost(int32 LuminaCost);
	bool CanAffordSkillUnlock(class UBP_DataAsset_Skill_C* Skill);
	bool CanEquipItem(const struct FS_jRPG_Item_StaticData& ItemData);
	bool CanEquipLuminaPassive(const struct FFPassiveEffect& PassiveEffectDefinition, const struct FFPassiveEffectProgression& PassiveEffectProgression, int32* EffectiveCost);
	bool CanLearnSkill(const class UBP_DataAsset_Skill_C*& Skill, ELearnSkillBlockedReason* BlockedReason);
