#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CharacterSkillGraphSystem

#include "Basic.hpp"

#include "S_jRPG_CharacterSaveState_structs.hpp"
#include "ELearnSkillBlockedReason_structs.hpp"
#include "FSkillGraphNode_structs.hpp"
#include "ESkillNodeState_structs.hpp"
#include "S_jRPG_Item_StaticData_structs.hpp"
#include "Engine_structs.hpp"
#include "FSkillUnlockData_structs.hpp"


namespace SDK::Params
{

// Function BP_CharacterSkillGraphSystem.BP_CharacterSkillGraphSystem_C.CanAffordSkillUnlock
// 0x0020 (0x0020 - 0x0000)
struct BP_CharacterSkillGraphSystem_C_CanAffordSkillUnlock final
{
public:
	class UBP_DataAsset_Skill_C*                  Skill;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetAvailableSkillPoints_ReturnValue;      // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_DataAsset_SkillGraph_C*             CallFunc_GetSkillGraph_SkillGraph;                 // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSkillPointUnlockCost_UnlockCost;       // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CharacterSkillGraphSystem_C_CanAffordSkillUnlock) == 0x000008, "Wrong alignment on BP_CharacterSkillGraphSystem_C_CanAffordSkillUnlock");
static_assert(sizeof(BP_CharacterSkillGraphSystem_C_CanAffordSkillUnlock) == 0x000020, "Wrong size on BP_CharacterSkillGraphSystem_C_CanAffordSkillUnlock");
static_assert(offsetof(BP_CharacterSkillGraphSystem_C_CanAffordSkillUnlock, Skill) == 0x000000, "Member 'BP_CharacterSkillGraphSystem_C_CanAffordSkillUnlock::Skill' has a wrong offset!");
static_assert(offsetof(BP_CharacterSkillGraphSystem_C_CanAffordSkillUnlock, ReturnValue) == 0x000008, "Member 'BP_CharacterSkillGraphSystem_C_CanAffordSkillUnlock::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterSkillGraphSystem_C_CanAffordSkillUnlock, CallFunc_GetAvailableSkillPoints_ReturnValue) == 0x00000C, "Member 'BP_CharacterSkillGraphSystem_C_CanAffordSkillUnlock::CallFunc_GetAvailableSkillPoints_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterSkillGraphSystem_C_CanAffordSkillUnlock, CallFunc_GetSkillGraph_SkillGraph) == 0x000010, "Member 'BP_CharacterSkillGraphSystem_C_CanAffordSkillUnlock::CallFunc_GetSkillGraph_SkillGraph' has a wrong offset!");
static_assert(offsetof(BP_CharacterSkillGraphSystem_C_CanAffordSkillUnlock, CallFunc_GetSkillPointUnlockCost_UnlockCost) == 0x000018, "Member 'BP_CharacterSkillGraphSystem_C_CanAffordSkillUnlock::CallFunc_GetSkillPointUnlockCost_UnlockCost' has a wrong offset!");
static_assert(offsetof(BP_CharacterSkillGraphSystem_C_CanAffordSkillUnlock, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00001C, "Member 'BP_CharacterSkillGraphSystem_C_CanAffordSkillUnlock::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");

// Function BP_CharacterSkillGraphSystem.BP_CharacterSkillGraphSystem_C.CanEquipMoreSkills
// 0x0010 (0x0010 - 0x0000)
struct BP_CharacterSkillGraphSystem_C_CanEquipMoreSkills final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetMaxSkillsCount_ReturnValue;            // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CharacterSkillGraphSystem_C_CanEquipMoreSkills) == 0x000004, "Wrong alignment on BP_CharacterSkillGraphSystem_C_CanEquipMoreSkills");
static_assert(sizeof(BP_CharacterSkillGraphSystem_C_CanEquipMoreSkills) == 0x000010, "Wrong size on BP_CharacterSkillGraphSystem_C_CanEquipMoreSkills");
static_assert(offsetof(BP_CharacterSkillGraphSystem_C_CanEquipMoreSkills, ReturnValue) == 0x000000, "Member 'BP_CharacterSkillGraphSystem_C_CanEquipMoreSkills::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterSkillGraphSystem_C_CanEquipMoreSkills, CallFunc_GetMaxSkillsCount_ReturnValue) == 0x000004, "Member 'BP_CharacterSkillGraphSystem_C_CanEquipMoreSkills::CallFunc_GetMaxSkillsCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterSkillGraphSystem_C_CanEquipMoreSkills, CallFunc_Array_Length_ReturnValue) == 0x000008, "Member 'BP_CharacterSkillGraphSystem_C_CanEquipMoreSkills::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterSkillGraphSystem_C_CanEquipMoreSkills, CallFunc_Less_IntInt_ReturnValue) == 0x00000C, "Member 'BP_CharacterSkillGraphSystem_C_CanEquipMoreSkills::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function BP_CharacterSkillGraphSystem.BP_CharacterSkillGraphSystem_C.CanLearnSkill
// 0x0088 (0x0088 - 0x0000)
struct BP_CharacterSkillGraphSystem_C_CanLearnSkill final
{
public:
	const class UBP_DataAsset_Skill_C*            Skill;                                             // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ELearnSkillBlockedReason                      BlockedReason;                                     // 0x0009(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasLearntDependencySkills_ReturnValue;    // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B[0x5];                                        // 0x000B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_DataAsset_SkillGraph_C*             CallFunc_GetSkillGraph_SkillGraph;                 // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FindSkillNode_Found;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFSkillGraphNode                       CallFunc_FindSkillNode_Node;                       // 0x0020(0x0038)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FindSkillNode_Index;                      // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAC_jRPG_InventoryManager_C*            CallFunc_GetInventoryManager_ReturnValue;          // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FindItemCountFromInventory_Quantity;      // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsNameValid_ReturnValue;                  // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x006D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6E[0x2];                                       // 0x006E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_DataAsset_SkillGraph_C*             CallFunc_GetSkillGraph_SkillGraph_1;               // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetSkillNodePointUnlockCost_UnlockCost;   // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetAvailableSkillPoints_ReturnValue;      // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CharacterSkillGraphSystem_C_CanLearnSkill) == 0x000008, "Wrong alignment on BP_CharacterSkillGraphSystem_C_CanLearnSkill");
static_assert(sizeof(BP_CharacterSkillGraphSystem_C_CanLearnSkill) == 0x000088, "Wrong size on BP_CharacterSkillGraphSystem_C_CanLearnSkill");
static_assert(offsetof(BP_CharacterSkillGraphSystem_C_CanLearnSkill, Skill) == 0x000000, "Member 'BP_CharacterSkillGraphSystem_C_CanLearnSkill::Skill' has a wrong offset!");
static_assert(offsetof(BP_CharacterSkillGraphSystem_C_CanLearnSkill, ReturnValue) == 0x000008, "Member 'BP_CharacterSkillGraphSystem_C_CanLearnSkill::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterSkillGraphSystem_C_CanLearnSkill, BlockedReason) == 0x000009, "Member 'BP_CharacterSkillGraphSystem_C_CanLearnSkill::BlockedReason' has a wrong offset!");
static_assert(offsetof(BP_CharacterSkillGraphSystem_C_CanLearnSkill, CallFunc_HasLearntDependencySkills_ReturnValue) == 0x00000A, "Member 'BP_CharacterSkillGraphSystem_C_CanLearnSkill::CallFunc_HasLearntDependencySkills_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterSkillGraphSystem_C_CanLearnSkill, CallFunc_GetSkillGraph_SkillGraph) == 0x000010, "Member 'BP_CharacterSkillGraphSystem_C_CanLearnSkill::CallFunc_GetSkillGraph_SkillGraph' has a wrong offset!");
static_assert(offsetof(BP_CharacterSkillGraphSystem_C_CanLearnSkill, CallFunc_Not_PreBool_ReturnValue) == 0x000018, "Member 'BP_CharacterSkillGraphSystem_C_CanLearnSkill::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterSkillGraphSystem_C_CanLearnSkill, CallFunc_FindSkillNode_Found) == 0x000019, "Member 'BP_CharacterSkillGraphSystem_C_CanLearnSkill::CallFunc_FindSkillNode_Found' has a wrong offset!");
static_assert(offsetof(BP_CharacterSkillGraphSystem_C_CanLearnSkill, CallFunc_FindSkillNode_Node) == 0x000020, "Member 'BP_CharacterSkillGraphSystem_C_CanLearnSkill::CallFunc_FindSkillNode_Node' has a wrong offset!");
static_assert(offsetof(BP_CharacterSkillGraphSystem_C_CanLearnSkill, CallFunc_FindSkillNode_Index) == 0x000058, "Member 'BP_CharacterSkillGraphSystem_C_CanLearnSkill::CallFunc_FindSkillNode_Index' has a wrong offset!");
static_assert(offsetof(BP_CharacterSkillGraphSystem_C_CanLearnSkill, CallFunc_GetInventoryManager_ReturnValue) == 0x000060, "Member 'BP_CharacterSkillGraphSystem_C_CanLearnSkill::CallFunc_GetInventoryManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterSkillGraphSystem_C_CanLearnSkill, CallFunc_FindItemCountFromInventory_Quantity) == 0x000068, "Member 'BP_CharacterSkillGraphSystem_C_CanLearnSkill::CallFunc_FindItemCountFromInventory_Quantity' has a wrong offset!");
static_assert(offsetof(BP_CharacterSkillGraphSystem_C_CanLearnSkill, CallFunc_IsNameValid_ReturnValue) == 0x00006C, "Member 'BP_CharacterSkillGraphSystem_C_CanLearnSkill::CallFunc_IsNameValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterSkillGraphSystem_C_CanLearnSkill, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00006D, "Member 'BP_CharacterSkillGraphSystem_C_CanLearnSkill::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterSkillGraphSystem_C_CanLearnSkill, CallFunc_GetSkillGraph_SkillGraph_1) == 0x000070, "Member 'BP_CharacterSkillGraphSystem_C_CanLearnSkill::CallFunc_GetSkillGraph_SkillGraph_1' has a wrong offset!");
static_assert(offsetof(BP_CharacterSkillGraphSystem_C_CanLearnSkill, CallFunc_Array_Contains_ReturnValue) == 0x000078, "Member 'BP_CharacterSkillGraphSystem_C_CanLearnSkill::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterSkillGraphSystem_C_CanLearnSkill, CallFunc_GetSkillNodePointUnlockCost_UnlockCost) == 0x00007C, "Member 'BP_CharacterSkillGraphSystem_C_CanLearnSkill::CallFunc_GetSkillNodePointUnlockCost_UnlockCost' has a wrong offset!");
static_assert(offsetof(BP_CharacterSkillGraphSystem_C_CanLearnSkill, CallFunc_GetAvailableSkillPoints_ReturnValue) == 0x000080, "Member 'BP_CharacterSkillGraphSystem_C_CanLearnSkill::CallFunc_GetAvailableSkillPoints_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterSkillGraphSystem_C_CanLearnSkill, CallFunc_Greater_IntInt_ReturnValue) == 0x000084, "Member 'BP_CharacterSkillGraphSystem_C_CanLearnSkill::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

// Function BP_CharacterSkillGraphSystem.BP_CharacterSkillGraphSystem_C.EquipSkill
// 0x0090 (0x0090 - 0x0000)
struct BP_CharacterSkillGraphSystem_C_EquipSkill final
{
public:
	class UBP_DataAsset_Skill_C*                  SkillID;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanEquipMoreSkills_ReturnValue;           // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_NameToText_ReturnValue;              // 0x0010(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0020(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0068(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0080(0x0010)()
};
static_assert(alignof(BP_CharacterSkillGraphSystem_C_EquipSkill) == 0x000008, "Wrong alignment on BP_CharacterSkillGraphSystem_C_EquipSkill");
static_assert(sizeof(BP_CharacterSkillGraphSystem_C_EquipSkill) == 0x000090, "Wrong size on BP_CharacterSkillGraphSystem_C_EquipSkill");
static_assert(offsetof(BP_CharacterSkillGraphSystem_C_EquipSkill, SkillID) == 0x000000, "Member 'BP_CharacterSkillGraphSystem_C_EquipSkill::SkillID' has a wrong offset!");
static_assert(offsetof(BP_CharacterSkillGraphSystem_C_EquipSkill, CallFunc_CanEquipMoreSkills_ReturnValue) == 0x000008, "Member 'BP_CharacterSkillGraphSystem_C_EquipSkill::CallFunc_CanEquipMoreSkills_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterSkillGraphSystem_C_EquipSkill, CallFunc_Conv_NameToText_ReturnValue) == 0x000010, "Member 'BP_CharacterSkillGraphSystem_C_EquipSkill::CallFunc_Conv_NameToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterSkillGraphSystem_C_EquipSkill, K2Node_MakeStruct_FormatArgumentData) == 0x000020, "Member 'BP_CharacterSkillGraphSystem_C_EquipSkill::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_CharacterSkillGraphSystem_C_EquipSkill, K2Node_MakeArray_Array) == 0x000068, "Member 'BP_CharacterSkillGraphSystem_C_EquipSkill::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_CharacterSkillGraphSystem_C_EquipSkill, CallFunc_Array_AddUnique_ReturnValue) == 0x000078, "Member 'BP_CharacterSkillGraphSystem_C_EquipSkill::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterSkillGraphSystem_C_EquipSkill, CallFunc_Format_ReturnValue) == 0x000080, "Member 'BP_CharacterSkillGraphSystem_C_EquipSkill::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function BP_CharacterSkillGraphSystem.BP_CharacterSkillGraphSystem_C.EquipSkillAtSlot
// 0x0020 (0x0020 - 0x0000)
struct BP_CharacterSkillGraphSystem_C_EquipSkillAtSlot final
{
public:
	const class UBP_DataAsset_Skill_C*            SkillDefinition;                                   // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	int32                                         Index_0;                                           // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         local_existingIndex;                               // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UBP_DataAsset_Skill_C*            Temp_object_Variable;                              // 0x0010(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CharacterSkillGraphSystem_C_EquipSkillAtSlot) == 0x000008, "Wrong alignment on BP_CharacterSkillGraphSystem_C_EquipSkillAtSlot");
static_assert(sizeof(BP_CharacterSkillGraphSystem_C_EquipSkillAtSlot) == 0x000020, "Wrong size on BP_CharacterSkillGraphSystem_C_EquipSkillAtSlot");
static_assert(offsetof(BP_CharacterSkillGraphSystem_C_EquipSkillAtSlot, SkillDefinition) == 0x000000, "Member 'BP_CharacterSkillGraphSystem_C_EquipSkillAtSlot::SkillDefinition' has a wrong offset!");
static_assert(offsetof(BP_CharacterSkillGraphSystem_C_EquipSkillAtSlot, Index_0) == 0x000008, "Member 'BP_CharacterSkillGraphSystem_C_EquipSkillAtSlot::Index_0' has a wrong offset!");
static_assert(offsetof(BP_CharacterSkillGraphSystem_C_EquipSkillAtSlot, local_existingIndex) == 0x00000C, "Member 'BP_CharacterSkillGraphSystem_C_EquipSkillAtSlot::local_existingIndex' has a wrong offset!");
static_assert(offsetof(BP_CharacterSkillGraphSystem_C_EquipSkillAtSlot, Temp_object_Variable) == 0x000010, "Member 'BP_CharacterSkillGraphSystem_C_EquipSkillAtSlot::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_CharacterSkillGraphSystem_C_EquipSkillAtSlot, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000018, "Member 'BP_CharacterSkillGraphSystem_C_EquipSkillAtSlot::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterSkillGraphSystem_C_EquipSkillAtSlot, CallFunc_Array_Find_ReturnValue) == 0x00001C, "Member 'BP_CharacterSkillGraphSystem_C_EquipSkillAtSlot::CallFunc_Array_Find_ReturnValue' has a wrong offset!");

// Function BP_CharacterSkillGraphSystem.BP_CharacterSkillGraphSystem_C.GetAllAvailableEquippedSkills
// 0x0030 (0x0030 - 0x0000)
struct BP_CharacterSkillGraphSystem_C_GetAllAvailableEquippedSkills final
{
public:
	TArray<class UBP_DataAsset_Skill_C*>          ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm)
	TArray<class UBP_DataAsset_Skill_C*>          Temp_wildcard_Variable;                            // 0x0010(0x0010)(ReferenceParm)
	TArray<class UBP_DataAsset_Skill_C*>          CallFunc_GetAvailableGradientAttacks_ReturnValue;  // 0x0020(0x0010)(ReferenceParm)
};
static_assert(alignof(BP_CharacterSkillGraphSystem_C_GetAllAvailableEquippedSkills) == 0x000008, "Wrong alignment on BP_CharacterSkillGraphSystem_C_GetAllAvailableEquippedSkills");
static_assert(sizeof(BP_CharacterSkillGraphSystem_C_GetAllAvailableEquippedSkills) == 0x000030, "Wrong size on BP_CharacterSkillGraphSystem_C_GetAllAvailableEquippedSkills");
static_assert(offsetof(BP_CharacterSkillGraphSystem_C_GetAllAvailableEquippedSkills, ReturnValue) == 0x000000, "Member 'BP_CharacterSkillGraphSystem_C_GetAllAvailableEquippedSkills::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterSkillGraphSystem_C_GetAllAvailableEquippedSkills, Temp_wildcard_Variable) == 0x000010, "Member 'BP_CharacterSkillGraphSystem_C_GetAllAvailableEquippedSkills::Temp_wildcard_Variable' has a wrong offset!");
static_assert(offsetof(BP_CharacterSkillGraphSystem_C_GetAllAvailableEquippedSkills, CallFunc_GetAvailableGradientAttacks_ReturnValue) == 0x000020, "Member 'BP_CharacterSkillGraphSystem_C_GetAllAvailableEquippedSkills::CallFunc_GetAvailableGradientAttacks_ReturnValue' has a wrong offset!");

// Function BP_CharacterSkillGraphSystem.BP_CharacterSkillGraphSystem_C.GetAvailableGradientAttacks
// 0x0060 (0x0060 - 0x0000)
struct BP_CharacterSkillGraphSystem_C_GetAvailableGradientAttacks final
{
public:
	TArray<class UBP_DataAsset_Skill_C*>          ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm)
	TArray<class UBP_DataAsset_Skill_C*>          Temp_wildcard_We_need_a_second_array_to_store_the_result_and_be_able_to_wipe_the_first__buffer__array_Variable; // 0x0010(0x0010)(ConstParm, ReferenceParm)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UBP_DataAsset_Skill_C*>          Temp_wildcard_Temp_buffer_array_Variable;          // 0x0030(0x0010)(ConstParm, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_DataAsset_Skill_C*                  CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CharacterSkillGraphSystem_C_GetAvailableGradientAttacks) == 0x000008, "Wrong alignment on BP_CharacterSkillGraphSystem_C_GetAvailableGradientAttacks");
static_assert(sizeof(BP_CharacterSkillGraphSystem_C_GetAvailableGradientAttacks) == 0x000060, "Wrong size on BP_CharacterSkillGraphSystem_C_GetAvailableGradientAttacks");
static_assert(offsetof(BP_CharacterSkillGraphSystem_C_GetAvailableGradientAttacks, ReturnValue) == 0x000000, "Member 'BP_CharacterSkillGraphSystem_C_GetAvailableGradientAttacks::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterSkillGraphSystem_C_GetAvailableGradientAttacks, Temp_wildcard_We_need_a_second_array_to_store_the_result_and_be_able_to_wipe_the_first__buffer__array_Variable) == 0x000010, "Member 'BP_CharacterSkillGraphSystem_C_GetAvailableGradientAttacks::Temp_wildcard_We_need_a_second_array_to_store_the_result_and_be_able_to_wipe_the_first__buffer__array_Variable' has a wrong offset!");
static_assert(offsetof(BP_CharacterSkillGraphSystem_C_GetAvailableGradientAttacks, Temp_int_Loop_Counter_Variable) == 0x000020, "Member 'BP_CharacterSkillGraphSystem_C_GetAvailableGradientAttacks::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_CharacterSkillGraphSystem_C_GetAvailableGradientAttacks, CallFunc_Add_IntInt_ReturnValue) == 0x000024, "Member 'BP_CharacterSkillGraphSystem_C_GetAvailableGradientAttacks::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterSkillGraphSystem_C_GetAvailableGradientAttacks, Temp_int_Array_Index_Variable) == 0x000028, "Member 'BP_CharacterSkillGraphSystem_C_GetAvailableGradientAttacks::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_CharacterSkillGraphSystem_C_GetAvailableGradientAttacks, Temp_wildcard_Temp_buffer_array_Variable) == 0x000030, "Member 'BP_CharacterSkillGraphSystem_C_GetAvailableGradientAttacks::Temp_wildcard_Temp_buffer_array_Variable' has a wrong offset!");
static_assert(offsetof(BP_CharacterSkillGraphSystem_C_GetAvailableGradientAttacks, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'BP_CharacterSkillGraphSystem_C_GetAvailableGradientAttacks::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterSkillGraphSystem_C_GetAvailableGradientAttacks, CallFunc_Array_Get_Item) == 0x000048, "Member 'BP_CharacterSkillGraphSystem_C_GetAvailableGradientAttacks::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_CharacterSkillGraphSystem_C_GetAvailableGradientAttacks, CallFunc_Less_IntInt_ReturnValue) == 0x000050, "Member 'BP_CharacterSkillGraphSystem_C_GetAvailableGradientAttacks::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterSkillGraphSystem_C_GetAvailableGradientAttacks, CallFunc_Array_Add_ReturnValue) == 0x000054, "Member 'BP_CharacterSkillGraphSystem_C_GetAvailableGradientAttacks::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterSkillGraphSystem_C_GetAvailableGradientAttacks, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000058, "Member 'BP_CharacterSkillGraphSystem_C_GetAvailableGradientAttacks::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function BP_CharacterSkillGraphSystem.BP_CharacterSkillGraphSystem_C.GetAvailableSkillPoints
// 0x0010 (0x0010 - 0x0000)
struct BP_CharacterSkillGraphSystem_C_GetAvailableSkillPoints final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPackagedForDistribution_ReturnValue;    // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetConsoleVariableBoolValue_ReturnValue;  // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetTotalSkillPoints_ReturnValue;          // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CharacterSkillGraphSystem_C_GetAvailableSkillPoints) == 0x000004, "Wrong alignment on BP_CharacterSkillGraphSystem_C_GetAvailableSkillPoints");
static_assert(sizeof(BP_CharacterSkillGraphSystem_C_GetAvailableSkillPoints) == 0x000010, "Wrong size on BP_CharacterSkillGraphSystem_C_GetAvailableSkillPoints");
static_assert(offsetof(BP_CharacterSkillGraphSystem_C_GetAvailableSkillPoints, ReturnValue) == 0x000000, "Member 'BP_CharacterSkillGraphSystem_C_GetAvailableSkillPoints::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterSkillGraphSystem_C_GetAvailableSkillPoints, CallFunc_IsPackagedForDistribution_ReturnValue) == 0x000004, "Member 'BP_CharacterSkillGraphSystem_C_GetAvailableSkillPoints::CallFunc_IsPackagedForDistribution_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterSkillGraphSystem_C_GetAvailableSkillPoints, CallFunc_GetConsoleVariableBoolValue_ReturnValue) == 0x000005, "Member 'BP_CharacterSkillGraphSystem_C_GetAvailableSkillPoints::CallFunc_GetConsoleVariableBoolValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterSkillGraphSystem_C_GetAvailableSkillPoints, CallFunc_GetTotalSkillPoints_ReturnValue) == 0x000008, "Member 'BP_CharacterSkillGraphSystem_C_GetAvailableSkillPoints::CallFunc_GetTotalSkillPoints_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterSkillGraphSystem_C_GetAvailableSkillPoints, CallFunc_Subtract_IntInt_ReturnValue) == 0x00000C, "Member 'BP_CharacterSkillGraphSystem_C_GetAvailableSkillPoints::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");

// Function BP_CharacterSkillGraphSystem.BP_CharacterSkillGraphSystem_C.GetEquippedSkills
// 0x0010 (0x0010 - 0x0000)
struct BP_CharacterSkillGraphSystem_C_GetEquippedSkills final
{
public:
	TArray<class UBP_DataAsset_Skill_C*>          EquippedSkills_0;                                  // 0x0000(0x0010)(Parm, OutParm)
};
static_assert(alignof(BP_CharacterSkillGraphSystem_C_GetEquippedSkills) == 0x000008, "Wrong alignment on BP_CharacterSkillGraphSystem_C_GetEquippedSkills");
static_assert(sizeof(BP_CharacterSkillGraphSystem_C_GetEquippedSkills) == 0x000010, "Wrong size on BP_CharacterSkillGraphSystem_C_GetEquippedSkills");
static_assert(offsetof(BP_CharacterSkillGraphSystem_C_GetEquippedSkills, EquippedSkills_0) == 0x000000, "Member 'BP_CharacterSkillGraphSystem_C_GetEquippedSkills::EquippedSkills_0' has a wrong offset!");

// Function BP_CharacterSkillGraphSystem.BP_CharacterSkillGraphSystem_C.GetEquippedSkillsSaveData
// 0x0060 (0x0060 - 0x0000)
struct BP_CharacterSkillGraphSystem_C_GetEquippedSkillsSaveData final
{
public:
	TArray<class FName>                           EquippedSkillIDs;                                  // 0x0000(0x0010)(Parm, OutParm)
	class FName                                   Temp_wildcard_Variable;                            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           Temp_wildcard_We_need_a_second_array_to_store_the_result_and_be_able_to_wipe_the_first__buffer__array_Variable; // 0x0028(0x0010)(ConstParm, ReferenceParm)
	TArray<class FName>                           Temp_wildcard_Temp_buffer_array_Variable;          // 0x0038(0x0010)(ConstParm, ReferenceParm)
	class UBP_DataAsset_Skill_C*                  CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0055(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_56[0x2];                                       // 0x0056(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CharacterSkillGraphSystem_C_GetEquippedSkillsSaveData) == 0x000008, "Wrong alignment on BP_CharacterSkillGraphSystem_C_GetEquippedSkillsSaveData");
static_assert(sizeof(BP_CharacterSkillGraphSystem_C_GetEquippedSkillsSaveData) == 0x000060, "Wrong size on BP_CharacterSkillGraphSystem_C_GetEquippedSkillsSaveData");
static_assert(offsetof(BP_CharacterSkillGraphSystem_C_GetEquippedSkillsSaveData, EquippedSkillIDs) == 0x000000, "Member 'BP_CharacterSkillGraphSystem_C_GetEquippedSkillsSaveData::EquippedSkillIDs' has a wrong offset!");
static_assert(offsetof(BP_CharacterSkillGraphSystem_C_GetEquippedSkillsSaveData, Temp_wildcard_Variable) == 0x000010, "Member 'BP_CharacterSkillGraphSystem_C_GetEquippedSkillsSaveData::Temp_wildcard_Variable' has a wrong offset!");
static_assert(offsetof(BP_CharacterSkillGraphSystem_C_GetEquippedSkillsSaveData, Temp_int_Loop_Counter_Variable) == 0x000018, "Member 'BP_CharacterSkillGraphSystem_C_GetEquippedSkillsSaveData::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_CharacterSkillGraphSystem_C_GetEquippedSkillsSaveData, CallFunc_Add_IntInt_ReturnValue) == 0x00001C, "Member 'BP_CharacterSkillGraphSystem_C_GetEquippedSkillsSaveData::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterSkillGraphSystem_C_GetEquippedSkillsSaveData, Temp_int_Array_Index_Variable) == 0x000020, "Member 'BP_CharacterSkillGraphSystem_C_GetEquippedSkillsSaveData::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_CharacterSkillGraphSystem_C_GetEquippedSkillsSaveData, Temp_wildcard_We_need_a_second_array_to_store_the_result_and_be_able_to_wipe_the_first__buffer__array_Variable) == 0x000028, "Member 'BP_CharacterSkillGraphSystem_C_GetEquippedSkillsSaveData::Temp_wildcard_We_need_a_second_array_to_store_the_result_and_be_able_to_wipe_the_first__buffer__array_Variable' has a wrong offset!");
static_assert(offsetof(BP_CharacterSkillGraphSystem_C_GetEquippedSkillsSaveData, Temp_wildcard_Temp_buffer_array_Variable) == 0x000038, "Member 'BP_CharacterSkillGraphSystem_C_GetEquippedSkillsSaveData::Temp_wildcard_Temp_buffer_array_Variable' has a wrong offset!");
static_assert(offsetof(BP_CharacterSkillGraphSystem_C_GetEquippedSkillsSaveData, CallFunc_Array_Get_Item) == 0x000048, "Member 'BP_CharacterSkillGraphSystem_C_GetEquippedSkillsSaveData::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_CharacterSkillGraphSystem_C_GetEquippedSkillsSaveData, CallFunc_Array_Length_ReturnValue) == 0x000050, "Member 'BP_CharacterSkillGraphSystem_C_GetEquippedSkillsSaveData::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterSkillGraphSystem_C_GetEquippedSkillsSaveData, CallFunc_Less_IntInt_ReturnValue) == 0x000054, "Member 'BP_CharacterSkillGraphSystem_C_GetEquippedSkillsSaveData::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterSkillGraphSystem_C_GetEquippedSkillsSaveData, CallFunc_IsValid_ReturnValue) == 0x000055, "Member 'BP_CharacterSkillGraphSystem_C_GetEquippedSkillsSaveData::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterSkillGraphSystem_C_GetEquippedSkillsSaveData, CallFunc_Array_Add_ReturnValue) == 0x000058, "Member 'BP_CharacterSkillGraphSystem_C_GetEquippedSkillsSaveData::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function BP_CharacterSkillGraphSystem.BP_CharacterSkillGraphSystem_C.GetFirstEmptySlotIndex
// 0x0030 (0x0030 - 0x0000)
struct BP_CharacterSkillGraphSystem_C_GetFirstEmptySlotIndex final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetMaxSkillsCount_ReturnValue;            // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_DataAsset_Skill_C*                  CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CharacterSkillGraphSystem_C_GetFirstEmptySlotIndex) == 0x000008, "Wrong alignment on BP_CharacterSkillGraphSystem_C_GetFirstEmptySlotIndex");
static_assert(sizeof(BP_CharacterSkillGraphSystem_C_GetFirstEmptySlotIndex) == 0x000030, "Wrong size on BP_CharacterSkillGraphSystem_C_GetFirstEmptySlotIndex");
static_assert(offsetof(BP_CharacterSkillGraphSystem_C_GetFirstEmptySlotIndex, Index_0) == 0x000000, "Member 'BP_CharacterSkillGraphSystem_C_GetFirstEmptySlotIndex::Index_0' has a wrong offset!");
static_assert(offsetof(BP_CharacterSkillGraphSystem_C_GetFirstEmptySlotIndex, Temp_int_Variable) == 0x000004, "Member 'BP_CharacterSkillGraphSystem_C_GetFirstEmptySlotIndex::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_CharacterSkillGraphSystem_C_GetFirstEmptySlotIndex, CallFunc_GetMaxSkillsCount_ReturnValue) == 0x000008, "Member 'BP_CharacterSkillGraphSystem_C_GetFirstEmptySlotIndex::CallFunc_GetMaxSkillsCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterSkillGraphSystem_C_GetFirstEmptySlotIndex, CallFunc_Subtract_IntInt_ReturnValue) == 0x00000C, "Member 'BP_CharacterSkillGraphSystem_C_GetFirstEmptySlotIndex::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterSkillGraphSystem_C_GetFirstEmptySlotIndex, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000010, "Member 'BP_CharacterSkillGraphSystem_C_GetFirstEmptySlotIndex::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterSkillGraphSystem_C_GetFirstEmptySlotIndex, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'BP_CharacterSkillGraphSystem_C_GetFirstEmptySlotIndex::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterSkillGraphSystem_C_GetFirstEmptySlotIndex, CallFunc_Array_LastIndex_ReturnValue) == 0x000018, "Member 'BP_CharacterSkillGraphSystem_C_GetFirstEmptySlotIndex::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterSkillGraphSystem_C_GetFirstEmptySlotIndex, CallFunc_Array_Get_Item) == 0x000020, "Member 'BP_CharacterSkillGraphSystem_C_GetFirstEmptySlotIndex::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_CharacterSkillGraphSystem_C_GetFirstEmptySlotIndex, CallFunc_Greater_IntInt_ReturnValue) == 0x000028, "Member 'BP_CharacterSkillGraphSystem_C_GetFirstEmptySlotIndex::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterSkillGraphSystem_C_GetFirstEmptySlotIndex, CallFunc_IsValid_ReturnValue) == 0x000029, "Member 'BP_CharacterSkillGraphSystem_C_GetFirstEmptySlotIndex::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_CharacterSkillGraphSystem.BP_CharacterSkillGraphSystem_C.GetSkillGraph
// 0x0010 (0x0010 - 0x0000)
struct BP_CharacterSkillGraphSystem_C_GetSkillGraph final
{
public:
	class UBP_DataAsset_SkillGraph_C*             SkillGraph;                                        // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_DataAsset_SkillGraph_C*             CallFunc_GetSkillGraph_SkillGraph;                 // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CharacterSkillGraphSystem_C_GetSkillGraph) == 0x000008, "Wrong alignment on BP_CharacterSkillGraphSystem_C_GetSkillGraph");
static_assert(sizeof(BP_CharacterSkillGraphSystem_C_GetSkillGraph) == 0x000010, "Wrong size on BP_CharacterSkillGraphSystem_C_GetSkillGraph");
static_assert(offsetof(BP_CharacterSkillGraphSystem_C_GetSkillGraph, SkillGraph) == 0x000000, "Member 'BP_CharacterSkillGraphSystem_C_GetSkillGraph::SkillGraph' has a wrong offset!");
static_assert(offsetof(BP_CharacterSkillGraphSystem_C_GetSkillGraph, CallFunc_GetSkillGraph_SkillGraph) == 0x000008, "Member 'BP_CharacterSkillGraphSystem_C_GetSkillGraph::CallFunc_GetSkillGraph_SkillGraph' has a wrong offset!");

// Function BP_CharacterSkillGraphSystem.BP_CharacterSkillGraphSystem_C.GetSkillState
// 0x0030 (0x0030 - 0x0000)
struct BP_CharacterSkillGraphSystem_C_GetSkillState final
{
public:
	class UBP_DataAsset_Skill_C*                  Skill;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESkillNodeState                               NodeState;                                         // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         local_unlockCost;                                  // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasLearntDependencySkills_ReturnValue;    // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSkillUnlocked_ReturnValue;              // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_DataAsset_SkillGraph_C*             CallFunc_GetSkillGraph_SkillGraph;                 // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSkillPointUnlockCost_UnlockCost;       // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetAvailableSkillPoints_ReturnValue;      // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CharacterSkillGraphSystem_C_GetSkillState) == 0x000008, "Wrong alignment on BP_CharacterSkillGraphSystem_C_GetSkillState");
static_assert(sizeof(BP_CharacterSkillGraphSystem_C_GetSkillState) == 0x000030, "Wrong size on BP_CharacterSkillGraphSystem_C_GetSkillState");
static_assert(offsetof(BP_CharacterSkillGraphSystem_C_GetSkillState, Skill) == 0x000000, "Member 'BP_CharacterSkillGraphSystem_C_GetSkillState::Skill' has a wrong offset!");
static_assert(offsetof(BP_CharacterSkillGraphSystem_C_GetSkillState, NodeState) == 0x000008, "Member 'BP_CharacterSkillGraphSystem_C_GetSkillState::NodeState' has a wrong offset!");
static_assert(offsetof(BP_CharacterSkillGraphSystem_C_GetSkillState, local_unlockCost) == 0x00000C, "Member 'BP_CharacterSkillGraphSystem_C_GetSkillState::local_unlockCost' has a wrong offset!");
static_assert(offsetof(BP_CharacterSkillGraphSystem_C_GetSkillState, CallFunc_HasLearntDependencySkills_ReturnValue) == 0x000010, "Member 'BP_CharacterSkillGraphSystem_C_GetSkillState::CallFunc_HasLearntDependencySkills_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterSkillGraphSystem_C_GetSkillState, CallFunc_IsSkillUnlocked_ReturnValue) == 0x000011, "Member 'BP_CharacterSkillGraphSystem_C_GetSkillState::CallFunc_IsSkillUnlocked_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterSkillGraphSystem_C_GetSkillState, CallFunc_GetSkillGraph_SkillGraph) == 0x000018, "Member 'BP_CharacterSkillGraphSystem_C_GetSkillState::CallFunc_GetSkillGraph_SkillGraph' has a wrong offset!");
static_assert(offsetof(BP_CharacterSkillGraphSystem_C_GetSkillState, CallFunc_GetSkillPointUnlockCost_UnlockCost) == 0x000020, "Member 'BP_CharacterSkillGraphSystem_C_GetSkillState::CallFunc_GetSkillPointUnlockCost_UnlockCost' has a wrong offset!");
static_assert(offsetof(BP_CharacterSkillGraphSystem_C_GetSkillState, CallFunc_GetAvailableSkillPoints_ReturnValue) == 0x000024, "Member 'BP_CharacterSkillGraphSystem_C_GetSkillState::CallFunc_GetAvailableSkillPoints_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterSkillGraphSystem_C_GetSkillState, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000028, "Member 'BP_CharacterSkillGraphSystem_C_GetSkillState::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");

// Function BP_CharacterSkillGraphSystem.BP_CharacterSkillGraphSystem_C.GetTotalSkillPoints
// 0x0008 (0x0008 - 0x0000)
struct BP_CharacterSkillGraphSystem_C_GetTotalSkillPoints final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CharacterSkillGraphSystem_C_GetTotalSkillPoints) == 0x000004, "Wrong alignment on BP_CharacterSkillGraphSystem_C_GetTotalSkillPoints");
static_assert(sizeof(BP_CharacterSkillGraphSystem_C_GetTotalSkillPoints) == 0x000008, "Wrong size on BP_CharacterSkillGraphSystem_C_GetTotalSkillPoints");
static_assert(offsetof(BP_CharacterSkillGraphSystem_C_GetTotalSkillPoints, ReturnValue) == 0x000000, "Member 'BP_CharacterSkillGraphSystem_C_GetTotalSkillPoints::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterSkillGraphSystem_C_GetTotalSkillPoints, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'BP_CharacterSkillGraphSystem_C_GetTotalSkillPoints::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function BP_CharacterSkillGraphSystem.BP_CharacterSkillGraphSystem_C.GetUnlockedSkills
// 0x0010 (0x0010 - 0x0000)
struct BP_CharacterSkillGraphSystem_C_GetUnlockedSkills final
{
public:
	TArray<class UBP_DataAsset_Skill_C*>          ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm)
};
static_assert(alignof(BP_CharacterSkillGraphSystem_C_GetUnlockedSkills) == 0x000008, "Wrong alignment on BP_CharacterSkillGraphSystem_C_GetUnlockedSkills");
static_assert(sizeof(BP_CharacterSkillGraphSystem_C_GetUnlockedSkills) == 0x000010, "Wrong size on BP_CharacterSkillGraphSystem_C_GetUnlockedSkills");
static_assert(offsetof(BP_CharacterSkillGraphSystem_C_GetUnlockedSkills, ReturnValue) == 0x000000, "Member 'BP_CharacterSkillGraphSystem_C_GetUnlockedSkills::ReturnValue' has a wrong offset!");

// Function BP_CharacterSkillGraphSystem.BP_CharacterSkillGraphSystem_C.GetUnlockedSkillSaveData
// 0x0058 (0x0058 - 0x0000)
struct BP_CharacterSkillGraphSystem_C_GetUnlockedSkillSaveData final
{
public:
	TArray<class FName>                           UnlockedSkillIDs;                                  // 0x0000(0x0010)(Parm, OutParm)
	TArray<class FName>                           Temp_wildcard_We_need_a_second_array_to_store_the_result_and_be_able_to_wipe_the_first__buffer__array_Variable; // 0x0010(0x0010)(ConstParm, ReferenceParm)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           Temp_wildcard_Temp_buffer_array_Variable;          // 0x0030(0x0010)(ConstParm, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_DataAsset_Skill_C*                  CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CharacterSkillGraphSystem_C_GetUnlockedSkillSaveData) == 0x000008, "Wrong alignment on BP_CharacterSkillGraphSystem_C_GetUnlockedSkillSaveData");
static_assert(sizeof(BP_CharacterSkillGraphSystem_C_GetUnlockedSkillSaveData) == 0x000058, "Wrong size on BP_CharacterSkillGraphSystem_C_GetUnlockedSkillSaveData");
static_assert(offsetof(BP_CharacterSkillGraphSystem_C_GetUnlockedSkillSaveData, UnlockedSkillIDs) == 0x000000, "Member 'BP_CharacterSkillGraphSystem_C_GetUnlockedSkillSaveData::UnlockedSkillIDs' has a wrong offset!");
static_assert(offsetof(BP_CharacterSkillGraphSystem_C_GetUnlockedSkillSaveData, Temp_wildcard_We_need_a_second_array_to_store_the_result_and_be_able_to_wipe_the_first__buffer__array_Variable) == 0x000010, "Member 'BP_CharacterSkillGraphSystem_C_GetUnlockedSkillSaveData::Temp_wildcard_We_need_a_second_array_to_store_the_result_and_be_able_to_wipe_the_first__buffer__array_Variable' has a wrong offset!");
static_assert(offsetof(BP_CharacterSkillGraphSystem_C_GetUnlockedSkillSaveData, Temp_int_Loop_Counter_Variable) == 0x000020, "Member 'BP_CharacterSkillGraphSystem_C_GetUnlockedSkillSaveData::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_CharacterSkillGraphSystem_C_GetUnlockedSkillSaveData, CallFunc_Add_IntInt_ReturnValue) == 0x000024, "Member 'BP_CharacterSkillGraphSystem_C_GetUnlockedSkillSaveData::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterSkillGraphSystem_C_GetUnlockedSkillSaveData, Temp_int_Array_Index_Variable) == 0x000028, "Member 'BP_CharacterSkillGraphSystem_C_GetUnlockedSkillSaveData::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_CharacterSkillGraphSystem_C_GetUnlockedSkillSaveData, Temp_wildcard_Temp_buffer_array_Variable) == 0x000030, "Member 'BP_CharacterSkillGraphSystem_C_GetUnlockedSkillSaveData::Temp_wildcard_Temp_buffer_array_Variable' has a wrong offset!");
static_assert(offsetof(BP_CharacterSkillGraphSystem_C_GetUnlockedSkillSaveData, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'BP_CharacterSkillGraphSystem_C_GetUnlockedSkillSaveData::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterSkillGraphSystem_C_GetUnlockedSkillSaveData, CallFunc_Array_Get_Item) == 0x000048, "Member 'BP_CharacterSkillGraphSystem_C_GetUnlockedSkillSaveData::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_CharacterSkillGraphSystem_C_GetUnlockedSkillSaveData, CallFunc_Less_IntInt_ReturnValue) == 0x000050, "Member 'BP_CharacterSkillGraphSystem_C_GetUnlockedSkillSaveData::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterSkillGraphSystem_C_GetUnlockedSkillSaveData, CallFunc_Array_Add_ReturnValue) == 0x000054, "Member 'BP_CharacterSkillGraphSystem_C_GetUnlockedSkillSaveData::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function BP_CharacterSkillGraphSystem.BP_CharacterSkillGraphSystem_C.HasLearnableSkills
// 0x0060 (0x0060 - 0x0000)
struct BP_CharacterSkillGraphSystem_C_HasLearnableSkills final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_DataAsset_SkillGraph_C*             CallFunc_GetSkillGraph_SkillGraph;                 // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFSkillGraphNode                       CallFunc_Array_Get_Item;                           // 0x0020(0x0038)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanLearnSkill_ReturnValue;                // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ELearnSkillBlockedReason                      CallFunc_CanLearnSkill_BlockedReason;              // 0x005B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
