#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CineCharacter_Main

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_CineCharacter_Main.BP_CineCharacter_Main_C.AttachWeaponToHands
// 0x0480 (0x0480 - 0x0000)
struct BP_CineCharacter_Main_C_AttachWeaponToHands final
{
public:
	class ABP_WeaponSkin_C*                       Weapons_0;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location_1;                // 0x0050(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation_1;                // 0x0068(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale_1;                   // 0x0080(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_AddRelativeRotation_SweepHitResult;    // 0x0098(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_AddRelativeRotation_SweepHitResult_1;  // 0x0190(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_AddRelativeLocation_SweepHitResult;    // 0x0288(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_AddRelativeLocation_SweepHitResult_1;  // 0x0380(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0478(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue_1;       // 0x0479(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CineCharacter_Main_C_AttachWeaponToHands) == 0x000008, "Wrong alignment on BP_CineCharacter_Main_C_AttachWeaponToHands");
static_assert(sizeof(BP_CineCharacter_Main_C_AttachWeaponToHands) == 0x000480, "Wrong size on BP_CineCharacter_Main_C_AttachWeaponToHands");
static_assert(offsetof(BP_CineCharacter_Main_C_AttachWeaponToHands, Weapons_0) == 0x000000, "Member 'BP_CineCharacter_Main_C_AttachWeaponToHands::Weapons_0' has a wrong offset!");
static_assert(offsetof(BP_CineCharacter_Main_C_AttachWeaponToHands, CallFunc_BreakTransform_Location) == 0x000008, "Member 'BP_CineCharacter_Main_C_AttachWeaponToHands::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(BP_CineCharacter_Main_C_AttachWeaponToHands, CallFunc_BreakTransform_Rotation) == 0x000020, "Member 'BP_CineCharacter_Main_C_AttachWeaponToHands::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(BP_CineCharacter_Main_C_AttachWeaponToHands, CallFunc_BreakTransform_Scale) == 0x000038, "Member 'BP_CineCharacter_Main_C_AttachWeaponToHands::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(BP_CineCharacter_Main_C_AttachWeaponToHands, CallFunc_BreakTransform_Location_1) == 0x000050, "Member 'BP_CineCharacter_Main_C_AttachWeaponToHands::CallFunc_BreakTransform_Location_1' has a wrong offset!");
static_assert(offsetof(BP_CineCharacter_Main_C_AttachWeaponToHands, CallFunc_BreakTransform_Rotation_1) == 0x000068, "Member 'BP_CineCharacter_Main_C_AttachWeaponToHands::CallFunc_BreakTransform_Rotation_1' has a wrong offset!");
static_assert(offsetof(BP_CineCharacter_Main_C_AttachWeaponToHands, CallFunc_BreakTransform_Scale_1) == 0x000080, "Member 'BP_CineCharacter_Main_C_AttachWeaponToHands::CallFunc_BreakTransform_Scale_1' has a wrong offset!");
static_assert(offsetof(BP_CineCharacter_Main_C_AttachWeaponToHands, CallFunc_K2_AddRelativeRotation_SweepHitResult) == 0x000098, "Member 'BP_CineCharacter_Main_C_AttachWeaponToHands::CallFunc_K2_AddRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_CineCharacter_Main_C_AttachWeaponToHands, CallFunc_K2_AddRelativeRotation_SweepHitResult_1) == 0x000190, "Member 'BP_CineCharacter_Main_C_AttachWeaponToHands::CallFunc_K2_AddRelativeRotation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(BP_CineCharacter_Main_C_AttachWeaponToHands, CallFunc_K2_AddRelativeLocation_SweepHitResult) == 0x000288, "Member 'BP_CineCharacter_Main_C_AttachWeaponToHands::CallFunc_K2_AddRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_CineCharacter_Main_C_AttachWeaponToHands, CallFunc_K2_AddRelativeLocation_SweepHitResult_1) == 0x000380, "Member 'BP_CineCharacter_Main_C_AttachWeaponToHands::CallFunc_K2_AddRelativeLocation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(BP_CineCharacter_Main_C_AttachWeaponToHands, CallFunc_K2_AttachToComponent_ReturnValue) == 0x000478, "Member 'BP_CineCharacter_Main_C_AttachWeaponToHands::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CineCharacter_Main_C_AttachWeaponToHands, CallFunc_K2_AttachToComponent_ReturnValue_1) == 0x000479, "Member 'BP_CineCharacter_Main_C_AttachWeaponToHands::CallFunc_K2_AttachToComponent_ReturnValue_1' has a wrong offset!");

// Function BP_CineCharacter_Main.BP_CineCharacter_Main_C.BndEvt__BP_CineCharacter_Main_BP_CinematicCharacterSkinComponent_K2Node_ComponentBoundEvent_1_OnCharacterCustomizationChanged__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_CineCharacter_Main_C_BndEvt__BP_CineCharacter_Main_BP_CinematicCharacterSkinComponent_K2Node_ComponentBoundEvent_1_OnCharacterCustomizationChanged__DelegateSignature final
{
public:
	class UBP_CharacterSkinComponent_C*           SkinComponent;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CineCharacter_Main_C_BndEvt__BP_CineCharacter_Main_BP_CinematicCharacterSkinComponent_K2Node_ComponentBoundEvent_1_OnCharacterCustomizationChanged__DelegateSignature) == 0x000008, "Wrong alignment on BP_CineCharacter_Main_C_BndEvt__BP_CineCharacter_Main_BP_CinematicCharacterSkinComponent_K2Node_ComponentBoundEvent_1_OnCharacterCustomizationChanged__DelegateSignature");
static_assert(sizeof(BP_CineCharacter_Main_C_BndEvt__BP_CineCharacter_Main_BP_CinematicCharacterSkinComponent_K2Node_ComponentBoundEvent_1_OnCharacterCustomizationChanged__DelegateSignature) == 0x000008, "Wrong size on BP_CineCharacter_Main_C_BndEvt__BP_CineCharacter_Main_BP_CinematicCharacterSkinComponent_K2Node_ComponentBoundEvent_1_OnCharacterCustomizationChanged__DelegateSignature");
static_assert(offsetof(BP_CineCharacter_Main_C_BndEvt__BP_CineCharacter_Main_BP_CinematicCharacterSkinComponent_K2Node_ComponentBoundEvent_1_OnCharacterCustomizationChanged__DelegateSignature, SkinComponent) == 0x000000, "Member 'BP_CineCharacter_Main_C_BndEvt__BP_CineCharacter_Main_BP_CinematicCharacterSkinComponent_K2Node_ComponentBoundEvent_1_OnCharacterCustomizationChanged__DelegateSignature::SkinComponent' has a wrong offset!");

// Function BP_CineCharacter_Main.BP_CineCharacter_Main_C.BndEvt__BP_CineCharacter_Main_LiveLinkComponentController_K2Node_ComponentBoundEvent_0_LiveLinkTickDelegate__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct BP_CineCharacter_Main_C_BndEvt__BP_CineCharacter_Main_LiveLinkComponentController_K2Node_ComponentBoundEvent_0_LiveLinkTickDelegate__DelegateSignature final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CineCharacter_Main_C_BndEvt__BP_CineCharacter_Main_LiveLinkComponentController_K2Node_ComponentBoundEvent_0_LiveLinkTickDelegate__DelegateSignature) == 0x000004, "Wrong alignment on BP_CineCharacter_Main_C_BndEvt__BP_CineCharacter_Main_LiveLinkComponentController_K2Node_ComponentBoundEvent_0_LiveLinkTickDelegate__DelegateSignature");
static_assert(sizeof(BP_CineCharacter_Main_C_BndEvt__BP_CineCharacter_Main_LiveLinkComponentController_K2Node_ComponentBoundEvent_0_LiveLinkTickDelegate__DelegateSignature) == 0x000004, "Wrong size on BP_CineCharacter_Main_C_BndEvt__BP_CineCharacter_Main_LiveLinkComponentController_K2Node_ComponentBoundEvent_0_LiveLinkTickDelegate__DelegateSignature");
static_assert(offsetof(BP_CineCharacter_Main_C_BndEvt__BP_CineCharacter_Main_LiveLinkComponentController_K2Node_ComponentBoundEvent_0_LiveLinkTickDelegate__DelegateSignature, DeltaTime) == 0x000000, "Member 'BP_CineCharacter_Main_C_BndEvt__BP_CineCharacter_Main_LiveLinkComponentController_K2Node_ComponentBoundEvent_0_LiveLinkTickDelegate__DelegateSignature::DeltaTime' has a wrong offset!");

// Function BP_CineCharacter_Main.BP_CineCharacter_Main_C.CheckForErrors
// 0x0148 (0x0148 - 0x0000)
struct BP_CineCharacter_Main_C_CheckForErrors final
{
public:
	TArray<class FText>                           ErrorMessages;                                     // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_ArrayContainsInvalid_Result;              // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 CallFunc_ArrayContainsInvalid_ArrayIndex;          // 0x0030(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0040(0x0010)()
	TArray<class FString>                         CallFunc_ToStringArray__integer__StringArray;      // 0x0050(0x0010)(ReferenceParm)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0060(0x0048)(HasGetValueTypeHash)
	class FString                                 CallFunc_JoinStringArray_ReturnValue;              // 0x00A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x00B8(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00C8(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0110(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Format_ReturnValue;                       // 0x0120(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_2;          // 0x0130(0x0010)()
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CineCharacter_Main_C_CheckForErrors) == 0x000008, "Wrong alignment on BP_CineCharacter_Main_C_CheckForErrors");
static_assert(sizeof(BP_CineCharacter_Main_C_CheckForErrors) == 0x000148, "Wrong size on BP_CineCharacter_Main_C_CheckForErrors");
static_assert(offsetof(BP_CineCharacter_Main_C_CheckForErrors, ErrorMessages) == 0x000000, "Member 'BP_CineCharacter_Main_C_CheckForErrors::ErrorMessages' has a wrong offset!");
static_assert(offsetof(BP_CineCharacter_Main_C_CheckForErrors, ReturnValue) == 0x000010, "Member 'BP_CineCharacter_Main_C_CheckForErrors::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CineCharacter_Main_C_CheckForErrors, CallFunc_GetDisplayName_ReturnValue) == 0x000018, "Member 'BP_CineCharacter_Main_C_CheckForErrors::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CineCharacter_Main_C_CheckForErrors, CallFunc_ArrayContainsInvalid_Result) == 0x000028, "Member 'BP_CineCharacter_Main_C_CheckForErrors::CallFunc_ArrayContainsInvalid_Result' has a wrong offset!");
static_assert(offsetof(BP_CineCharacter_Main_C_CheckForErrors, CallFunc_ArrayContainsInvalid_ArrayIndex) == 0x000030, "Member 'BP_CineCharacter_Main_C_CheckForErrors::CallFunc_ArrayContainsInvalid_ArrayIndex' has a wrong offset!");
static_assert(offsetof(BP_CineCharacter_Main_C_CheckForErrors, CallFunc_Conv_StringToText_ReturnValue) == 0x000040, "Member 'BP_CineCharacter_Main_C_CheckForErrors::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CineCharacter_Main_C_CheckForErrors, CallFunc_ToStringArray__integer__StringArray) == 0x000050, "Member 'BP_CineCharacter_Main_C_CheckForErrors::CallFunc_ToStringArray__integer__StringArray' has a wrong offset!");
static_assert(offsetof(BP_CineCharacter_Main_C_CheckForErrors, K2Node_MakeStruct_FormatArgumentData) == 0x000060, "Member 'BP_CineCharacter_Main_C_CheckForErrors::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_CineCharacter_Main_C_CheckForErrors, CallFunc_JoinStringArray_ReturnValue) == 0x0000A8, "Member 'BP_CineCharacter_Main_C_CheckForErrors::CallFunc_JoinStringArray_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CineCharacter_Main_C_CheckForErrors, CallFunc_Conv_StringToText_ReturnValue_1) == 0x0000B8, "Member 'BP_CineCharacter_Main_C_CheckForErrors::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CineCharacter_Main_C_CheckForErrors, K2Node_MakeStruct_FormatArgumentData_1) == 0x0000C8, "Member 'BP_CineCharacter_Main_C_CheckForErrors::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BP_CineCharacter_Main_C_CheckForErrors, K2Node_MakeArray_Array) == 0x000110, "Member 'BP_CineCharacter_Main_C_CheckForErrors::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_CineCharacter_Main_C_CheckForErrors, CallFunc_Format_ReturnValue) == 0x000120, "Member 'BP_CineCharacter_Main_C_CheckForErrors::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CineCharacter_Main_C_CheckForErrors, CallFunc_Conv_StringToText_ReturnValue_2) == 0x000130, "Member 'BP_CineCharacter_Main_C_CheckForErrors::CallFunc_Conv_StringToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CineCharacter_Main_C_CheckForErrors, CallFunc_Array_Add_ReturnValue) == 0x000140, "Member 'BP_CineCharacter_Main_C_CheckForErrors::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function BP_CineCharacter_Main.BP_CineCharacter_Main_C.ExecuteUbergraph_BP_CineCharacter_Main
// 0x0340 (0x0340 - 0x0000)
struct BP_CineCharacter_Main_C_ExecuteUbergraph_BP_CineCharacter_Main final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue;                         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_CineCharacter_Main_C*               K2Node_DynamicCast_AsBP_Cine_Character_Main;       // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0xE];                                       // 0x0022(0x000E)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetSocketTransform_ReturnValue;           // 0x0030(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Lerp_ReturnValue_1;                       // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0xF];                                       // 0x00A1(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetSocketTransform_ReturnValue_1;         // 0x00B0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0112(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0113(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0114(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_115[0x3];                                      // 0x0115(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11C[0x4];                                      // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetPhysicsAngularVelocityInDegrees_ReturnValue; // 0x0120(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0154(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0155(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_156[0x2];                                      // 0x0156(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetPhysicsLinearVelocity_ReturnValue;     // 0x0158(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue_1;          // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_171[0x7];                                      // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector_X_1;                          // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_1;                          // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_1;                          // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_191[0x7];                                      // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0198(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_VSize_ReturnValue;                        // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent_DeltaTime;              // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x01BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPackagedBuild_ReturnValue;              // 0x01BD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInPlayMode_ReturnValue;                 // 0x01BE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInSimulateMode_ReturnValue;             // 0x01BF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInPlayMode_ReturnValue_1;               // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x01C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInSimulateMode_ReturnValue_1;           // 0x01C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x01C3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C4[0x4];                                      // 0x01C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMeshComponent*>                 CallFunc_GetAllElementsToDust_ElementsToDust;      // 0x01C8(0x0010)(ReferenceParm, ContainsInstancedReference)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x01D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMeshComponent*                         CallFunc_Array_Get_Item;                           // 0x01F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x01FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01FD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1FE[0x2];                                      // 0x01FE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UConfigurableGameUserSettings*          CallFunc_GetConfigurableGameUserSettings_GameUserSettings; // 0x0200(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class UConfigurableGameUserSettings* UserConfig)> K2Node_CreateDelegate_OutputDelegate; // 0x0208(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x0218(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x0230(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class UBP_CharacterSkinComponent_C*           K2Node_ComponentBoundEvent_SkinComponent;          // 0x0328(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_Alpha_ImplicitCast;                  // 0x0330(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_Alpha_ImplicitCast_1;                // 0x0338(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CineCharacter_Main_C_ExecuteUbergraph_BP_CineCharacter_Main) == 0x000010, "Wrong alignment on BP_CineCharacter_Main_C_ExecuteUbergraph_BP_CineCharacter_Main");
static_assert(sizeof(BP_CineCharacter_Main_C_ExecuteUbergraph_BP_CineCharacter_Main) == 0x000340, "Wrong size on BP_CineCharacter_Main_C_ExecuteUbergraph_BP_CineCharacter_Main");
static_assert(offsetof(BP_CineCharacter_Main_C_ExecuteUbergraph_BP_CineCharacter_Main, EntryPoint) == 0x000000, "Member 'BP_CineCharacter_Main_C_ExecuteUbergraph_BP_CineCharacter_Main::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_CineCharacter_Main_C_ExecuteUbergraph_BP_CineCharacter_Main, Temp_int_Array_Index_Variable) == 0x000004, "Member 'BP_CineCharacter_Main_C_ExecuteUbergraph_BP_CineCharacter_Main::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_CineCharacter_Main_C_ExecuteUbergraph_BP_CineCharacter_Main, CallFunc_Lerp_ReturnValue) == 0x000008, "Member 'BP_CineCharacter_Main_C_ExecuteUbergraph_BP_CineCharacter_Main::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CineCharacter_Main_C_ExecuteUbergraph_BP_CineCharacter_Main, K2Node_Event_DeltaSeconds) == 0x000010, "Member 'BP_CineCharacter_Main_C_ExecuteUbergraph_BP_CineCharacter_Main::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_CineCharacter_Main_C_ExecuteUbergraph_BP_CineCharacter_Main, K2Node_Event_EndPlayReason) == 0x000014, "Member 'BP_CineCharacter_Main_C_ExecuteUbergraph_BP_CineCharacter_Main::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BP_CineCharacter_Main_C_ExecuteUbergraph_BP_CineCharacter_Main, K2Node_DynamicCast_AsBP_Cine_Character_Main) == 0x000018, "Member 'BP_CineCharacter_Main_C_ExecuteUbergraph_BP_CineCharacter_Main::K2Node_DynamicCast_AsBP_Cine_Character_Main' has a wrong offset!");
static_assert(offsetof(BP_CineCharacter_Main_C_ExecuteUbergraph_BP_CineCharacter_Main, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_CineCharacter_Main_C_ExecuteUbergraph_BP_CineCharacter_Main::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_CineCharacter_Main_C_ExecuteUbergraph_BP_CineCharacter_Main, CallFunc_IsValid_ReturnValue) == 0x000021, "Member 'BP_CineCharacter_Main_C_ExecuteUbergraph_BP_CineCharacter_Main::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CineCharacter_Main_C_ExecuteUbergraph_BP_CineCharacter_Main, CallFunc_GetSocketTransform_ReturnValue) == 0x000030, "Member 'BP_CineCharacter_Main_C_ExecuteUbergraph_BP_CineCharacter_Main::CallFunc_GetSocketTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CineCharacter_Main_C_ExecuteUbergraph_BP_CineCharacter_Main, CallFunc_IsValid_ReturnValue_1) == 0x000090, "Member 'BP_CineCharacter_Main_C_ExecuteUbergraph_BP_CineCharacter_Main::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CineCharacter_Main_C_ExecuteUbergraph_BP_CineCharacter_Main, CallFunc_Lerp_ReturnValue_1) == 0x000098, "Member 'BP_CineCharacter_Main_C_ExecuteUbergraph_BP_CineCharacter_Main::CallFunc_Lerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CineCharacter_Main_C_ExecuteUbergraph_BP_CineCharacter_Main, CallFunc_IsValid_ReturnValue_2) == 0x0000A0, "Member 'BP_CineCharacter_Main_C_ExecuteUbergraph_BP_CineCharacter_Main::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CineCharacter_Main_C_ExecuteUbergraph_BP_CineCharacter_Main, CallFunc_GetSocketTransform_ReturnValue_1) == 0x0000B0, "Member 'BP_CineCharacter_Main_C_ExecuteUbergraph_BP_CineCharacter_Main::CallFunc_GetSocketTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CineCharacter_Main_C_ExecuteUbergraph_BP_CineCharacter_Main, CallFunc_IsValid_ReturnValue_3) == 0x000110, "Member 'BP_CineCharacter_Main_C_ExecuteUbergraph_BP_CineCharacter_Main::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_CineCharacter_Main_C_ExecuteUbergraph_BP_CineCharacter_Main, Temp_bool_Has_Been_Initd_Variable) == 0x000111, "Member 'BP_CineCharacter_Main_C_ExecuteUbergraph_BP_CineCharacter_Main::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_CineCharacter_Main_C_ExecuteUbergraph_BP_CineCharacter_Main, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000112, "Member 'BP_CineCharacter_Main_C_ExecuteUbergraph_BP_CineCharacter_Main::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CineCharacter_Main_C_ExecuteUbergraph_BP_CineCharacter_Main, Temp_bool_IsClosed_Variable) == 0x000113, "Member 'BP_CineCharacter_Main_C_ExecuteUbergraph_BP_CineCharacter_Main::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_CineCharacter_Main_C_ExecuteUbergraph_BP_CineCharacter_Main, CallFunc_IsValid_ReturnValue_4) == 0x000114, "Member 'BP_CineCharacter_Main_C_ExecuteUbergraph_BP_CineCharacter_Main::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_CineCharacter_Main_C_ExecuteUbergraph_BP_CineCharacter_Main, Temp_int_Loop_Counter_Variable) == 0x000118, "Member 'BP_CineCharacter_Main_C_ExecuteUbergraph_BP_CineCharacter_Main::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_CineCharacter_Main_C_ExecuteUbergraph_BP_CineCharacter_Main, CallFunc_GetPhysicsAngularVelocityInDegrees_ReturnValue) == 0x000120, "Member 'BP_CineCharacter_Main_C_ExecuteUbergraph_BP_CineCharacter_Main::CallFunc_GetPhysicsAngularVelocityInDegrees_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CineCharacter_Main_C_ExecuteUbergraph_BP_CineCharacter_Main, CallFunc_BreakVector_X) == 0x000138, "Member 'BP_CineCharacter_Main_C_ExecuteUbergraph_BP_CineCharacter_Main::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_CineCharacter_Main_C_ExecuteUbergraph_BP_CineCharacter_Main, CallFunc_BreakVector_Y) == 0x000140, "Member 'BP_CineCharacter_Main_C_ExecuteUbergraph_BP_CineCharacter_Main::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_CineCharacter_Main_C_ExecuteUbergraph_BP_CineCharacter_Main, CallFunc_BreakVector_Z) == 0x000148, "Member 'BP_CineCharacter_Main_C_ExecuteUbergraph_BP_CineCharacter_Main::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_CineCharacter_Main_C_ExecuteUbergraph_BP_CineCharacter_Main, CallFunc_Add_IntInt_ReturnValue) == 0x000150, "Member 'BP_CineCharacter_Main_C_ExecuteUbergraph_BP_CineCharacter_Main::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CineCharacter_Main_C_ExecuteUbergraph_BP_CineCharacter_Main, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000154, "Member 'BP_CineCharacter_Main_C_ExecuteUbergraph_BP_CineCharacter_Main::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CineCharacter_Main_C_ExecuteUbergraph_BP_CineCharacter_Main, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000155, "Member 'BP_CineCharacter_Main_C_ExecuteUbergraph_BP_CineCharacter_Main::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CineCharacter_Main_C_ExecuteUbergraph_BP_CineCharacter_Main, CallFunc_GetPhysicsLinearVelocity_ReturnValue) == 0x000158, "Member 'BP_CineCharacter_Main_C_ExecuteUbergraph_BP_CineCharacter_Main::CallFunc_GetPhysicsLinearVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CineCharacter_Main_C_ExecuteUbergraph_BP_CineCharacter_Main, CallFunc_Less_DoubleDouble_ReturnValue_1) == 0x000170, "Member 'BP_CineCharacter_Main_C_ExecuteUbergraph_BP_CineCharacter_Main::CallFunc_Less_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CineCharacter_Main_C_ExecuteUbergraph_BP_CineCharacter_Main, CallFunc_BreakVector_X_1) == 0x000178, "Member 'BP_CineCharacter_Main_C_ExecuteUbergraph_BP_CineCharacter_Main::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(BP_CineCharacter_Main_C_ExecuteUbergraph_BP_CineCharacter_Main, CallFunc_BreakVector_Y_1) == 0x000180, "Member 'BP_CineCharacter_Main_C_ExecuteUbergraph_BP_CineCharacter_Main::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(BP_CineCharacter_Main_C_ExecuteUbergraph_BP_CineCharacter_Main, CallFunc_BreakVector_Z_1) == 0x000188, "Member 'BP_CineCharacter_Main_C_ExecuteUbergraph_BP_CineCharacter_Main::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(BP_CineCharacter_Main_C_ExecuteUbergraph_BP_CineCharacter_Main, CallFunc_BooleanAND_ReturnValue) == 0x000190, "Member 'BP_CineCharacter_Main_C_ExecuteUbergraph_BP_CineCharacter_Main::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CineCharacter_Main_C_ExecuteUbergraph_BP_CineCharacter_Main, CallFunc_MakeVector_ReturnValue) == 0x000198, "Member 'BP_CineCharacter_Main_C_ExecuteUbergraph_BP_CineCharacter_Main::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CineCharacter_Main_C_ExecuteUbergraph_BP_CineCharacter_Main, CallFunc_VSize_ReturnValue) == 0x0001B0, "Member 'BP_CineCharacter_Main_C_ExecuteUbergraph_BP_CineCharacter_Main::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CineCharacter_Main_C_ExecuteUbergraph_BP_CineCharacter_Main, K2Node_ComponentBoundEvent_DeltaTime) == 0x0001B8, "Member 'BP_CineCharacter_Main_C_ExecuteUbergraph_BP_CineCharacter_Main::K2Node_ComponentBoundEvent_DeltaTime' has a wrong offset!");
static_assert(offsetof(BP_CineCharacter_Main_C_ExecuteUbergraph_BP_CineCharacter_Main, CallFunc_IsValid_ReturnValue_5) == 0x0001BC, "Member 'BP_CineCharacter_Main_C_ExecuteUbergraph_BP_CineCharacter_Main::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_CineCharacter_Main_C_ExecuteUbergraph_BP_CineCharacter_Main, CallFunc_IsPackagedBuild_ReturnValue) == 0x0001BD, "Member 'BP_CineCharacter_Main_C_ExecuteUbergraph_BP_CineCharacter_Main::CallFunc_IsPackagedBuild_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CineCharacter_Main_C_ExecuteUbergraph_BP_CineCharacter_Main, CallFunc_IsInPlayMode_ReturnValue) == 0x0001BE, "Member 'BP_CineCharacter_Main_C_ExecuteUbergraph_BP_CineCharacter_Main::CallFunc_IsInPlayMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CineCharacter_Main_C_ExecuteUbergraph_BP_CineCharacter_Main, CallFunc_IsInSimulateMode_ReturnValue) == 0x0001BF, "Member 'BP_CineCharacter_Main_C_ExecuteUbergraph_BP_CineCharacter_Main::CallFunc_IsInSimulateMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CineCharacter_Main_C_ExecuteUbergraph_BP_CineCharacter_Main, CallFunc_IsInPlayMode_ReturnValue_1) == 0x0001C0, "Member 'BP_CineCharacter_Main_C_ExecuteUbergraph_BP_CineCharacter_Main::CallFunc_IsInPlayMode_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CineCharacter_Main_C_ExecuteUbergraph_BP_CineCharacter_Main, CallFunc_BooleanOR_ReturnValue) == 0x0001C1, "Member 'BP_CineCharacter_Main_C_ExecuteUbergraph_BP_CineCharacter_Main::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CineCharacter_Main_C_ExecuteUbergraph_BP_CineCharacter_Main, CallFunc_IsInSimulateMode_ReturnValue_1) == 0x0001C2, "Member 'BP_CineCharacter_Main_C_ExecuteUbergraph_BP_CineCharacter_Main::CallFunc_IsInSimulateMode_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CineCharacter_Main_C_ExecuteUbergraph_BP_CineCharacter_Main, CallFunc_BooleanOR_ReturnValue_1) == 0x0001C3, "Member 'BP_CineCharacter_Main_C_ExecuteUbergraph_BP_CineCharacter_Main::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CineCharacter_Main_C_ExecuteUbergraph_BP_CineCharacter_Main, CallFunc_GetAllElementsToDust_ElementsToDust) == 0x0001C8, "Member 'BP_CineCharacter_Main_C_ExecuteUbergraph_BP_CineCharacter_Main::CallFunc_GetAllElementsToDust_ElementsToDust' has a wrong offset!");
static_assert(offsetof(BP_CineCharacter_Main_C_ExecuteUbergraph_BP_CineCharacter_Main, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0001D8, "Member 'BP_CineCharacter_Main_C_ExecuteUbergraph_BP_CineCharacter_Main::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CineCharacter_Main_C_ExecuteUbergraph_BP_CineCharacter_Main, CallFunc_Array_Get_Item) == 0x0001F0, "Member 'BP_CineCharacter_Main_C_ExecuteUbergraph_BP_CineCharacter_Main::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_CineCharacter_Main_C_ExecuteUbergraph_BP_CineCharacter_Main, CallFunc_Array_Length_ReturnValue) == 0x0001F8, "Member 'BP_CineCharacter_Main_C_ExecuteUbergraph_BP_CineCharacter_Main::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CineCharacter_Main_C_ExecuteUbergraph_BP_CineCharacter_Main, CallFunc_IsValid_ReturnValue_6) == 0x0001FC, "Member 'BP_CineCharacter_Main_C_ExecuteUbergraph_BP_CineCharacter_Main::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_CineCharacter_Main_C_ExecuteUbergraph_BP_CineCharacter_Main, CallFunc_Less_IntInt_ReturnValue) == 0x0001FD, "Member 'BP_CineCharacter_Main_C_ExecuteUbergraph_BP_CineCharacter_Main::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CineCharacter_Main_C_ExecuteUbergraph_BP_CineCharacter_Main, CallFunc_GetConfigurableGameUserSettings_GameUserSettings) == 0x000200, "Member 'BP_CineCharacter_Main_C_ExecuteUbergraph_BP_CineCharacter_Main::CallFunc_GetConfigurableGameUserSettings_GameUserSettings' has a wrong offset!");
static_assert(offsetof(BP_CineCharacter_Main_C_ExecuteUbergraph_BP_CineCharacter_Main, K2Node_CreateDelegate_OutputDelegate) == 0x000208, "Member 'BP_CineCharacter_Main_C_ExecuteUbergraph_BP_CineCharacter_Main::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_CineCharacter_Main_C_ExecuteUbergraph_BP_CineCharacter_Main, CallFunc_GetSocketLocation_ReturnValue) == 0x000218, "Member 'BP_CineCharacter_Main_C_ExecuteUbergraph_BP_CineCharacter_Main::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CineCharacter_Main_C_ExecuteUbergraph_BP_CineCharacter_Main, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x000230, "Member 'BP_CineCharacter_Main_C_ExecuteUbergraph_BP_CineCharacter_Main::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_CineCharacter_Main_C_ExecuteUbergraph_BP_CineCharacter_Main, K2Node_ComponentBoundEvent_SkinComponent) == 0x000328, "Member 'BP_CineCharacter_Main_C_ExecuteUbergraph_BP_CineCharacter_Main::K2Node_ComponentBoundEvent_SkinComponent' has a wrong offset!");
static_assert(offsetof(BP_CineCharacter_Main_C_ExecuteUbergraph_BP_CineCharacter_Main, CallFunc_Lerp_Alpha_ImplicitCast) == 0x000330, "Member 'BP_CineCharacter_Main_C_ExecuteUbergraph_BP_CineCharacter_Main::CallFunc_Lerp_Alpha_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_CineCharacter_Main_C_ExecuteUbergraph_BP_CineCharacter_Main, CallFunc_Lerp_Alpha_ImplicitCast_1) == 0x000338, "Member 'BP_CineCharacter_Main_C_ExecuteUbergraph_BP_CineCharacter_Main::CallFunc_Lerp_Alpha_ImplicitCast_1' has a wrong offset!");

// Function BP_CineCharacter_Main.BP_CineCharacter_Main_C.GetAllElementsToDust
// 0x0020 (0x0020 - 0x0000)
struct BP_CineCharacter_Main_C_GetAllElementsToDust final
{
public:
	TArray<class UMeshComponent*>                 ElementsToDust;                                    // 0x0000(0x0010)(Parm, OutParm, ContainsInstancedReference)
	TArray<class UMeshComponent*>                 K2Node_MakeArray_Array;                            // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(BP_CineCharacter_Main_C_GetAllElementsToDust) == 0x000008, "Wrong alignment on BP_CineCharacter_Main_C_GetAllElementsToDust");
static_assert(sizeof(BP_CineCharacter_Main_C_GetAllElementsToDust) == 0x000020, "Wrong size on BP_CineCharacter_Main_C_GetAllElementsToDust");
static_assert(offsetof(BP_CineCharacter_Main_C_GetAllElementsToDust, ElementsToDust) == 0x000000, "Member 'BP_CineCharacter_Main_C_GetAllElementsToDust::ElementsToDust' has a wrong offset!");
static_assert(offsetof(BP_CineCharacter_Main_C_GetAllElementsToDust, K2Node_MakeArray_Array) == 0x000010, "Member 'BP_CineCharacter_Main_C_GetAllElementsToDust::K2Node_MakeArray_Array' has a wrong offset!");

// Function BP_CineCharacter_Main.BP_CineCharacter_Main_C.GetGroomComponents
// 0x0020 (0x0020 - 0x0000)
struct BP_CineCharacter_Main_C_GetGroomComponents final
{
public:
	TArray<class UGroomComponent*>                Array;                                             // 0x0000(0x0010)(Parm, OutParm, ContainsInstancedReference)
	TArray<class UGroomComponent*>                K2Node_MakeArray_Array;                            // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(BP_CineCharacter_Main_C_GetGroomComponents) == 0x000008, "Wrong alignment on BP_CineCharacter_Main_C_GetGroomComponents");
static_assert(sizeof(BP_CineCharacter_Main_C_GetGroomComponents) == 0x000020, "Wrong size on BP_CineCharacter_Main_C_GetGroomComponents");
static_assert(offsetof(BP_CineCharacter_Main_C_GetGroomComponents, Array) == 0x000000, "Member 'BP_CineCharacter_Main_C_GetGroomComponents::Array' has a wrong offset!");
static_assert(offsetof(BP_CineCharacter_Main_C_GetGroomComponents, K2Node_MakeArray_Array) == 0x000010, "Member 'BP_CineCharacter_Main_C_GetGroomComponents::K2Node_MakeArray_Array' has a wrong offset!");

// Function BP_CineCharacter_Main.BP_CineCharacter_Main_C.MakeGroomAppear
// 0x0038 (0x0038 - 0x0000)
struct BP_CineCharacter_Main_C_MakeGroomAppear final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UGroomComponent*>                CallFunc_GetGroomComponents_Array;                 // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGroomComponent*                        CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CineCharacter_Main_C_MakeGroomAppear) == 0x000008, "Wrong alignment on BP_CineCharacter_Main_C_MakeGroomAppear");
static_assert(sizeof(BP_CineCharacter_Main_C_MakeGroomAppear) == 0x000038, "Wrong size on BP_CineCharacter_Main_C_MakeGroomAppear");
static_assert(offsetof(BP_CineCharacter_Main_C_MakeGroomAppear, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BP_CineCharacter_Main_C_MakeGroomAppear::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_CineCharacter_Main_C_MakeGroomAppear, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_CineCharacter_Main_C_MakeGroomAppear::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_CineCharacter_Main_C_MakeGroomAppear, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_CineCharacter_Main_C_MakeGroomAppear::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CineCharacter_Main_C_MakeGroomAppear, CallFunc_GetGroomComponents_Array) == 0x000010, "Member 'BP_CineCharacter_Main_C_MakeGroomAppear::CallFunc_GetGroomComponents_Array' has a wrong offset!");
static_assert(offsetof(BP_CineCharacter_Main_C_MakeGroomAppear, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'BP_CineCharacter_Main_C_MakeGroomAppear::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CineCharacter_Main_C_MakeGroomAppear, CallFunc_Array_Get_Item) == 0x000028, "Member 'BP_CineCharacter_Main_C_MakeGroomAppear::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_CineCharacter_Main_C_MakeGroomAppear, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'BP_CineCharacter_Main_C_MakeGroomAppear::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CineCharacter_Main_C_MakeGroomAppear, CallFunc_IsValid_ReturnValue) == 0x000031, "Member 'BP_CineCharacter_Main_C_MakeGroomAppear::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_CineCharacter_Main.BP_CineCharacter_Main_C.MakeGroomDisappear
// 0x0038 (0x0038 - 0x0000)
struct BP_CineCharacter_Main_C_MakeGroomDisappear final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UGroomComponent*>                CallFunc_GetGroomComponents_Array;                 // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGroomComponent*                        CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CineCharacter_Main_C_MakeGroomDisappear) == 0x000008, "Wrong alignment on BP_CineCharacter_Main_C_MakeGroomDisappear");
static_assert(sizeof(BP_CineCharacter_Main_C_MakeGroomDisappear) == 0x000038, "Wrong size on BP_CineCharacter_Main_C_MakeGroomDisappear");
static_assert(offsetof(BP_CineCharacter_Main_C_MakeGroomDisappear, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BP_CineCharacter_Main_C_MakeGroomDisappear::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_CineCharacter_Main_C_MakeGroomDisappear, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_CineCharacter_Main_C_MakeGroomDisappear::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_CineCharacter_Main_C_MakeGroomDisappear, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_CineCharacter_Main_C_MakeGroomDisappear::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CineCharacter_Main_C_MakeGroomDisappear, CallFunc_GetGroomComponents_Array) == 0x000010, "Member 'BP_CineCharacter_Main_C_MakeGroomDisappear::CallFunc_GetGroomComponents_Array' has a wrong offset!");
static_assert(offsetof(BP_CineCharacter_Main_C_MakeGroomDisappear, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'BP_CineCharacter_Main_C_MakeGroomDisappear::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CineCharacter_Main_C_MakeGroomDisappear, CallFunc_Array_Get_Item) == 0x000028, "Member 'BP_CineCharacter_Main_C_MakeGroomDisappear::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_CineCharacter_Main_C_MakeGroomDisappear, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'BP_CineCharacter_Main_C_MakeGroomDisappear::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CineCharacter_Main_C_MakeGroomDisappear, CallFunc_IsValid_ReturnValue) == 0x000031, "Member 'BP_CineCharacter_Main_C_MakeGroomDisappear::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_CineCharacter_Main.BP_CineCharacter_Main_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_CineCharacter_Main_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CineCharacter_Main_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_CineCharacter_Main_C_ReceiveEndPlay");
static_assert(sizeof(BP_CineCharacter_Main_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_CineCharacter_Main_C_ReceiveEndPlay");
static_assert(offsetof(BP_CineCharacter_Main_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_CineCharacter_Main_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function BP_CineCharacter_Main.BP_CineCharacter_Main_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_CineCharacter_Main_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CineCharacter_Main_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_CineCharacter_Main_C_ReceiveTick");
static_assert(sizeof(BP_CineCharacter_Main_C_ReceiveTick) == 0x000004, "Wrong size on BP_CineCharacter_Main_C_ReceiveTick");
static_assert(offsetof(BP_CineCharacter_Main_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_CineCharacter_Main_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_CineCharacter_Main.BP_CineCharacter_Main_C.ResetWeaponsPosition
// 0x01F8 (0x01F8 - 0x0000)
struct BP_CineCharacter_Main_C_ResetWeaponsPosition final
{
public:
	class ABP_WeaponSkin_C*                       weapon;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocationAndRotation_SweepHitResult; // 0x0008(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeLocationAndRotation_SweepHitResult_1; // 0x0100(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_CineCharacter_Main_C_ResetWeaponsPosition) == 0x000008, "Wrong alignment on BP_CineCharacter_Main_C_ResetWeaponsPosition");
static_assert(sizeof(BP_CineCharacter_Main_C_ResetWeaponsPosition) == 0x0001F8, "Wrong size on BP_CineCharacter_Main_C_ResetWeaponsPosition");
static_assert(offsetof(BP_CineCharacter_Main_C_ResetWeaponsPosition, weapon) == 0x000000, "Member 'BP_CineCharacter_Main_C_ResetWeaponsPosition::weapon' has a wrong offset!");
static_assert(offsetof(BP_CineCharacter_Main_C_ResetWeaponsPosition, CallFunc_K2_SetRelativeLocationAndRotation_SweepHitResult) == 0x000008, "Member 'BP_CineCharacter_Main_C_ResetWeaponsPosition::CallFunc_K2_SetRelativeLocationAndRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_CineCharacter_Main_C_ResetWeaponsPosition, CallFunc_K2_SetRelativeLocationAndRotation_SweepHitResult_1) == 0x000100, "Member 'BP_CineCharacter_Main_C_ResetWeaponsPosition::CallFunc_K2_SetRelativeLocationAndRotation_SweepHitResult_1' has a wrong offset!");

// Function BP_CineCharacter_Main.BP_CineCharacter_Main_C.SetBloodLevel
// 0x0028 (0x0028 - 0x0000)
struct BP_CineCharacter_Main_C_SetBloodLevel final
{
public:
	double                                        NewValue;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMeshComponent*                         CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x2];                                       // 0x0022(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetScalarParameterValueOnMaterials_ParameterValue_ImplicitCast; // 0x0024(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CineCharacter_Main_C_SetBloodLevel) == 0x000008, "Wrong alignment on BP_CineCharacter_Main_C_SetBloodLevel");
static_assert(sizeof(BP_CineCharacter_Main_C_SetBloodLevel) == 0x000028, "Wrong size on BP_CineCharacter_Main_C_SetBloodLevel");
static_assert(offsetof(BP_CineCharacter_Main_C_SetBloodLevel, NewValue) == 0x000000, "Member 'BP_CineCharacter_Main_C_SetBloodLevel::NewValue' has a wrong offset!");
static_assert(offsetof(BP_CineCharacter_Main_C_SetBloodLevel, Temp_int_Array_Index_Variable) == 0x000008, "Member 'BP_CineCharacter_Main_C_SetBloodLevel::Temp_int_Array_Index_Variable' has a wrong offset!");
