#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ConditionCheckerComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_ConditionCheckerComponent.BP_ConditionCheckerComponent_C.CheckForErrors
// 0x0030 (0x0030 - 0x0000)
struct BP_ConditionCheckerComponent_C_CheckForErrors final
{
public:
	TArray<class FText>                           ErrorMessages;                                     // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_MakeLiteralString_ReturnValue;            // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsConditionSet_Result;                    // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ConditionCheckerComponent_C_CheckForErrors) == 0x000008, "Wrong alignment on BP_ConditionCheckerComponent_C_CheckForErrors");
static_assert(sizeof(BP_ConditionCheckerComponent_C_CheckForErrors) == 0x000030, "Wrong size on BP_ConditionCheckerComponent_C_CheckForErrors");
static_assert(offsetof(BP_ConditionCheckerComponent_C_CheckForErrors, ErrorMessages) == 0x000000, "Member 'BP_ConditionCheckerComponent_C_CheckForErrors::ErrorMessages' has a wrong offset!");
static_assert(offsetof(BP_ConditionCheckerComponent_C_CheckForErrors, ReturnValue) == 0x000010, "Member 'BP_ConditionCheckerComponent_C_CheckForErrors::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConditionCheckerComponent_C_CheckForErrors, CallFunc_MakeLiteralString_ReturnValue) == 0x000018, "Member 'BP_ConditionCheckerComponent_C_CheckForErrors::CallFunc_MakeLiteralString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConditionCheckerComponent_C_CheckForErrors, CallFunc_IsConditionSet_Result) == 0x000028, "Member 'BP_ConditionCheckerComponent_C_CheckForErrors::CallFunc_IsConditionSet_Result' has a wrong offset!");

// Function BP_ConditionCheckerComponent.BP_ConditionCheckerComponent_C.GetCurrentConditionValue
// 0x0001 (0x0001 - 0x0000)
struct BP_ConditionCheckerComponent_C_GetCurrentConditionValue final
{
public:
	bool                                          CurrentValue_0;                                    // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ConditionCheckerComponent_C_GetCurrentConditionValue) == 0x000001, "Wrong alignment on BP_ConditionCheckerComponent_C_GetCurrentConditionValue");
static_assert(sizeof(BP_ConditionCheckerComponent_C_GetCurrentConditionValue) == 0x000001, "Wrong size on BP_ConditionCheckerComponent_C_GetCurrentConditionValue");
static_assert(offsetof(BP_ConditionCheckerComponent_C_GetCurrentConditionValue, CurrentValue_0) == 0x000000, "Member 'BP_ConditionCheckerComponent_C_GetCurrentConditionValue::CurrentValue_0' has a wrong offset!");

// Function BP_ConditionCheckerComponent.BP_ConditionCheckerComponent_C.DispatchConditionChanged
// 0x0002 (0x0002 - 0x0000)
struct BP_ConditionCheckerComponent_C_DispatchConditionChanged final
{
public:
	bool                                          CallFunc_IsInPlayMode_ReturnValue;                 // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPackagedBuild_ReturnValue;              // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ConditionCheckerComponent_C_DispatchConditionChanged) == 0x000001, "Wrong alignment on BP_ConditionCheckerComponent_C_DispatchConditionChanged");
static_assert(sizeof(BP_ConditionCheckerComponent_C_DispatchConditionChanged) == 0x000002, "Wrong size on BP_ConditionCheckerComponent_C_DispatchConditionChanged");
static_assert(offsetof(BP_ConditionCheckerComponent_C_DispatchConditionChanged, CallFunc_IsInPlayMode_ReturnValue) == 0x000000, "Member 'BP_ConditionCheckerComponent_C_DispatchConditionChanged::CallFunc_IsInPlayMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConditionCheckerComponent_C_DispatchConditionChanged, CallFunc_IsPackagedBuild_ReturnValue) == 0x000001, "Member 'BP_ConditionCheckerComponent_C_DispatchConditionChanged::CallFunc_IsPackagedBuild_ReturnValue' has a wrong offset!");

// Function BP_ConditionCheckerComponent.BP_ConditionCheckerComponent_C.EvaluateConditionChecker
// 0x0004 (0x0004 - 0x0000)
struct BP_ConditionCheckerComponent_C_EvaluateConditionChecker final
{
public:
	bool                                          ForceDispatchConditionChanged;                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckOptionalCondition_Result;            // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ConditionCheckerComponent_C_EvaluateConditionChecker) == 0x000001, "Wrong alignment on BP_ConditionCheckerComponent_C_EvaluateConditionChecker");
static_assert(sizeof(BP_ConditionCheckerComponent_C_EvaluateConditionChecker) == 0x000004, "Wrong size on BP_ConditionCheckerComponent_C_EvaluateConditionChecker");
static_assert(offsetof(BP_ConditionCheckerComponent_C_EvaluateConditionChecker, ForceDispatchConditionChanged) == 0x000000, "Member 'BP_ConditionCheckerComponent_C_EvaluateConditionChecker::ForceDispatchConditionChanged' has a wrong offset!");
static_assert(offsetof(BP_ConditionCheckerComponent_C_EvaluateConditionChecker, CallFunc_CheckOptionalCondition_Result) == 0x000001, "Member 'BP_ConditionCheckerComponent_C_EvaluateConditionChecker::CallFunc_CheckOptionalCondition_Result' has a wrong offset!");
static_assert(offsetof(BP_ConditionCheckerComponent_C_EvaluateConditionChecker, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000002, "Member 'BP_ConditionCheckerComponent_C_EvaluateConditionChecker::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConditionCheckerComponent_C_EvaluateConditionChecker, CallFunc_BooleanOR_ReturnValue) == 0x000003, "Member 'BP_ConditionCheckerComponent_C_EvaluateConditionChecker::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function BP_ConditionCheckerComponent.BP_ConditionCheckerComponent_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_ConditionCheckerComponent_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ConditionCheckerComponent_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_ConditionCheckerComponent_C_ReceiveEndPlay");
static_assert(sizeof(BP_ConditionCheckerComponent_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_ConditionCheckerComponent_C_ReceiveEndPlay");
static_assert(offsetof(BP_ConditionCheckerComponent_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_ConditionCheckerComponent_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function BP_ConditionCheckerComponent.BP_ConditionCheckerComponent_C.ExecuteUbergraph_BP_ConditionCheckerComponent
// 0x0040 (0x0040 - 0x0000)
struct BP_ConditionCheckerComponent_C_ExecuteUbergraph_BP_ConditionCheckerComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_jRPG_GI_Custom_C*                   CallFunc_GetCustomGI_ReturnValue;                  // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_jRPG_GI_Custom_C*                   CallFunc_GetCustomGI_ReturnValue_1;                // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ConditionCheckerComponent_C_ExecuteUbergraph_BP_ConditionCheckerComponent) == 0x000008, "Wrong alignment on BP_ConditionCheckerComponent_C_ExecuteUbergraph_BP_ConditionCheckerComponent");
static_assert(sizeof(BP_ConditionCheckerComponent_C_ExecuteUbergraph_BP_ConditionCheckerComponent) == 0x000040, "Wrong size on BP_ConditionCheckerComponent_C_ExecuteUbergraph_BP_ConditionCheckerComponent");
static_assert(offsetof(BP_ConditionCheckerComponent_C_ExecuteUbergraph_BP_ConditionCheckerComponent, EntryPoint) == 0x000000, "Member 'BP_ConditionCheckerComponent_C_ExecuteUbergraph_BP_ConditionCheckerComponent::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ConditionCheckerComponent_C_ExecuteUbergraph_BP_ConditionCheckerComponent, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BP_ConditionCheckerComponent_C_ExecuteUbergraph_BP_ConditionCheckerComponent::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_ConditionCheckerComponent_C_ExecuteUbergraph_BP_ConditionCheckerComponent, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'BP_ConditionCheckerComponent_C_ExecuteUbergraph_BP_ConditionCheckerComponent::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_ConditionCheckerComponent_C_ExecuteUbergraph_BP_ConditionCheckerComponent, K2Node_Event_EndPlayReason) == 0x000024, "Member 'BP_ConditionCheckerComponent_C_ExecuteUbergraph_BP_ConditionCheckerComponent::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BP_ConditionCheckerComponent_C_ExecuteUbergraph_BP_ConditionCheckerComponent, CallFunc_GetCustomGI_ReturnValue) == 0x000028, "Member 'BP_ConditionCheckerComponent_C_ExecuteUbergraph_BP_ConditionCheckerComponent::CallFunc_GetCustomGI_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConditionCheckerComponent_C_ExecuteUbergraph_BP_ConditionCheckerComponent, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000030, "Member 'BP_ConditionCheckerComponent_C_ExecuteUbergraph_BP_ConditionCheckerComponent::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConditionCheckerComponent_C_ExecuteUbergraph_BP_ConditionCheckerComponent, CallFunc_GetCustomGI_ReturnValue_1) == 0x000038, "Member 'BP_ConditionCheckerComponent_C_ExecuteUbergraph_BP_ConditionCheckerComponent::CallFunc_GetCustomGI_ReturnValue_1' has a wrong offset!");

}

