#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CharacterFaceBase

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_CharacterFaceBase.BP_CharacterFaceBase_C.UserConstructionScript
// 0x0018 (0x0018 - 0x0000)
struct BP_CharacterFaceBase_C_UserConstructionScript final
{
public:
	class FString                                 NewLocalVar;                                       // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInPlayMode_ReturnValue;                 // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPackagedBuild_ReturnValue;              // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue_1;       // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CharacterFaceBase_C_UserConstructionScript) == 0x000008, "Wrong alignment on BP_CharacterFaceBase_C_UserConstructionScript");
static_assert(sizeof(BP_CharacterFaceBase_C_UserConstructionScript) == 0x000018, "Wrong size on BP_CharacterFaceBase_C_UserConstructionScript");
static_assert(offsetof(BP_CharacterFaceBase_C_UserConstructionScript, NewLocalVar) == 0x000000, "Member 'BP_CharacterFaceBase_C_UserConstructionScript::NewLocalVar' has a wrong offset!");
static_assert(offsetof(BP_CharacterFaceBase_C_UserConstructionScript, CallFunc_IsInPlayMode_ReturnValue) == 0x000010, "Member 'BP_CharacterFaceBase_C_UserConstructionScript::CallFunc_IsInPlayMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterFaceBase_C_UserConstructionScript, CallFunc_Not_PreBool_ReturnValue) == 0x000011, "Member 'BP_CharacterFaceBase_C_UserConstructionScript::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterFaceBase_C_UserConstructionScript, CallFunc_IsPackagedBuild_ReturnValue) == 0x000012, "Member 'BP_CharacterFaceBase_C_UserConstructionScript::CallFunc_IsPackagedBuild_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterFaceBase_C_UserConstructionScript, CallFunc_Not_PreBool_ReturnValue_1) == 0x000013, "Member 'BP_CharacterFaceBase_C_UserConstructionScript::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CharacterFaceBase_C_UserConstructionScript, CallFunc_BooleanAND_ReturnValue) == 0x000014, "Member 'BP_CharacterFaceBase_C_UserConstructionScript::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterFaceBase_C_UserConstructionScript, CallFunc_K2_AttachToComponent_ReturnValue) == 0x000015, "Member 'BP_CharacterFaceBase_C_UserConstructionScript::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterFaceBase_C_UserConstructionScript, CallFunc_K2_AttachToComponent_ReturnValue_1) == 0x000016, "Member 'BP_CharacterFaceBase_C_UserConstructionScript::CallFunc_K2_AttachToComponent_ReturnValue_1' has a wrong offset!");

}

