#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ConditionChecker_AtLeastAmountOfItemInInventory

#include "Basic.hpp"

#include "S_jRPG_Item_StaticData_structs.hpp"


namespace SDK::Params
{

// Function BP_ConditionChecker_AtLeastAmountOfItemInInventory.BP_ConditionChecker_AtLeastAmountOfItemInInventory_C.CheckInternal
// 0x0140 (0x0140 - 0x0000)
struct BP_ConditionChecker_AtLeastAmountOfItemInInventory_C_CheckInternal final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_jRPG_Item_StaticData                CallFunc_GetItemStaticData_ItemData;               // 0x0008(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_HasAtLeastAmountOfItemInInventory_Result; // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ConditionChecker_AtLeastAmountOfItemInInventory_C_CheckInternal) == 0x000008, "Wrong alignment on BP_ConditionChecker_AtLeastAmountOfItemInInventory_C_CheckInternal");
static_assert(sizeof(BP_ConditionChecker_AtLeastAmountOfItemInInventory_C_CheckInternal) == 0x000140, "Wrong size on BP_ConditionChecker_AtLeastAmountOfItemInInventory_C_CheckInternal");
static_assert(offsetof(BP_ConditionChecker_AtLeastAmountOfItemInInventory_C_CheckInternal, ReturnValue) == 0x000000, "Member 'BP_ConditionChecker_AtLeastAmountOfItemInInventory_C_CheckInternal::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConditionChecker_AtLeastAmountOfItemInInventory_C_CheckInternal, CallFunc_GetItemStaticData_ItemData) == 0x000008, "Member 'BP_ConditionChecker_AtLeastAmountOfItemInInventory_C_CheckInternal::CallFunc_GetItemStaticData_ItemData' has a wrong offset!");
static_assert(offsetof(BP_ConditionChecker_AtLeastAmountOfItemInInventory_C_CheckInternal, CallFunc_HasAtLeastAmountOfItemInInventory_Result) == 0x000138, "Member 'BP_ConditionChecker_AtLeastAmountOfItemInInventory_C_CheckInternal::CallFunc_HasAtLeastAmountOfItemInInventory_Result' has a wrong offset!");

}

