#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CharacterReactionSystem

#include "Basic.hpp"

#include "S_BattleLinePool_structs.hpp"
#include "S_BattleLine_structs.hpp"
#include "S_BattleLinePoolCandidate_structs.hpp"
#include "ECharacterTeamSelector_structs.hpp"
#include "Engine_structs.hpp"
#include "S_BattleLineCandidate_structs.hpp"


namespace SDK::Params
{

// Function BP_CharacterReactionSystem.BP_CharacterReactionSystem_C.BeginChoosingBattleLines
// 0x0018 (0x0018 - 0x0000)
struct BP_CharacterReactionSystem_C_BeginChoosingBattleLines final
{
public:
	class UBP_BattleLineGatherer_C*               Gatherer;                                          // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_BattleLineGatherer_C*               CallFunc_SpawnObject_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CharacterReactionSystem_C_BeginChoosingBattleLines) == 0x000008, "Wrong alignment on BP_CharacterReactionSystem_C_BeginChoosingBattleLines");
static_assert(sizeof(BP_CharacterReactionSystem_C_BeginChoosingBattleLines) == 0x000018, "Wrong size on BP_CharacterReactionSystem_C_BeginChoosingBattleLines");
static_assert(offsetof(BP_CharacterReactionSystem_C_BeginChoosingBattleLines, Gatherer) == 0x000000, "Member 'BP_CharacterReactionSystem_C_BeginChoosingBattleLines::Gatherer' has a wrong offset!");
static_assert(offsetof(BP_CharacterReactionSystem_C_BeginChoosingBattleLines, CallFunc_SpawnObject_ReturnValue) == 0x000008, "Member 'BP_CharacterReactionSystem_C_BeginChoosingBattleLines::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterReactionSystem_C_BeginChoosingBattleLines, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'BP_CharacterReactionSystem_C_BeginChoosingBattleLines::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_CharacterReactionSystem.BP_CharacterReactionSystem_C.DEBUG_CVarChange_BattleLine_SkipRoll
// 0x0001 (0x0001 - 0x0000)
struct BP_CharacterReactionSystem_C_DEBUG_CVarChange_BattleLine_SkipRoll final
{
public:
	bool                                          NewValue;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CharacterReactionSystem_C_DEBUG_CVarChange_BattleLine_SkipRoll) == 0x000001, "Wrong alignment on BP_CharacterReactionSystem_C_DEBUG_CVarChange_BattleLine_SkipRoll");
static_assert(sizeof(BP_CharacterReactionSystem_C_DEBUG_CVarChange_BattleLine_SkipRoll) == 0x000001, "Wrong size on BP_CharacterReactionSystem_C_DEBUG_CVarChange_BattleLine_SkipRoll");
static_assert(offsetof(BP_CharacterReactionSystem_C_DEBUG_CVarChange_BattleLine_SkipRoll, NewValue) == 0x000000, "Member 'BP_CharacterReactionSystem_C_DEBUG_CVarChange_BattleLine_SkipRoll::NewValue' has a wrong offset!");

// Function BP_CharacterReactionSystem.BP_CharacterReactionSystem_C.EndChooseBattleLines
// 0x01C0 (0x01C0 - 0x0000)
struct BP_CharacterReactionSystem_C_EndChooseBattleLines final
{
public:
	class UBP_BattleLineGatherer_C*               Gatherer;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         local_rolledIndex;                                 // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        local_roll;                                        // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<double>                                local_sumedProbabilitiesList;                      // 0x0018(0x0010)(Edit, BlueprintVisible)
	double                                        local_probabilitiesTotal;                          // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FS_BattleLinePoolCandidate>     local_poolCandidates;                              // 0x0030(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	bool                                          CallFunc_SelectBattleLineCandidate_Valid;          // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_BattleLineCandidate                 CallFunc_SelectBattleLineCandidate_ChosenLine;     // 0x0048(0x0028)(ContainsInstancedReference, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0070(0x0010)()
	class UAC_jRPG_CharacterBattleStats_C*        CallFunc_GetOwnerCharacterStats_OwnerCharacterStats; // 0x0080(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0088(0x0048)(HasGetValueTypeHash)
	class UAC_jRPG_CharacterBattleStats_C*        CallFunc_GetOwnerCharacterStats_OwnerCharacterStats_1; // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_NameToText_ReturnValue;              // 0x00D8(0x0010)()
	class ABP_jRPG_Character_Battle_Base_C*       CallFunc_GetCharacterBattleBase_jRPG_CharacterBattleBase; // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetCharacterBattleBase_IsValid;           // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00F8(0x0048)(HasGetValueTypeHash)
	class UBP_AudioCharacter_BattleManager_C*     CallFunc_GetCharacterAudioManager_ReturnValue;     // 0x0140(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_ObjectToText_ReturnValue;            // 0x0148(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0158(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x01A0(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Format_ReturnValue;                       // 0x01B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CharacterReactionSystem_C_EndChooseBattleLines) == 0x000008, "Wrong alignment on BP_CharacterReactionSystem_C_EndChooseBattleLines");
static_assert(sizeof(BP_CharacterReactionSystem_C_EndChooseBattleLines) == 0x0001C0, "Wrong size on BP_CharacterReactionSystem_C_EndChooseBattleLines");
static_assert(offsetof(BP_CharacterReactionSystem_C_EndChooseBattleLines, Gatherer) == 0x000000, "Member 'BP_CharacterReactionSystem_C_EndChooseBattleLines::Gatherer' has a wrong offset!");
static_assert(offsetof(BP_CharacterReactionSystem_C_EndChooseBattleLines, local_rolledIndex) == 0x000008, "Member 'BP_CharacterReactionSystem_C_EndChooseBattleLines::local_rolledIndex' has a wrong offset!");
static_assert(offsetof(BP_CharacterReactionSystem_C_EndChooseBattleLines, local_roll) == 0x000010, "Member 'BP_CharacterReactionSystem_C_EndChooseBattleLines::local_roll' has a wrong offset!");
static_assert(offsetof(BP_CharacterReactionSystem_C_EndChooseBattleLines, local_sumedProbabilitiesList) == 0x000018, "Member 'BP_CharacterReactionSystem_C_EndChooseBattleLines::local_sumedProbabilitiesList' has a wrong offset!");
static_assert(offsetof(BP_CharacterReactionSystem_C_EndChooseBattleLines, local_probabilitiesTotal) == 0x000028, "Member 'BP_CharacterReactionSystem_C_EndChooseBattleLines::local_probabilitiesTotal' has a wrong offset!");
static_assert(offsetof(BP_CharacterReactionSystem_C_EndChooseBattleLines, local_poolCandidates) == 0x000030, "Member 'BP_CharacterReactionSystem_C_EndChooseBattleLines::local_poolCandidates' has a wrong offset!");
static_assert(offsetof(BP_CharacterReactionSystem_C_EndChooseBattleLines, CallFunc_SelectBattleLineCandidate_Valid) == 0x000040, "Member 'BP_CharacterReactionSystem_C_EndChooseBattleLines::CallFunc_SelectBattleLineCandidate_Valid' has a wrong offset!");
static_assert(offsetof(BP_CharacterReactionSystem_C_EndChooseBattleLines, CallFunc_SelectBattleLineCandidate_ChosenLine) == 0x000048, "Member 'BP_CharacterReactionSystem_C_EndChooseBattleLines::CallFunc_SelectBattleLineCandidate_ChosenLine' has a wrong offset!");
static_assert(offsetof(BP_CharacterReactionSystem_C_EndChooseBattleLines, CallFunc_Conv_StringToText_ReturnValue) == 0x000070, "Member 'BP_CharacterReactionSystem_C_EndChooseBattleLines::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterReactionSystem_C_EndChooseBattleLines, CallFunc_GetOwnerCharacterStats_OwnerCharacterStats) == 0x000080, "Member 'BP_CharacterReactionSystem_C_EndChooseBattleLines::CallFunc_GetOwnerCharacterStats_OwnerCharacterStats' has a wrong offset!");
static_assert(offsetof(BP_CharacterReactionSystem_C_EndChooseBattleLines, K2Node_MakeStruct_FormatArgumentData) == 0x000088, "Member 'BP_CharacterReactionSystem_C_EndChooseBattleLines::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_CharacterReactionSystem_C_EndChooseBattleLines, CallFunc_GetOwnerCharacterStats_OwnerCharacterStats_1) == 0x0000D0, "Member 'BP_CharacterReactionSystem_C_EndChooseBattleLines::CallFunc_GetOwnerCharacterStats_OwnerCharacterStats_1' has a wrong offset!");
static_assert(offsetof(BP_CharacterReactionSystem_C_EndChooseBattleLines, CallFunc_Conv_NameToText_ReturnValue) == 0x0000D8, "Member 'BP_CharacterReactionSystem_C_EndChooseBattleLines::CallFunc_Conv_NameToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterReactionSystem_C_EndChooseBattleLines, CallFunc_GetCharacterBattleBase_jRPG_CharacterBattleBase) == 0x0000E8, "Member 'BP_CharacterReactionSystem_C_EndChooseBattleLines::CallFunc_GetCharacterBattleBase_jRPG_CharacterBattleBase' has a wrong offset!");
static_assert(offsetof(BP_CharacterReactionSystem_C_EndChooseBattleLines, CallFunc_GetCharacterBattleBase_IsValid) == 0x0000F0, "Member 'BP_CharacterReactionSystem_C_EndChooseBattleLines::CallFunc_GetCharacterBattleBase_IsValid' has a wrong offset!");
static_assert(offsetof(BP_CharacterReactionSystem_C_EndChooseBattleLines, K2Node_MakeStruct_FormatArgumentData_1) == 0x0000F8, "Member 'BP_CharacterReactionSystem_C_EndChooseBattleLines::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BP_CharacterReactionSystem_C_EndChooseBattleLines, CallFunc_GetCharacterAudioManager_ReturnValue) == 0x000140, "Member 'BP_CharacterReactionSystem_C_EndChooseBattleLines::CallFunc_GetCharacterAudioManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterReactionSystem_C_EndChooseBattleLines, CallFunc_Conv_ObjectToText_ReturnValue) == 0x000148, "Member 'BP_CharacterReactionSystem_C_EndChooseBattleLines::CallFunc_Conv_ObjectToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterReactionSystem_C_EndChooseBattleLines, K2Node_MakeStruct_FormatArgumentData_2) == 0x000158, "Member 'BP_CharacterReactionSystem_C_EndChooseBattleLines::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(BP_CharacterReactionSystem_C_EndChooseBattleLines, K2Node_MakeArray_Array) == 0x0001A0, "Member 'BP_CharacterReactionSystem_C_EndChooseBattleLines::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_CharacterReactionSystem_C_EndChooseBattleLines, CallFunc_Format_ReturnValue) == 0x0001B0, "Member 'BP_CharacterReactionSystem_C_EndChooseBattleLines::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function BP_CharacterReactionSystem.BP_CharacterReactionSystem_C.ExecuteUbergraph_BP_CharacterReactionSystem
// 0x0018 (0x0018 - 0x0000)
struct BP_CharacterReactionSystem_C_ExecuteUbergraph_BP_CharacterReactionSystem final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool NewValue)>                K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_NewValue;                       // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CharacterReactionSystem_C_ExecuteUbergraph_BP_CharacterReactionSystem) == 0x000004, "Wrong alignment on BP_CharacterReactionSystem_C_ExecuteUbergraph_BP_CharacterReactionSystem");
static_assert(sizeof(BP_CharacterReactionSystem_C_ExecuteUbergraph_BP_CharacterReactionSystem) == 0x000018, "Wrong size on BP_CharacterReactionSystem_C_ExecuteUbergraph_BP_CharacterReactionSystem");
static_assert(offsetof(BP_CharacterReactionSystem_C_ExecuteUbergraph_BP_CharacterReactionSystem, EntryPoint) == 0x000000, "Member 'BP_CharacterReactionSystem_C_ExecuteUbergraph_BP_CharacterReactionSystem::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_CharacterReactionSystem_C_ExecuteUbergraph_BP_CharacterReactionSystem, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BP_CharacterReactionSystem_C_ExecuteUbergraph_BP_CharacterReactionSystem::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_CharacterReactionSystem_C_ExecuteUbergraph_BP_CharacterReactionSystem, K2Node_CustomEvent_NewValue) == 0x000014, "Member 'BP_CharacterReactionSystem_C_ExecuteUbergraph_BP_CharacterReactionSystem::K2Node_CustomEvent_NewValue' has a wrong offset!");

// Function BP_CharacterReactionSystem.BP_CharacterReactionSystem_C.GetAnyAllyCharacterExcept
// 0x0080 (0x0080 - 0x0000)
struct BP_CharacterReactionSystem_C_GetAnyAllyCharacterExcept final
{
public:
	class UAC_jRPG_CharacterBattleStats_C*        Except;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ABP_jRPG_Character_Battle_Base_C*       CharacterActor;                                    // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_jRPG_Character_Battle_Base_C*> Temp_wildcard_Temp_buffer_array_Variable;        // 0x0020(0x0010)(ConstParm, ReferenceParm)
	TArray<class ABP_jRPG_Character_Battle_Base_C*> Temp_wildcard_We_need_a_second_array_to_store_the_result_and_be_able_to_wipe_the_first__buffer__array_Variable; // 0x0030(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_Array_IsNotEmpty_ReturnValue;             // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_jRPG_Character_Battle_Base_C*       CallFunc_Array_Random_OutItem;                     // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Random_OutIndex;                    // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAC_jRPG_BattleManager_C*               CallFunc_GetBattleManager_ReturnValue;             // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_jRPG_Character_Battle_Base_C*       CallFunc_Array_Get_Item;                           // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualsObjects_ReturnValue;                // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CharacterReactionSystem_C_GetAnyAllyCharacterExcept) == 0x000008, "Wrong alignment on BP_CharacterReactionSystem_C_GetAnyAllyCharacterExcept");
static_assert(sizeof(BP_CharacterReactionSystem_C_GetAnyAllyCharacterExcept) == 0x000080, "Wrong size on BP_CharacterReactionSystem_C_GetAnyAllyCharacterExcept");
static_assert(offsetof(BP_CharacterReactionSystem_C_GetAnyAllyCharacterExcept, Except) == 0x000000, "Member 'BP_CharacterReactionSystem_C_GetAnyAllyCharacterExcept::Except' has a wrong offset!");
static_assert(offsetof(BP_CharacterReactionSystem_C_GetAnyAllyCharacterExcept, CharacterActor) == 0x000008, "Member 'BP_CharacterReactionSystem_C_GetAnyAllyCharacterExcept::CharacterActor' has a wrong offset!");
static_assert(offsetof(BP_CharacterReactionSystem_C_GetAnyAllyCharacterExcept, Temp_int_Loop_Counter_Variable) == 0x000010, "Member 'BP_CharacterReactionSystem_C_GetAnyAllyCharacterExcept::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_CharacterReactionSystem_C_GetAnyAllyCharacterExcept, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'BP_CharacterReactionSystem_C_GetAnyAllyCharacterExcept::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterReactionSystem_C_GetAnyAllyCharacterExcept, Temp_int_Array_Index_Variable) == 0x000018, "Member 'BP_CharacterReactionSystem_C_GetAnyAllyCharacterExcept::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_CharacterReactionSystem_C_GetAnyAllyCharacterExcept, Temp_wildcard_Temp_buffer_array_Variable) == 0x000020, "Member 'BP_CharacterReactionSystem_C_GetAnyAllyCharacterExcept::Temp_wildcard_Temp_buffer_array_Variable' has a wrong offset!");
static_assert(offsetof(BP_CharacterReactionSystem_C_GetAnyAllyCharacterExcept, Temp_wildcard_We_need_a_second_array_to_store_the_result_and_be_able_to_wipe_the_first__buffer__array_Variable) == 0x000030, "Member 'BP_CharacterReactionSystem_C_GetAnyAllyCharacterExcept::Temp_wildcard_We_need_a_second_array_to_store_the_result_and_be_able_to_wipe_the_first__buffer__array_Variable' has a wrong offset!");
static_assert(offsetof(BP_CharacterReactionSystem_C_GetAnyAllyCharacterExcept, CallFunc_Array_IsNotEmpty_ReturnValue) == 0x000040, "Member 'BP_CharacterReactionSystem_C_GetAnyAllyCharacterExcept::CallFunc_Array_IsNotEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterReactionSystem_C_GetAnyAllyCharacterExcept, CallFunc_Array_Random_OutItem) == 0x000048, "Member 'BP_CharacterReactionSystem_C_GetAnyAllyCharacterExcept::CallFunc_Array_Random_OutItem' has a wrong offset!");
static_assert(offsetof(BP_CharacterReactionSystem_C_GetAnyAllyCharacterExcept, CallFunc_Array_Random_OutIndex) == 0x000050, "Member 'BP_CharacterReactionSystem_C_GetAnyAllyCharacterExcept::CallFunc_Array_Random_OutIndex' has a wrong offset!");
static_assert(offsetof(BP_CharacterReactionSystem_C_GetAnyAllyCharacterExcept, CallFunc_GetBattleManager_ReturnValue) == 0x000058, "Member 'BP_CharacterReactionSystem_C_GetAnyAllyCharacterExcept::CallFunc_GetBattleManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterReactionSystem_C_GetAnyAllyCharacterExcept, CallFunc_Array_Length_ReturnValue) == 0x000060, "Member 'BP_CharacterReactionSystem_C_GetAnyAllyCharacterExcept::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterReactionSystem_C_GetAnyAllyCharacterExcept, CallFunc_Array_Get_Item) == 0x000068, "Member 'BP_CharacterReactionSystem_C_GetAnyAllyCharacterExcept::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_CharacterReactionSystem_C_GetAnyAllyCharacterExcept, CallFunc_Less_IntInt_ReturnValue) == 0x000070, "Member 'BP_CharacterReactionSystem_C_GetAnyAllyCharacterExcept::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterReactionSystem_C_GetAnyAllyCharacterExcept, CallFunc_Array_Add_ReturnValue) == 0x000074, "Member 'BP_CharacterReactionSystem_C_GetAnyAllyCharacterExcept::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterReactionSystem_C_GetAnyAllyCharacterExcept, CallFunc_EqualsObjects_ReturnValue) == 0x000078, "Member 'BP_CharacterReactionSystem_C_GetAnyAllyCharacterExcept::CallFunc_EqualsObjects_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterReactionSystem_C_GetAnyAllyCharacterExcept, CallFunc_Not_PreBool_ReturnValue) == 0x000079, "Member 'BP_CharacterReactionSystem_C_GetAnyAllyCharacterExcept::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function BP_CharacterReactionSystem.BP_CharacterReactionSystem_C.GetBattleLineSettings
// 0x0008 (0x0008 - 0x0000)
struct BP_CharacterReactionSystem_C_GetBattleLineSettings final
{
public:
	class UBP_BattleLineSettings_C*               Settings;                                          // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CharacterReactionSystem_C_GetBattleLineSettings) == 0x000008, "Wrong alignment on BP_CharacterReactionSystem_C_GetBattleLineSettings");
static_assert(sizeof(BP_CharacterReactionSystem_C_GetBattleLineSettings) == 0x000008, "Wrong size on BP_CharacterReactionSystem_C_GetBattleLineSettings");
static_assert(offsetof(BP_CharacterReactionSystem_C_GetBattleLineSettings, Settings) == 0x000000, "Member 'BP_CharacterReactionSystem_C_GetBattleLineSettings::Settings' has a wrong offset!");

// Function BP_CharacterReactionSystem.BP_CharacterReactionSystem_C.Internal_EndGatherBattleLines_OLD
// 0x0178 (0x0178 - 0x0000)
struct BP_CharacterReactionSystem_C_Internal_EndGatherBattleLines_OLD final
{
public:
	int32                                         local_rolledIndex;                                 // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        local_roll;                                        // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<double>                                local_sumedProbabilitiesList;                      // 0x0010(0x0010)(Edit, BlueprintVisible)
	double                                        local_probabilitiesTotal;                          // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FS_BattleLinePoolCandidate>     local_poolCandidates;                              // 0x0028(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	TArray<class ABP_jRPG_Character_Battle_Base_C*> Temp_wildcard_Variable;                          // 0x0038(0x0010)(ReferenceParm)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_jRPG_Character_Battle_Base_C*       CallFunc_Array_Get_Item;                           // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_BattleLinesModel_Base_C*            CallFunc_GetBattleLineModel_ReturnValue;           // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FS_BattleLinePoolCandidate>     CallFunc_EndGatherPools_PoolCandidates;            // 0x0080(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A5[0x3];                                       // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAC_jRPG_BattleManager_C*               CallFunc_GetBattleManager_ReturnValue;             // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_jRPG_Character_Battle_Base_C*> CallFunc_GetAllAliveCharacters_AllCharacters;    // 0x00B0(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue;           // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_BattleLinePoolCandidate             CallFunc_Array_Get_Item_1;                         // 0x00D8(0x0020)(ContainsInstancedReference, HasGetValueTypeHash)
	class UAC_jRPG_CharacterBattleStats_C*        CallFunc_GetOwnerCharacterStats_OwnerCharacterStats; // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FS_BattleLine                          CallFunc_RollFromPool_BattleLine;                  // 0x0100(0x0010)(NoDestructor, HasGetValueTypeHash)
	class ABP_jRPG_Character_Battle_Base_C*       CallFunc_GetCharacterBattleBase_jRPG_CharacterBattleBase; // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetCharacterBattleBase_IsValid;           // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AudioCharacter_BattleManager_C*     CallFunc_GetCharacterAudioManager_ReturnValue;     // 0x0120(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Array_Get_Item_2;                         // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x0134(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_135[0x3];                                      // 0x0135(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x013C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x013D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13E[0x2];                                      // 0x013E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_BattleLinePoolCandidate             CallFunc_Array_Get_Item_3;                         // 0x0140(0x0020)(ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0164(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_165[0x3];                                      // 0x0165(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CharacterReactionSystem_C_Internal_EndGatherBattleLines_OLD) == 0x000008, "Wrong alignment on BP_CharacterReactionSystem_C_Internal_EndGatherBattleLines_OLD");
static_assert(sizeof(BP_CharacterReactionSystem_C_Internal_EndGatherBattleLines_OLD) == 0x000178, "Wrong size on BP_CharacterReactionSystem_C_Internal_EndGatherBattleLines_OLD");
static_assert(offsetof(BP_CharacterReactionSystem_C_Internal_EndGatherBattleLines_OLD, local_rolledIndex) == 0x000000, "Member 'BP_CharacterReactionSystem_C_Internal_EndGatherBattleLines_OLD::local_rolledIndex' has a wrong offset!");
static_assert(offsetof(BP_CharacterReactionSystem_C_Internal_EndGatherBattleLines_OLD, local_roll) == 0x000008, "Member 'BP_CharacterReactionSystem_C_Internal_EndGatherBattleLines_OLD::local_roll' has a wrong offset!");
static_assert(offsetof(BP_CharacterReactionSystem_C_Internal_EndGatherBattleLines_OLD, local_sumedProbabilitiesList) == 0x000010, "Member 'BP_CharacterReactionSystem_C_Internal_EndGatherBattleLines_OLD::local_sumedProbabilitiesList' has a wrong offset!");
static_assert(offsetof(BP_CharacterReactionSystem_C_Internal_EndGatherBattleLines_OLD, local_probabilitiesTotal) == 0x000020, "Member 'BP_CharacterReactionSystem_C_Internal_EndGatherBattleLines_OLD::local_probabilitiesTotal' has a wrong offset!");
static_assert(offsetof(BP_CharacterReactionSystem_C_Internal_EndGatherBattleLines_OLD, local_poolCandidates) == 0x000028, "Member 'BP_CharacterReactionSystem_C_Internal_EndGatherBattleLines_OLD::local_poolCandidates' has a wrong offset!");
static_assert(offsetof(BP_CharacterReactionSystem_C_Internal_EndGatherBattleLines_OLD, Temp_wildcard_Variable) == 0x000038, "Member 'BP_CharacterReactionSystem_C_Internal_EndGatherBattleLines_OLD::Temp_wildcard_Variable' has a wrong offset!");
static_assert(offsetof(BP_CharacterReactionSystem_C_Internal_EndGatherBattleLines_OLD, Temp_int_Loop_Counter_Variable) == 0x000048, "Member 'BP_CharacterReactionSystem_C_Internal_EndGatherBattleLines_OLD::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_CharacterReactionSystem_C_Internal_EndGatherBattleLines_OLD, CallFunc_Array_Length_ReturnValue) == 0x00004C, "Member 'BP_CharacterReactionSystem_C_Internal_EndGatherBattleLines_OLD::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterReactionSystem_C_Internal_EndGatherBattleLines_OLD, CallFunc_Add_IntInt_ReturnValue) == 0x000050, "Member 'BP_CharacterReactionSystem_C_Internal_EndGatherBattleLines_OLD::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterReactionSystem_C_Internal_EndGatherBattleLines_OLD, Temp_bool_True_if_break_was_hit_Variable) == 0x000054, "Member 'BP_CharacterReactionSystem_C_Internal_EndGatherBattleLines_OLD::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(BP_CharacterReactionSystem_C_Internal_EndGatherBattleLines_OLD, Temp_int_Array_Index_Variable) == 0x000058, "Member 'BP_CharacterReactionSystem_C_Internal_EndGatherBattleLines_OLD::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_CharacterReactionSystem_C_Internal_EndGatherBattleLines_OLD, CallFunc_Not_PreBool_ReturnValue) == 0x00005C, "Member 'BP_CharacterReactionSystem_C_Internal_EndGatherBattleLines_OLD::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterReactionSystem_C_Internal_EndGatherBattleLines_OLD, Temp_int_Array_Index_Variable_1) == 0x000060, "Member 'BP_CharacterReactionSystem_C_Internal_EndGatherBattleLines_OLD::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_CharacterReactionSystem_C_Internal_EndGatherBattleLines_OLD, Temp_int_Loop_Counter_Variable_1) == 0x000064, "Member 'BP_CharacterReactionSystem_C_Internal_EndGatherBattleLines_OLD::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_CharacterReactionSystem_C_Internal_EndGatherBattleLines_OLD, CallFunc_Array_Get_Item) == 0x000068, "Member 'BP_CharacterReactionSystem_C_Internal_EndGatherBattleLines_OLD::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_CharacterReactionSystem_C_Internal_EndGatherBattleLines_OLD, CallFunc_GetBattleLineModel_ReturnValue) == 0x000070, "Member 'BP_CharacterReactionSystem_C_Internal_EndGatherBattleLines_OLD::CallFunc_GetBattleLineModel_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterReactionSystem_C_Internal_EndGatherBattleLines_OLD, CallFunc_Less_IntInt_ReturnValue) == 0x000078, "Member 'BP_CharacterReactionSystem_C_Internal_EndGatherBattleLines_OLD::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterReactionSystem_C_Internal_EndGatherBattleLines_OLD, CallFunc_EndGatherPools_PoolCandidates) == 0x000080, "Member 'BP_CharacterReactionSystem_C_Internal_EndGatherBattleLines_OLD::CallFunc_EndGatherPools_PoolCandidates' has a wrong offset!");
static_assert(offsetof(BP_CharacterReactionSystem_C_Internal_EndGatherBattleLines_OLD, CallFunc_IsValid_ReturnValue) == 0x000090, "Member 'BP_CharacterReactionSystem_C_Internal_EndGatherBattleLines_OLD::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterReactionSystem_C_Internal_EndGatherBattleLines_OLD, CallFunc_Add_IntInt_ReturnValue_1) == 0x000094, "Member 'BP_CharacterReactionSystem_C_Internal_EndGatherBattleLines_OLD::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CharacterReactionSystem_C_Internal_EndGatherBattleLines_OLD, Temp_int_Loop_Counter_Variable_2) == 0x000098, "Member 'BP_CharacterReactionSystem_C_Internal_EndGatherBattleLines_OLD::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_CharacterReactionSystem_C_Internal_EndGatherBattleLines_OLD, CallFunc_Add_IntInt_ReturnValue_2) == 0x00009C, "Member 'BP_CharacterReactionSystem_C_Internal_EndGatherBattleLines_OLD::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CharacterReactionSystem_C_Internal_EndGatherBattleLines_OLD, Temp_int_Array_Index_Variable_2) == 0x0000A0, "Member 'BP_CharacterReactionSystem_C_Internal_EndGatherBattleLines_OLD::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_CharacterReactionSystem_C_Internal_EndGatherBattleLines_OLD, CallFunc_NotEqual_IntInt_ReturnValue) == 0x0000A4, "Member 'BP_CharacterReactionSystem_C_Internal_EndGatherBattleLines_OLD::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterReactionSystem_C_Internal_EndGatherBattleLines_OLD, CallFunc_GetBattleManager_ReturnValue) == 0x0000A8, "Member 'BP_CharacterReactionSystem_C_Internal_EndGatherBattleLines_OLD::CallFunc_GetBattleManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterReactionSystem_C_Internal_EndGatherBattleLines_OLD, CallFunc_GetAllAliveCharacters_AllCharacters) == 0x0000B0, "Member 'BP_CharacterReactionSystem_C_Internal_EndGatherBattleLines_OLD::CallFunc_GetAllAliveCharacters_AllCharacters' has a wrong offset!");
static_assert(offsetof(BP_CharacterReactionSystem_C_Internal_EndGatherBattleLines_OLD, CallFunc_Array_Length_ReturnValue_1) == 0x0000C0, "Member 'BP_CharacterReactionSystem_C_Internal_EndGatherBattleLines_OLD::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CharacterReactionSystem_C_Internal_EndGatherBattleLines_OLD, CallFunc_Conv_IntToDouble_ReturnValue) == 0x0000C8, "Member 'BP_CharacterReactionSystem_C_Internal_EndGatherBattleLines_OLD::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterReactionSystem_C_Internal_EndGatherBattleLines_OLD, CallFunc_RandomFloatInRange_ReturnValue) == 0x0000D0, "Member 'BP_CharacterReactionSystem_C_Internal_EndGatherBattleLines_OLD::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterReactionSystem_C_Internal_EndGatherBattleLines_OLD, CallFunc_Array_Get_Item_1) == 0x0000D8, "Member 'BP_CharacterReactionSystem_C_Internal_EndGatherBattleLines_OLD::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_CharacterReactionSystem_C_Internal_EndGatherBattleLines_OLD, CallFunc_GetOwnerCharacterStats_OwnerCharacterStats) == 0x0000F8, "Member 'BP_CharacterReactionSystem_C_Internal_EndGatherBattleLines_OLD::CallFunc_GetOwnerCharacterStats_OwnerCharacterStats' has a wrong offset!");
static_assert(offsetof(BP_CharacterReactionSystem_C_Internal_EndGatherBattleLines_OLD, CallFunc_RollFromPool_BattleLine) == 0x000100, "Member 'BP_CharacterReactionSystem_C_Internal_EndGatherBattleLines_OLD::CallFunc_RollFromPool_BattleLine' has a wrong offset!");
static_assert(offsetof(BP_CharacterReactionSystem_C_Internal_EndGatherBattleLines_OLD, CallFunc_GetCharacterBattleBase_jRPG_CharacterBattleBase) == 0x000110, "Member 'BP_CharacterReactionSystem_C_Internal_EndGatherBattleLines_OLD::CallFunc_GetCharacterBattleBase_jRPG_CharacterBattleBase' has a wrong offset!");
static_assert(offsetof(BP_CharacterReactionSystem_C_Internal_EndGatherBattleLines_OLD, CallFunc_GetCharacterBattleBase_IsValid) == 0x000118, "Member 'BP_CharacterReactionSystem_C_Internal_EndGatherBattleLines_OLD::CallFunc_GetCharacterBattleBase_IsValid' has a wrong offset!");
static_assert(offsetof(BP_CharacterReactionSystem_C_Internal_EndGatherBattleLines_OLD, CallFunc_GetCharacterAudioManager_ReturnValue) == 0x000120, "Member 'BP_CharacterReactionSystem_C_Internal_EndGatherBattleLines_OLD::CallFunc_GetCharacterAudioManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterReactionSystem_C_Internal_EndGatherBattleLines_OLD, CallFunc_Array_Get_Item_2) == 0x000128, "Member 'BP_CharacterReactionSystem_C_Internal_EndGatherBattleLines_OLD::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(BP_CharacterReactionSystem_C_Internal_EndGatherBattleLines_OLD, CallFunc_Array_Add_ReturnValue) == 0x000130, "Member 'BP_CharacterReactionSystem_C_Internal_EndGatherBattleLines_OLD::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterReactionSystem_C_Internal_EndGatherBattleLines_OLD, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x000134, "Member 'BP_CharacterReactionSystem_C_Internal_EndGatherBattleLines_OLD::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterReactionSystem_C_Internal_EndGatherBattleLines_OLD, CallFunc_Array_Length_ReturnValue_2) == 0x000138, "Member 'BP_CharacterReactionSystem_C_Internal_EndGatherBattleLines_OLD::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CharacterReactionSystem_C_Internal_EndGatherBattleLines_OLD, CallFunc_Less_IntInt_ReturnValue_1) == 0x00013C, "Member 'BP_CharacterReactionSystem_C_Internal_EndGatherBattleLines_OLD::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CharacterReactionSystem_C_Internal_EndGatherBattleLines_OLD, CallFunc_BooleanAND_ReturnValue) == 0x00013D, "Member 'BP_CharacterReactionSystem_C_Internal_EndGatherBattleLines_OLD::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterReactionSystem_C_Internal_EndGatherBattleLines_OLD, CallFunc_Array_Get_Item_3) == 0x000140, "Member 'BP_CharacterReactionSystem_C_Internal_EndGatherBattleLines_OLD::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(BP_CharacterReactionSystem_C_Internal_EndGatherBattleLines_OLD, CallFunc_Array_Length_ReturnValue_3) == 0x000160, "Member 'BP_CharacterReactionSystem_C_Internal_EndGatherBattleLines_OLD::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_CharacterReactionSystem_C_Internal_EndGatherBattleLines_OLD, CallFunc_Less_IntInt_ReturnValue_2) == 0x000164, "Member 'BP_CharacterReactionSystem_C_Internal_EndGatherBattleLines_OLD::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CharacterReactionSystem_C_Internal_EndGatherBattleLines_OLD, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000168, "Member 'BP_CharacterReactionSystem_C_Internal_EndGatherBattleLines_OLD::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterReactionSystem_C_Internal_EndGatherBattleLines_OLD, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000170, "Member 'BP_CharacterReactionSystem_C_Internal_EndGatherBattleLines_OLD::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");

// Function BP_CharacterReactionSystem.BP_CharacterReactionSystem_C.LogPerCharacterReaction
// 0x0148 (0x0148 - 0x0000)
struct BP_CharacterReactionSystem_C_LogPerCharacterReaction final
{
public:
	class FString                                 Reaction;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class UAC_jRPG_CharacterBattleStats_C*        ReactingCharacter;                                 // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAC_jRPG_CharacterBattleStats_C*        SubjectCharacter;                                  // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0020(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0030(0x0048)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_NameToText_ReturnValue;              // 0x0078(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0088(0x0048)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_NameToText_ReturnValue_1;            // 0x00D0(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x00E0(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0128(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0138(0x0010)()
};
static_assert(alignof(BP_CharacterReactionSystem_C_LogPerCharacterReaction) == 0x000008, "Wrong alignment on BP_CharacterReactionSystem_C_LogPerCharacterReaction");
static_assert(sizeof(BP_CharacterReactionSystem_C_LogPerCharacterReaction) == 0x000148, "Wrong size on BP_CharacterReactionSystem_C_LogPerCharacterReaction");
static_assert(offsetof(BP_CharacterReactionSystem_C_LogPerCharacterReaction, Reaction) == 0x000000, "Member 'BP_CharacterReactionSystem_C_LogPerCharacterReaction::Reaction' has a wrong offset!");
static_assert(offsetof(BP_CharacterReactionSystem_C_LogPerCharacterReaction, ReactingCharacter) == 0x000010, "Member 'BP_CharacterReactionSystem_C_LogPerCharacterReaction::ReactingCharacter' has a wrong offset!");
static_assert(offsetof(BP_CharacterReactionSystem_C_LogPerCharacterReaction, SubjectCharacter) == 0x000018, "Member 'BP_CharacterReactionSystem_C_LogPerCharacterReaction::SubjectCharacter' has a wrong offset!");
static_assert(offsetof(BP_CharacterReactionSystem_C_LogPerCharacterReaction, CallFunc_Conv_StringToText_ReturnValue) == 0x000020, "Member 'BP_CharacterReactionSystem_C_LogPerCharacterReaction::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterReactionSystem_C_LogPerCharacterReaction, K2Node_MakeStruct_FormatArgumentData) == 0x000030, "Member 'BP_CharacterReactionSystem_C_LogPerCharacterReaction::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_CharacterReactionSystem_C_LogPerCharacterReaction, CallFunc_Conv_NameToText_ReturnValue) == 0x000078, "Member 'BP_CharacterReactionSystem_C_LogPerCharacterReaction::CallFunc_Conv_NameToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterReactionSystem_C_LogPerCharacterReaction, K2Node_MakeStruct_FormatArgumentData_1) == 0x000088, "Member 'BP_CharacterReactionSystem_C_LogPerCharacterReaction::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BP_CharacterReactionSystem_C_LogPerCharacterReaction, CallFunc_Conv_NameToText_ReturnValue_1) == 0x0000D0, "Member 'BP_CharacterReactionSystem_C_LogPerCharacterReaction::CallFunc_Conv_NameToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CharacterReactionSystem_C_LogPerCharacterReaction, K2Node_MakeStruct_FormatArgumentData_2) == 0x0000E0, "Member 'BP_CharacterReactionSystem_C_LogPerCharacterReaction::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(BP_CharacterReactionSystem_C_LogPerCharacterReaction, K2Node_MakeArray_Array) == 0x000128, "Member 'BP_CharacterReactionSystem_C_LogPerCharacterReaction::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_CharacterReactionSystem_C_LogPerCharacterReaction, CallFunc_Format_ReturnValue) == 0x000138, "Member 'BP_CharacterReactionSystem_C_LogPerCharacterReaction::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function BP_CharacterReactionSystem.BP_CharacterReactionSystem_C.OnBattleEnds
// 0x0038 (0x0038 - 0x0000)
struct BP_CharacterReactionSystem_C_OnBattleEnds final
{
public:
	class UAC_jRPG_CharacterBattleStats_C*        local_validCharacter;                              // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_jRPG_Character_Battle_Base_C*       CallFunc_GetCharacterBattleBase_jRPG_CharacterBattleBase; // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetCharacterBattleBase_IsValid;           // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAC_jRPG_BattleManager_C*               CallFunc_GetBattleManager_ReturnValue;             // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ABP_jRPG_Character_Battle_Base_C*       CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CharacterReactionSystem_C_OnBattleEnds) == 0x000008, "Wrong alignment on BP_CharacterReactionSystem_C_OnBattleEnds");
static_assert(sizeof(BP_CharacterReactionSystem_C_OnBattleEnds) == 0x000038, "Wrong size on BP_CharacterReactionSystem_C_OnBattleEnds");
static_assert(offsetof(BP_CharacterReactionSystem_C_OnBattleEnds, local_validCharacter) == 0x000000, "Member 'BP_CharacterReactionSystem_C_OnBattleEnds::local_validCharacter' has a wrong offset!");
static_assert(offsetof(BP_CharacterReactionSystem_C_OnBattleEnds, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'BP_CharacterReactionSystem_C_OnBattleEnds::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterReactionSystem_C_OnBattleEnds, CallFunc_GetCharacterBattleBase_jRPG_CharacterBattleBase) == 0x000010, "Member 'BP_CharacterReactionSystem_C_OnBattleEnds::CallFunc_GetCharacterBattleBase_jRPG_CharacterBattleBase' has a wrong offset!");
static_assert(offsetof(BP_CharacterReactionSystem_C_OnBattleEnds, CallFunc_GetCharacterBattleBase_IsValid) == 0x000018, "Member 'BP_CharacterReactionSystem_C_OnBattleEnds::CallFunc_GetCharacterBattleBase_IsValid' has a wrong offset!");
static_assert(offsetof(BP_CharacterReactionSystem_C_OnBattleEnds, CallFunc_GetBattleManager_ReturnValue) == 0x000020, "Member 'BP_CharacterReactionSystem_C_OnBattleEnds::CallFunc_GetBattleManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterReactionSystem_C_OnBattleEnds, CallFunc_Array_Get_Item) == 0x000028, "Member 'BP_CharacterReactionSystem_C_OnBattleEnds::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_CharacterReactionSystem_C_OnBattleEnds, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'BP_CharacterReactionSystem_C_OnBattleEnds::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterReactionSystem_C_OnBattleEnds, CallFunc_Greater_IntInt_ReturnValue) == 0x000034, "Member 'BP_CharacterReactionSystem_C_OnBattleEnds::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterReactionSystem_C_OnBattleEnds, CallFunc_IsValid_ReturnValue_1) == 0x000035, "Member 'BP_CharacterReactionSystem_C_OnBattleEnds::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function BP_CharacterReactionSystem.BP_CharacterReactionSystem_C.OnBattleStart
// 0x0018 (0x0018 - 0x0000)
struct BP_CharacterReactionSystem_C_OnBattleStart final
{
public:
	class UAC_jRPG_BattleManager_C*               BattleManager;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UBP_BattleHeal_C* HealObject)> K2Node_CreateDelegate_OutputDelegate;        // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CharacterReactionSystem_C_OnBattleStart) == 0x000008, "Wrong alignment on BP_CharacterReactionSystem_C_OnBattleStart");
static_assert(sizeof(BP_CharacterReactionSystem_C_OnBattleStart) == 0x000018, "Wrong size on BP_CharacterReactionSystem_C_OnBattleStart");
static_assert(offsetof(BP_CharacterReactionSystem_C_OnBattleStart, BattleManager) == 0x000000, "Member 'BP_CharacterReactionSystem_C_OnBattleStart::BattleManager' has a wrong offset!");
static_assert(offsetof(BP_CharacterReactionSystem_C_OnBattleStart, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'BP_CharacterReactionSystem_C_OnBattleStart::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function BP_CharacterReactionSystem.BP_CharacterReactionSystem_C.OnCharacterBuffed
// 0x0040 (0x0040 - 0x0000)
struct BP_CharacterReactionSystem_C_OnCharacterBuffed final
{
public:
	class UBP_BattleBuffInstance_C*               BuffInstance;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAC_jRPG_CharacterBattleStats_C*        TargetCharacter;                                   // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAC_jRPG_CharacterBattleStats_C*        SourceCharacter;                                   // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RandomBool_ReturnValue;                   // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_jRPG_Character_Battle_Base_C*       CallFunc_GetCharacterBattleBase_jRPG_CharacterBattleBase; // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetCharacterBattleBase_IsValid;           // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_jRPG_Character_Battle_Base_C*       CallFunc_GetCharacterBattleBase_jRPG_CharacterBattleBase_1; // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetCharacterBattleBase_IsValid_1;         // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
