#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CharacterData

#include "Basic.hpp"

#include "FPassiveEffect_structs.hpp"
#include "S_Stats_AttributesScaling_structs.hpp"
#include "S_jRPG_OverdriveSource_structs.hpp"
#include "E_jRPG_ItemSubtype_structs.hpp"
#include "EAttributeScalingGrade_structs.hpp"
#include "Engine_structs.hpp"
#include "S_jRPG_Item_StaticData_structs.hpp"
#include "E_jRPG_StatType_structs.hpp"
#include "ECharacterAttribute_structs.hpp"
#include "FPassiveEffectProgression_structs.hpp"
#include "E_CustomizationItemType_structs.hpp"
#include "E_jRPG_ItemType_structs.hpp"
#include "FEquipmentSlot_structs.hpp"
#include "EAttackType_structs.hpp"
#include "S_WeaponDefinition_structs.hpp"
#include "ESkillElementOverride_structs.hpp"
#include "S_WeaponInstanceData_structs.hpp"
#include "S_CharacterCustomizationItemData_structs.hpp"
#include "ELearnSkillBlockedReason_structs.hpp"
#include "S_jRPG_CharacterSaveState_structs.hpp"
#include "FCharacterAttributeScalingList_structs.hpp"
#include "ESkillNodeState_structs.hpp"
#include "FSkillUnlockInfos_structs.hpp"
#include "FSkillUnlockData_structs.hpp"
#include "FCharacterStats_structs.hpp"
#include "FCharacterBattleAudioProfile_structs.hpp"
#include "S_PassiveEffectDisplayData_structs.hpp"
#include "E_Characters_structs.hpp"
#include "S_Stats_LevelScaling_structs.hpp"
#include "S_jRPG_CharacterDefinition_structs.hpp"


namespace SDK::Params
{

// Function BP_CharacterData.BP_CharacterData_C.AddExperience
// 0x0320 (0x0320 - 0x0000)
struct BP_CharacterData_C_AddExperience final
{
public:
	int32                                         XP;                                                // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         local_newLevel;                                    // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          local_hasLeveledUp;                                // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         local_addedXPInCurrentLevel;                       // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         local_remainingXPToAdd;                            // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue_1;            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0028(0x0048)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0070(0x0048)(HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetMaximumLevel_Level;                    // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C5[0x3];                                       // 0x00C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue_2;            // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x00D0(0x0048)(HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue_3;            // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetExperienceNeededToLevelUp_ExperienceNeeded; // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_124[0x4];                                      // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x0128(0x0048)(HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue_4;            // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_4;            // 0x0178(0x0048)(HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue_5;            // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue_6;            // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_5;            // 0x01D0(0x0048)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_6;            // 0x0218(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0260(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Conv_NameToText_ReturnValue;              // 0x0270(0x0010)()
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0280(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_7;            // 0x0290(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x02D8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x02E8(0x0010)()
	int32                                         CallFunc_GetExperienceNeededToLevelUp_ExperienceNeeded_1; // 0x02F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x02FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0300(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_301[0x3];                                      // 0x0301(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0304(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0308(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x030C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0310(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Min_ReturnValue;                          // 0x0314(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_1;        // 0x0318(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CharacterData_C_AddExperience) == 0x000008, "Wrong alignment on BP_CharacterData_C_AddExperience");
static_assert(sizeof(BP_CharacterData_C_AddExperience) == 0x000320, "Wrong size on BP_CharacterData_C_AddExperience");
static_assert(offsetof(BP_CharacterData_C_AddExperience, XP) == 0x000000, "Member 'BP_CharacterData_C_AddExperience::XP' has a wrong offset!");
static_assert(offsetof(BP_CharacterData_C_AddExperience, local_newLevel) == 0x000004, "Member 'BP_CharacterData_C_AddExperience::local_newLevel' has a wrong offset!");
static_assert(offsetof(BP_CharacterData_C_AddExperience, local_hasLeveledUp) == 0x000008, "Member 'BP_CharacterData_C_AddExperience::local_hasLeveledUp' has a wrong offset!");
static_assert(offsetof(BP_CharacterData_C_AddExperience, local_addedXPInCurrentLevel) == 0x00000C, "Member 'BP_CharacterData_C_AddExperience::local_addedXPInCurrentLevel' has a wrong offset!");
static_assert(offsetof(BP_CharacterData_C_AddExperience, local_remainingXPToAdd) == 0x000010, "Member 'BP_CharacterData_C_AddExperience::local_remainingXPToAdd' has a wrong offset!");
static_assert(offsetof(BP_CharacterData_C_AddExperience, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000018, "Member 'BP_CharacterData_C_AddExperience::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterData_C_AddExperience, CallFunc_Conv_IntToInt64_ReturnValue_1) == 0x000020, "Member 'BP_CharacterData_C_AddExperience::CallFunc_Conv_IntToInt64_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CharacterData_C_AddExperience, K2Node_MakeStruct_FormatArgumentData) == 0x000028, "Member 'BP_CharacterData_C_AddExperience::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_CharacterData_C_AddExperience, K2Node_MakeStruct_FormatArgumentData_1) == 0x000070, "Member 'BP_CharacterData_C_AddExperience::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BP_CharacterData_C_AddExperience, CallFunc_Greater_IntInt_ReturnValue) == 0x0000B8, "Member 'BP_CharacterData_C_AddExperience::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterData_C_AddExperience, Temp_int_Variable) == 0x0000BC, "Member 'BP_CharacterData_C_AddExperience::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_CharacterData_C_AddExperience, CallFunc_GetMaximumLevel_Level) == 0x0000C0, "Member 'BP_CharacterData_C_AddExperience::CallFunc_GetMaximumLevel_Level' has a wrong offset!");
static_assert(offsetof(BP_CharacterData_C_AddExperience, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x0000C4, "Member 'BP_CharacterData_C_AddExperience::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterData_C_AddExperience, CallFunc_Conv_IntToInt64_ReturnValue_2) == 0x0000C8, "Member 'BP_CharacterData_C_AddExperience::CallFunc_Conv_IntToInt64_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CharacterData_C_AddExperience, K2Node_MakeStruct_FormatArgumentData_2) == 0x0000D0, "Member 'BP_CharacterData_C_AddExperience::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(BP_CharacterData_C_AddExperience, CallFunc_Conv_IntToInt64_ReturnValue_3) == 0x000118, "Member 'BP_CharacterData_C_AddExperience::CallFunc_Conv_IntToInt64_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_CharacterData_C_AddExperience, CallFunc_GetExperienceNeededToLevelUp_ExperienceNeeded) == 0x000120, "Member 'BP_CharacterData_C_AddExperience::CallFunc_GetExperienceNeededToLevelUp_ExperienceNeeded' has a wrong offset!");
static_assert(offsetof(BP_CharacterData_C_AddExperience, K2Node_MakeStruct_FormatArgumentData_3) == 0x000128, "Member 'BP_CharacterData_C_AddExperience::K2Node_MakeStruct_FormatArgumentData_3' has a wrong offset!");
static_assert(offsetof(BP_CharacterData_C_AddExperience, CallFunc_Conv_IntToInt64_ReturnValue_4) == 0x000170, "Member 'BP_CharacterData_C_AddExperience::CallFunc_Conv_IntToInt64_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_CharacterData_C_AddExperience, K2Node_MakeStruct_FormatArgumentData_4) == 0x000178, "Member 'BP_CharacterData_C_AddExperience::K2Node_MakeStruct_FormatArgumentData_4' has a wrong offset!");
static_assert(offsetof(BP_CharacterData_C_AddExperience, CallFunc_Conv_IntToInt64_ReturnValue_5) == 0x0001C0, "Member 'BP_CharacterData_C_AddExperience::CallFunc_Conv_IntToInt64_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_CharacterData_C_AddExperience, CallFunc_Conv_IntToInt64_ReturnValue_6) == 0x0001C8, "Member 'BP_CharacterData_C_AddExperience::CallFunc_Conv_IntToInt64_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_CharacterData_C_AddExperience, K2Node_MakeStruct_FormatArgumentData_5) == 0x0001D0, "Member 'BP_CharacterData_C_AddExperience::K2Node_MakeStruct_FormatArgumentData_5' has a wrong offset!");
static_assert(offsetof(BP_CharacterData_C_AddExperience, K2Node_MakeStruct_FormatArgumentData_6) == 0x000218, "Member 'BP_CharacterData_C_AddExperience::K2Node_MakeStruct_FormatArgumentData_6' has a wrong offset!");
static_assert(offsetof(BP_CharacterData_C_AddExperience, K2Node_MakeArray_Array) == 0x000260, "Member 'BP_CharacterData_C_AddExperience::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_CharacterData_C_AddExperience, CallFunc_Conv_NameToText_ReturnValue) == 0x000270, "Member 'BP_CharacterData_C_AddExperience::CallFunc_Conv_NameToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterData_C_AddExperience, CallFunc_Format_ReturnValue) == 0x000280, "Member 'BP_CharacterData_C_AddExperience::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterData_C_AddExperience, K2Node_MakeStruct_FormatArgumentData_7) == 0x000290, "Member 'BP_CharacterData_C_AddExperience::K2Node_MakeStruct_FormatArgumentData_7' has a wrong offset!");
static_assert(offsetof(BP_CharacterData_C_AddExperience, K2Node_MakeArray_Array_1) == 0x0002D8, "Member 'BP_CharacterData_C_AddExperience::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BP_CharacterData_C_AddExperience, CallFunc_Format_ReturnValue_1) == 0x0002E8, "Member 'BP_CharacterData_C_AddExperience::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CharacterData_C_AddExperience, CallFunc_GetExperienceNeededToLevelUp_ExperienceNeeded_1) == 0x0002F8, "Member 'BP_CharacterData_C_AddExperience::CallFunc_GetExperienceNeededToLevelUp_ExperienceNeeded_1' has a wrong offset!");
static_assert(offsetof(BP_CharacterData_C_AddExperience, CallFunc_Subtract_IntInt_ReturnValue) == 0x0002FC, "Member 'BP_CharacterData_C_AddExperience::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterData_C_AddExperience, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000300, "Member 'BP_CharacterData_C_AddExperience::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterData_C_AddExperience, CallFunc_Add_IntInt_ReturnValue) == 0x000304, "Member 'BP_CharacterData_C_AddExperience::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterData_C_AddExperience, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000308, "Member 'BP_CharacterData_C_AddExperience::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CharacterData_C_AddExperience, CallFunc_Add_IntInt_ReturnValue_1) == 0x00030C, "Member 'BP_CharacterData_C_AddExperience::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CharacterData_C_AddExperience, CallFunc_Add_IntInt_ReturnValue_2) == 0x000310, "Member 'BP_CharacterData_C_AddExperience::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CharacterData_C_AddExperience, CallFunc_Min_ReturnValue) == 0x000314, "Member 'BP_CharacterData_C_AddExperience::CallFunc_Min_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterData_C_AddExperience, CallFunc_GreaterEqual_IntInt_ReturnValue_1) == 0x000318, "Member 'BP_CharacterData_C_AddExperience::CallFunc_GreaterEqual_IntInt_ReturnValue_1' has a wrong offset!");

// Function BP_CharacterData.BP_CharacterData_C.AddLuminaPointFromConsumable
// 0x0010 (0x0010 - 0x0000)
struct BP_CharacterData_C_AddLuminaPointFromConsumable final
{
public:
	class UBP_AchievementManager_C*               CallFunc_GetAchievementManager_ReturnValue;        // 0x0000(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CharacterData_C_AddLuminaPointFromConsumable) == 0x000008, "Wrong alignment on BP_CharacterData_C_AddLuminaPointFromConsumable");
static_assert(sizeof(BP_CharacterData_C_AddLuminaPointFromConsumable) == 0x000010, "Wrong size on BP_CharacterData_C_AddLuminaPointFromConsumable");
static_assert(offsetof(BP_CharacterData_C_AddLuminaPointFromConsumable, CallFunc_GetAchievementManager_ReturnValue) == 0x000000, "Member 'BP_CharacterData_C_AddLuminaPointFromConsumable::CallFunc_GetAchievementManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterData_C_AddLuminaPointFromConsumable, Temp_int_Variable) == 0x000008, "Member 'BP_CharacterData_C_AddLuminaPointFromConsumable::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_CharacterData_C_AddLuminaPointFromConsumable, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'BP_CharacterData_C_AddLuminaPointFromConsumable::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function BP_CharacterData.BP_CharacterData_C.ApplyCharacterCustomizationItem
// 0x0240 (0x0240 - 0x0000)
struct BP_CharacterData_C_ApplyCharacterCustomizationItem final
{
public:
	class FName                                   ItemName;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_NameToText_ReturnValue;              // 0x0008(0x0010)()
	class FText                                   CallFunc_Conv_NameToText_ReturnValue_1;            // 0x0018(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0028(0x0048)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0070(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00B8(0x0010)(ReferenceParm)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x00C8(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Format_ReturnValue;                       // 0x00D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Format_ReturnValue_1;                     // 0x00E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FS_jRPG_Item_StaticData                CallFunc_GetDataTableRowFromName_OutRow;           // 0x00F8(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_229[0x7];                                      // 0x0229(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_DataAsset_Item_CharacterCustomization_C* K2Node_DynamicCast_AsBP_Data_Asset_Item_Character_Customization; // 0x0230(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0239(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CharacterData_C_ApplyCharacterCustomizationItem) == 0x000008, "Wrong alignment on BP_CharacterData_C_ApplyCharacterCustomizationItem");
static_assert(sizeof(BP_CharacterData_C_ApplyCharacterCustomizationItem) == 0x000240, "Wrong size on BP_CharacterData_C_ApplyCharacterCustomizationItem");
static_assert(offsetof(BP_CharacterData_C_ApplyCharacterCustomizationItem, ItemName) == 0x000000, "Member 'BP_CharacterData_C_ApplyCharacterCustomizationItem::ItemName' has a wrong offset!");
static_assert(offsetof(BP_CharacterData_C_ApplyCharacterCustomizationItem, CallFunc_Conv_NameToText_ReturnValue) == 0x000008, "Member 'BP_CharacterData_C_ApplyCharacterCustomizationItem::CallFunc_Conv_NameToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterData_C_ApplyCharacterCustomizationItem, CallFunc_Conv_NameToText_ReturnValue_1) == 0x000018, "Member 'BP_CharacterData_C_ApplyCharacterCustomizationItem::CallFunc_Conv_NameToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CharacterData_C_ApplyCharacterCustomizationItem, K2Node_MakeStruct_FormatArgumentData) == 0x000028, "Member 'BP_CharacterData_C_ApplyCharacterCustomizationItem::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_CharacterData_C_ApplyCharacterCustomizationItem, K2Node_MakeStruct_FormatArgumentData_1) == 0x000070, "Member 'BP_CharacterData_C_ApplyCharacterCustomizationItem::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BP_CharacterData_C_ApplyCharacterCustomizationItem, K2Node_MakeArray_Array) == 0x0000B8, "Member 'BP_CharacterData_C_ApplyCharacterCustomizationItem::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_CharacterData_C_ApplyCharacterCustomizationItem, K2Node_MakeArray_Array_1) == 0x0000C8, "Member 'BP_CharacterData_C_ApplyCharacterCustomizationItem::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BP_CharacterData_C_ApplyCharacterCustomizationItem, CallFunc_Format_ReturnValue) == 0x0000D8, "Member 'BP_CharacterData_C_ApplyCharacterCustomizationItem::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterData_C_ApplyCharacterCustomizationItem, CallFunc_Format_ReturnValue_1) == 0x0000E8, "Member 'BP_CharacterData_C_ApplyCharacterCustomizationItem::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CharacterData_C_ApplyCharacterCustomizationItem, CallFunc_GetDataTableRowFromName_OutRow) == 0x0000F8, "Member 'BP_CharacterData_C_ApplyCharacterCustomizationItem::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BP_CharacterData_C_ApplyCharacterCustomizationItem, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000228, "Member 'BP_CharacterData_C_ApplyCharacterCustomizationItem::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterData_C_ApplyCharacterCustomizationItem, K2Node_DynamicCast_AsBP_Data_Asset_Item_Character_Customization) == 0x000230, "Member 'BP_CharacterData_C_ApplyCharacterCustomizationItem::K2Node_DynamicCast_AsBP_Data_Asset_Item_Character_Customization' has a wrong offset!");
static_assert(offsetof(BP_CharacterData_C_ApplyCharacterCustomizationItem, K2Node_DynamicCast_bSuccess) == 0x000238, "Member 'BP_CharacterData_C_ApplyCharacterCustomizationItem::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_CharacterData_C_ApplyCharacterCustomizationItem, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000239, "Member 'BP_CharacterData_C_ApplyCharacterCustomizationItem::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function BP_CharacterData.BP_CharacterData_C.AssignPointToAttribute
// 0x00A8 (0x00A8 - 0x0000)
struct BP_CharacterData_C_AssignPointToAttribute final
{
public:
	ECharacterAttribute                           Attribute;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetAttributePointsToAssign_ReturnValue;   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0020(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0030(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0078(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0088(0x0010)()
	int32                                         CallFunc_Map_Find_Value;                           // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9D[0x3];                                       // 0x009D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CharacterData_C_AssignPointToAttribute) == 0x000008, "Wrong alignment on BP_CharacterData_C_AssignPointToAttribute");
static_assert(sizeof(BP_CharacterData_C_AssignPointToAttribute) == 0x0000A8, "Wrong size on BP_CharacterData_C_AssignPointToAttribute");
static_assert(offsetof(BP_CharacterData_C_AssignPointToAttribute, Attribute) == 0x000000, "Member 'BP_CharacterData_C_AssignPointToAttribute::Attribute' has a wrong offset!");
static_assert(offsetof(BP_CharacterData_C_AssignPointToAttribute, CallFunc_GetAttributePointsToAssign_ReturnValue) == 0x000004, "Member 'BP_CharacterData_C_AssignPointToAttribute::CallFunc_GetAttributePointsToAssign_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterData_C_AssignPointToAttribute, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x000008, "Member 'BP_CharacterData_C_AssignPointToAttribute::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterData_C_AssignPointToAttribute, CallFunc_Greater_IntInt_ReturnValue) == 0x000018, "Member 'BP_CharacterData_C_AssignPointToAttribute::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterData_C_AssignPointToAttribute, CallFunc_Conv_StringToText_ReturnValue) == 0x000020, "Member 'BP_CharacterData_C_AssignPointToAttribute::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterData_C_AssignPointToAttribute, K2Node_MakeStruct_FormatArgumentData) == 0x000030, "Member 'BP_CharacterData_C_AssignPointToAttribute::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_CharacterData_C_AssignPointToAttribute, K2Node_MakeArray_Array) == 0x000078, "Member 'BP_CharacterData_C_AssignPointToAttribute::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_CharacterData_C_AssignPointToAttribute, CallFunc_Format_ReturnValue) == 0x000088, "Member 'BP_CharacterData_C_AssignPointToAttribute::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterData_C_AssignPointToAttribute, CallFunc_Map_Find_Value) == 0x000098, "Member 'BP_CharacterData_C_AssignPointToAttribute::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BP_CharacterData_C_AssignPointToAttribute, CallFunc_Map_Find_ReturnValue) == 0x00009C, "Member 'BP_CharacterData_C_AssignPointToAttribute::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterData_C_AssignPointToAttribute, CallFunc_Add_IntInt_ReturnValue) == 0x0000A0, "Member 'BP_CharacterData_C_AssignPointToAttribute::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function BP_CharacterData.BP_CharacterData_C.BPI_GetDependencies
// 0x0148 (0x0148 - 0x0000)
struct BP_CharacterData_C_BPI_GetDependencies final
{
public:
	TArray<TSoftClassPtr<class UClass>>           Classes;                                           // 0x0000(0x0010)(Parm, OutParm)
	TArray<TSoftObjectPtr<class UObject>>         Assets;                                            // 0x0010(0x0010)(Parm, OutParm)
	TArray<TScriptInterface<class IBPI_LoadingDependenciesSource_C>> ExternalDependencies;           // 0x0020(0x0010)(Parm, OutParm)
	TArray<TSoftClassPtr<class UClass>>           local_classes;                                     // 0x0030(0x0010)(Edit, BlueprintVisible)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TScriptInterface<class IBPI_LoadingDependenciesSource_C>> Temp_wildcard_Temp_buffer_array_Variable; // 0x0048(0x0010)(ConstParm, ReferenceParm)
	TArray<TScriptInterface<class IBPI_LoadingDependenciesSource_C>> Temp_wildcard_We_need_a_second_array_to_store_the_result_and_be_able_to_wipe_the_first__buffer__array_Variable; // 0x0058(0x0010)(ConstParm, ReferenceParm)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFPassiveEffect>                CallFunc_GetEquippedPassiveEffectsData_PassiveEffectDefinitions; // 0x0080(0x0010)(ReferenceParm)
	struct FFPassiveEffect                        CallFunc_Array_Get_Item;                           // 0x0090(0x0048)(HasGetValueTypeHash)
	TArray<class UBP_DataAsset_Skill_C*>          CallFunc_GetAllAvailableEquippedSkills_ReturnValue; // 0x00D8(0x0010)(ReferenceParm)
	class UBP_DataAsset_Skill_C*                  CallFunc_Array_Get_Item_1;                         // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_LoadingDependenciesSource_C> CallFunc_Array_Add_NewItem_CastInput;   // 0x00F0(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0104(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_105[0x3];                                      // 0x0105(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x010C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10D[0x3];                                      // 0x010D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0114(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_115[0x3];                                      // 0x0115(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftClassPtr<class UClass>                   CallFunc_GetBattleSoftClass_CharacterActorSoftClass; // 0x0118(0x0028)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CharacterData_C_BPI_GetDependencies) == 0x000008, "Wrong alignment on BP_CharacterData_C_BPI_GetDependencies");
static_assert(sizeof(BP_CharacterData_C_BPI_GetDependencies) == 0x000148, "Wrong size on BP_CharacterData_C_BPI_GetDependencies");
static_assert(offsetof(BP_CharacterData_C_BPI_GetDependencies, Classes) == 0x000000, "Member 'BP_CharacterData_C_BPI_GetDependencies::Classes' has a wrong offset!");
static_assert(offsetof(BP_CharacterData_C_BPI_GetDependencies, Assets) == 0x000010, "Member 'BP_CharacterData_C_BPI_GetDependencies::Assets' has a wrong offset!");
static_assert(offsetof(BP_CharacterData_C_BPI_GetDependencies, ExternalDependencies) == 0x000020, "Member 'BP_CharacterData_C_BPI_GetDependencies::ExternalDependencies' has a wrong offset!");
static_assert(offsetof(BP_CharacterData_C_BPI_GetDependencies, local_classes) == 0x000030, "Member 'BP_CharacterData_C_BPI_GetDependencies::local_classes' has a wrong offset!");
static_assert(offsetof(BP_CharacterData_C_BPI_GetDependencies, Temp_int_Array_Index_Variable) == 0x000040, "Member 'BP_CharacterData_C_BPI_GetDependencies::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_CharacterData_C_BPI_GetDependencies, Temp_wildcard_Temp_buffer_array_Variable) == 0x000048, "Member 'BP_CharacterData_C_BPI_GetDependencies::Temp_wildcard_Temp_buffer_array_Variable' has a wrong offset!");
static_assert(offsetof(BP_CharacterData_C_BPI_GetDependencies, Temp_wildcard_We_need_a_second_array_to_store_the_result_and_be_able_to_wipe_the_first__buffer__array_Variable) == 0x000058, "Member 'BP_CharacterData_C_BPI_GetDependencies::Temp_wildcard_We_need_a_second_array_to_store_the_result_and_be_able_to_wipe_the_first__buffer__array_Variable' has a wrong offset!");
static_assert(offsetof(BP_CharacterData_C_BPI_GetDependencies, Temp_int_Loop_Counter_Variable) == 0x000068, "Member 'BP_CharacterData_C_BPI_GetDependencies::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_CharacterData_C_BPI_GetDependencies, CallFunc_Add_IntInt_ReturnValue) == 0x00006C, "Member 'BP_CharacterData_C_BPI_GetDependencies::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterData_C_BPI_GetDependencies, Temp_int_Array_Index_Variable_1) == 0x000070, "Member 'BP_CharacterData_C_BPI_GetDependencies::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_CharacterData_C_BPI_GetDependencies, Temp_int_Loop_Counter_Variable_1) == 0x000074, "Member 'BP_CharacterData_C_BPI_GetDependencies::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_CharacterData_C_BPI_GetDependencies, CallFunc_Add_IntInt_ReturnValue_1) == 0x000078, "Member 'BP_CharacterData_C_BPI_GetDependencies::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CharacterData_C_BPI_GetDependencies, CallFunc_GetEquippedPassiveEffectsData_PassiveEffectDefinitions) == 0x000080, "Member 'BP_CharacterData_C_BPI_GetDependencies::CallFunc_GetEquippedPassiveEffectsData_PassiveEffectDefinitions' has a wrong offset!");
static_assert(offsetof(BP_CharacterData_C_BPI_GetDependencies, CallFunc_Array_Get_Item) == 0x000090, "Member 'BP_CharacterData_C_BPI_GetDependencies::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_CharacterData_C_BPI_GetDependencies, CallFunc_GetAllAvailableEquippedSkills_ReturnValue) == 0x0000D8, "Member 'BP_CharacterData_C_BPI_GetDependencies::CallFunc_GetAllAvailableEquippedSkills_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterData_C_BPI_GetDependencies, CallFunc_Array_Get_Item_1) == 0x0000E8, "Member 'BP_CharacterData_C_BPI_GetDependencies::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_CharacterData_C_BPI_GetDependencies, CallFunc_Array_Add_NewItem_CastInput) == 0x0000F0, "Member 'BP_CharacterData_C_BPI_GetDependencies::CallFunc_Array_Add_NewItem_CastInput' has a wrong offset!");
static_assert(offsetof(BP_CharacterData_C_BPI_GetDependencies, CallFunc_Array_Add_ReturnValue) == 0x000100, "Member 'BP_CharacterData_C_BPI_GetDependencies::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterData_C_BPI_GetDependencies, CallFunc_IsValid_ReturnValue) == 0x000104, "Member 'BP_CharacterData_C_BPI_GetDependencies::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterData_C_BPI_GetDependencies, CallFunc_Array_Length_ReturnValue) == 0x000108, "Member 'BP_CharacterData_C_BPI_GetDependencies::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterData_C_BPI_GetDependencies, CallFunc_Less_IntInt_ReturnValue) == 0x00010C, "Member 'BP_CharacterData_C_BPI_GetDependencies::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterData_C_BPI_GetDependencies, CallFunc_Array_Length_ReturnValue_1) == 0x000110, "Member 'BP_CharacterData_C_BPI_GetDependencies::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CharacterData_C_BPI_GetDependencies, CallFunc_Less_IntInt_ReturnValue_1) == 0x000114, "Member 'BP_CharacterData_C_BPI_GetDependencies::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CharacterData_C_BPI_GetDependencies, CallFunc_GetBattleSoftClass_CharacterActorSoftClass) == 0x000118, "Member 'BP_CharacterData_C_BPI_GetDependencies::CallFunc_GetBattleSoftClass_CharacterActorSoftClass' has a wrong offset!");
static_assert(offsetof(BP_CharacterData_C_BPI_GetDependencies, CallFunc_Array_Add_ReturnValue_1) == 0x000140, "Member 'BP_CharacterData_C_BPI_GetDependencies::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");

// Function BP_CharacterData.BP_CharacterData_C.CanAffordLuminaCost
// 0x0010 (0x0010 - 0x0000)
struct BP_CharacterData_C_CanAffordLuminaCost final
{
public:
	int32                                         LuminaCost;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPackagedForDistribution_ReturnValue;    // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetConsoleVariableBoolValue_ReturnValue;  // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetAvailableLuminaPoints_ReturnValue;     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CharacterData_C_CanAffordLuminaCost) == 0x000004, "Wrong alignment on BP_CharacterData_C_CanAffordLuminaCost");
static_assert(sizeof(BP_CharacterData_C_CanAffordLuminaCost) == 0x000010, "Wrong size on BP_CharacterData_C_CanAffordLuminaCost");
static_assert(offsetof(BP_CharacterData_C_CanAffordLuminaCost, LuminaCost) == 0x000000, "Member 'BP_CharacterData_C_CanAffordLuminaCost::LuminaCost' has a wrong offset!");
static_assert(offsetof(BP_CharacterData_C_CanAffordLuminaCost, ReturnValue) == 0x000004, "Member 'BP_CharacterData_C_CanAffordLuminaCost::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterData_C_CanAffordLuminaCost, CallFunc_IsPackagedForDistribution_ReturnValue) == 0x000005, "Member 'BP_CharacterData_C_CanAffordLuminaCost::CallFunc_IsPackagedForDistribution_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterData_C_CanAffordLuminaCost, CallFunc_GetConsoleVariableBoolValue_ReturnValue) == 0x000006, "Member 'BP_CharacterData_C_CanAffordLuminaCost::CallFunc_GetConsoleVariableBoolValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterData_C_CanAffordLuminaCost, CallFunc_GetAvailableLuminaPoints_ReturnValue) == 0x000008, "Member 'BP_CharacterData_C_CanAffordLuminaCost::CallFunc_GetAvailableLuminaPoints_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterData_C_CanAffordLuminaCost, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00000C, "Member 'BP_CharacterData_C_CanAffordLuminaCost::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");

// Function BP_CharacterData.BP_CharacterData_C.CanAffordSkillUnlock
// 0x0010 (0x0010 - 0x0000)
struct BP_CharacterData_C_CanAffordSkillUnlock final
{
public:
	class UBP_DataAsset_Skill_C*                  Skill;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanAffordSkillUnlock_ReturnValue;         // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CharacterData_C_CanAffordSkillUnlock) == 0x000008, "Wrong alignment on BP_CharacterData_C_CanAffordSkillUnlock");
static_assert(sizeof(BP_CharacterData_C_CanAffordSkillUnlock) == 0x000010, "Wrong size on BP_CharacterData_C_CanAffordSkillUnlock");
static_assert(offsetof(BP_CharacterData_C_CanAffordSkillUnlock, Skill) == 0x000000, "Member 'BP_CharacterData_C_CanAffordSkillUnlock::Skill' has a wrong offset!");
static_assert(offsetof(BP_CharacterData_C_CanAffordSkillUnlock, ReturnValue) == 0x000008, "Member 'BP_CharacterData_C_CanAffordSkillUnlock::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterData_C_CanAffordSkillUnlock, CallFunc_CanAffordSkillUnlock_ReturnValue) == 0x000009, "Member 'BP_CharacterData_C_CanAffordSkillUnlock::CallFunc_CanAffordSkillUnlock_ReturnValue' has a wrong offset!");

// Function BP_CharacterData.BP_CharacterData_C.CanEquipItem
// 0x0138 (0x0138 - 0x0000)
struct BP_CharacterData_C_CanEquipItem final
{
public:
	struct FS_jRPG_Item_StaticData                ItemData;                                          // 0x0000(0x0130)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0130(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0131(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Set_Contains_ReturnValue;                 // 0x0132(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0133(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CharacterData_C_CanEquipItem) == 0x000008, "Wrong alignment on BP_CharacterData_C_CanEquipItem");
static_assert(sizeof(BP_CharacterData_C_CanEquipItem) == 0x000138, "Wrong size on BP_CharacterData_C_CanEquipItem");
static_assert(offsetof(BP_CharacterData_C_CanEquipItem, ItemData) == 0x000000, "Member 'BP_CharacterData_C_CanEquipItem::ItemData' has a wrong offset!");
static_assert(offsetof(BP_CharacterData_C_CanEquipItem, ReturnValue) == 0x000130, "Member 'BP_CharacterData_C_CanEquipItem::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterData_C_CanEquipItem, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000131, "Member 'BP_CharacterData_C_CanEquipItem::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterData_C_CanEquipItem, CallFunc_Set_Contains_ReturnValue) == 0x000132, "Member 'BP_CharacterData_C_CanEquipItem::CallFunc_Set_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterData_C_CanEquipItem, CallFunc_BooleanOR_ReturnValue) == 0x000133, "Member 'BP_CharacterData_C_CanEquipItem::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function BP_CharacterData.BP_CharacterData_C.CanEquipLuminaPassive
// 0x0068 (0x0068 - 0x0000)
struct BP_CharacterData_C_CanEquipLuminaPassive final
{
public:
	struct FFPassiveEffect                        PassiveEffectDefinition;                           // 0x0000(0x0048)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	struct FFPassiveEffectProgression             PassiveEffectProgression;                          // 0x0048(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0058(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         EffectiveCost;                                     // 0x005C(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetEffectiveLuminaCost_ReturnValue;       // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanAffordLuminaCost_ReturnValue;          // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CharacterData_C_CanEquipLuminaPassive) == 0x000008, "Wrong alignment on BP_CharacterData_C_CanEquipLuminaPassive");
static_assert(sizeof(BP_CharacterData_C_CanEquipLuminaPassive) == 0x000068, "Wrong size on BP_CharacterData_C_CanEquipLuminaPassive");
static_assert(offsetof(BP_CharacterData_C_CanEquipLuminaPassive, PassiveEffectDefinition) == 0x000000, "Member 'BP_CharacterData_C_CanEquipLuminaPassive::PassiveEffectDefinition' has a wrong offset!");
static_assert(offsetof(BP_CharacterData_C_CanEquipLuminaPassive, PassiveEffectProgression) == 0x000048, "Member 'BP_CharacterData_C_CanEquipLuminaPassive::PassiveEffectProgression' has a wrong offset!");
static_assert(offsetof(BP_CharacterData_C_CanEquipLuminaPassive, ReturnValue) == 0x000058, "Member 'BP_CharacterData_C_CanEquipLuminaPassive::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterData_C_CanEquipLuminaPassive, EffectiveCost) == 0x00005C, "Member 'BP_CharacterData_C_CanEquipLuminaPassive::EffectiveCost' has a wrong offset!");
static_assert(offsetof(BP_CharacterData_C_CanEquipLuminaPassive, CallFunc_GetEffectiveLuminaCost_ReturnValue) == 0x000060, "Member 'BP_CharacterData_C_CanEquipLuminaPassive::CallFunc_GetEffectiveLuminaCost_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterData_C_CanEquipLuminaPassive, CallFunc_CanAffordLuminaCost_ReturnValue) == 0x000064, "Member 'BP_CharacterData_C_CanEquipLuminaPassive::CallFunc_CanAffordLuminaCost_ReturnValue' has a wrong offset!");

// Function BP_CharacterData.BP_CharacterData_C.CanLearnSkill
// 0x0010 (0x0010 - 0x0000)
struct BP_CharacterData_C_CanLearnSkill final
{
public:
	const class UBP_DataAsset_Skill_C*            Skill;                                             // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ELearnSkillBlockedReason                      BlockedReason;                                     // 0x0009(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanLearnSkill_ReturnValue;                // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ELearnSkillBlockedReason                      CallFunc_CanLearnSkill_BlockedReason;              // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CharacterData_C_CanLearnSkill) == 0x000008, "Wrong alignment on BP_CharacterData_C_CanLearnSkill");
static_assert(sizeof(BP_CharacterData_C_CanLearnSkill) == 0x000010, "Wrong size on BP_CharacterData_C_CanLearnSkill");
static_assert(offsetof(BP_CharacterData_C_CanLearnSkill, Skill) == 0x000000, "Member 'BP_CharacterData_C_CanLearnSkill::Skill' has a wrong offset!");
static_assert(offsetof(BP_CharacterData_C_CanLearnSkill, ReturnValue) == 0x000008, "Member 'BP_CharacterData_C_CanLearnSkill::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterData_C_CanLearnSkill, BlockedReason) == 0x000009, "Member 'BP_CharacterData_C_CanLearnSkill::BlockedReason' has a wrong offset!");
static_assert(offsetof(BP_CharacterData_C_CanLearnSkill, CallFunc_CanLearnSkill_ReturnValue) == 0x00000A, "Member 'BP_CharacterData_C_CanLearnSkill::CallFunc_CanLearnSkill_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterData_C_CanLearnSkill, CallFunc_CanLearnSkill_BlockedReason) == 0x00000B, "Member 'BP_CharacterData_C_CanLearnSkill::CallFunc_CanLearnSkill_BlockedReason' has a wrong offset!");

// Function BP_CharacterData.BP_CharacterData_C.CanLearnSkill_OLD
// 0x0048 (0x0048 - 0x0000)
struct BP_CharacterData_C_CanLearnSkill_OLD final
{
public:
	const class UBP_DataAsset_Skill_C*            Skill;                                             // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ELearnSkillBlockedReason                      BlockedReason;                                     // 0x0009(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B[0x1];                                        // 0x000B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetAvailableSkillPoints_ReturnValue;      // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFSkillUnlockInfos                     CallFunc_Map_Find_Value;                           // 0x0010(0x0030)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue_1;             // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0046(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CharacterData_C_CanLearnSkill_OLD) == 0x000008, "Wrong alignment on BP_CharacterData_C_CanLearnSkill_OLD");
static_assert(sizeof(BP_CharacterData_C_CanLearnSkill_OLD) == 0x000048, "Wrong size on BP_CharacterData_C_CanLearnSkill_OLD");
static_assert(offsetof(BP_CharacterData_C_CanLearnSkill_OLD, Skill) == 0x000000, "Member 'BP_CharacterData_C_CanLearnSkill_OLD::Skill' has a wrong offset!");
static_assert(offsetof(BP_CharacterData_C_CanLearnSkill_OLD, ReturnValue) == 0x000008, "Member 'BP_CharacterData_C_CanLearnSkill_OLD::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterData_C_CanLearnSkill_OLD, BlockedReason) == 0x000009, "Member 'BP_CharacterData_C_CanLearnSkill_OLD::BlockedReason' has a wrong offset!");
static_assert(offsetof(BP_CharacterData_C_CanLearnSkill_OLD, CallFunc_Array_Contains_ReturnValue) == 0x00000A, "Member 'BP_CharacterData_C_CanLearnSkill_OLD::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterData_C_CanLearnSkill_OLD, CallFunc_GetAvailableSkillPoints_ReturnValue) == 0x00000C, "Member 'BP_CharacterData_C_CanLearnSkill_OLD::CallFunc_GetAvailableSkillPoints_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterData_C_CanLearnSkill_OLD, CallFunc_Map_Find_Value) == 0x000010, "Member 'BP_CharacterData_C_CanLearnSkill_OLD::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BP_CharacterData_C_CanLearnSkill_OLD, CallFunc_Map_Find_ReturnValue) == 0x000040, "Member 'BP_CharacterData_C_CanLearnSkill_OLD::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterData_C_CanLearnSkill_OLD, CallFunc_Array_Contains_ReturnValue_1) == 0x000041, "Member 'BP_CharacterData_C_CanLearnSkill_OLD::CallFunc_Array_Contains_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CharacterData_C_CanLearnSkill_OLD, CallFunc_Greater_IntInt_ReturnValue) == 0x000042, "Member 'BP_CharacterData_C_CanLearnSkill_OLD::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterData_C_CanLearnSkill_OLD, CallFunc_IsValid_ReturnValue) == 0x000043, "Member 'BP_CharacterData_C_CanLearnSkill_OLD::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterData_C_CanLearnSkill_OLD, CallFunc_Not_PreBool_ReturnValue) == 0x000044, "Member 'BP_CharacterData_C_CanLearnSkill_OLD::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterData_C_CanLearnSkill_OLD, CallFunc_BooleanOR_ReturnValue) == 0x000045, "Member 'BP_CharacterData_C_CanLearnSkill_OLD::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterData_C_CanLearnSkill_OLD, CallFunc_Not_PreBool_ReturnValue_1) == 0x000046, "Member 'BP_CharacterData_C_CanLearnSkill_OLD::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");

// Function BP_CharacterData.BP_CharacterData_C.CanUpdateInternals
// 0x0002 (0x0002 - 0x0000)
struct BP_CharacterData_C_CanUpdateInternals final
{
public:
