#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ConditionalDataLayersManager

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "S_ConditionalDataLayers_structs.hpp"


namespace SDK::Params
{

// Function BP_ConditionalDataLayersManager.BP_ConditionalDataLayersManager_C.UnbindCondition
// 0x0080 (0x0080 - 0x0000)
struct BP_ConditionalDataLayersManager_C_UnbindCondition final
{
public:
	struct FS_ConditionalDataLayers               ConditionalDataLayers_0;                           // 0x0000(0x0070)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0070(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ConditionalDataLayersManager_C_UnbindCondition) == 0x000008, "Wrong alignment on BP_ConditionalDataLayersManager_C_UnbindCondition");
static_assert(sizeof(BP_ConditionalDataLayersManager_C_UnbindCondition) == 0x000080, "Wrong size on BP_ConditionalDataLayersManager_C_UnbindCondition");
static_assert(offsetof(BP_ConditionalDataLayersManager_C_UnbindCondition, ConditionalDataLayers_0) == 0x000000, "Member 'BP_ConditionalDataLayersManager_C_UnbindCondition::ConditionalDataLayers_0' has a wrong offset!");
static_assert(offsetof(BP_ConditionalDataLayersManager_C_UnbindCondition, K2Node_CreateDelegate_OutputDelegate) == 0x000070, "Member 'BP_ConditionalDataLayersManager_C_UnbindCondition::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function BP_ConditionalDataLayersManager.BP_ConditionalDataLayersManager_C.UnbindAllConditions
// 0x00A0 (0x00A0 - 0x0000)
struct BP_ConditionalDataLayersManager_C_UnbindAllConditions final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x000C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_jRPG_GI_Custom_C*                   CallFunc_GetCustomGI_ReturnValue;                  // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FS_ConditionalDataLayers               CallFunc_Array_Get_Item;                           // 0x0028(0x0070)(ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ConditionalDataLayersManager_C_UnbindAllConditions) == 0x000008, "Wrong alignment on BP_ConditionalDataLayersManager_C_UnbindAllConditions");
static_assert(sizeof(BP_ConditionalDataLayersManager_C_UnbindAllConditions) == 0x0000A0, "Wrong size on BP_ConditionalDataLayersManager_C_UnbindAllConditions");
static_assert(offsetof(BP_ConditionalDataLayersManager_C_UnbindAllConditions, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BP_ConditionalDataLayersManager_C_UnbindAllConditions::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_ConditionalDataLayersManager_C_UnbindAllConditions, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_ConditionalDataLayersManager_C_UnbindAllConditions::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_ConditionalDataLayersManager_C_UnbindAllConditions, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_ConditionalDataLayersManager_C_UnbindAllConditions::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConditionalDataLayersManager_C_UnbindAllConditions, K2Node_CreateDelegate_OutputDelegate) == 0x00000C, "Member 'BP_ConditionalDataLayersManager_C_UnbindAllConditions::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_ConditionalDataLayersManager_C_UnbindAllConditions, CallFunc_GetCustomGI_ReturnValue) == 0x000020, "Member 'BP_ConditionalDataLayersManager_C_UnbindAllConditions::CallFunc_GetCustomGI_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConditionalDataLayersManager_C_UnbindAllConditions, CallFunc_Array_Get_Item) == 0x000028, "Member 'BP_ConditionalDataLayersManager_C_UnbindAllConditions::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_ConditionalDataLayersManager_C_UnbindAllConditions, CallFunc_Array_Length_ReturnValue) == 0x000098, "Member 'BP_ConditionalDataLayersManager_C_UnbindAllConditions::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConditionalDataLayersManager_C_UnbindAllConditions, CallFunc_Less_IntInt_ReturnValue) == 0x00009C, "Member 'BP_ConditionalDataLayersManager_C_UnbindAllConditions::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function BP_ConditionalDataLayersManager.BP_ConditionalDataLayersManager_C.SetDataLayersRuntimeStateForEditor
// 0x0078 (0x0078 - 0x0000)
struct BP_ConditionalDataLayersManager_C_SetDataLayersRuntimeStateForEditor final
{
public:
	TArray<class UDataLayerAsset*>                DataLayers;                                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	EDataLayerRuntimeState                        State;                                             // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UDataLayerInstance*>             DataLayerInstances;                                // 0x0018(0x0010)(Edit, BlueprintVisible)
	EDataLayerRuntimeState                        Temp_byte_Variable;                                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPackagedBuild_ReturnValue;              // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDataLayerAsset*                        CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0050(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0051(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52[0x6];                                       // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UDataLayerManager*                      CallFunc_GetDataLayerManager_ReturnValue;          // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class UDataLayerInstance*               CallFunc_GetDataLayerInstanceFromAsset_ReturnValue; // 0x0060(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0068(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Select_Default;                             // 0x0071(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ConditionalDataLayersManager_C_SetDataLayersRuntimeStateForEditor) == 0x000008, "Wrong alignment on BP_ConditionalDataLayersManager_C_SetDataLayersRuntimeStateForEditor");
static_assert(sizeof(BP_ConditionalDataLayersManager_C_SetDataLayersRuntimeStateForEditor) == 0x000078, "Wrong size on BP_ConditionalDataLayersManager_C_SetDataLayersRuntimeStateForEditor");
static_assert(offsetof(BP_ConditionalDataLayersManager_C_SetDataLayersRuntimeStateForEditor, DataLayers) == 0x000000, "Member 'BP_ConditionalDataLayersManager_C_SetDataLayersRuntimeStateForEditor::DataLayers' has a wrong offset!");
static_assert(offsetof(BP_ConditionalDataLayersManager_C_SetDataLayersRuntimeStateForEditor, State) == 0x000010, "Member 'BP_ConditionalDataLayersManager_C_SetDataLayersRuntimeStateForEditor::State' has a wrong offset!");
static_assert(offsetof(BP_ConditionalDataLayersManager_C_SetDataLayersRuntimeStateForEditor, DataLayerInstances) == 0x000018, "Member 'BP_ConditionalDataLayersManager_C_SetDataLayersRuntimeStateForEditor::DataLayerInstances' has a wrong offset!");
static_assert(offsetof(BP_ConditionalDataLayersManager_C_SetDataLayersRuntimeStateForEditor, Temp_byte_Variable) == 0x000028, "Member 'BP_ConditionalDataLayersManager_C_SetDataLayersRuntimeStateForEditor::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_ConditionalDataLayersManager_C_SetDataLayersRuntimeStateForEditor, CallFunc_Array_Length_ReturnValue) == 0x00002C, "Member 'BP_ConditionalDataLayersManager_C_SetDataLayersRuntimeStateForEditor::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConditionalDataLayersManager_C_SetDataLayersRuntimeStateForEditor, Temp_int_Loop_Counter_Variable) == 0x000030, "Member 'BP_ConditionalDataLayersManager_C_SetDataLayersRuntimeStateForEditor::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_ConditionalDataLayersManager_C_SetDataLayersRuntimeStateForEditor, CallFunc_Less_IntInt_ReturnValue) == 0x000034, "Member 'BP_ConditionalDataLayersManager_C_SetDataLayersRuntimeStateForEditor::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConditionalDataLayersManager_C_SetDataLayersRuntimeStateForEditor, CallFunc_Add_IntInt_ReturnValue) == 0x000038, "Member 'BP_ConditionalDataLayersManager_C_SetDataLayersRuntimeStateForEditor::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConditionalDataLayersManager_C_SetDataLayersRuntimeStateForEditor, Temp_int_Array_Index_Variable) == 0x00003C, "Member 'BP_ConditionalDataLayersManager_C_SetDataLayersRuntimeStateForEditor::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_ConditionalDataLayersManager_C_SetDataLayersRuntimeStateForEditor, CallFunc_IsPackagedBuild_ReturnValue) == 0x000040, "Member 'BP_ConditionalDataLayersManager_C_SetDataLayersRuntimeStateForEditor::CallFunc_IsPackagedBuild_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConditionalDataLayersManager_C_SetDataLayersRuntimeStateForEditor, CallFunc_Array_Get_Item) == 0x000048, "Member 'BP_ConditionalDataLayersManager_C_SetDataLayersRuntimeStateForEditor::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_ConditionalDataLayersManager_C_SetDataLayersRuntimeStateForEditor, Temp_bool_Variable) == 0x000050, "Member 'BP_ConditionalDataLayersManager_C_SetDataLayersRuntimeStateForEditor::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_ConditionalDataLayersManager_C_SetDataLayersRuntimeStateForEditor, Temp_bool_Variable_1) == 0x000051, "Member 'BP_ConditionalDataLayersManager_C_SetDataLayersRuntimeStateForEditor::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ConditionalDataLayersManager_C_SetDataLayersRuntimeStateForEditor, CallFunc_GetDataLayerManager_ReturnValue) == 0x000058, "Member 'BP_ConditionalDataLayersManager_C_SetDataLayersRuntimeStateForEditor::CallFunc_GetDataLayerManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConditionalDataLayersManager_C_SetDataLayersRuntimeStateForEditor, CallFunc_GetDataLayerInstanceFromAsset_ReturnValue) == 0x000060, "Member 'BP_ConditionalDataLayersManager_C_SetDataLayersRuntimeStateForEditor::CallFunc_GetDataLayerInstanceFromAsset_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConditionalDataLayersManager_C_SetDataLayersRuntimeStateForEditor, Temp_bool_Variable_2) == 0x000068, "Member 'BP_ConditionalDataLayersManager_C_SetDataLayersRuntimeStateForEditor::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_ConditionalDataLayersManager_C_SetDataLayersRuntimeStateForEditor, CallFunc_Array_Add_ReturnValue) == 0x00006C, "Member 'BP_ConditionalDataLayersManager_C_SetDataLayersRuntimeStateForEditor::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConditionalDataLayersManager_C_SetDataLayersRuntimeStateForEditor, CallFunc_IsValid_ReturnValue) == 0x000070, "Member 'BP_ConditionalDataLayersManager_C_SetDataLayersRuntimeStateForEditor::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConditionalDataLayersManager_C_SetDataLayersRuntimeStateForEditor, K2Node_Select_Default) == 0x000071, "Member 'BP_ConditionalDataLayersManager_C_SetDataLayersRuntimeStateForEditor::K2Node_Select_Default' has a wrong offset!");

// Function BP_ConditionalDataLayersManager.BP_ConditionalDataLayersManager_C.SetDataLayersRuntimeState
// 0x0078 (0x0078 - 0x0000)
struct BP_ConditionalDataLayersManager_C_SetDataLayersRuntimeState final
{
public:
	TArray<class UDataLayerAsset*>                DataLayers;                                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<class FName>                           DataLayerNames;                                    // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	EDataLayerRuntimeState                        State;                                             // 0x0020(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UDataLayerAsset*                        CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDataLayerManager*                      CallFunc_GetDataLayerManager_ReturnValue;          // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetDataLayerRuntimeState_ReturnValue;     // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Array_Get_Item_1;                         // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDataLayerSubsystem*                    CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ConditionalDataLayersManager_C_SetDataLayersRuntimeState) == 0x000008, "Wrong alignment on BP_ConditionalDataLayersManager_C_SetDataLayersRuntimeState");
static_assert(sizeof(BP_ConditionalDataLayersManager_C_SetDataLayersRuntimeState) == 0x000078, "Wrong size on BP_ConditionalDataLayersManager_C_SetDataLayersRuntimeState");
static_assert(offsetof(BP_ConditionalDataLayersManager_C_SetDataLayersRuntimeState, DataLayers) == 0x000000, "Member 'BP_ConditionalDataLayersManager_C_SetDataLayersRuntimeState::DataLayers' has a wrong offset!");
static_assert(offsetof(BP_ConditionalDataLayersManager_C_SetDataLayersRuntimeState, DataLayerNames) == 0x000010, "Member 'BP_ConditionalDataLayersManager_C_SetDataLayersRuntimeState::DataLayerNames' has a wrong offset!");
static_assert(offsetof(BP_ConditionalDataLayersManager_C_SetDataLayersRuntimeState, State) == 0x000020, "Member 'BP_ConditionalDataLayersManager_C_SetDataLayersRuntimeState::State' has a wrong offset!");
static_assert(offsetof(BP_ConditionalDataLayersManager_C_SetDataLayersRuntimeState, CallFunc_Array_Length_ReturnValue) == 0x000024, "Member 'BP_ConditionalDataLayersManager_C_SetDataLayersRuntimeState::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConditionalDataLayersManager_C_SetDataLayersRuntimeState, CallFunc_Array_Length_ReturnValue_1) == 0x000028, "Member 'BP_ConditionalDataLayersManager_C_SetDataLayersRuntimeState::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ConditionalDataLayersManager_C_SetDataLayersRuntimeState, Temp_int_Array_Index_Variable) == 0x00002C, "Member 'BP_ConditionalDataLayersManager_C_SetDataLayersRuntimeState::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_ConditionalDataLayersManager_C_SetDataLayersRuntimeState, Temp_int_Loop_Counter_Variable) == 0x000030, "Member 'BP_ConditionalDataLayersManager_C_SetDataLayersRuntimeState::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_ConditionalDataLayersManager_C_SetDataLayersRuntimeState, CallFunc_Array_Get_Item) == 0x000038, "Member 'BP_ConditionalDataLayersManager_C_SetDataLayersRuntimeState::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_ConditionalDataLayersManager_C_SetDataLayersRuntimeState, CallFunc_Less_IntInt_ReturnValue) == 0x000040, "Member 'BP_ConditionalDataLayersManager_C_SetDataLayersRuntimeState::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConditionalDataLayersManager_C_SetDataLayersRuntimeState, CallFunc_Add_IntInt_ReturnValue) == 0x000044, "Member 'BP_ConditionalDataLayersManager_C_SetDataLayersRuntimeState::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConditionalDataLayersManager_C_SetDataLayersRuntimeState, CallFunc_GetDataLayerManager_ReturnValue) == 0x000048, "Member 'BP_ConditionalDataLayersManager_C_SetDataLayersRuntimeState::CallFunc_GetDataLayerManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConditionalDataLayersManager_C_SetDataLayersRuntimeState, Temp_int_Array_Index_Variable_1) == 0x000050, "Member 'BP_ConditionalDataLayersManager_C_SetDataLayersRuntimeState::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ConditionalDataLayersManager_C_SetDataLayersRuntimeState, CallFunc_SetDataLayerRuntimeState_ReturnValue) == 0x000054, "Member 'BP_ConditionalDataLayersManager_C_SetDataLayersRuntimeState::CallFunc_SetDataLayerRuntimeState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConditionalDataLayersManager_C_SetDataLayersRuntimeState, CallFunc_Array_Get_Item_1) == 0x000058, "Member 'BP_ConditionalDataLayersManager_C_SetDataLayersRuntimeState::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_ConditionalDataLayersManager_C_SetDataLayersRuntimeState, CallFunc_GetWorldSubsystem_ReturnValue) == 0x000060, "Member 'BP_ConditionalDataLayersManager_C_SetDataLayersRuntimeState::CallFunc_GetWorldSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConditionalDataLayersManager_C_SetDataLayersRuntimeState, Temp_int_Loop_Counter_Variable_1) == 0x000068, "Member 'BP_ConditionalDataLayersManager_C_SetDataLayersRuntimeState::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ConditionalDataLayersManager_C_SetDataLayersRuntimeState, CallFunc_Less_IntInt_ReturnValue_1) == 0x00006C, "Member 'BP_ConditionalDataLayersManager_C_SetDataLayersRuntimeState::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ConditionalDataLayersManager_C_SetDataLayersRuntimeState, CallFunc_Add_IntInt_ReturnValue_1) == 0x000070, "Member 'BP_ConditionalDataLayersManager_C_SetDataLayersRuntimeState::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");

// Function BP_ConditionalDataLayersManager.BP_ConditionalDataLayersManager_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_ConditionalDataLayersManager_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ConditionalDataLayersManager_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_ConditionalDataLayersManager_C_ReceiveEndPlay");
static_assert(sizeof(BP_ConditionalDataLayersManager_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_ConditionalDataLayersManager_C_ReceiveEndPlay");
static_assert(offsetof(BP_ConditionalDataLayersManager_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_ConditionalDataLayersManager_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function BP_ConditionalDataLayersManager.BP_ConditionalDataLayersManager_C.OnConditionEvaluatedToTrue
// 0x0070 (0x0070 - 0x0000)
struct BP_ConditionalDataLayersManager_C_OnConditionEvaluatedToTrue final
{
public:
	struct FS_ConditionalDataLayers               ConditionalDataLayers_0;                           // 0x0000(0x0070)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference, HasGetValueTypeHash)
};
static_assert(alignof(BP_ConditionalDataLayersManager_C_OnConditionEvaluatedToTrue) == 0x000008, "Wrong alignment on BP_ConditionalDataLayersManager_C_OnConditionEvaluatedToTrue");
static_assert(sizeof(BP_ConditionalDataLayersManager_C_OnConditionEvaluatedToTrue) == 0x000070, "Wrong size on BP_ConditionalDataLayersManager_C_OnConditionEvaluatedToTrue");
static_assert(offsetof(BP_ConditionalDataLayersManager_C_OnConditionEvaluatedToTrue, ConditionalDataLayers_0) == 0x000000, "Member 'BP_ConditionalDataLayersManager_C_OnConditionEvaluatedToTrue::ConditionalDataLayers_0' has a wrong offset!");

// Function BP_ConditionalDataLayersManager.BP_ConditionalDataLayersManager_C.OnConditionEvaluatedToFalse
// 0x0070 (0x0070 - 0x0000)
struct BP_ConditionalDataLayersManager_C_OnConditionEvaluatedToFalse final
{
public:
	struct FS_ConditionalDataLayers               ConditionalDataLayers_0;                           // 0x0000(0x0070)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference, HasGetValueTypeHash)
};
static_assert(alignof(BP_ConditionalDataLayersManager_C_OnConditionEvaluatedToFalse) == 0x000008, "Wrong alignment on BP_ConditionalDataLayersManager_C_OnConditionEvaluatedToFalse");
static_assert(sizeof(BP_ConditionalDataLayersManager_C_OnConditionEvaluatedToFalse) == 0x000070, "Wrong size on BP_ConditionalDataLayersManager_C_OnConditionEvaluatedToFalse");
static_assert(offsetof(BP_ConditionalDataLayersManager_C_OnConditionEvaluatedToFalse, ConditionalDataLayers_0) == 0x000000, "Member 'BP_ConditionalDataLayersManager_C_OnConditionEvaluatedToFalse::ConditionalDataLayers_0' has a wrong offset!");

// Function BP_ConditionalDataLayersManager.BP_ConditionalDataLayersManager_C.ForceConditionAtIndex
// 0x0010 (0x0010 - 0x0000)
struct BP_ConditionalDataLayersManager_C_ForceConditionAtIndex final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Value;                                             // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ConditionalDataLayersManager_C_ForceConditionAtIndex) == 0x000004, "Wrong alignment on BP_ConditionalDataLayersManager_C_ForceConditionAtIndex");
static_assert(sizeof(BP_ConditionalDataLayersManager_C_ForceConditionAtIndex) == 0x000010, "Wrong size on BP_ConditionalDataLayersManager_C_ForceConditionAtIndex");
static_assert(offsetof(BP_ConditionalDataLayersManager_C_ForceConditionAtIndex, Index_0) == 0x000000, "Member 'BP_ConditionalDataLayersManager_C_ForceConditionAtIndex::Index_0' has a wrong offset!");
static_assert(offsetof(BP_ConditionalDataLayersManager_C_ForceConditionAtIndex, Value) == 0x000004, "Member 'BP_ConditionalDataLayersManager_C_ForceConditionAtIndex::Value' has a wrong offset!");
static_assert(offsetof(BP_ConditionalDataLayersManager_C_ForceConditionAtIndex, CallFunc_Array_Length_ReturnValue) == 0x000008, "Member 'BP_ConditionalDataLayersManager_C_ForceConditionAtIndex::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConditionalDataLayersManager_C_ForceConditionAtIndex, CallFunc_Less_IntInt_ReturnValue) == 0x00000C, "Member 'BP_ConditionalDataLayersManager_C_ForceConditionAtIndex::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function BP_ConditionalDataLayersManager.BP_ConditionalDataLayersManager_C.ExecuteUbergraph_BP_ConditionalDataLayersManager
// 0x0008 (0x0008 - 0x0000)
struct BP_ConditionalDataLayersManager_C_ExecuteUbergraph_BP_ConditionalDataLayersManager final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ConditionalDataLayersManager_C_ExecuteUbergraph_BP_ConditionalDataLayersManager) == 0x000004, "Wrong alignment on BP_ConditionalDataLayersManager_C_ExecuteUbergraph_BP_ConditionalDataLayersManager");
static_assert(sizeof(BP_ConditionalDataLayersManager_C_ExecuteUbergraph_BP_ConditionalDataLayersManager) == 0x000008, "Wrong size on BP_ConditionalDataLayersManager_C_ExecuteUbergraph_BP_ConditionalDataLayersManager");
static_assert(offsetof(BP_ConditionalDataLayersManager_C_ExecuteUbergraph_BP_ConditionalDataLayersManager, EntryPoint) == 0x000000, "Member 'BP_ConditionalDataLayersManager_C_ExecuteUbergraph_BP_ConditionalDataLayersManager::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ConditionalDataLayersManager_C_ExecuteUbergraph_BP_ConditionalDataLayersManager, K2Node_Event_EndPlayReason) == 0x000004, "Member 'BP_ConditionalDataLayersManager_C_ExecuteUbergraph_BP_ConditionalDataLayersManager::K2Node_Event_EndPlayReason' has a wrong offset!");

// Function BP_ConditionalDataLayersManager.BP_ConditionalDataLayersManager_C.EvaluateCondition
// 0x0078 (0x0078 - 0x0000)
struct BP_ConditionalDataLayersManager_C_EvaluateCondition final
{
public:
	struct FS_ConditionalDataLayers               ConditionalDataLayer;                              // 0x0000(0x0070)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_CheckCondition_Result;                    // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ConditionalDataLayersManager_C_EvaluateCondition) == 0x000008, "Wrong alignment on BP_ConditionalDataLayersManager_C_EvaluateCondition");
static_assert(sizeof(BP_ConditionalDataLayersManager_C_EvaluateCondition) == 0x000078, "Wrong size on BP_ConditionalDataLayersManager_C_EvaluateCondition");
static_assert(offsetof(BP_ConditionalDataLayersManager_C_EvaluateCondition, ConditionalDataLayer) == 0x000000, "Member 'BP_ConditionalDataLayersManager_C_EvaluateCondition::ConditionalDataLayer' has a wrong offset!");
static_assert(offsetof(BP_ConditionalDataLayersManager_C_EvaluateCondition, CallFunc_CheckCondition_Result) == 0x000070, "Member 'BP_ConditionalDataLayersManager_C_EvaluateCondition::CallFunc_CheckCondition_Result' has a wrong offset!");

// Function BP_ConditionalDataLayersManager.BP_ConditionalDataLayersManager_C.EvaluateAllConditions
// 0x0090 (0x0090 - 0x0000)
struct BP_ConditionalDataLayersManager_C_EvaluateAllConditions final
{
public:
	bool                                          IsBeginPlay;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_ConditionalDataLayers               CallFunc_Array_Get_Item;                           // 0x0018(0x0070)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ConditionalDataLayersManager_C_EvaluateAllConditions) == 0x000008, "Wrong alignment on BP_ConditionalDataLayersManager_C_EvaluateAllConditions");
static_assert(sizeof(BP_ConditionalDataLayersManager_C_EvaluateAllConditions) == 0x000090, "Wrong size on BP_ConditionalDataLayersManager_C_EvaluateAllConditions");
static_assert(offsetof(BP_ConditionalDataLayersManager_C_EvaluateAllConditions, IsBeginPlay) == 0x000000, "Member 'BP_ConditionalDataLayersManager_C_EvaluateAllConditions::IsBeginPlay' has a wrong offset!");
static_assert(offsetof(BP_ConditionalDataLayersManager_C_EvaluateAllConditions, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_ConditionalDataLayersManager_C_EvaluateAllConditions::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_ConditionalDataLayersManager_C_EvaluateAllConditions, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_ConditionalDataLayersManager_C_EvaluateAllConditions::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConditionalDataLayersManager_C_EvaluateAllConditions, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'BP_ConditionalDataLayersManager_C_EvaluateAllConditions::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_ConditionalDataLayersManager_C_EvaluateAllConditions, CallFunc_Array_Length_ReturnValue) == 0x000010, "Member 'BP_ConditionalDataLayersManager_C_EvaluateAllConditions::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConditionalDataLayersManager_C_EvaluateAllConditions, CallFunc_Array_Get_Item) == 0x000018, "Member 'BP_ConditionalDataLayersManager_C_EvaluateAllConditions::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_ConditionalDataLayersManager_C_EvaluateAllConditions, CallFunc_Less_IntInt_ReturnValue) == 0x000088, "Member 'BP_ConditionalDataLayersManager_C_EvaluateAllConditions::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function BP_ConditionalDataLayersManager.BP_ConditionalDataLayersManager_C.CheckForErrors
// 0x0160 (0x0160 - 0x0000)
struct BP_ConditionalDataLayersManager_C_CheckForErrors final
{
public:
	TArray<class FText>                           ErrorMessages;                                     // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0018(0x0010)(ReferenceParm)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Format_ReturnValue;                       // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0040(0x0048)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0088(0x0010)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0098(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Format_ReturnValue_1;                     // 0x00B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_ConditionalDataLayers               CallFunc_Array_Get_Item;                           // 0x00C8(0x0070)(ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_ConditionalDataLayersManager_C*> CallFunc_GetAllActorsOfClass_OutActors;        // 0x0148(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x015C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ConditionalDataLayersManager_C_CheckForErrors) == 0x000008, "Wrong alignment on BP_ConditionalDataLayersManager_C_CheckForErrors");
static_assert(sizeof(BP_ConditionalDataLayersManager_C_CheckForErrors) == 0x000160, "Wrong size on BP_ConditionalDataLayersManager_C_CheckForErrors");
static_assert(offsetof(BP_ConditionalDataLayersManager_C_CheckForErrors, ErrorMessages) == 0x000000, "Member 'BP_ConditionalDataLayersManager_C_CheckForErrors::ErrorMessages' has a wrong offset!");
static_assert(offsetof(BP_ConditionalDataLayersManager_C_CheckForErrors, ReturnValue) == 0x000010, "Member 'BP_ConditionalDataLayersManager_C_CheckForErrors::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConditionalDataLayersManager_C_CheckForErrors, Temp_int_Array_Index_Variable) == 0x000014, "Member 'BP_ConditionalDataLayersManager_C_CheckForErrors::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_ConditionalDataLayersManager_C_CheckForErrors, K2Node_MakeArray_Array) == 0x000018, "Member 'BP_ConditionalDataLayersManager_C_CheckForErrors::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_ConditionalDataLayersManager_C_CheckForErrors, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000028, "Member 'BP_ConditionalDataLayersManager_C_CheckForErrors::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConditionalDataLayersManager_C_CheckForErrors, CallFunc_Format_ReturnValue) == 0x000030, "Member 'BP_ConditionalDataLayersManager_C_CheckForErrors::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConditionalDataLayersManager_C_CheckForErrors, K2Node_MakeStruct_FormatArgumentData) == 0x000040, "Member 'BP_ConditionalDataLayersManager_C_CheckForErrors::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_ConditionalDataLayersManager_C_CheckForErrors, CallFunc_Conv_StringToText_ReturnValue) == 0x000088, "Member 'BP_ConditionalDataLayersManager_C_CheckForErrors::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConditionalDataLayersManager_C_CheckForErrors, K2Node_MakeArray_Array_1) == 0x000098, "Member 'BP_ConditionalDataLayersManager_C_CheckForErrors::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BP_ConditionalDataLayersManager_C_CheckForErrors, CallFunc_Array_Add_ReturnValue) == 0x0000A8, "Member 'BP_ConditionalDataLayersManager_C_CheckForErrors::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConditionalDataLayersManager_C_CheckForErrors, CallFunc_Format_ReturnValue_1) == 0x0000B0, "Member 'BP_ConditionalDataLayersManager_C_CheckForErrors::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ConditionalDataLayersManager_C_CheckForErrors, Temp_int_Loop_Counter_Variable) == 0x0000C0, "Member 'BP_ConditionalDataLayersManager_C_CheckForErrors::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_ConditionalDataLayersManager_C_CheckForErrors, CallFunc_Array_Get_Item) == 0x0000C8, "Member 'BP_ConditionalDataLayersManager_C_CheckForErrors::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_ConditionalDataLayersManager_C_CheckForErrors, CallFunc_Add_IntInt_ReturnValue) == 0x000138, "Member 'BP_ConditionalDataLayersManager_C_CheckForErrors::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConditionalDataLayersManager_C_CheckForErrors, CallFunc_Array_Length_ReturnValue) == 0x00013C, "Member 'BP_ConditionalDataLayersManager_C_CheckForErrors::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConditionalDataLayersManager_C_CheckForErrors, CallFunc_Less_IntInt_ReturnValue) == 0x000140, "Member 'BP_ConditionalDataLayersManager_C_CheckForErrors::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConditionalDataLayersManager_C_CheckForErrors, CallFunc_GetAllActorsOfClass_OutActors) == 0x000148, "Member 'BP_ConditionalDataLayersManager_C_CheckForErrors::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(BP_ConditionalDataLayersManager_C_CheckForErrors, CallFunc_Array_Length_ReturnValue_1) == 0x000158, "Member 'BP_ConditionalDataLayersManager_C_CheckForErrors::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ConditionalDataLayersManager_C_CheckForErrors, CallFunc_Greater_IntInt_ReturnValue) == 0x00015C, "Member 'BP_ConditionalDataLayersManager_C_CheckForErrors::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

// Function BP_ConditionalDataLayersManager.BP_ConditionalDataLayersManager_C.BindCondition
// 0x0080 (0x0080 - 0x0000)
struct BP_ConditionalDataLayersManager_C_BindCondition final
{
public:
	struct FS_ConditionalDataLayers               ConditionalDataLayers_0;                           // 0x0000(0x0070)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0070(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ConditionalDataLayersManager_C_BindCondition) == 0x000008, "Wrong alignment on BP_ConditionalDataLayersManager_C_BindCondition");
static_assert(sizeof(BP_ConditionalDataLayersManager_C_BindCondition) == 0x000080, "Wrong size on BP_ConditionalDataLayersManager_C_BindCondition");
static_assert(offsetof(BP_ConditionalDataLayersManager_C_BindCondition, ConditionalDataLayers_0) == 0x000000, "Member 'BP_ConditionalDataLayersManager_C_BindCondition::ConditionalDataLayers_0' has a wrong offset!");
static_assert(offsetof(BP_ConditionalDataLayersManager_C_BindCondition, K2Node_CreateDelegate_OutputDelegate) == 0x000070, "Member 'BP_ConditionalDataLayersManager_C_BindCondition::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function BP_ConditionalDataLayersManager.BP_ConditionalDataLayersManager_C.BindAllConditions
// 0x00A8 (0x00A8 - 0x0000)
struct BP_ConditionalDataLayersManager_C_BindAllConditions final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x000C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_jRPG_GI_Custom_C*                   CallFunc_GetCustomGI_ReturnValue;                  // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BindOnSaveLoaded_AlreadyLoaded;           // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_ConditionalDataLayers               CallFunc_Array_Get_Item;                           // 0x0030(0x0070)(ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ConditionalDataLayersManager_C_BindAllConditions) == 0x000008, "Wrong alignment on BP_ConditionalDataLayersManager_C_BindAllConditions");
static_assert(sizeof(BP_ConditionalDataLayersManager_C_BindAllConditions) == 0x0000A8, "Wrong size on BP_ConditionalDataLayersManager_C_BindAllConditions");
static_assert(offsetof(BP_ConditionalDataLayersManager_C_BindAllConditions, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BP_ConditionalDataLayersManager_C_BindAllConditions::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_ConditionalDataLayersManager_C_BindAllConditions, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_ConditionalDataLayersManager_C_BindAllConditions::Temp_int_Loop_Counter_Variable' has a wrong offset!");
