#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ConditionChecker_QuestObjectiveStatus

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "S_Quest_structs.hpp"


namespace SDK::Params
{

// Function BP_ConditionChecker_QuestObjectiveStatus.BP_ConditionChecker_QuestObjectiveStatus_C.UnbindEventOnGameStateChanged
// 0x0018 (0x0018 - 0x0000)
struct BP_ConditionChecker_QuestObjectiveStatus_C_UnbindEventOnGameStateChanged final
{
public:
	TDelegate<void()>                             Event;                                             // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	class UBP_QuestSystem_C*                      CallFunc_GetQuestSystem_QuestSystem;               // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ConditionChecker_QuestObjectiveStatus_C_UnbindEventOnGameStateChanged) == 0x000008, "Wrong alignment on BP_ConditionChecker_QuestObjectiveStatus_C_UnbindEventOnGameStateChanged");
static_assert(sizeof(BP_ConditionChecker_QuestObjectiveStatus_C_UnbindEventOnGameStateChanged) == 0x000018, "Wrong size on BP_ConditionChecker_QuestObjectiveStatus_C_UnbindEventOnGameStateChanged");
static_assert(offsetof(BP_ConditionChecker_QuestObjectiveStatus_C_UnbindEventOnGameStateChanged, Event) == 0x000000, "Member 'BP_ConditionChecker_QuestObjectiveStatus_C_UnbindEventOnGameStateChanged::Event' has a wrong offset!");
static_assert(offsetof(BP_ConditionChecker_QuestObjectiveStatus_C_UnbindEventOnGameStateChanged, CallFunc_GetQuestSystem_QuestSystem) == 0x000010, "Member 'BP_ConditionChecker_QuestObjectiveStatus_C_UnbindEventOnGameStateChanged::CallFunc_GetQuestSystem_QuestSystem' has a wrong offset!");

// Function BP_ConditionChecker_QuestObjectiveStatus.BP_ConditionChecker_QuestObjectiveStatus_C.BindEventOnGameStateChanged
// 0x0018 (0x0018 - 0x0000)
struct BP_ConditionChecker_QuestObjectiveStatus_C_BindEventOnGameStateChanged final
{
public:
	TDelegate<void()>                             Event;                                             // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	class UBP_QuestSystem_C*                      CallFunc_GetQuestSystem_QuestSystem;               // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ConditionChecker_QuestObjectiveStatus_C_BindEventOnGameStateChanged) == 0x000008, "Wrong alignment on BP_ConditionChecker_QuestObjectiveStatus_C_BindEventOnGameStateChanged");
static_assert(sizeof(BP_ConditionChecker_QuestObjectiveStatus_C_BindEventOnGameStateChanged) == 0x000018, "Wrong size on BP_ConditionChecker_QuestObjectiveStatus_C_BindEventOnGameStateChanged");
static_assert(offsetof(BP_ConditionChecker_QuestObjectiveStatus_C_BindEventOnGameStateChanged, Event) == 0x000000, "Member 'BP_ConditionChecker_QuestObjectiveStatus_C_BindEventOnGameStateChanged::Event' has a wrong offset!");
static_assert(offsetof(BP_ConditionChecker_QuestObjectiveStatus_C_BindEventOnGameStateChanged, CallFunc_GetQuestSystem_QuestSystem) == 0x000010, "Member 'BP_ConditionChecker_QuestObjectiveStatus_C_BindEventOnGameStateChanged::CallFunc_GetQuestSystem_QuestSystem' has a wrong offset!");

// Function BP_ConditionChecker_QuestObjectiveStatus.BP_ConditionChecker_QuestObjectiveStatus_C.CheckInternal
// 0x0002 (0x0002 - 0x0000)
struct BP_ConditionChecker_QuestObjectiveStatus_C_CheckInternal final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ObjectiveHasStatus_Result;                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ConditionChecker_QuestObjectiveStatus_C_CheckInternal) == 0x000001, "Wrong alignment on BP_ConditionChecker_QuestObjectiveStatus_C_CheckInternal");
static_assert(sizeof(BP_ConditionChecker_QuestObjectiveStatus_C_CheckInternal) == 0x000002, "Wrong size on BP_ConditionChecker_QuestObjectiveStatus_C_CheckInternal");
static_assert(offsetof(BP_ConditionChecker_QuestObjectiveStatus_C_CheckInternal, ReturnValue) == 0x000000, "Member 'BP_ConditionChecker_QuestObjectiveStatus_C_CheckInternal::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConditionChecker_QuestObjectiveStatus_C_CheckInternal, CallFunc_ObjectiveHasStatus_Result) == 0x000001, "Member 'BP_ConditionChecker_QuestObjectiveStatus_C_CheckInternal::CallFunc_ObjectiveHasStatus_Result' has a wrong offset!");

// Function BP_ConditionChecker_QuestObjectiveStatus.BP_ConditionChecker_QuestObjectiveStatus_C.ValidateConditionChecker
// 0x0170 (0x0170 - 0x0000)
struct BP_ConditionChecker_QuestObjectiveStatus_C_ValidateConditionChecker final
{
public:
	TArray<class FText>                           ErrorMessages;                                     // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FString                                 PropertyPath;                                      // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, HasGetValueTypeHash)
	class UDataTable*                             CallFunc_GetQuestDataTable_ReturnValue;            // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_AppendPropertyPath_ReturnValue;           // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_NameToText_ReturnValue;              // 0x0038(0x0010)()
	class FText                                   CallFunc_Conv_NameToText_ReturnValue_1;            // 0x0048(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0058(0x0048)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00A0(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00E8(0x0010)(ReferenceParm)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x00F8(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Format_ReturnValue;                       // 0x0108(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Format_ReturnValue_1;                     // 0x0118(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FS_Quest                               CallFunc_GetDataTableRowFromName_OutRow;           // 0x0128(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoesDataTableRowExist_ReturnValue;        // 0x0141(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0142(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_143[0x5];                                      // 0x0143(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_AppendPropertyPath_ReturnValue_1;         // 0x0148(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDataTable*                             CallFunc_GetQuestDataTable_ReturnValue_1;          // 0x0160(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ConditionChecker_QuestObjectiveStatus_C_ValidateConditionChecker) == 0x000008, "Wrong alignment on BP_ConditionChecker_QuestObjectiveStatus_C_ValidateConditionChecker");
static_assert(sizeof(BP_ConditionChecker_QuestObjectiveStatus_C_ValidateConditionChecker) == 0x000170, "Wrong size on BP_ConditionChecker_QuestObjectiveStatus_C_ValidateConditionChecker");
static_assert(offsetof(BP_ConditionChecker_QuestObjectiveStatus_C_ValidateConditionChecker, ErrorMessages) == 0x000000, "Member 'BP_ConditionChecker_QuestObjectiveStatus_C_ValidateConditionChecker::ErrorMessages' has a wrong offset!");
static_assert(offsetof(BP_ConditionChecker_QuestObjectiveStatus_C_ValidateConditionChecker, PropertyPath) == 0x000010, "Member 'BP_ConditionChecker_QuestObjectiveStatus_C_ValidateConditionChecker::PropertyPath' has a wrong offset!");
static_assert(offsetof(BP_ConditionChecker_QuestObjectiveStatus_C_ValidateConditionChecker, CallFunc_GetQuestDataTable_ReturnValue) == 0x000020, "Member 'BP_ConditionChecker_QuestObjectiveStatus_C_ValidateConditionChecker::CallFunc_GetQuestDataTable_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConditionChecker_QuestObjectiveStatus_C_ValidateConditionChecker, CallFunc_AppendPropertyPath_ReturnValue) == 0x000028, "Member 'BP_ConditionChecker_QuestObjectiveStatus_C_ValidateConditionChecker::CallFunc_AppendPropertyPath_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConditionChecker_QuestObjectiveStatus_C_ValidateConditionChecker, CallFunc_Conv_NameToText_ReturnValue) == 0x000038, "Member 'BP_ConditionChecker_QuestObjectiveStatus_C_ValidateConditionChecker::CallFunc_Conv_NameToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConditionChecker_QuestObjectiveStatus_C_ValidateConditionChecker, CallFunc_Conv_NameToText_ReturnValue_1) == 0x000048, "Member 'BP_ConditionChecker_QuestObjectiveStatus_C_ValidateConditionChecker::CallFunc_Conv_NameToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ConditionChecker_QuestObjectiveStatus_C_ValidateConditionChecker, K2Node_MakeStruct_FormatArgumentData) == 0x000058, "Member 'BP_ConditionChecker_QuestObjectiveStatus_C_ValidateConditionChecker::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_ConditionChecker_QuestObjectiveStatus_C_ValidateConditionChecker, K2Node_MakeStruct_FormatArgumentData_1) == 0x0000A0, "Member 'BP_ConditionChecker_QuestObjectiveStatus_C_ValidateConditionChecker::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BP_ConditionChecker_QuestObjectiveStatus_C_ValidateConditionChecker, K2Node_MakeArray_Array) == 0x0000E8, "Member 'BP_ConditionChecker_QuestObjectiveStatus_C_ValidateConditionChecker::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_ConditionChecker_QuestObjectiveStatus_C_ValidateConditionChecker, K2Node_MakeArray_Array_1) == 0x0000F8, "Member 'BP_ConditionChecker_QuestObjectiveStatus_C_ValidateConditionChecker::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BP_ConditionChecker_QuestObjectiveStatus_C_ValidateConditionChecker, CallFunc_Format_ReturnValue) == 0x000108, "Member 'BP_ConditionChecker_QuestObjectiveStatus_C_ValidateConditionChecker::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConditionChecker_QuestObjectiveStatus_C_ValidateConditionChecker, CallFunc_Format_ReturnValue_1) == 0x000118, "Member 'BP_ConditionChecker_QuestObjectiveStatus_C_ValidateConditionChecker::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ConditionChecker_QuestObjectiveStatus_C_ValidateConditionChecker, CallFunc_GetDataTableRowFromName_OutRow) == 0x000128, "Member 'BP_ConditionChecker_QuestObjectiveStatus_C_ValidateConditionChecker::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BP_ConditionChecker_QuestObjectiveStatus_C_ValidateConditionChecker, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000140, "Member 'BP_ConditionChecker_QuestObjectiveStatus_C_ValidateConditionChecker::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConditionChecker_QuestObjectiveStatus_C_ValidateConditionChecker, CallFunc_DoesDataTableRowExist_ReturnValue) == 0x000141, "Member 'BP_ConditionChecker_QuestObjectiveStatus_C_ValidateConditionChecker::CallFunc_DoesDataTableRowExist_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConditionChecker_QuestObjectiveStatus_C_ValidateConditionChecker, CallFunc_IsValid_ReturnValue) == 0x000142, "Member 'BP_ConditionChecker_QuestObjectiveStatus_C_ValidateConditionChecker::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConditionChecker_QuestObjectiveStatus_C_ValidateConditionChecker, CallFunc_AppendPropertyPath_ReturnValue_1) == 0x000148, "Member 'BP_ConditionChecker_QuestObjectiveStatus_C_ValidateConditionChecker::CallFunc_AppendPropertyPath_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ConditionChecker_QuestObjectiveStatus_C_ValidateConditionChecker, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000158, "Member 'BP_ConditionChecker_QuestObjectiveStatus_C_ValidateConditionChecker::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConditionChecker_QuestObjectiveStatus_C_ValidateConditionChecker, CallFunc_GetQuestDataTable_ReturnValue_1) == 0x000160, "Member 'BP_ConditionChecker_QuestObjectiveStatus_C_ValidateConditionChecker::CallFunc_GetQuestDataTable_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ConditionChecker_QuestObjectiveStatus_C_ValidateConditionChecker, CallFunc_IsValid_ReturnValue_1) == 0x000168, "Member 'BP_ConditionChecker_QuestObjectiveStatus_C_ValidateConditionChecker::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

}

