#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CharacterSkinComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "S_CharacterCustomization_structs.hpp"


namespace SDK::Params
{

// Function BP_CharacterSkinComponent.BP_CharacterSkinComponent_C.UpdateCharacterFaceMaterialInstances
// 0x0058 (0x0058 - 0x0000)
struct BP_CharacterSkinComponent_C_UpdateCharacterFaceMaterialInstances final
{
public:
	TArray<class FName>                           Temp_wildcard_Variable;                            // 0x0000(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           CallFunc_GetMaterialSlotNames_ReturnValue;         // 0x0020(0x0010)(ReferenceParm)
	int32                                         CallFunc_GetMaterialIndex_ReturnValue;             // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     CallFunc_GetMaterial_ReturnValue;                  // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CharacterSkinComponent_C_UpdateCharacterFaceMaterialInstances) == 0x000008, "Wrong alignment on BP_CharacterSkinComponent_C_UpdateCharacterFaceMaterialInstances");
static_assert(sizeof(BP_CharacterSkinComponent_C_UpdateCharacterFaceMaterialInstances) == 0x000058, "Wrong size on BP_CharacterSkinComponent_C_UpdateCharacterFaceMaterialInstances");
static_assert(offsetof(BP_CharacterSkinComponent_C_UpdateCharacterFaceMaterialInstances, Temp_wildcard_Variable) == 0x000000, "Member 'BP_CharacterSkinComponent_C_UpdateCharacterFaceMaterialInstances::Temp_wildcard_Variable' has a wrong offset!");
static_assert(offsetof(BP_CharacterSkinComponent_C_UpdateCharacterFaceMaterialInstances, CallFunc_Array_Length_ReturnValue) == 0x000010, "Member 'BP_CharacterSkinComponent_C_UpdateCharacterFaceMaterialInstances::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterSkinComponent_C_UpdateCharacterFaceMaterialInstances, Temp_int_Array_Index_Variable) == 0x000014, "Member 'BP_CharacterSkinComponent_C_UpdateCharacterFaceMaterialInstances::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_CharacterSkinComponent_C_UpdateCharacterFaceMaterialInstances, CallFunc_Array_Get_Item) == 0x000018, "Member 'BP_CharacterSkinComponent_C_UpdateCharacterFaceMaterialInstances::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_CharacterSkinComponent_C_UpdateCharacterFaceMaterialInstances, CallFunc_GetMaterialSlotNames_ReturnValue) == 0x000020, "Member 'BP_CharacterSkinComponent_C_UpdateCharacterFaceMaterialInstances::CallFunc_GetMaterialSlotNames_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterSkinComponent_C_UpdateCharacterFaceMaterialInstances, CallFunc_GetMaterialIndex_ReturnValue) == 0x000030, "Member 'BP_CharacterSkinComponent_C_UpdateCharacterFaceMaterialInstances::CallFunc_GetMaterialIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterSkinComponent_C_UpdateCharacterFaceMaterialInstances, CallFunc_GetMaterial_ReturnValue) == 0x000038, "Member 'BP_CharacterSkinComponent_C_UpdateCharacterFaceMaterialInstances::CallFunc_GetMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterSkinComponent_C_UpdateCharacterFaceMaterialInstances, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000040, "Member 'BP_CharacterSkinComponent_C_UpdateCharacterFaceMaterialInstances::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterSkinComponent_C_UpdateCharacterFaceMaterialInstances, CallFunc_IsValid_ReturnValue) == 0x000048, "Member 'BP_CharacterSkinComponent_C_UpdateCharacterFaceMaterialInstances::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterSkinComponent_C_UpdateCharacterFaceMaterialInstances, Temp_int_Loop_Counter_Variable) == 0x00004C, "Member 'BP_CharacterSkinComponent_C_UpdateCharacterFaceMaterialInstances::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_CharacterSkinComponent_C_UpdateCharacterFaceMaterialInstances, CallFunc_Less_IntInt_ReturnValue) == 0x000050, "Member 'BP_CharacterSkinComponent_C_UpdateCharacterFaceMaterialInstances::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterSkinComponent_C_UpdateCharacterFaceMaterialInstances, CallFunc_Add_IntInt_ReturnValue) == 0x000054, "Member 'BP_CharacterSkinComponent_C_UpdateCharacterFaceMaterialInstances::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function BP_CharacterSkinComponent.BP_CharacterSkinComponent_C.OnSkinAssignCompleted
// 0x0048 (0x0048 - 0x0000)
struct BP_CharacterSkinComponent_C_OnSkinAssignCompleted final
{
public:
	class AActor*                                 NewBodySkinObject;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 NewFaceSkinObject;                                 // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UMeshComponent*>                 CallFunc_K2_GetComponentsByClass_ReturnValue;      // 0x0028(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UMeshComponent*                         CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CharacterSkinComponent_C_OnSkinAssignCompleted) == 0x000008, "Wrong alignment on BP_CharacterSkinComponent_C_OnSkinAssignCompleted");
static_assert(sizeof(BP_CharacterSkinComponent_C_OnSkinAssignCompleted) == 0x000048, "Wrong size on BP_CharacterSkinComponent_C_OnSkinAssignCompleted");
static_assert(offsetof(BP_CharacterSkinComponent_C_OnSkinAssignCompleted, NewBodySkinObject) == 0x000000, "Member 'BP_CharacterSkinComponent_C_OnSkinAssignCompleted::NewBodySkinObject' has a wrong offset!");
static_assert(offsetof(BP_CharacterSkinComponent_C_OnSkinAssignCompleted, NewFaceSkinObject) == 0x000008, "Member 'BP_CharacterSkinComponent_C_OnSkinAssignCompleted::NewFaceSkinObject' has a wrong offset!");
static_assert(offsetof(BP_CharacterSkinComponent_C_OnSkinAssignCompleted, Temp_int_Array_Index_Variable) == 0x000010, "Member 'BP_CharacterSkinComponent_C_OnSkinAssignCompleted::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_CharacterSkinComponent_C_OnSkinAssignCompleted, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'BP_CharacterSkinComponent_C_OnSkinAssignCompleted::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_CharacterSkinComponent_C_OnSkinAssignCompleted, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'BP_CharacterSkinComponent_C_OnSkinAssignCompleted::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterSkinComponent_C_OnSkinAssignCompleted, CallFunc_GetOwner_ReturnValue) == 0x000020, "Member 'BP_CharacterSkinComponent_C_OnSkinAssignCompleted::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterSkinComponent_C_OnSkinAssignCompleted, CallFunc_K2_GetComponentsByClass_ReturnValue) == 0x000028, "Member 'BP_CharacterSkinComponent_C_OnSkinAssignCompleted::CallFunc_K2_GetComponentsByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterSkinComponent_C_OnSkinAssignCompleted, CallFunc_Array_Get_Item) == 0x000038, "Member 'BP_CharacterSkinComponent_C_OnSkinAssignCompleted::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_CharacterSkinComponent_C_OnSkinAssignCompleted, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'BP_CharacterSkinComponent_C_OnSkinAssignCompleted::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterSkinComponent_C_OnSkinAssignCompleted, CallFunc_Less_IntInt_ReturnValue) == 0x000044, "Member 'BP_CharacterSkinComponent_C_OnSkinAssignCompleted::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function BP_CharacterSkinComponent.BP_CharacterSkinComponent_C.OnFaceSkinAssigned
// 0x0018 (0x0018 - 0x0000)
struct BP_CharacterSkinComponent_C_OnFaceSkinAssigned final
{
public:
	class AActor*                                 NewFaceSkinObject;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_CharacterFaceBase_C*                K2Node_DynamicCast_AsBP_Character_Face_Base;       // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CharacterSkinComponent_C_OnFaceSkinAssigned) == 0x000008, "Wrong alignment on BP_CharacterSkinComponent_C_OnFaceSkinAssigned");
static_assert(sizeof(BP_CharacterSkinComponent_C_OnFaceSkinAssigned) == 0x000018, "Wrong size on BP_CharacterSkinComponent_C_OnFaceSkinAssigned");
static_assert(offsetof(BP_CharacterSkinComponent_C_OnFaceSkinAssigned, NewFaceSkinObject) == 0x000000, "Member 'BP_CharacterSkinComponent_C_OnFaceSkinAssigned::NewFaceSkinObject' has a wrong offset!");
static_assert(offsetof(BP_CharacterSkinComponent_C_OnFaceSkinAssigned, K2Node_DynamicCast_AsBP_Character_Face_Base) == 0x000008, "Member 'BP_CharacterSkinComponent_C_OnFaceSkinAssigned::K2Node_DynamicCast_AsBP_Character_Face_Base' has a wrong offset!");
static_assert(offsetof(BP_CharacterSkinComponent_C_OnFaceSkinAssigned, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'BP_CharacterSkinComponent_C_OnFaceSkinAssigned::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BP_CharacterSkinComponent.BP_CharacterSkinComponent_C.OnBodySkinAssigned
// 0x0018 (0x0018 - 0x0000)
struct BP_CharacterSkinComponent_C_OnBodySkinAssigned final
{
public:
	class AActor*                                 NewBodySkinObject;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_CharacterSkinBase_C*                K2Node_DynamicCast_AsBP_Character_Skin_Base;       // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CharacterSkinComponent_C_OnBodySkinAssigned) == 0x000008, "Wrong alignment on BP_CharacterSkinComponent_C_OnBodySkinAssigned");
static_assert(sizeof(BP_CharacterSkinComponent_C_OnBodySkinAssigned) == 0x000018, "Wrong size on BP_CharacterSkinComponent_C_OnBodySkinAssigned");
static_assert(offsetof(BP_CharacterSkinComponent_C_OnBodySkinAssigned, NewBodySkinObject) == 0x000000, "Member 'BP_CharacterSkinComponent_C_OnBodySkinAssigned::NewBodySkinObject' has a wrong offset!");
static_assert(offsetof(BP_CharacterSkinComponent_C_OnBodySkinAssigned, K2Node_DynamicCast_AsBP_Character_Skin_Base) == 0x000008, "Member 'BP_CharacterSkinComponent_C_OnBodySkinAssigned::K2Node_DynamicCast_AsBP_Character_Skin_Base' has a wrong offset!");
static_assert(offsetof(BP_CharacterSkinComponent_C_OnBodySkinAssigned, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'BP_CharacterSkinComponent_C_OnBodySkinAssigned::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BP_CharacterSkinComponent.BP_CharacterSkinComponent_C.GetCurrentAssignPolicy
// 0x0008 (0x0008 - 0x0000)
struct BP_CharacterSkinComponent_C_GetCurrentAssignPolicy final
{
public:
	class UCharacterSkinAssignPolicy*             SkinAssignPolicy_0;                                // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CharacterSkinComponent_C_GetCurrentAssignPolicy) == 0x000008, "Wrong alignment on BP_CharacterSkinComponent_C_GetCurrentAssignPolicy");
static_assert(sizeof(BP_CharacterSkinComponent_C_GetCurrentAssignPolicy) == 0x000008, "Wrong size on BP_CharacterSkinComponent_C_GetCurrentAssignPolicy");
static_assert(offsetof(BP_CharacterSkinComponent_C_GetCurrentAssignPolicy, SkinAssignPolicy_0) == 0x000000, "Member 'BP_CharacterSkinComponent_C_GetCurrentAssignPolicy::SkinAssignPolicy_0' has a wrong offset!");

// Function BP_CharacterSkinComponent.BP_CharacterSkinComponent_C.ConstructSkinAssignPolicy
// 0x0008 (0x0008 - 0x0000)
struct BP_CharacterSkinComponent_C_ConstructSkinAssignPolicy final
{
public:
	class UCharacterSkinAssignPolicy*             CallFunc_SpawnObject_ReturnValue;                  // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CharacterSkinComponent_C_ConstructSkinAssignPolicy) == 0x000008, "Wrong alignment on BP_CharacterSkinComponent_C_ConstructSkinAssignPolicy");
static_assert(sizeof(BP_CharacterSkinComponent_C_ConstructSkinAssignPolicy) == 0x000008, "Wrong size on BP_CharacterSkinComponent_C_ConstructSkinAssignPolicy");
static_assert(offsetof(BP_CharacterSkinComponent_C_ConstructSkinAssignPolicy, CallFunc_SpawnObject_ReturnValue) == 0x000000, "Member 'BP_CharacterSkinComponent_C_ConstructSkinAssignPolicy::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");

// Function BP_CharacterSkinComponent.BP_CharacterSkinComponent_C.ApplyFootstepWithSkin
// 0x0018 (0x0018 - 0x0000)
struct BP_CharacterSkinComponent_C_ApplyFootstepWithSkin final
{
public:
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_FootstepVisualComponent_C*          CallFunc_GetComponentByClass_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CharacterSkinComponent_C_ApplyFootstepWithSkin) == 0x000008, "Wrong alignment on BP_CharacterSkinComponent_C_ApplyFootstepWithSkin");
static_assert(sizeof(BP_CharacterSkinComponent_C_ApplyFootstepWithSkin) == 0x000018, "Wrong size on BP_CharacterSkinComponent_C_ApplyFootstepWithSkin");
static_assert(offsetof(BP_CharacterSkinComponent_C_ApplyFootstepWithSkin, CallFunc_GetOwner_ReturnValue) == 0x000000, "Member 'BP_CharacterSkinComponent_C_ApplyFootstepWithSkin::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterSkinComponent_C_ApplyFootstepWithSkin, CallFunc_GetComponentByClass_ReturnValue) == 0x000008, "Member 'BP_CharacterSkinComponent_C_ApplyFootstepWithSkin::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterSkinComponent_C_ApplyFootstepWithSkin, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'BP_CharacterSkinComponent_C_ApplyFootstepWithSkin::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_CharacterSkinComponent.BP_CharacterSkinComponent_C.ApplyAnimationProfile
// 0x0020 (0x0020 - 0x0000)
struct BP_CharacterSkinComponent_C_ApplyAnimationProfile final
{
public:
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_Component_WorldAnimationProfile_C*  CallFunc_GetComponentByClass_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UBP_Component_WorldAnimationProfile_C*  Temp_wildcard_Variable;                            // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CharacterSkinComponent_C_ApplyAnimationProfile) == 0x000008, "Wrong alignment on BP_CharacterSkinComponent_C_ApplyAnimationProfile");
static_assert(sizeof(BP_CharacterSkinComponent_C_ApplyAnimationProfile) == 0x000020, "Wrong size on BP_CharacterSkinComponent_C_ApplyAnimationProfile");
static_assert(offsetof(BP_CharacterSkinComponent_C_ApplyAnimationProfile, CallFunc_GetOwner_ReturnValue) == 0x000000, "Member 'BP_CharacterSkinComponent_C_ApplyAnimationProfile::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterSkinComponent_C_ApplyAnimationProfile, CallFunc_GetComponentByClass_ReturnValue) == 0x000008, "Member 'BP_CharacterSkinComponent_C_ApplyAnimationProfile::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterSkinComponent_C_ApplyAnimationProfile, Temp_wildcard_Variable) == 0x000010, "Member 'BP_CharacterSkinComponent_C_ApplyAnimationProfile::Temp_wildcard_Variable' has a wrong offset!");
static_assert(offsetof(BP_CharacterSkinComponent_C_ApplyAnimationProfile, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'BP_CharacterSkinComponent_C_ApplyAnimationProfile::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_CharacterSkinComponent.BP_CharacterSkinComponent_C.TryCacheCharacterBody
// 0x0010 (0x0010 - 0x0000)
struct BP_CharacterSkinComponent_C_TryCacheCharacterBody final
{
public:
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_GetCharacterBody_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CharacterSkinComponent_C_TryCacheCharacterBody) == 0x000008, "Wrong alignment on BP_CharacterSkinComponent_C_TryCacheCharacterBody");
static_assert(sizeof(BP_CharacterSkinComponent_C_TryCacheCharacterBody) == 0x000010, "Wrong size on BP_CharacterSkinComponent_C_TryCacheCharacterBody");
static_assert(offsetof(BP_CharacterSkinComponent_C_TryCacheCharacterBody, CallFunc_GetOwner_ReturnValue) == 0x000000, "Member 'BP_CharacterSkinComponent_C_TryCacheCharacterBody::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterSkinComponent_C_TryCacheCharacterBody, CallFunc_GetCharacterBody_ReturnValue) == 0x000008, "Member 'BP_CharacterSkinComponent_C_TryCacheCharacterBody::CallFunc_GetCharacterBody_ReturnValue' has a wrong offset!");

// Function BP_CharacterSkinComponent.BP_CharacterSkinComponent_C.TryCacheCharacterFace
// 0x0010 (0x0010 - 0x0000)
struct BP_CharacterSkinComponent_C_TryCacheCharacterFace final
{
public:
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_GetCharacterFace_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CharacterSkinComponent_C_TryCacheCharacterFace) == 0x000008, "Wrong alignment on BP_CharacterSkinComponent_C_TryCacheCharacterFace");
static_assert(sizeof(BP_CharacterSkinComponent_C_TryCacheCharacterFace) == 0x000010, "Wrong size on BP_CharacterSkinComponent_C_TryCacheCharacterFace");
static_assert(offsetof(BP_CharacterSkinComponent_C_TryCacheCharacterFace, CallFunc_GetOwner_ReturnValue) == 0x000000, "Member 'BP_CharacterSkinComponent_C_TryCacheCharacterFace::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterSkinComponent_C_TryCacheCharacterFace, CallFunc_GetCharacterFace_ReturnValue) == 0x000008, "Member 'BP_CharacterSkinComponent_C_TryCacheCharacterFace::CallFunc_GetCharacterFace_ReturnValue' has a wrong offset!");

// Function BP_CharacterSkinComponent.BP_CharacterSkinComponent_C.SetupCharacterFace
// 0x0001 (0x0001 - 0x0000)
struct BP_CharacterSkinComponent_C_SetupCharacterFace final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CharacterSkinComponent_C_SetupCharacterFace) == 0x000001, "Wrong alignment on BP_CharacterSkinComponent_C_SetupCharacterFace");
static_assert(sizeof(BP_CharacterSkinComponent_C_SetupCharacterFace) == 0x000001, "Wrong size on BP_CharacterSkinComponent_C_SetupCharacterFace");
static_assert(offsetof(BP_CharacterSkinComponent_C_SetupCharacterFace, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'BP_CharacterSkinComponent_C_SetupCharacterFace::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_CharacterSkinComponent.BP_CharacterSkinComponent_C.GetFaceSkeletalMesh
// 0x0008 (0x0008 - 0x0000)
struct BP_CharacterSkinComponent_C_GetFaceSkeletalMesh final
{
public:
	class USkeletalMeshComponent*                 Face;                                              // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CharacterSkinComponent_C_GetFaceSkeletalMesh) == 0x000008, "Wrong alignment on BP_CharacterSkinComponent_C_GetFaceSkeletalMesh");
static_assert(sizeof(BP_CharacterSkinComponent_C_GetFaceSkeletalMesh) == 0x000008, "Wrong size on BP_CharacterSkinComponent_C_GetFaceSkeletalMesh");
static_assert(offsetof(BP_CharacterSkinComponent_C_GetFaceSkeletalMesh, Face) == 0x000000, "Member 'BP_CharacterSkinComponent_C_GetFaceSkeletalMesh::Face' has a wrong offset!");

// Function BP_CharacterSkinComponent.BP_CharacterSkinComponent_C.UpdateArmRing
// 0x0020 (0x0020 - 0x0000)
struct BP_CharacterSkinComponent_C_UpdateArmRing final
{
public:
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UNiagaraComponent*>              CallFunc_GetArmRingNiagaraComponents_Array;        // 0x0008(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_GetArmRingNiagaraComponents_ArmRingMaterialIndex; // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CharacterSkinComponent_C_UpdateArmRing) == 0x000008, "Wrong alignment on BP_CharacterSkinComponent_C_UpdateArmRing");
static_assert(sizeof(BP_CharacterSkinComponent_C_UpdateArmRing) == 0x000020, "Wrong size on BP_CharacterSkinComponent_C_UpdateArmRing");
static_assert(offsetof(BP_CharacterSkinComponent_C_UpdateArmRing, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000000, "Member 'BP_CharacterSkinComponent_C_UpdateArmRing::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterSkinComponent_C_UpdateArmRing, CallFunc_GetArmRingNiagaraComponents_Array) == 0x000008, "Member 'BP_CharacterSkinComponent_C_UpdateArmRing::CallFunc_GetArmRingNiagaraComponents_Array' has a wrong offset!");
static_assert(offsetof(BP_CharacterSkinComponent_C_UpdateArmRing, CallFunc_GetArmRingNiagaraComponents_ArmRingMaterialIndex) == 0x000018, "Member 'BP_CharacterSkinComponent_C_UpdateArmRing::CallFunc_GetArmRingNiagaraComponents_ArmRingMaterialIndex' has a wrong offset!");

// Function BP_CharacterSkinComponent.BP_CharacterSkinComponent_C.GetArmRingMaterialInstance
// 0x0008 (0x0008 - 0x0000)
struct BP_CharacterSkinComponent_C_GetArmRingMaterialInstance final
{
public:
	class UMaterialInstanceDynamic*               ArmRingMaterialInstance_0;                         // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CharacterSkinComponent_C_GetArmRingMaterialInstance) == 0x000008, "Wrong alignment on BP_CharacterSkinComponent_C_GetArmRingMaterialInstance");
static_assert(sizeof(BP_CharacterSkinComponent_C_GetArmRingMaterialInstance) == 0x000008, "Wrong size on BP_CharacterSkinComponent_C_GetArmRingMaterialInstance");
static_assert(offsetof(BP_CharacterSkinComponent_C_GetArmRingMaterialInstance, ArmRingMaterialInstance_0) == 0x000000, "Member 'BP_CharacterSkinComponent_C_GetArmRingMaterialInstance::ArmRingMaterialInstance_0' has a wrong offset!");

// Function BP_CharacterSkinComponent.BP_CharacterSkinComponent_C.GetArmRingMaterialIndex
// 0x0004 (0x0004 - 0x0000)
struct BP_CharacterSkinComponent_C_GetArmRingMaterialIndex final
{
public:
	int32                                         ArmRingMaterialIndex_0;                            // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CharacterSkinComponent_C_GetArmRingMaterialIndex) == 0x000004, "Wrong alignment on BP_CharacterSkinComponent_C_GetArmRingMaterialIndex");
static_assert(sizeof(BP_CharacterSkinComponent_C_GetArmRingMaterialIndex) == 0x000004, "Wrong size on BP_CharacterSkinComponent_C_GetArmRingMaterialIndex");
static_assert(offsetof(BP_CharacterSkinComponent_C_GetArmRingMaterialIndex, ArmRingMaterialIndex_0) == 0x000000, "Member 'BP_CharacterSkinComponent_C_GetArmRingMaterialIndex::ArmRingMaterialIndex_0' has a wrong offset!");

// Function BP_CharacterSkinComponent.BP_CharacterSkinComponent_C.GetArmRingComponents
// 0x0010 (0x0010 - 0x0000)
struct BP_CharacterSkinComponent_C_GetArmRingComponents final
{
public:
	TArray<class UNiagaraComponent*>              ArmRingComponents_0;                               // 0x0000(0x0010)(Parm, OutParm, ContainsInstancedReference)
};
static_assert(alignof(BP_CharacterSkinComponent_C_GetArmRingComponents) == 0x000008, "Wrong alignment on BP_CharacterSkinComponent_C_GetArmRingComponents");
static_assert(sizeof(BP_CharacterSkinComponent_C_GetArmRingComponents) == 0x000010, "Wrong size on BP_CharacterSkinComponent_C_GetArmRingComponents");
static_assert(offsetof(BP_CharacterSkinComponent_C_GetArmRingComponents, ArmRingComponents_0) == 0x000000, "Member 'BP_CharacterSkinComponent_C_GetArmRingComponents::ArmRingComponents_0' has a wrong offset!");

// Function BP_CharacterSkinComponent.BP_CharacterSkinComponent_C.GetSkinMaterialInstances
// 0x0010 (0x0010 - 0x0000)
struct BP_CharacterSkinComponent_C_GetSkinMaterialInstances final
{
public:
	TArray<class UMaterialInstanceDynamic*>       SkinMaterialInstances;                             // 0x0000(0x0010)(Parm, OutParm)
};
static_assert(alignof(BP_CharacterSkinComponent_C_GetSkinMaterialInstances) == 0x000008, "Wrong alignment on BP_CharacterSkinComponent_C_GetSkinMaterialInstances");
static_assert(sizeof(BP_CharacterSkinComponent_C_GetSkinMaterialInstances) == 0x000010, "Wrong size on BP_CharacterSkinComponent_C_GetSkinMaterialInstances");
static_assert(offsetof(BP_CharacterSkinComponent_C_GetSkinMaterialInstances, SkinMaterialInstances) == 0x000000, "Member 'BP_CharacterSkinComponent_C_GetSkinMaterialInstances::SkinMaterialInstances' has a wrong offset!");

// Function BP_CharacterSkinComponent.BP_CharacterSkinComponent_C.UpdateCharacterSkinMaterialInstances
// 0x0068 (0x0068 - 0x0000)
struct BP_CharacterSkinComponent_C_UpdateCharacterSkinMaterialInstances final
{
public:
	TArray<class FName>                           Temp_wildcard_Variable;                            // 0x0000(0x0010)(ReferenceParm)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_GetMaterialSlotNames_ReturnValue;         // 0x0030(0x0010)(ReferenceParm)
	int32                                         CallFunc_GetMaterialIndex_ReturnValue;             // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     CallFunc_GetMaterial_ReturnValue;                  // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CharacterSkinComponent_C_UpdateCharacterSkinMaterialInstances) == 0x000008, "Wrong alignment on BP_CharacterSkinComponent_C_UpdateCharacterSkinMaterialInstances");
static_assert(sizeof(BP_CharacterSkinComponent_C_UpdateCharacterSkinMaterialInstances) == 0x000068, "Wrong size on BP_CharacterSkinComponent_C_UpdateCharacterSkinMaterialInstances");
static_assert(offsetof(BP_CharacterSkinComponent_C_UpdateCharacterSkinMaterialInstances, Temp_wildcard_Variable) == 0x000000, "Member 'BP_CharacterSkinComponent_C_UpdateCharacterSkinMaterialInstances::Temp_wildcard_Variable' has a wrong offset!");
static_assert(offsetof(BP_CharacterSkinComponent_C_UpdateCharacterSkinMaterialInstances, Temp_int_Array_Index_Variable) == 0x000010, "Member 'BP_CharacterSkinComponent_C_UpdateCharacterSkinMaterialInstances::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_CharacterSkinComponent_C_UpdateCharacterSkinMaterialInstances, CallFunc_Array_Length_ReturnValue) == 0x000014, "Member 'BP_CharacterSkinComponent_C_UpdateCharacterSkinMaterialInstances::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterSkinComponent_C_UpdateCharacterSkinMaterialInstances, CallFunc_Array_Get_Item) == 0x000018, "Member 'BP_CharacterSkinComponent_C_UpdateCharacterSkinMaterialInstances::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_CharacterSkinComponent_C_UpdateCharacterSkinMaterialInstances, Temp_int_Loop_Counter_Variable) == 0x000020, "Member 'BP_CharacterSkinComponent_C_UpdateCharacterSkinMaterialInstances::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_CharacterSkinComponent_C_UpdateCharacterSkinMaterialInstances, CallFunc_Less_IntInt_ReturnValue) == 0x000024, "Member 'BP_CharacterSkinComponent_C_UpdateCharacterSkinMaterialInstances::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterSkinComponent_C_UpdateCharacterSkinMaterialInstances, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'BP_CharacterSkinComponent_C_UpdateCharacterSkinMaterialInstances::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterSkinComponent_C_UpdateCharacterSkinMaterialInstances, CallFunc_GetMaterialSlotNames_ReturnValue) == 0x000030, "Member 'BP_CharacterSkinComponent_C_UpdateCharacterSkinMaterialInstances::CallFunc_GetMaterialSlotNames_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterSkinComponent_C_UpdateCharacterSkinMaterialInstances, CallFunc_GetMaterialIndex_ReturnValue) == 0x000040, "Member 'BP_CharacterSkinComponent_C_UpdateCharacterSkinMaterialInstances::CallFunc_GetMaterialIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterSkinComponent_C_UpdateCharacterSkinMaterialInstances, CallFunc_GetMaterial_ReturnValue) == 0x000048, "Member 'BP_CharacterSkinComponent_C_UpdateCharacterSkinMaterialInstances::CallFunc_GetMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterSkinComponent_C_UpdateCharacterSkinMaterialInstances, CallFunc_IsValid_ReturnValue) == 0x000050, "Member 'BP_CharacterSkinComponent_C_UpdateCharacterSkinMaterialInstances::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterSkinComponent_C_UpdateCharacterSkinMaterialInstances, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000058, "Member 'BP_CharacterSkinComponent_C_UpdateCharacterSkinMaterialInstances::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterSkinComponent_C_UpdateCharacterSkinMaterialInstances, CallFunc_Array_Add_ReturnValue) == 0x000060, "Member 'BP_CharacterSkinComponent_C_UpdateCharacterSkinMaterialInstances::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function BP_CharacterSkinComponent.BP_CharacterSkinComponent_C.CacheAnimationConfig
// 0x0010 (0x0010 - 0x0000)
struct BP_CharacterSkinComponent_C_CacheAnimationConfig final
{
public:
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CharacterSkinComponent_C_CacheAnimationConfig) == 0x000008, "Wrong alignment on BP_CharacterSkinComponent_C_CacheAnimationConfig");
static_assert(sizeof(BP_CharacterSkinComponent_C_CacheAnimationConfig) == 0x000010, "Wrong size on BP_CharacterSkinComponent_C_CacheAnimationConfig");
static_assert(offsetof(BP_CharacterSkinComponent_C_CacheAnimationConfig, CallFunc_GetAnimInstance_ReturnValue) == 0x000000, "Member 'BP_CharacterSkinComponent_C_CacheAnimationConfig::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterSkinComponent_C_CacheAnimationConfig, CallFunc_GetObjectClass_ReturnValue) == 0x000008, "Member 'BP_CharacterSkinComponent_C_CacheAnimationConfig::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");

// Function BP_CharacterSkinComponent.BP_CharacterSkinComponent_C.ShouldApplyCustomization
// 0x0058 (0x0058 - 0x0000)
struct BP_CharacterSkinComponent_C_ShouldApplyCustomization final
{
public:
	struct FS_CharacterCustomization              CharacterCustomization;                            // 0x0000(0x0050)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0050(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid__CharacterCustomization__Valid;   // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual__CharacterCustomization__Result; // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0053(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CharacterSkinComponent_C_ShouldApplyCustomization) == 0x000008, "Wrong alignment on BP_CharacterSkinComponent_C_ShouldApplyCustomization");
static_assert(sizeof(BP_CharacterSkinComponent_C_ShouldApplyCustomization) == 0x000058, "Wrong size on BP_CharacterSkinComponent_C_ShouldApplyCustomization");
static_assert(offsetof(BP_CharacterSkinComponent_C_ShouldApplyCustomization, CharacterCustomization) == 0x000000, "Member 'BP_CharacterSkinComponent_C_ShouldApplyCustomization::CharacterCustomization' has a wrong offset!");
static_assert(offsetof(BP_CharacterSkinComponent_C_ShouldApplyCustomization, Result) == 0x000050, "Member 'BP_CharacterSkinComponent_C_ShouldApplyCustomization::Result' has a wrong offset!");
static_assert(offsetof(BP_CharacterSkinComponent_C_ShouldApplyCustomization, CallFunc_IsValid__CharacterCustomization__Valid) == 0x000051, "Member 'BP_CharacterSkinComponent_C_ShouldApplyCustomization::CallFunc_IsValid__CharacterCustomization__Valid' has a wrong offset!");
static_assert(offsetof(BP_CharacterSkinComponent_C_ShouldApplyCustomization, CallFunc_NotEqual__CharacterCustomization__Result) == 0x000052, "Member 'BP_CharacterSkinComponent_C_ShouldApplyCustomization::CallFunc_NotEqual__CharacterCustomization__Result' has a wrong offset!");
static_assert(offsetof(BP_CharacterSkinComponent_C_ShouldApplyCustomization, CallFunc_BooleanAND_ReturnValue) == 0x000053, "Member 'BP_CharacterSkinComponent_C_ShouldApplyCustomization::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BP_CharacterSkinComponent.BP_CharacterSkinComponent_C.OverrideCharacterSkin
// 0x0010 (0x0010 - 0x0000)
struct BP_CharacterSkinComponent_C_OverrideCharacterSkin final
{
public:
	class UClass*                                 Character_Skin;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   Character_Name;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CharacterSkinComponent_C_OverrideCharacterSkin) == 0x000008, "Wrong alignment on BP_CharacterSkinComponent_C_OverrideCharacterSkin");
static_assert(sizeof(BP_CharacterSkinComponent_C_OverrideCharacterSkin) == 0x000010, "Wrong size on BP_CharacterSkinComponent_C_OverrideCharacterSkin");
static_assert(offsetof(BP_CharacterSkinComponent_C_OverrideCharacterSkin, Character_Skin) == 0x000000, "Member 'BP_CharacterSkinComponent_C_OverrideCharacterSkin::Character_Skin' has a wrong offset!");
static_assert(offsetof(BP_CharacterSkinComponent_C_OverrideCharacterSkin, Character_Name) == 0x000008, "Member 'BP_CharacterSkinComponent_C_OverrideCharacterSkin::Character_Name' has a wrong offset!");

// Function BP_CharacterSkinComponent.BP_CharacterSkinComponent_C.OverrideCharacterFace
// 0x0010 (0x0010 - 0x0000)
struct BP_CharacterSkinComponent_C_OverrideCharacterFace final
{
public:
	class UClass*                                 Skin_Face;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   Character_Name;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CharacterSkinComponent_C_OverrideCharacterFace) == 0x000008, "Wrong alignment on BP_CharacterSkinComponent_C_OverrideCharacterFace");
static_assert(sizeof(BP_CharacterSkinComponent_C_OverrideCharacterFace) == 0x000010, "Wrong size on BP_CharacterSkinComponent_C_OverrideCharacterFace");
static_assert(offsetof(BP_CharacterSkinComponent_C_OverrideCharacterFace, Skin_Face) == 0x000000, "Member 'BP_CharacterSkinComponent_C_OverrideCharacterFace::Skin_Face' has a wrong offset!");
static_assert(offsetof(BP_CharacterSkinComponent_C_OverrideCharacterFace, Character_Name) == 0x000008, "Member 'BP_CharacterSkinComponent_C_OverrideCharacterFace::Character_Name' has a wrong offset!");

// Function BP_CharacterSkinComponent.BP_CharacterSkinComponent_C.SetCharacterCustomization
// 0x0058 (0x0058 - 0x0000)
struct BP_CharacterSkinComponent_C_SetCharacterCustomization final
{
public:
	class FName                                   Character_Name;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_CharacterCustomization              Character_Customization;                           // 0x0008(0x0050)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(BP_CharacterSkinComponent_C_SetCharacterCustomization) == 0x000008, "Wrong alignment on BP_CharacterSkinComponent_C_SetCharacterCustomization");
static_assert(sizeof(BP_CharacterSkinComponent_C_SetCharacterCustomization) == 0x000058, "Wrong size on BP_CharacterSkinComponent_C_SetCharacterCustomization");
static_assert(offsetof(BP_CharacterSkinComponent_C_SetCharacterCustomization, Character_Name) == 0x000000, "Member 'BP_CharacterSkinComponent_C_SetCharacterCustomization::Character_Name' has a wrong offset!");
static_assert(offsetof(BP_CharacterSkinComponent_C_SetCharacterCustomization, Character_Customization) == 0x000008, "Member 'BP_CharacterSkinComponent_C_SetCharacterCustomization::Character_Customization' has a wrong offset!");

// Function BP_CharacterSkinComponent.BP_CharacterSkinComponent_C.ApplyCurrentCharacterSkin
// 0x0008 (0x0008 - 0x0000)
struct BP_CharacterSkinComponent_C_ApplyCurrentCharacterSkin final
{
public:
	class FName                                   Character_Name;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CharacterSkinComponent_C_ApplyCurrentCharacterSkin) == 0x000004, "Wrong alignment on BP_CharacterSkinComponent_C_ApplyCurrentCharacterSkin");
static_assert(sizeof(BP_CharacterSkinComponent_C_ApplyCurrentCharacterSkin) == 0x000008, "Wrong size on BP_CharacterSkinComponent_C_ApplyCurrentCharacterSkin");
static_assert(offsetof(BP_CharacterSkinComponent_C_ApplyCurrentCharacterSkin, Character_Name) == 0x000000, "Member 'BP_CharacterSkinComponent_C_ApplyCurrentCharacterSkin::Character_Name' has a wrong offset!");

// Function BP_CharacterSkinComponent.BP_CharacterSkinComponent_C.ApplyCurrentCharacterFace
// 0x0008 (0x0008 - 0x0000)
struct BP_CharacterSkinComponent_C_ApplyCurrentCharacterFace final
{
public:
	class FName                                   Character_Name;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CharacterSkinComponent_C_ApplyCurrentCharacterFace) == 0x000004, "Wrong alignment on BP_CharacterSkinComponent_C_ApplyCurrentCharacterFace");
static_assert(sizeof(BP_CharacterSkinComponent_C_ApplyCurrentCharacterFace) == 0x000008, "Wrong size on BP_CharacterSkinComponent_C_ApplyCurrentCharacterFace");
static_assert(offsetof(BP_CharacterSkinComponent_C_ApplyCurrentCharacterFace, Character_Name) == 0x000000, "Member 'BP_CharacterSkinComponent_C_ApplyCurrentCharacterFace::Character_Name' has a wrong offset!");

// Function BP_CharacterSkinComponent.BP_CharacterSkinComponent_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_CharacterSkinComponent_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CharacterSkinComponent_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_CharacterSkinComponent_C_ReceiveEndPlay");
static_assert(sizeof(BP_CharacterSkinComponent_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_CharacterSkinComponent_C_ReceiveEndPlay");
static_assert(offsetof(BP_CharacterSkinComponent_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_CharacterSkinComponent_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function BP_CharacterSkinComponent.BP_CharacterSkinComponent_C.ExecuteUbergraph_BP_CharacterSkinComponent
// 0x00F0 (0x00F0 - 0x0000)
struct BP_CharacterSkinComponent_C_ExecuteUbergraph_BP_CharacterSkinComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 K2Node_CustomEvent_Character_Skin;                 // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_Character_Name_4;               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_CustomEvent_Skin_Face;                      // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_Character_Name_3;               // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_Character_Name_2;               // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_CharacterCustomization              K2Node_CustomEvent_Character_Customization;        // 0x0030(0x0050)(HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_Character_Name_1;               // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_Character_Name;                 // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* NewBodySkinObject)> K2Node_CreateDelegate_OutputDelegate;           // 0x0090(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* NewFaceSkinObject)> K2Node_CreateDelegate_OutputDelegate_1;         // 0x00A0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* NewBodySkinObject, class AActor* NewFaceSkinObject)> K2Node_CreateDelegate_OutputDelegate_2; // 0x00B0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_2;                   // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_3;                   // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_4;                   // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CharacterSkinComponent_C_ExecuteUbergraph_BP_CharacterSkinComponent) == 0x000008, "Wrong alignment on BP_CharacterSkinComponent_C_ExecuteUbergraph_BP_CharacterSkinComponent");
static_assert(sizeof(BP_CharacterSkinComponent_C_ExecuteUbergraph_BP_CharacterSkinComponent) == 0x0000F0, "Wrong size on BP_CharacterSkinComponent_C_ExecuteUbergraph_BP_CharacterSkinComponent");
static_assert(offsetof(BP_CharacterSkinComponent_C_ExecuteUbergraph_BP_CharacterSkinComponent, EntryPoint) == 0x000000, "Member 'BP_CharacterSkinComponent_C_ExecuteUbergraph_BP_CharacterSkinComponent::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_CharacterSkinComponent_C_ExecuteUbergraph_BP_CharacterSkinComponent, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'BP_CharacterSkinComponent_C_ExecuteUbergraph_BP_CharacterSkinComponent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
