#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CustomShapeExtruder

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_CustomShapeExtruder.BP_CustomShapeExtruder_C
// 0x0028 (0x02B8 - 0x0290)
class ABP_CustomShapeExtruder_C : public AActor
{
public:
	class UBillboardComponent*                    Billboard_EditorOnly;                              // 0x0290(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDynamicMeshComponent*                  TriggerDynamicMesh;                                // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USplineComponent*                       ConstructionSpline;                                // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        TriggerShapeHeight;                                // 0x02B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_CustomShapeExtruder_C">();
	}
	static class ABP_CustomShapeExtruder_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_CustomShapeExtruder_C>();
	}
};
static_assert(alignof(ABP_CustomShapeExtruder_C) == 0x000008, "Wrong alignment on ABP_CustomShapeExtruder_C");
static_assert(sizeof(ABP_CustomShapeExtruder_C) == 0x0002B8, "Wrong size on ABP_CustomShapeExtruder_C");
static_assert(offsetof(ABP_CustomShapeExtruder_C, Billboard_EditorOnly) == 0x000290, "Member 'ABP_CustomShapeExtruder_C::Billboard_EditorOnly' has a wrong offset!");
static_assert(offsetof(ABP_CustomShapeExtruder_C, TriggerDynamicMesh) == 0x000298, "Member 'ABP_CustomShapeExtruder_C::TriggerDynamicMesh' has a wrong offset!");
static_assert(offsetof(ABP_CustomShapeExtruder_C, ConstructionSpline) == 0x0002A0, "Member 'ABP_CustomShapeExtruder_C::ConstructionSpline' has a wrong offset!");
static_assert(offsetof(ABP_CustomShapeExtruder_C, DefaultSceneRoot) == 0x0002A8, "Member 'ABP_CustomShapeExtruder_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_CustomShapeExtruder_C, TriggerShapeHeight) == 0x0002B0, "Member 'ABP_CustomShapeExtruder_C::TriggerShapeHeight' has a wrong offset!");

}

