#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CinematicCharacterSkinComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_CinematicCharacterSkinComponent.BP_CinematicCharacterSkinComponent_C.CheckForErrors
// 0x00A8 (0x00A8 - 0x0000)
struct BP_CinematicCharacterSkinComponent_C_CheckForErrors final
{
public:
	TArray<class FText>                           ErrorMessages;                                     // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoesDataTableRowExist_ReturnValue;        // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13[0x5];                                       // 0x0013(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_NameToText_ReturnValue;              // 0x0018(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0028(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0070(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Format_ReturnValue;                       // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0090(0x0010)()
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CinematicCharacterSkinComponent_C_CheckForErrors) == 0x000008, "Wrong alignment on BP_CinematicCharacterSkinComponent_C_CheckForErrors");
static_assert(sizeof(BP_CinematicCharacterSkinComponent_C_CheckForErrors) == 0x0000A8, "Wrong size on BP_CinematicCharacterSkinComponent_C_CheckForErrors");
static_assert(offsetof(BP_CinematicCharacterSkinComponent_C_CheckForErrors, ErrorMessages) == 0x000000, "Member 'BP_CinematicCharacterSkinComponent_C_CheckForErrors::ErrorMessages' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacterSkinComponent_C_CheckForErrors, ReturnValue) == 0x000010, "Member 'BP_CinematicCharacterSkinComponent_C_CheckForErrors::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacterSkinComponent_C_CheckForErrors, CallFunc_DoesDataTableRowExist_ReturnValue) == 0x000011, "Member 'BP_CinematicCharacterSkinComponent_C_CheckForErrors::CallFunc_DoesDataTableRowExist_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacterSkinComponent_C_CheckForErrors, CallFunc_NotEqual_NameName_ReturnValue) == 0x000012, "Member 'BP_CinematicCharacterSkinComponent_C_CheckForErrors::CallFunc_NotEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacterSkinComponent_C_CheckForErrors, CallFunc_Conv_NameToText_ReturnValue) == 0x000018, "Member 'BP_CinematicCharacterSkinComponent_C_CheckForErrors::CallFunc_Conv_NameToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacterSkinComponent_C_CheckForErrors, K2Node_MakeStruct_FormatArgumentData) == 0x000028, "Member 'BP_CinematicCharacterSkinComponent_C_CheckForErrors::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacterSkinComponent_C_CheckForErrors, K2Node_MakeArray_Array) == 0x000070, "Member 'BP_CinematicCharacterSkinComponent_C_CheckForErrors::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacterSkinComponent_C_CheckForErrors, CallFunc_Format_ReturnValue) == 0x000080, "Member 'BP_CinematicCharacterSkinComponent_C_CheckForErrors::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacterSkinComponent_C_CheckForErrors, CallFunc_Conv_StringToText_ReturnValue) == 0x000090, "Member 'BP_CinematicCharacterSkinComponent_C_CheckForErrors::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacterSkinComponent_C_CheckForErrors, CallFunc_Array_Add_ReturnValue) == 0x0000A0, "Member 'BP_CinematicCharacterSkinComponent_C_CheckForErrors::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function BP_CinematicCharacterSkinComponent.BP_CinematicCharacterSkinComponent_C.SwapBody
// 0x00A0 (0x00A0 - 0x0000)
struct BP_CinematicCharacterSkinComponent_C_SwapBody final
{
public:
	class USkeletalMeshComponent*                 Body;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          NewSkeletalMesh;                                   // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class USceneComponent*>                local_ChildrenToSwap;                              // 0x0010(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	TArray<class USceneComponent*>                CallFunc_GetChildrenComponents_Children;           // 0x0020(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USceneComponent*>                Temp_wildcard_Variable;                            // 0x0040(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USceneComponent*>                Temp_wildcard_Variable_1;                          // 0x0058(0x0010)(ReferenceParm, ContainsInstancedReference)
	class USceneComponent*                        CallFunc_Array_Get_Item;                           // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7A[0x2];                                       // 0x007A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_Array_Get_Item_1;                         // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetAttachSocketName_ReturnValue;          // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CinematicCharacterSkinComponent_C_SwapBody) == 0x000008, "Wrong alignment on BP_CinematicCharacterSkinComponent_C_SwapBody");
static_assert(sizeof(BP_CinematicCharacterSkinComponent_C_SwapBody) == 0x0000A0, "Wrong size on BP_CinematicCharacterSkinComponent_C_SwapBody");
static_assert(offsetof(BP_CinematicCharacterSkinComponent_C_SwapBody, Body) == 0x000000, "Member 'BP_CinematicCharacterSkinComponent_C_SwapBody::Body' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacterSkinComponent_C_SwapBody, NewSkeletalMesh) == 0x000008, "Member 'BP_CinematicCharacterSkinComponent_C_SwapBody::NewSkeletalMesh' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacterSkinComponent_C_SwapBody, local_ChildrenToSwap) == 0x000010, "Member 'BP_CinematicCharacterSkinComponent_C_SwapBody::local_ChildrenToSwap' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacterSkinComponent_C_SwapBody, CallFunc_GetChildrenComponents_Children) == 0x000020, "Member 'BP_CinematicCharacterSkinComponent_C_SwapBody::CallFunc_GetChildrenComponents_Children' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacterSkinComponent_C_SwapBody, Temp_int_Loop_Counter_Variable) == 0x000030, "Member 'BP_CinematicCharacterSkinComponent_C_SwapBody::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacterSkinComponent_C_SwapBody, CallFunc_Add_IntInt_ReturnValue) == 0x000034, "Member 'BP_CinematicCharacterSkinComponent_C_SwapBody::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacterSkinComponent_C_SwapBody, Temp_int_Array_Index_Variable) == 0x000038, "Member 'BP_CinematicCharacterSkinComponent_C_SwapBody::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacterSkinComponent_C_SwapBody, Temp_wildcard_Variable) == 0x000040, "Member 'BP_CinematicCharacterSkinComponent_C_SwapBody::Temp_wildcard_Variable' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacterSkinComponent_C_SwapBody, CallFunc_Array_Length_ReturnValue) == 0x000050, "Member 'BP_CinematicCharacterSkinComponent_C_SwapBody::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacterSkinComponent_C_SwapBody, Temp_wildcard_Variable_1) == 0x000058, "Member 'BP_CinematicCharacterSkinComponent_C_SwapBody::Temp_wildcard_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacterSkinComponent_C_SwapBody, CallFunc_Array_Get_Item) == 0x000068, "Member 'BP_CinematicCharacterSkinComponent_C_SwapBody::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacterSkinComponent_C_SwapBody, CallFunc_Array_Length_ReturnValue_1) == 0x000070, "Member 'BP_CinematicCharacterSkinComponent_C_SwapBody::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacterSkinComponent_C_SwapBody, Temp_int_Loop_Counter_Variable_1) == 0x000074, "Member 'BP_CinematicCharacterSkinComponent_C_SwapBody::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacterSkinComponent_C_SwapBody, CallFunc_Less_IntInt_ReturnValue) == 0x000078, "Member 'BP_CinematicCharacterSkinComponent_C_SwapBody::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacterSkinComponent_C_SwapBody, CallFunc_Less_IntInt_ReturnValue_1) == 0x000079, "Member 'BP_CinematicCharacterSkinComponent_C_SwapBody::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacterSkinComponent_C_SwapBody, CallFunc_Add_IntInt_ReturnValue_1) == 0x00007C, "Member 'BP_CinematicCharacterSkinComponent_C_SwapBody::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacterSkinComponent_C_SwapBody, Temp_int_Array_Index_Variable_1) == 0x000080, "Member 'BP_CinematicCharacterSkinComponent_C_SwapBody::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacterSkinComponent_C_SwapBody, CallFunc_Array_Get_Item_1) == 0x000088, "Member 'BP_CinematicCharacterSkinComponent_C_SwapBody::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacterSkinComponent_C_SwapBody, CallFunc_GetAttachSocketName_ReturnValue) == 0x000090, "Member 'BP_CinematicCharacterSkinComponent_C_SwapBody::CallFunc_GetAttachSocketName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacterSkinComponent_C_SwapBody, CallFunc_K2_AttachToComponent_ReturnValue) == 0x000098, "Member 'BP_CinematicCharacterSkinComponent_C_SwapBody::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");

// Function BP_CinematicCharacterSkinComponent.BP_CinematicCharacterSkinComponent_C.ApplyCustomizationFromCharacterData
// 0x0018 (0x0018 - 0x0000)
struct BP_CinematicCharacterSkinComponent_C_ApplyCustomizationFromCharacterData final
{
public:
	bool                                          CallFunc_ShouldApplyAnyCustomization_ReturnValue;  // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldApplyUserCustomization_ReturnValue; // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_GetCharacterBody_ReturnValue;             // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CinematicCharacterSkinComponent_C_ApplyCustomizationFromCharacterData) == 0x000008, "Wrong alignment on BP_CinematicCharacterSkinComponent_C_ApplyCustomizationFromCharacterData");
static_assert(sizeof(BP_CinematicCharacterSkinComponent_C_ApplyCustomizationFromCharacterData) == 0x000018, "Wrong size on BP_CinematicCharacterSkinComponent_C_ApplyCustomizationFromCharacterData");
static_assert(offsetof(BP_CinematicCharacterSkinComponent_C_ApplyCustomizationFromCharacterData, CallFunc_ShouldApplyAnyCustomization_ReturnValue) == 0x000000, "Member 'BP_CinematicCharacterSkinComponent_C_ApplyCustomizationFromCharacterData::CallFunc_ShouldApplyAnyCustomization_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacterSkinComponent_C_ApplyCustomizationFromCharacterData, CallFunc_ShouldApplyUserCustomization_ReturnValue) == 0x000001, "Member 'BP_CinematicCharacterSkinComponent_C_ApplyCustomizationFromCharacterData::CallFunc_ShouldApplyUserCustomization_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacterSkinComponent_C_ApplyCustomizationFromCharacterData, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'BP_CinematicCharacterSkinComponent_C_ApplyCustomizationFromCharacterData::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacterSkinComponent_C_ApplyCustomizationFromCharacterData, CallFunc_GetCharacterBody_ReturnValue) == 0x000010, "Member 'BP_CinematicCharacterSkinComponent_C_ApplyCustomizationFromCharacterData::CallFunc_GetCharacterBody_ReturnValue' has a wrong offset!");

// Function BP_CinematicCharacterSkinComponent.BP_CinematicCharacterSkinComponent_C.ShouldApplyUserCustomization
// 0x0050 (0x0050 - 0x0000)
struct BP_CinematicCharacterSkinComponent_C_ShouldApplyUserCustomization final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_CineCharacter_Main_C*               K2Node_DynamicCast_AsBP_Cine_Character_Main;       // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInEditorPreview_ReturnValue;            // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B[0x5];                                       // 0x001B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_jRPG_GI_Custom_C*                   CallFunc_GetCustomGI_ReturnValue;                  // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasCharacterInCollectionByID_ReturnValue; // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UConfigurableGameUserSettings*          CallFunc_GetConfigurableGameUserSettings_GameUserSettings; // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetEnableCustomizationDuringCinematics_ReturnValue; // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_CinematicSystem_C*                  CallFunc_GetCinematicsSystem_ReturnValue;          // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInCinematicTransition_ReturnValue;      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x004B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CinematicCharacterSkinComponent_C_ShouldApplyUserCustomization) == 0x000008, "Wrong alignment on BP_CinematicCharacterSkinComponent_C_ShouldApplyUserCustomization");
static_assert(sizeof(BP_CinematicCharacterSkinComponent_C_ShouldApplyUserCustomization) == 0x000050, "Wrong size on BP_CinematicCharacterSkinComponent_C_ShouldApplyUserCustomization");
static_assert(offsetof(BP_CinematicCharacterSkinComponent_C_ShouldApplyUserCustomization, ReturnValue) == 0x000000, "Member 'BP_CinematicCharacterSkinComponent_C_ShouldApplyUserCustomization::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacterSkinComponent_C_ShouldApplyUserCustomization, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'BP_CinematicCharacterSkinComponent_C_ShouldApplyUserCustomization::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacterSkinComponent_C_ShouldApplyUserCustomization, K2Node_DynamicCast_AsBP_Cine_Character_Main) == 0x000010, "Member 'BP_CinematicCharacterSkinComponent_C_ShouldApplyUserCustomization::K2Node_DynamicCast_AsBP_Cine_Character_Main' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacterSkinComponent_C_ShouldApplyUserCustomization, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_CinematicCharacterSkinComponent_C_ShouldApplyUserCustomization::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacterSkinComponent_C_ShouldApplyUserCustomization, CallFunc_IsInEditorPreview_ReturnValue) == 0x000019, "Member 'BP_CinematicCharacterSkinComponent_C_ShouldApplyUserCustomization::CallFunc_IsInEditorPreview_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacterSkinComponent_C_ShouldApplyUserCustomization, CallFunc_Not_PreBool_ReturnValue) == 0x00001A, "Member 'BP_CinematicCharacterSkinComponent_C_ShouldApplyUserCustomization::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacterSkinComponent_C_ShouldApplyUserCustomization, CallFunc_GetCustomGI_ReturnValue) == 0x000020, "Member 'BP_CinematicCharacterSkinComponent_C_ShouldApplyUserCustomization::CallFunc_GetCustomGI_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacterSkinComponent_C_ShouldApplyUserCustomization, CallFunc_HasCharacterInCollectionByID_ReturnValue) == 0x000028, "Member 'BP_CinematicCharacterSkinComponent_C_ShouldApplyUserCustomization::CallFunc_HasCharacterInCollectionByID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacterSkinComponent_C_ShouldApplyUserCustomization, CallFunc_GetConfigurableGameUserSettings_GameUserSettings) == 0x000030, "Member 'BP_CinematicCharacterSkinComponent_C_ShouldApplyUserCustomization::CallFunc_GetConfigurableGameUserSettings_GameUserSettings' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacterSkinComponent_C_ShouldApplyUserCustomization, CallFunc_GetEnableCustomizationDuringCinematics_ReturnValue) == 0x000038, "Member 'BP_CinematicCharacterSkinComponent_C_ShouldApplyUserCustomization::CallFunc_GetEnableCustomizationDuringCinematics_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacterSkinComponent_C_ShouldApplyUserCustomization, CallFunc_GetCinematicsSystem_ReturnValue) == 0x000040, "Member 'BP_CinematicCharacterSkinComponent_C_ShouldApplyUserCustomization::CallFunc_GetCinematicsSystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacterSkinComponent_C_ShouldApplyUserCustomization, CallFunc_IsInCinematicTransition_ReturnValue) == 0x000048, "Member 'BP_CinematicCharacterSkinComponent_C_ShouldApplyUserCustomization::CallFunc_IsInCinematicTransition_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacterSkinComponent_C_ShouldApplyUserCustomization, CallFunc_IsValid_ReturnValue) == 0x000049, "Member 'BP_CinematicCharacterSkinComponent_C_ShouldApplyUserCustomization::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacterSkinComponent_C_ShouldApplyUserCustomization, CallFunc_Not_PreBool_ReturnValue_1) == 0x00004A, "Member 'BP_CinematicCharacterSkinComponent_C_ShouldApplyUserCustomization::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacterSkinComponent_C_ShouldApplyUserCustomization, CallFunc_BooleanAND_ReturnValue) == 0x00004B, "Member 'BP_CinematicCharacterSkinComponent_C_ShouldApplyUserCustomization::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BP_CinematicCharacterSkinComponent.BP_CinematicCharacterSkinComponent_C.ShouldApplyAnyCustomization
// 0x0004 (0x0004 - 0x0000)
struct BP_CinematicCharacterSkinComponent_C_ShouldApplyAnyCustomization final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsNameValid_ReturnValue;                  // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CinematicCharacterSkinComponent_C_ShouldApplyAnyCustomization) == 0x000001, "Wrong alignment on BP_CinematicCharacterSkinComponent_C_ShouldApplyAnyCustomization");
static_assert(sizeof(BP_CinematicCharacterSkinComponent_C_ShouldApplyAnyCustomization) == 0x000004, "Wrong size on BP_CinematicCharacterSkinComponent_C_ShouldApplyAnyCustomization");
static_assert(offsetof(BP_CinematicCharacterSkinComponent_C_ShouldApplyAnyCustomization, ReturnValue) == 0x000000, "Member 'BP_CinematicCharacterSkinComponent_C_ShouldApplyAnyCustomization::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacterSkinComponent_C_ShouldApplyAnyCustomization, CallFunc_BooleanOR_ReturnValue) == 0x000001, "Member 'BP_CinematicCharacterSkinComponent_C_ShouldApplyAnyCustomization::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacterSkinComponent_C_ShouldApplyAnyCustomization, CallFunc_IsNameValid_ReturnValue) == 0x000002, "Member 'BP_CinematicCharacterSkinComponent_C_ShouldApplyAnyCustomization::CallFunc_IsNameValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacterSkinComponent_C_ShouldApplyAnyCustomization, CallFunc_BooleanAND_ReturnValue) == 0x000003, "Member 'BP_CinematicCharacterSkinComponent_C_ShouldApplyAnyCustomization::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BP_CinematicCharacterSkinComponent.BP_CinematicCharacterSkinComponent_C.ApplyCustomization
// 0x0010 (0x0010 - 0x0000)
struct BP_CinematicCharacterSkinComponent_C_ApplyCustomization final
{
public:
	class UBP_jRPG_GI_Custom_C*                   CallFunc_GetCustomGI_ReturnValue;                  // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_CharacterData_C*                    CallFunc_GetCharacterByID_CharacterData;           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CinematicCharacterSkinComponent_C_ApplyCustomization) == 0x000008, "Wrong alignment on BP_CinematicCharacterSkinComponent_C_ApplyCustomization");
static_assert(sizeof(BP_CinematicCharacterSkinComponent_C_ApplyCustomization) == 0x000010, "Wrong size on BP_CinematicCharacterSkinComponent_C_ApplyCustomization");
static_assert(offsetof(BP_CinematicCharacterSkinComponent_C_ApplyCustomization, CallFunc_GetCustomGI_ReturnValue) == 0x000000, "Member 'BP_CinematicCharacterSkinComponent_C_ApplyCustomization::CallFunc_GetCustomGI_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacterSkinComponent_C_ApplyCustomization, CallFunc_GetCharacterByID_CharacterData) == 0x000008, "Member 'BP_CinematicCharacterSkinComponent_C_ApplyCustomization::CallFunc_GetCharacterByID_CharacterData' has a wrong offset!");

// Function BP_CinematicCharacterSkinComponent.BP_CinematicCharacterSkinComponent_C.OnLoaded_E073811A4DDB0114C9452A9C8DBC132C
// 0x0008 (0x0008 - 0x0000)
struct BP_CinematicCharacterSkinComponent_C_OnLoaded_E073811A4DDB0114C9452A9C8DBC132C final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CinematicCharacterSkinComponent_C_OnLoaded_E073811A4DDB0114C9452A9C8DBC132C) == 0x000008, "Wrong alignment on BP_CinematicCharacterSkinComponent_C_OnLoaded_E073811A4DDB0114C9452A9C8DBC132C");
static_assert(sizeof(BP_CinematicCharacterSkinComponent_C_OnLoaded_E073811A4DDB0114C9452A9C8DBC132C) == 0x000008, "Wrong size on BP_CinematicCharacterSkinComponent_C_OnLoaded_E073811A4DDB0114C9452A9C8DBC132C");
static_assert(offsetof(BP_CinematicCharacterSkinComponent_C_OnLoaded_E073811A4DDB0114C9452A9C8DBC132C, Loaded) == 0x000000, "Member 'BP_CinematicCharacterSkinComponent_C_OnLoaded_E073811A4DDB0114C9452A9C8DBC132C::Loaded' has a wrong offset!");

// Function BP_CinematicCharacterSkinComponent.BP_CinematicCharacterSkinComponent_C.ApplyDefaultCustomization
// 0x0008 (0x0008 - 0x0000)
struct BP_CinematicCharacterSkinComponent_C_ApplyDefaultCustomization final
{
public:
	class USkeletalMeshComponent*                 Body;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CinematicCharacterSkinComponent_C_ApplyDefaultCustomization) == 0x000008, "Wrong alignment on BP_CinematicCharacterSkinComponent_C_ApplyDefaultCustomization");
static_assert(sizeof(BP_CinematicCharacterSkinComponent_C_ApplyDefaultCustomization) == 0x000008, "Wrong size on BP_CinematicCharacterSkinComponent_C_ApplyDefaultCustomization");
static_assert(offsetof(BP_CinematicCharacterSkinComponent_C_ApplyDefaultCustomization, Body) == 0x000000, "Member 'BP_CinematicCharacterSkinComponent_C_ApplyDefaultCustomization::Body' has a wrong offset!");

// Function BP_CinematicCharacterSkinComponent.BP_CinematicCharacterSkinComponent_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_CinematicCharacterSkinComponent_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CinematicCharacterSkinComponent_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_CinematicCharacterSkinComponent_C_ReceiveEndPlay");
static_assert(sizeof(BP_CinematicCharacterSkinComponent_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_CinematicCharacterSkinComponent_C_ReceiveEndPlay");
static_assert(offsetof(BP_CinematicCharacterSkinComponent_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_CinematicCharacterSkinComponent_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function BP_CinematicCharacterSkinComponent.BP_CinematicCharacterSkinComponent_C.ExecuteUbergraph_BP_CinematicCharacterSkinComponent
// 0x00D0 (0x00D0 - 0x0000)
struct BP_CinematicCharacterSkinComponent_C_ExecuteUbergraph_BP_CinematicCharacterSkinComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_CinematicSystem_C*                  CallFunc_GetCinematicsSystem_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UBP_jRPG_GI_Custom_C*                   CallFunc_GetCustomGI_ReturnValue;                  // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 K2Node_CustomEvent_Body;                           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMesh*                          K2Node_DynamicCast_AsSkeletal_Mesh;                // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable;                              // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0048(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          K2Node_DynamicCast_AsSkeletal_Mesh_1;              // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BindOnSaveLoaded_AlreadyLoaded;           // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62[0x6];                                       // 0x0062(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0070(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_jRPG_Controller_World_C*            K2Node_DynamicCast_AsBP_J_RPG_Controller_World;    // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldApplyAnyCustomization_ReturnValue;  // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x008A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8B[0x5];                                       // 0x008B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0098(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_jRPG_Controller_World_C*            K2Node_DynamicCast_AsBP_J_RPG_Controller_World_1;  // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldApplyAnyCustomization_ReturnValue_1; // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInEditorPreview_ReturnValue;            // 0x00B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B3[0x5];                                       // 0x00B3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_3;            // 0x00C0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CinematicCharacterSkinComponent_C_ExecuteUbergraph_BP_CinematicCharacterSkinComponent) == 0x000008, "Wrong alignment on BP_CinematicCharacterSkinComponent_C_ExecuteUbergraph_BP_CinematicCharacterSkinComponent");
static_assert(sizeof(BP_CinematicCharacterSkinComponent_C_ExecuteUbergraph_BP_CinematicCharacterSkinComponent) == 0x0000D0, "Wrong size on BP_CinematicCharacterSkinComponent_C_ExecuteUbergraph_BP_CinematicCharacterSkinComponent");
static_assert(offsetof(BP_CinematicCharacterSkinComponent_C_ExecuteUbergraph_BP_CinematicCharacterSkinComponent, EntryPoint) == 0x000000, "Member 'BP_CinematicCharacterSkinComponent_C_ExecuteUbergraph_BP_CinematicCharacterSkinComponent::EntryPoint' has a wrong offset!");
