#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CameraConfigBlender

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "S_CameraConfig_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "S_SpringArmComponentConfig_structs.hpp"
#include "S_CameraComponentConfig_structs.hpp"


namespace SDK::Params
{

// Function BP_CameraConfigBlender.BP_CameraConfigBlender_C.AddCameraConfig
// 0x0020 (0x0020 - 0x0000)
struct BP_CameraConfigBlender_C_AddCameraConfig final
{
public:
	class UBP_DataAsset_CameraConfig_C*           CameraConfig;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FViewTargetTransitionParams            TransitionParameters;                              // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CameraConfigBlender_C_AddCameraConfig) == 0x000008, "Wrong alignment on BP_CameraConfigBlender_C_AddCameraConfig");
static_assert(sizeof(BP_CameraConfigBlender_C_AddCameraConfig) == 0x000020, "Wrong size on BP_CameraConfigBlender_C_AddCameraConfig");
static_assert(offsetof(BP_CameraConfigBlender_C_AddCameraConfig, CameraConfig) == 0x000000, "Member 'BP_CameraConfigBlender_C_AddCameraConfig::CameraConfig' has a wrong offset!");
static_assert(offsetof(BP_CameraConfigBlender_C_AddCameraConfig, TransitionParameters) == 0x000008, "Member 'BP_CameraConfigBlender_C_AddCameraConfig::TransitionParameters' has a wrong offset!");
static_assert(offsetof(BP_CameraConfigBlender_C_AddCameraConfig, CallFunc_Array_Add_ReturnValue) == 0x000018, "Member 'BP_CameraConfigBlender_C_AddCameraConfig::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function BP_CameraConfigBlender.BP_CameraConfigBlender_C.ApplyCameraConfigInstant
// 0x0288 (0x0288 - 0x0000)
struct BP_CameraConfigBlender_C_ApplyCameraConfigInstant final
{
public:
	struct FS_CameraConfig                        CameraConfig;                                      // 0x0000(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0088(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult_1;  // 0x0180(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         K2Node_VariableSet_CameraLagMaxDistance_ImplicitCast; // 0x0278(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_VariableSet_CameraLagSpeed_ImplicitCast;    // 0x027C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_VariableSet_TargetArmLength_ImplicitCast;   // 0x0280(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetFieldOfView_InFieldOfView_ImplicitCast; // 0x0284(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CameraConfigBlender_C_ApplyCameraConfigInstant) == 0x000008, "Wrong alignment on BP_CameraConfigBlender_C_ApplyCameraConfigInstant");
static_assert(sizeof(BP_CameraConfigBlender_C_ApplyCameraConfigInstant) == 0x000288, "Wrong size on BP_CameraConfigBlender_C_ApplyCameraConfigInstant");
static_assert(offsetof(BP_CameraConfigBlender_C_ApplyCameraConfigInstant, CameraConfig) == 0x000000, "Member 'BP_CameraConfigBlender_C_ApplyCameraConfigInstant::CameraConfig' has a wrong offset!");
static_assert(offsetof(BP_CameraConfigBlender_C_ApplyCameraConfigInstant, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x000088, "Member 'BP_CameraConfigBlender_C_ApplyCameraConfigInstant::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_CameraConfigBlender_C_ApplyCameraConfigInstant, CallFunc_K2_SetRelativeLocation_SweepHitResult_1) == 0x000180, "Member 'BP_CameraConfigBlender_C_ApplyCameraConfigInstant::CallFunc_K2_SetRelativeLocation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(BP_CameraConfigBlender_C_ApplyCameraConfigInstant, K2Node_VariableSet_CameraLagMaxDistance_ImplicitCast) == 0x000278, "Member 'BP_CameraConfigBlender_C_ApplyCameraConfigInstant::K2Node_VariableSet_CameraLagMaxDistance_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_CameraConfigBlender_C_ApplyCameraConfigInstant, K2Node_VariableSet_CameraLagSpeed_ImplicitCast) == 0x00027C, "Member 'BP_CameraConfigBlender_C_ApplyCameraConfigInstant::K2Node_VariableSet_CameraLagSpeed_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_CameraConfigBlender_C_ApplyCameraConfigInstant, K2Node_VariableSet_TargetArmLength_ImplicitCast) == 0x000280, "Member 'BP_CameraConfigBlender_C_ApplyCameraConfigInstant::K2Node_VariableSet_TargetArmLength_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_CameraConfigBlender_C_ApplyCameraConfigInstant, CallFunc_SetFieldOfView_InFieldOfView_ImplicitCast) == 0x000284, "Member 'BP_CameraConfigBlender_C_ApplyCameraConfigInstant::CallFunc_SetFieldOfView_InFieldOfView_ImplicitCast' has a wrong offset!");

// Function BP_CameraConfigBlender.BP_CameraConfigBlender_C.ComputeLerpCameraComponentConfig
// 0x0078 (0x0078 - 0x0000)
struct BP_CameraConfigBlender_C_ComputeLerpCameraComponentConfig final
{
public:
	double                                        LerpValue;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_CameraComponentConfig               CameraComponentConfig;                             // 0x0008(0x0020)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_DataAsset_CameraConfig_C*           CallFunc_GetLastCameraConfig_Output;               // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue;                         // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_CameraComponentConfig               K2Node_MakeStruct_S_CameraComponentConfig;         // 0x0050(0x0020)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VLerp_Alpha_ImplicitCast;                 // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CameraConfigBlender_C_ComputeLerpCameraComponentConfig) == 0x000008, "Wrong alignment on BP_CameraConfigBlender_C_ComputeLerpCameraComponentConfig");
static_assert(sizeof(BP_CameraConfigBlender_C_ComputeLerpCameraComponentConfig) == 0x000078, "Wrong size on BP_CameraConfigBlender_C_ComputeLerpCameraComponentConfig");
static_assert(offsetof(BP_CameraConfigBlender_C_ComputeLerpCameraComponentConfig, LerpValue) == 0x000000, "Member 'BP_CameraConfigBlender_C_ComputeLerpCameraComponentConfig::LerpValue' has a wrong offset!");
static_assert(offsetof(BP_CameraConfigBlender_C_ComputeLerpCameraComponentConfig, CameraComponentConfig) == 0x000008, "Member 'BP_CameraConfigBlender_C_ComputeLerpCameraComponentConfig::CameraComponentConfig' has a wrong offset!");
static_assert(offsetof(BP_CameraConfigBlender_C_ComputeLerpCameraComponentConfig, CallFunc_GetLastCameraConfig_Output) == 0x000028, "Member 'BP_CameraConfigBlender_C_ComputeLerpCameraComponentConfig::CallFunc_GetLastCameraConfig_Output' has a wrong offset!");
static_assert(offsetof(BP_CameraConfigBlender_C_ComputeLerpCameraComponentConfig, CallFunc_VLerp_ReturnValue) == 0x000030, "Member 'BP_CameraConfigBlender_C_ComputeLerpCameraComponentConfig::CallFunc_VLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CameraConfigBlender_C_ComputeLerpCameraComponentConfig, CallFunc_Lerp_ReturnValue) == 0x000048, "Member 'BP_CameraConfigBlender_C_ComputeLerpCameraComponentConfig::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CameraConfigBlender_C_ComputeLerpCameraComponentConfig, K2Node_MakeStruct_S_CameraComponentConfig) == 0x000050, "Member 'BP_CameraConfigBlender_C_ComputeLerpCameraComponentConfig::K2Node_MakeStruct_S_CameraComponentConfig' has a wrong offset!");
static_assert(offsetof(BP_CameraConfigBlender_C_ComputeLerpCameraComponentConfig, CallFunc_VLerp_Alpha_ImplicitCast) == 0x000070, "Member 'BP_CameraConfigBlender_C_ComputeLerpCameraComponentConfig::CallFunc_VLerp_Alpha_ImplicitCast' has a wrong offset!");

// Function BP_CameraConfigBlender.BP_CameraConfigBlender_C.ComputeLerpCameraConfig
// 0x01B0 (0x01B0 - 0x0000)
struct BP_CameraConfigBlender_C_ComputeLerpCameraConfig final
{
public:
	struct FS_CameraConfig                        ReturnValue;                                       // 0x0000(0x0088)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_wildcard_Variable;                            // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_ComputeLerpValue_ReturnValue;             // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_SpringArmComponentConfig            CallFunc_ComputeLerpSpringArmComponentConfig_ReturnValue; // 0x0090(0x0068)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_CameraComponentConfig               CallFunc_ComputeLerpCameraComponentConfig_CameraComponentConfig; // 0x00F8(0x0020)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_CameraConfig                        K2Node_MakeStruct_S_CameraConfig;                  // 0x0118(0x0088)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_ComputeLerpCameraComponentConfig_LerpValue_ImplicitCast; // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_ComputeLerpSpringArmComponentConfig_LerpValue_ImplicitCast; // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CameraConfigBlender_C_ComputeLerpCameraConfig) == 0x000008, "Wrong alignment on BP_CameraConfigBlender_C_ComputeLerpCameraConfig");
static_assert(sizeof(BP_CameraConfigBlender_C_ComputeLerpCameraConfig) == 0x0001B0, "Wrong size on BP_CameraConfigBlender_C_ComputeLerpCameraConfig");
static_assert(offsetof(BP_CameraConfigBlender_C_ComputeLerpCameraConfig, ReturnValue) == 0x000000, "Member 'BP_CameraConfigBlender_C_ComputeLerpCameraConfig::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CameraConfigBlender_C_ComputeLerpCameraConfig, Temp_wildcard_Variable) == 0x000088, "Member 'BP_CameraConfigBlender_C_ComputeLerpCameraConfig::Temp_wildcard_Variable' has a wrong offset!");
static_assert(offsetof(BP_CameraConfigBlender_C_ComputeLerpCameraConfig, CallFunc_ComputeLerpValue_ReturnValue) == 0x00008C, "Member 'BP_CameraConfigBlender_C_ComputeLerpCameraConfig::CallFunc_ComputeLerpValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CameraConfigBlender_C_ComputeLerpCameraConfig, CallFunc_ComputeLerpSpringArmComponentConfig_ReturnValue) == 0x000090, "Member 'BP_CameraConfigBlender_C_ComputeLerpCameraConfig::CallFunc_ComputeLerpSpringArmComponentConfig_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CameraConfigBlender_C_ComputeLerpCameraConfig, CallFunc_ComputeLerpCameraComponentConfig_CameraComponentConfig) == 0x0000F8, "Member 'BP_CameraConfigBlender_C_ComputeLerpCameraConfig::CallFunc_ComputeLerpCameraComponentConfig_CameraComponentConfig' has a wrong offset!");
static_assert(offsetof(BP_CameraConfigBlender_C_ComputeLerpCameraConfig, K2Node_MakeStruct_S_CameraConfig) == 0x000118, "Member 'BP_CameraConfigBlender_C_ComputeLerpCameraConfig::K2Node_MakeStruct_S_CameraConfig' has a wrong offset!");
static_assert(offsetof(BP_CameraConfigBlender_C_ComputeLerpCameraConfig, CallFunc_ComputeLerpCameraComponentConfig_LerpValue_ImplicitCast) == 0x0001A0, "Member 'BP_CameraConfigBlender_C_ComputeLerpCameraConfig::CallFunc_ComputeLerpCameraComponentConfig_LerpValue_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_CameraConfigBlender_C_ComputeLerpCameraConfig, CallFunc_ComputeLerpSpringArmComponentConfig_LerpValue_ImplicitCast) == 0x0001A8, "Member 'BP_CameraConfigBlender_C_ComputeLerpCameraConfig::CallFunc_ComputeLerpSpringArmComponentConfig_LerpValue_ImplicitCast' has a wrong offset!");

// Function BP_CameraConfigBlender.BP_CameraConfigBlender_C.ComputeLerpSpringArmComponentConfig
// 0x0150 (0x0150 - 0x0000)
struct BP_CameraConfigBlender_C_ComputeLerpSpringArmComponentConfig final
{
public:
	double                                        LerpValue;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_SpringArmComponentConfig            ReturnValue;                                       // 0x0008(0x0068)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_DataAsset_CameraConfig_C*           CallFunc_GetLastCameraConfig_Output;               // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x0078(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue_1;                      // 0x0090(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue_2;                      // 0x00A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue;                         // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue_1;                       // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue_2;                       // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_SpringArmComponentConfig            K2Node_MakeStruct_S_SpringArmComponentConfig;      // 0x00D8(0x0068)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VLerp_Alpha_ImplicitCast;                 // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VLerp_Alpha_ImplicitCast_1;               // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VLerp_Alpha_ImplicitCast_2;               // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CameraConfigBlender_C_ComputeLerpSpringArmComponentConfig) == 0x000008, "Wrong alignment on BP_CameraConfigBlender_C_ComputeLerpSpringArmComponentConfig");
static_assert(sizeof(BP_CameraConfigBlender_C_ComputeLerpSpringArmComponentConfig) == 0x000150, "Wrong size on BP_CameraConfigBlender_C_ComputeLerpSpringArmComponentConfig");
static_assert(offsetof(BP_CameraConfigBlender_C_ComputeLerpSpringArmComponentConfig, LerpValue) == 0x000000, "Member 'BP_CameraConfigBlender_C_ComputeLerpSpringArmComponentConfig::LerpValue' has a wrong offset!");
static_assert(offsetof(BP_CameraConfigBlender_C_ComputeLerpSpringArmComponentConfig, ReturnValue) == 0x000008, "Member 'BP_CameraConfigBlender_C_ComputeLerpSpringArmComponentConfig::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CameraConfigBlender_C_ComputeLerpSpringArmComponentConfig, CallFunc_GetLastCameraConfig_Output) == 0x000070, "Member 'BP_CameraConfigBlender_C_ComputeLerpSpringArmComponentConfig::CallFunc_GetLastCameraConfig_Output' has a wrong offset!");
static_assert(offsetof(BP_CameraConfigBlender_C_ComputeLerpSpringArmComponentConfig, CallFunc_VLerp_ReturnValue) == 0x000078, "Member 'BP_CameraConfigBlender_C_ComputeLerpSpringArmComponentConfig::CallFunc_VLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CameraConfigBlender_C_ComputeLerpSpringArmComponentConfig, CallFunc_VLerp_ReturnValue_1) == 0x000090, "Member 'BP_CameraConfigBlender_C_ComputeLerpSpringArmComponentConfig::CallFunc_VLerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CameraConfigBlender_C_ComputeLerpSpringArmComponentConfig, CallFunc_VLerp_ReturnValue_2) == 0x0000A8, "Member 'BP_CameraConfigBlender_C_ComputeLerpSpringArmComponentConfig::CallFunc_VLerp_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CameraConfigBlender_C_ComputeLerpSpringArmComponentConfig, CallFunc_Lerp_ReturnValue) == 0x0000C0, "Member 'BP_CameraConfigBlender_C_ComputeLerpSpringArmComponentConfig::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CameraConfigBlender_C_ComputeLerpSpringArmComponentConfig, CallFunc_Lerp_ReturnValue_1) == 0x0000C8, "Member 'BP_CameraConfigBlender_C_ComputeLerpSpringArmComponentConfig::CallFunc_Lerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CameraConfigBlender_C_ComputeLerpSpringArmComponentConfig, CallFunc_Lerp_ReturnValue_2) == 0x0000D0, "Member 'BP_CameraConfigBlender_C_ComputeLerpSpringArmComponentConfig::CallFunc_Lerp_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CameraConfigBlender_C_ComputeLerpSpringArmComponentConfig, K2Node_MakeStruct_S_SpringArmComponentConfig) == 0x0000D8, "Member 'BP_CameraConfigBlender_C_ComputeLerpSpringArmComponentConfig::K2Node_MakeStruct_S_SpringArmComponentConfig' has a wrong offset!");
static_assert(offsetof(BP_CameraConfigBlender_C_ComputeLerpSpringArmComponentConfig, CallFunc_VLerp_Alpha_ImplicitCast) == 0x000140, "Member 'BP_CameraConfigBlender_C_ComputeLerpSpringArmComponentConfig::CallFunc_VLerp_Alpha_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_CameraConfigBlender_C_ComputeLerpSpringArmComponentConfig, CallFunc_VLerp_Alpha_ImplicitCast_1) == 0x000144, "Member 'BP_CameraConfigBlender_C_ComputeLerpSpringArmComponentConfig::CallFunc_VLerp_Alpha_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_CameraConfigBlender_C_ComputeLerpSpringArmComponentConfig, CallFunc_VLerp_Alpha_ImplicitCast_2) == 0x000148, "Member 'BP_CameraConfigBlender_C_ComputeLerpSpringArmComponentConfig::CallFunc_VLerp_Alpha_ImplicitCast_2' has a wrong offset!");

// Function BP_CameraConfigBlender.BP_CameraConfigBlender_C.ComputeLerpValue
// 0x0030 (0x0030 - 0x0000)
struct BP_CameraConfigBlender_C_ComputeLerpValue final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetBlendAlpha_ReturnValue;                // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_B_ImplicitCast;       // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetBlendAlpha_Time_ImplicitCast;          // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CameraConfigBlender_C_ComputeLerpValue) == 0x000008, "Wrong alignment on BP_CameraConfigBlender_C_ComputeLerpValue");
static_assert(sizeof(BP_CameraConfigBlender_C_ComputeLerpValue) == 0x000030, "Wrong size on BP_CameraConfigBlender_C_ComputeLerpValue");
static_assert(offsetof(BP_CameraConfigBlender_C_ComputeLerpValue, ReturnValue) == 0x000000, "Member 'BP_CameraConfigBlender_C_ComputeLerpValue::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CameraConfigBlender_C_ComputeLerpValue, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000008, "Member 'BP_CameraConfigBlender_C_ComputeLerpValue::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CameraConfigBlender_C_ComputeLerpValue, CallFunc_FClamp_ReturnValue) == 0x000010, "Member 'BP_CameraConfigBlender_C_ComputeLerpValue::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CameraConfigBlender_C_ComputeLerpValue, CallFunc_GetBlendAlpha_ReturnValue) == 0x000018, "Member 'BP_CameraConfigBlender_C_ComputeLerpValue::CallFunc_GetBlendAlpha_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CameraConfigBlender_C_ComputeLerpValue, CallFunc_Divide_DoubleDouble_B_ImplicitCast) == 0x000020, "Member 'BP_CameraConfigBlender_C_ComputeLerpValue::CallFunc_Divide_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_CameraConfigBlender_C_ComputeLerpValue, CallFunc_GetBlendAlpha_Time_ImplicitCast) == 0x000028, "Member 'BP_CameraConfigBlender_C_ComputeLerpValue::CallFunc_GetBlendAlpha_Time_ImplicitCast' has a wrong offset!");

// Function BP_CameraConfigBlender.BP_CameraConfigBlender_C.DebugDrawCameraComponent
// 0x00D0 (0x00D0 - 0x0000)
struct BP_CameraConfigBlender_C_DebugDrawCameraComponent final
{
public:
	class FString                                 CallFunc_Conv_VectorToString_ReturnValue;          // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0010(0x0048)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0058(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0068(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00B0(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Format_ReturnValue;                       // 0x00C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CameraConfigBlender_C_DebugDrawCameraComponent) == 0x000008, "Wrong alignment on BP_CameraConfigBlender_C_DebugDrawCameraComponent");
static_assert(sizeof(BP_CameraConfigBlender_C_DebugDrawCameraComponent) == 0x0000D0, "Wrong size on BP_CameraConfigBlender_C_DebugDrawCameraComponent");
static_assert(offsetof(BP_CameraConfigBlender_C_DebugDrawCameraComponent, CallFunc_Conv_VectorToString_ReturnValue) == 0x000000, "Member 'BP_CameraConfigBlender_C_DebugDrawCameraComponent::CallFunc_Conv_VectorToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CameraConfigBlender_C_DebugDrawCameraComponent, K2Node_MakeStruct_FormatArgumentData) == 0x000010, "Member 'BP_CameraConfigBlender_C_DebugDrawCameraComponent::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_CameraConfigBlender_C_DebugDrawCameraComponent, CallFunc_Conv_StringToText_ReturnValue) == 0x000058, "Member 'BP_CameraConfigBlender_C_DebugDrawCameraComponent::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CameraConfigBlender_C_DebugDrawCameraComponent, K2Node_MakeStruct_FormatArgumentData_1) == 0x000068, "Member 'BP_CameraConfigBlender_C_DebugDrawCameraComponent::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BP_CameraConfigBlender_C_DebugDrawCameraComponent, K2Node_MakeArray_Array) == 0x0000B0, "Member 'BP_CameraConfigBlender_C_DebugDrawCameraComponent::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_CameraConfigBlender_C_DebugDrawCameraComponent, CallFunc_Format_ReturnValue) == 0x0000C0, "Member 'BP_CameraConfigBlender_C_DebugDrawCameraComponent::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function BP_CameraConfigBlender.BP_CameraConfigBlender_C.DebugDrawSpringArmComponentConfig
// 0x0288 (0x0288 - 0x0000)
struct BP_CameraConfigBlender_C_DebugDrawSpringArmComponentConfig final
{
public:
	class FString                                 CallFunc_Conv_VectorToString_ReturnValue;          // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_VectorToString_ReturnValue_1;        // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0020(0x0010)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0030(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0040(0x0048)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0088(0x0048)(HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_VectorToString_ReturnValue_2;        // 0x00D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x00E0(0x0048)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_2;          // 0x0128(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x0138(0x0048)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_4;            // 0x0180(0x0048)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_5;            // 0x01C8(0x0048)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_BoolToText_ReturnValue;              // 0x0210(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_6;            // 0x0220(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0268(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Format_ReturnValue;                       // 0x0278(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CameraConfigBlender_C_DebugDrawSpringArmComponentConfig) == 0x000008, "Wrong alignment on BP_CameraConfigBlender_C_DebugDrawSpringArmComponentConfig");
static_assert(sizeof(BP_CameraConfigBlender_C_DebugDrawSpringArmComponentConfig) == 0x000288, "Wrong size on BP_CameraConfigBlender_C_DebugDrawSpringArmComponentConfig");
static_assert(offsetof(BP_CameraConfigBlender_C_DebugDrawSpringArmComponentConfig, CallFunc_Conv_VectorToString_ReturnValue) == 0x000000, "Member 'BP_CameraConfigBlender_C_DebugDrawSpringArmComponentConfig::CallFunc_Conv_VectorToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CameraConfigBlender_C_DebugDrawSpringArmComponentConfig, CallFunc_Conv_VectorToString_ReturnValue_1) == 0x000010, "Member 'BP_CameraConfigBlender_C_DebugDrawSpringArmComponentConfig::CallFunc_Conv_VectorToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CameraConfigBlender_C_DebugDrawSpringArmComponentConfig, CallFunc_Conv_StringToText_ReturnValue) == 0x000020, "Member 'BP_CameraConfigBlender_C_DebugDrawSpringArmComponentConfig::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CameraConfigBlender_C_DebugDrawSpringArmComponentConfig, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000030, "Member 'BP_CameraConfigBlender_C_DebugDrawSpringArmComponentConfig::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CameraConfigBlender_C_DebugDrawSpringArmComponentConfig, K2Node_MakeStruct_FormatArgumentData) == 0x000040, "Member 'BP_CameraConfigBlender_C_DebugDrawSpringArmComponentConfig::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_CameraConfigBlender_C_DebugDrawSpringArmComponentConfig, K2Node_MakeStruct_FormatArgumentData_1) == 0x000088, "Member 'BP_CameraConfigBlender_C_DebugDrawSpringArmComponentConfig::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BP_CameraConfigBlender_C_DebugDrawSpringArmComponentConfig, CallFunc_Conv_VectorToString_ReturnValue_2) == 0x0000D0, "Member 'BP_CameraConfigBlender_C_DebugDrawSpringArmComponentConfig::CallFunc_Conv_VectorToString_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CameraConfigBlender_C_DebugDrawSpringArmComponentConfig, K2Node_MakeStruct_FormatArgumentData_2) == 0x0000E0, "Member 'BP_CameraConfigBlender_C_DebugDrawSpringArmComponentConfig::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(BP_CameraConfigBlender_C_DebugDrawSpringArmComponentConfig, CallFunc_Conv_StringToText_ReturnValue_2) == 0x000128, "Member 'BP_CameraConfigBlender_C_DebugDrawSpringArmComponentConfig::CallFunc_Conv_StringToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CameraConfigBlender_C_DebugDrawSpringArmComponentConfig, K2Node_MakeStruct_FormatArgumentData_3) == 0x000138, "Member 'BP_CameraConfigBlender_C_DebugDrawSpringArmComponentConfig::K2Node_MakeStruct_FormatArgumentData_3' has a wrong offset!");
static_assert(offsetof(BP_CameraConfigBlender_C_DebugDrawSpringArmComponentConfig, K2Node_MakeStruct_FormatArgumentData_4) == 0x000180, "Member 'BP_CameraConfigBlender_C_DebugDrawSpringArmComponentConfig::K2Node_MakeStruct_FormatArgumentData_4' has a wrong offset!");
static_assert(offsetof(BP_CameraConfigBlender_C_DebugDrawSpringArmComponentConfig, K2Node_MakeStruct_FormatArgumentData_5) == 0x0001C8, "Member 'BP_CameraConfigBlender_C_DebugDrawSpringArmComponentConfig::K2Node_MakeStruct_FormatArgumentData_5' has a wrong offset!");
static_assert(offsetof(BP_CameraConfigBlender_C_DebugDrawSpringArmComponentConfig, CallFunc_Conv_BoolToText_ReturnValue) == 0x000210, "Member 'BP_CameraConfigBlender_C_DebugDrawSpringArmComponentConfig::CallFunc_Conv_BoolToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CameraConfigBlender_C_DebugDrawSpringArmComponentConfig, K2Node_MakeStruct_FormatArgumentData_6) == 0x000220, "Member 'BP_CameraConfigBlender_C_DebugDrawSpringArmComponentConfig::K2Node_MakeStruct_FormatArgumentData_6' has a wrong offset!");
static_assert(offsetof(BP_CameraConfigBlender_C_DebugDrawSpringArmComponentConfig, K2Node_MakeArray_Array) == 0x000268, "Member 'BP_CameraConfigBlender_C_DebugDrawSpringArmComponentConfig::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_CameraConfigBlender_C_DebugDrawSpringArmComponentConfig, CallFunc_Format_ReturnValue) == 0x000278, "Member 'BP_CameraConfigBlender_C_DebugDrawSpringArmComponentConfig::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function BP_CameraConfigBlender.BP_CameraConfigBlender_C.GetCurrentCameraConfigFromComponents
// 0x01B8 (0x01B8 - 0x0000)
struct BP_CameraConfigBlender_C_GetCurrentCameraConfigFromComponents final
{
public:
	struct FS_CameraConfig                        CameraConfig;                                      // 0x0000(0x0088)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_CameraComponentConfig               K2Node_MakeStruct_S_CameraComponentConfig;         // 0x0088(0x0020)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_SpringArmComponentConfig            K2Node_MakeStruct_S_SpringArmComponentConfig;      // 0x00A8(0x0068)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_CameraConfig                        K2Node_MakeStruct_S_CameraConfig;                  // 0x0110(0x0088)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_MakeStruct_FieldOfView_5_C4EFE1AA4371E8716DB742A8DAF7042C_ImplicitCast; // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_MakeStruct_TargetArmLength_14_76D67053435033948248BBB4FC60F60E_ImplicitCast; // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_MakeStruct_CameraLagSpeed_12_8EE7C82A454A47330FE7728AA4B59C9D_ImplicitCast; // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_MakeStruct_CameraLagMaxDistance_10_426F1EF9477DD9FFA74A8C8BA8DEA88B_ImplicitCast; // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CameraConfigBlender_C_GetCurrentCameraConfigFromComponents) == 0x000008, "Wrong alignment on BP_CameraConfigBlender_C_GetCurrentCameraConfigFromComponents");
static_assert(sizeof(BP_CameraConfigBlender_C_GetCurrentCameraConfigFromComponents) == 0x0001B8, "Wrong size on BP_CameraConfigBlender_C_GetCurrentCameraConfigFromComponents");
static_assert(offsetof(BP_CameraConfigBlender_C_GetCurrentCameraConfigFromComponents, CameraConfig) == 0x000000, "Member 'BP_CameraConfigBlender_C_GetCurrentCameraConfigFromComponents::CameraConfig' has a wrong offset!");
static_assert(offsetof(BP_CameraConfigBlender_C_GetCurrentCameraConfigFromComponents, K2Node_MakeStruct_S_CameraComponentConfig) == 0x000088, "Member 'BP_CameraConfigBlender_C_GetCurrentCameraConfigFromComponents::K2Node_MakeStruct_S_CameraComponentConfig' has a wrong offset!");
static_assert(offsetof(BP_CameraConfigBlender_C_GetCurrentCameraConfigFromComponents, K2Node_MakeStruct_S_SpringArmComponentConfig) == 0x0000A8, "Member 'BP_CameraConfigBlender_C_GetCurrentCameraConfigFromComponents::K2Node_MakeStruct_S_SpringArmComponentConfig' has a wrong offset!");
static_assert(offsetof(BP_CameraConfigBlender_C_GetCurrentCameraConfigFromComponents, K2Node_MakeStruct_S_CameraConfig) == 0x000110, "Member 'BP_CameraConfigBlender_C_GetCurrentCameraConfigFromComponents::K2Node_MakeStruct_S_CameraConfig' has a wrong offset!");
static_assert(offsetof(BP_CameraConfigBlender_C_GetCurrentCameraConfigFromComponents, K2Node_MakeStruct_FieldOfView_5_C4EFE1AA4371E8716DB742A8DAF7042C_ImplicitCast) == 0x000198, "Member 'BP_CameraConfigBlender_C_GetCurrentCameraConfigFromComponents::K2Node_MakeStruct_FieldOfView_5_C4EFE1AA4371E8716DB742A8DAF7042C_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_CameraConfigBlender_C_GetCurrentCameraConfigFromComponents, K2Node_MakeStruct_TargetArmLength_14_76D67053435033948248BBB4FC60F60E_ImplicitCast) == 0x0001A0, "Member 'BP_CameraConfigBlender_C_GetCurrentCameraConfigFromComponents::K2Node_MakeStruct_TargetArmLength_14_76D67053435033948248BBB4FC60F60E_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_CameraConfigBlender_C_GetCurrentCameraConfigFromComponents, K2Node_MakeStruct_CameraLagSpeed_12_8EE7C82A454A47330FE7728AA4B59C9D_ImplicitCast) == 0x0001A8, "Member 'BP_CameraConfigBlender_C_GetCurrentCameraConfigFromComponents::K2Node_MakeStruct_CameraLagSpeed_12_8EE7C82A454A47330FE7728AA4B59C9D_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_CameraConfigBlender_C_GetCurrentCameraConfigFromComponents, K2Node_MakeStruct_CameraLagMaxDistance_10_426F1EF9477DD9FFA74A8C8BA8DEA88B_ImplicitCast) == 0x0001B0, "Member 'BP_CameraConfigBlender_C_GetCurrentCameraConfigFromComponents::K2Node_MakeStruct_CameraLagMaxDistance_10_426F1EF9477DD9FFA74A8C8BA8DEA88B_ImplicitCast' has a wrong offset!");

// Function BP_CameraConfigBlender.BP_CameraConfigBlender_C.GetDebugString
// 0x01D0 (0x01D0 - 0x0000)
struct BP_CameraConfigBlender_C_GetDebugString final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
	class FString                                 local_DebugString;                                 // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue_1;             // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0050(0x0010)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0060(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0070(0x0048)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00B8(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0100(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Format_ReturnValue;                       // 0x0110(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_124[0x4];                                      // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_DataAsset_CameraConfig_C*           CallFunc_Array_Get_Item;                           // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue_2;             // 0x0138(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_2;          // 0x0148(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0158(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x01A0(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Format_ReturnValue_1;                     // 0x01B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x01C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CameraConfigBlender_C_GetDebugString) == 0x000008, "Wrong alignment on BP_CameraConfigBlender_C_GetDebugString");
static_assert(sizeof(BP_CameraConfigBlender_C_GetDebugString) == 0x0001D0, "Wrong size on BP_CameraConfigBlender_C_GetDebugString");
static_assert(offsetof(BP_CameraConfigBlender_C_GetDebugString, ReturnValue) == 0x000000, "Member 'BP_CameraConfigBlender_C_GetDebugString::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CameraConfigBlender_C_GetDebugString, local_DebugString) == 0x000010, "Member 'BP_CameraConfigBlender_C_GetDebugString::local_DebugString' has a wrong offset!");
static_assert(offsetof(BP_CameraConfigBlender_C_GetDebugString, Temp_int_Array_Index_Variable) == 0x000020, "Member 'BP_CameraConfigBlender_C_GetDebugString::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_CameraConfigBlender_C_GetDebugString, Temp_int_Loop_Counter_Variable) == 0x000024, "Member 'BP_CameraConfigBlender_C_GetDebugString::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_CameraConfigBlender_C_GetDebugString, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'BP_CameraConfigBlender_C_GetDebugString::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CameraConfigBlender_C_GetDebugString, CallFunc_GetDisplayName_ReturnValue) == 0x000030, "Member 'BP_CameraConfigBlender_C_GetDebugString::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CameraConfigBlender_C_GetDebugString, CallFunc_GetDisplayName_ReturnValue_1) == 0x000040, "Member 'BP_CameraConfigBlender_C_GetDebugString::CallFunc_GetDisplayName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CameraConfigBlender_C_GetDebugString, CallFunc_Conv_StringToText_ReturnValue) == 0x000050, "Member 'BP_CameraConfigBlender_C_GetDebugString::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CameraConfigBlender_C_GetDebugString, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000060, "Member 'BP_CameraConfigBlender_C_GetDebugString::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CameraConfigBlender_C_GetDebugString, K2Node_MakeStruct_FormatArgumentData) == 0x000070, "Member 'BP_CameraConfigBlender_C_GetDebugString::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_CameraConfigBlender_C_GetDebugString, K2Node_MakeStruct_FormatArgumentData_1) == 0x0000B8, "Member 'BP_CameraConfigBlender_C_GetDebugString::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BP_CameraConfigBlender_C_GetDebugString, K2Node_MakeArray_Array) == 0x000100, "Member 'BP_CameraConfigBlender_C_GetDebugString::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_CameraConfigBlender_C_GetDebugString, CallFunc_Format_ReturnValue) == 0x000110, "Member 'BP_CameraConfigBlender_C_GetDebugString::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CameraConfigBlender_C_GetDebugString, CallFunc_Array_Length_ReturnValue) == 0x000120, "Member 'BP_CameraConfigBlender_C_GetDebugString::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CameraConfigBlender_C_GetDebugString, CallFunc_Array_Get_Item) == 0x000128, "Member 'BP_CameraConfigBlender_C_GetDebugString::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_CameraConfigBlender_C_GetDebugString, CallFunc_Less_IntInt_ReturnValue) == 0x000130, "Member 'BP_CameraConfigBlender_C_GetDebugString::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CameraConfigBlender_C_GetDebugString, CallFunc_GetDisplayName_ReturnValue_2) == 0x000138, "Member 'BP_CameraConfigBlender_C_GetDebugString::CallFunc_GetDisplayName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CameraConfigBlender_C_GetDebugString, CallFunc_Conv_StringToText_ReturnValue_2) == 0x000148, "Member 'BP_CameraConfigBlender_C_GetDebugString::CallFunc_Conv_StringToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CameraConfigBlender_C_GetDebugString, K2Node_MakeStruct_FormatArgumentData_2) == 0x000158, "Member 'BP_CameraConfigBlender_C_GetDebugString::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(BP_CameraConfigBlender_C_GetDebugString, K2Node_MakeArray_Array_1) == 0x0001A0, "Member 'BP_CameraConfigBlender_C_GetDebugString::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BP_CameraConfigBlender_C_GetDebugString, CallFunc_Format_ReturnValue_1) == 0x0001B0, "Member 'BP_CameraConfigBlender_C_GetDebugString::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CameraConfigBlender_C_GetDebugString, CallFunc_Concat_StrStr_ReturnValue) == 0x0001C0, "Member 'BP_CameraConfigBlender_C_GetDebugString::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");

// Function BP_CameraConfigBlender.BP_CameraConfigBlender_C.GetLastCameraConfig
// 0x0018 (0x0018 - 0x0000)
struct BP_CameraConfigBlender_C_GetLastCameraConfig final
{
public:
	class UBP_DataAsset_CameraConfig_C*           Output;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_DataAsset_CameraConfig_C*           CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CameraConfigBlender_C_GetLastCameraConfig) == 0x000008, "Wrong alignment on BP_CameraConfigBlender_C_GetLastCameraConfig");
static_assert(sizeof(BP_CameraConfigBlender_C_GetLastCameraConfig) == 0x000018, "Wrong size on BP_CameraConfigBlender_C_GetLastCameraConfig");
static_assert(offsetof(BP_CameraConfigBlender_C_GetLastCameraConfig, Output) == 0x000000, "Member 'BP_CameraConfigBlender_C_GetLastCameraConfig::Output' has a wrong offset!");
static_assert(offsetof(BP_CameraConfigBlender_C_GetLastCameraConfig, CallFunc_Array_LastIndex_ReturnValue) == 0x000008, "Member 'BP_CameraConfigBlender_C_GetLastCameraConfig::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CameraConfigBlender_C_GetLastCameraConfig, CallFunc_Array_Get_Item) == 0x000010, "Member 'BP_CameraConfigBlender_C_GetLastCameraConfig::CallFunc_Array_Get_Item' has a wrong offset!");

// Function BP_CameraConfigBlender.BP_CameraConfigBlender_C.IsAppliedOnComponents
// 0x0018 (0x0018 - 0x0000)
struct BP_CameraConfigBlender_C_IsAppliedOnComponents final
{
public:
	class UCameraComponent*                       CameraComponent_0;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USpringArmComponent*                    SpringArmComponent_0;                              // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          IsApplied;                                         // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_1;    // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CameraConfigBlender_C_IsAppliedOnComponents) == 0x000008, "Wrong alignment on BP_CameraConfigBlender_C_IsAppliedOnComponents");
static_assert(sizeof(BP_CameraConfigBlender_C_IsAppliedOnComponents) == 0x000018, "Wrong size on BP_CameraConfigBlender_C_IsAppliedOnComponents");
static_assert(offsetof(BP_CameraConfigBlender_C_IsAppliedOnComponents, CameraComponent_0) == 0x000000, "Member 'BP_CameraConfigBlender_C_IsAppliedOnComponents::CameraComponent_0' has a wrong offset!");
static_assert(offsetof(BP_CameraConfigBlender_C_IsAppliedOnComponents, SpringArmComponent_0) == 0x000008, "Member 'BP_CameraConfigBlender_C_IsAppliedOnComponents::SpringArmComponent_0' has a wrong offset!");
static_assert(offsetof(BP_CameraConfigBlender_C_IsAppliedOnComponents, IsApplied) == 0x000010, "Member 'BP_CameraConfigBlender_C_IsAppliedOnComponents::IsApplied' has a wrong offset!");
static_assert(offsetof(BP_CameraConfigBlender_C_IsAppliedOnComponents, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000011, "Member 'BP_CameraConfigBlender_C_IsAppliedOnComponents::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CameraConfigBlender_C_IsAppliedOnComponents, CallFunc_EqualEqual_ObjectObject_ReturnValue_1) == 0x000012, "Member 'BP_CameraConfigBlender_C_IsAppliedOnComponents::CallFunc_EqualEqual_ObjectObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CameraConfigBlender_C_IsAppliedOnComponents, CallFunc_BooleanAND_ReturnValue) == 0x000013, "Member 'BP_CameraConfigBlender_C_IsAppliedOnComponents::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BP_CameraConfigBlender.BP_CameraConfigBlender_C.IsTransitionDone
// 0x0001 (0x0001 - 0x0000)
struct BP_CameraConfigBlender_C_IsTransitionDone final
{
public:
	bool                                          Done;                                              // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CameraConfigBlender_C_IsTransitionDone) == 0x000001, "Wrong alignment on BP_CameraConfigBlender_C_IsTransitionDone");
static_assert(sizeof(BP_CameraConfigBlender_C_IsTransitionDone) == 0x000001, "Wrong size on BP_CameraConfigBlender_C_IsTransitionDone");
static_assert(offsetof(BP_CameraConfigBlender_C_IsTransitionDone, Done) == 0x000000, "Member 'BP_CameraConfigBlender_C_IsTransitionDone::Done' has a wrong offset!");

// Function BP_CameraConfigBlender.BP_CameraConfigBlender_C.OnCameraConfigStackChanged
// 0x0098 (0x0098 - 0x0000)
struct BP_CameraConfigBlender_C_OnCameraConfigStackChanged final
{
public:
	struct FViewTargetTransitionParams            TransitionParameters;                              // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FS_CameraConfig                        CallFunc_GetCurrentCameraConfigFromComponents_CameraConfig; // 0x0010(0x0088)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CameraConfigBlender_C_OnCameraConfigStackChanged) == 0x000008, "Wrong alignment on BP_CameraConfigBlender_C_OnCameraConfigStackChanged");
static_assert(sizeof(BP_CameraConfigBlender_C_OnCameraConfigStackChanged) == 0x000098, "Wrong size on BP_CameraConfigBlender_C_OnCameraConfigStackChanged");
static_assert(offsetof(BP_CameraConfigBlender_C_OnCameraConfigStackChanged, TransitionParameters) == 0x000000, "Member 'BP_CameraConfigBlender_C_OnCameraConfigStackChanged::TransitionParameters' has a wrong offset!");
static_assert(offsetof(BP_CameraConfigBlender_C_OnCameraConfigStackChanged, CallFunc_GetCurrentCameraConfigFromComponents_CameraConfig) == 0x000010, "Member 'BP_CameraConfigBlender_C_OnCameraConfigStackChanged::CallFunc_GetCurrentCameraConfigFromComponents_CameraConfig' has a wrong offset!");

// Function BP_CameraConfigBlender.BP_CameraConfigBlender_C.RemoveCameraConfig
// 0x0020 (0x0020 - 0x0000)
struct BP_CameraConfigBlender_C_RemoveCameraConfig final
{
public:
	class UBP_DataAsset_CameraConfig_C*           CameraConfig;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FViewTargetTransitionParams            TransitionParameters;                              // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CameraConfigBlender_C_RemoveCameraConfig) == 0x000008, "Wrong alignment on BP_CameraConfigBlender_C_RemoveCameraConfig");
static_assert(sizeof(BP_CameraConfigBlender_C_RemoveCameraConfig) == 0x000020, "Wrong size on BP_CameraConfigBlender_C_RemoveCameraConfig");
static_assert(offsetof(BP_CameraConfigBlender_C_RemoveCameraConfig, CameraConfig) == 0x000000, "Member 'BP_CameraConfigBlender_C_RemoveCameraConfig::CameraConfig' has a wrong offset!");
static_assert(offsetof(BP_CameraConfigBlender_C_RemoveCameraConfig, TransitionParameters) == 0x000008, "Member 'BP_CameraConfigBlender_C_RemoveCameraConfig::TransitionParameters' has a wrong offset!");
static_assert(offsetof(BP_CameraConfigBlender_C_RemoveCameraConfig, CallFunc_Array_RemoveItem_ReturnValue) == 0x000018, "Member 'BP_CameraConfigBlender_C_RemoveCameraConfig::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");

// Function BP_CameraConfigBlender.BP_CameraConfigBlender_C.SetupCameraConfig
// 0x0020 (0x0020 - 0x0000)
struct BP_CameraConfigBlender_C_SetupCameraConfig final
{
public:
	class UBP_DataAsset_CameraConfig_C*           CameraConfig;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FViewTargetTransitionParams            TransitionParameters;                              // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CameraConfigBlender_C_SetupCameraConfig) == 0x000008, "Wrong alignment on BP_CameraConfigBlender_C_SetupCameraConfig");
static_assert(sizeof(BP_CameraConfigBlender_C_SetupCameraConfig) == 0x000020, "Wrong size on BP_CameraConfigBlender_C_SetupCameraConfig");
static_assert(offsetof(BP_CameraConfigBlender_C_SetupCameraConfig, CameraConfig) == 0x000000, "Member 'BP_CameraConfigBlender_C_SetupCameraConfig::CameraConfig' has a wrong offset!");
static_assert(offsetof(BP_CameraConfigBlender_C_SetupCameraConfig, TransitionParameters) == 0x000008, "Member 'BP_CameraConfigBlender_C_SetupCameraConfig::TransitionParameters' has a wrong offset!");
static_assert(offsetof(BP_CameraConfigBlender_C_SetupCameraConfig, CallFunc_Array_Add_ReturnValue) == 0x000018, "Member 'BP_CameraConfigBlender_C_SetupCameraConfig::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function BP_CameraConfigBlender.BP_CameraConfigBlender_C.UpdateCameraConfigBlender
// 0x0010 (0x0010 - 0x0000)
struct BP_CameraConfigBlender_C_UpdateCameraConfigBlender final
{
public:
	double                                        DeltaSeconds;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsNotEmpty_ReturnValue;             // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsTransitionDone_Done;                    // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CameraConfigBlender_C_UpdateCameraConfigBlender) == 0x000008, "Wrong alignment on BP_CameraConfigBlender_C_UpdateCameraConfigBlender");
static_assert(sizeof(BP_CameraConfigBlender_C_UpdateCameraConfigBlender) == 0x000010, "Wrong size on BP_CameraConfigBlender_C_UpdateCameraConfigBlender");
static_assert(offsetof(BP_CameraConfigBlender_C_UpdateCameraConfigBlender, DeltaSeconds) == 0x000000, "Member 'BP_CameraConfigBlender_C_UpdateCameraConfigBlender::DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_CameraConfigBlender_C_UpdateCameraConfigBlender, CallFunc_Array_IsNotEmpty_ReturnValue) == 0x000008, "Member 'BP_CameraConfigBlender_C_UpdateCameraConfigBlender::CallFunc_Array_IsNotEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CameraConfigBlender_C_UpdateCameraConfigBlender, CallFunc_IsTransitionDone_Done) == 0x000009, "Member 'BP_CameraConfigBlender_C_UpdateCameraConfigBlender::CallFunc_IsTransitionDone_Done' has a wrong offset!");
static_assert(offsetof(BP_CameraConfigBlender_C_UpdateCameraConfigBlender, CallFunc_Not_PreBool_ReturnValue) == 0x00000A, "Member 'BP_CameraConfigBlender_C_UpdateCameraConfigBlender::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CameraConfigBlender_C_UpdateCameraConfigBlender, CallFunc_BooleanAND_ReturnValue) == 0x00000B, "Member 'BP_CameraConfigBlender_C_UpdateCameraConfigBlender::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BP_CameraConfigBlender.BP_CameraConfigBlender_C.UpdateCameraConfigBlenderInternal
// 0x00B8 (0x00B8 - 0x0000)
struct BP_CameraConfigBlender_C_UpdateCameraConfigBlenderInternal final
{
public:
	double                                        DeltaSeconds;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_CameraConfig                        CallFunc_ComputeLerpCameraConfig_ReturnValue;      // 0x0008(0x0088)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
