#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DependencyRefCounter

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_DependencyRefCounter.BP_DependencyRefCounter_C.AreAllDependenciesSolved
// 0x000C (0x000C - 0x0000)
struct BP_DependencyRefCounter_C_AreAllDependenciesSolved final
{
public:
	bool                                          AllSolved;                                         // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DependencyRefCounter_C_AreAllDependenciesSolved) == 0x000004, "Wrong alignment on BP_DependencyRefCounter_C_AreAllDependenciesSolved");
static_assert(sizeof(BP_DependencyRefCounter_C_AreAllDependenciesSolved) == 0x00000C, "Wrong size on BP_DependencyRefCounter_C_AreAllDependenciesSolved");
static_assert(offsetof(BP_DependencyRefCounter_C_AreAllDependenciesSolved, AllSolved) == 0x000000, "Member 'BP_DependencyRefCounter_C_AreAllDependenciesSolved::AllSolved' has a wrong offset!");
static_assert(offsetof(BP_DependencyRefCounter_C_AreAllDependenciesSolved, CallFunc_Array_Length_ReturnValue) == 0x000004, "Member 'BP_DependencyRefCounter_C_AreAllDependenciesSolved::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DependencyRefCounter_C_AreAllDependenciesSolved, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000008, "Member 'BP_DependencyRefCounter_C_AreAllDependenciesSolved::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");

// Function BP_DependencyRefCounter.BP_DependencyRefCounter_C.CheckDependencies
// 0x0001 (0x0001 - 0x0000)
struct BP_DependencyRefCounter_C_CheckDependencies final
{
public:
	bool                                          CallFunc_HasNoPendingDependency_ReturnValue;       // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DependencyRefCounter_C_CheckDependencies) == 0x000001, "Wrong alignment on BP_DependencyRefCounter_C_CheckDependencies");
static_assert(sizeof(BP_DependencyRefCounter_C_CheckDependencies) == 0x000001, "Wrong size on BP_DependencyRefCounter_C_CheckDependencies");
static_assert(offsetof(BP_DependencyRefCounter_C_CheckDependencies, CallFunc_HasNoPendingDependency_ReturnValue) == 0x000000, "Member 'BP_DependencyRefCounter_C_CheckDependencies::CallFunc_HasNoPendingDependency_ReturnValue' has a wrong offset!");

// Function BP_DependencyRefCounter.BP_DependencyRefCounter_C.GetDebugText
// 0x0268 (0x0268 - 0x0000)
struct BP_DependencyRefCounter_C_GetDebugText final
{
public:
	class FText                                   Result;                                            // 0x0000(0x0010)(Parm, OutParm)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0018(0x0010)()
	class FText                                   Temp_text_Variable_1;                              // 0x0028(0x0010)()
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Select_Default;                             // 0x0048(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0058(0x0048)(HasGetValueTypeHash)
	class FText                                   Temp_text_Variable_2;                              // 0x00A0(0x0010)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x00B0(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00C0(0x0048)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0108(0x0048)(HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_151[0x3];                                      // 0x0151(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x0160(0x0048)(HasGetValueTypeHash)
	class UObject*                                CallFunc_Array_Get_Item;                           // 0x01A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x01B0(0x0010)(ReferenceParm)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x01C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x01D0(0x0010)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x01E0(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_4;            // 0x01F0(0x0048)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0238(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23C[0x4];                                      // 0x023C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0240(0x0010)(ReferenceParm)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_251[0x7];                                      // 0x0251(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0258(0x0010)()
};
static_assert(alignof(BP_DependencyRefCounter_C_GetDebugText) == 0x000008, "Wrong alignment on BP_DependencyRefCounter_C_GetDebugText");
static_assert(sizeof(BP_DependencyRefCounter_C_GetDebugText) == 0x000268, "Wrong size on BP_DependencyRefCounter_C_GetDebugText");
static_assert(offsetof(BP_DependencyRefCounter_C_GetDebugText, Result) == 0x000000, "Member 'BP_DependencyRefCounter_C_GetDebugText::Result' has a wrong offset!");
static_assert(offsetof(BP_DependencyRefCounter_C_GetDebugText, Temp_bool_Variable) == 0x000010, "Member 'BP_DependencyRefCounter_C_GetDebugText::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_DependencyRefCounter_C_GetDebugText, Temp_text_Variable) == 0x000018, "Member 'BP_DependencyRefCounter_C_GetDebugText::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(BP_DependencyRefCounter_C_GetDebugText, Temp_text_Variable_1) == 0x000028, "Member 'BP_DependencyRefCounter_C_GetDebugText::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_DependencyRefCounter_C_GetDebugText, Temp_int_Array_Index_Variable) == 0x000038, "Member 'BP_DependencyRefCounter_C_GetDebugText::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_DependencyRefCounter_C_GetDebugText, Temp_int_Loop_Counter_Variable) == 0x00003C, "Member 'BP_DependencyRefCounter_C_GetDebugText::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_DependencyRefCounter_C_GetDebugText, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000040, "Member 'BP_DependencyRefCounter_C_GetDebugText::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DependencyRefCounter_C_GetDebugText, CallFunc_Add_IntInt_ReturnValue) == 0x000044, "Member 'BP_DependencyRefCounter_C_GetDebugText::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DependencyRefCounter_C_GetDebugText, K2Node_Select_Default) == 0x000048, "Member 'BP_DependencyRefCounter_C_GetDebugText::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_DependencyRefCounter_C_GetDebugText, K2Node_MakeStruct_FormatArgumentData) == 0x000058, "Member 'BP_DependencyRefCounter_C_GetDebugText::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_DependencyRefCounter_C_GetDebugText, Temp_text_Variable_2) == 0x0000A0, "Member 'BP_DependencyRefCounter_C_GetDebugText::Temp_text_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_DependencyRefCounter_C_GetDebugText, CallFunc_MakeLiteralText_ReturnValue) == 0x0000B0, "Member 'BP_DependencyRefCounter_C_GetDebugText::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DependencyRefCounter_C_GetDebugText, K2Node_MakeStruct_FormatArgumentData_1) == 0x0000C0, "Member 'BP_DependencyRefCounter_C_GetDebugText::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BP_DependencyRefCounter_C_GetDebugText, K2Node_MakeStruct_FormatArgumentData_2) == 0x000108, "Member 'BP_DependencyRefCounter_C_GetDebugText::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(BP_DependencyRefCounter_C_GetDebugText, CallFunc_Not_PreBool_ReturnValue) == 0x000150, "Member 'BP_DependencyRefCounter_C_GetDebugText::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DependencyRefCounter_C_GetDebugText, CallFunc_Array_Length_ReturnValue) == 0x000154, "Member 'BP_DependencyRefCounter_C_GetDebugText::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DependencyRefCounter_C_GetDebugText, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000158, "Member 'BP_DependencyRefCounter_C_GetDebugText::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DependencyRefCounter_C_GetDebugText, K2Node_MakeStruct_FormatArgumentData_3) == 0x000160, "Member 'BP_DependencyRefCounter_C_GetDebugText::K2Node_MakeStruct_FormatArgumentData_3' has a wrong offset!");
static_assert(offsetof(BP_DependencyRefCounter_C_GetDebugText, CallFunc_Array_Get_Item) == 0x0001A8, "Member 'BP_DependencyRefCounter_C_GetDebugText::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_DependencyRefCounter_C_GetDebugText, K2Node_MakeArray_Array) == 0x0001B0, "Member 'BP_DependencyRefCounter_C_GetDebugText::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_DependencyRefCounter_C_GetDebugText, CallFunc_GetDisplayName_ReturnValue) == 0x0001C0, "Member 'BP_DependencyRefCounter_C_GetDebugText::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DependencyRefCounter_C_GetDebugText, CallFunc_Format_ReturnValue) == 0x0001D0, "Member 'BP_DependencyRefCounter_C_GetDebugText::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DependencyRefCounter_C_GetDebugText, CallFunc_Conv_StringToText_ReturnValue) == 0x0001E0, "Member 'BP_DependencyRefCounter_C_GetDebugText::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DependencyRefCounter_C_GetDebugText, K2Node_MakeStruct_FormatArgumentData_4) == 0x0001F0, "Member 'BP_DependencyRefCounter_C_GetDebugText::K2Node_MakeStruct_FormatArgumentData_4' has a wrong offset!");
static_assert(offsetof(BP_DependencyRefCounter_C_GetDebugText, CallFunc_Array_Length_ReturnValue_1) == 0x000238, "Member 'BP_DependencyRefCounter_C_GetDebugText::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DependencyRefCounter_C_GetDebugText, K2Node_MakeArray_Array_1) == 0x000240, "Member 'BP_DependencyRefCounter_C_GetDebugText::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BP_DependencyRefCounter_C_GetDebugText, CallFunc_Less_IntInt_ReturnValue) == 0x000250, "Member 'BP_DependencyRefCounter_C_GetDebugText::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DependencyRefCounter_C_GetDebugText, CallFunc_Format_ReturnValue_1) == 0x000258, "Member 'BP_DependencyRefCounter_C_GetDebugText::CallFunc_Format_ReturnValue_1' has a wrong offset!");

// Function BP_DependencyRefCounter.BP_DependencyRefCounter_C.HasNoPendingDependency
// 0x000C (0x000C - 0x0000)
struct BP_DependencyRefCounter_C_HasNoPendingDependency final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DependencyRefCounter_C_HasNoPendingDependency) == 0x000004, "Wrong alignment on BP_DependencyRefCounter_C_HasNoPendingDependency");
static_assert(sizeof(BP_DependencyRefCounter_C_HasNoPendingDependency) == 0x00000C, "Wrong size on BP_DependencyRefCounter_C_HasNoPendingDependency");
static_assert(offsetof(BP_DependencyRefCounter_C_HasNoPendingDependency, ReturnValue) == 0x000000, "Member 'BP_DependencyRefCounter_C_HasNoPendingDependency::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DependencyRefCounter_C_HasNoPendingDependency, CallFunc_Not_PreBool_ReturnValue) == 0x000001, "Member 'BP_DependencyRefCounter_C_HasNoPendingDependency::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DependencyRefCounter_C_HasNoPendingDependency, CallFunc_Array_Length_ReturnValue) == 0x000004, "Member 'BP_DependencyRefCounter_C_HasNoPendingDependency::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DependencyRefCounter_C_HasNoPendingDependency, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000008, "Member 'BP_DependencyRefCounter_C_HasNoPendingDependency::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DependencyRefCounter_C_HasNoPendingDependency, CallFunc_BooleanOR_ReturnValue) == 0x000009, "Member 'BP_DependencyRefCounter_C_HasNoPendingDependency::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function BP_DependencyRefCounter.BP_DependencyRefCounter_C.HasObjectAsDependency
// 0x0010 (0x0010 - 0x0000)
struct BP_DependencyRefCounter_C_HasObjectAsDependency final
{
public:
	const class UObject*                          Object;                                            // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DependencyRefCounter_C_HasObjectAsDependency) == 0x000008, "Wrong alignment on BP_DependencyRefCounter_C_HasObjectAsDependency");
static_assert(sizeof(BP_DependencyRefCounter_C_HasObjectAsDependency) == 0x000010, "Wrong size on BP_DependencyRefCounter_C_HasObjectAsDependency");
static_assert(offsetof(BP_DependencyRefCounter_C_HasObjectAsDependency, Object) == 0x000000, "Member 'BP_DependencyRefCounter_C_HasObjectAsDependency::Object' has a wrong offset!");
static_assert(offsetof(BP_DependencyRefCounter_C_HasObjectAsDependency, ReturnValue) == 0x000008, "Member 'BP_DependencyRefCounter_C_HasObjectAsDependency::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DependencyRefCounter_C_HasObjectAsDependency, CallFunc_Array_Contains_ReturnValue) == 0x000009, "Member 'BP_DependencyRefCounter_C_HasObjectAsDependency::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");

// Function BP_DependencyRefCounter.BP_DependencyRefCounter_C.Register Dependency
// 0x0098 (0x0098 - 0x0000)
struct BP_DependencyRefCounter_C_Register_Dependency final
{
public:
	class UObject*                                Dependency;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0008(0x0010)()
	class FText                                   CallFunc_Conv_ObjectToText_ReturnValue;            // 0x0018(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0028(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0070(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0080(0x0010)()
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_92[0x2];                                       // 0x0092(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DependencyRefCounter_C_Register_Dependency) == 0x000008, "Wrong alignment on BP_DependencyRefCounter_C_Register_Dependency");
static_assert(sizeof(BP_DependencyRefCounter_C_Register_Dependency) == 0x000098, "Wrong size on BP_DependencyRefCounter_C_Register_Dependency");
static_assert(offsetof(BP_DependencyRefCounter_C_Register_Dependency, Dependency) == 0x000000, "Member 'BP_DependencyRefCounter_C_Register_Dependency::Dependency' has a wrong offset!");
static_assert(offsetof(BP_DependencyRefCounter_C_Register_Dependency, CallFunc_MakeLiteralText_ReturnValue) == 0x000008, "Member 'BP_DependencyRefCounter_C_Register_Dependency::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DependencyRefCounter_C_Register_Dependency, CallFunc_Conv_ObjectToText_ReturnValue) == 0x000018, "Member 'BP_DependencyRefCounter_C_Register_Dependency::CallFunc_Conv_ObjectToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DependencyRefCounter_C_Register_Dependency, K2Node_MakeStruct_FormatArgumentData) == 0x000028, "Member 'BP_DependencyRefCounter_C_Register_Dependency::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_DependencyRefCounter_C_Register_Dependency, K2Node_MakeArray_Array) == 0x000070, "Member 'BP_DependencyRefCounter_C_Register_Dependency::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_DependencyRefCounter_C_Register_Dependency, CallFunc_Format_ReturnValue) == 0x000080, "Member 'BP_DependencyRefCounter_C_Register_Dependency::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DependencyRefCounter_C_Register_Dependency, CallFunc_Array_Contains_ReturnValue) == 0x000090, "Member 'BP_DependencyRefCounter_C_Register_Dependency::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DependencyRefCounter_C_Register_Dependency, CallFunc_Not_PreBool_ReturnValue) == 0x000091, "Member 'BP_DependencyRefCounter_C_Register_Dependency::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DependencyRefCounter_C_Register_Dependency, CallFunc_Array_Add_ReturnValue) == 0x000094, "Member 'BP_DependencyRefCounter_C_Register_Dependency::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function BP_DependencyRefCounter.BP_DependencyRefCounter_C.SolveDependency
// 0x0090 (0x0090 - 0x0000)
struct BP_DependencyRefCounter_C_SolveDependency final
{
public:
	class UObject*                                Dependency;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_ObjectToText_ReturnValue;            // 0x0008(0x0010)()
	bool                                          CallFunc_HasObjectAsDependency_ReturnValue;        // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0020(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0068(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0078(0x0010)()
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DependencyRefCounter_C_SolveDependency) == 0x000008, "Wrong alignment on BP_DependencyRefCounter_C_SolveDependency");
static_assert(sizeof(BP_DependencyRefCounter_C_SolveDependency) == 0x000090, "Wrong size on BP_DependencyRefCounter_C_SolveDependency");
static_assert(offsetof(BP_DependencyRefCounter_C_SolveDependency, Dependency) == 0x000000, "Member 'BP_DependencyRefCounter_C_SolveDependency::Dependency' has a wrong offset!");
static_assert(offsetof(BP_DependencyRefCounter_C_SolveDependency, CallFunc_Conv_ObjectToText_ReturnValue) == 0x000008, "Member 'BP_DependencyRefCounter_C_SolveDependency::CallFunc_Conv_ObjectToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DependencyRefCounter_C_SolveDependency, CallFunc_HasObjectAsDependency_ReturnValue) == 0x000018, "Member 'BP_DependencyRefCounter_C_SolveDependency::CallFunc_HasObjectAsDependency_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DependencyRefCounter_C_SolveDependency, K2Node_MakeStruct_FormatArgumentData) == 0x000020, "Member 'BP_DependencyRefCounter_C_SolveDependency::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_DependencyRefCounter_C_SolveDependency, K2Node_MakeArray_Array) == 0x000068, "Member 'BP_DependencyRefCounter_C_SolveDependency::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_DependencyRefCounter_C_SolveDependency, CallFunc_Format_ReturnValue) == 0x000078, "Member 'BP_DependencyRefCounter_C_SolveDependency::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DependencyRefCounter_C_SolveDependency, CallFunc_Array_Add_ReturnValue) == 0x000088, "Member 'BP_DependencyRefCounter_C_SolveDependency::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DependencyRefCounter_C_SolveDependency, CallFunc_Array_RemoveItem_ReturnValue) == 0x00008C, "Member 'BP_DependencyRefCounter_C_SolveDependency::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");

}

