#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DamageableLevelElement_Parent

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_DamageableLevelElement_Parent.BP_DamageableLevelElement_Parent_C.ExecuteUbergraph_BP_DamageableLevelElement_Parent
// 0x0380 (0x0380 - 0x0000)
struct BP_DamageableLevelElement_Parent_C_ExecuteUbergraph_BP_DamageableLevelElement_Parent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_jRPG_Character_World_C*             K2Node_Event_PlayerCharacter;                      // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_ImpactPoint;                          // 0x0010(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_ExplorationCapacityComponent_FreeAimDamage_C* CallFunc_GetComponentByClass_ReturnValue; // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ABP_jRPG_Character_World_C*             K2Node_CustomEvent_PlayerCharacter_1;              // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_ImpactPoint_1;                  // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanDamageElement_ReturnValue;             // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorUpVector_ReturnValue;             // 0x0070(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_jRPG_Character_World_C*             K2Node_CustomEvent_PlayerCharacter;                // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_ImpactPoint;                    // 0x0090(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_CustomLookRotation_ReturnValue;           // 0x00A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x00C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_jRPG_Character_World_C*             K2Node_DynamicCast_AsBP_J_RPG_Character_World;     // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_111[0xF];                                      // 0x0111(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0120(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGeometryCollectionComponent*           CallFunc_SpawnGeometryCollectionComponentWithRestCollection_ReturnValue; // 0x0180(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FChaosBreakEvent                       K2Node_CustomEvent_BreakEvent;                     // 0x0188(0x0078)(ConstParm, NoDestructor, ContainsInstancedReference)
	TDelegate<void(const struct FChaosBreakEvent& BreakEvent)> K2Node_CreateDelegate_OutputDelegate; // 0x0200(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_GetRootCurrentTransform_ReturnValue;      // 0x0210(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0270(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0288(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x02A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue;                         // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C1[0x7];                                      // 0x02C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetActorScale3D_ReturnValue;              // 0x02C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x02E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F8[0x8];                                      // 0x02F8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0300(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0360(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_MasterField_DamageableLevelElement_C* CallFunc_FinishSpawningActor_ReturnValue;        // 0x0368(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_Alpha_ImplicitCast;                  // 0x0370(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValueOnMaterials_ParameterValue_ImplicitCast; // 0x0378(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DamageableLevelElement_Parent_C_ExecuteUbergraph_BP_DamageableLevelElement_Parent) == 0x000010, "Wrong alignment on BP_DamageableLevelElement_Parent_C_ExecuteUbergraph_BP_DamageableLevelElement_Parent");
static_assert(sizeof(BP_DamageableLevelElement_Parent_C_ExecuteUbergraph_BP_DamageableLevelElement_Parent) == 0x000380, "Wrong size on BP_DamageableLevelElement_Parent_C_ExecuteUbergraph_BP_DamageableLevelElement_Parent");
static_assert(offsetof(BP_DamageableLevelElement_Parent_C_ExecuteUbergraph_BP_DamageableLevelElement_Parent, EntryPoint) == 0x000000, "Member 'BP_DamageableLevelElement_Parent_C_ExecuteUbergraph_BP_DamageableLevelElement_Parent::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_DamageableLevelElement_Parent_C_ExecuteUbergraph_BP_DamageableLevelElement_Parent, K2Node_Event_PlayerCharacter) == 0x000008, "Member 'BP_DamageableLevelElement_Parent_C_ExecuteUbergraph_BP_DamageableLevelElement_Parent::K2Node_Event_PlayerCharacter' has a wrong offset!");
static_assert(offsetof(BP_DamageableLevelElement_Parent_C_ExecuteUbergraph_BP_DamageableLevelElement_Parent, K2Node_Event_ImpactPoint) == 0x000010, "Member 'BP_DamageableLevelElement_Parent_C_ExecuteUbergraph_BP_DamageableLevelElement_Parent::K2Node_Event_ImpactPoint' has a wrong offset!");
static_assert(offsetof(BP_DamageableLevelElement_Parent_C_ExecuteUbergraph_BP_DamageableLevelElement_Parent, CallFunc_GetComponentByClass_ReturnValue) == 0x000028, "Member 'BP_DamageableLevelElement_Parent_C_ExecuteUbergraph_BP_DamageableLevelElement_Parent::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DamageableLevelElement_Parent_C_ExecuteUbergraph_BP_DamageableLevelElement_Parent, K2Node_CustomEvent_PlayerCharacter_1) == 0x000030, "Member 'BP_DamageableLevelElement_Parent_C_ExecuteUbergraph_BP_DamageableLevelElement_Parent::K2Node_CustomEvent_PlayerCharacter_1' has a wrong offset!");
static_assert(offsetof(BP_DamageableLevelElement_Parent_C_ExecuteUbergraph_BP_DamageableLevelElement_Parent, K2Node_CustomEvent_ImpactPoint_1) == 0x000038, "Member 'BP_DamageableLevelElement_Parent_C_ExecuteUbergraph_BP_DamageableLevelElement_Parent::K2Node_CustomEvent_ImpactPoint_1' has a wrong offset!");
static_assert(offsetof(BP_DamageableLevelElement_Parent_C_ExecuteUbergraph_BP_DamageableLevelElement_Parent, CallFunc_CanDamageElement_ReturnValue) == 0x000050, "Member 'BP_DamageableLevelElement_Parent_C_ExecuteUbergraph_BP_DamageableLevelElement_Parent::CallFunc_CanDamageElement_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DamageableLevelElement_Parent_C_ExecuteUbergraph_BP_DamageableLevelElement_Parent, CallFunc_GetActorForwardVector_ReturnValue) == 0x000058, "Member 'BP_DamageableLevelElement_Parent_C_ExecuteUbergraph_BP_DamageableLevelElement_Parent::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DamageableLevelElement_Parent_C_ExecuteUbergraph_BP_DamageableLevelElement_Parent, CallFunc_GetActorUpVector_ReturnValue) == 0x000070, "Member 'BP_DamageableLevelElement_Parent_C_ExecuteUbergraph_BP_DamageableLevelElement_Parent::CallFunc_GetActorUpVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DamageableLevelElement_Parent_C_ExecuteUbergraph_BP_DamageableLevelElement_Parent, K2Node_CustomEvent_PlayerCharacter) == 0x000088, "Member 'BP_DamageableLevelElement_Parent_C_ExecuteUbergraph_BP_DamageableLevelElement_Parent::K2Node_CustomEvent_PlayerCharacter' has a wrong offset!");
static_assert(offsetof(BP_DamageableLevelElement_Parent_C_ExecuteUbergraph_BP_DamageableLevelElement_Parent, K2Node_CustomEvent_ImpactPoint) == 0x000090, "Member 'BP_DamageableLevelElement_Parent_C_ExecuteUbergraph_BP_DamageableLevelElement_Parent::K2Node_CustomEvent_ImpactPoint' has a wrong offset!");
static_assert(offsetof(BP_DamageableLevelElement_Parent_C_ExecuteUbergraph_BP_DamageableLevelElement_Parent, CallFunc_CustomLookRotation_ReturnValue) == 0x0000A8, "Member 'BP_DamageableLevelElement_Parent_C_ExecuteUbergraph_BP_DamageableLevelElement_Parent::CallFunc_CustomLookRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DamageableLevelElement_Parent_C_ExecuteUbergraph_BP_DamageableLevelElement_Parent, Temp_bool_Has_Been_Initd_Variable) == 0x0000C0, "Member 'BP_DamageableLevelElement_Parent_C_ExecuteUbergraph_BP_DamageableLevelElement_Parent::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_DamageableLevelElement_Parent_C_ExecuteUbergraph_BP_DamageableLevelElement_Parent, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x0000C8, "Member 'BP_DamageableLevelElement_Parent_C_ExecuteUbergraph_BP_DamageableLevelElement_Parent::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DamageableLevelElement_Parent_C_ExecuteUbergraph_BP_DamageableLevelElement_Parent, CallFunc_Not_PreBool_ReturnValue) == 0x0000E0, "Member 'BP_DamageableLevelElement_Parent_C_ExecuteUbergraph_BP_DamageableLevelElement_Parent::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DamageableLevelElement_Parent_C_ExecuteUbergraph_BP_DamageableLevelElement_Parent, CallFunc_GetPlayerCharacter_ReturnValue) == 0x0000E8, "Member 'BP_DamageableLevelElement_Parent_C_ExecuteUbergraph_BP_DamageableLevelElement_Parent::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DamageableLevelElement_Parent_C_ExecuteUbergraph_BP_DamageableLevelElement_Parent, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0000F0, "Member 'BP_DamageableLevelElement_Parent_C_ExecuteUbergraph_BP_DamageableLevelElement_Parent::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DamageableLevelElement_Parent_C_ExecuteUbergraph_BP_DamageableLevelElement_Parent, K2Node_DynamicCast_AsBP_J_RPG_Character_World) == 0x000108, "Member 'BP_DamageableLevelElement_Parent_C_ExecuteUbergraph_BP_DamageableLevelElement_Parent::K2Node_DynamicCast_AsBP_J_RPG_Character_World' has a wrong offset!");
static_assert(offsetof(BP_DamageableLevelElement_Parent_C_ExecuteUbergraph_BP_DamageableLevelElement_Parent, K2Node_DynamicCast_bSuccess) == 0x000110, "Member 'BP_DamageableLevelElement_Parent_C_ExecuteUbergraph_BP_DamageableLevelElement_Parent::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_DamageableLevelElement_Parent_C_ExecuteUbergraph_BP_DamageableLevelElement_Parent, CallFunc_GetTransform_ReturnValue) == 0x000120, "Member 'BP_DamageableLevelElement_Parent_C_ExecuteUbergraph_BP_DamageableLevelElement_Parent::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DamageableLevelElement_Parent_C_ExecuteUbergraph_BP_DamageableLevelElement_Parent, CallFunc_SpawnGeometryCollectionComponentWithRestCollection_ReturnValue) == 0x000180, "Member 'BP_DamageableLevelElement_Parent_C_ExecuteUbergraph_BP_DamageableLevelElement_Parent::CallFunc_SpawnGeometryCollectionComponentWithRestCollection_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DamageableLevelElement_Parent_C_ExecuteUbergraph_BP_DamageableLevelElement_Parent, K2Node_CustomEvent_BreakEvent) == 0x000188, "Member 'BP_DamageableLevelElement_Parent_C_ExecuteUbergraph_BP_DamageableLevelElement_Parent::K2Node_CustomEvent_BreakEvent' has a wrong offset!");
static_assert(offsetof(BP_DamageableLevelElement_Parent_C_ExecuteUbergraph_BP_DamageableLevelElement_Parent, K2Node_CreateDelegate_OutputDelegate) == 0x000200, "Member 'BP_DamageableLevelElement_Parent_C_ExecuteUbergraph_BP_DamageableLevelElement_Parent::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_DamageableLevelElement_Parent_C_ExecuteUbergraph_BP_DamageableLevelElement_Parent, CallFunc_GetRootCurrentTransform_ReturnValue) == 0x000210, "Member 'BP_DamageableLevelElement_Parent_C_ExecuteUbergraph_BP_DamageableLevelElement_Parent::CallFunc_GetRootCurrentTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DamageableLevelElement_Parent_C_ExecuteUbergraph_BP_DamageableLevelElement_Parent, CallFunc_BreakTransform_Location) == 0x000270, "Member 'BP_DamageableLevelElement_Parent_C_ExecuteUbergraph_BP_DamageableLevelElement_Parent::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(BP_DamageableLevelElement_Parent_C_ExecuteUbergraph_BP_DamageableLevelElement_Parent, CallFunc_BreakTransform_Rotation) == 0x000288, "Member 'BP_DamageableLevelElement_Parent_C_ExecuteUbergraph_BP_DamageableLevelElement_Parent::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(BP_DamageableLevelElement_Parent_C_ExecuteUbergraph_BP_DamageableLevelElement_Parent, CallFunc_BreakTransform_Scale) == 0x0002A0, "Member 'BP_DamageableLevelElement_Parent_C_ExecuteUbergraph_BP_DamageableLevelElement_Parent::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(BP_DamageableLevelElement_Parent_C_ExecuteUbergraph_BP_DamageableLevelElement_Parent, CallFunc_Lerp_ReturnValue) == 0x0002B8, "Member 'BP_DamageableLevelElement_Parent_C_ExecuteUbergraph_BP_DamageableLevelElement_Parent::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DamageableLevelElement_Parent_C_ExecuteUbergraph_BP_DamageableLevelElement_Parent, Temp_bool_IsClosed_Variable) == 0x0002C0, "Member 'BP_DamageableLevelElement_Parent_C_ExecuteUbergraph_BP_DamageableLevelElement_Parent::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_DamageableLevelElement_Parent_C_ExecuteUbergraph_BP_DamageableLevelElement_Parent, CallFunc_GetActorScale3D_ReturnValue) == 0x0002C8, "Member 'BP_DamageableLevelElement_Parent_C_ExecuteUbergraph_BP_DamageableLevelElement_Parent::CallFunc_GetActorScale3D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DamageableLevelElement_Parent_C_ExecuteUbergraph_BP_DamageableLevelElement_Parent, CallFunc_Multiply_VectorVector_ReturnValue) == 0x0002E0, "Member 'BP_DamageableLevelElement_Parent_C_ExecuteUbergraph_BP_DamageableLevelElement_Parent::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DamageableLevelElement_Parent_C_ExecuteUbergraph_BP_DamageableLevelElement_Parent, CallFunc_MakeTransform_ReturnValue) == 0x000300, "Member 'BP_DamageableLevelElement_Parent_C_ExecuteUbergraph_BP_DamageableLevelElement_Parent::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DamageableLevelElement_Parent_C_ExecuteUbergraph_BP_DamageableLevelElement_Parent, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000360, "Member 'BP_DamageableLevelElement_Parent_C_ExecuteUbergraph_BP_DamageableLevelElement_Parent::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DamageableLevelElement_Parent_C_ExecuteUbergraph_BP_DamageableLevelElement_Parent, CallFunc_FinishSpawningActor_ReturnValue) == 0x000368, "Member 'BP_DamageableLevelElement_Parent_C_ExecuteUbergraph_BP_DamageableLevelElement_Parent::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DamageableLevelElement_Parent_C_ExecuteUbergraph_BP_DamageableLevelElement_Parent, CallFunc_Lerp_Alpha_ImplicitCast) == 0x000370, "Member 'BP_DamageableLevelElement_Parent_C_ExecuteUbergraph_BP_DamageableLevelElement_Parent::CallFunc_Lerp_Alpha_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_DamageableLevelElement_Parent_C_ExecuteUbergraph_BP_DamageableLevelElement_Parent, CallFunc_SetScalarParameterValueOnMaterials_ParameterValue_ImplicitCast) == 0x000378, "Member 'BP_DamageableLevelElement_Parent_C_ExecuteUbergraph_BP_DamageableLevelElement_Parent::CallFunc_SetScalarParameterValueOnMaterials_ParameterValue_ImplicitCast' has a wrong offset!");

// Function BP_DamageableLevelElement_Parent.BP_DamageableLevelElement_Parent_C.ExplorationAttacked
// 0x0020 (0x0020 - 0x0000)
struct BP_DamageableLevelElement_Parent_C_ExplorationAttacked final
{
public:
	class ABP_jRPG_Character_World_C*             PlayerCharacter;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ImpactPoint;                                       // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DamageableLevelElement_Parent_C_ExplorationAttacked) == 0x000008, "Wrong alignment on BP_DamageableLevelElement_Parent_C_ExplorationAttacked");
static_assert(sizeof(BP_DamageableLevelElement_Parent_C_ExplorationAttacked) == 0x000020, "Wrong size on BP_DamageableLevelElement_Parent_C_ExplorationAttacked");
static_assert(offsetof(BP_DamageableLevelElement_Parent_C_ExplorationAttacked, PlayerCharacter) == 0x000000, "Member 'BP_DamageableLevelElement_Parent_C_ExplorationAttacked::PlayerCharacter' has a wrong offset!");
static_assert(offsetof(BP_DamageableLevelElement_Parent_C_ExplorationAttacked, ImpactPoint) == 0x000008, "Member 'BP_DamageableLevelElement_Parent_C_ExplorationAttacked::ImpactPoint' has a wrong offset!");

// Function BP_DamageableLevelElement_Parent.BP_DamageableLevelElement_Parent_C.ForceUpdateDamageableElementState
// 0x0001 (0x0001 - 0x0000)
struct BP_DamageableLevelElement_Parent_C_ForceUpdateDamageableElementState final
{
public:
	bool                                          CallFunc_ReadState_Destroyed;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DamageableLevelElement_Parent_C_ForceUpdateDamageableElementState) == 0x000001, "Wrong alignment on BP_DamageableLevelElement_Parent_C_ForceUpdateDamageableElementState");
static_assert(sizeof(BP_DamageableLevelElement_Parent_C_ForceUpdateDamageableElementState) == 0x000001, "Wrong size on BP_DamageableLevelElement_Parent_C_ForceUpdateDamageableElementState");
static_assert(offsetof(BP_DamageableLevelElement_Parent_C_ForceUpdateDamageableElementState, CallFunc_ReadState_Destroyed) == 0x000000, "Member 'BP_DamageableLevelElement_Parent_C_ForceUpdateDamageableElementState::CallFunc_ReadState_Destroyed' has a wrong offset!");

// Function BP_DamageableLevelElement_Parent.BP_DamageableLevelElement_Parent_C.OnChaosBreak
// 0x0078 (0x0078 - 0x0000)
struct BP_DamageableLevelElement_Parent_C_OnChaosBreak final
{
public:
	struct FChaosBreakEvent                       BreakEvent;                                        // 0x0000(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_DamageableLevelElement_Parent_C_OnChaosBreak) == 0x000008, "Wrong alignment on BP_DamageableLevelElement_Parent_C_OnChaosBreak");
static_assert(sizeof(BP_DamageableLevelElement_Parent_C_OnChaosBreak) == 0x000078, "Wrong size on BP_DamageableLevelElement_Parent_C_OnChaosBreak");
static_assert(offsetof(BP_DamageableLevelElement_Parent_C_OnChaosBreak, BreakEvent) == 0x000000, "Member 'BP_DamageableLevelElement_Parent_C_OnChaosBreak::BreakEvent' has a wrong offset!");

// Function BP_DamageableLevelElement_Parent.BP_DamageableLevelElement_Parent_C.OnDamageDenied
// 0x0020 (0x0020 - 0x0000)
struct BP_DamageableLevelElement_Parent_C_OnDamageDenied final
{
public:
	class ABP_jRPG_Character_World_C*             PlayerCharacter;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ImpactPoint;                                       // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DamageableLevelElement_Parent_C_OnDamageDenied) == 0x000008, "Wrong alignment on BP_DamageableLevelElement_Parent_C_OnDamageDenied");
static_assert(sizeof(BP_DamageableLevelElement_Parent_C_OnDamageDenied) == 0x000020, "Wrong size on BP_DamageableLevelElement_Parent_C_OnDamageDenied");
static_assert(offsetof(BP_DamageableLevelElement_Parent_C_OnDamageDenied, PlayerCharacter) == 0x000000, "Member 'BP_DamageableLevelElement_Parent_C_OnDamageDenied::PlayerCharacter' has a wrong offset!");
static_assert(offsetof(BP_DamageableLevelElement_Parent_C_OnDamageDenied, ImpactPoint) == 0x000008, "Member 'BP_DamageableLevelElement_Parent_C_OnDamageDenied::ImpactPoint' has a wrong offset!");

// Function BP_DamageableLevelElement_Parent.BP_DamageableLevelElement_Parent_C.OnDamageReceived
// 0x0020 (0x0020 - 0x0000)
struct BP_DamageableLevelElement_Parent_C_OnDamageReceived final
{
public:
	class ABP_jRPG_Character_World_C*             PlayerCharacter;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ImpactPoint;                                       // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DamageableLevelElement_Parent_C_OnDamageReceived) == 0x000008, "Wrong alignment on BP_DamageableLevelElement_Parent_C_OnDamageReceived");
static_assert(sizeof(BP_DamageableLevelElement_Parent_C_OnDamageReceived) == 0x000020, "Wrong size on BP_DamageableLevelElement_Parent_C_OnDamageReceived");
static_assert(offsetof(BP_DamageableLevelElement_Parent_C_OnDamageReceived, PlayerCharacter) == 0x000000, "Member 'BP_DamageableLevelElement_Parent_C_OnDamageReceived::PlayerCharacter' has a wrong offset!");
static_assert(offsetof(BP_DamageableLevelElement_Parent_C_OnDamageReceived, ImpactPoint) == 0x000008, "Member 'BP_DamageableLevelElement_Parent_C_OnDamageReceived::ImpactPoint' has a wrong offset!");

// Function BP_DamageableLevelElement_Parent.BP_DamageableLevelElement_Parent_C.PlayFeedbackOnDamageDenied
// 0x00E0 (0x00E0 - 0x0000)
struct BP_DamageableLevelElement_Parent_C_PlayFeedbackOnDamageDenied final
{
public:
	class AActor*                                 self2;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ImpactPoint;                                       // 0x0008(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue;           // 0x0050(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x0068(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0090(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x00A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DamageableLevelElement_Parent_C_PlayFeedbackOnDamageDenied) == 0x000008, "Wrong alignment on BP_DamageableLevelElement_Parent_C_PlayFeedbackOnDamageDenied");
static_assert(sizeof(BP_DamageableLevelElement_Parent_C_PlayFeedbackOnDamageDenied) == 0x0000E0, "Wrong size on BP_DamageableLevelElement_Parent_C_PlayFeedbackOnDamageDenied");
static_assert(offsetof(BP_DamageableLevelElement_Parent_C_PlayFeedbackOnDamageDenied, self2) == 0x000000, "Member 'BP_DamageableLevelElement_Parent_C_PlayFeedbackOnDamageDenied::self2' has a wrong offset!");
static_assert(offsetof(BP_DamageableLevelElement_Parent_C_PlayFeedbackOnDamageDenied, ImpactPoint) == 0x000008, "Member 'BP_DamageableLevelElement_Parent_C_PlayFeedbackOnDamageDenied::ImpactPoint' has a wrong offset!");
