#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DataAsset_FullscreenNotification

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_DataAsset_FullscreenNotification.BP_DataAsset_FullscreenNotification_C
// 0x0030 (0x0060 - 0x0030)
class UBP_DataAsset_FullscreenNotification_C final : public UPrimaryDataAsset
{
public:
	class UClass*                                 WidgetClass;                                       // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FText                                   HeaderText;                                        // 0x0038(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   DescriptionText;                                   // 0x0048(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          bIsHandledByGameAction;                            // 0x0058(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void IsHandledByGameAction(bool* bIsHandledByGameAction_0);
	void GetDescriptionText(class FText* DescriptionText_0);
	void GetHeaderText(class FText* HeaderText_0);
	void GetWidgetClass(class UClass** WidgetClass_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_DataAsset_FullscreenNotification_C">();
	}
	static class UBP_DataAsset_FullscreenNotification_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_DataAsset_FullscreenNotification_C>();
	}
};
static_assert(alignof(UBP_DataAsset_FullscreenNotification_C) == 0x000008, "Wrong alignment on UBP_DataAsset_FullscreenNotification_C");
static_assert(sizeof(UBP_DataAsset_FullscreenNotification_C) == 0x000060, "Wrong size on UBP_DataAsset_FullscreenNotification_C");
static_assert(offsetof(UBP_DataAsset_FullscreenNotification_C, WidgetClass) == 0x000030, "Member 'UBP_DataAsset_FullscreenNotification_C::WidgetClass' has a wrong offset!");
static_assert(offsetof(UBP_DataAsset_FullscreenNotification_C, HeaderText) == 0x000038, "Member 'UBP_DataAsset_FullscreenNotification_C::HeaderText' has a wrong offset!");
static_assert(offsetof(UBP_DataAsset_FullscreenNotification_C, DescriptionText) == 0x000048, "Member 'UBP_DataAsset_FullscreenNotification_C::DescriptionText' has a wrong offset!");
static_assert(offsetof(UBP_DataAsset_FullscreenNotification_C, bIsHandledByGameAction) == 0x000058, "Member 'UBP_DataAsset_FullscreenNotification_C::bIsHandledByGameAction' has a wrong offset!");

}

