#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DataAsset_ProjectConfiguration

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "SandFall_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_DataAsset_ProjectConfiguration.BP_DataAsset_ProjectConfiguration_C
// 0x0098 (0x00D0 - 0x0038)
class UBP_DataAsset_ProjectConfiguration_C final : public UProjectConfiguration
{
public:
	TSoftObjectPtr<class UWorld>                  DemoLevel;                                         // 0x0038(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash)
	TSoftObjectPtr<class UWorld>                  NewGameLevel;                                      // 0x0060(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash)
	struct FGameplayTag                           NewGameSpawnPoint;                                 // 0x0088(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UWorld>                  MainMenuLevel;                                     // 0x0090(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash)
	class UDataTable*                             DT_CharacterSideQuestUnlock;                       // 0x00B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             DT_MainPath_DialoguesAndCutscenes;                 // 0x00C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             DT_Camp_OptionalGameActions;                       // 0x00C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void GetMainMenuLevel(TSoftObjectPtr<class UWorld>* MainMenuLevel_0);
	void GetNewGameLevel(TSoftObjectPtr<class UWorld>* LevelDestination);
	void GetNewGameSpawnPointTag(struct FGameplayTag* SpawnPointTag);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_DataAsset_ProjectConfiguration_C">();
	}
	static class UBP_DataAsset_ProjectConfiguration_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_DataAsset_ProjectConfiguration_C>();
	}
};
static_assert(alignof(UBP_DataAsset_ProjectConfiguration_C) == 0x000008, "Wrong alignment on UBP_DataAsset_ProjectConfiguration_C");
static_assert(sizeof(UBP_DataAsset_ProjectConfiguration_C) == 0x0000D0, "Wrong size on UBP_DataAsset_ProjectConfiguration_C");
static_assert(offsetof(UBP_DataAsset_ProjectConfiguration_C, DemoLevel) == 0x000038, "Member 'UBP_DataAsset_ProjectConfiguration_C::DemoLevel' has a wrong offset!");
static_assert(offsetof(UBP_DataAsset_ProjectConfiguration_C, NewGameLevel) == 0x000060, "Member 'UBP_DataAsset_ProjectConfiguration_C::NewGameLevel' has a wrong offset!");
static_assert(offsetof(UBP_DataAsset_ProjectConfiguration_C, NewGameSpawnPoint) == 0x000088, "Member 'UBP_DataAsset_ProjectConfiguration_C::NewGameSpawnPoint' has a wrong offset!");
static_assert(offsetof(UBP_DataAsset_ProjectConfiguration_C, MainMenuLevel) == 0x000090, "Member 'UBP_DataAsset_ProjectConfiguration_C::MainMenuLevel' has a wrong offset!");
static_assert(offsetof(UBP_DataAsset_ProjectConfiguration_C, DT_CharacterSideQuestUnlock) == 0x0000B8, "Member 'UBP_DataAsset_ProjectConfiguration_C::DT_CharacterSideQuestUnlock' has a wrong offset!");
static_assert(offsetof(UBP_DataAsset_ProjectConfiguration_C, DT_MainPath_DialoguesAndCutscenes) == 0x0000C0, "Member 'UBP_DataAsset_ProjectConfiguration_C::DT_MainPath_DialoguesAndCutscenes' has a wrong offset!");
static_assert(offsetof(UBP_DataAsset_ProjectConfiguration_C, DT_Camp_OptionalGameActions) == 0x0000C8, "Member 'UBP_DataAsset_ProjectConfiguration_C::DT_Camp_OptionalGameActions' has a wrong offset!");

}

