#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DEPRECIATE_EnvironmentInteractionComponent

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_DEPRECIATE_EnvironmentInteractionComponent.BP_DEPRECIATE_EnvironmentInteractionComponent_C.CreateSecondaryNiagaraSystemIfNeeded
// 0x0070 (0x0070 - 0x0000)
struct BP_DEPRECIATE_EnvironmentInteractionComponent_C_CreateSecondaryNiagaraSystemIfNeeded final
{
public:
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      Temp_wildcard_Variable;                            // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue;      // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_Multiply_RotatorFloat_ReturnValue;        // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAttached_ReturnValue;          // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DEPRECIATE_EnvironmentInteractionComponent_C_CreateSecondaryNiagaraSystemIfNeeded) == 0x000008, "Wrong alignment on BP_DEPRECIATE_EnvironmentInteractionComponent_C_CreateSecondaryNiagaraSystemIfNeeded");
static_assert(sizeof(BP_DEPRECIATE_EnvironmentInteractionComponent_C_CreateSecondaryNiagaraSystemIfNeeded) == 0x000070, "Wrong size on BP_DEPRECIATE_EnvironmentInteractionComponent_C_CreateSecondaryNiagaraSystemIfNeeded");
static_assert(offsetof(BP_DEPRECIATE_EnvironmentInteractionComponent_C_CreateSecondaryNiagaraSystemIfNeeded, CallFunc_GetOwner_ReturnValue) == 0x000000, "Member 'BP_DEPRECIATE_EnvironmentInteractionComponent_C_CreateSecondaryNiagaraSystemIfNeeded::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DEPRECIATE_EnvironmentInteractionComponent_C_CreateSecondaryNiagaraSystemIfNeeded, Temp_wildcard_Variable) == 0x000008, "Member 'BP_DEPRECIATE_EnvironmentInteractionComponent_C_CreateSecondaryNiagaraSystemIfNeeded::Temp_wildcard_Variable' has a wrong offset!");
static_assert(offsetof(BP_DEPRECIATE_EnvironmentInteractionComponent_C_CreateSecondaryNiagaraSystemIfNeeded, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000010, "Member 'BP_DEPRECIATE_EnvironmentInteractionComponent_C_CreateSecondaryNiagaraSystemIfNeeded::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DEPRECIATE_EnvironmentInteractionComponent_C_CreateSecondaryNiagaraSystemIfNeeded, CallFunc_K2_GetComponentRotation_ReturnValue) == 0x000018, "Member 'BP_DEPRECIATE_EnvironmentInteractionComponent_C_CreateSecondaryNiagaraSystemIfNeeded::CallFunc_K2_GetComponentRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DEPRECIATE_EnvironmentInteractionComponent_C_CreateSecondaryNiagaraSystemIfNeeded, CallFunc_Multiply_RotatorFloat_ReturnValue) == 0x000030, "Member 'BP_DEPRECIATE_EnvironmentInteractionComponent_C_CreateSecondaryNiagaraSystemIfNeeded::CallFunc_Multiply_RotatorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DEPRECIATE_EnvironmentInteractionComponent_C_CreateSecondaryNiagaraSystemIfNeeded, CallFunc_SpawnSystemAttached_ReturnValue) == 0x000048, "Member 'BP_DEPRECIATE_EnvironmentInteractionComponent_C_CreateSecondaryNiagaraSystemIfNeeded::CallFunc_SpawnSystemAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DEPRECIATE_EnvironmentInteractionComponent_C_CreateSecondaryNiagaraSystemIfNeeded, CallFunc_Array_Add_ReturnValue) == 0x000050, "Member 'BP_DEPRECIATE_EnvironmentInteractionComponent_C_CreateSecondaryNiagaraSystemIfNeeded::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DEPRECIATE_EnvironmentInteractionComponent_C_CreateSecondaryNiagaraSystemIfNeeded, CallFunc_GetPlayerPawn_ReturnValue) == 0x000058, "Member 'BP_DEPRECIATE_EnvironmentInteractionComponent_C_CreateSecondaryNiagaraSystemIfNeeded::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DEPRECIATE_EnvironmentInteractionComponent_C_CreateSecondaryNiagaraSystemIfNeeded, CallFunc_GetOwner_ReturnValue_1) == 0x000060, "Member 'BP_DEPRECIATE_EnvironmentInteractionComponent_C_CreateSecondaryNiagaraSystemIfNeeded::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DEPRECIATE_EnvironmentInteractionComponent_C_CreateSecondaryNiagaraSystemIfNeeded, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000068, "Member 'BP_DEPRECIATE_EnvironmentInteractionComponent_C_CreateSecondaryNiagaraSystemIfNeeded::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");

// Function BP_DEPRECIATE_EnvironmentInteractionComponent.BP_DEPRECIATE_EnvironmentInteractionComponent_C.ExecuteUbergraph_BP_DEPRECIATE_EnvironmentInteractionComponent
// 0x000C (0x000C - 0x0000)
struct BP_DEPRECIATE_EnvironmentInteractionComponent_C_ExecuteUbergraph_BP_DEPRECIATE_EnvironmentInteractionComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DEPRECIATE_EnvironmentInteractionComponent_C_ExecuteUbergraph_BP_DEPRECIATE_EnvironmentInteractionComponent) == 0x000004, "Wrong alignment on BP_DEPRECIATE_EnvironmentInteractionComponent_C_ExecuteUbergraph_BP_DEPRECIATE_EnvironmentInteractionComponent");
static_assert(sizeof(BP_DEPRECIATE_EnvironmentInteractionComponent_C_ExecuteUbergraph_BP_DEPRECIATE_EnvironmentInteractionComponent) == 0x00000C, "Wrong size on BP_DEPRECIATE_EnvironmentInteractionComponent_C_ExecuteUbergraph_BP_DEPRECIATE_EnvironmentInteractionComponent");
static_assert(offsetof(BP_DEPRECIATE_EnvironmentInteractionComponent_C_ExecuteUbergraph_BP_DEPRECIATE_EnvironmentInteractionComponent, EntryPoint) == 0x000000, "Member 'BP_DEPRECIATE_EnvironmentInteractionComponent_C_ExecuteUbergraph_BP_DEPRECIATE_EnvironmentInteractionComponent::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_DEPRECIATE_EnvironmentInteractionComponent_C_ExecuteUbergraph_BP_DEPRECIATE_EnvironmentInteractionComponent, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'BP_DEPRECIATE_EnvironmentInteractionComponent_C_ExecuteUbergraph_BP_DEPRECIATE_EnvironmentInteractionComponent::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_DEPRECIATE_EnvironmentInteractionComponent_C_ExecuteUbergraph_BP_DEPRECIATE_EnvironmentInteractionComponent, K2Node_Event_EndPlayReason) == 0x000008, "Member 'BP_DEPRECIATE_EnvironmentInteractionComponent_C_ExecuteUbergraph_BP_DEPRECIATE_EnvironmentInteractionComponent::K2Node_Event_EndPlayReason' has a wrong offset!");

// Function BP_DEPRECIATE_EnvironmentInteractionComponent.BP_DEPRECIATE_EnvironmentInteractionComponent_C.GetMainParticleSystem
// 0x0010 (0x0010 - 0x0000)
struct BP_DEPRECIATE_EnvironmentInteractionComponent_C_GetMainParticleSystem final
{
public:
	class UNiagaraComponent*                      NiagaraSystem;                                     // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_Array_Get_Item;                           // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DEPRECIATE_EnvironmentInteractionComponent_C_GetMainParticleSystem) == 0x000008, "Wrong alignment on BP_DEPRECIATE_EnvironmentInteractionComponent_C_GetMainParticleSystem");
static_assert(sizeof(BP_DEPRECIATE_EnvironmentInteractionComponent_C_GetMainParticleSystem) == 0x000010, "Wrong size on BP_DEPRECIATE_EnvironmentInteractionComponent_C_GetMainParticleSystem");
static_assert(offsetof(BP_DEPRECIATE_EnvironmentInteractionComponent_C_GetMainParticleSystem, NiagaraSystem) == 0x000000, "Member 'BP_DEPRECIATE_EnvironmentInteractionComponent_C_GetMainParticleSystem::NiagaraSystem' has a wrong offset!");
static_assert(offsetof(BP_DEPRECIATE_EnvironmentInteractionComponent_C_GetMainParticleSystem, CallFunc_Array_Get_Item) == 0x000008, "Member 'BP_DEPRECIATE_EnvironmentInteractionComponent_C_GetMainParticleSystem::CallFunc_Array_Get_Item' has a wrong offset!");

// Function BP_DEPRECIATE_EnvironmentInteractionComponent.BP_DEPRECIATE_EnvironmentInteractionComponent_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_DEPRECIATE_EnvironmentInteractionComponent_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DEPRECIATE_EnvironmentInteractionComponent_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_DEPRECIATE_EnvironmentInteractionComponent_C_ReceiveEndPlay");
static_assert(sizeof(BP_DEPRECIATE_EnvironmentInteractionComponent_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_DEPRECIATE_EnvironmentInteractionComponent_C_ReceiveEndPlay");
static_assert(offsetof(BP_DEPRECIATE_EnvironmentInteractionComponent_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_DEPRECIATE_EnvironmentInteractionComponent_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function BP_DEPRECIATE_EnvironmentInteractionComponent.BP_DEPRECIATE_EnvironmentInteractionComponent_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_DEPRECIATE_EnvironmentInteractionComponent_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DEPRECIATE_EnvironmentInteractionComponent_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_DEPRECIATE_EnvironmentInteractionComponent_C_ReceiveTick");
static_assert(sizeof(BP_DEPRECIATE_EnvironmentInteractionComponent_C_ReceiveTick) == 0x000004, "Wrong size on BP_DEPRECIATE_EnvironmentInteractionComponent_C_ReceiveTick");
static_assert(offsetof(BP_DEPRECIATE_EnvironmentInteractionComponent_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_DEPRECIATE_EnvironmentInteractionComponent_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

