#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DataAsset_Item_Consumable

#include "Basic.hpp"

#include "BP_DataAsset_Item_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_DataAsset_Item_Consumable.BP_DataAsset_Item_Consumable_C
// 0x0038 (0x0068 - 0x0030)
class UBP_DataAsset_Item_Consumable_C final : public UBP_DataAsset_Item_C
{
public:
	int32                                         MaxCharges;                                        // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftClassPtr<class UClass>                   BattleSkillScript;                                 // 0x0038(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class UBP_DataAsset_Skill_C*                  ItemSkillDefinition;                               // 0x0060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	class UBP_DataAsset_Skill_C* GetItemSkillDefinition();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_DataAsset_Item_Consumable_C">();
	}
	static class UBP_DataAsset_Item_Consumable_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_DataAsset_Item_Consumable_C>();
	}
};
static_assert(alignof(UBP_DataAsset_Item_Consumable_C) == 0x000008, "Wrong alignment on UBP_DataAsset_Item_Consumable_C");
static_assert(sizeof(UBP_DataAsset_Item_Consumable_C) == 0x000068, "Wrong size on UBP_DataAsset_Item_Consumable_C");
static_assert(offsetof(UBP_DataAsset_Item_Consumable_C, MaxCharges) == 0x000030, "Member 'UBP_DataAsset_Item_Consumable_C::MaxCharges' has a wrong offset!");
static_assert(offsetof(UBP_DataAsset_Item_Consumable_C, BattleSkillScript) == 0x000038, "Member 'UBP_DataAsset_Item_Consumable_C::BattleSkillScript' has a wrong offset!");
static_assert(offsetof(UBP_DataAsset_Item_Consumable_C, ItemSkillDefinition) == 0x000060, "Member 'UBP_DataAsset_Item_Consumable_C::ItemSkillDefinition' has a wrong offset!");

}

