#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DialogueCameraControllerComponent

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "E_NPC_SpolightTypes_structs.hpp"
#include "CinematicCamera_structs.hpp"


namespace SDK::Params
{

// Function BP_DialogueCameraControllerComponent.BP_DialogueCameraControllerComponent_C.GetAllCharacterLights
// 0x0078 (0x0078 - 0x0000)
struct BP_DialogueCameraControllerComponent_C_GetAllCharacterLights final
{
public:
	TScriptInterface<class IBPI_DialogueCharacter_C> DialogueCharacter;                              // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ULightComponent*>                Lights;                                            // 0x0010(0x0010)(Parm, OutParm, ContainsInstancedReference)
	TArray<class ULightComponent*>                local_lights;                                      // 0x0020(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	int32                                         Temp_int_Variable;                                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue_1;             // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42[0x6];                                       // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ULightComponent*                        CallFunc_BPI_GetLightingSet_FrontLight;            // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ULightComponent*                        CallFunc_BPI_GetLightingSet_RimLight;              // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetEnumeratorValueFromIndex_ReturnValue;  // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A[0x2];                                       // 0x005A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_MakeLiteralInt_ReturnValue;               // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue_1;            // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DialogueCameraControllerComponent_C_GetAllCharacterLights) == 0x000008, "Wrong alignment on BP_DialogueCameraControllerComponent_C_GetAllCharacterLights");
static_assert(sizeof(BP_DialogueCameraControllerComponent_C_GetAllCharacterLights) == 0x000078, "Wrong size on BP_DialogueCameraControllerComponent_C_GetAllCharacterLights");
static_assert(offsetof(BP_DialogueCameraControllerComponent_C_GetAllCharacterLights, DialogueCharacter) == 0x000000, "Member 'BP_DialogueCameraControllerComponent_C_GetAllCharacterLights::DialogueCharacter' has a wrong offset!");
static_assert(offsetof(BP_DialogueCameraControllerComponent_C_GetAllCharacterLights, Lights) == 0x000010, "Member 'BP_DialogueCameraControllerComponent_C_GetAllCharacterLights::Lights' has a wrong offset!");
static_assert(offsetof(BP_DialogueCameraControllerComponent_C_GetAllCharacterLights, local_lights) == 0x000020, "Member 'BP_DialogueCameraControllerComponent_C_GetAllCharacterLights::local_lights' has a wrong offset!");
static_assert(offsetof(BP_DialogueCameraControllerComponent_C_GetAllCharacterLights, Temp_int_Variable) == 0x000030, "Member 'BP_DialogueCameraControllerComponent_C_GetAllCharacterLights::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_DialogueCameraControllerComponent_C_GetAllCharacterLights, Temp_int_Variable_1) == 0x000034, "Member 'BP_DialogueCameraControllerComponent_C_GetAllCharacterLights::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_DialogueCameraControllerComponent_C_GetAllCharacterLights, CallFunc_Conv_IntToByte_ReturnValue) == 0x000038, "Member 'BP_DialogueCameraControllerComponent_C_GetAllCharacterLights::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DialogueCameraControllerComponent_C_GetAllCharacterLights, CallFunc_Add_IntInt_ReturnValue) == 0x00003C, "Member 'BP_DialogueCameraControllerComponent_C_GetAllCharacterLights::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DialogueCameraControllerComponent_C_GetAllCharacterLights, CallFunc_GetValidValue_ReturnValue) == 0x000040, "Member 'BP_DialogueCameraControllerComponent_C_GetAllCharacterLights::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DialogueCameraControllerComponent_C_GetAllCharacterLights, CallFunc_Conv_IntToByte_ReturnValue_1) == 0x000041, "Member 'BP_DialogueCameraControllerComponent_C_GetAllCharacterLights::CallFunc_Conv_IntToByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DialogueCameraControllerComponent_C_GetAllCharacterLights, CallFunc_BPI_GetLightingSet_FrontLight) == 0x000048, "Member 'BP_DialogueCameraControllerComponent_C_GetAllCharacterLights::CallFunc_BPI_GetLightingSet_FrontLight' has a wrong offset!");
static_assert(offsetof(BP_DialogueCameraControllerComponent_C_GetAllCharacterLights, CallFunc_BPI_GetLightingSet_RimLight) == 0x000050, "Member 'BP_DialogueCameraControllerComponent_C_GetAllCharacterLights::CallFunc_BPI_GetLightingSet_RimLight' has a wrong offset!");
static_assert(offsetof(BP_DialogueCameraControllerComponent_C_GetAllCharacterLights, CallFunc_GetEnumeratorValueFromIndex_ReturnValue) == 0x000058, "Member 'BP_DialogueCameraControllerComponent_C_GetAllCharacterLights::CallFunc_GetEnumeratorValueFromIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DialogueCameraControllerComponent_C_GetAllCharacterLights, CallFunc_IsValid_ReturnValue) == 0x000059, "Member 'BP_DialogueCameraControllerComponent_C_GetAllCharacterLights::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DialogueCameraControllerComponent_C_GetAllCharacterLights, CallFunc_Conv_ByteToInt_ReturnValue) == 0x00005C, "Member 'BP_DialogueCameraControllerComponent_C_GetAllCharacterLights::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DialogueCameraControllerComponent_C_GetAllCharacterLights, CallFunc_IsValid_ReturnValue_1) == 0x000060, "Member 'BP_DialogueCameraControllerComponent_C_GetAllCharacterLights::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DialogueCameraControllerComponent_C_GetAllCharacterLights, CallFunc_MakeLiteralInt_ReturnValue) == 0x000064, "Member 'BP_DialogueCameraControllerComponent_C_GetAllCharacterLights::CallFunc_MakeLiteralInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DialogueCameraControllerComponent_C_GetAllCharacterLights, CallFunc_Less_IntInt_ReturnValue) == 0x000068, "Member 'BP_DialogueCameraControllerComponent_C_GetAllCharacterLights::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DialogueCameraControllerComponent_C_GetAllCharacterLights, CallFunc_Array_AddUnique_ReturnValue) == 0x00006C, "Member 'BP_DialogueCameraControllerComponent_C_GetAllCharacterLights::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DialogueCameraControllerComponent_C_GetAllCharacterLights, CallFunc_Array_AddUnique_ReturnValue_1) == 0x000070, "Member 'BP_DialogueCameraControllerComponent_C_GetAllCharacterLights::CallFunc_Array_AddUnique_ReturnValue_1' has a wrong offset!");

// Function BP_DialogueCameraControllerComponent.BP_DialogueCameraControllerComponent_C.DefineDialogueCamerasSide
// 0x0038 (0x0038 - 0x0000)
struct BP_DialogueCameraControllerComponent_C_DefineDialogueCamerasSide final
{
public:
	bool                                          CallFunc_BPI_ShouldMoveCameraPresetsToOtherSide_ReturnValue; // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_DialogueCharacter_C> CallFunc_BPI_GetInteractingCharacter_ReturnValue; // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_Conv_InterfaceToObject_ReturnValue;       // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_DynamicCast_AsActor;                        // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_DialogueCameraControllerComponent_C* CallFunc_GetComponentByClass_ReturnValue;         // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DialogueCameraControllerComponent_C_DefineDialogueCamerasSide) == 0x000008, "Wrong alignment on BP_DialogueCameraControllerComponent_C_DefineDialogueCamerasSide");
static_assert(sizeof(BP_DialogueCameraControllerComponent_C_DefineDialogueCamerasSide) == 0x000038, "Wrong size on BP_DialogueCameraControllerComponent_C_DefineDialogueCamerasSide");
static_assert(offsetof(BP_DialogueCameraControllerComponent_C_DefineDialogueCamerasSide, CallFunc_BPI_ShouldMoveCameraPresetsToOtherSide_ReturnValue) == 0x000000, "Member 'BP_DialogueCameraControllerComponent_C_DefineDialogueCamerasSide::CallFunc_BPI_ShouldMoveCameraPresetsToOtherSide_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DialogueCameraControllerComponent_C_DefineDialogueCamerasSide, CallFunc_BPI_GetInteractingCharacter_ReturnValue) == 0x000008, "Member 'BP_DialogueCameraControllerComponent_C_DefineDialogueCamerasSide::CallFunc_BPI_GetInteractingCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DialogueCameraControllerComponent_C_DefineDialogueCamerasSide, CallFunc_Conv_InterfaceToObject_ReturnValue) == 0x000018, "Member 'BP_DialogueCameraControllerComponent_C_DefineDialogueCamerasSide::CallFunc_Conv_InterfaceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DialogueCameraControllerComponent_C_DefineDialogueCamerasSide, K2Node_DynamicCast_AsActor) == 0x000020, "Member 'BP_DialogueCameraControllerComponent_C_DefineDialogueCamerasSide::K2Node_DynamicCast_AsActor' has a wrong offset!");
static_assert(offsetof(BP_DialogueCameraControllerComponent_C_DefineDialogueCamerasSide, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BP_DialogueCameraControllerComponent_C_DefineDialogueCamerasSide::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_DialogueCameraControllerComponent_C_DefineDialogueCamerasSide, CallFunc_GetComponentByClass_ReturnValue) == 0x000030, "Member 'BP_DialogueCameraControllerComponent_C_DefineDialogueCamerasSide::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");

// Function BP_DialogueCameraControllerComponent.BP_DialogueCameraControllerComponent_C.ForceCheckSpotlightsOff
// 0x0038 (0x0038 - 0x0000)
struct BP_DialogueCameraControllerComponent_C_ForceCheckSpotlightsOff final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ULightComponent*>                CallFunc_GetAllCharacterLights_Lights;             // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULightComponent*                        CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DialogueCameraControllerComponent_C_ForceCheckSpotlightsOff) == 0x000008, "Wrong alignment on BP_DialogueCameraControllerComponent_C_ForceCheckSpotlightsOff");
static_assert(sizeof(BP_DialogueCameraControllerComponent_C_ForceCheckSpotlightsOff) == 0x000038, "Wrong size on BP_DialogueCameraControllerComponent_C_ForceCheckSpotlightsOff");
static_assert(offsetof(BP_DialogueCameraControllerComponent_C_ForceCheckSpotlightsOff, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BP_DialogueCameraControllerComponent_C_ForceCheckSpotlightsOff::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_DialogueCameraControllerComponent_C_ForceCheckSpotlightsOff, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_DialogueCameraControllerComponent_C_ForceCheckSpotlightsOff::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_DialogueCameraControllerComponent_C_ForceCheckSpotlightsOff, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_DialogueCameraControllerComponent_C_ForceCheckSpotlightsOff::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DialogueCameraControllerComponent_C_ForceCheckSpotlightsOff, CallFunc_GetAllCharacterLights_Lights) == 0x000010, "Member 'BP_DialogueCameraControllerComponent_C_ForceCheckSpotlightsOff::CallFunc_GetAllCharacterLights_Lights' has a wrong offset!");
static_assert(offsetof(BP_DialogueCameraControllerComponent_C_ForceCheckSpotlightsOff, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'BP_DialogueCameraControllerComponent_C_ForceCheckSpotlightsOff::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DialogueCameraControllerComponent_C_ForceCheckSpotlightsOff, CallFunc_Array_Get_Item) == 0x000028, "Member 'BP_DialogueCameraControllerComponent_C_ForceCheckSpotlightsOff::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_DialogueCameraControllerComponent_C_ForceCheckSpotlightsOff, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'BP_DialogueCameraControllerComponent_C_ForceCheckSpotlightsOff::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function BP_DialogueCameraControllerComponent.BP_DialogueCameraControllerComponent_C.CopyLightValuesToCharacterWorld
// 0x0020 (0x0020 - 0x0000)
struct BP_DialogueCameraControllerComponent_C_CopyLightValuesToCharacterWorld final
{
public:
	class ULightComponent*                        TargetLight;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ULightComponent*                        ReferenceLight;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetLightColor_ReturnValue;                // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DialogueCameraControllerComponent_C_CopyLightValuesToCharacterWorld) == 0x000008, "Wrong alignment on BP_DialogueCameraControllerComponent_C_CopyLightValuesToCharacterWorld");
static_assert(sizeof(BP_DialogueCameraControllerComponent_C_CopyLightValuesToCharacterWorld) == 0x000020, "Wrong size on BP_DialogueCameraControllerComponent_C_CopyLightValuesToCharacterWorld");
static_assert(offsetof(BP_DialogueCameraControllerComponent_C_CopyLightValuesToCharacterWorld, TargetLight) == 0x000000, "Member 'BP_DialogueCameraControllerComponent_C_CopyLightValuesToCharacterWorld::TargetLight' has a wrong offset!");
static_assert(offsetof(BP_DialogueCameraControllerComponent_C_CopyLightValuesToCharacterWorld, ReferenceLight) == 0x000008, "Member 'BP_DialogueCameraControllerComponent_C_CopyLightValuesToCharacterWorld::ReferenceLight' has a wrong offset!");
static_assert(offsetof(BP_DialogueCameraControllerComponent_C_CopyLightValuesToCharacterWorld, CallFunc_GetLightColor_ReturnValue) == 0x000010, "Member 'BP_DialogueCameraControllerComponent_C_CopyLightValuesToCharacterWorld::CallFunc_GetLightColor_ReturnValue' has a wrong offset!");

// Function BP_DialogueCameraControllerComponent.BP_DialogueCameraControllerComponent_C.TurnOnDialogueSpotlights
// 0x0208 (0x0208 - 0x0000)
struct BP_DialogueCameraControllerComponent_C_TurnOnDialogueSpotlights final
{
public:
	bool                                          TurnOn;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ULightComponent*>                local_lightsToRemove;                              // 0x0008(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	class ULightComponent*                        local_rimLight;                                    // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ULightComponent*                        local_frontLight;                                  // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          SpotlightsOn;                                      // 0x0028(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_NPC_SpolightTypes                           Temp_byte_Variable;                                // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0060(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00A8(0x0010)(ReferenceParm)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Format_ReturnValue;                       // 0x00C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetDialogueSystemComponent_DialogueSystem; // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_GetAllSpeakerActors_ReturnValue;          // 0x00D8(0x0010)(ReferenceParm)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BPI_HasLightingAuthority_ReturnValue;     // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_DialogueCharacter_C> K2Node_DynamicCast_AsBPI_Dialogue_Character;    // 0x00F8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoesImplementInterface_ReturnValue;       // 0x010A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10B[0x1];                                      // 0x010B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULightComponent*                        CallFunc_Array_Get_Item_1;                         // 0x0118(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0124(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_125[0x3];                                      // 0x0125(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12C[0x4];                                      // 0x012C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_DialogueCharacter_C> CallFunc_BPI_GetReverseSpotlightReceiver_ReturnValue; // 0x0130(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<TScriptInterface<class IBPI_DialogueCharacter_C>> K2Node_MakeArray_Array_1;               // 0x0140(0x0010)(ReferenceParm)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_DialogueCharacter_C> CallFunc_Array_Get_Item_2;                      // 0x0158(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_Conv_InterfaceToObject_ReturnValue;       // 0x0168(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class ULightComponent*>                CallFunc_GetAllCharacterLights_Lights;             // 0x0170(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_181[0x3];                                      // 0x0181(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x018C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_NPC_SpolightTypes                           Temp_byte_Variable_1;                              // 0x018D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_NPC_SpolightTypes                           Temp_byte_Variable_2;                              // 0x018E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_NPC_SpolightTypes                           CallFunc_BPI_GetLightDirection_ReturnValue;        // 0x018F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0191(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_192[0x6];                                      // 0x0192(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ULightComponent*                        CallFunc_BPI_GetLightingSet_FrontLight;            // 0x0198(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ULightComponent*                        CallFunc_BPI_GetLightingSet_RimLight;              // 0x01A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	E_NPC_SpolightTypes                           Temp_byte_Variable_3;                              // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_NPC_SpolightTypes                           K2Node_Select_Default;                             // 0x01A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1AA[0x6];                                      // 0x01AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class ASpotLight>              CallFunc_Array_Get_Item_3;                         // 0x01B0(0x0028)(HasGetValueTypeHash)
	class ULightComponent*                        CallFunc_BPI_GetLightingSet_FrontLight_1;          // 0x01D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ULightComponent*                        CallFunc_BPI_GetLightingSet_RimLight_1;            // 0x01E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x01E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASpotLight*                             K2Node_DynamicCast_AsSpot_Light;                   // 0x01F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x01F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x01FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x01FB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x01FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsNotEmpty_ReturnValue;             // 0x0201(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DialogueCameraControllerComponent_C_TurnOnDialogueSpotlights) == 0x000008, "Wrong alignment on BP_DialogueCameraControllerComponent_C_TurnOnDialogueSpotlights");
static_assert(sizeof(BP_DialogueCameraControllerComponent_C_TurnOnDialogueSpotlights) == 0x000208, "Wrong size on BP_DialogueCameraControllerComponent_C_TurnOnDialogueSpotlights");
static_assert(offsetof(BP_DialogueCameraControllerComponent_C_TurnOnDialogueSpotlights, TurnOn) == 0x000000, "Member 'BP_DialogueCameraControllerComponent_C_TurnOnDialogueSpotlights::TurnOn' has a wrong offset!");
static_assert(offsetof(BP_DialogueCameraControllerComponent_C_TurnOnDialogueSpotlights, local_lightsToRemove) == 0x000008, "Member 'BP_DialogueCameraControllerComponent_C_TurnOnDialogueSpotlights::local_lightsToRemove' has a wrong offset!");
static_assert(offsetof(BP_DialogueCameraControllerComponent_C_TurnOnDialogueSpotlights, local_rimLight) == 0x000018, "Member 'BP_DialogueCameraControllerComponent_C_TurnOnDialogueSpotlights::local_rimLight' has a wrong offset!");
static_assert(offsetof(BP_DialogueCameraControllerComponent_C_TurnOnDialogueSpotlights, local_frontLight) == 0x000020, "Member 'BP_DialogueCameraControllerComponent_C_TurnOnDialogueSpotlights::local_frontLight' has a wrong offset!");
static_assert(offsetof(BP_DialogueCameraControllerComponent_C_TurnOnDialogueSpotlights, SpotlightsOn) == 0x000028, "Member 'BP_DialogueCameraControllerComponent_C_TurnOnDialogueSpotlights::SpotlightsOn' has a wrong offset!");
static_assert(offsetof(BP_DialogueCameraControllerComponent_C_TurnOnDialogueSpotlights, Temp_int_Array_Index_Variable) == 0x00002C, "Member 'BP_DialogueCameraControllerComponent_C_TurnOnDialogueSpotlights::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_DialogueCameraControllerComponent_C_TurnOnDialogueSpotlights, Temp_int_Loop_Counter_Variable) == 0x000030, "Member 'BP_DialogueCameraControllerComponent_C_TurnOnDialogueSpotlights::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_DialogueCameraControllerComponent_C_TurnOnDialogueSpotlights, CallFunc_Add_IntInt_ReturnValue) == 0x000034, "Member 'BP_DialogueCameraControllerComponent_C_TurnOnDialogueSpotlights::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DialogueCameraControllerComponent_C_TurnOnDialogueSpotlights, Temp_int_Array_Index_Variable_1) == 0x000038, "Member 'BP_DialogueCameraControllerComponent_C_TurnOnDialogueSpotlights::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_DialogueCameraControllerComponent_C_TurnOnDialogueSpotlights, Temp_int_Array_Index_Variable_2) == 0x00003C, "Member 'BP_DialogueCameraControllerComponent_C_TurnOnDialogueSpotlights::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_DialogueCameraControllerComponent_C_TurnOnDialogueSpotlights, Temp_int_Loop_Counter_Variable_1) == 0x000040, "Member 'BP_DialogueCameraControllerComponent_C_TurnOnDialogueSpotlights::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_DialogueCameraControllerComponent_C_TurnOnDialogueSpotlights, CallFunc_Add_IntInt_ReturnValue_1) == 0x000044, "Member 'BP_DialogueCameraControllerComponent_C_TurnOnDialogueSpotlights::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DialogueCameraControllerComponent_C_TurnOnDialogueSpotlights, Temp_int_Loop_Counter_Variable_2) == 0x000048, "Member 'BP_DialogueCameraControllerComponent_C_TurnOnDialogueSpotlights::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_DialogueCameraControllerComponent_C_TurnOnDialogueSpotlights, CallFunc_Add_IntInt_ReturnValue_2) == 0x00004C, "Member 'BP_DialogueCameraControllerComponent_C_TurnOnDialogueSpotlights::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_DialogueCameraControllerComponent_C_TurnOnDialogueSpotlights, Temp_int_Array_Index_Variable_3) == 0x000050, "Member 'BP_DialogueCameraControllerComponent_C_TurnOnDialogueSpotlights::Temp_int_Array_Index_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_DialogueCameraControllerComponent_C_TurnOnDialogueSpotlights, Temp_byte_Variable) == 0x000054, "Member 'BP_DialogueCameraControllerComponent_C_TurnOnDialogueSpotlights::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_DialogueCameraControllerComponent_C_TurnOnDialogueSpotlights, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000058, "Member 'BP_DialogueCameraControllerComponent_C_TurnOnDialogueSpotlights::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DialogueCameraControllerComponent_C_TurnOnDialogueSpotlights, K2Node_MakeStruct_FormatArgumentData) == 0x000060, "Member 'BP_DialogueCameraControllerComponent_C_TurnOnDialogueSpotlights::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_DialogueCameraControllerComponent_C_TurnOnDialogueSpotlights, K2Node_MakeArray_Array) == 0x0000A8, "Member 'BP_DialogueCameraControllerComponent_C_TurnOnDialogueSpotlights::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_DialogueCameraControllerComponent_C_TurnOnDialogueSpotlights, CallFunc_GetOwner_ReturnValue) == 0x0000B8, "Member 'BP_DialogueCameraControllerComponent_C_TurnOnDialogueSpotlights::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DialogueCameraControllerComponent_C_TurnOnDialogueSpotlights, CallFunc_Format_ReturnValue) == 0x0000C0, "Member 'BP_DialogueCameraControllerComponent_C_TurnOnDialogueSpotlights::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DialogueCameraControllerComponent_C_TurnOnDialogueSpotlights, CallFunc_GetDialogueSystemComponent_DialogueSystem) == 0x0000D0, "Member 'BP_DialogueCameraControllerComponent_C_TurnOnDialogueSpotlights::CallFunc_GetDialogueSystemComponent_DialogueSystem' has a wrong offset!");
static_assert(offsetof(BP_DialogueCameraControllerComponent_C_TurnOnDialogueSpotlights, CallFunc_GetAllSpeakerActors_ReturnValue) == 0x0000D8, "Member 'BP_DialogueCameraControllerComponent_C_TurnOnDialogueSpotlights::CallFunc_GetAllSpeakerActors_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DialogueCameraControllerComponent_C_TurnOnDialogueSpotlights, CallFunc_Array_Get_Item) == 0x0000E8, "Member 'BP_DialogueCameraControllerComponent_C_TurnOnDialogueSpotlights::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_DialogueCameraControllerComponent_C_TurnOnDialogueSpotlights, CallFunc_BPI_HasLightingAuthority_ReturnValue) == 0x0000F0, "Member 'BP_DialogueCameraControllerComponent_C_TurnOnDialogueSpotlights::CallFunc_BPI_HasLightingAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DialogueCameraControllerComponent_C_TurnOnDialogueSpotlights, K2Node_DynamicCast_AsBPI_Dialogue_Character) == 0x0000F8, "Member 'BP_DialogueCameraControllerComponent_C_TurnOnDialogueSpotlights::K2Node_DynamicCast_AsBPI_Dialogue_Character' has a wrong offset!");
static_assert(offsetof(BP_DialogueCameraControllerComponent_C_TurnOnDialogueSpotlights, K2Node_DynamicCast_bSuccess) == 0x000108, "Member 'BP_DialogueCameraControllerComponent_C_TurnOnDialogueSpotlights::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_DialogueCameraControllerComponent_C_TurnOnDialogueSpotlights, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000109, "Member 'BP_DialogueCameraControllerComponent_C_TurnOnDialogueSpotlights::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DialogueCameraControllerComponent_C_TurnOnDialogueSpotlights, CallFunc_DoesImplementInterface_ReturnValue) == 0x00010A, "Member 'BP_DialogueCameraControllerComponent_C_TurnOnDialogueSpotlights::CallFunc_DoesImplementInterface_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DialogueCameraControllerComponent_C_TurnOnDialogueSpotlights, CallFunc_Array_Length_ReturnValue) == 0x00010C, "Member 'BP_DialogueCameraControllerComponent_C_TurnOnDialogueSpotlights::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DialogueCameraControllerComponent_C_TurnOnDialogueSpotlights, CallFunc_BooleanAND_ReturnValue) == 0x000110, "Member 'BP_DialogueCameraControllerComponent_C_TurnOnDialogueSpotlights::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DialogueCameraControllerComponent_C_TurnOnDialogueSpotlights, CallFunc_Array_Get_Item_1) == 0x000118, "Member 'BP_DialogueCameraControllerComponent_C_TurnOnDialogueSpotlights::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_DialogueCameraControllerComponent_C_TurnOnDialogueSpotlights, CallFunc_Array_Length_ReturnValue_1) == 0x000120, "Member 'BP_DialogueCameraControllerComponent_C_TurnOnDialogueSpotlights::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DialogueCameraControllerComponent_C_TurnOnDialogueSpotlights, CallFunc_Less_IntInt_ReturnValue) == 0x000124, "Member 'BP_DialogueCameraControllerComponent_C_TurnOnDialogueSpotlights::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DialogueCameraControllerComponent_C_TurnOnDialogueSpotlights, Temp_int_Loop_Counter_Variable_3) == 0x000128, "Member 'BP_DialogueCameraControllerComponent_C_TurnOnDialogueSpotlights::Temp_int_Loop_Counter_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_DialogueCameraControllerComponent_C_TurnOnDialogueSpotlights, CallFunc_BPI_GetReverseSpotlightReceiver_ReturnValue) == 0x000130, "Member 'BP_DialogueCameraControllerComponent_C_TurnOnDialogueSpotlights::CallFunc_BPI_GetReverseSpotlightReceiver_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DialogueCameraControllerComponent_C_TurnOnDialogueSpotlights, K2Node_MakeArray_Array_1) == 0x000140, "Member 'BP_DialogueCameraControllerComponent_C_TurnOnDialogueSpotlights::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BP_DialogueCameraControllerComponent_C_TurnOnDialogueSpotlights, CallFunc_Less_IntInt_ReturnValue_1) == 0x000150, "Member 'BP_DialogueCameraControllerComponent_C_TurnOnDialogueSpotlights::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DialogueCameraControllerComponent_C_TurnOnDialogueSpotlights, CallFunc_Array_Get_Item_2) == 0x000158, "Member 'BP_DialogueCameraControllerComponent_C_TurnOnDialogueSpotlights::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(BP_DialogueCameraControllerComponent_C_TurnOnDialogueSpotlights, CallFunc_Conv_InterfaceToObject_ReturnValue) == 0x000168, "Member 'BP_DialogueCameraControllerComponent_C_TurnOnDialogueSpotlights::CallFunc_Conv_InterfaceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DialogueCameraControllerComponent_C_TurnOnDialogueSpotlights, CallFunc_GetAllCharacterLights_Lights) == 0x000170, "Member 'BP_DialogueCameraControllerComponent_C_TurnOnDialogueSpotlights::CallFunc_GetAllCharacterLights_Lights' has a wrong offset!");
static_assert(offsetof(BP_DialogueCameraControllerComponent_C_TurnOnDialogueSpotlights, CallFunc_IsValid_ReturnValue) == 0x000180, "Member 'BP_DialogueCameraControllerComponent_C_TurnOnDialogueSpotlights::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DialogueCameraControllerComponent_C_TurnOnDialogueSpotlights, CallFunc_Array_Length_ReturnValue_2) == 0x000184, "Member 'BP_DialogueCameraControllerComponent_C_TurnOnDialogueSpotlights::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_DialogueCameraControllerComponent_C_TurnOnDialogueSpotlights, CallFunc_Add_IntInt_ReturnValue_3) == 0x000188, "Member 'BP_DialogueCameraControllerComponent_C_TurnOnDialogueSpotlights::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_DialogueCameraControllerComponent_C_TurnOnDialogueSpotlights, CallFunc_Less_IntInt_ReturnValue_2) == 0x00018C, "Member 'BP_DialogueCameraControllerComponent_C_TurnOnDialogueSpotlights::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_DialogueCameraControllerComponent_C_TurnOnDialogueSpotlights, Temp_byte_Variable_1) == 0x00018D, "Member 'BP_DialogueCameraControllerComponent_C_TurnOnDialogueSpotlights::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_DialogueCameraControllerComponent_C_TurnOnDialogueSpotlights, Temp_byte_Variable_2) == 0x00018E, "Member 'BP_DialogueCameraControllerComponent_C_TurnOnDialogueSpotlights::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_DialogueCameraControllerComponent_C_TurnOnDialogueSpotlights, CallFunc_BPI_GetLightDirection_ReturnValue) == 0x00018F, "Member 'BP_DialogueCameraControllerComponent_C_TurnOnDialogueSpotlights::CallFunc_BPI_GetLightDirection_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DialogueCameraControllerComponent_C_TurnOnDialogueSpotlights, CallFunc_Not_PreBool_ReturnValue) == 0x000190, "Member 'BP_DialogueCameraControllerComponent_C_TurnOnDialogueSpotlights::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DialogueCameraControllerComponent_C_TurnOnDialogueSpotlights, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000191, "Member 'BP_DialogueCameraControllerComponent_C_TurnOnDialogueSpotlights::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DialogueCameraControllerComponent_C_TurnOnDialogueSpotlights, CallFunc_BPI_GetLightingSet_FrontLight) == 0x000198, "Member 'BP_DialogueCameraControllerComponent_C_TurnOnDialogueSpotlights::CallFunc_BPI_GetLightingSet_FrontLight' has a wrong offset!");
static_assert(offsetof(BP_DialogueCameraControllerComponent_C_TurnOnDialogueSpotlights, CallFunc_BPI_GetLightingSet_RimLight) == 0x0001A0, "Member 'BP_DialogueCameraControllerComponent_C_TurnOnDialogueSpotlights::CallFunc_BPI_GetLightingSet_RimLight' has a wrong offset!");
static_assert(offsetof(BP_DialogueCameraControllerComponent_C_TurnOnDialogueSpotlights, Temp_byte_Variable_3) == 0x0001A8, "Member 'BP_DialogueCameraControllerComponent_C_TurnOnDialogueSpotlights::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_DialogueCameraControllerComponent_C_TurnOnDialogueSpotlights, K2Node_Select_Default) == 0x0001A9, "Member 'BP_DialogueCameraControllerComponent_C_TurnOnDialogueSpotlights::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_DialogueCameraControllerComponent_C_TurnOnDialogueSpotlights, CallFunc_Array_Get_Item_3) == 0x0001B0, "Member 'BP_DialogueCameraControllerComponent_C_TurnOnDialogueSpotlights::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(BP_DialogueCameraControllerComponent_C_TurnOnDialogueSpotlights, CallFunc_BPI_GetLightingSet_FrontLight_1) == 0x0001D8, "Member 'BP_DialogueCameraControllerComponent_C_TurnOnDialogueSpotlights::CallFunc_BPI_GetLightingSet_FrontLight_1' has a wrong offset!");
static_assert(offsetof(BP_DialogueCameraControllerComponent_C_TurnOnDialogueSpotlights, CallFunc_BPI_GetLightingSet_RimLight_1) == 0x0001E0, "Member 'BP_DialogueCameraControllerComponent_C_TurnOnDialogueSpotlights::CallFunc_BPI_GetLightingSet_RimLight_1' has a wrong offset!");
static_assert(offsetof(BP_DialogueCameraControllerComponent_C_TurnOnDialogueSpotlights, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue) == 0x0001E8, "Member 'BP_DialogueCameraControllerComponent_C_TurnOnDialogueSpotlights::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DialogueCameraControllerComponent_C_TurnOnDialogueSpotlights, K2Node_DynamicCast_AsSpot_Light) == 0x0001F0, "Member 'BP_DialogueCameraControllerComponent_C_TurnOnDialogueSpotlights::K2Node_DynamicCast_AsSpot_Light' has a wrong offset!");
static_assert(offsetof(BP_DialogueCameraControllerComponent_C_TurnOnDialogueSpotlights, K2Node_DynamicCast_bSuccess_1) == 0x0001F8, "Member 'BP_DialogueCameraControllerComponent_C_TurnOnDialogueSpotlights::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_DialogueCameraControllerComponent_C_TurnOnDialogueSpotlights, CallFunc_IsValid_ReturnValue_1) == 0x0001F9, "Member 'BP_DialogueCameraControllerComponent_C_TurnOnDialogueSpotlights::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DialogueCameraControllerComponent_C_TurnOnDialogueSpotlights, CallFunc_IsValid_ReturnValue_2) == 0x0001FA, "Member 'BP_DialogueCameraControllerComponent_C_TurnOnDialogueSpotlights::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_DialogueCameraControllerComponent_C_TurnOnDialogueSpotlights, CallFunc_IsValid_ReturnValue_3) == 0x0001FB, "Member 'BP_DialogueCameraControllerComponent_C_TurnOnDialogueSpotlights::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_DialogueCameraControllerComponent_C_TurnOnDialogueSpotlights, CallFunc_Array_Length_ReturnValue_3) == 0x0001FC, "Member 'BP_DialogueCameraControllerComponent_C_TurnOnDialogueSpotlights::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_DialogueCameraControllerComponent_C_TurnOnDialogueSpotlights, CallFunc_Less_IntInt_ReturnValue_3) == 0x000200, "Member 'BP_DialogueCameraControllerComponent_C_TurnOnDialogueSpotlights::CallFunc_Less_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_DialogueCameraControllerComponent_C_TurnOnDialogueSpotlights, CallFunc_Array_IsNotEmpty_ReturnValue) == 0x000201, "Member 'BP_DialogueCameraControllerComponent_C_TurnOnDialogueSpotlights::CallFunc_Array_IsNotEmpty_ReturnValue' has a wrong offset!");

// Function BP_DialogueCameraControllerComponent.BP_DialogueCameraControllerComponent_C.ChangeAllDialogueCamerasSide
// 0x02C0 (0x02C0 - 0x0000)
struct BP_DialogueCameraControllerComponent_C_ChangeAllDialogueCamerasSide final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UCineCameraComponent*>           CallFunc_GetCameraList_DialogueCameraList;         // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UCineCameraComponent*                   CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_Map_Find_Value;                           // 0x0030(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_92[0x6];                                       // 0x0092(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0098(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x00B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x00C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector_X;                            // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0118(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0130(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_148[0x8];                                      // 0x0148(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0150(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeTransform_SweepHitResult;   // 0x01B0(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Yaw_ImplicitCast;             // 0x02B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DialogueCameraControllerComponent_C_ChangeAllDialogueCamerasSide) == 0x000010, "Wrong alignment on BP_DialogueCameraControllerComponent_C_ChangeAllDialogueCamerasSide");
static_assert(sizeof(BP_DialogueCameraControllerComponent_C_ChangeAllDialogueCamerasSide) == 0x0002C0, "Wrong size on BP_DialogueCameraControllerComponent_C_ChangeAllDialogueCamerasSide");
static_assert(offsetof(BP_DialogueCameraControllerComponent_C_ChangeAllDialogueCamerasSide, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BP_DialogueCameraControllerComponent_C_ChangeAllDialogueCamerasSide::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_DialogueCameraControllerComponent_C_ChangeAllDialogueCamerasSide, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_DialogueCameraControllerComponent_C_ChangeAllDialogueCamerasSide::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_DialogueCameraControllerComponent_C_ChangeAllDialogueCamerasSide, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_DialogueCameraControllerComponent_C_ChangeAllDialogueCamerasSide::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DialogueCameraControllerComponent_C_ChangeAllDialogueCamerasSide, CallFunc_GetCameraList_DialogueCameraList) == 0x000010, "Member 'BP_DialogueCameraControllerComponent_C_ChangeAllDialogueCamerasSide::CallFunc_GetCameraList_DialogueCameraList' has a wrong offset!");
static_assert(offsetof(BP_DialogueCameraControllerComponent_C_ChangeAllDialogueCamerasSide, CallFunc_Array_Get_Item) == 0x000020, "Member 'BP_DialogueCameraControllerComponent_C_ChangeAllDialogueCamerasSide::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_DialogueCameraControllerComponent_C_ChangeAllDialogueCamerasSide, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'BP_DialogueCameraControllerComponent_C_ChangeAllDialogueCamerasSide::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DialogueCameraControllerComponent_C_ChangeAllDialogueCamerasSide, CallFunc_Map_Find_Value) == 0x000030, "Member 'BP_DialogueCameraControllerComponent_C_ChangeAllDialogueCamerasSide::CallFunc_Map_Find_Value' has a wrong offset!");
