#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DataAsset_CharacterBattleAudioProfile

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_DataAsset_CharacterBattleAudioProfile.BP_DataAsset_CharacterBattleAudioProfile_C.GetCharacterBaseHitSound
// 0x0008 (0x0008 - 0x0000)
struct BP_DataAsset_CharacterBattleAudioProfile_C_GetCharacterBaseHitSound final
{
public:
	class UBP_DataAsset_BattleHitSound_C*         DefaultHitSound;                                   // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DataAsset_CharacterBattleAudioProfile_C_GetCharacterBaseHitSound) == 0x000008, "Wrong alignment on BP_DataAsset_CharacterBattleAudioProfile_C_GetCharacterBaseHitSound");
static_assert(sizeof(BP_DataAsset_CharacterBattleAudioProfile_C_GetCharacterBaseHitSound) == 0x000008, "Wrong size on BP_DataAsset_CharacterBattleAudioProfile_C_GetCharacterBaseHitSound");
static_assert(offsetof(BP_DataAsset_CharacterBattleAudioProfile_C_GetCharacterBaseHitSound, DefaultHitSound) == 0x000000, "Member 'BP_DataAsset_CharacterBattleAudioProfile_C_GetCharacterBaseHitSound::DefaultHitSound' has a wrong offset!");

// Function BP_DataAsset_CharacterBattleAudioProfile.BP_DataAsset_CharacterBattleAudioProfile_C.GetCharacterBattleLinesClass
// 0x0028 (0x0028 - 0x0000)
struct BP_DataAsset_CharacterBattleAudioProfile_C_GetCharacterBattleLinesClass final
{
public:
	TSoftClassPtr<class UClass>                   CharacterBattleLineClass_0;                        // 0x0000(0x0028)(Parm, OutParm, HasGetValueTypeHash)
};
static_assert(alignof(BP_DataAsset_CharacterBattleAudioProfile_C_GetCharacterBattleLinesClass) == 0x000008, "Wrong alignment on BP_DataAsset_CharacterBattleAudioProfile_C_GetCharacterBattleLinesClass");
static_assert(sizeof(BP_DataAsset_CharacterBattleAudioProfile_C_GetCharacterBattleLinesClass) == 0x000028, "Wrong size on BP_DataAsset_CharacterBattleAudioProfile_C_GetCharacterBattleLinesClass");
static_assert(offsetof(BP_DataAsset_CharacterBattleAudioProfile_C_GetCharacterBattleLinesClass, CharacterBattleLineClass_0) == 0x000000, "Member 'BP_DataAsset_CharacterBattleAudioProfile_C_GetCharacterBattleLinesClass::CharacterBattleLineClass_0' has a wrong offset!");

}

