#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DataAsset_CharacterBattleAudioProfile

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "S_OnoSoundData_structs.hpp"
#include "FAudioCharacter_Battle_HitBy_BP_structs.hpp"
#include "FAudioCharacter_Battle_HitBy_AnimCommon_structs.hpp"
#include "FAudioCharacter_Battle_DeathCommon_structs.hpp"
#include "FAudioCharacter_Battle_UI_structs.hpp"
#include "FAudioBattleCommonSFX_structs.hpp"
#include "FAudioCharacter_Battle_DeathCommon_Bodyfall_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_DataAsset_CharacterBattleAudioProfile.BP_DataAsset_CharacterBattleAudioProfile_C
// 0x0170 (0x01A0 - 0x0030)
class UBP_DataAsset_CharacterBattleAudioProfile_C final : public UPrimaryDataAsset
{
public:
	struct FFAudioCharacter_Battle_UI             CharacterBattleUiType;                             // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FFAudioBattleCommonSFX                 Common_SFX;                                        // 0x0040(0x0058)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFAudioCharacter_Battle_HitBy_AnimCommon HitByCommon_AnimCall;                            // 0x0098(0x0040)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FFAudioCharacter_Battle_DeathCommon    DeathCommon_AnimCall;                              // 0x00D8(0x0020)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FFAudioCharacter_Battle_HitBy_BP       BattleHitBy_CallByBP;                              // 0x00F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UBP_DataAsset_Footsteps_C*              DA_Footsteps;                                      // 0x0108(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FFAudioCharacter_Battle_DeathCommon_Bodyfall DeathCommon_Bodyfall_AnimCall;               // 0x0110(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FS_OnoSoundData                        OnoSoundData;                                      // 0x0118(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class UBP_DataAsset_BattleHitSound_C*         CharacterBaseHitSound;                             // 0x0168(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          EventReactions_MatchingRule;                       // 0x0170(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Event_HitReceived_MatchingRule;                    // 0x0171(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_172[0x6];                                      // 0x0172(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftClassPtr<class UClass>                   CharacterBattleLineClass;                          // 0x0178(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void GetCharacterBaseHitSound(class UBP_DataAsset_BattleHitSound_C** DefaultHitSound);
	void GetCharacterBattleLinesClass(TSoftClassPtr<class UClass>* CharacterBattleLineClass_0);
	void NewFunction();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_DataAsset_CharacterBattleAudioProfile_C">();
	}
	static class UBP_DataAsset_CharacterBattleAudioProfile_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_DataAsset_CharacterBattleAudioProfile_C>();
	}
};
static_assert(alignof(UBP_DataAsset_CharacterBattleAudioProfile_C) == 0x000008, "Wrong alignment on UBP_DataAsset_CharacterBattleAudioProfile_C");
static_assert(sizeof(UBP_DataAsset_CharacterBattleAudioProfile_C) == 0x0001A0, "Wrong size on UBP_DataAsset_CharacterBattleAudioProfile_C");
static_assert(offsetof(UBP_DataAsset_CharacterBattleAudioProfile_C, CharacterBattleUiType) == 0x000030, "Member 'UBP_DataAsset_CharacterBattleAudioProfile_C::CharacterBattleUiType' has a wrong offset!");
static_assert(offsetof(UBP_DataAsset_CharacterBattleAudioProfile_C, Common_SFX) == 0x000040, "Member 'UBP_DataAsset_CharacterBattleAudioProfile_C::Common_SFX' has a wrong offset!");
static_assert(offsetof(UBP_DataAsset_CharacterBattleAudioProfile_C, HitByCommon_AnimCall) == 0x000098, "Member 'UBP_DataAsset_CharacterBattleAudioProfile_C::HitByCommon_AnimCall' has a wrong offset!");
static_assert(offsetof(UBP_DataAsset_CharacterBattleAudioProfile_C, DeathCommon_AnimCall) == 0x0000D8, "Member 'UBP_DataAsset_CharacterBattleAudioProfile_C::DeathCommon_AnimCall' has a wrong offset!");
static_assert(offsetof(UBP_DataAsset_CharacterBattleAudioProfile_C, BattleHitBy_CallByBP) == 0x0000F8, "Member 'UBP_DataAsset_CharacterBattleAudioProfile_C::BattleHitBy_CallByBP' has a wrong offset!");
static_assert(offsetof(UBP_DataAsset_CharacterBattleAudioProfile_C, DA_Footsteps) == 0x000108, "Member 'UBP_DataAsset_CharacterBattleAudioProfile_C::DA_Footsteps' has a wrong offset!");
static_assert(offsetof(UBP_DataAsset_CharacterBattleAudioProfile_C, DeathCommon_Bodyfall_AnimCall) == 0x000110, "Member 'UBP_DataAsset_CharacterBattleAudioProfile_C::DeathCommon_Bodyfall_AnimCall' has a wrong offset!");
static_assert(offsetof(UBP_DataAsset_CharacterBattleAudioProfile_C, OnoSoundData) == 0x000118, "Member 'UBP_DataAsset_CharacterBattleAudioProfile_C::OnoSoundData' has a wrong offset!");
static_assert(offsetof(UBP_DataAsset_CharacterBattleAudioProfile_C, CharacterBaseHitSound) == 0x000168, "Member 'UBP_DataAsset_CharacterBattleAudioProfile_C::CharacterBaseHitSound' has a wrong offset!");
static_assert(offsetof(UBP_DataAsset_CharacterBattleAudioProfile_C, EventReactions_MatchingRule) == 0x000170, "Member 'UBP_DataAsset_CharacterBattleAudioProfile_C::EventReactions_MatchingRule' has a wrong offset!");
static_assert(offsetof(UBP_DataAsset_CharacterBattleAudioProfile_C, Event_HitReceived_MatchingRule) == 0x000171, "Member 'UBP_DataAsset_CharacterBattleAudioProfile_C::Event_HitReceived_MatchingRule' has a wrong offset!");
static_assert(offsetof(UBP_DataAsset_CharacterBattleAudioProfile_C, CharacterBattleLineClass) == 0x000178, "Member 'UBP_DataAsset_CharacterBattleAudioProfile_C::CharacterBattleLineClass' has a wrong offset!");

}

