#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DataAsset_FullscreenNotification

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_DataAsset_FullscreenNotification.BP_DataAsset_FullscreenNotification_C.IsHandledByGameAction
// 0x0001 (0x0001 - 0x0000)
struct BP_DataAsset_FullscreenNotification_C_IsHandledByGameAction final
{
public:
	bool                                          bIsHandledByGameAction_0;                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DataAsset_FullscreenNotification_C_IsHandledByGameAction) == 0x000001, "Wrong alignment on BP_DataAsset_FullscreenNotification_C_IsHandledByGameAction");
static_assert(sizeof(BP_DataAsset_FullscreenNotification_C_IsHandledByGameAction) == 0x000001, "Wrong size on BP_DataAsset_FullscreenNotification_C_IsHandledByGameAction");
static_assert(offsetof(BP_DataAsset_FullscreenNotification_C_IsHandledByGameAction, bIsHandledByGameAction_0) == 0x000000, "Member 'BP_DataAsset_FullscreenNotification_C_IsHandledByGameAction::bIsHandledByGameAction_0' has a wrong offset!");

// Function BP_DataAsset_FullscreenNotification.BP_DataAsset_FullscreenNotification_C.GetDescriptionText
// 0x0010 (0x0010 - 0x0000)
struct BP_DataAsset_FullscreenNotification_C_GetDescriptionText final
{
public:
	class FText                                   DescriptionText_0;                                 // 0x0000(0x0010)(Parm, OutParm)
};
static_assert(alignof(BP_DataAsset_FullscreenNotification_C_GetDescriptionText) == 0x000008, "Wrong alignment on BP_DataAsset_FullscreenNotification_C_GetDescriptionText");
static_assert(sizeof(BP_DataAsset_FullscreenNotification_C_GetDescriptionText) == 0x000010, "Wrong size on BP_DataAsset_FullscreenNotification_C_GetDescriptionText");
static_assert(offsetof(BP_DataAsset_FullscreenNotification_C_GetDescriptionText, DescriptionText_0) == 0x000000, "Member 'BP_DataAsset_FullscreenNotification_C_GetDescriptionText::DescriptionText_0' has a wrong offset!");

// Function BP_DataAsset_FullscreenNotification.BP_DataAsset_FullscreenNotification_C.GetHeaderText
// 0x0010 (0x0010 - 0x0000)
struct BP_DataAsset_FullscreenNotification_C_GetHeaderText final
{
public:
	class FText                                   HeaderText_0;                                      // 0x0000(0x0010)(Parm, OutParm)
};
static_assert(alignof(BP_DataAsset_FullscreenNotification_C_GetHeaderText) == 0x000008, "Wrong alignment on BP_DataAsset_FullscreenNotification_C_GetHeaderText");
static_assert(sizeof(BP_DataAsset_FullscreenNotification_C_GetHeaderText) == 0x000010, "Wrong size on BP_DataAsset_FullscreenNotification_C_GetHeaderText");
static_assert(offsetof(BP_DataAsset_FullscreenNotification_C_GetHeaderText, HeaderText_0) == 0x000000, "Member 'BP_DataAsset_FullscreenNotification_C_GetHeaderText::HeaderText_0' has a wrong offset!");

// Function BP_DataAsset_FullscreenNotification.BP_DataAsset_FullscreenNotification_C.GetWidgetClass
// 0x0008 (0x0008 - 0x0000)
struct BP_DataAsset_FullscreenNotification_C_GetWidgetClass final
{
public:
	class UClass*                                 WidgetClass_0;                                     // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DataAsset_FullscreenNotification_C_GetWidgetClass) == 0x000008, "Wrong alignment on BP_DataAsset_FullscreenNotification_C_GetWidgetClass");
static_assert(sizeof(BP_DataAsset_FullscreenNotification_C_GetWidgetClass) == 0x000008, "Wrong size on BP_DataAsset_FullscreenNotification_C_GetWidgetClass");
static_assert(offsetof(BP_DataAsset_FullscreenNotification_C_GetWidgetClass, WidgetClass_0) == 0x000000, "Member 'BP_DataAsset_FullscreenNotification_C_GetWidgetClass::WidgetClass_0' has a wrong offset!");

}

