#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DataAsset_Item_CharacterFace

#include "Basic.hpp"

#include "S_CharacterCustomizationItemData_structs.hpp"


namespace SDK::Params
{

// Function BP_DataAsset_Item_CharacterFace.BP_DataAsset_Item_CharacterFace_C.OnRemovedFromInventory
// 0x0050 (0x0050 - 0x0000)
struct BP_DataAsset_Item_CharacterFace_C_OnRemovedFromInventory final
{
public:
	class UBP_jRPG_GI_Custom_C*                   GameInstance;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAC_jRPG_InventoryManager_C*            InventoryManager;                                  // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   ItemId;                                            // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_wildcard_Variable;                            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetFirstCustomizationItem_ItemName;       // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_CharacterData_C*                    CallFunc_GetCharacterByID_CharacterData;           // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasCharacterInCollectionByID_ReturnValue; // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetCharacterHardcodedNameFromUser_CharacterHardcodedName; // 0x0034(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_CharacterCustomizationItemData      K2Node_MakeStruct_S_CharacterCustomizationItemData; // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DataAsset_Item_CharacterFace_C_OnRemovedFromInventory) == 0x000008, "Wrong alignment on BP_DataAsset_Item_CharacterFace_C_OnRemovedFromInventory");
static_assert(sizeof(BP_DataAsset_Item_CharacterFace_C_OnRemovedFromInventory) == 0x000050, "Wrong size on BP_DataAsset_Item_CharacterFace_C_OnRemovedFromInventory");
static_assert(offsetof(BP_DataAsset_Item_CharacterFace_C_OnRemovedFromInventory, GameInstance) == 0x000000, "Member 'BP_DataAsset_Item_CharacterFace_C_OnRemovedFromInventory::GameInstance' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_Item_CharacterFace_C_OnRemovedFromInventory, InventoryManager) == 0x000008, "Member 'BP_DataAsset_Item_CharacterFace_C_OnRemovedFromInventory::InventoryManager' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_Item_CharacterFace_C_OnRemovedFromInventory, ItemId) == 0x000010, "Member 'BP_DataAsset_Item_CharacterFace_C_OnRemovedFromInventory::ItemId' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_Item_CharacterFace_C_OnRemovedFromInventory, Temp_wildcard_Variable) == 0x000018, "Member 'BP_DataAsset_Item_CharacterFace_C_OnRemovedFromInventory::Temp_wildcard_Variable' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_Item_CharacterFace_C_OnRemovedFromInventory, CallFunc_GetFirstCustomizationItem_ItemName) == 0x000020, "Member 'BP_DataAsset_Item_CharacterFace_C_OnRemovedFromInventory::CallFunc_GetFirstCustomizationItem_ItemName' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_Item_CharacterFace_C_OnRemovedFromInventory, CallFunc_GetCharacterByID_CharacterData) == 0x000028, "Member 'BP_DataAsset_Item_CharacterFace_C_OnRemovedFromInventory::CallFunc_GetCharacterByID_CharacterData' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_Item_CharacterFace_C_OnRemovedFromInventory, CallFunc_HasCharacterInCollectionByID_ReturnValue) == 0x000030, "Member 'BP_DataAsset_Item_CharacterFace_C_OnRemovedFromInventory::CallFunc_HasCharacterInCollectionByID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_Item_CharacterFace_C_OnRemovedFromInventory, CallFunc_GetCharacterHardcodedNameFromUser_CharacterHardcodedName) == 0x000034, "Member 'BP_DataAsset_Item_CharacterFace_C_OnRemovedFromInventory::CallFunc_GetCharacterHardcodedNameFromUser_CharacterHardcodedName' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_Item_CharacterFace_C_OnRemovedFromInventory, CallFunc_EqualEqual_NameName_ReturnValue) == 0x00003C, "Member 'BP_DataAsset_Item_CharacterFace_C_OnRemovedFromInventory::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_Item_CharacterFace_C_OnRemovedFromInventory, K2Node_MakeStruct_S_CharacterCustomizationItemData) == 0x000040, "Member 'BP_DataAsset_Item_CharacterFace_C_OnRemovedFromInventory::K2Node_MakeStruct_S_CharacterCustomizationItemData' has a wrong offset!");

// Function BP_DataAsset_Item_CharacterFace.BP_DataAsset_Item_CharacterFace_C.UpdateCharacterCustomization_Internal
// 0x0008 (0x0008 - 0x0000)
struct BP_DataAsset_Item_CharacterFace_C_UpdateCharacterCustomization_Internal final
{
public:
	class UBP_CharacterData_C*                    CharacterData;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DataAsset_Item_CharacterFace_C_UpdateCharacterCustomization_Internal) == 0x000008, "Wrong alignment on BP_DataAsset_Item_CharacterFace_C_UpdateCharacterCustomization_Internal");
static_assert(sizeof(BP_DataAsset_Item_CharacterFace_C_UpdateCharacterCustomization_Internal) == 0x000008, "Wrong size on BP_DataAsset_Item_CharacterFace_C_UpdateCharacterCustomization_Internal");
static_assert(offsetof(BP_DataAsset_Item_CharacterFace_C_UpdateCharacterCustomization_Internal, CharacterData) == 0x000000, "Member 'BP_DataAsset_Item_CharacterFace_C_UpdateCharacterCustomization_Internal::CharacterData' has a wrong offset!");

}

