#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DamageableLevelElement_Parent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_DamageableLevelElement_Parent.BP_DamageableLevelElement_Parent_C
// 0x0068 (0x02F8 - 0x0290)
class ABP_DamageableLevelElement_Parent_C : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   StaticMeshComponent;                               // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCustomNavModifierComponent*            CustomNavModifier;                                 // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_Destructible_SerializableComponent_C* BP_Destructible_SerializableComponent;           // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_Alpha_44D8ECF64DDDACB259F5D39083142F5C;   // 0x02B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline__Direction_44D8ECF64DDDACB259F5D39083142F5C; // 0x02BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2BD[0x3];                                      // 0x02BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline;                                          // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         RequiredDamageLevel;                               // 0x02C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsDestroyed;                                       // 0x02CC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2CD[0x3];                                      // 0x02CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             BreakSound;                                        // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(class ABP_DamageableLevelElement_Parent_C* DamageableElement)> OnDestructionCompleted; // 0x02D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UGeometryCollection*                    GeometryCollectionAsset;                           // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGeometryCollectionComponent*           SpawnedGeometryCollection;                         // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void Debug_ForceBreak();
	void ExecuteUbergraph_BP_DamageableLevelElement_Parent(int32 EntryPoint);
	void ExplorationAttacked(class ABP_jRPG_Character_World_C* PlayerCharacter, const struct FVector& ImpactPoint);
	void ForceUpdateDamageableElementState();
	void OnChaosBreak(const struct FChaosBreakEvent& BreakEvent);
	void OnDamageDenied(class ABP_jRPG_Character_World_C* PlayerCharacter, const struct FVector& ImpactPoint);
	void OnDamageReceived(class ABP_jRPG_Character_World_C* PlayerCharacter, const struct FVector& ImpactPoint);
	void PlayFeedbackOnDamageDenied(class AActor* self2, const struct FVector& ImpactPoint);
	void ReceiveBeginPlay();
	void Timeline__FinishedFunc();
	void Timeline__UpdateFunc();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_DamageableLevelElement_Parent_C">();
	}
	static class ABP_DamageableLevelElement_Parent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_DamageableLevelElement_Parent_C>();
	}
};
static_assert(alignof(ABP_DamageableLevelElement_Parent_C) == 0x000008, "Wrong alignment on ABP_DamageableLevelElement_Parent_C");
static_assert(sizeof(ABP_DamageableLevelElement_Parent_C) == 0x0002F8, "Wrong size on ABP_DamageableLevelElement_Parent_C");
static_assert(offsetof(ABP_DamageableLevelElement_Parent_C, UberGraphFrame) == 0x000290, "Member 'ABP_DamageableLevelElement_Parent_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_DamageableLevelElement_Parent_C, StaticMeshComponent) == 0x000298, "Member 'ABP_DamageableLevelElement_Parent_C::StaticMeshComponent' has a wrong offset!");
static_assert(offsetof(ABP_DamageableLevelElement_Parent_C, CustomNavModifier) == 0x0002A0, "Member 'ABP_DamageableLevelElement_Parent_C::CustomNavModifier' has a wrong offset!");
static_assert(offsetof(ABP_DamageableLevelElement_Parent_C, BP_Destructible_SerializableComponent) == 0x0002A8, "Member 'ABP_DamageableLevelElement_Parent_C::BP_Destructible_SerializableComponent' has a wrong offset!");
static_assert(offsetof(ABP_DamageableLevelElement_Parent_C, DefaultSceneRoot) == 0x0002B0, "Member 'ABP_DamageableLevelElement_Parent_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_DamageableLevelElement_Parent_C, Timeline_Alpha_44D8ECF64DDDACB259F5D39083142F5C) == 0x0002B8, "Member 'ABP_DamageableLevelElement_Parent_C::Timeline_Alpha_44D8ECF64DDDACB259F5D39083142F5C' has a wrong offset!");
static_assert(offsetof(ABP_DamageableLevelElement_Parent_C, Timeline__Direction_44D8ECF64DDDACB259F5D39083142F5C) == 0x0002BC, "Member 'ABP_DamageableLevelElement_Parent_C::Timeline__Direction_44D8ECF64DDDACB259F5D39083142F5C' has a wrong offset!");
static_assert(offsetof(ABP_DamageableLevelElement_Parent_C, Timeline) == 0x0002C0, "Member 'ABP_DamageableLevelElement_Parent_C::Timeline' has a wrong offset!");
static_assert(offsetof(ABP_DamageableLevelElement_Parent_C, RequiredDamageLevel) == 0x0002C8, "Member 'ABP_DamageableLevelElement_Parent_C::RequiredDamageLevel' has a wrong offset!");
static_assert(offsetof(ABP_DamageableLevelElement_Parent_C, IsDestroyed) == 0x0002CC, "Member 'ABP_DamageableLevelElement_Parent_C::IsDestroyed' has a wrong offset!");
static_assert(offsetof(ABP_DamageableLevelElement_Parent_C, BreakSound) == 0x0002D0, "Member 'ABP_DamageableLevelElement_Parent_C::BreakSound' has a wrong offset!");
static_assert(offsetof(ABP_DamageableLevelElement_Parent_C, OnDestructionCompleted) == 0x0002D8, "Member 'ABP_DamageableLevelElement_Parent_C::OnDestructionCompleted' has a wrong offset!");
static_assert(offsetof(ABP_DamageableLevelElement_Parent_C, GeometryCollectionAsset) == 0x0002E8, "Member 'ABP_DamageableLevelElement_Parent_C::GeometryCollectionAsset' has a wrong offset!");
static_assert(offsetof(ABP_DamageableLevelElement_Parent_C, SpawnedGeometryCollection) == 0x0002F0, "Member 'ABP_DamageableLevelElement_Parent_C::SpawnedGeometryCollection' has a wrong offset!");

}

