#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DataAsset_SkillGraph

#include "Basic.hpp"

#include "FSkillUnlockData_structs.hpp"
#include "FSkillGraphNode_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FSkillGraphEdge_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_DataAsset_SkillGraph.BP_DataAsset_SkillGraph_C.DoesEdgeExist
// 0x0030 (0x0030 - 0x0000)
struct BP_DataAsset_SkillGraph_C_DoesEdgeExist final
{
public:
	class UBP_DataAsset_Skill_C*                  Node1;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_DataAsset_Skill_C*                  Node2;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Exists;                                            // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FindEdge_Found;                           // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFSkillGraphEdge                       CallFunc_FindEdge_Edge;                            // 0x0018(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FindEdge_EdgeIndex;                       // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DataAsset_SkillGraph_C_DoesEdgeExist) == 0x000008, "Wrong alignment on BP_DataAsset_SkillGraph_C_DoesEdgeExist");
static_assert(sizeof(BP_DataAsset_SkillGraph_C_DoesEdgeExist) == 0x000030, "Wrong size on BP_DataAsset_SkillGraph_C_DoesEdgeExist");
static_assert(offsetof(BP_DataAsset_SkillGraph_C_DoesEdgeExist, Node1) == 0x000000, "Member 'BP_DataAsset_SkillGraph_C_DoesEdgeExist::Node1' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_SkillGraph_C_DoesEdgeExist, Node2) == 0x000008, "Member 'BP_DataAsset_SkillGraph_C_DoesEdgeExist::Node2' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_SkillGraph_C_DoesEdgeExist, Exists) == 0x000010, "Member 'BP_DataAsset_SkillGraph_C_DoesEdgeExist::Exists' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_SkillGraph_C_DoesEdgeExist, CallFunc_FindEdge_Found) == 0x000011, "Member 'BP_DataAsset_SkillGraph_C_DoesEdgeExist::CallFunc_FindEdge_Found' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_SkillGraph_C_DoesEdgeExist, CallFunc_FindEdge_Edge) == 0x000018, "Member 'BP_DataAsset_SkillGraph_C_DoesEdgeExist::CallFunc_FindEdge_Edge' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_SkillGraph_C_DoesEdgeExist, CallFunc_FindEdge_EdgeIndex) == 0x000028, "Member 'BP_DataAsset_SkillGraph_C_DoesEdgeExist::CallFunc_FindEdge_EdgeIndex' has a wrong offset!");

// Function BP_DataAsset_SkillGraph.BP_DataAsset_SkillGraph_C.FindEdge
// 0x0070 (0x0070 - 0x0000)
struct BP_DataAsset_SkillGraph_C_FindEdge final
{
public:
	class UBP_DataAsset_Skill_C*                  skill1;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_DataAsset_Skill_C*                  Skill2;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Found;                                             // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFSkillGraphEdge                       Edge;                                              // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         EdgeIndex;                                         // 0x0028(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFSkillGraphEdge>               CallFunc_FindEdgesFromSkill_MatchingEdges;         // 0x0030(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFSkillGraphEdge                       CallFunc_Array_Get_Item;                           // 0x0050(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_1;    // 0x0062(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_63[0x1];                                       // 0x0063(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DataAsset_SkillGraph_C_FindEdge) == 0x000008, "Wrong alignment on BP_DataAsset_SkillGraph_C_FindEdge");
static_assert(sizeof(BP_DataAsset_SkillGraph_C_FindEdge) == 0x000070, "Wrong size on BP_DataAsset_SkillGraph_C_FindEdge");
static_assert(offsetof(BP_DataAsset_SkillGraph_C_FindEdge, skill1) == 0x000000, "Member 'BP_DataAsset_SkillGraph_C_FindEdge::skill1' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_SkillGraph_C_FindEdge, Skill2) == 0x000008, "Member 'BP_DataAsset_SkillGraph_C_FindEdge::Skill2' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_SkillGraph_C_FindEdge, Found) == 0x000010, "Member 'BP_DataAsset_SkillGraph_C_FindEdge::Found' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_SkillGraph_C_FindEdge, Edge) == 0x000018, "Member 'BP_DataAsset_SkillGraph_C_FindEdge::Edge' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_SkillGraph_C_FindEdge, EdgeIndex) == 0x000028, "Member 'BP_DataAsset_SkillGraph_C_FindEdge::EdgeIndex' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_SkillGraph_C_FindEdge, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x00002C, "Member 'BP_DataAsset_SkillGraph_C_FindEdge::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_SkillGraph_C_FindEdge, CallFunc_FindEdgesFromSkill_MatchingEdges) == 0x000030, "Member 'BP_DataAsset_SkillGraph_C_FindEdge::CallFunc_FindEdgesFromSkill_MatchingEdges' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_SkillGraph_C_FindEdge, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'BP_DataAsset_SkillGraph_C_FindEdge::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_SkillGraph_C_FindEdge, Temp_int_Array_Index_Variable) == 0x000044, "Member 'BP_DataAsset_SkillGraph_C_FindEdge::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_SkillGraph_C_FindEdge, Temp_int_Loop_Counter_Variable) == 0x000048, "Member 'BP_DataAsset_SkillGraph_C_FindEdge::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_SkillGraph_C_FindEdge, CallFunc_Array_Get_Item) == 0x000050, "Member 'BP_DataAsset_SkillGraph_C_FindEdge::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_SkillGraph_C_FindEdge, CallFunc_Less_IntInt_ReturnValue) == 0x000060, "Member 'BP_DataAsset_SkillGraph_C_FindEdge::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_SkillGraph_C_FindEdge, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000061, "Member 'BP_DataAsset_SkillGraph_C_FindEdge::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_SkillGraph_C_FindEdge, CallFunc_EqualEqual_ObjectObject_ReturnValue_1) == 0x000062, "Member 'BP_DataAsset_SkillGraph_C_FindEdge::CallFunc_EqualEqual_ObjectObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_SkillGraph_C_FindEdge, CallFunc_Add_IntInt_ReturnValue) == 0x000064, "Member 'BP_DataAsset_SkillGraph_C_FindEdge::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_SkillGraph_C_FindEdge, CallFunc_BooleanOR_ReturnValue) == 0x000068, "Member 'BP_DataAsset_SkillGraph_C_FindEdge::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_SkillGraph_C_FindEdge, CallFunc_Array_Find_ReturnValue) == 0x00006C, "Member 'BP_DataAsset_SkillGraph_C_FindEdge::CallFunc_Array_Find_ReturnValue' has a wrong offset!");

// Function BP_DataAsset_SkillGraph.BP_DataAsset_SkillGraph_C.FindEdgesFromSkill
// 0x0070 (0x0070 - 0x0000)
struct BP_DataAsset_SkillGraph_C_FindEdgesFromSkill final
{
public:
	class UBP_DataAsset_Skill_C*                  Skill;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFSkillGraphEdge>               MatchingEdges;                                     // 0x0008(0x0010)(Parm, OutParm)
	TArray<struct FFSkillGraphEdge>               Temp_wildcard_We_need_a_second_array_to_store_the_result_and_be_able_to_wipe_the_first__buffer__array_Variable; // 0x0018(0x0010)(ConstParm, ReferenceParm)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFSkillGraphEdge>               Temp_wildcard_Temp_buffer_array_Variable;          // 0x0038(0x0010)(ConstParm, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFSkillGraphEdge                       CallFunc_Array_Get_Item;                           // 0x0050(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_1;    // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DataAsset_SkillGraph_C_FindEdgesFromSkill) == 0x000008, "Wrong alignment on BP_DataAsset_SkillGraph_C_FindEdgesFromSkill");
static_assert(sizeof(BP_DataAsset_SkillGraph_C_FindEdgesFromSkill) == 0x000070, "Wrong size on BP_DataAsset_SkillGraph_C_FindEdgesFromSkill");
static_assert(offsetof(BP_DataAsset_SkillGraph_C_FindEdgesFromSkill, Skill) == 0x000000, "Member 'BP_DataAsset_SkillGraph_C_FindEdgesFromSkill::Skill' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_SkillGraph_C_FindEdgesFromSkill, MatchingEdges) == 0x000008, "Member 'BP_DataAsset_SkillGraph_C_FindEdgesFromSkill::MatchingEdges' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_SkillGraph_C_FindEdgesFromSkill, Temp_wildcard_We_need_a_second_array_to_store_the_result_and_be_able_to_wipe_the_first__buffer__array_Variable) == 0x000018, "Member 'BP_DataAsset_SkillGraph_C_FindEdgesFromSkill::Temp_wildcard_We_need_a_second_array_to_store_the_result_and_be_able_to_wipe_the_first__buffer__array_Variable' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_SkillGraph_C_FindEdgesFromSkill, Temp_int_Loop_Counter_Variable) == 0x000028, "Member 'BP_DataAsset_SkillGraph_C_FindEdgesFromSkill::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_SkillGraph_C_FindEdgesFromSkill, CallFunc_Add_IntInt_ReturnValue) == 0x00002C, "Member 'BP_DataAsset_SkillGraph_C_FindEdgesFromSkill::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_SkillGraph_C_FindEdgesFromSkill, Temp_int_Array_Index_Variable) == 0x000030, "Member 'BP_DataAsset_SkillGraph_C_FindEdgesFromSkill::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_SkillGraph_C_FindEdgesFromSkill, Temp_wildcard_Temp_buffer_array_Variable) == 0x000038, "Member 'BP_DataAsset_SkillGraph_C_FindEdgesFromSkill::Temp_wildcard_Temp_buffer_array_Variable' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_SkillGraph_C_FindEdgesFromSkill, CallFunc_Array_Length_ReturnValue) == 0x000048, "Member 'BP_DataAsset_SkillGraph_C_FindEdgesFromSkill::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_SkillGraph_C_FindEdgesFromSkill, CallFunc_Array_Get_Item) == 0x000050, "Member 'BP_DataAsset_SkillGraph_C_FindEdgesFromSkill::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_SkillGraph_C_FindEdgesFromSkill, CallFunc_Less_IntInt_ReturnValue) == 0x000060, "Member 'BP_DataAsset_SkillGraph_C_FindEdgesFromSkill::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_SkillGraph_C_FindEdgesFromSkill, CallFunc_Array_Add_ReturnValue) == 0x000064, "Member 'BP_DataAsset_SkillGraph_C_FindEdgesFromSkill::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_SkillGraph_C_FindEdgesFromSkill, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000068, "Member 'BP_DataAsset_SkillGraph_C_FindEdgesFromSkill::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_SkillGraph_C_FindEdgesFromSkill, CallFunc_EqualEqual_ObjectObject_ReturnValue_1) == 0x000069, "Member 'BP_DataAsset_SkillGraph_C_FindEdgesFromSkill::CallFunc_EqualEqual_ObjectObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_SkillGraph_C_FindEdgesFromSkill, CallFunc_BooleanOR_ReturnValue) == 0x00006A, "Member 'BP_DataAsset_SkillGraph_C_FindEdgesFromSkill::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function BP_DataAsset_SkillGraph.BP_DataAsset_SkillGraph_C.FindSkillByNameID
// 0x0058 (0x0058 - 0x0000)
struct BP_DataAsset_SkillGraph_C_FindSkillByNameID final
{
public:
	class FName                                   SkillNameID;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Found;                                             // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_DataAsset_Skill_C*                  Skill;                                             // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           K2Node_MakeArray_Array;                            // 0x0018(0x0010)(ReferenceParm)
	TArray<class UBP_DataAsset_Skill_C*>          CallFunc_TryFindSkillsByNameIDs_SkillAssets;       // 0x0028(0x0010)(ReferenceParm)
	bool                                          CallFunc_TryFindSkillsByNameIDs_AllFound;          // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_TryFindSkillsByNameIDs_MissingNameIDs;    // 0x0040(0x0010)(ReferenceParm)
	class UBP_DataAsset_Skill_C*                  CallFunc_Array_Get_Item;                           // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DataAsset_SkillGraph_C_FindSkillByNameID) == 0x000008, "Wrong alignment on BP_DataAsset_SkillGraph_C_FindSkillByNameID");
static_assert(sizeof(BP_DataAsset_SkillGraph_C_FindSkillByNameID) == 0x000058, "Wrong size on BP_DataAsset_SkillGraph_C_FindSkillByNameID");
static_assert(offsetof(BP_DataAsset_SkillGraph_C_FindSkillByNameID, SkillNameID) == 0x000000, "Member 'BP_DataAsset_SkillGraph_C_FindSkillByNameID::SkillNameID' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_SkillGraph_C_FindSkillByNameID, Found) == 0x000008, "Member 'BP_DataAsset_SkillGraph_C_FindSkillByNameID::Found' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_SkillGraph_C_FindSkillByNameID, Skill) == 0x000010, "Member 'BP_DataAsset_SkillGraph_C_FindSkillByNameID::Skill' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_SkillGraph_C_FindSkillByNameID, K2Node_MakeArray_Array) == 0x000018, "Member 'BP_DataAsset_SkillGraph_C_FindSkillByNameID::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_SkillGraph_C_FindSkillByNameID, CallFunc_TryFindSkillsByNameIDs_SkillAssets) == 0x000028, "Member 'BP_DataAsset_SkillGraph_C_FindSkillByNameID::CallFunc_TryFindSkillsByNameIDs_SkillAssets' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_SkillGraph_C_FindSkillByNameID, CallFunc_TryFindSkillsByNameIDs_AllFound) == 0x000038, "Member 'BP_DataAsset_SkillGraph_C_FindSkillByNameID::CallFunc_TryFindSkillsByNameIDs_AllFound' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_SkillGraph_C_FindSkillByNameID, CallFunc_TryFindSkillsByNameIDs_MissingNameIDs) == 0x000040, "Member 'BP_DataAsset_SkillGraph_C_FindSkillByNameID::CallFunc_TryFindSkillsByNameIDs_MissingNameIDs' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_SkillGraph_C_FindSkillByNameID, CallFunc_Array_Get_Item) == 0x000050, "Member 'BP_DataAsset_SkillGraph_C_FindSkillByNameID::CallFunc_Array_Get_Item' has a wrong offset!");

// Function BP_DataAsset_SkillGraph.BP_DataAsset_SkillGraph_C.FindSkillNode
// 0x00A0 (0x00A0 - 0x0000)
struct BP_DataAsset_SkillGraph_C_FindSkillNode final
{
public:
	class UBP_DataAsset_Skill_C*                  Skill;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Found;                                             // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFSkillGraphNode                       Node;                                              // 0x0010(0x0038)(Parm, OutParm, NoDestructor, HasGetValueTypeHash)
	int32                                         Index_0;                                           // 0x0048(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFSkillGraphNode                       CallFunc_Array_Get_Item;                           // 0x0060(0x0038)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DataAsset_SkillGraph_C_FindSkillNode) == 0x000008, "Wrong alignment on BP_DataAsset_SkillGraph_C_FindSkillNode");
static_assert(sizeof(BP_DataAsset_SkillGraph_C_FindSkillNode) == 0x0000A0, "Wrong size on BP_DataAsset_SkillGraph_C_FindSkillNode");
static_assert(offsetof(BP_DataAsset_SkillGraph_C_FindSkillNode, Skill) == 0x000000, "Member 'BP_DataAsset_SkillGraph_C_FindSkillNode::Skill' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_SkillGraph_C_FindSkillNode, Found) == 0x000008, "Member 'BP_DataAsset_SkillGraph_C_FindSkillNode::Found' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_SkillGraph_C_FindSkillNode, Node) == 0x000010, "Member 'BP_DataAsset_SkillGraph_C_FindSkillNode::Node' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_SkillGraph_C_FindSkillNode, Index_0) == 0x000048, "Member 'BP_DataAsset_SkillGraph_C_FindSkillNode::Index_0' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_SkillGraph_C_FindSkillNode, Temp_int_Array_Index_Variable) == 0x00004C, "Member 'BP_DataAsset_SkillGraph_C_FindSkillNode::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_SkillGraph_C_FindSkillNode, Temp_int_Loop_Counter_Variable) == 0x000050, "Member 'BP_DataAsset_SkillGraph_C_FindSkillNode::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_SkillGraph_C_FindSkillNode, CallFunc_Add_IntInt_ReturnValue) == 0x000054, "Member 'BP_DataAsset_SkillGraph_C_FindSkillNode::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_SkillGraph_C_FindSkillNode, CallFunc_Array_Length_ReturnValue) == 0x000058, "Member 'BP_DataAsset_SkillGraph_C_FindSkillNode::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_SkillGraph_C_FindSkillNode, CallFunc_Array_Get_Item) == 0x000060, "Member 'BP_DataAsset_SkillGraph_C_FindSkillNode::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_SkillGraph_C_FindSkillNode, CallFunc_Less_IntInt_ReturnValue) == 0x000098, "Member 'BP_DataAsset_SkillGraph_C_FindSkillNode::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_SkillGraph_C_FindSkillNode, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000099, "Member 'BP_DataAsset_SkillGraph_C_FindSkillNode::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");

// Function BP_DataAsset_SkillGraph.BP_DataAsset_SkillGraph_C.FindSkillNodeSafe
// 0x0118 (0x0118 - 0x0000)
struct BP_DataAsset_SkillGraph_C_FindSkillNodeSafe final
{
public:
	class UBP_DataAsset_Skill_C*                  Skill;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Found;                                             // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFSkillGraphNode                       Node;                                              // 0x0010(0x0038)(Parm, OutParm, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_FindSkillNode_Found;                      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFSkillGraphNode                       CallFunc_FindSkillNode_Node;                       // 0x0060(0x0038)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FindSkillNode_Index;                      // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x00A0(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x00B0(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00F8(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Format_ReturnValue;                       // 0x0108(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DataAsset_SkillGraph_C_FindSkillNodeSafe) == 0x000008, "Wrong alignment on BP_DataAsset_SkillGraph_C_FindSkillNodeSafe");
static_assert(sizeof(BP_DataAsset_SkillGraph_C_FindSkillNodeSafe) == 0x000118, "Wrong size on BP_DataAsset_SkillGraph_C_FindSkillNodeSafe");
static_assert(offsetof(BP_DataAsset_SkillGraph_C_FindSkillNodeSafe, Skill) == 0x000000, "Member 'BP_DataAsset_SkillGraph_C_FindSkillNodeSafe::Skill' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_SkillGraph_C_FindSkillNodeSafe, Found) == 0x000008, "Member 'BP_DataAsset_SkillGraph_C_FindSkillNodeSafe::Found' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_SkillGraph_C_FindSkillNodeSafe, Node) == 0x000010, "Member 'BP_DataAsset_SkillGraph_C_FindSkillNodeSafe::Node' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_SkillGraph_C_FindSkillNodeSafe, CallFunc_GetDisplayName_ReturnValue) == 0x000048, "Member 'BP_DataAsset_SkillGraph_C_FindSkillNodeSafe::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_SkillGraph_C_FindSkillNodeSafe, CallFunc_FindSkillNode_Found) == 0x000058, "Member 'BP_DataAsset_SkillGraph_C_FindSkillNodeSafe::CallFunc_FindSkillNode_Found' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_SkillGraph_C_FindSkillNodeSafe, CallFunc_FindSkillNode_Node) == 0x000060, "Member 'BP_DataAsset_SkillGraph_C_FindSkillNodeSafe::CallFunc_FindSkillNode_Node' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_SkillGraph_C_FindSkillNodeSafe, CallFunc_FindSkillNode_Index) == 0x000098, "Member 'BP_DataAsset_SkillGraph_C_FindSkillNodeSafe::CallFunc_FindSkillNode_Index' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_SkillGraph_C_FindSkillNodeSafe, CallFunc_Conv_StringToText_ReturnValue) == 0x0000A0, "Member 'BP_DataAsset_SkillGraph_C_FindSkillNodeSafe::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_SkillGraph_C_FindSkillNodeSafe, K2Node_MakeStruct_FormatArgumentData) == 0x0000B0, "Member 'BP_DataAsset_SkillGraph_C_FindSkillNodeSafe::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_SkillGraph_C_FindSkillNodeSafe, K2Node_MakeArray_Array) == 0x0000F8, "Member 'BP_DataAsset_SkillGraph_C_FindSkillNodeSafe::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_SkillGraph_C_FindSkillNodeSafe, CallFunc_Format_ReturnValue) == 0x000108, "Member 'BP_DataAsset_SkillGraph_C_FindSkillNodeSafe::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function BP_DataAsset_SkillGraph.BP_DataAsset_SkillGraph_C.FindSkillsUnlockedByItem
// 0x0098 (0x0098 - 0x0000)
struct BP_DataAsset_SkillGraph_C_FindSkillsUnlockedByItem final
{
public:
	class FName                                   ItemId;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFSkillGraphNode>               ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ReturnParm)
	TArray<struct FFSkillGraphNode>               Temp_wildcard_We_need_a_second_array_to_store_the_result_and_be_able_to_wipe_the_first__buffer__array_Variable; // 0x0018(0x0010)(ConstParm, ReferenceParm)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFSkillGraphNode>               Temp_wildcard_Temp_buffer_array_Variable;          // 0x0038(0x0010)(ConstParm, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFSkillGraphNode                       CallFunc_Array_Get_Item;                           // 0x0050(0x0038)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DataAsset_SkillGraph_C_FindSkillsUnlockedByItem) == 0x000008, "Wrong alignment on BP_DataAsset_SkillGraph_C_FindSkillsUnlockedByItem");
static_assert(sizeof(BP_DataAsset_SkillGraph_C_FindSkillsUnlockedByItem) == 0x000098, "Wrong size on BP_DataAsset_SkillGraph_C_FindSkillsUnlockedByItem");
static_assert(offsetof(BP_DataAsset_SkillGraph_C_FindSkillsUnlockedByItem, ItemId) == 0x000000, "Member 'BP_DataAsset_SkillGraph_C_FindSkillsUnlockedByItem::ItemId' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_SkillGraph_C_FindSkillsUnlockedByItem, ReturnValue) == 0x000008, "Member 'BP_DataAsset_SkillGraph_C_FindSkillsUnlockedByItem::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_SkillGraph_C_FindSkillsUnlockedByItem, Temp_wildcard_We_need_a_second_array_to_store_the_result_and_be_able_to_wipe_the_first__buffer__array_Variable) == 0x000018, "Member 'BP_DataAsset_SkillGraph_C_FindSkillsUnlockedByItem::Temp_wildcard_We_need_a_second_array_to_store_the_result_and_be_able_to_wipe_the_first__buffer__array_Variable' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_SkillGraph_C_FindSkillsUnlockedByItem, Temp_int_Loop_Counter_Variable) == 0x000028, "Member 'BP_DataAsset_SkillGraph_C_FindSkillsUnlockedByItem::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_SkillGraph_C_FindSkillsUnlockedByItem, CallFunc_Add_IntInt_ReturnValue) == 0x00002C, "Member 'BP_DataAsset_SkillGraph_C_FindSkillsUnlockedByItem::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_SkillGraph_C_FindSkillsUnlockedByItem, Temp_int_Array_Index_Variable) == 0x000030, "Member 'BP_DataAsset_SkillGraph_C_FindSkillsUnlockedByItem::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_SkillGraph_C_FindSkillsUnlockedByItem, Temp_wildcard_Temp_buffer_array_Variable) == 0x000038, "Member 'BP_DataAsset_SkillGraph_C_FindSkillsUnlockedByItem::Temp_wildcard_Temp_buffer_array_Variable' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_SkillGraph_C_FindSkillsUnlockedByItem, CallFunc_Array_Length_ReturnValue) == 0x000048, "Member 'BP_DataAsset_SkillGraph_C_FindSkillsUnlockedByItem::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_SkillGraph_C_FindSkillsUnlockedByItem, CallFunc_Array_Get_Item) == 0x000050, "Member 'BP_DataAsset_SkillGraph_C_FindSkillsUnlockedByItem::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_SkillGraph_C_FindSkillsUnlockedByItem, CallFunc_Less_IntInt_ReturnValue) == 0x000088, "Member 'BP_DataAsset_SkillGraph_C_FindSkillsUnlockedByItem::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_SkillGraph_C_FindSkillsUnlockedByItem, CallFunc_Array_Add_ReturnValue) == 0x00008C, "Member 'BP_DataAsset_SkillGraph_C_FindSkillsUnlockedByItem::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_SkillGraph_C_FindSkillsUnlockedByItem, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000090, "Member 'BP_DataAsset_SkillGraph_C_FindSkillsUnlockedByItem::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");

// Function BP_DataAsset_SkillGraph.BP_DataAsset_SkillGraph_C.GetAdjacentSkills
// 0x0080 (0x0080 - 0x0000)
struct BP_DataAsset_SkillGraph_C_GetAdjacentSkills final
{
public:
	class UBP_DataAsset_Skill_C*                  Skill;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UBP_DataAsset_Skill_C*>          Skills;                                            // 0x0008(0x0010)(Parm, OutParm)
	class UBP_DataAsset_Skill_C*                  local_nodeToAdd;                                   // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UBP_DataAsset_Skill_C*>          Temp_wildcard_We_need_a_second_array_to_store_the_result_and_be_able_to_wipe_the_first__buffer__array_Variable; // 0x0020(0x0010)(ConstParm, ReferenceParm)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UBP_DataAsset_Skill_C*>          Temp_wildcard_Temp_buffer_array_Variable;          // 0x0040(0x0010)(ConstParm, ReferenceParm)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFSkillGraphEdge                       CallFunc_Array_Get_Item;                           // 0x0060(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_1;    // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0073(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_DataAsset_Skill_C*                  K2Node_Select_Default;                             // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DataAsset_SkillGraph_C_GetAdjacentSkills) == 0x000008, "Wrong alignment on BP_DataAsset_SkillGraph_C_GetAdjacentSkills");
static_assert(sizeof(BP_DataAsset_SkillGraph_C_GetAdjacentSkills) == 0x000080, "Wrong size on BP_DataAsset_SkillGraph_C_GetAdjacentSkills");
static_assert(offsetof(BP_DataAsset_SkillGraph_C_GetAdjacentSkills, Skill) == 0x000000, "Member 'BP_DataAsset_SkillGraph_C_GetAdjacentSkills::Skill' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_SkillGraph_C_GetAdjacentSkills, Skills) == 0x000008, "Member 'BP_DataAsset_SkillGraph_C_GetAdjacentSkills::Skills' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_SkillGraph_C_GetAdjacentSkills, local_nodeToAdd) == 0x000018, "Member 'BP_DataAsset_SkillGraph_C_GetAdjacentSkills::local_nodeToAdd' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_SkillGraph_C_GetAdjacentSkills, Temp_wildcard_We_need_a_second_array_to_store_the_result_and_be_able_to_wipe_the_first__buffer__array_Variable) == 0x000020, "Member 'BP_DataAsset_SkillGraph_C_GetAdjacentSkills::Temp_wildcard_We_need_a_second_array_to_store_the_result_and_be_able_to_wipe_the_first__buffer__array_Variable' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_SkillGraph_C_GetAdjacentSkills, Temp_int_Loop_Counter_Variable) == 0x000030, "Member 'BP_DataAsset_SkillGraph_C_GetAdjacentSkills::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_SkillGraph_C_GetAdjacentSkills, CallFunc_Add_IntInt_ReturnValue) == 0x000034, "Member 'BP_DataAsset_SkillGraph_C_GetAdjacentSkills::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_SkillGraph_C_GetAdjacentSkills, Temp_int_Array_Index_Variable) == 0x000038, "Member 'BP_DataAsset_SkillGraph_C_GetAdjacentSkills::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_SkillGraph_C_GetAdjacentSkills, Temp_wildcard_Temp_buffer_array_Variable) == 0x000040, "Member 'BP_DataAsset_SkillGraph_C_GetAdjacentSkills::Temp_wildcard_Temp_buffer_array_Variable' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_SkillGraph_C_GetAdjacentSkills, CallFunc_Array_Add_ReturnValue) == 0x000050, "Member 'BP_DataAsset_SkillGraph_C_GetAdjacentSkills::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_SkillGraph_C_GetAdjacentSkills, Temp_bool_Variable) == 0x000054, "Member 'BP_DataAsset_SkillGraph_C_GetAdjacentSkills::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_SkillGraph_C_GetAdjacentSkills, CallFunc_Array_Length_ReturnValue) == 0x000058, "Member 'BP_DataAsset_SkillGraph_C_GetAdjacentSkills::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_SkillGraph_C_GetAdjacentSkills, CallFunc_Array_Get_Item) == 0x000060, "Member 'BP_DataAsset_SkillGraph_C_GetAdjacentSkills::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_SkillGraph_C_GetAdjacentSkills, CallFunc_Less_IntInt_ReturnValue) == 0x000070, "Member 'BP_DataAsset_SkillGraph_C_GetAdjacentSkills::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_SkillGraph_C_GetAdjacentSkills, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000071, "Member 'BP_DataAsset_SkillGraph_C_GetAdjacentSkills::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_SkillGraph_C_GetAdjacentSkills, CallFunc_EqualEqual_ObjectObject_ReturnValue_1) == 0x000072, "Member 'BP_DataAsset_SkillGraph_C_GetAdjacentSkills::CallFunc_EqualEqual_ObjectObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_SkillGraph_C_GetAdjacentSkills, CallFunc_BooleanOR_ReturnValue) == 0x000073, "Member 'BP_DataAsset_SkillGraph_C_GetAdjacentSkills::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_SkillGraph_C_GetAdjacentSkills, K2Node_Select_Default) == 0x000078, "Member 'BP_DataAsset_SkillGraph_C_GetAdjacentSkills::K2Node_Select_Default' has a wrong offset!");

// Function BP_DataAsset_SkillGraph.BP_DataAsset_SkillGraph_C.GetCustomGroupingPolicies
// 0x0010 (0x0010 - 0x0000)
struct BP_DataAsset_SkillGraph_C_GetCustomGroupingPolicies final
{
public:
	TArray<class UClass*>                         ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm)
};
static_assert(alignof(BP_DataAsset_SkillGraph_C_GetCustomGroupingPolicies) == 0x000008, "Wrong alignment on BP_DataAsset_SkillGraph_C_GetCustomGroupingPolicies");
static_assert(sizeof(BP_DataAsset_SkillGraph_C_GetCustomGroupingPolicies) == 0x000010, "Wrong size on BP_DataAsset_SkillGraph_C_GetCustomGroupingPolicies");
static_assert(offsetof(BP_DataAsset_SkillGraph_C_GetCustomGroupingPolicies, ReturnValue) == 0x000000, "Member 'BP_DataAsset_SkillGraph_C_GetCustomGroupingPolicies::ReturnValue' has a wrong offset!");

// Function BP_DataAsset_SkillGraph.BP_DataAsset_SkillGraph_C.GetNodesInsideBox
// 0x0110 (0x0110 - 0x0000)
struct BP_DataAsset_SkillGraph_C_GetNodesInsideBox final
{
public:
	struct FVector2D                              StartPoint;                                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Size;                                              // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFSkillGraphNode>               Nodes_0;                                           // 0x0020(0x0010)(Parm, OutParm)
	struct FVector2D                              local_maxBound;                                    // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              local_minBound;                                    // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue;         // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFSkillGraphNode>               Temp_wildcard_We_need_a_second_array_to_store_the_result_and_be_able_to_wipe_the_first__buffer__array_Variable; // 0x0060(0x0010)(ConstParm, ReferenceParm)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFSkillGraphNode>               Temp_wildcard_Temp_buffer_array_Variable;          // 0x0080(0x0010)(ConstParm, ReferenceParm)
	double                                        CallFunc_BreakVector2D_X;                          // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X_1;                        // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y_1;                        // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFSkillGraphNode                       CallFunc_Array_Get_Item;                           // 0x00B8(0x0038)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x3];                                       // 0x00F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X_2;                        // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y_2;                        // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_InRange_FloatFloat_ReturnValue;           // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_InRange_FloatFloat_ReturnValue_1;         // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x010A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DataAsset_SkillGraph_C_GetNodesInsideBox) == 0x000008, "Wrong alignment on BP_DataAsset_SkillGraph_C_GetNodesInsideBox");
static_assert(sizeof(BP_DataAsset_SkillGraph_C_GetNodesInsideBox) == 0x000110, "Wrong size on BP_DataAsset_SkillGraph_C_GetNodesInsideBox");
static_assert(offsetof(BP_DataAsset_SkillGraph_C_GetNodesInsideBox, StartPoint) == 0x000000, "Member 'BP_DataAsset_SkillGraph_C_GetNodesInsideBox::StartPoint' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_SkillGraph_C_GetNodesInsideBox, Size) == 0x000010, "Member 'BP_DataAsset_SkillGraph_C_GetNodesInsideBox::Size' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_SkillGraph_C_GetNodesInsideBox, Nodes_0) == 0x000020, "Member 'BP_DataAsset_SkillGraph_C_GetNodesInsideBox::Nodes_0' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_SkillGraph_C_GetNodesInsideBox, local_maxBound) == 0x000030, "Member 'BP_DataAsset_SkillGraph_C_GetNodesInsideBox::local_maxBound' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_SkillGraph_C_GetNodesInsideBox, local_minBound) == 0x000040, "Member 'BP_DataAsset_SkillGraph_C_GetNodesInsideBox::local_minBound' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_SkillGraph_C_GetNodesInsideBox, CallFunc_Add_Vector2DVector2D_ReturnValue) == 0x000050, "Member 'BP_DataAsset_SkillGraph_C_GetNodesInsideBox::CallFunc_Add_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_SkillGraph_C_GetNodesInsideBox, Temp_wildcard_We_need_a_second_array_to_store_the_result_and_be_able_to_wipe_the_first__buffer__array_Variable) == 0x000060, "Member 'BP_DataAsset_SkillGraph_C_GetNodesInsideBox::Temp_wildcard_We_need_a_second_array_to_store_the_result_and_be_able_to_wipe_the_first__buffer__array_Variable' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_SkillGraph_C_GetNodesInsideBox, Temp_int_Loop_Counter_Variable) == 0x000070, "Member 'BP_DataAsset_SkillGraph_C_GetNodesInsideBox::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_SkillGraph_C_GetNodesInsideBox, CallFunc_Add_IntInt_ReturnValue) == 0x000074, "Member 'BP_DataAsset_SkillGraph_C_GetNodesInsideBox::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_SkillGraph_C_GetNodesInsideBox, Temp_int_Array_Index_Variable) == 0x000078, "Member 'BP_DataAsset_SkillGraph_C_GetNodesInsideBox::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_SkillGraph_C_GetNodesInsideBox, Temp_wildcard_Temp_buffer_array_Variable) == 0x000080, "Member 'BP_DataAsset_SkillGraph_C_GetNodesInsideBox::Temp_wildcard_Temp_buffer_array_Variable' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_SkillGraph_C_GetNodesInsideBox, CallFunc_BreakVector2D_X) == 0x000090, "Member 'BP_DataAsset_SkillGraph_C_GetNodesInsideBox::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_SkillGraph_C_GetNodesInsideBox, CallFunc_BreakVector2D_Y) == 0x000098, "Member 'BP_DataAsset_SkillGraph_C_GetNodesInsideBox::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_SkillGraph_C_GetNodesInsideBox, CallFunc_BreakVector2D_X_1) == 0x0000A0, "Member 'BP_DataAsset_SkillGraph_C_GetNodesInsideBox::CallFunc_BreakVector2D_X_1' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_SkillGraph_C_GetNodesInsideBox, CallFunc_BreakVector2D_Y_1) == 0x0000A8, "Member 'BP_DataAsset_SkillGraph_C_GetNodesInsideBox::CallFunc_BreakVector2D_Y_1' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_SkillGraph_C_GetNodesInsideBox, CallFunc_Array_Length_ReturnValue) == 0x0000B0, "Member 'BP_DataAsset_SkillGraph_C_GetNodesInsideBox::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_SkillGraph_C_GetNodesInsideBox, CallFunc_Array_Get_Item) == 0x0000B8, "Member 'BP_DataAsset_SkillGraph_C_GetNodesInsideBox::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_SkillGraph_C_GetNodesInsideBox, CallFunc_Less_IntInt_ReturnValue) == 0x0000F0, "Member 'BP_DataAsset_SkillGraph_C_GetNodesInsideBox::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_SkillGraph_C_GetNodesInsideBox, CallFunc_Array_Add_ReturnValue) == 0x0000F4, "Member 'BP_DataAsset_SkillGraph_C_GetNodesInsideBox::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_SkillGraph_C_GetNodesInsideBox, CallFunc_BreakVector2D_X_2) == 0x0000F8, "Member 'BP_DataAsset_SkillGraph_C_GetNodesInsideBox::CallFunc_BreakVector2D_X_2' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_SkillGraph_C_GetNodesInsideBox, CallFunc_BreakVector2D_Y_2) == 0x000100, "Member 'BP_DataAsset_SkillGraph_C_GetNodesInsideBox::CallFunc_BreakVector2D_Y_2' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_SkillGraph_C_GetNodesInsideBox, CallFunc_InRange_FloatFloat_ReturnValue) == 0x000108, "Member 'BP_DataAsset_SkillGraph_C_GetNodesInsideBox::CallFunc_InRange_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_SkillGraph_C_GetNodesInsideBox, CallFunc_InRange_FloatFloat_ReturnValue_1) == 0x000109, "Member 'BP_DataAsset_SkillGraph_C_GetNodesInsideBox::CallFunc_InRange_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_SkillGraph_C_GetNodesInsideBox, CallFunc_BooleanAND_ReturnValue) == 0x00010A, "Member 'BP_DataAsset_SkillGraph_C_GetNodesInsideBox::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BP_DataAsset_SkillGraph.BP_DataAsset_SkillGraph_C.GetSkillNodePointUnlockCost
// 0x0030 (0x0030 - 0x0000)
struct BP_DataAsset_SkillGraph_C_GetSkillNodePointUnlockCost final
{
public:
	struct FFSkillUnlockData                      FSkillUnlockData;                                  // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	int32                                         UnlockCost;                                        // 0x0028(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DataAsset_SkillGraph_C_GetSkillNodePointUnlockCost) == 0x000008, "Wrong alignment on BP_DataAsset_SkillGraph_C_GetSkillNodePointUnlockCost");
static_assert(sizeof(BP_DataAsset_SkillGraph_C_GetSkillNodePointUnlockCost) == 0x000030, "Wrong size on BP_DataAsset_SkillGraph_C_GetSkillNodePointUnlockCost");
static_assert(offsetof(BP_DataAsset_SkillGraph_C_GetSkillNodePointUnlockCost, FSkillUnlockData) == 0x000000, "Member 'BP_DataAsset_SkillGraph_C_GetSkillNodePointUnlockCost::FSkillUnlockData' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_SkillGraph_C_GetSkillNodePointUnlockCost, UnlockCost) == 0x000028, "Member 'BP_DataAsset_SkillGraph_C_GetSkillNodePointUnlockCost::UnlockCost' has a wrong offset!");

// Function BP_DataAsset_SkillGraph.BP_DataAsset_SkillGraph_C.GetSkillPointUnlockCost
// 0x0130 (0x0130 - 0x0000)
struct BP_DataAsset_SkillGraph_C_GetSkillPointUnlockCost final
{
public:
	class UBP_DataAsset_Skill_C*                  Skill;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         UnlockCost;                                        // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_ObjectToText_ReturnValue;            // 0x0010(0x0010)()
	bool                                          CallFunc_FindSkillNode_Found;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFSkillGraphNode                       CallFunc_FindSkillNode_Node;                       // 0x0028(0x0038)(NoDestructor, HasGetValueTypeHash)
