#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DialogueSystemComponent

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "EDialogueCameraType_structs.hpp"
#include "S_Dialogue_EndParameters_structs.hpp"
#include "S_DialogueCameraParameters_structs.hpp"
#include "E_Dialogue_CameraMovements_structs.hpp"
#include "Engine_structs.hpp"
#include "E_jRPG_ItemType_structs.hpp"
#include "S_LootDialogue_structs.hpp"
#include "E_CharacterList_structs.hpp"
#include "S_DialogueParameters_structs.hpp"
#include "GameplayCameras_structs.hpp"
#include "S_GameFlowTransitionRequest_structs.hpp"
#include "S_CharacterSelectorParameters_structs.hpp"
#include "S_DialogueQueueElement_structs.hpp"
#include "E_Expressions_Metahuman_structs.hpp"
#include "E_NPC_Body_IdleType_structs.hpp"
#include "FRichDialogueLine_structs.hpp"
#include "S_Dialogue_AnimationParameters_structs.hpp"
#include "FBattleStartParams_structs.hpp"
#include "S_Dialogue_CustomOptions_structs.hpp"
#include "E_CanInterruptDialogue_structs.hpp"


namespace SDK::Params
{

// Function BP_DialogueSystemComponent.BP_DialogueSystemComponent_C.ActionPlayAnimation
// 0x01A8 (0x01A8 - 0x0000)
struct BP_DialogueSystemComponent_C_ActionPlayAnimation final
{
public:
	class UBP_DataAsset_DialogueCharacter_C*      Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FS_Dialogue_AnimationParameters        AnimationParameters;                               // 0x0008(0x00C8)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)
	class AActor*                                 local_TargetActor;                                 // 0x00D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class UBP_NPCAnimationComponent_C*            local_NPC_AnimationComponent;                      // 0x00D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FS_Dialogue_AnimationParameters        local_AnimationParameters;                         // 0x00E0(0x00C8)(Edit, BlueprintVisible, HasGetValueTypeHash)
};
static_assert(alignof(BP_DialogueSystemComponent_C_ActionPlayAnimation) == 0x000008, "Wrong alignment on BP_DialogueSystemComponent_C_ActionPlayAnimation");
static_assert(sizeof(BP_DialogueSystemComponent_C_ActionPlayAnimation) == 0x0001A8, "Wrong size on BP_DialogueSystemComponent_C_ActionPlayAnimation");
static_assert(offsetof(BP_DialogueSystemComponent_C_ActionPlayAnimation, Character) == 0x000000, "Member 'BP_DialogueSystemComponent_C_ActionPlayAnimation::Character' has a wrong offset!");
static_assert(offsetof(BP_DialogueSystemComponent_C_ActionPlayAnimation, AnimationParameters) == 0x000008, "Member 'BP_DialogueSystemComponent_C_ActionPlayAnimation::AnimationParameters' has a wrong offset!");
static_assert(offsetof(BP_DialogueSystemComponent_C_ActionPlayAnimation, local_TargetActor) == 0x0000D0, "Member 'BP_DialogueSystemComponent_C_ActionPlayAnimation::local_TargetActor' has a wrong offset!");
static_assert(offsetof(BP_DialogueSystemComponent_C_ActionPlayAnimation, local_NPC_AnimationComponent) == 0x0000D8, "Member 'BP_DialogueSystemComponent_C_ActionPlayAnimation::local_NPC_AnimationComponent' has a wrong offset!");
static_assert(offsetof(BP_DialogueSystemComponent_C_ActionPlayAnimation, local_AnimationParameters) == 0x0000E0, "Member 'BP_DialogueSystemComponent_C_ActionPlayAnimation::local_AnimationParameters' has a wrong offset!");

// Function BP_DialogueSystemComponent.BP_DialogueSystemComponent_C.ActionShowVendor
// 0x0060 (0x0060 - 0x0000)
struct BP_DialogueSystemComponent_C_ActionShowVendor final
{
public:
	class FText                                   Greeting;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
	TSet<class FName>                             VendorItems;                                       // 0x0010(0x0050)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(BP_DialogueSystemComponent_C_ActionShowVendor) == 0x000008, "Wrong alignment on BP_DialogueSystemComponent_C_ActionShowVendor");
static_assert(sizeof(BP_DialogueSystemComponent_C_ActionShowVendor) == 0x000060, "Wrong size on BP_DialogueSystemComponent_C_ActionShowVendor");
static_assert(offsetof(BP_DialogueSystemComponent_C_ActionShowVendor, Greeting) == 0x000000, "Member 'BP_DialogueSystemComponent_C_ActionShowVendor::Greeting' has a wrong offset!");
static_assert(offsetof(BP_DialogueSystemComponent_C_ActionShowVendor, VendorItems) == 0x000010, "Member 'BP_DialogueSystemComponent_C_ActionShowVendor::VendorItems' has a wrong offset!");

// Function BP_DialogueSystemComponent.BP_DialogueSystemComponent_C.ActionStartBattle
// 0x0160 (0x0160 - 0x0000)
struct BP_DialogueSystemComponent_C_ActionStartBattle final
{
public:
	struct FFBattleStartParams                    BattleStartParams;                                 // 0x0000(0x0158)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference, HasGetValueTypeHash)
	class UAC_jRPG_BattleManager_C*               CallFunc_GetBattleManager_ReturnValue;             // 0x0158(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DialogueSystemComponent_C_ActionStartBattle) == 0x000008, "Wrong alignment on BP_DialogueSystemComponent_C_ActionStartBattle");
static_assert(sizeof(BP_DialogueSystemComponent_C_ActionStartBattle) == 0x000160, "Wrong size on BP_DialogueSystemComponent_C_ActionStartBattle");
static_assert(offsetof(BP_DialogueSystemComponent_C_ActionStartBattle, BattleStartParams) == 0x000000, "Member 'BP_DialogueSystemComponent_C_ActionStartBattle::BattleStartParams' has a wrong offset!");
static_assert(offsetof(BP_DialogueSystemComponent_C_ActionStartBattle, CallFunc_GetBattleManager_ReturnValue) == 0x000158, "Member 'BP_DialogueSystemComponent_C_ActionStartBattle::CallFunc_GetBattleManager_ReturnValue' has a wrong offset!");

// Function BP_DialogueSystemComponent.BP_DialogueSystemComponent_C.ActivateCameraComponentByType
// 0x00E8 (0x00E8 - 0x0000)
struct BP_DialogueSystemComponent_C_ActivateCameraComponentByType final
{
public:
	EDialogueCameraType                           CameraType;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_DialogueCameraParameters            Parameters;                                        // 0x0008(0x0038)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	class UCameraComponent*                       CallFunc_GetCurrentCameraOfType_CameraComponent;   // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0070(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0080(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00C8(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Format_ReturnValue;                       // 0x00D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DialogueSystemComponent_C_ActivateCameraComponentByType) == 0x000008, "Wrong alignment on BP_DialogueSystemComponent_C_ActivateCameraComponentByType");
static_assert(sizeof(BP_DialogueSystemComponent_C_ActivateCameraComponentByType) == 0x0000E8, "Wrong size on BP_DialogueSystemComponent_C_ActivateCameraComponentByType");
static_assert(offsetof(BP_DialogueSystemComponent_C_ActivateCameraComponentByType, CameraType) == 0x000000, "Member 'BP_DialogueSystemComponent_C_ActivateCameraComponentByType::CameraType' has a wrong offset!");
static_assert(offsetof(BP_DialogueSystemComponent_C_ActivateCameraComponentByType, Parameters) == 0x000008, "Member 'BP_DialogueSystemComponent_C_ActivateCameraComponentByType::Parameters' has a wrong offset!");
static_assert(offsetof(BP_DialogueSystemComponent_C_ActivateCameraComponentByType, CallFunc_GetCurrentCameraOfType_CameraComponent) == 0x000040, "Member 'BP_DialogueSystemComponent_C_ActivateCameraComponentByType::CallFunc_GetCurrentCameraOfType_CameraComponent' has a wrong offset!");
static_assert(offsetof(BP_DialogueSystemComponent_C_ActivateCameraComponentByType, CallFunc_GetOwner_ReturnValue) == 0x000048, "Member 'BP_DialogueSystemComponent_C_ActivateCameraComponentByType::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DialogueSystemComponent_C_ActivateCameraComponentByType, CallFunc_IsValid_ReturnValue) == 0x000050, "Member 'BP_DialogueSystemComponent_C_ActivateCameraComponentByType::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DialogueSystemComponent_C_ActivateCameraComponentByType, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x000058, "Member 'BP_DialogueSystemComponent_C_ActivateCameraComponentByType::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DialogueSystemComponent_C_ActivateCameraComponentByType, CallFunc_GetPlayerController_ReturnValue) == 0x000068, "Member 'BP_DialogueSystemComponent_C_ActivateCameraComponentByType::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DialogueSystemComponent_C_ActivateCameraComponentByType, CallFunc_Conv_StringToText_ReturnValue) == 0x000070, "Member 'BP_DialogueSystemComponent_C_ActivateCameraComponentByType::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DialogueSystemComponent_C_ActivateCameraComponentByType, K2Node_MakeStruct_FormatArgumentData) == 0x000080, "Member 'BP_DialogueSystemComponent_C_ActivateCameraComponentByType::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_DialogueSystemComponent_C_ActivateCameraComponentByType, K2Node_MakeArray_Array) == 0x0000C8, "Member 'BP_DialogueSystemComponent_C_ActivateCameraComponentByType::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_DialogueSystemComponent_C_ActivateCameraComponentByType, CallFunc_Format_ReturnValue) == 0x0000D8, "Member 'BP_DialogueSystemComponent_C_ActivateCameraComponentByType::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function BP_DialogueSystemComponent.BP_DialogueSystemComponent_C.ActivateDialogue
// 0x0020 (0x0020 - 0x0000)
struct BP_DialogueSystemComponent_C_ActivateDialogue final
{
public:
	class ABP_Dialogue_C*                         Dialogue;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldUseDialogCameras_ReturnValue;       // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_InteractiveMusicSystem_C*           CallFunc_GetInteractiveMusicSystem_InteractiveMusicSystem; // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DialogueSystemComponent_C_ActivateDialogue) == 0x000008, "Wrong alignment on BP_DialogueSystemComponent_C_ActivateDialogue");
static_assert(sizeof(BP_DialogueSystemComponent_C_ActivateDialogue) == 0x000020, "Wrong size on BP_DialogueSystemComponent_C_ActivateDialogue");
static_assert(offsetof(BP_DialogueSystemComponent_C_ActivateDialogue, Dialogue) == 0x000000, "Member 'BP_DialogueSystemComponent_C_ActivateDialogue::Dialogue' has a wrong offset!");
static_assert(offsetof(BP_DialogueSystemComponent_C_ActivateDialogue, CallFunc_ShouldUseDialogCameras_ReturnValue) == 0x000008, "Member 'BP_DialogueSystemComponent_C_ActivateDialogue::CallFunc_ShouldUseDialogCameras_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DialogueSystemComponent_C_ActivateDialogue, CallFunc_IsValid_ReturnValue) == 0x000009, "Member 'BP_DialogueSystemComponent_C_ActivateDialogue::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DialogueSystemComponent_C_ActivateDialogue, CallFunc_GetInteractiveMusicSystem_InteractiveMusicSystem) == 0x000010, "Member 'BP_DialogueSystemComponent_C_ActivateDialogue::CallFunc_GetInteractiveMusicSystem_InteractiveMusicSystem' has a wrong offset!");
static_assert(offsetof(BP_DialogueSystemComponent_C_ActivateDialogue, CallFunc_IsValid_ReturnValue_1) == 0x000018, "Member 'BP_DialogueSystemComponent_C_ActivateDialogue::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DialogueSystemComponent_C_ActivateDialogue, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000019, "Member 'BP_DialogueSystemComponent_C_ActivateDialogue::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");

// Function BP_DialogueSystemComponent.BP_DialogueSystemComponent_C.AddGenderContextToText
// 0x0090 (0x0090 - 0x0000)
struct BP_DialogueSystemComponent_C_AddGenderContextToText final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   EnrichedText;                                      // 0x0010(0x0010)(Parm, OutParm)
	ETextGender                                   CallFunc_GetActivePlayerCharacterGender_GenderTag; // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0028(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0070(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0080(0x0010)()
};
static_assert(alignof(BP_DialogueSystemComponent_C_AddGenderContextToText) == 0x000008, "Wrong alignment on BP_DialogueSystemComponent_C_AddGenderContextToText");
static_assert(sizeof(BP_DialogueSystemComponent_C_AddGenderContextToText) == 0x000090, "Wrong size on BP_DialogueSystemComponent_C_AddGenderContextToText");
static_assert(offsetof(BP_DialogueSystemComponent_C_AddGenderContextToText, Text) == 0x000000, "Member 'BP_DialogueSystemComponent_C_AddGenderContextToText::Text' has a wrong offset!");
static_assert(offsetof(BP_DialogueSystemComponent_C_AddGenderContextToText, EnrichedText) == 0x000010, "Member 'BP_DialogueSystemComponent_C_AddGenderContextToText::EnrichedText' has a wrong offset!");
static_assert(offsetof(BP_DialogueSystemComponent_C_AddGenderContextToText, CallFunc_GetActivePlayerCharacterGender_GenderTag) == 0x000020, "Member 'BP_DialogueSystemComponent_C_AddGenderContextToText::CallFunc_GetActivePlayerCharacterGender_GenderTag' has a wrong offset!");
static_assert(offsetof(BP_DialogueSystemComponent_C_AddGenderContextToText, K2Node_MakeStruct_FormatArgumentData) == 0x000028, "Member 'BP_DialogueSystemComponent_C_AddGenderContextToText::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_DialogueSystemComponent_C_AddGenderContextToText, K2Node_MakeArray_Array) == 0x000070, "Member 'BP_DialogueSystemComponent_C_AddGenderContextToText::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_DialogueSystemComponent_C_AddGenderContextToText, CallFunc_Format_ReturnValue) == 0x000080, "Member 'BP_DialogueSystemComponent_C_AddGenderContextToText::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function BP_DialogueSystemComponent.BP_DialogueSystemComponent_C.ApplyCamera
// 0x0048 (0x0048 - 0x0000)
struct BP_DialogueSystemComponent_C_ApplyCamera final
{
public:
	EDialogueCameraType                           CameraType;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_DialogueCameraParameters            Parameters;                                        // 0x0008(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldApplyCamera_ReturnValue;            // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DialogueSystemComponent_C_ApplyCamera) == 0x000008, "Wrong alignment on BP_DialogueSystemComponent_C_ApplyCamera");
static_assert(sizeof(BP_DialogueSystemComponent_C_ApplyCamera) == 0x000048, "Wrong size on BP_DialogueSystemComponent_C_ApplyCamera");
static_assert(offsetof(BP_DialogueSystemComponent_C_ApplyCamera, CameraType) == 0x000000, "Member 'BP_DialogueSystemComponent_C_ApplyCamera::CameraType' has a wrong offset!");
static_assert(offsetof(BP_DialogueSystemComponent_C_ApplyCamera, Parameters) == 0x000008, "Member 'BP_DialogueSystemComponent_C_ApplyCamera::Parameters' has a wrong offset!");
static_assert(offsetof(BP_DialogueSystemComponent_C_ApplyCamera, CallFunc_ShouldApplyCamera_ReturnValue) == 0x000040, "Member 'BP_DialogueSystemComponent_C_ApplyCamera::CallFunc_ShouldApplyCamera_ReturnValue' has a wrong offset!");

// Function BP_DialogueSystemComponent.BP_DialogueSystemComponent_C.AreLootItemUsersCompatible
// 0x0050 (0x0050 - 0x0000)
struct BP_DialogueSystemComponent_C_AreLootItemUsersCompatible final
{
public:
	class UBP_GeneratedItemInfo_Base_C*           GeneratedItemInfo;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FS_LootDialogue                        LootDialogue;                                      // 0x0008(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0030(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_CharacterList                               CallFunc_Array_Get_Item;                           // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasCharacterInCollection_Result;          // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E[0x2];                                       // 0x003E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_46[0x2];                                       // 0x0046(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DialogueSystemComponent_C_AreLootItemUsersCompatible) == 0x000008, "Wrong alignment on BP_DialogueSystemComponent_C_AreLootItemUsersCompatible");
static_assert(sizeof(BP_DialogueSystemComponent_C_AreLootItemUsersCompatible) == 0x000050, "Wrong size on BP_DialogueSystemComponent_C_AreLootItemUsersCompatible");
static_assert(offsetof(BP_DialogueSystemComponent_C_AreLootItemUsersCompatible, GeneratedItemInfo) == 0x000000, "Member 'BP_DialogueSystemComponent_C_AreLootItemUsersCompatible::GeneratedItemInfo' has a wrong offset!");
static_assert(offsetof(BP_DialogueSystemComponent_C_AreLootItemUsersCompatible, LootDialogue) == 0x000008, "Member 'BP_DialogueSystemComponent_C_AreLootItemUsersCompatible::LootDialogue' has a wrong offset!");
static_assert(offsetof(BP_DialogueSystemComponent_C_AreLootItemUsersCompatible, ReturnValue) == 0x000030, "Member 'BP_DialogueSystemComponent_C_AreLootItemUsersCompatible::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DialogueSystemComponent_C_AreLootItemUsersCompatible, Temp_int_Array_Index_Variable) == 0x000034, "Member 'BP_DialogueSystemComponent_C_AreLootItemUsersCompatible::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_DialogueSystemComponent_C_AreLootItemUsersCompatible, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'BP_DialogueSystemComponent_C_AreLootItemUsersCompatible::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DialogueSystemComponent_C_AreLootItemUsersCompatible, CallFunc_Array_Get_Item) == 0x00003C, "Member 'BP_DialogueSystemComponent_C_AreLootItemUsersCompatible::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_DialogueSystemComponent_C_AreLootItemUsersCompatible, CallFunc_HasCharacterInCollection_Result) == 0x00003D, "Member 'BP_DialogueSystemComponent_C_AreLootItemUsersCompatible::CallFunc_HasCharacterInCollection_Result' has a wrong offset!");
static_assert(offsetof(BP_DialogueSystemComponent_C_AreLootItemUsersCompatible, Temp_int_Loop_Counter_Variable) == 0x000040, "Member 'BP_DialogueSystemComponent_C_AreLootItemUsersCompatible::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_DialogueSystemComponent_C_AreLootItemUsersCompatible, CallFunc_Not_PreBool_ReturnValue) == 0x000044, "Member 'BP_DialogueSystemComponent_C_AreLootItemUsersCompatible::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DialogueSystemComponent_C_AreLootItemUsersCompatible, CallFunc_Less_IntInt_ReturnValue) == 0x000045, "Member 'BP_DialogueSystemComponent_C_AreLootItemUsersCompatible::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DialogueSystemComponent_C_AreLootItemUsersCompatible, CallFunc_Add_IntInt_ReturnValue) == 0x000048, "Member 'BP_DialogueSystemComponent_C_AreLootItemUsersCompatible::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function BP_DialogueSystemComponent.BP_DialogueSystemComponent_C.CloseCharacterSelectionWindow
// 0x0010 (0x0010 - 0x0000)
struct BP_DialogueSystemComponent_C_CloseCharacterSelectionWindow final
{
public:
	TArray<class UBP_CharacterData_C*>            CharacterDatas;                                    // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(BP_DialogueSystemComponent_C_CloseCharacterSelectionWindow) == 0x000008, "Wrong alignment on BP_DialogueSystemComponent_C_CloseCharacterSelectionWindow");
static_assert(sizeof(BP_DialogueSystemComponent_C_CloseCharacterSelectionWindow) == 0x000010, "Wrong size on BP_DialogueSystemComponent_C_CloseCharacterSelectionWindow");
static_assert(offsetof(BP_DialogueSystemComponent_C_CloseCharacterSelectionWindow, CharacterDatas) == 0x000000, "Member 'BP_DialogueSystemComponent_C_CloseCharacterSelectionWindow::CharacterDatas' has a wrong offset!");

// Function BP_DialogueSystemComponent.BP_DialogueSystemComponent_C.DeactivatePreviousCameraComponents
// 0x0028 (0x0028 - 0x0000)
struct BP_DialogueSystemComponent_C_DeactivatePreviousCameraComponents final
{
public:
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_jRPG_Character_World_C*             K2Node_DynamicCast_AsBP_J_RPG_Character_World;     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCameraComponent*                       CallFunc_GetMainCamera_MainCamera;                 // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DialogueSystemComponent_C_DeactivatePreviousCameraComponents) == 0x000008, "Wrong alignment on BP_DialogueSystemComponent_C_DeactivatePreviousCameraComponents");
static_assert(sizeof(BP_DialogueSystemComponent_C_DeactivatePreviousCameraComponents) == 0x000028, "Wrong size on BP_DialogueSystemComponent_C_DeactivatePreviousCameraComponents");
static_assert(offsetof(BP_DialogueSystemComponent_C_DeactivatePreviousCameraComponents, CallFunc_GetPlayerPawn_ReturnValue) == 0x000000, "Member 'BP_DialogueSystemComponent_C_DeactivatePreviousCameraComponents::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DialogueSystemComponent_C_DeactivatePreviousCameraComponents, K2Node_DynamicCast_AsBP_J_RPG_Character_World) == 0x000008, "Member 'BP_DialogueSystemComponent_C_DeactivatePreviousCameraComponents::K2Node_DynamicCast_AsBP_J_RPG_Character_World' has a wrong offset!");
static_assert(offsetof(BP_DialogueSystemComponent_C_DeactivatePreviousCameraComponents, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'BP_DialogueSystemComponent_C_DeactivatePreviousCameraComponents::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_DialogueSystemComponent_C_DeactivatePreviousCameraComponents, CallFunc_GetMainCamera_MainCamera) == 0x000018, "Member 'BP_DialogueSystemComponent_C_DeactivatePreviousCameraComponents::CallFunc_GetMainCamera_MainCamera' has a wrong offset!");
static_assert(offsetof(BP_DialogueSystemComponent_C_DeactivatePreviousCameraComponents, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'BP_DialogueSystemComponent_C_DeactivatePreviousCameraComponents::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_DialogueSystemComponent.BP_DialogueSystemComponent_C.DelayUntilMainCharacterStopsTalking
// 0x0004 (0x0004 - 0x0000)
struct BP_DialogueSystemComponent_C_DelayUntilMainCharacterStopsTalking final
{
public:
	float                                         Duration;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DialogueSystemComponent_C_DelayUntilMainCharacterStopsTalking) == 0x000004, "Wrong alignment on BP_DialogueSystemComponent_C_DelayUntilMainCharacterStopsTalking");
static_assert(sizeof(BP_DialogueSystemComponent_C_DelayUntilMainCharacterStopsTalking) == 0x000004, "Wrong size on BP_DialogueSystemComponent_C_DelayUntilMainCharacterStopsTalking");
static_assert(offsetof(BP_DialogueSystemComponent_C_DelayUntilMainCharacterStopsTalking, Duration) == 0x000000, "Member 'BP_DialogueSystemComponent_C_DelayUntilMainCharacterStopsTalking::Duration' has a wrong offset!");

// Function BP_DialogueSystemComponent.BP_DialogueSystemComponent_C.DelayUntilStopTalking
// 0x0008 (0x0008 - 0x0000)
struct BP_DialogueSystemComponent_C_DelayUntilStopTalking final
{
public:
	double                                        Duration;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DialogueSystemComponent_C_DelayUntilStopTalking) == 0x000008, "Wrong alignment on BP_DialogueSystemComponent_C_DelayUntilStopTalking");
static_assert(sizeof(BP_DialogueSystemComponent_C_DelayUntilStopTalking) == 0x000008, "Wrong size on BP_DialogueSystemComponent_C_DelayUntilStopTalking");
static_assert(offsetof(BP_DialogueSystemComponent_C_DelayUntilStopTalking, Duration) == 0x000000, "Member 'BP_DialogueSystemComponent_C_DelayUntilStopTalking::Duration' has a wrong offset!");

// Function BP_DialogueSystemComponent.BP_DialogueSystemComponent_C.DisplayRelationshipLevelIncreased
// 0x0001 (0x0001 - 0x0000)
struct BP_DialogueSystemComponent_C_DisplayRelationshipLevelIncreased final
{
public:
	E_CharacterList                               Character;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DialogueSystemComponent_C_DisplayRelationshipLevelIncreased) == 0x000001, "Wrong alignment on BP_DialogueSystemComponent_C_DisplayRelationshipLevelIncreased");
static_assert(sizeof(BP_DialogueSystemComponent_C_DisplayRelationshipLevelIncreased) == 0x000001, "Wrong size on BP_DialogueSystemComponent_C_DisplayRelationshipLevelIncreased");
static_assert(offsetof(BP_DialogueSystemComponent_C_DisplayRelationshipLevelIncreased, Character) == 0x000000, "Member 'BP_DialogueSystemComponent_C_DisplayRelationshipLevelIncreased::Character' has a wrong offset!");

// Function BP_DialogueSystemComponent.BP_DialogueSystemComponent_C.EndDialogue
// 0x0090 (0x0090 - 0x0000)
struct BP_DialogueSystemComponent_C_EndDialogue final
{
public:
	class ABP_Dialogue_C*                         Dialog;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FS_Dialogue_EndParameters              Parameters;                                        // 0x0008(0x0002)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UWBP_GM_PromptGeneric_C* PromptWidget)> K2Node_CreateDelegate_OutputDelegate; // 0x0018(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldUseDialogCameras_ReturnValue;       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UWBP_GM_PromptGeneric_C* PromptWidget)> K2Node_CreateDelegate_OutputDelegate_1; // 0x002C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_InteractiveMusicSystem_C*           CallFunc_GetInteractiveMusicSystem_InteractiveMusicSystem; // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGameplayCamerasSubsystem*              CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_jRPG_Character_World_C*             K2Node_DynamicCast_AsBP_J_RPG_Character_World;     // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCameraComponent*                       CallFunc_GetMainCamera_MainCamera;                 // 0x0080(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetViewTargetWithBlend_BlendTime_ImplicitCast; // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DialogueSystemComponent_C_EndDialogue) == 0x000008, "Wrong alignment on BP_DialogueSystemComponent_C_EndDialogue");
static_assert(sizeof(BP_DialogueSystemComponent_C_EndDialogue) == 0x000090, "Wrong size on BP_DialogueSystemComponent_C_EndDialogue");
static_assert(offsetof(BP_DialogueSystemComponent_C_EndDialogue, Dialog) == 0x000000, "Member 'BP_DialogueSystemComponent_C_EndDialogue::Dialog' has a wrong offset!");
static_assert(offsetof(BP_DialogueSystemComponent_C_EndDialogue, Parameters) == 0x000008, "Member 'BP_DialogueSystemComponent_C_EndDialogue::Parameters' has a wrong offset!");
static_assert(offsetof(BP_DialogueSystemComponent_C_EndDialogue, CallFunc_SelectFloat_ReturnValue) == 0x000010, "Member 'BP_DialogueSystemComponent_C_EndDialogue::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DialogueSystemComponent_C_EndDialogue, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'BP_DialogueSystemComponent_C_EndDialogue::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_DialogueSystemComponent_C_EndDialogue, CallFunc_ShouldUseDialogCameras_ReturnValue) == 0x000028, "Member 'BP_DialogueSystemComponent_C_EndDialogue::CallFunc_ShouldUseDialogCameras_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DialogueSystemComponent_C_EndDialogue, K2Node_CreateDelegate_OutputDelegate_1) == 0x00002C, "Member 'BP_DialogueSystemComponent_C_EndDialogue::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_DialogueSystemComponent_C_EndDialogue, CallFunc_GetPlayerController_ReturnValue) == 0x000040, "Member 'BP_DialogueSystemComponent_C_EndDialogue::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DialogueSystemComponent_C_EndDialogue, CallFunc_GetInteractiveMusicSystem_InteractiveMusicSystem) == 0x000048, "Member 'BP_DialogueSystemComponent_C_EndDialogue::CallFunc_GetInteractiveMusicSystem_InteractiveMusicSystem' has a wrong offset!");
static_assert(offsetof(BP_DialogueSystemComponent_C_EndDialogue, CallFunc_GetWorldSubsystem_ReturnValue) == 0x000050, "Member 'BP_DialogueSystemComponent_C_EndDialogue::CallFunc_GetWorldSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DialogueSystemComponent_C_EndDialogue, CallFunc_IsValid_ReturnValue) == 0x000058, "Member 'BP_DialogueSystemComponent_C_EndDialogue::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DialogueSystemComponent_C_EndDialogue, CallFunc_GetPlayerController_ReturnValue_1) == 0x000060, "Member 'BP_DialogueSystemComponent_C_EndDialogue::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DialogueSystemComponent_C_EndDialogue, CallFunc_GetPlayerPawn_ReturnValue) == 0x000068, "Member 'BP_DialogueSystemComponent_C_EndDialogue::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DialogueSystemComponent_C_EndDialogue, K2Node_DynamicCast_AsBP_J_RPG_Character_World) == 0x000070, "Member 'BP_DialogueSystemComponent_C_EndDialogue::K2Node_DynamicCast_AsBP_J_RPG_Character_World' has a wrong offset!");
static_assert(offsetof(BP_DialogueSystemComponent_C_EndDialogue, K2Node_DynamicCast_bSuccess) == 0x000078, "Member 'BP_DialogueSystemComponent_C_EndDialogue::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_DialogueSystemComponent_C_EndDialogue, CallFunc_GetMainCamera_MainCamera) == 0x000080, "Member 'BP_DialogueSystemComponent_C_EndDialogue::CallFunc_GetMainCamera_MainCamera' has a wrong offset!");
static_assert(offsetof(BP_DialogueSystemComponent_C_EndDialogue, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000088, "Member 'BP_DialogueSystemComponent_C_EndDialogue::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DialogueSystemComponent_C_EndDialogue, CallFunc_SetViewTargetWithBlend_BlendTime_ImplicitCast) == 0x00008C, "Member 'BP_DialogueSystemComponent_C_EndDialogue::CallFunc_SetViewTargetWithBlend_BlendTime_ImplicitCast' has a wrong offset!");

// Function BP_DialogueSystemComponent.BP_DialogueSystemComponent_C.ExecuteAudioTrigger
// 0x0048 (0x0048 - 0x0000)
struct BP_DialogueSystemComponent_C_ExecuteAudioTrigger final
{
public:
	class FName                                   AudioTriggerName;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Actor;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_DialogueCharacter_C> K2Node_DynamicCast_AsBPI_Dialogue_Character;    // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_BPI_GetDialogueAudioComponent_AudioComponent; // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IAudioParameterControllerInterface> CallFunc_SetTriggerParameter_self_CastInput; // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DialogueSystemComponent_C_ExecuteAudioTrigger) == 0x000008, "Wrong alignment on BP_DialogueSystemComponent_C_ExecuteAudioTrigger");
static_assert(sizeof(BP_DialogueSystemComponent_C_ExecuteAudioTrigger) == 0x000048, "Wrong size on BP_DialogueSystemComponent_C_ExecuteAudioTrigger");
static_assert(offsetof(BP_DialogueSystemComponent_C_ExecuteAudioTrigger, AudioTriggerName) == 0x000000, "Member 'BP_DialogueSystemComponent_C_ExecuteAudioTrigger::AudioTriggerName' has a wrong offset!");
static_assert(offsetof(BP_DialogueSystemComponent_C_ExecuteAudioTrigger, Actor) == 0x000008, "Member 'BP_DialogueSystemComponent_C_ExecuteAudioTrigger::Actor' has a wrong offset!");
static_assert(offsetof(BP_DialogueSystemComponent_C_ExecuteAudioTrigger, K2Node_DynamicCast_AsBPI_Dialogue_Character) == 0x000010, "Member 'BP_DialogueSystemComponent_C_ExecuteAudioTrigger::K2Node_DynamicCast_AsBPI_Dialogue_Character' has a wrong offset!");
static_assert(offsetof(BP_DialogueSystemComponent_C_ExecuteAudioTrigger, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_DialogueSystemComponent_C_ExecuteAudioTrigger::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_DialogueSystemComponent_C_ExecuteAudioTrigger, CallFunc_BPI_GetDialogueAudioComponent_AudioComponent) == 0x000028, "Member 'BP_DialogueSystemComponent_C_ExecuteAudioTrigger::CallFunc_BPI_GetDialogueAudioComponent_AudioComponent' has a wrong offset!");
static_assert(offsetof(BP_DialogueSystemComponent_C_ExecuteAudioTrigger, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'BP_DialogueSystemComponent_C_ExecuteAudioTrigger::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DialogueSystemComponent_C_ExecuteAudioTrigger, CallFunc_SetTriggerParameter_self_CastInput) == 0x000038, "Member 'BP_DialogueSystemComponent_C_ExecuteAudioTrigger::CallFunc_SetTriggerParameter_self_CastInput' has a wrong offset!");

// Function BP_DialogueSystemComponent.BP_DialogueSystemComponent_C.ExecuteUbergraph_BP_DialogueSystemComponent
// 0x0158 (0x0158 - 0x0000)
struct BP_DialogueSystemComponent_C_ExecuteUbergraph_BP_DialogueSystemComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UBP_DA_IWD_data_C>       K2Node_CustomEvent_IWDRef;                         // 0x0008(0x0028)(HasGetValueTypeHash)
	TDelegate<void(bool Victory)>                 K2Node_CreateDelegate_OutputDelegate;              // 0x0030(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0040(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UWBP_GM_PromptGeneric_C* PromptWidget)> K2Node_CreateDelegate_OutputDelegate_2; // 0x0050(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UWBP_GM_PromptGeneric_C* PromptWidget)> K2Node_CreateDelegate_OutputDelegate_3; // 0x0060(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x0070(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable;                              // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_DA_IWD_data_C*                      K2Node_DynamicCast_AsBP_DA_IWD_Data;               // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_PlayInWorldDialogue_DialogueNotPlayed;    // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9A[0x6];                                       // 0x009A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	const class UBP_UINavigationFocusEvent_C*     K2Node_Event_FocusEventBP;                         // 0x00A0(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Array_Random_OutItem;                     // 0x00A8(0x0010)()
	int32                                         CallFunc_Array_Random_OutIndex;                    // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAC_jRPG_BattleManager_C*               CallFunc_GetBattleManager_ReturnValue;             // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Victory;                        // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAC_jRPG_BattleManager_C*               CallFunc_GetBattleManager_ReturnValue_1;           // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_jRPG_Controller_World_C*            K2Node_DynamicCast_AsBP_J_RPG_Controller_World;    // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_DialogueOverlay_C*                 K2Node_CustomEvent_DialogueUI;                     // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_Duration_1;                     // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DoubleDouble_ReturnValue;      // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0108(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Duration;                       // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_GM_PromptGeneric_C*                K2Node_CustomEvent_PromptWidget_1;                 // 0x0120(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ABP_jRPG_Character_World_C*             K2Node_DynamicCast_AsBP_J_RPG_Character_World;     // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_GM_PromptGeneric_C*                K2Node_CustomEvent_PromptWidget;                   // 0x0138(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_5;            // 0x0144(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_SetTimerDelegate_Time_ImplicitCast;    // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DialogueSystemComponent_C_ExecuteUbergraph_BP_DialogueSystemComponent) == 0x000008, "Wrong alignment on BP_DialogueSystemComponent_C_ExecuteUbergraph_BP_DialogueSystemComponent");
static_assert(sizeof(BP_DialogueSystemComponent_C_ExecuteUbergraph_BP_DialogueSystemComponent) == 0x000158, "Wrong size on BP_DialogueSystemComponent_C_ExecuteUbergraph_BP_DialogueSystemComponent");
static_assert(offsetof(BP_DialogueSystemComponent_C_ExecuteUbergraph_BP_DialogueSystemComponent, EntryPoint) == 0x000000, "Member 'BP_DialogueSystemComponent_C_ExecuteUbergraph_BP_DialogueSystemComponent::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_DialogueSystemComponent_C_ExecuteUbergraph_BP_DialogueSystemComponent, K2Node_CustomEvent_IWDRef) == 0x000008, "Member 'BP_DialogueSystemComponent_C_ExecuteUbergraph_BP_DialogueSystemComponent::K2Node_CustomEvent_IWDRef' has a wrong offset!");
static_assert(offsetof(BP_DialogueSystemComponent_C_ExecuteUbergraph_BP_DialogueSystemComponent, K2Node_CreateDelegate_OutputDelegate) == 0x000030, "Member 'BP_DialogueSystemComponent_C_ExecuteUbergraph_BP_DialogueSystemComponent::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_DialogueSystemComponent_C_ExecuteUbergraph_BP_DialogueSystemComponent, K2Node_CreateDelegate_OutputDelegate_1) == 0x000040, "Member 'BP_DialogueSystemComponent_C_ExecuteUbergraph_BP_DialogueSystemComponent::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_DialogueSystemComponent_C_ExecuteUbergraph_BP_DialogueSystemComponent, K2Node_CreateDelegate_OutputDelegate_2) == 0x000050, "Member 'BP_DialogueSystemComponent_C_ExecuteUbergraph_BP_DialogueSystemComponent::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_DialogueSystemComponent_C_ExecuteUbergraph_BP_DialogueSystemComponent, K2Node_CreateDelegate_OutputDelegate_3) == 0x000060, "Member 'BP_DialogueSystemComponent_C_ExecuteUbergraph_BP_DialogueSystemComponent::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BP_DialogueSystemComponent_C_ExecuteUbergraph_BP_DialogueSystemComponent, K2Node_CreateDelegate_OutputDelegate_4) == 0x000070, "Member 'BP_DialogueSystemComponent_C_ExecuteUbergraph_BP_DialogueSystemComponent::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(BP_DialogueSystemComponent_C_ExecuteUbergraph_BP_DialogueSystemComponent, K2Node_CustomEvent_Loaded) == 0x000080, "Member 'BP_DialogueSystemComponent_C_ExecuteUbergraph_BP_DialogueSystemComponent::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(BP_DialogueSystemComponent_C_ExecuteUbergraph_BP_DialogueSystemComponent, Temp_object_Variable) == 0x000088, "Member 'BP_DialogueSystemComponent_C_ExecuteUbergraph_BP_DialogueSystemComponent::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_DialogueSystemComponent_C_ExecuteUbergraph_BP_DialogueSystemComponent, K2Node_DynamicCast_AsBP_DA_IWD_Data) == 0x000090, "Member 'BP_DialogueSystemComponent_C_ExecuteUbergraph_BP_DialogueSystemComponent::K2Node_DynamicCast_AsBP_DA_IWD_Data' has a wrong offset!");
static_assert(offsetof(BP_DialogueSystemComponent_C_ExecuteUbergraph_BP_DialogueSystemComponent, K2Node_DynamicCast_bSuccess) == 0x000098, "Member 'BP_DialogueSystemComponent_C_ExecuteUbergraph_BP_DialogueSystemComponent::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_DialogueSystemComponent_C_ExecuteUbergraph_BP_DialogueSystemComponent, CallFunc_PlayInWorldDialogue_DialogueNotPlayed) == 0x000099, "Member 'BP_DialogueSystemComponent_C_ExecuteUbergraph_BP_DialogueSystemComponent::CallFunc_PlayInWorldDialogue_DialogueNotPlayed' has a wrong offset!");
static_assert(offsetof(BP_DialogueSystemComponent_C_ExecuteUbergraph_BP_DialogueSystemComponent, K2Node_Event_FocusEventBP) == 0x0000A0, "Member 'BP_DialogueSystemComponent_C_ExecuteUbergraph_BP_DialogueSystemComponent::K2Node_Event_FocusEventBP' has a wrong offset!");
static_assert(offsetof(BP_DialogueSystemComponent_C_ExecuteUbergraph_BP_DialogueSystemComponent, CallFunc_Array_Random_OutItem) == 0x0000A8, "Member 'BP_DialogueSystemComponent_C_ExecuteUbergraph_BP_DialogueSystemComponent::CallFunc_Array_Random_OutItem' has a wrong offset!");
static_assert(offsetof(BP_DialogueSystemComponent_C_ExecuteUbergraph_BP_DialogueSystemComponent, CallFunc_Array_Random_OutIndex) == 0x0000B8, "Member 'BP_DialogueSystemComponent_C_ExecuteUbergraph_BP_DialogueSystemComponent::CallFunc_Array_Random_OutIndex' has a wrong offset!");
static_assert(offsetof(BP_DialogueSystemComponent_C_ExecuteUbergraph_BP_DialogueSystemComponent, CallFunc_GetBattleManager_ReturnValue) == 0x0000C0, "Member 'BP_DialogueSystemComponent_C_ExecuteUbergraph_BP_DialogueSystemComponent::CallFunc_GetBattleManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DialogueSystemComponent_C_ExecuteUbergraph_BP_DialogueSystemComponent, K2Node_CustomEvent_Victory) == 0x0000C8, "Member 'BP_DialogueSystemComponent_C_ExecuteUbergraph_BP_DialogueSystemComponent::K2Node_CustomEvent_Victory' has a wrong offset!");
static_assert(offsetof(BP_DialogueSystemComponent_C_ExecuteUbergraph_BP_DialogueSystemComponent, CallFunc_GetBattleManager_ReturnValue_1) == 0x0000D0, "Member 'BP_DialogueSystemComponent_C_ExecuteUbergraph_BP_DialogueSystemComponent::CallFunc_GetBattleManager_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DialogueSystemComponent_C_ExecuteUbergraph_BP_DialogueSystemComponent, CallFunc_GetPlayerController_ReturnValue) == 0x0000D8, "Member 'BP_DialogueSystemComponent_C_ExecuteUbergraph_BP_DialogueSystemComponent::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DialogueSystemComponent_C_ExecuteUbergraph_BP_DialogueSystemComponent, K2Node_DynamicCast_AsBP_J_RPG_Controller_World) == 0x0000E0, "Member 'BP_DialogueSystemComponent_C_ExecuteUbergraph_BP_DialogueSystemComponent::K2Node_DynamicCast_AsBP_J_RPG_Controller_World' has a wrong offset!");
static_assert(offsetof(BP_DialogueSystemComponent_C_ExecuteUbergraph_BP_DialogueSystemComponent, K2Node_DynamicCast_bSuccess_1) == 0x0000E8, "Member 'BP_DialogueSystemComponent_C_ExecuteUbergraph_BP_DialogueSystemComponent::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_DialogueSystemComponent_C_ExecuteUbergraph_BP_DialogueSystemComponent, K2Node_CustomEvent_DialogueUI) == 0x0000F0, "Member 'BP_DialogueSystemComponent_C_ExecuteUbergraph_BP_DialogueSystemComponent::K2Node_CustomEvent_DialogueUI' has a wrong offset!");
static_assert(offsetof(BP_DialogueSystemComponent_C_ExecuteUbergraph_BP_DialogueSystemComponent, K2Node_CustomEvent_Duration_1) == 0x0000F8, "Member 'BP_DialogueSystemComponent_C_ExecuteUbergraph_BP_DialogueSystemComponent::K2Node_CustomEvent_Duration_1' has a wrong offset!");
static_assert(offsetof(BP_DialogueSystemComponent_C_ExecuteUbergraph_BP_DialogueSystemComponent, CallFunc_EqualEqual_DoubleDouble_ReturnValue) == 0x000100, "Member 'BP_DialogueSystemComponent_C_ExecuteUbergraph_BP_DialogueSystemComponent::CallFunc_EqualEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DialogueSystemComponent_C_ExecuteUbergraph_BP_DialogueSystemComponent, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000108, "Member 'BP_DialogueSystemComponent_C_ExecuteUbergraph_BP_DialogueSystemComponent::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DialogueSystemComponent_C_ExecuteUbergraph_BP_DialogueSystemComponent, K2Node_CustomEvent_Duration) == 0x000110, "Member 'BP_DialogueSystemComponent_C_ExecuteUbergraph_BP_DialogueSystemComponent::K2Node_CustomEvent_Duration' has a wrong offset!");
