#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Dialogue

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "S_Dialogue_EndParameters_structs.hpp"
#include "E_Dialogue_AudioTrigger_structs.hpp"
#include "S_DialogueParameters_structs.hpp"


namespace SDK::Params
{

// Function BP_Dialogue.BP_Dialogue_C.Action_EndDialogue
// 0x0018 (0x0018 - 0x0000)
struct BP_Dialogue_C_Action_EndDialogue final
{
public:
	int32                                         NextDialogueStage;                                 // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_Dialogue_EndParameters              Parameters;                                        // 0x0004(0x0002)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Dialogue_C_Action_EndDialogue) == 0x000008, "Wrong alignment on BP_Dialogue_C_Action_EndDialogue");
static_assert(sizeof(BP_Dialogue_C_Action_EndDialogue) == 0x000018, "Wrong size on BP_Dialogue_C_Action_EndDialogue");
static_assert(offsetof(BP_Dialogue_C_Action_EndDialogue, NextDialogueStage) == 0x000000, "Member 'BP_Dialogue_C_Action_EndDialogue::NextDialogueStage' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_C_Action_EndDialogue, Parameters) == 0x000004, "Member 'BP_Dialogue_C_Action_EndDialogue::Parameters' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_C_Action_EndDialogue, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'BP_Dialogue_C_Action_EndDialogue::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_C_Action_EndDialogue, CallFunc_GetComponentByClass_ReturnValue) == 0x000010, "Member 'BP_Dialogue_C_Action_EndDialogue::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");

// Function BP_Dialogue.BP_Dialogue_C.ActivateDialogue
// 0x0010 (0x0010 - 0x0000)
struct BP_Dialogue_C_ActivateDialogue final
{
public:
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Dialogue_C_ActivateDialogue) == 0x000008, "Wrong alignment on BP_Dialogue_C_ActivateDialogue");
static_assert(sizeof(BP_Dialogue_C_ActivateDialogue) == 0x000010, "Wrong size on BP_Dialogue_C_ActivateDialogue");
static_assert(offsetof(BP_Dialogue_C_ActivateDialogue, CallFunc_GetPlayerController_ReturnValue) == 0x000000, "Member 'BP_Dialogue_C_ActivateDialogue::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_C_ActivateDialogue, CallFunc_GetComponentByClass_ReturnValue) == 0x000008, "Member 'BP_Dialogue_C_ActivateDialogue::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");

// Function BP_Dialogue.BP_Dialogue_C.CheckForErrors
// 0x0048 (0x0048 - 0x0000)
struct BP_Dialogue_C_CheckForErrors final
{
public:
	TArray<class FText>                           ErrorMessages;                                     // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0018(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0028(0x0010)()
	bool                                          CallFunc_IsValid_Guid_ReturnValue;                 // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Dialogue_C_CheckForErrors) == 0x000008, "Wrong alignment on BP_Dialogue_C_CheckForErrors");
static_assert(sizeof(BP_Dialogue_C_CheckForErrors) == 0x000048, "Wrong size on BP_Dialogue_C_CheckForErrors");
static_assert(offsetof(BP_Dialogue_C_CheckForErrors, ErrorMessages) == 0x000000, "Member 'BP_Dialogue_C_CheckForErrors::ErrorMessages' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_C_CheckForErrors, ReturnValue) == 0x000010, "Member 'BP_Dialogue_C_CheckForErrors::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_C_CheckForErrors, K2Node_MakeArray_Array) == 0x000018, "Member 'BP_Dialogue_C_CheckForErrors::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_C_CheckForErrors, CallFunc_Format_ReturnValue) == 0x000028, "Member 'BP_Dialogue_C_CheckForErrors::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_C_CheckForErrors, CallFunc_IsValid_Guid_ReturnValue) == 0x000038, "Member 'BP_Dialogue_C_CheckForErrors::CallFunc_IsValid_Guid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_C_CheckForErrors, CallFunc_Array_Add_ReturnValue) == 0x00003C, "Member 'BP_Dialogue_C_CheckForErrors::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_C_CheckForErrors, CallFunc_Not_PreBool_ReturnValue) == 0x000040, "Member 'BP_Dialogue_C_CheckForErrors::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function BP_Dialogue.BP_Dialogue_C.ExecuteUbergraph_BP_Dialogue
// 0x0128 (0x0128 - 0x0000)
struct BP_Dialogue_C_ExecuteUbergraph_BP_Dialogue final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UConfigurableGameUserSettings*          CallFunc_GetConfigurableGameUserSettings_GameUserSettings; // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetMasterVolume_ReturnValue;              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(float EnvelopeValue)>          K2Node_CreateDelegate_OutputDelegate;              // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_DoubleDouble_ReturnValue;        // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetVoiceVolume_ReturnValue;               // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_DoubleDouble_ReturnValue_1;      // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E[0x2];                                       // 0x002E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable;                                // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_Select_Default;                             // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1;                              // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Select_Default_1;                           // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_ObjectToText_ReturnValue;            // 0x0060(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0070(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00B8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00C8(0x0010)()
	float                                         K2Node_CustomEvent_EnvelopeValue;                  // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue;          // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Select_Option_1_ImplicitCast;               // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_NotEqual_DoubleDouble_A_ImplicitCast;     // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Select_Option_1_ImplicitCast_1;             // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_NotEqual_DoubleDouble_A_ImplicitCast_1;   // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_A_ImplicitCast;       // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Dialogue_C_ExecuteUbergraph_BP_Dialogue) == 0x000008, "Wrong alignment on BP_Dialogue_C_ExecuteUbergraph_BP_Dialogue");
static_assert(sizeof(BP_Dialogue_C_ExecuteUbergraph_BP_Dialogue) == 0x000128, "Wrong size on BP_Dialogue_C_ExecuteUbergraph_BP_Dialogue");
static_assert(offsetof(BP_Dialogue_C_ExecuteUbergraph_BP_Dialogue, EntryPoint) == 0x000000, "Member 'BP_Dialogue_C_ExecuteUbergraph_BP_Dialogue::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_C_ExecuteUbergraph_BP_Dialogue, CallFunc_GetConfigurableGameUserSettings_GameUserSettings) == 0x000008, "Member 'BP_Dialogue_C_ExecuteUbergraph_BP_Dialogue::CallFunc_GetConfigurableGameUserSettings_GameUserSettings' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_C_ExecuteUbergraph_BP_Dialogue, CallFunc_GetMasterVolume_ReturnValue) == 0x000010, "Member 'BP_Dialogue_C_ExecuteUbergraph_BP_Dialogue::CallFunc_GetMasterVolume_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_C_ExecuteUbergraph_BP_Dialogue, K2Node_CreateDelegate_OutputDelegate) == 0x000014, "Member 'BP_Dialogue_C_ExecuteUbergraph_BP_Dialogue::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_C_ExecuteUbergraph_BP_Dialogue, CallFunc_NotEqual_DoubleDouble_ReturnValue) == 0x000024, "Member 'BP_Dialogue_C_ExecuteUbergraph_BP_Dialogue::CallFunc_NotEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_C_ExecuteUbergraph_BP_Dialogue, CallFunc_GetVoiceVolume_ReturnValue) == 0x000028, "Member 'BP_Dialogue_C_ExecuteUbergraph_BP_Dialogue::CallFunc_GetVoiceVolume_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_C_ExecuteUbergraph_BP_Dialogue, Temp_bool_Variable) == 0x00002C, "Member 'BP_Dialogue_C_ExecuteUbergraph_BP_Dialogue::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_C_ExecuteUbergraph_BP_Dialogue, CallFunc_NotEqual_DoubleDouble_ReturnValue_1) == 0x00002D, "Member 'BP_Dialogue_C_ExecuteUbergraph_BP_Dialogue::CallFunc_NotEqual_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_C_ExecuteUbergraph_BP_Dialogue, Temp_real_Variable) == 0x000030, "Member 'BP_Dialogue_C_ExecuteUbergraph_BP_Dialogue::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_C_ExecuteUbergraph_BP_Dialogue, Temp_bool_Variable_1) == 0x000038, "Member 'BP_Dialogue_C_ExecuteUbergraph_BP_Dialogue::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_C_ExecuteUbergraph_BP_Dialogue, K2Node_Select_Default) == 0x000040, "Member 'BP_Dialogue_C_ExecuteUbergraph_BP_Dialogue::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_C_ExecuteUbergraph_BP_Dialogue, Temp_real_Variable_1) == 0x000048, "Member 'BP_Dialogue_C_ExecuteUbergraph_BP_Dialogue::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_C_ExecuteUbergraph_BP_Dialogue, K2Node_Select_Default_1) == 0x000050, "Member 'BP_Dialogue_C_ExecuteUbergraph_BP_Dialogue::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_C_ExecuteUbergraph_BP_Dialogue, CallFunc_IsValid_ReturnValue) == 0x000058, "Member 'BP_Dialogue_C_ExecuteUbergraph_BP_Dialogue::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_C_ExecuteUbergraph_BP_Dialogue, CallFunc_Conv_ObjectToText_ReturnValue) == 0x000060, "Member 'BP_Dialogue_C_ExecuteUbergraph_BP_Dialogue::CallFunc_Conv_ObjectToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_C_ExecuteUbergraph_BP_Dialogue, K2Node_MakeStruct_FormatArgumentData) == 0x000070, "Member 'BP_Dialogue_C_ExecuteUbergraph_BP_Dialogue::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_C_ExecuteUbergraph_BP_Dialogue, K2Node_MakeArray_Array) == 0x0000B8, "Member 'BP_Dialogue_C_ExecuteUbergraph_BP_Dialogue::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_C_ExecuteUbergraph_BP_Dialogue, CallFunc_Format_ReturnValue) == 0x0000C8, "Member 'BP_Dialogue_C_ExecuteUbergraph_BP_Dialogue::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_C_ExecuteUbergraph_BP_Dialogue, K2Node_CustomEvent_EnvelopeValue) == 0x0000D8, "Member 'BP_Dialogue_C_ExecuteUbergraph_BP_Dialogue::K2Node_CustomEvent_EnvelopeValue' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_C_ExecuteUbergraph_BP_Dialogue, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x0000E0, "Member 'BP_Dialogue_C_ExecuteUbergraph_BP_Dialogue::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_C_ExecuteUbergraph_BP_Dialogue, CallFunc_GetPlayerController_ReturnValue) == 0x0000E8, "Member 'BP_Dialogue_C_ExecuteUbergraph_BP_Dialogue::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_C_ExecuteUbergraph_BP_Dialogue, CallFunc_Divide_DoubleDouble_ReturnValue_1) == 0x0000F0, "Member 'BP_Dialogue_C_ExecuteUbergraph_BP_Dialogue::CallFunc_Divide_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_C_ExecuteUbergraph_BP_Dialogue, CallFunc_GetComponentByClass_ReturnValue) == 0x0000F8, "Member 'BP_Dialogue_C_ExecuteUbergraph_BP_Dialogue::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_C_ExecuteUbergraph_BP_Dialogue, K2Node_Select_Option_1_ImplicitCast) == 0x000100, "Member 'BP_Dialogue_C_ExecuteUbergraph_BP_Dialogue::K2Node_Select_Option_1_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_C_ExecuteUbergraph_BP_Dialogue, CallFunc_NotEqual_DoubleDouble_A_ImplicitCast) == 0x000108, "Member 'BP_Dialogue_C_ExecuteUbergraph_BP_Dialogue::CallFunc_NotEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_C_ExecuteUbergraph_BP_Dialogue, K2Node_Select_Option_1_ImplicitCast_1) == 0x000110, "Member 'BP_Dialogue_C_ExecuteUbergraph_BP_Dialogue::K2Node_Select_Option_1_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_C_ExecuteUbergraph_BP_Dialogue, CallFunc_NotEqual_DoubleDouble_A_ImplicitCast_1) == 0x000118, "Member 'BP_Dialogue_C_ExecuteUbergraph_BP_Dialogue::CallFunc_NotEqual_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_C_ExecuteUbergraph_BP_Dialogue, CallFunc_Divide_DoubleDouble_A_ImplicitCast) == 0x000120, "Member 'BP_Dialogue_C_ExecuteUbergraph_BP_Dialogue::CallFunc_Divide_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function BP_Dialogue.BP_Dialogue_C.GetDefaultAudioTriggerForDialogue
// 0x0010 (0x0010 - 0x0000)
struct BP_Dialogue_C_GetDefaultAudioTriggerForDialogue final
{
public:
	E_Dialogue_AudioTrigger                       AudioTrigger;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   AudioTriggerName;                                  // 0x0004(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Dialogue_C_GetDefaultAudioTriggerForDialogue) == 0x000004, "Wrong alignment on BP_Dialogue_C_GetDefaultAudioTriggerForDialogue");
static_assert(sizeof(BP_Dialogue_C_GetDefaultAudioTriggerForDialogue) == 0x000010, "Wrong size on BP_Dialogue_C_GetDefaultAudioTriggerForDialogue");
static_assert(offsetof(BP_Dialogue_C_GetDefaultAudioTriggerForDialogue, AudioTrigger) == 0x000000, "Member 'BP_Dialogue_C_GetDefaultAudioTriggerForDialogue::AudioTrigger' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_C_GetDefaultAudioTriggerForDialogue, AudioTriggerName) == 0x000004, "Member 'BP_Dialogue_C_GetDefaultAudioTriggerForDialogue::AudioTriggerName' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_C_GetDefaultAudioTriggerForDialogue, K2Node_SwitchEnum_CmpSuccess) == 0x00000C, "Member 'BP_Dialogue_C_GetDefaultAudioTriggerForDialogue::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function BP_Dialogue.BP_Dialogue_C.GetDialogueParameters
// 0x0008 (0x0008 - 0x0000)
struct BP_Dialogue_C_GetDialogueParameters final
{
public:
	struct FS_DialogueParameters                  DialogueParameters;                                // 0x0000(0x0008)(Parm, OutParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Dialogue_C_GetDialogueParameters) == 0x000004, "Wrong alignment on BP_Dialogue_C_GetDialogueParameters");
static_assert(sizeof(BP_Dialogue_C_GetDialogueParameters) == 0x000008, "Wrong size on BP_Dialogue_C_GetDialogueParameters");
static_assert(offsetof(BP_Dialogue_C_GetDialogueParameters, DialogueParameters) == 0x000000, "Member 'BP_Dialogue_C_GetDialogueParameters::DialogueParameters' has a wrong offset!");

// Function BP_Dialogue.BP_Dialogue_C.GetDialogueStage
// 0x0018 (0x0018 - 0x0000)
struct BP_Dialogue_C_GetDialogueStage final
{
public:
	int32                                         DialogueStage;                                     // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_jRPG_GI_Custom_C*                   CallFunc_GetCustomGI_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Map_Find_Value;                           // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Dialogue_C_GetDialogueStage) == 0x000008, "Wrong alignment on BP_Dialogue_C_GetDialogueStage");
static_assert(sizeof(BP_Dialogue_C_GetDialogueStage) == 0x000018, "Wrong size on BP_Dialogue_C_GetDialogueStage");
static_assert(offsetof(BP_Dialogue_C_GetDialogueStage, DialogueStage) == 0x000000, "Member 'BP_Dialogue_C_GetDialogueStage::DialogueStage' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_C_GetDialogueStage, CallFunc_GetCustomGI_ReturnValue) == 0x000008, "Member 'BP_Dialogue_C_GetDialogueStage::CallFunc_GetCustomGI_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_C_GetDialogueStage, CallFunc_Map_Find_Value) == 0x000010, "Member 'BP_Dialogue_C_GetDialogueStage::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_C_GetDialogueStage, CallFunc_Map_Find_ReturnValue) == 0x000014, "Member 'BP_Dialogue_C_GetDialogueStage::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_C_GetDialogueStage, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000015, "Member 'BP_Dialogue_C_GetDialogueStage::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");

// Function BP_Dialogue.BP_Dialogue_C.GetExternalSpeakerSlots
// 0x0010 (0x0010 - 0x0000)
struct BP_Dialogue_C_GetExternalSpeakerSlots final
{
public:
	TArray<TSoftObjectPtr<class AActor>>          Actor_Array;                                       // 0x0000(0x0010)(Parm, OutParm)
};
static_assert(alignof(BP_Dialogue_C_GetExternalSpeakerSlots) == 0x000008, "Wrong alignment on BP_Dialogue_C_GetExternalSpeakerSlots");
static_assert(sizeof(BP_Dialogue_C_GetExternalSpeakerSlots) == 0x000010, "Wrong size on BP_Dialogue_C_GetExternalSpeakerSlots");
static_assert(offsetof(BP_Dialogue_C_GetExternalSpeakerSlots, Actor_Array) == 0x000000, "Member 'BP_Dialogue_C_GetExternalSpeakerSlots::Actor_Array' has a wrong offset!");

// Function BP_Dialogue.BP_Dialogue_C.GetInterlocutorActor
// 0x0100 (0x0100 - 0x0000)
struct BP_Dialogue_C_GetInterlocutorActor final
{
public:
	class UClass*                                 ActorClass;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Interlocutor;                                      // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetClassDisplayName_ReturnValue;          // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0020(0x0010)()
	class FText                                   CallFunc_Conv_ObjectToText_ReturnValue;            // 0x0030(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0040(0x0048)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0088(0x0048)(HasGetValueTypeHash)
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00D8(0x0010)(ReferenceParm)
	bool                                          CallFunc_ClassIsChildOf_ReturnValue;               // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00F0(0x0010)()
};
static_assert(alignof(BP_Dialogue_C_GetInterlocutorActor) == 0x000008, "Wrong alignment on BP_Dialogue_C_GetInterlocutorActor");
static_assert(sizeof(BP_Dialogue_C_GetInterlocutorActor) == 0x000100, "Wrong size on BP_Dialogue_C_GetInterlocutorActor");
static_assert(offsetof(BP_Dialogue_C_GetInterlocutorActor, ActorClass) == 0x000000, "Member 'BP_Dialogue_C_GetInterlocutorActor::ActorClass' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_C_GetInterlocutorActor, Interlocutor) == 0x000008, "Member 'BP_Dialogue_C_GetInterlocutorActor::Interlocutor' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_C_GetInterlocutorActor, CallFunc_GetClassDisplayName_ReturnValue) == 0x000010, "Member 'BP_Dialogue_C_GetInterlocutorActor::CallFunc_GetClassDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_C_GetInterlocutorActor, CallFunc_Conv_StringToText_ReturnValue) == 0x000020, "Member 'BP_Dialogue_C_GetInterlocutorActor::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_C_GetInterlocutorActor, CallFunc_Conv_ObjectToText_ReturnValue) == 0x000030, "Member 'BP_Dialogue_C_GetInterlocutorActor::CallFunc_Conv_ObjectToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_C_GetInterlocutorActor, K2Node_MakeStruct_FormatArgumentData) == 0x000040, "Member 'BP_Dialogue_C_GetInterlocutorActor::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_C_GetInterlocutorActor, K2Node_MakeStruct_FormatArgumentData_1) == 0x000088, "Member 'BP_Dialogue_C_GetInterlocutorActor::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_C_GetInterlocutorActor, CallFunc_GetObjectClass_ReturnValue) == 0x0000D0, "Member 'BP_Dialogue_C_GetInterlocutorActor::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_C_GetInterlocutorActor, K2Node_MakeArray_Array) == 0x0000D8, "Member 'BP_Dialogue_C_GetInterlocutorActor::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_C_GetInterlocutorActor, CallFunc_ClassIsChildOf_ReturnValue) == 0x0000E8, "Member 'BP_Dialogue_C_GetInterlocutorActor::CallFunc_ClassIsChildOf_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_C_GetInterlocutorActor, CallFunc_Format_ReturnValue) == 0x0000F0, "Member 'BP_Dialogue_C_GetInterlocutorActor::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function BP_Dialogue.BP_Dialogue_C.GetPlayerCharacterWorld
// 0x0020 (0x0020 - 0x0000)
struct BP_Dialogue_C_GetPlayerCharacterWorld final
{
public:
	class ABP_jRPG_Character_World_C*             AsBP_J_RPG_Character_World;                        // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_jRPG_Character_World_C*             K2Node_DynamicCast_AsBP_J_RPG_Character_World;     // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Dialogue_C_GetPlayerCharacterWorld) == 0x000008, "Wrong alignment on BP_Dialogue_C_GetPlayerCharacterWorld");
static_assert(sizeof(BP_Dialogue_C_GetPlayerCharacterWorld) == 0x000020, "Wrong size on BP_Dialogue_C_GetPlayerCharacterWorld");
static_assert(offsetof(BP_Dialogue_C_GetPlayerCharacterWorld, AsBP_J_RPG_Character_World) == 0x000000, "Member 'BP_Dialogue_C_GetPlayerCharacterWorld::AsBP_J_RPG_Character_World' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_C_GetPlayerCharacterWorld, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000008, "Member 'BP_Dialogue_C_GetPlayerCharacterWorld::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_C_GetPlayerCharacterWorld, K2Node_DynamicCast_AsBP_J_RPG_Character_World) == 0x000010, "Member 'BP_Dialogue_C_GetPlayerCharacterWorld::K2Node_DynamicCast_AsBP_J_RPG_Character_World' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_C_GetPlayerCharacterWorld, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_Dialogue_C_GetPlayerCharacterWorld::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BP_Dialogue.BP_Dialogue_C.GetSpeakerActor
// 0x0030 (0x0030 - 0x0000)
struct BP_Dialogue_C_GetSpeakerActor final
{
public:
	class UBP_DataAsset_DialogueCharacter_C*      Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Actor;                                             // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetSpeaker_Actor;                         // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetSpeaker_Slot;                          // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Dialogue_C_GetSpeakerActor) == 0x000008, "Wrong alignment on BP_Dialogue_C_GetSpeakerActor");
static_assert(sizeof(BP_Dialogue_C_GetSpeakerActor) == 0x000030, "Wrong size on BP_Dialogue_C_GetSpeakerActor");
static_assert(offsetof(BP_Dialogue_C_GetSpeakerActor, Character) == 0x000000, "Member 'BP_Dialogue_C_GetSpeakerActor::Character' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_C_GetSpeakerActor, Actor) == 0x000008, "Member 'BP_Dialogue_C_GetSpeakerActor::Actor' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_C_GetSpeakerActor, CallFunc_GetPlayerController_ReturnValue) == 0x000010, "Member 'BP_Dialogue_C_GetSpeakerActor::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_C_GetSpeakerActor, CallFunc_GetComponentByClass_ReturnValue) == 0x000018, "Member 'BP_Dialogue_C_GetSpeakerActor::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_C_GetSpeakerActor, CallFunc_GetSpeaker_Actor) == 0x000020, "Member 'BP_Dialogue_C_GetSpeakerActor::CallFunc_GetSpeaker_Actor' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_C_GetSpeakerActor, CallFunc_GetSpeaker_Slot) == 0x000028, "Member 'BP_Dialogue_C_GetSpeakerActor::CallFunc_GetSpeaker_Slot' has a wrong offset!");

// Function BP_Dialogue.BP_Dialogue_C.OnEnvelopeFollowerUpdate_Event
// 0x0004 (0x0004 - 0x0000)
struct BP_Dialogue_C_OnEnvelopeFollowerUpdate_Event final
{
public:
	float                                         EnvelopeValue;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Dialogue_C_OnEnvelopeFollowerUpdate_Event) == 0x000004, "Wrong alignment on BP_Dialogue_C_OnEnvelopeFollowerUpdate_Event");
static_assert(sizeof(BP_Dialogue_C_OnEnvelopeFollowerUpdate_Event) == 0x000004, "Wrong size on BP_Dialogue_C_OnEnvelopeFollowerUpdate_Event");
static_assert(offsetof(BP_Dialogue_C_OnEnvelopeFollowerUpdate_Event, EnvelopeValue) == 0x000000, "Member 'BP_Dialogue_C_OnEnvelopeFollowerUpdate_Event::EnvelopeValue' has a wrong offset!");

// Function BP_Dialogue.BP_Dialogue_C.ResetNPCAnim
// 0x0010 (0x0010 - 0x0000)
struct BP_Dialogue_C_ResetNPCAnim final
{
public:
	class UBP_NPCAnimationComponent_C*            CallFunc_GetComponentByClass_ReturnValue;          // 0x0000(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Dialogue_C_ResetNPCAnim) == 0x000008, "Wrong alignment on BP_Dialogue_C_ResetNPCAnim");
static_assert(sizeof(BP_Dialogue_C_ResetNPCAnim) == 0x000010, "Wrong size on BP_Dialogue_C_ResetNPCAnim");
static_assert(offsetof(BP_Dialogue_C_ResetNPCAnim, CallFunc_GetComponentByClass_ReturnValue) == 0x000000, "Member 'BP_Dialogue_C_ResetNPCAnim::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_C_ResetNPCAnim, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'BP_Dialogue_C_ResetNPCAnim::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_Dialogue.BP_Dialogue_C.RestoreBattleParty
// 0x0008 (0x0008 - 0x0000)
struct BP_Dialogue_C_RestoreBattleParty final
{
public:
	class UBP_jRPG_GI_Custom_C*                   CallFunc_GetCustomGI_ReturnValue;                  // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Dialogue_C_RestoreBattleParty) == 0x000008, "Wrong alignment on BP_Dialogue_C_RestoreBattleParty");
static_assert(sizeof(BP_Dialogue_C_RestoreBattleParty) == 0x000008, "Wrong size on BP_Dialogue_C_RestoreBattleParty");
static_assert(offsetof(BP_Dialogue_C_RestoreBattleParty, CallFunc_GetCustomGI_ReturnValue) == 0x000000, "Member 'BP_Dialogue_C_RestoreBattleParty::CallFunc_GetCustomGI_ReturnValue' has a wrong offset!");

// Function BP_Dialogue.BP_Dialogue_C.SetBattleParty
// 0x0050 (0x0050 - 0x0000)
struct BP_Dialogue_C_SetBattleParty final
{
public:
	TArray<class UBP_CharacterData_C*>            CharacterData;                                     // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<class FName>                           local_Party;                                       // 0x0010(0x0010)(Edit, BlueprintVisible)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_CharacterData_C*                    CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_jRPG_GI_Custom_C*                   CallFunc_GetCustomGI_ReturnValue;                  // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Dialogue_C_SetBattleParty) == 0x000008, "Wrong alignment on BP_Dialogue_C_SetBattleParty");
static_assert(sizeof(BP_Dialogue_C_SetBattleParty) == 0x000050, "Wrong size on BP_Dialogue_C_SetBattleParty");
static_assert(offsetof(BP_Dialogue_C_SetBattleParty, CharacterData) == 0x000000, "Member 'BP_Dialogue_C_SetBattleParty::CharacterData' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_C_SetBattleParty, local_Party) == 0x000010, "Member 'BP_Dialogue_C_SetBattleParty::local_Party' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_C_SetBattleParty, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'BP_Dialogue_C_SetBattleParty::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_C_SetBattleParty, Temp_int_Array_Index_Variable) == 0x000024, "Member 'BP_Dialogue_C_SetBattleParty::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_C_SetBattleParty, Temp_int_Loop_Counter_Variable) == 0x000028, "Member 'BP_Dialogue_C_SetBattleParty::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_C_SetBattleParty, CallFunc_Array_Get_Item) == 0x000030, "Member 'BP_Dialogue_C_SetBattleParty::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_C_SetBattleParty, CallFunc_Less_IntInt_ReturnValue) == 0x000038, "Member 'BP_Dialogue_C_SetBattleParty::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_C_SetBattleParty, CallFunc_Add_IntInt_ReturnValue) == 0x00003C, "Member 'BP_Dialogue_C_SetBattleParty::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_C_SetBattleParty, CallFunc_GetCustomGI_ReturnValue) == 0x000040, "Member 'BP_Dialogue_C_SetBattleParty::CallFunc_GetCustomGI_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_C_SetBattleParty, CallFunc_Array_Add_ReturnValue) == 0x000048, "Member 'BP_Dialogue_C_SetBattleParty::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function BP_Dialogue.BP_Dialogue_C.SetDialogueParameters
// 0x0008 (0x0008 - 0x0000)
struct BP_Dialogue_C_SetDialogueParameters final
{
public:
	struct FS_DialogueParameters                  DialogueParameters;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Dialogue_C_SetDialogueParameters) == 0x000004, "Wrong alignment on BP_Dialogue_C_SetDialogueParameters");
static_assert(sizeof(BP_Dialogue_C_SetDialogueParameters) == 0x000008, "Wrong size on BP_Dialogue_C_SetDialogueParameters");
static_assert(offsetof(BP_Dialogue_C_SetDialogueParameters, DialogueParameters) == 0x000000, "Member 'BP_Dialogue_C_SetDialogueParameters::DialogueParameters' has a wrong offset!");

// Function BP_Dialogue.BP_Dialogue_C.SetDialogueStage
// 0x0010 (0x0010 - 0x0000)
struct BP_Dialogue_C_SetDialogueStage final
{
public:
	int32                                         DialogueStage;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_jRPG_GI_Custom_C*                   CallFunc_GetCustomGI_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Dialogue_C_SetDialogueStage) == 0x000008, "Wrong alignment on BP_Dialogue_C_SetDialogueStage");
static_assert(sizeof(BP_Dialogue_C_SetDialogueStage) == 0x000010, "Wrong size on BP_Dialogue_C_SetDialogueStage");
static_assert(offsetof(BP_Dialogue_C_SetDialogueStage, DialogueStage) == 0x000000, "Member 'BP_Dialogue_C_SetDialogueStage::DialogueStage' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_C_SetDialogueStage, CallFunc_GetCustomGI_ReturnValue) == 0x000008, "Member 'BP_Dialogue_C_SetDialogueStage::CallFunc_GetCustomGI_ReturnValue' has a wrong offset!");

}

