#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DataAsset_Item_Journal

#include "Basic.hpp"

#include "BP_DataAsset_Item_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_DataAsset_Item_Journal.BP_DataAsset_Item_Journal_C
// 0x0050 (0x0080 - 0x0030)
class UBP_DataAsset_Item_Journal_C final : public UBP_DataAsset_Item_C
{
public:
	class FText                                   Text;                                              // 0x0030(0x0010)(Edit, BlueprintVisible)
	TSoftObjectPtr<class USoundBase>              VoiceOver;                                         // 0x0040(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	class FText                                   ShortTitle;                                        // 0x0068(0x0010)(Edit, BlueprintVisible)
	class FName                                   AssociatedLevel;                                   // 0x0078(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_DataAsset_Item_Journal_C">();
	}
	static class UBP_DataAsset_Item_Journal_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_DataAsset_Item_Journal_C>();
	}
};
static_assert(alignof(UBP_DataAsset_Item_Journal_C) == 0x000008, "Wrong alignment on UBP_DataAsset_Item_Journal_C");
static_assert(sizeof(UBP_DataAsset_Item_Journal_C) == 0x000080, "Wrong size on UBP_DataAsset_Item_Journal_C");
static_assert(offsetof(UBP_DataAsset_Item_Journal_C, Text) == 0x000030, "Member 'UBP_DataAsset_Item_Journal_C::Text' has a wrong offset!");
static_assert(offsetof(UBP_DataAsset_Item_Journal_C, VoiceOver) == 0x000040, "Member 'UBP_DataAsset_Item_Journal_C::VoiceOver' has a wrong offset!");
static_assert(offsetof(UBP_DataAsset_Item_Journal_C, ShortTitle) == 0x000068, "Member 'UBP_DataAsset_Item_Journal_C::ShortTitle' has a wrong offset!");
static_assert(offsetof(UBP_DataAsset_Item_Journal_C, AssociatedLevel) == 0x000078, "Member 'UBP_DataAsset_Item_Journal_C::AssociatedLevel' has a wrong offset!");

}

