#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DialogSystem

#include "Basic.hpp"

#include "Dialog_Struct_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function BP_DialogSystem.BP_DialogSystem_C.AnimDialog
// 0x0208 (0x0208 - 0x0000)
struct BP_DialogSystem_C_AnimDialog final
{
public:
	class FText                                   Response;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
	double                                        AnimDuration;                                      // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        AnimMontageDuration;                               // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDialog_Struct                         CallFunc_GetDataTableRowFromName_OutRow;           // 0x0028(0x0188)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B1[0x3];                                      // 0x01B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UAnimMontage*>                   K2Node_MakeArray_Array;                            // 0x01B8(0x0010)(ReferenceParm)
	class UAnimMontage*                           CallFunc_Array_Get_Item;                           // 0x01C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class FText>                           K2Node_MakeArray_Array_1;                          // 0x01D0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Array_Get_Item_1;                         // 0x01E0(0x0010)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_TextText_ReturnValue;          // 0x01F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01F5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F6[0x2];                                      // 0x01F6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_jRPG_NPC_Dialog_C*                  K2Node_DynamicCast_AsBP_J_RPG_NPC_Dialog;          // 0x01F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_201[0x3];                                      // 0x0201(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_PlayAnimMontage_ReturnValue;              // 0x0204(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DialogSystem_C_AnimDialog) == 0x000008, "Wrong alignment on BP_DialogSystem_C_AnimDialog");
static_assert(sizeof(BP_DialogSystem_C_AnimDialog) == 0x000208, "Wrong size on BP_DialogSystem_C_AnimDialog");
static_assert(offsetof(BP_DialogSystem_C_AnimDialog, Response) == 0x000000, "Member 'BP_DialogSystem_C_AnimDialog::Response' has a wrong offset!");
static_assert(offsetof(BP_DialogSystem_C_AnimDialog, AnimDuration) == 0x000010, "Member 'BP_DialogSystem_C_AnimDialog::AnimDuration' has a wrong offset!");
static_assert(offsetof(BP_DialogSystem_C_AnimDialog, AnimMontageDuration) == 0x000018, "Member 'BP_DialogSystem_C_AnimDialog::AnimMontageDuration' has a wrong offset!");
static_assert(offsetof(BP_DialogSystem_C_AnimDialog, Temp_int_Array_Index_Variable) == 0x000020, "Member 'BP_DialogSystem_C_AnimDialog::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_DialogSystem_C_AnimDialog, Temp_int_Loop_Counter_Variable) == 0x000024, "Member 'BP_DialogSystem_C_AnimDialog::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_DialogSystem_C_AnimDialog, CallFunc_GetDataTableRowFromName_OutRow) == 0x000028, "Member 'BP_DialogSystem_C_AnimDialog::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BP_DialogSystem_C_AnimDialog, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x0001B0, "Member 'BP_DialogSystem_C_AnimDialog::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DialogSystem_C_AnimDialog, CallFunc_Add_IntInt_ReturnValue) == 0x0001B4, "Member 'BP_DialogSystem_C_AnimDialog::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DialogSystem_C_AnimDialog, K2Node_MakeArray_Array) == 0x0001B8, "Member 'BP_DialogSystem_C_AnimDialog::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_DialogSystem_C_AnimDialog, CallFunc_Array_Get_Item) == 0x0001C8, "Member 'BP_DialogSystem_C_AnimDialog::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_DialogSystem_C_AnimDialog, K2Node_MakeArray_Array_1) == 0x0001D0, "Member 'BP_DialogSystem_C_AnimDialog::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BP_DialogSystem_C_AnimDialog, CallFunc_Array_Get_Item_1) == 0x0001E0, "Member 'BP_DialogSystem_C_AnimDialog::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_DialogSystem_C_AnimDialog, CallFunc_Array_Length_ReturnValue) == 0x0001F0, "Member 'BP_DialogSystem_C_AnimDialog::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DialogSystem_C_AnimDialog, CallFunc_EqualEqual_TextText_ReturnValue) == 0x0001F4, "Member 'BP_DialogSystem_C_AnimDialog::CallFunc_EqualEqual_TextText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DialogSystem_C_AnimDialog, CallFunc_Less_IntInt_ReturnValue) == 0x0001F5, "Member 'BP_DialogSystem_C_AnimDialog::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DialogSystem_C_AnimDialog, K2Node_DynamicCast_AsBP_J_RPG_NPC_Dialog) == 0x0001F8, "Member 'BP_DialogSystem_C_AnimDialog::K2Node_DynamicCast_AsBP_J_RPG_NPC_Dialog' has a wrong offset!");
static_assert(offsetof(BP_DialogSystem_C_AnimDialog, K2Node_DynamicCast_bSuccess) == 0x000200, "Member 'BP_DialogSystem_C_AnimDialog::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_DialogSystem_C_AnimDialog, CallFunc_PlayAnimMontage_ReturnValue) == 0x000204, "Member 'BP_DialogSystem_C_AnimDialog::CallFunc_PlayAnimMontage_ReturnValue' has a wrong offset!");

// Function BP_DialogSystem.BP_DialogSystem_C.QuitDialog
// 0x0078 (0x0078 - 0x0000)
struct BP_DialogSystem_C_QuitDialog final
{
public:
	class APlayerController*                      self2;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      PlayerController;                                  // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AController*                            self3;                                             // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          DontRegisterDialog;                                // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_jRPG_GI_Custom_C*                   K2Node_DynamicCast_AsBP_J_RPG_GI_Custom;           // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             K2Node_DynamicCast_AsCharacter;                    // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           CallFunc_GetCurrentMontage_ReturnValue;            // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DialogSystem_C_QuitDialog) == 0x000008, "Wrong alignment on BP_DialogSystem_C_QuitDialog");
static_assert(sizeof(BP_DialogSystem_C_QuitDialog) == 0x000078, "Wrong size on BP_DialogSystem_C_QuitDialog");
static_assert(offsetof(BP_DialogSystem_C_QuitDialog, self2) == 0x000000, "Member 'BP_DialogSystem_C_QuitDialog::self2' has a wrong offset!");
static_assert(offsetof(BP_DialogSystem_C_QuitDialog, PlayerController) == 0x000008, "Member 'BP_DialogSystem_C_QuitDialog::PlayerController' has a wrong offset!");
static_assert(offsetof(BP_DialogSystem_C_QuitDialog, self3) == 0x000010, "Member 'BP_DialogSystem_C_QuitDialog::self3' has a wrong offset!");
static_assert(offsetof(BP_DialogSystem_C_QuitDialog, DontRegisterDialog) == 0x000018, "Member 'BP_DialogSystem_C_QuitDialog::DontRegisterDialog' has a wrong offset!");
static_assert(offsetof(BP_DialogSystem_C_QuitDialog, CallFunc_GetGameInstance_ReturnValue) == 0x000020, "Member 'BP_DialogSystem_C_QuitDialog::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DialogSystem_C_QuitDialog, K2Node_DynamicCast_AsBP_J_RPG_GI_Custom) == 0x000028, "Member 'BP_DialogSystem_C_QuitDialog::K2Node_DynamicCast_AsBP_J_RPG_GI_Custom' has a wrong offset!");
static_assert(offsetof(BP_DialogSystem_C_QuitDialog, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'BP_DialogSystem_C_QuitDialog::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_DialogSystem_C_QuitDialog, CallFunc_GetPlayerController_ReturnValue) == 0x000038, "Member 'BP_DialogSystem_C_QuitDialog::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DialogSystem_C_QuitDialog, CallFunc_GetPlayerPawn_ReturnValue) == 0x000040, "Member 'BP_DialogSystem_C_QuitDialog::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DialogSystem_C_QuitDialog, K2Node_DynamicCast_AsCharacter) == 0x000048, "Member 'BP_DialogSystem_C_QuitDialog::K2Node_DynamicCast_AsCharacter' has a wrong offset!");
static_assert(offsetof(BP_DialogSystem_C_QuitDialog, K2Node_DynamicCast_bSuccess_1) == 0x000050, "Member 'BP_DialogSystem_C_QuitDialog::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_DialogSystem_C_QuitDialog, CallFunc_GetCurrentMontage_ReturnValue) == 0x000058, "Member 'BP_DialogSystem_C_QuitDialog::CallFunc_GetCurrentMontage_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DialogSystem_C_QuitDialog, CallFunc_IsValid_ReturnValue) == 0x000060, "Member 'BP_DialogSystem_C_QuitDialog::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DialogSystem_C_QuitDialog, CallFunc_GetAnimInstance_ReturnValue) == 0x000068, "Member 'BP_DialogSystem_C_QuitDialog::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DialogSystem_C_QuitDialog, CallFunc_IsValid_ReturnValue_1) == 0x000070, "Member 'BP_DialogSystem_C_QuitDialog::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function BP_DialogSystem.BP_DialogSystem_C.AddStructDialog
// 0x0268 (0x0268 - 0x0000)
struct BP_DialogSystem_C_AddStructDialog final
{
public:
	TArray<struct FDialog_Struct>                 TargetArray;                                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FName                                   EventId;                                           // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SwitchID;                                          // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_2;          // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_3;          // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_StringToInt_ReturnValue;             // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_DialogSystem_C*                     CallFunc_AddCameraAngle_DialogSystem;              // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DoubleDouble_ReturnValue;      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             K2Node_Select_Default;                             // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0062(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_63[0x5];                                       // 0x0063(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             K2Node_Select_Default_1;                           // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             K2Node_Select_Default_2;                           // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             K2Node_Select_Default_3;                           // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_5;                              // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Select_Default_4;                           // 0x0094(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_6;                              // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9D[0x3];                                       // 0x009D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Select_Default_5;                           // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_7;                              // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Select_Default_6;                           // 0x00AC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_8;                              // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B5[0x3];                                       // 0x00B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Select_Default_7;                           // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_9;                              // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_8;                           // 0x00C8(0x0010)()
	bool                                          Temp_bool_Variable_10;                             // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_9;                           // 0x00E0(0x0010)()
	bool                                          Temp_bool_Variable_11;                             // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_10;                          // 0x00F8(0x0010)()
	int32                                         Temp_int_Variable_1;                               // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10C[0x4];                                      // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_11;                          // 0x0110(0x0010)()
	bool                                          Temp_bool_Variable_12;                             // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_121[0x3];                                      // 0x0121(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_2;                               // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_3;                               // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_13;                             // 0x012C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12D[0x3];                                      // 0x012D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_4;                               // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_5;                               // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_14;                             // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_139[0x3];                                      // 0x0139(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_6;                               // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_7;                               // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_15;                             // 0x0144(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_145[0x3];                                      // 0x0145(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_8;                               // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_9;                               // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_16;                             // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             Temp_object_Variable;                              // 0x0158(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Temp_object_Variable_1;                            // 0x0160(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_17;                             // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             K2Node_Select_Default_12;                          // 0x0170(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17C[0x4];                                      // 0x017C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0180(0x0010)()
	bool                                          CallFunc_NotEqual_TextText_ReturnValue;            // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_191[0x7];                                      // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             K2Node_Select_Default_13;                          // 0x0198(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_TextText_ReturnValue_1;          // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A1[0x3];                                      // 0x01A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default_14;                          // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_TextText_ReturnValue_2;          // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A9[0x3];                                      // 0x01A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default_15;                          // 0x01AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_TextText_ReturnValue_3;          // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B1[0x3];                                      // 0x01B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default_16;                          // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_TextText_ReturnValue_4;          // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B9[0x3];                                      // 0x01B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default_17;                          // 0x01BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_TextText_ReturnValue_5;          // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_TextText_ReturnValue_6;          // 0x01C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_TextText_ReturnValue_7;          // 0x01C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C3[0x5];                                      // 0x01C3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<bool>                                  K2Node_MakeArray_Array;                            // 0x01C8(0x0010)(ReferenceParm)
	int32                                         K2Node_Select_Default_18;                          // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Get_Item;                           // 0x01DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1DD[0x3];                                      // 0x01DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_BoolBool_ReturnValue;          // 0x01E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E5[0x3];                                      // 0x01E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_10;                              // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x01EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Select_Default_19;                          // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F9[0x3];                                      // 0x01F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x01FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_11;                              // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_204[0x4];                                      // 0x0204(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_20;                          // 0x0208(0x0010)()
	class FText                                   K2Node_Select_Default_21;                          // 0x0218(0x0010)()
	class UBP_DialogSystem_C*                     CallFunc_Add_Response_DialogSystem;                // 0x0228(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UBP_DialogSystem_C*                     CallFunc_AddDialog_DialogSystem;                   // 0x0230(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_AddDialog_DelayValue;                     // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_AddDialog_DialogEventDelay_ImplicitCast;  // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_AddDialog_DialogTypingDelay_ImplicitCast; // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_EqualEqual_DoubleDouble_A_ImplicitCast;   // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_AddCameraAngle_CameraAngle_ImplicitCast;  // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DialogSystem_C_AddStructDialog) == 0x000008, "Wrong alignment on BP_DialogSystem_C_AddStructDialog");
static_assert(sizeof(BP_DialogSystem_C_AddStructDialog) == 0x000268, "Wrong size on BP_DialogSystem_C_AddStructDialog");
static_assert(offsetof(BP_DialogSystem_C_AddStructDialog, TargetArray) == 0x000000, "Member 'BP_DialogSystem_C_AddStructDialog::TargetArray' has a wrong offset!");
static_assert(offsetof(BP_DialogSystem_C_AddStructDialog, EventId) == 0x000010, "Member 'BP_DialogSystem_C_AddStructDialog::EventId' has a wrong offset!");
static_assert(offsetof(BP_DialogSystem_C_AddStructDialog, SwitchID) == 0x000018, "Member 'BP_DialogSystem_C_AddStructDialog::SwitchID' has a wrong offset!");
static_assert(offsetof(BP_DialogSystem_C_AddStructDialog, Temp_int_Variable) == 0x00001C, "Member 'BP_DialogSystem_C_AddStructDialog::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_DialogSystem_C_AddStructDialog, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000020, "Member 'BP_DialogSystem_C_AddStructDialog::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DialogSystem_C_AddStructDialog, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000021, "Member 'BP_DialogSystem_C_AddStructDialog::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DialogSystem_C_AddStructDialog, CallFunc_EqualEqual_IntInt_ReturnValue_2) == 0x000022, "Member 'BP_DialogSystem_C_AddStructDialog::CallFunc_EqualEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_DialogSystem_C_AddStructDialog, CallFunc_EqualEqual_IntInt_ReturnValue_3) == 0x000023, "Member 'BP_DialogSystem_C_AddStructDialog::CallFunc_EqualEqual_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_DialogSystem_C_AddStructDialog, CallFunc_Conv_NameToString_ReturnValue) == 0x000028, "Member 'BP_DialogSystem_C_AddStructDialog::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DialogSystem_C_AddStructDialog, Temp_bool_Variable) == 0x000038, "Member 'BP_DialogSystem_C_AddStructDialog::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_DialogSystem_C_AddStructDialog, CallFunc_Conv_StringToInt_ReturnValue) == 0x00003C, "Member 'BP_DialogSystem_C_AddStructDialog::CallFunc_Conv_StringToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DialogSystem_C_AddStructDialog, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000040, "Member 'BP_DialogSystem_C_AddStructDialog::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DialogSystem_C_AddStructDialog, CallFunc_AddCameraAngle_DialogSystem) == 0x000048, "Member 'BP_DialogSystem_C_AddStructDialog::CallFunc_AddCameraAngle_DialogSystem' has a wrong offset!");
static_assert(offsetof(BP_DialogSystem_C_AddStructDialog, CallFunc_EqualEqual_DoubleDouble_ReturnValue) == 0x000050, "Member 'BP_DialogSystem_C_AddStructDialog::CallFunc_EqualEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DialogSystem_C_AddStructDialog, K2Node_Select_Default) == 0x000058, "Member 'BP_DialogSystem_C_AddStructDialog::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_DialogSystem_C_AddStructDialog, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000060, "Member 'BP_DialogSystem_C_AddStructDialog::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DialogSystem_C_AddStructDialog, Temp_bool_Variable_1) == 0x000061, "Member 'BP_DialogSystem_C_AddStructDialog::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_DialogSystem_C_AddStructDialog, Temp_bool_Variable_2) == 0x000062, "Member 'BP_DialogSystem_C_AddStructDialog::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_DialogSystem_C_AddStructDialog, K2Node_Select_Default_1) == 0x000068, "Member 'BP_DialogSystem_C_AddStructDialog::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(BP_DialogSystem_C_AddStructDialog, Temp_bool_Variable_3) == 0x000070, "Member 'BP_DialogSystem_C_AddStructDialog::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_DialogSystem_C_AddStructDialog, K2Node_Select_Default_2) == 0x000078, "Member 'BP_DialogSystem_C_AddStructDialog::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(BP_DialogSystem_C_AddStructDialog, Temp_bool_Variable_4) == 0x000080, "Member 'BP_DialogSystem_C_AddStructDialog::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_DialogSystem_C_AddStructDialog, K2Node_Select_Default_3) == 0x000088, "Member 'BP_DialogSystem_C_AddStructDialog::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(BP_DialogSystem_C_AddStructDialog, Temp_bool_Variable_5) == 0x000090, "Member 'BP_DialogSystem_C_AddStructDialog::Temp_bool_Variable_5' has a wrong offset!");
static_assert(offsetof(BP_DialogSystem_C_AddStructDialog, K2Node_Select_Default_4) == 0x000094, "Member 'BP_DialogSystem_C_AddStructDialog::K2Node_Select_Default_4' has a wrong offset!");
static_assert(offsetof(BP_DialogSystem_C_AddStructDialog, Temp_bool_Variable_6) == 0x00009C, "Member 'BP_DialogSystem_C_AddStructDialog::Temp_bool_Variable_6' has a wrong offset!");
static_assert(offsetof(BP_DialogSystem_C_AddStructDialog, K2Node_Select_Default_5) == 0x0000A0, "Member 'BP_DialogSystem_C_AddStructDialog::K2Node_Select_Default_5' has a wrong offset!");
static_assert(offsetof(BP_DialogSystem_C_AddStructDialog, Temp_bool_Variable_7) == 0x0000A8, "Member 'BP_DialogSystem_C_AddStructDialog::Temp_bool_Variable_7' has a wrong offset!");
static_assert(offsetof(BP_DialogSystem_C_AddStructDialog, K2Node_Select_Default_6) == 0x0000AC, "Member 'BP_DialogSystem_C_AddStructDialog::K2Node_Select_Default_6' has a wrong offset!");
static_assert(offsetof(BP_DialogSystem_C_AddStructDialog, Temp_bool_Variable_8) == 0x0000B4, "Member 'BP_DialogSystem_C_AddStructDialog::Temp_bool_Variable_8' has a wrong offset!");
static_assert(offsetof(BP_DialogSystem_C_AddStructDialog, K2Node_Select_Default_7) == 0x0000B8, "Member 'BP_DialogSystem_C_AddStructDialog::K2Node_Select_Default_7' has a wrong offset!");
static_assert(offsetof(BP_DialogSystem_C_AddStructDialog, Temp_bool_Variable_9) == 0x0000C0, "Member 'BP_DialogSystem_C_AddStructDialog::Temp_bool_Variable_9' has a wrong offset!");
static_assert(offsetof(BP_DialogSystem_C_AddStructDialog, K2Node_Select_Default_8) == 0x0000C8, "Member 'BP_DialogSystem_C_AddStructDialog::K2Node_Select_Default_8' has a wrong offset!");
static_assert(offsetof(BP_DialogSystem_C_AddStructDialog, Temp_bool_Variable_10) == 0x0000D8, "Member 'BP_DialogSystem_C_AddStructDialog::Temp_bool_Variable_10' has a wrong offset!");
static_assert(offsetof(BP_DialogSystem_C_AddStructDialog, K2Node_Select_Default_9) == 0x0000E0, "Member 'BP_DialogSystem_C_AddStructDialog::K2Node_Select_Default_9' has a wrong offset!");
static_assert(offsetof(BP_DialogSystem_C_AddStructDialog, Temp_bool_Variable_11) == 0x0000F0, "Member 'BP_DialogSystem_C_AddStructDialog::Temp_bool_Variable_11' has a wrong offset!");
static_assert(offsetof(BP_DialogSystem_C_AddStructDialog, K2Node_Select_Default_10) == 0x0000F8, "Member 'BP_DialogSystem_C_AddStructDialog::K2Node_Select_Default_10' has a wrong offset!");
static_assert(offsetof(BP_DialogSystem_C_AddStructDialog, Temp_int_Variable_1) == 0x000108, "Member 'BP_DialogSystem_C_AddStructDialog::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_DialogSystem_C_AddStructDialog, K2Node_Select_Default_11) == 0x000110, "Member 'BP_DialogSystem_C_AddStructDialog::K2Node_Select_Default_11' has a wrong offset!");
static_assert(offsetof(BP_DialogSystem_C_AddStructDialog, Temp_bool_Variable_12) == 0x000120, "Member 'BP_DialogSystem_C_AddStructDialog::Temp_bool_Variable_12' has a wrong offset!");
static_assert(offsetof(BP_DialogSystem_C_AddStructDialog, Temp_int_Variable_2) == 0x000124, "Member 'BP_DialogSystem_C_AddStructDialog::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_DialogSystem_C_AddStructDialog, Temp_int_Variable_3) == 0x000128, "Member 'BP_DialogSystem_C_AddStructDialog::Temp_int_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_DialogSystem_C_AddStructDialog, Temp_bool_Variable_13) == 0x00012C, "Member 'BP_DialogSystem_C_AddStructDialog::Temp_bool_Variable_13' has a wrong offset!");
static_assert(offsetof(BP_DialogSystem_C_AddStructDialog, Temp_int_Variable_4) == 0x000130, "Member 'BP_DialogSystem_C_AddStructDialog::Temp_int_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_DialogSystem_C_AddStructDialog, Temp_int_Variable_5) == 0x000134, "Member 'BP_DialogSystem_C_AddStructDialog::Temp_int_Variable_5' has a wrong offset!");
static_assert(offsetof(BP_DialogSystem_C_AddStructDialog, Temp_bool_Variable_14) == 0x000138, "Member 'BP_DialogSystem_C_AddStructDialog::Temp_bool_Variable_14' has a wrong offset!");
static_assert(offsetof(BP_DialogSystem_C_AddStructDialog, Temp_int_Variable_6) == 0x00013C, "Member 'BP_DialogSystem_C_AddStructDialog::Temp_int_Variable_6' has a wrong offset!");
static_assert(offsetof(BP_DialogSystem_C_AddStructDialog, Temp_int_Variable_7) == 0x000140, "Member 'BP_DialogSystem_C_AddStructDialog::Temp_int_Variable_7' has a wrong offset!");
static_assert(offsetof(BP_DialogSystem_C_AddStructDialog, Temp_bool_Variable_15) == 0x000144, "Member 'BP_DialogSystem_C_AddStructDialog::Temp_bool_Variable_15' has a wrong offset!");
static_assert(offsetof(BP_DialogSystem_C_AddStructDialog, Temp_int_Variable_8) == 0x000148, "Member 'BP_DialogSystem_C_AddStructDialog::Temp_int_Variable_8' has a wrong offset!");
static_assert(offsetof(BP_DialogSystem_C_AddStructDialog, Temp_int_Variable_9) == 0x00014C, "Member 'BP_DialogSystem_C_AddStructDialog::Temp_int_Variable_9' has a wrong offset!");
static_assert(offsetof(BP_DialogSystem_C_AddStructDialog, Temp_bool_Variable_16) == 0x000150, "Member 'BP_DialogSystem_C_AddStructDialog::Temp_bool_Variable_16' has a wrong offset!");
static_assert(offsetof(BP_DialogSystem_C_AddStructDialog, Temp_object_Variable) == 0x000158, "Member 'BP_DialogSystem_C_AddStructDialog::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_DialogSystem_C_AddStructDialog, Temp_object_Variable_1) == 0x000160, "Member 'BP_DialogSystem_C_AddStructDialog::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_DialogSystem_C_AddStructDialog, Temp_bool_Variable_17) == 0x000168, "Member 'BP_DialogSystem_C_AddStructDialog::Temp_bool_Variable_17' has a wrong offset!");
static_assert(offsetof(BP_DialogSystem_C_AddStructDialog, K2Node_Select_Default_12) == 0x000170, "Member 'BP_DialogSystem_C_AddStructDialog::K2Node_Select_Default_12' has a wrong offset!");
static_assert(offsetof(BP_DialogSystem_C_AddStructDialog, Temp_int_Array_Index_Variable) == 0x000178, "Member 'BP_DialogSystem_C_AddStructDialog::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_DialogSystem_C_AddStructDialog, CallFunc_MakeLiteralText_ReturnValue) == 0x000180, "Member 'BP_DialogSystem_C_AddStructDialog::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DialogSystem_C_AddStructDialog, CallFunc_NotEqual_TextText_ReturnValue) == 0x000190, "Member 'BP_DialogSystem_C_AddStructDialog::CallFunc_NotEqual_TextText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DialogSystem_C_AddStructDialog, K2Node_Select_Default_13) == 0x000198, "Member 'BP_DialogSystem_C_AddStructDialog::K2Node_Select_Default_13' has a wrong offset!");
static_assert(offsetof(BP_DialogSystem_C_AddStructDialog, CallFunc_NotEqual_TextText_ReturnValue_1) == 0x0001A0, "Member 'BP_DialogSystem_C_AddStructDialog::CallFunc_NotEqual_TextText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DialogSystem_C_AddStructDialog, K2Node_Select_Default_14) == 0x0001A4, "Member 'BP_DialogSystem_C_AddStructDialog::K2Node_Select_Default_14' has a wrong offset!");
static_assert(offsetof(BP_DialogSystem_C_AddStructDialog, CallFunc_NotEqual_TextText_ReturnValue_2) == 0x0001A8, "Member 'BP_DialogSystem_C_AddStructDialog::CallFunc_NotEqual_TextText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_DialogSystem_C_AddStructDialog, K2Node_Select_Default_15) == 0x0001AC, "Member 'BP_DialogSystem_C_AddStructDialog::K2Node_Select_Default_15' has a wrong offset!");
static_assert(offsetof(BP_DialogSystem_C_AddStructDialog, CallFunc_NotEqual_TextText_ReturnValue_3) == 0x0001B0, "Member 'BP_DialogSystem_C_AddStructDialog::CallFunc_NotEqual_TextText_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_DialogSystem_C_AddStructDialog, K2Node_Select_Default_16) == 0x0001B4, "Member 'BP_DialogSystem_C_AddStructDialog::K2Node_Select_Default_16' has a wrong offset!");
static_assert(offsetof(BP_DialogSystem_C_AddStructDialog, CallFunc_NotEqual_TextText_ReturnValue_4) == 0x0001B8, "Member 'BP_DialogSystem_C_AddStructDialog::CallFunc_NotEqual_TextText_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_DialogSystem_C_AddStructDialog, K2Node_Select_Default_17) == 0x0001BC, "Member 'BP_DialogSystem_C_AddStructDialog::K2Node_Select_Default_17' has a wrong offset!");
static_assert(offsetof(BP_DialogSystem_C_AddStructDialog, CallFunc_NotEqual_TextText_ReturnValue_5) == 0x0001C0, "Member 'BP_DialogSystem_C_AddStructDialog::CallFunc_NotEqual_TextText_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_DialogSystem_C_AddStructDialog, CallFunc_NotEqual_TextText_ReturnValue_6) == 0x0001C1, "Member 'BP_DialogSystem_C_AddStructDialog::CallFunc_NotEqual_TextText_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_DialogSystem_C_AddStructDialog, CallFunc_NotEqual_TextText_ReturnValue_7) == 0x0001C2, "Member 'BP_DialogSystem_C_AddStructDialog::CallFunc_NotEqual_TextText_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_DialogSystem_C_AddStructDialog, K2Node_MakeArray_Array) == 0x0001C8, "Member 'BP_DialogSystem_C_AddStructDialog::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_DialogSystem_C_AddStructDialog, K2Node_Select_Default_18) == 0x0001D8, "Member 'BP_DialogSystem_C_AddStructDialog::K2Node_Select_Default_18' has a wrong offset!");
static_assert(offsetof(BP_DialogSystem_C_AddStructDialog, CallFunc_Array_Get_Item) == 0x0001DC, "Member 'BP_DialogSystem_C_AddStructDialog::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_DialogSystem_C_AddStructDialog, CallFunc_Array_Length_ReturnValue) == 0x0001E0, "Member 'BP_DialogSystem_C_AddStructDialog::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DialogSystem_C_AddStructDialog, CallFunc_EqualEqual_BoolBool_ReturnValue) == 0x0001E4, "Member 'BP_DialogSystem_C_AddStructDialog::CallFunc_EqualEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DialogSystem_C_AddStructDialog, Temp_int_Variable_10) == 0x0001E8, "Member 'BP_DialogSystem_C_AddStructDialog::Temp_int_Variable_10' has a wrong offset!");
static_assert(offsetof(BP_DialogSystem_C_AddStructDialog, Temp_int_Loop_Counter_Variable) == 0x0001EC, "Member 'BP_DialogSystem_C_AddStructDialog::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_DialogSystem_C_AddStructDialog, K2Node_Select_Default_19) == 0x0001F0, "Member 'BP_DialogSystem_C_AddStructDialog::K2Node_Select_Default_19' has a wrong offset!");
static_assert(offsetof(BP_DialogSystem_C_AddStructDialog, CallFunc_Less_IntInt_ReturnValue) == 0x0001F8, "Member 'BP_DialogSystem_C_AddStructDialog::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DialogSystem_C_AddStructDialog, CallFunc_Add_IntInt_ReturnValue) == 0x0001FC, "Member 'BP_DialogSystem_C_AddStructDialog::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DialogSystem_C_AddStructDialog, Temp_int_Variable_11) == 0x000200, "Member 'BP_DialogSystem_C_AddStructDialog::Temp_int_Variable_11' has a wrong offset!");
static_assert(offsetof(BP_DialogSystem_C_AddStructDialog, K2Node_Select_Default_20) == 0x000208, "Member 'BP_DialogSystem_C_AddStructDialog::K2Node_Select_Default_20' has a wrong offset!");
static_assert(offsetof(BP_DialogSystem_C_AddStructDialog, K2Node_Select_Default_21) == 0x000218, "Member 'BP_DialogSystem_C_AddStructDialog::K2Node_Select_Default_21' has a wrong offset!");
static_assert(offsetof(BP_DialogSystem_C_AddStructDialog, CallFunc_Add_Response_DialogSystem) == 0x000228, "Member 'BP_DialogSystem_C_AddStructDialog::CallFunc_Add_Response_DialogSystem' has a wrong offset!");
static_assert(offsetof(BP_DialogSystem_C_AddStructDialog, CallFunc_AddDialog_DialogSystem) == 0x000230, "Member 'BP_DialogSystem_C_AddStructDialog::CallFunc_AddDialog_DialogSystem' has a wrong offset!");
static_assert(offsetof(BP_DialogSystem_C_AddStructDialog, CallFunc_AddDialog_DelayValue) == 0x000238, "Member 'BP_DialogSystem_C_AddStructDialog::CallFunc_AddDialog_DelayValue' has a wrong offset!");
static_assert(offsetof(BP_DialogSystem_C_AddStructDialog, CallFunc_AddDialog_DialogEventDelay_ImplicitCast) == 0x000240, "Member 'BP_DialogSystem_C_AddStructDialog::CallFunc_AddDialog_DialogEventDelay_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_DialogSystem_C_AddStructDialog, CallFunc_AddDialog_DialogTypingDelay_ImplicitCast) == 0x000248, "Member 'BP_DialogSystem_C_AddStructDialog::CallFunc_AddDialog_DialogTypingDelay_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_DialogSystem_C_AddStructDialog, CallFunc_Greater_DoubleDouble_A_ImplicitCast) == 0x000250, "Member 'BP_DialogSystem_C_AddStructDialog::CallFunc_Greater_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_DialogSystem_C_AddStructDialog, CallFunc_EqualEqual_DoubleDouble_A_ImplicitCast) == 0x000258, "Member 'BP_DialogSystem_C_AddStructDialog::CallFunc_EqualEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_DialogSystem_C_AddStructDialog, CallFunc_AddCameraAngle_CameraAngle_ImplicitCast) == 0x000260, "Member 'BP_DialogSystem_C_AddStructDialog::CallFunc_AddCameraAngle_CameraAngle_ImplicitCast' has a wrong offset!");

// Function BP_DialogSystem.BP_DialogSystem_C.AddDataTable
// 0x03C0 (0x03C0 - 0x0000)
struct BP_DialogSystem_C_AddDataTable final
{
public:
	class UDataTable*                             DataTable_0;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   RowName;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SwitchID;                                          // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_2;          // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_3;          // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_4;          // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_5;          // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_6;          // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_7;          // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x001F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames;         // 0x0020(0x0010)(ReferenceParm)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_5;                              // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_6;                              // 0x003E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_7;                              // 0x003F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_8;                              // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_9;                              // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42[0x2];                                       // 0x0042(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
