#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Destructible_SerializableComponent

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_Destructible_SerializableComponent.BP_Destructible_SerializableComponent_C.ExecuteUbergraph_BP_Destructible_SerializableComponent
// 0x0004 (0x0004 - 0x0000)
struct BP_Destructible_SerializableComponent_C_ExecuteUbergraph_BP_Destructible_SerializableComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Destructible_SerializableComponent_C_ExecuteUbergraph_BP_Destructible_SerializableComponent) == 0x000004, "Wrong alignment on BP_Destructible_SerializableComponent_C_ExecuteUbergraph_BP_Destructible_SerializableComponent");
static_assert(sizeof(BP_Destructible_SerializableComponent_C_ExecuteUbergraph_BP_Destructible_SerializableComponent) == 0x000004, "Wrong size on BP_Destructible_SerializableComponent_C_ExecuteUbergraph_BP_Destructible_SerializableComponent");
static_assert(offsetof(BP_Destructible_SerializableComponent_C_ExecuteUbergraph_BP_Destructible_SerializableComponent, EntryPoint) == 0x000000, "Member 'BP_Destructible_SerializableComponent_C_ExecuteUbergraph_BP_Destructible_SerializableComponent::EntryPoint' has a wrong offset!");

// Function BP_Destructible_SerializableComponent.BP_Destructible_SerializableComponent_C.ReadState
// 0x0020 (0x0020 - 0x0000)
struct BP_Destructible_SerializableComponent_C_ReadState final
{
public:
	bool                                          Destroyed;                                         // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetGlobalObjectID_ObjectID;               // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_jRPG_GI_Custom_C*                   CallFunc_GetCustomGI_ReturnValue;                  // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_Value;                           // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Destructible_SerializableComponent_C_ReadState) == 0x000008, "Wrong alignment on BP_Destructible_SerializableComponent_C_ReadState");
static_assert(sizeof(BP_Destructible_SerializableComponent_C_ReadState) == 0x000020, "Wrong size on BP_Destructible_SerializableComponent_C_ReadState");
static_assert(offsetof(BP_Destructible_SerializableComponent_C_ReadState, Destroyed) == 0x000000, "Member 'BP_Destructible_SerializableComponent_C_ReadState::Destroyed' has a wrong offset!");
static_assert(offsetof(BP_Destructible_SerializableComponent_C_ReadState, CallFunc_GetGlobalObjectID_ObjectID) == 0x000004, "Member 'BP_Destructible_SerializableComponent_C_ReadState::CallFunc_GetGlobalObjectID_ObjectID' has a wrong offset!");
static_assert(offsetof(BP_Destructible_SerializableComponent_C_ReadState, CallFunc_GetCustomGI_ReturnValue) == 0x000010, "Member 'BP_Destructible_SerializableComponent_C_ReadState::CallFunc_GetCustomGI_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Destructible_SerializableComponent_C_ReadState, CallFunc_Map_Find_Value) == 0x000018, "Member 'BP_Destructible_SerializableComponent_C_ReadState::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BP_Destructible_SerializableComponent_C_ReadState, CallFunc_Map_Find_ReturnValue) == 0x000019, "Member 'BP_Destructible_SerializableComponent_C_ReadState::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Destructible_SerializableComponent_C_ReadState, CallFunc_BooleanAND_ReturnValue) == 0x00001A, "Member 'BP_Destructible_SerializableComponent_C_ReadState::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BP_Destructible_SerializableComponent.BP_Destructible_SerializableComponent_C.SaveState
// 0x0018 (0x0018 - 0x0000)
struct BP_Destructible_SerializableComponent_C_SaveState final
{
public:
	bool                                          Destroyed;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetGlobalObjectID_ObjectID;               // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_jRPG_GI_Custom_C*                   CallFunc_GetCustomGI_ReturnValue;                  // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Destructible_SerializableComponent_C_SaveState) == 0x000008, "Wrong alignment on BP_Destructible_SerializableComponent_C_SaveState");
static_assert(sizeof(BP_Destructible_SerializableComponent_C_SaveState) == 0x000018, "Wrong size on BP_Destructible_SerializableComponent_C_SaveState");
static_assert(offsetof(BP_Destructible_SerializableComponent_C_SaveState, Destroyed) == 0x000000, "Member 'BP_Destructible_SerializableComponent_C_SaveState::Destroyed' has a wrong offset!");
static_assert(offsetof(BP_Destructible_SerializableComponent_C_SaveState, CallFunc_GetGlobalObjectID_ObjectID) == 0x000004, "Member 'BP_Destructible_SerializableComponent_C_SaveState::CallFunc_GetGlobalObjectID_ObjectID' has a wrong offset!");
static_assert(offsetof(BP_Destructible_SerializableComponent_C_SaveState, CallFunc_GetCustomGI_ReturnValue) == 0x000010, "Member 'BP_Destructible_SerializableComponent_C_SaveState::CallFunc_GetCustomGI_ReturnValue' has a wrong offset!");

}

