#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DataAsset_Item_CharacterCustomization

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "S_jRPG_Item_DynamicData_structs.hpp"
#include "E_CustomizationItemType_structs.hpp"
#include "S_jRPG_CharacterDefinition_structs.hpp"


namespace SDK::Params
{

// Function BP_DataAsset_Item_CharacterCustomization.BP_DataAsset_Item_CharacterCustomization_C.OnRemovedFromInventory
// 0x03E0 (0x03E0 - 0x0000)
struct BP_DataAsset_Item_CharacterCustomization_C_OnRemovedFromInventory final
{
public:
	class UBP_jRPG_GI_Custom_C*                   GameInstance;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAC_jRPG_InventoryManager_C*            InventoryManager;                                  // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   ItemId;                                            // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_wildcard_Variable;                            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetCharacterHardcodedNameFromUser_CharacterHardcodedName; // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_NameToText_ReturnValue;              // 0x0028(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0038(0x0048)(HasGetValueTypeHash)
	struct FS_jRPG_CharacterDefinition            CallFunc_GetDataTableRowFromName_OutRow;           // 0x0080(0x0328)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x03A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A9[0x7];                                      // 0x03A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x03B0(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Format_ReturnValue;                       // 0x03C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UBP_CharacterData_C*                    CallFunc_GetCharacterByID_CharacterData;           // 0x03D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasCharacterInCollectionByID_ReturnValue; // 0x03D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DataAsset_Item_CharacterCustomization_C_OnRemovedFromInventory) == 0x000008, "Wrong alignment on BP_DataAsset_Item_CharacterCustomization_C_OnRemovedFromInventory");
static_assert(sizeof(BP_DataAsset_Item_CharacterCustomization_C_OnRemovedFromInventory) == 0x0003E0, "Wrong size on BP_DataAsset_Item_CharacterCustomization_C_OnRemovedFromInventory");
static_assert(offsetof(BP_DataAsset_Item_CharacterCustomization_C_OnRemovedFromInventory, GameInstance) == 0x000000, "Member 'BP_DataAsset_Item_CharacterCustomization_C_OnRemovedFromInventory::GameInstance' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_Item_CharacterCustomization_C_OnRemovedFromInventory, InventoryManager) == 0x000008, "Member 'BP_DataAsset_Item_CharacterCustomization_C_OnRemovedFromInventory::InventoryManager' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_Item_CharacterCustomization_C_OnRemovedFromInventory, ItemId) == 0x000010, "Member 'BP_DataAsset_Item_CharacterCustomization_C_OnRemovedFromInventory::ItemId' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_Item_CharacterCustomization_C_OnRemovedFromInventory, Temp_wildcard_Variable) == 0x000018, "Member 'BP_DataAsset_Item_CharacterCustomization_C_OnRemovedFromInventory::Temp_wildcard_Variable' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_Item_CharacterCustomization_C_OnRemovedFromInventory, CallFunc_GetCharacterHardcodedNameFromUser_CharacterHardcodedName) == 0x000020, "Member 'BP_DataAsset_Item_CharacterCustomization_C_OnRemovedFromInventory::CallFunc_GetCharacterHardcodedNameFromUser_CharacterHardcodedName' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_Item_CharacterCustomization_C_OnRemovedFromInventory, CallFunc_Conv_NameToText_ReturnValue) == 0x000028, "Member 'BP_DataAsset_Item_CharacterCustomization_C_OnRemovedFromInventory::CallFunc_Conv_NameToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_Item_CharacterCustomization_C_OnRemovedFromInventory, K2Node_MakeStruct_FormatArgumentData) == 0x000038, "Member 'BP_DataAsset_Item_CharacterCustomization_C_OnRemovedFromInventory::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_Item_CharacterCustomization_C_OnRemovedFromInventory, CallFunc_GetDataTableRowFromName_OutRow) == 0x000080, "Member 'BP_DataAsset_Item_CharacterCustomization_C_OnRemovedFromInventory::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_Item_CharacterCustomization_C_OnRemovedFromInventory, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x0003A8, "Member 'BP_DataAsset_Item_CharacterCustomization_C_OnRemovedFromInventory::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_Item_CharacterCustomization_C_OnRemovedFromInventory, K2Node_MakeArray_Array) == 0x0003B0, "Member 'BP_DataAsset_Item_CharacterCustomization_C_OnRemovedFromInventory::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_Item_CharacterCustomization_C_OnRemovedFromInventory, CallFunc_Format_ReturnValue) == 0x0003C0, "Member 'BP_DataAsset_Item_CharacterCustomization_C_OnRemovedFromInventory::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_Item_CharacterCustomization_C_OnRemovedFromInventory, CallFunc_GetCharacterByID_CharacterData) == 0x0003D0, "Member 'BP_DataAsset_Item_CharacterCustomization_C_OnRemovedFromInventory::CallFunc_GetCharacterByID_CharacterData' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_Item_CharacterCustomization_C_OnRemovedFromInventory, CallFunc_HasCharacterInCollectionByID_ReturnValue) == 0x0003D8, "Member 'BP_DataAsset_Item_CharacterCustomization_C_OnRemovedFromInventory::CallFunc_HasCharacterInCollectionByID_ReturnValue' has a wrong offset!");

// Function BP_DataAsset_Item_CharacterCustomization.BP_DataAsset_Item_CharacterCustomization_C.UpdateCharacterCustomization_Internal
// 0x00F0 (0x00F0 - 0x0000)
struct BP_DataAsset_Item_CharacterCustomization_C_UpdateCharacterCustomization_Internal final
{
public:
	class UBP_CharacterData_C*                    CharacterData;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0018(0x0010)()
	class FText                                   CallFunc_Conv_NameToText_ReturnValue;              // 0x0028(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0038(0x0048)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0080(0x0048)(HasGetValueTypeHash)
	bool                                          CallFunc_IsItemCompatibleWithCharacter_Compatible; // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00D0(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Format_ReturnValue;                       // 0x00E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DataAsset_Item_CharacterCustomization_C_UpdateCharacterCustomization_Internal) == 0x000008, "Wrong alignment on BP_DataAsset_Item_CharacterCustomization_C_UpdateCharacterCustomization_Internal");
static_assert(sizeof(BP_DataAsset_Item_CharacterCustomization_C_UpdateCharacterCustomization_Internal) == 0x0000F0, "Wrong size on BP_DataAsset_Item_CharacterCustomization_C_UpdateCharacterCustomization_Internal");
static_assert(offsetof(BP_DataAsset_Item_CharacterCustomization_C_UpdateCharacterCustomization_Internal, CharacterData) == 0x000000, "Member 'BP_DataAsset_Item_CharacterCustomization_C_UpdateCharacterCustomization_Internal::CharacterData' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_Item_CharacterCustomization_C_UpdateCharacterCustomization_Internal, CallFunc_GetDisplayName_ReturnValue) == 0x000008, "Member 'BP_DataAsset_Item_CharacterCustomization_C_UpdateCharacterCustomization_Internal::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_Item_CharacterCustomization_C_UpdateCharacterCustomization_Internal, CallFunc_Conv_StringToText_ReturnValue) == 0x000018, "Member 'BP_DataAsset_Item_CharacterCustomization_C_UpdateCharacterCustomization_Internal::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_Item_CharacterCustomization_C_UpdateCharacterCustomization_Internal, CallFunc_Conv_NameToText_ReturnValue) == 0x000028, "Member 'BP_DataAsset_Item_CharacterCustomization_C_UpdateCharacterCustomization_Internal::CallFunc_Conv_NameToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_Item_CharacterCustomization_C_UpdateCharacterCustomization_Internal, K2Node_MakeStruct_FormatArgumentData) == 0x000038, "Member 'BP_DataAsset_Item_CharacterCustomization_C_UpdateCharacterCustomization_Internal::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_Item_CharacterCustomization_C_UpdateCharacterCustomization_Internal, K2Node_MakeStruct_FormatArgumentData_1) == 0x000080, "Member 'BP_DataAsset_Item_CharacterCustomization_C_UpdateCharacterCustomization_Internal::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_Item_CharacterCustomization_C_UpdateCharacterCustomization_Internal, CallFunc_IsItemCompatibleWithCharacter_Compatible) == 0x0000C8, "Member 'BP_DataAsset_Item_CharacterCustomization_C_UpdateCharacterCustomization_Internal::CallFunc_IsItemCompatibleWithCharacter_Compatible' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_Item_CharacterCustomization_C_UpdateCharacterCustomization_Internal, K2Node_MakeArray_Array) == 0x0000D0, "Member 'BP_DataAsset_Item_CharacterCustomization_C_UpdateCharacterCustomization_Internal::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_Item_CharacterCustomization_C_UpdateCharacterCustomization_Internal, CallFunc_Format_ReturnValue) == 0x0000E0, "Member 'BP_DataAsset_Item_CharacterCustomization_C_UpdateCharacterCustomization_Internal::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function BP_DataAsset_Item_CharacterCustomization.BP_DataAsset_Item_CharacterCustomization_C.GetFirstCustomizationItem
// 0x01C0 (0x01C0 - 0x0000)
struct BP_DataAsset_Item_CharacterCustomization_C_GetFirstCustomizationItem final
{
public:
	class UAC_jRPG_InventoryManager_C*            InventoryManager;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	E_CustomizationItemType                       CustomizationItemType;                             // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ItemName;                                          // 0x000C(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FS_jRPG_Item_DynamicData>       CallFunc_GetOwnedItemsByType_FilteredArray;        // 0x0018(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_jRPG_Item_DynamicData               CallFunc_Array_Get_Item;                           // 0x0030(0x0138)(ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16C[0x4];                                      // 0x016C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_DataAsset_Item_CharacterFace_C*     K2Node_DynamicCast_AsBP_Data_Asset_Item_Character_Face; // 0x0170(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_179[0x7];                                      // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_DataAsset_Item_CharacterSkin_C*     K2Node_DynamicCast_AsBP_Data_Asset_Item_Character_Skin; // 0x0180(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0189(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18A[0x2];                                      // 0x018A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetCharacterHardcodedNameFromUser_CharacterHardcodedName; // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_DataAsset_Item_CharacterCustomization_C* Temp_object_Variable;                         // 0x0198(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	E_CustomizationItemType                       Temp_byte_Variable;                                // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A1[0x7];                                      // 0x01A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_DataAsset_Item_CharacterCustomization_C* K2Node_Select_Default;                        // 0x01A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B1[0x3];                                      // 0x01B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetCharacterHardcodedNameFromUser_CharacterHardcodedName_1; // 0x01B4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x01BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DataAsset_Item_CharacterCustomization_C_GetFirstCustomizationItem) == 0x000008, "Wrong alignment on BP_DataAsset_Item_CharacterCustomization_C_GetFirstCustomizationItem");
static_assert(sizeof(BP_DataAsset_Item_CharacterCustomization_C_GetFirstCustomizationItem) == 0x0001C0, "Wrong size on BP_DataAsset_Item_CharacterCustomization_C_GetFirstCustomizationItem");
static_assert(offsetof(BP_DataAsset_Item_CharacterCustomization_C_GetFirstCustomizationItem, InventoryManager) == 0x000000, "Member 'BP_DataAsset_Item_CharacterCustomization_C_GetFirstCustomizationItem::InventoryManager' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_Item_CharacterCustomization_C_GetFirstCustomizationItem, CustomizationItemType) == 0x000008, "Member 'BP_DataAsset_Item_CharacterCustomization_C_GetFirstCustomizationItem::CustomizationItemType' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_Item_CharacterCustomization_C_GetFirstCustomizationItem, ItemName) == 0x00000C, "Member 'BP_DataAsset_Item_CharacterCustomization_C_GetFirstCustomizationItem::ItemName' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_Item_CharacterCustomization_C_GetFirstCustomizationItem, CallFunc_GetOwnedItemsByType_FilteredArray) == 0x000018, "Member 'BP_DataAsset_Item_CharacterCustomization_C_GetFirstCustomizationItem::CallFunc_GetOwnedItemsByType_FilteredArray' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_Item_CharacterCustomization_C_GetFirstCustomizationItem, Temp_int_Array_Index_Variable) == 0x000028, "Member 'BP_DataAsset_Item_CharacterCustomization_C_GetFirstCustomizationItem::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_Item_CharacterCustomization_C_GetFirstCustomizationItem, CallFunc_Array_Length_ReturnValue) == 0x00002C, "Member 'BP_DataAsset_Item_CharacterCustomization_C_GetFirstCustomizationItem::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_Item_CharacterCustomization_C_GetFirstCustomizationItem, CallFunc_Array_Get_Item) == 0x000030, "Member 'BP_DataAsset_Item_CharacterCustomization_C_GetFirstCustomizationItem::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_Item_CharacterCustomization_C_GetFirstCustomizationItem, Temp_int_Loop_Counter_Variable) == 0x000168, "Member 'BP_DataAsset_Item_CharacterCustomization_C_GetFirstCustomizationItem::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_Item_CharacterCustomization_C_GetFirstCustomizationItem, K2Node_DynamicCast_AsBP_Data_Asset_Item_Character_Face) == 0x000170, "Member 'BP_DataAsset_Item_CharacterCustomization_C_GetFirstCustomizationItem::K2Node_DynamicCast_AsBP_Data_Asset_Item_Character_Face' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_Item_CharacterCustomization_C_GetFirstCustomizationItem, K2Node_DynamicCast_bSuccess) == 0x000178, "Member 'BP_DataAsset_Item_CharacterCustomization_C_GetFirstCustomizationItem::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_Item_CharacterCustomization_C_GetFirstCustomizationItem, K2Node_DynamicCast_AsBP_Data_Asset_Item_Character_Skin) == 0x000180, "Member 'BP_DataAsset_Item_CharacterCustomization_C_GetFirstCustomizationItem::K2Node_DynamicCast_AsBP_Data_Asset_Item_Character_Skin' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_Item_CharacterCustomization_C_GetFirstCustomizationItem, K2Node_DynamicCast_bSuccess_1) == 0x000188, "Member 'BP_DataAsset_Item_CharacterCustomization_C_GetFirstCustomizationItem::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_Item_CharacterCustomization_C_GetFirstCustomizationItem, CallFunc_Less_IntInt_ReturnValue) == 0x000189, "Member 'BP_DataAsset_Item_CharacterCustomization_C_GetFirstCustomizationItem::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_Item_CharacterCustomization_C_GetFirstCustomizationItem, CallFunc_Add_IntInt_ReturnValue) == 0x00018C, "Member 'BP_DataAsset_Item_CharacterCustomization_C_GetFirstCustomizationItem::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_Item_CharacterCustomization_C_GetFirstCustomizationItem, CallFunc_GetCharacterHardcodedNameFromUser_CharacterHardcodedName) == 0x000190, "Member 'BP_DataAsset_Item_CharacterCustomization_C_GetFirstCustomizationItem::CallFunc_GetCharacterHardcodedNameFromUser_CharacterHardcodedName' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_Item_CharacterCustomization_C_GetFirstCustomizationItem, Temp_object_Variable) == 0x000198, "Member 'BP_DataAsset_Item_CharacterCustomization_C_GetFirstCustomizationItem::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_Item_CharacterCustomization_C_GetFirstCustomizationItem, Temp_byte_Variable) == 0x0001A0, "Member 'BP_DataAsset_Item_CharacterCustomization_C_GetFirstCustomizationItem::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_Item_CharacterCustomization_C_GetFirstCustomizationItem, K2Node_Select_Default) == 0x0001A8, "Member 'BP_DataAsset_Item_CharacterCustomization_C_GetFirstCustomizationItem::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_Item_CharacterCustomization_C_GetFirstCustomizationItem, CallFunc_IsValid_ReturnValue) == 0x0001B0, "Member 'BP_DataAsset_Item_CharacterCustomization_C_GetFirstCustomizationItem::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_Item_CharacterCustomization_C_GetFirstCustomizationItem, CallFunc_GetCharacterHardcodedNameFromUser_CharacterHardcodedName_1) == 0x0001B4, "Member 'BP_DataAsset_Item_CharacterCustomization_C_GetFirstCustomizationItem::CallFunc_GetCharacterHardcodedNameFromUser_CharacterHardcodedName_1' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_Item_CharacterCustomization_C_GetFirstCustomizationItem, CallFunc_EqualEqual_NameName_ReturnValue) == 0x0001BC, "Member 'BP_DataAsset_Item_CharacterCustomization_C_GetFirstCustomizationItem::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");

// Function BP_DataAsset_Item_CharacterCustomization.BP_DataAsset_Item_CharacterCustomization_C.GetCharacterHardcodedNameFromUser
// 0x000C (0x000C - 0x0000)
struct BP_DataAsset_Item_CharacterCustomization_C_GetCharacterHardcodedNameFromUser final
{
public:
	class FName                                   CharacterHardcodedName;                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DataAsset_Item_CharacterCustomization_C_GetCharacterHardcodedNameFromUser) == 0x000004, "Wrong alignment on BP_DataAsset_Item_CharacterCustomization_C_GetCharacterHardcodedNameFromUser");
static_assert(sizeof(BP_DataAsset_Item_CharacterCustomization_C_GetCharacterHardcodedNameFromUser) == 0x00000C, "Wrong size on BP_DataAsset_Item_CharacterCustomization_C_GetCharacterHardcodedNameFromUser");
static_assert(offsetof(BP_DataAsset_Item_CharacterCustomization_C_GetCharacterHardcodedNameFromUser, CharacterHardcodedName) == 0x000000, "Member 'BP_DataAsset_Item_CharacterCustomization_C_GetCharacterHardcodedNameFromUser::CharacterHardcodedName' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_Item_CharacterCustomization_C_GetCharacterHardcodedNameFromUser, K2Node_SwitchEnum_CmpSuccess) == 0x000008, "Member 'BP_DataAsset_Item_CharacterCustomization_C_GetCharacterHardcodedNameFromUser::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function BP_DataAsset_Item_CharacterCustomization.BP_DataAsset_Item_CharacterCustomization_C.IsItemCompatibleWithCharacter
// 0x0018 (0x0018 - 0x0000)
struct BP_DataAsset_Item_CharacterCustomization_C_IsItemCompatibleWithCharacter final
{
public:
	class UBP_CharacterData_C*                    CharacterData;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Compatible;                                        // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetCharacterHardcodedNameFromUser_CharacterHardcodedName; // 0x000C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DataAsset_Item_CharacterCustomization_C_IsItemCompatibleWithCharacter) == 0x000008, "Wrong alignment on BP_DataAsset_Item_CharacterCustomization_C_IsItemCompatibleWithCharacter");
static_assert(sizeof(BP_DataAsset_Item_CharacterCustomization_C_IsItemCompatibleWithCharacter) == 0x000018, "Wrong size on BP_DataAsset_Item_CharacterCustomization_C_IsItemCompatibleWithCharacter");
static_assert(offsetof(BP_DataAsset_Item_CharacterCustomization_C_IsItemCompatibleWithCharacter, CharacterData) == 0x000000, "Member 'BP_DataAsset_Item_CharacterCustomization_C_IsItemCompatibleWithCharacter::CharacterData' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_Item_CharacterCustomization_C_IsItemCompatibleWithCharacter, Compatible) == 0x000008, "Member 'BP_DataAsset_Item_CharacterCustomization_C_IsItemCompatibleWithCharacter::Compatible' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_Item_CharacterCustomization_C_IsItemCompatibleWithCharacter, CallFunc_GetCharacterHardcodedNameFromUser_CharacterHardcodedName) == 0x00000C, "Member 'BP_DataAsset_Item_CharacterCustomization_C_IsItemCompatibleWithCharacter::CallFunc_GetCharacterHardcodedNameFromUser_CharacterHardcodedName' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_Item_CharacterCustomization_C_IsItemCompatibleWithCharacter, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000014, "Member 'BP_DataAsset_Item_CharacterCustomization_C_IsItemCompatibleWithCharacter::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");

// Function BP_DataAsset_Item_CharacterCustomization.BP_DataAsset_Item_CharacterCustomization_C.UpdateCharacterCustomization
// 0x0010 (0x0010 - 0x0000)
struct BP_DataAsset_Item_CharacterCustomization_C_UpdateCharacterCustomization final
{
public:
	class UBP_CharacterData_C*                    CharacterData;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsItemCompatibleWithCharacter_Compatible; // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DataAsset_Item_CharacterCustomization_C_UpdateCharacterCustomization) == 0x000008, "Wrong alignment on BP_DataAsset_Item_CharacterCustomization_C_UpdateCharacterCustomization");
static_assert(sizeof(BP_DataAsset_Item_CharacterCustomization_C_UpdateCharacterCustomization) == 0x000010, "Wrong size on BP_DataAsset_Item_CharacterCustomization_C_UpdateCharacterCustomization");
static_assert(offsetof(BP_DataAsset_Item_CharacterCustomization_C_UpdateCharacterCustomization, CharacterData) == 0x000000, "Member 'BP_DataAsset_Item_CharacterCustomization_C_UpdateCharacterCustomization::CharacterData' has a wrong offset!");
static_assert(offsetof(BP_DataAsset_Item_CharacterCustomization_C_UpdateCharacterCustomization, CallFunc_IsItemCompatibleWithCharacter_Compatible) == 0x000008, "Member 'BP_DataAsset_Item_CharacterCustomization_C_UpdateCharacterCustomization::CallFunc_IsItemCompatibleWithCharacter_Compatible' has a wrong offset!");

}

