#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_EnviroDestructible_Props

#include "Basic.hpp"

#include "BP_EnviroDestructible_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_EnviroDestructible_Props.BP_EnviroDestructible_Props_C
// 0x0088 (0x0348 - 0x02C0)
class ABP_EnviroDestructible_Props_C : public ABP_EnviroDestructible_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_EnviroDestructible_Props_C;      // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCustomNavModifierComponent*            CustomNavModifier;                                 // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Desintegration_Alpha_2D34B7454BF37C24D008538FB1CE2F9B; // 0x02D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Desintegration__Direction_2D34B7454BF37C24D008538FB1CE2F9B; // 0x02DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2DD[0x3];                                      // 0x02DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Desintegration;                                    // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             BreakSound;                                        // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FDataTableRowHandle                    ChestSetup;                                        // 0x02F0(0x0010)(Edit, BlueprintVisible, NoDestructor)
	class UGeometryCollectionComponent*           SpawnedGeometryCollection;                         // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         DestructibleMass;                                  // 0x0308(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30C[0x4];                                      // 0x030C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGeometryCollection*                    RestCollectionAsset;                               // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          SpawnDestructionFieldOnCollisionHit;               // 0x0318(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_319[0x3];                                      // 0x0319(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CVarEnableDrawDebug;                               // 0x031C(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_324[0x4];                                      // 0x0324(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        MaxDistanceToPlayerToUnspawn;                      // 0x0328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        LifeTimeAfterGeometryCollectionSpawned;            // 0x0330(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HasSpawnGeometryCollectionOfSurroundingDestructibles; // 0x0338(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsDestroyed;                                       // 0x0339(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsDesintegrating;                                  // 0x033A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33B[0x5];                                      // 0x033B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           RemainingLifeTime;                                 // 0x0340(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void Desintegration__FinishedFunc();
	void Desintegration__UpdateFunc();
	void DrawDebug();
	void Editor_Migrate(class UGeometryCollectionComponent* GeometryCollComp);
	void ExecuteUbergraph_BP_EnviroDestructible_Props(int32 EntryPoint);
	void ExplorationAttacked(class ABP_jRPG_Character_World_C* PlayerCharacter, const struct FVector& ImpactPoint);
	void ForceDestroyDestructible();
	void FreeAimHit(class ABP_jRPG_Character_World_C* PlayerCharacterWorld, const struct FVector& HitLocation, bool IsDisabled);
	struct FLinearColor GetDebugColor();
	void InteractedStateAfterShot();
	void IsFreeAimTargetDisabled(bool* IsDisabled);
	void OnChaosBreak(const struct FChaosBreakEvent& BreakEvent);
	void OnHitReceived(const struct FVector& Location, const struct FRotator& Rotation);
	void OnStaticMeshComponentHit(class UPrimitiveComponent* HitComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, const struct FVector& NormalImpulse, const struct FHitResult& Hit);
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);
	void SpawnDestructionField(const struct FVector& SpawnTransform_Location, const struct FRotator& SpawnTransform_Rotation);
	void SpawnGeometryCollectionIfNeeded();
	void SpawnGeometryCollectionOfSurroundingDestructibles();
	void SpawnLootIfNeeded();
	void StartDesintegration();
	void UpdateCollisionResponseOfGeometryCollection();
	void UpdateState();
	void UpdateStateWithGeometryCollectionSpawned();
	void UpdateStaticMeshOnGeometryCollectionSpawned();
	void UpdateStaticMeshTransform();
	void UpdateSurroundingDestructiblesIfNeeded();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_EnviroDestructible_Props_C">();
	}
	static class ABP_EnviroDestructible_Props_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_EnviroDestructible_Props_C>();
	}
};
static_assert(alignof(ABP_EnviroDestructible_Props_C) == 0x000008, "Wrong alignment on ABP_EnviroDestructible_Props_C");
static_assert(sizeof(ABP_EnviroDestructible_Props_C) == 0x000348, "Wrong size on ABP_EnviroDestructible_Props_C");
static_assert(offsetof(ABP_EnviroDestructible_Props_C, UberGraphFrame_BP_EnviroDestructible_Props_C) == 0x0002C0, "Member 'ABP_EnviroDestructible_Props_C::UberGraphFrame_BP_EnviroDestructible_Props_C' has a wrong offset!");
static_assert(offsetof(ABP_EnviroDestructible_Props_C, StaticMesh) == 0x0002C8, "Member 'ABP_EnviroDestructible_Props_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(ABP_EnviroDestructible_Props_C, CustomNavModifier) == 0x0002D0, "Member 'ABP_EnviroDestructible_Props_C::CustomNavModifier' has a wrong offset!");
static_assert(offsetof(ABP_EnviroDestructible_Props_C, Desintegration_Alpha_2D34B7454BF37C24D008538FB1CE2F9B) == 0x0002D8, "Member 'ABP_EnviroDestructible_Props_C::Desintegration_Alpha_2D34B7454BF37C24D008538FB1CE2F9B' has a wrong offset!");
static_assert(offsetof(ABP_EnviroDestructible_Props_C, Desintegration__Direction_2D34B7454BF37C24D008538FB1CE2F9B) == 0x0002DC, "Member 'ABP_EnviroDestructible_Props_C::Desintegration__Direction_2D34B7454BF37C24D008538FB1CE2F9B' has a wrong offset!");
static_assert(offsetof(ABP_EnviroDestructible_Props_C, Desintegration) == 0x0002E0, "Member 'ABP_EnviroDestructible_Props_C::Desintegration' has a wrong offset!");
static_assert(offsetof(ABP_EnviroDestructible_Props_C, BreakSound) == 0x0002E8, "Member 'ABP_EnviroDestructible_Props_C::BreakSound' has a wrong offset!");
static_assert(offsetof(ABP_EnviroDestructible_Props_C, ChestSetup) == 0x0002F0, "Member 'ABP_EnviroDestructible_Props_C::ChestSetup' has a wrong offset!");
static_assert(offsetof(ABP_EnviroDestructible_Props_C, SpawnedGeometryCollection) == 0x000300, "Member 'ABP_EnviroDestructible_Props_C::SpawnedGeometryCollection' has a wrong offset!");
static_assert(offsetof(ABP_EnviroDestructible_Props_C, DestructibleMass) == 0x000308, "Member 'ABP_EnviroDestructible_Props_C::DestructibleMass' has a wrong offset!");
static_assert(offsetof(ABP_EnviroDestructible_Props_C, RestCollectionAsset) == 0x000310, "Member 'ABP_EnviroDestructible_Props_C::RestCollectionAsset' has a wrong offset!");
static_assert(offsetof(ABP_EnviroDestructible_Props_C, SpawnDestructionFieldOnCollisionHit) == 0x000318, "Member 'ABP_EnviroDestructible_Props_C::SpawnDestructionFieldOnCollisionHit' has a wrong offset!");
static_assert(offsetof(ABP_EnviroDestructible_Props_C, CVarEnableDrawDebug) == 0x00031C, "Member 'ABP_EnviroDestructible_Props_C::CVarEnableDrawDebug' has a wrong offset!");
static_assert(offsetof(ABP_EnviroDestructible_Props_C, MaxDistanceToPlayerToUnspawn) == 0x000328, "Member 'ABP_EnviroDestructible_Props_C::MaxDistanceToPlayerToUnspawn' has a wrong offset!");
static_assert(offsetof(ABP_EnviroDestructible_Props_C, LifeTimeAfterGeometryCollectionSpawned) == 0x000330, "Member 'ABP_EnviroDestructible_Props_C::LifeTimeAfterGeometryCollectionSpawned' has a wrong offset!");
static_assert(offsetof(ABP_EnviroDestructible_Props_C, HasSpawnGeometryCollectionOfSurroundingDestructibles) == 0x000338, "Member 'ABP_EnviroDestructible_Props_C::HasSpawnGeometryCollectionOfSurroundingDestructibles' has a wrong offset!");
static_assert(offsetof(ABP_EnviroDestructible_Props_C, IsDestroyed) == 0x000339, "Member 'ABP_EnviroDestructible_Props_C::IsDestroyed' has a wrong offset!");
static_assert(offsetof(ABP_EnviroDestructible_Props_C, IsDesintegrating) == 0x00033A, "Member 'ABP_EnviroDestructible_Props_C::IsDesintegrating' has a wrong offset!");
static_assert(offsetof(ABP_EnviroDestructible_Props_C, RemainingLifeTime) == 0x000340, "Member 'ABP_EnviroDestructible_Props_C::RemainingLifeTime' has a wrong offset!");

}

