#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_EventRoutingSystemComponent

#include "Basic.hpp"

#include "FRoutedEventHandle_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_EventRoutingSystemComponent.BP_EventRoutingSystemComponent_C.DeclareEvent
// 0x0230 (0x0230 - 0x0000)
struct BP_EventRoutingSystemComponent_C_DeclareEvent final
{
public:
	struct FFRoutedEventHandle                    SkillHandle;                                       // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, HasGetValueTypeHash)
	TDelegate<void()>                             Event;                                             // 0x0020(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	class FString                                 DebugName;                                         // 0x0030(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class UBP_RoutedEventInstance_C*              local_skillInstance;                               // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0048(0x0010)()
	struct FFRoutedEventHandle                    CallFunc_BindSkill_EventHandle;                    // 0x0058(0x0020)(ZeroConstructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0078(0x0048)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x00C0(0x0010)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_2;          // 0x00D0(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00E0(0x0048)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0128(0x0048)(HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_Guid_ReturnValue;                 // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_171[0x7];                                      // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0178(0x0010)(ReferenceParm)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_189[0x7];                                      // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Format_ReturnValue;                       // 0x0190(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_GuidToString_ReturnValue;            // 0x01A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_3;          // 0x01B0(0x0010)()
	class UBP_RoutedEventInstance_C*              CallFunc_SpawnObject_ReturnValue;                  // 0x01C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x01C8(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0210(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Format_ReturnValue_1;                     // 0x0220(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EventRoutingSystemComponent_C_DeclareEvent) == 0x000008, "Wrong alignment on BP_EventRoutingSystemComponent_C_DeclareEvent");
static_assert(sizeof(BP_EventRoutingSystemComponent_C_DeclareEvent) == 0x000230, "Wrong size on BP_EventRoutingSystemComponent_C_DeclareEvent");
static_assert(offsetof(BP_EventRoutingSystemComponent_C_DeclareEvent, SkillHandle) == 0x000000, "Member 'BP_EventRoutingSystemComponent_C_DeclareEvent::SkillHandle' has a wrong offset!");
static_assert(offsetof(BP_EventRoutingSystemComponent_C_DeclareEvent, Event) == 0x000020, "Member 'BP_EventRoutingSystemComponent_C_DeclareEvent::Event' has a wrong offset!");
static_assert(offsetof(BP_EventRoutingSystemComponent_C_DeclareEvent, DebugName) == 0x000030, "Member 'BP_EventRoutingSystemComponent_C_DeclareEvent::DebugName' has a wrong offset!");
static_assert(offsetof(BP_EventRoutingSystemComponent_C_DeclareEvent, local_skillInstance) == 0x000040, "Member 'BP_EventRoutingSystemComponent_C_DeclareEvent::local_skillInstance' has a wrong offset!");
static_assert(offsetof(BP_EventRoutingSystemComponent_C_DeclareEvent, CallFunc_Conv_StringToText_ReturnValue) == 0x000048, "Member 'BP_EventRoutingSystemComponent_C_DeclareEvent::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventRoutingSystemComponent_C_DeclareEvent, CallFunc_BindSkill_EventHandle) == 0x000058, "Member 'BP_EventRoutingSystemComponent_C_DeclareEvent::CallFunc_BindSkill_EventHandle' has a wrong offset!");
static_assert(offsetof(BP_EventRoutingSystemComponent_C_DeclareEvent, K2Node_MakeStruct_FormatArgumentData) == 0x000078, "Member 'BP_EventRoutingSystemComponent_C_DeclareEvent::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_EventRoutingSystemComponent_C_DeclareEvent, CallFunc_Conv_StringToText_ReturnValue_1) == 0x0000C0, "Member 'BP_EventRoutingSystemComponent_C_DeclareEvent::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EventRoutingSystemComponent_C_DeclareEvent, CallFunc_Conv_StringToText_ReturnValue_2) == 0x0000D0, "Member 'BP_EventRoutingSystemComponent_C_DeclareEvent::CallFunc_Conv_StringToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_EventRoutingSystemComponent_C_DeclareEvent, K2Node_MakeStruct_FormatArgumentData_1) == 0x0000E0, "Member 'BP_EventRoutingSystemComponent_C_DeclareEvent::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BP_EventRoutingSystemComponent_C_DeclareEvent, K2Node_MakeStruct_FormatArgumentData_2) == 0x000128, "Member 'BP_EventRoutingSystemComponent_C_DeclareEvent::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(BP_EventRoutingSystemComponent_C_DeclareEvent, CallFunc_IsValid_Guid_ReturnValue) == 0x000170, "Member 'BP_EventRoutingSystemComponent_C_DeclareEvent::CallFunc_IsValid_Guid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventRoutingSystemComponent_C_DeclareEvent, K2Node_MakeArray_Array) == 0x000178, "Member 'BP_EventRoutingSystemComponent_C_DeclareEvent::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_EventRoutingSystemComponent_C_DeclareEvent, CallFunc_Not_PreBool_ReturnValue) == 0x000188, "Member 'BP_EventRoutingSystemComponent_C_DeclareEvent::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventRoutingSystemComponent_C_DeclareEvent, CallFunc_Format_ReturnValue) == 0x000190, "Member 'BP_EventRoutingSystemComponent_C_DeclareEvent::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventRoutingSystemComponent_C_DeclareEvent, CallFunc_Conv_GuidToString_ReturnValue) == 0x0001A0, "Member 'BP_EventRoutingSystemComponent_C_DeclareEvent::CallFunc_Conv_GuidToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventRoutingSystemComponent_C_DeclareEvent, CallFunc_Conv_StringToText_ReturnValue_3) == 0x0001B0, "Member 'BP_EventRoutingSystemComponent_C_DeclareEvent::CallFunc_Conv_StringToText_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_EventRoutingSystemComponent_C_DeclareEvent, CallFunc_SpawnObject_ReturnValue) == 0x0001C0, "Member 'BP_EventRoutingSystemComponent_C_DeclareEvent::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventRoutingSystemComponent_C_DeclareEvent, K2Node_MakeStruct_FormatArgumentData_3) == 0x0001C8, "Member 'BP_EventRoutingSystemComponent_C_DeclareEvent::K2Node_MakeStruct_FormatArgumentData_3' has a wrong offset!");
static_assert(offsetof(BP_EventRoutingSystemComponent_C_DeclareEvent, K2Node_MakeArray_Array_1) == 0x000210, "Member 'BP_EventRoutingSystemComponent_C_DeclareEvent::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BP_EventRoutingSystemComponent_C_DeclareEvent, CallFunc_Format_ReturnValue_1) == 0x000220, "Member 'BP_EventRoutingSystemComponent_C_DeclareEvent::CallFunc_Format_ReturnValue_1' has a wrong offset!");

// Function BP_EventRoutingSystemComponent.BP_EventRoutingSystemComponent_C.ExecuteEventFromHandle
// 0x0260 (0x0260 - 0x0000)
struct BP_EventRoutingSystemComponent_C_ExecuteEventFromHandle final
{
public:
	struct FFRoutedEventHandle                    EventHandle;                                       // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0030(0x0010)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0040(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0050(0x0048)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0098(0x0048)(HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_GuidToString_ReturnValue;            // 0x00E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_2;          // 0x00F0(0x0010)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_3;          // 0x0100(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0110(0x0048)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x0158(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x01A0(0x0010)(ReferenceParm)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x01B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Format_ReturnValue;                       // 0x01B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue_1;             // 0x01C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_4;          // 0x01D8(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_4;            // 0x01E8(0x0048)(HasGetValueTypeHash)
	class UBP_RoutedEventInstance_C*              CallFunc_Map_Find_Value;                           // 0x0230(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_239[0x7];                                      // 0x0239(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0240(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Format_ReturnValue_1;                     // 0x0250(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EventRoutingSystemComponent_C_ExecuteEventFromHandle) == 0x000008, "Wrong alignment on BP_EventRoutingSystemComponent_C_ExecuteEventFromHandle");
static_assert(sizeof(BP_EventRoutingSystemComponent_C_ExecuteEventFromHandle) == 0x000260, "Wrong size on BP_EventRoutingSystemComponent_C_ExecuteEventFromHandle");
static_assert(offsetof(BP_EventRoutingSystemComponent_C_ExecuteEventFromHandle, EventHandle) == 0x000000, "Member 'BP_EventRoutingSystemComponent_C_ExecuteEventFromHandle::EventHandle' has a wrong offset!");
static_assert(offsetof(BP_EventRoutingSystemComponent_C_ExecuteEventFromHandle, CallFunc_GetDisplayName_ReturnValue) == 0x000020, "Member 'BP_EventRoutingSystemComponent_C_ExecuteEventFromHandle::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventRoutingSystemComponent_C_ExecuteEventFromHandle, CallFunc_Conv_StringToText_ReturnValue) == 0x000030, "Member 'BP_EventRoutingSystemComponent_C_ExecuteEventFromHandle::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventRoutingSystemComponent_C_ExecuteEventFromHandle, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000040, "Member 'BP_EventRoutingSystemComponent_C_ExecuteEventFromHandle::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EventRoutingSystemComponent_C_ExecuteEventFromHandle, K2Node_MakeStruct_FormatArgumentData) == 0x000050, "Member 'BP_EventRoutingSystemComponent_C_ExecuteEventFromHandle::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_EventRoutingSystemComponent_C_ExecuteEventFromHandle, K2Node_MakeStruct_FormatArgumentData_1) == 0x000098, "Member 'BP_EventRoutingSystemComponent_C_ExecuteEventFromHandle::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BP_EventRoutingSystemComponent_C_ExecuteEventFromHandle, CallFunc_Conv_GuidToString_ReturnValue) == 0x0000E0, "Member 'BP_EventRoutingSystemComponent_C_ExecuteEventFromHandle::CallFunc_Conv_GuidToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventRoutingSystemComponent_C_ExecuteEventFromHandle, CallFunc_Conv_StringToText_ReturnValue_2) == 0x0000F0, "Member 'BP_EventRoutingSystemComponent_C_ExecuteEventFromHandle::CallFunc_Conv_StringToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_EventRoutingSystemComponent_C_ExecuteEventFromHandle, CallFunc_Conv_StringToText_ReturnValue_3) == 0x000100, "Member 'BP_EventRoutingSystemComponent_C_ExecuteEventFromHandle::CallFunc_Conv_StringToText_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_EventRoutingSystemComponent_C_ExecuteEventFromHandle, K2Node_MakeStruct_FormatArgumentData_2) == 0x000110, "Member 'BP_EventRoutingSystemComponent_C_ExecuteEventFromHandle::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(BP_EventRoutingSystemComponent_C_ExecuteEventFromHandle, K2Node_MakeStruct_FormatArgumentData_3) == 0x000158, "Member 'BP_EventRoutingSystemComponent_C_ExecuteEventFromHandle::K2Node_MakeStruct_FormatArgumentData_3' has a wrong offset!");
static_assert(offsetof(BP_EventRoutingSystemComponent_C_ExecuteEventFromHandle, K2Node_MakeArray_Array) == 0x0001A0, "Member 'BP_EventRoutingSystemComponent_C_ExecuteEventFromHandle::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_EventRoutingSystemComponent_C_ExecuteEventFromHandle, CallFunc_GetOwner_ReturnValue) == 0x0001B0, "Member 'BP_EventRoutingSystemComponent_C_ExecuteEventFromHandle::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventRoutingSystemComponent_C_ExecuteEventFromHandle, CallFunc_Format_ReturnValue) == 0x0001B8, "Member 'BP_EventRoutingSystemComponent_C_ExecuteEventFromHandle::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventRoutingSystemComponent_C_ExecuteEventFromHandle, CallFunc_GetDisplayName_ReturnValue_1) == 0x0001C8, "Member 'BP_EventRoutingSystemComponent_C_ExecuteEventFromHandle::CallFunc_GetDisplayName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EventRoutingSystemComponent_C_ExecuteEventFromHandle, CallFunc_Conv_StringToText_ReturnValue_4) == 0x0001D8, "Member 'BP_EventRoutingSystemComponent_C_ExecuteEventFromHandle::CallFunc_Conv_StringToText_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_EventRoutingSystemComponent_C_ExecuteEventFromHandle, K2Node_MakeStruct_FormatArgumentData_4) == 0x0001E8, "Member 'BP_EventRoutingSystemComponent_C_ExecuteEventFromHandle::K2Node_MakeStruct_FormatArgumentData_4' has a wrong offset!");
static_assert(offsetof(BP_EventRoutingSystemComponent_C_ExecuteEventFromHandle, CallFunc_Map_Find_Value) == 0x000230, "Member 'BP_EventRoutingSystemComponent_C_ExecuteEventFromHandle::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BP_EventRoutingSystemComponent_C_ExecuteEventFromHandle, CallFunc_Map_Find_ReturnValue) == 0x000238, "Member 'BP_EventRoutingSystemComponent_C_ExecuteEventFromHandle::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventRoutingSystemComponent_C_ExecuteEventFromHandle, K2Node_MakeArray_Array_1) == 0x000240, "Member 'BP_EventRoutingSystemComponent_C_ExecuteEventFromHandle::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BP_EventRoutingSystemComponent_C_ExecuteEventFromHandle, CallFunc_Format_ReturnValue_1) == 0x000250, "Member 'BP_EventRoutingSystemComponent_C_ExecuteEventFromHandle::CallFunc_Format_ReturnValue_1' has a wrong offset!");

// Function BP_EventRoutingSystemComponent.BP_EventRoutingSystemComponent_C.GetLastExecutedEventHandle
// 0x0020 (0x0020 - 0x0000)
struct BP_EventRoutingSystemComponent_C_GetLastExecutedEventHandle final
{
public:
	struct FFRoutedEventHandle                    ReturnValue;                                       // 0x0000(0x0020)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(BP_EventRoutingSystemComponent_C_GetLastExecutedEventHandle) == 0x000008, "Wrong alignment on BP_EventRoutingSystemComponent_C_GetLastExecutedEventHandle");
static_assert(sizeof(BP_EventRoutingSystemComponent_C_GetLastExecutedEventHandle) == 0x000020, "Wrong size on BP_EventRoutingSystemComponent_C_GetLastExecutedEventHandle");
static_assert(offsetof(BP_EventRoutingSystemComponent_C_GetLastExecutedEventHandle, ReturnValue) == 0x000000, "Member 'BP_EventRoutingSystemComponent_C_GetLastExecutedEventHandle::ReturnValue' has a wrong offset!");

}

