#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_EpicBattleSequenceActor

#include "Basic.hpp"

#include "MovieScene_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SandFall_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_EpicBattleSequenceActor.BP_EpicBattleSequenceActor_C.ApplySequenceSnapping
// 0x0770 (0x0770 - 0x0000)
struct BP_EpicBattleSequenceActor_C_ApplySequenceSnapping final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDefaultLevelSequenceInstanceData*      K2Node_DynamicCast_AsDefault_Level_Sequence_Instance_Data; // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_VectorToString_ReturnValue;          // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0028(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0038(0x0048)(HasGetValueTypeHash)
	class ABP_jRPG_Character_Battle_Base_C*       CallFunc_Array_Get_Item;                           // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationForSequenceSnapping_InitialLocation; // 0x0088(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_jRPG_Character_Battle_Base_C*       CallFunc_Array_Get_Item_1;                         // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_ObjectToText_ReturnValue;            // 0x00A8(0x0010)()
	uint8                                         Pad_B8[0x8];                                       // 0x00B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransformForBattleSequenceSnapping_ReturnValue; // 0x00C0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0120(0x0048)(HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0168(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0180(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0198(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_jRPG_Character_Battle_Base_C*       CallFunc_Array_Get_Item_2;                         // 0x01B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B8[0x8];                                      // 0x01B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransformForBattleSequenceSnapping_ReturnValue_1; // 0x01C0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0220(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location_1;                // 0x0238(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation_1;                // 0x0250(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale_1;                   // 0x0268(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0280(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0284(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0288(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll_1;                      // 0x028C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_1;                     // 0x0290(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_1;                       // 0x0294(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0298(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_1;                // 0x02B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x02C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_VectorToString_ReturnValue_1;        // 0x02E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x02F0(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0300(0x0048)(HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0348(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0360(0x0010)(ReferenceParm)
	double                                        CallFunc_BreakVector_X;                            // 0x0370(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0378(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0380(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0388(0x0010)()
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0398(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_jRPG_Character_Battle_Base_C*       CallFunc_Array_Get_Item_3;                         // 0x03B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_jRPG_Character_Battle_Base_C*       CallFunc_Array_Get_Item_4;                         // 0x03B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Compute_Move_to_Character_Transform_NewParam; // 0x03C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Select_Default;                             // 0x03D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_1;                          // 0x03F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_1;                          // 0x03F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_1;                          // 0x0400(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0408(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue;           // 0x0420(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue_1;         // 0x0438(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_SelectRotator_ReturnValue;                // 0x0450(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_SelectRotator_ReturnValue_1;              // 0x0468(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_SelectRotator_ReturnValue_2;              // 0x0480(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_498[0x8];                                      // 0x0498(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x04A0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorTransform_SweepHitResult;      // 0x0500(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorTransform_ReturnValue;         // 0x05F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5F9[0x7];                                      // 0x05F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakTransform_Location_2;                // 0x0600(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation_2;                // 0x0618(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale_2;                   // 0x0630(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_VectorToText_ReturnValue;            // 0x0648(0x0010)()
	class FText                                   CallFunc_Conv_VectorToText_ReturnValue_1;          // 0x0658(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x0668(0x0048)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_4;            // 0x06B0(0x0048)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_RotatorToText_ReturnValue;           // 0x06F8(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_5;            // 0x0708(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0750(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0760(0x0010)()
};
static_assert(alignof(BP_EpicBattleSequenceActor_C_ApplySequenceSnapping) == 0x000010, "Wrong alignment on BP_EpicBattleSequenceActor_C_ApplySequenceSnapping");
static_assert(sizeof(BP_EpicBattleSequenceActor_C_ApplySequenceSnapping) == 0x000770, "Wrong size on BP_EpicBattleSequenceActor_C_ApplySequenceSnapping");
static_assert(offsetof(BP_EpicBattleSequenceActor_C_ApplySequenceSnapping, Temp_bool_Variable) == 0x000000, "Member 'BP_EpicBattleSequenceActor_C_ApplySequenceSnapping::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_EpicBattleSequenceActor_C_ApplySequenceSnapping, K2Node_DynamicCast_AsDefault_Level_Sequence_Instance_Data) == 0x000008, "Member 'BP_EpicBattleSequenceActor_C_ApplySequenceSnapping::K2Node_DynamicCast_AsDefault_Level_Sequence_Instance_Data' has a wrong offset!");
static_assert(offsetof(BP_EpicBattleSequenceActor_C_ApplySequenceSnapping, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'BP_EpicBattleSequenceActor_C_ApplySequenceSnapping::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_EpicBattleSequenceActor_C_ApplySequenceSnapping, CallFunc_Conv_VectorToString_ReturnValue) == 0x000018, "Member 'BP_EpicBattleSequenceActor_C_ApplySequenceSnapping::CallFunc_Conv_VectorToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EpicBattleSequenceActor_C_ApplySequenceSnapping, CallFunc_Conv_StringToText_ReturnValue) == 0x000028, "Member 'BP_EpicBattleSequenceActor_C_ApplySequenceSnapping::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EpicBattleSequenceActor_C_ApplySequenceSnapping, K2Node_MakeStruct_FormatArgumentData) == 0x000038, "Member 'BP_EpicBattleSequenceActor_C_ApplySequenceSnapping::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_EpicBattleSequenceActor_C_ApplySequenceSnapping, CallFunc_Array_Get_Item) == 0x000080, "Member 'BP_EpicBattleSequenceActor_C_ApplySequenceSnapping::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_EpicBattleSequenceActor_C_ApplySequenceSnapping, CallFunc_GetLocationForSequenceSnapping_InitialLocation) == 0x000088, "Member 'BP_EpicBattleSequenceActor_C_ApplySequenceSnapping::CallFunc_GetLocationForSequenceSnapping_InitialLocation' has a wrong offset!");
static_assert(offsetof(BP_EpicBattleSequenceActor_C_ApplySequenceSnapping, CallFunc_Array_Get_Item_1) == 0x0000A0, "Member 'BP_EpicBattleSequenceActor_C_ApplySequenceSnapping::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_EpicBattleSequenceActor_C_ApplySequenceSnapping, CallFunc_Conv_ObjectToText_ReturnValue) == 0x0000A8, "Member 'BP_EpicBattleSequenceActor_C_ApplySequenceSnapping::CallFunc_Conv_ObjectToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EpicBattleSequenceActor_C_ApplySequenceSnapping, CallFunc_GetTransformForBattleSequenceSnapping_ReturnValue) == 0x0000C0, "Member 'BP_EpicBattleSequenceActor_C_ApplySequenceSnapping::CallFunc_GetTransformForBattleSequenceSnapping_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EpicBattleSequenceActor_C_ApplySequenceSnapping, K2Node_MakeStruct_FormatArgumentData_1) == 0x000120, "Member 'BP_EpicBattleSequenceActor_C_ApplySequenceSnapping::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BP_EpicBattleSequenceActor_C_ApplySequenceSnapping, CallFunc_BreakTransform_Location) == 0x000168, "Member 'BP_EpicBattleSequenceActor_C_ApplySequenceSnapping::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(BP_EpicBattleSequenceActor_C_ApplySequenceSnapping, CallFunc_BreakTransform_Rotation) == 0x000180, "Member 'BP_EpicBattleSequenceActor_C_ApplySequenceSnapping::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(BP_EpicBattleSequenceActor_C_ApplySequenceSnapping, CallFunc_BreakTransform_Scale) == 0x000198, "Member 'BP_EpicBattleSequenceActor_C_ApplySequenceSnapping::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(BP_EpicBattleSequenceActor_C_ApplySequenceSnapping, CallFunc_Array_Get_Item_2) == 0x0001B0, "Member 'BP_EpicBattleSequenceActor_C_ApplySequenceSnapping::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(BP_EpicBattleSequenceActor_C_ApplySequenceSnapping, CallFunc_GetTransformForBattleSequenceSnapping_ReturnValue_1) == 0x0001C0, "Member 'BP_EpicBattleSequenceActor_C_ApplySequenceSnapping::CallFunc_GetTransformForBattleSequenceSnapping_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EpicBattleSequenceActor_C_ApplySequenceSnapping, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000220, "Member 'BP_EpicBattleSequenceActor_C_ApplySequenceSnapping::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EpicBattleSequenceActor_C_ApplySequenceSnapping, CallFunc_BreakTransform_Location_1) == 0x000238, "Member 'BP_EpicBattleSequenceActor_C_ApplySequenceSnapping::CallFunc_BreakTransform_Location_1' has a wrong offset!");
static_assert(offsetof(BP_EpicBattleSequenceActor_C_ApplySequenceSnapping, CallFunc_BreakTransform_Rotation_1) == 0x000250, "Member 'BP_EpicBattleSequenceActor_C_ApplySequenceSnapping::CallFunc_BreakTransform_Rotation_1' has a wrong offset!");
static_assert(offsetof(BP_EpicBattleSequenceActor_C_ApplySequenceSnapping, CallFunc_BreakTransform_Scale_1) == 0x000268, "Member 'BP_EpicBattleSequenceActor_C_ApplySequenceSnapping::CallFunc_BreakTransform_Scale_1' has a wrong offset!");
static_assert(offsetof(BP_EpicBattleSequenceActor_C_ApplySequenceSnapping, CallFunc_BreakRotator_Roll) == 0x000280, "Member 'BP_EpicBattleSequenceActor_C_ApplySequenceSnapping::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(BP_EpicBattleSequenceActor_C_ApplySequenceSnapping, CallFunc_BreakRotator_Pitch) == 0x000284, "Member 'BP_EpicBattleSequenceActor_C_ApplySequenceSnapping::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(BP_EpicBattleSequenceActor_C_ApplySequenceSnapping, CallFunc_BreakRotator_Yaw) == 0x000288, "Member 'BP_EpicBattleSequenceActor_C_ApplySequenceSnapping::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(BP_EpicBattleSequenceActor_C_ApplySequenceSnapping, CallFunc_BreakRotator_Roll_1) == 0x00028C, "Member 'BP_EpicBattleSequenceActor_C_ApplySequenceSnapping::CallFunc_BreakRotator_Roll_1' has a wrong offset!");
static_assert(offsetof(BP_EpicBattleSequenceActor_C_ApplySequenceSnapping, CallFunc_BreakRotator_Pitch_1) == 0x000290, "Member 'BP_EpicBattleSequenceActor_C_ApplySequenceSnapping::CallFunc_BreakRotator_Pitch_1' has a wrong offset!");
static_assert(offsetof(BP_EpicBattleSequenceActor_C_ApplySequenceSnapping, CallFunc_BreakRotator_Yaw_1) == 0x000294, "Member 'BP_EpicBattleSequenceActor_C_ApplySequenceSnapping::CallFunc_BreakRotator_Yaw_1' has a wrong offset!");
static_assert(offsetof(BP_EpicBattleSequenceActor_C_ApplySequenceSnapping, CallFunc_MakeRotator_ReturnValue) == 0x000298, "Member 'BP_EpicBattleSequenceActor_C_ApplySequenceSnapping::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EpicBattleSequenceActor_C_ApplySequenceSnapping, CallFunc_MakeRotator_ReturnValue_1) == 0x0002B0, "Member 'BP_EpicBattleSequenceActor_C_ApplySequenceSnapping::CallFunc_MakeRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EpicBattleSequenceActor_C_ApplySequenceSnapping, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0002C8, "Member 'BP_EpicBattleSequenceActor_C_ApplySequenceSnapping::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EpicBattleSequenceActor_C_ApplySequenceSnapping, CallFunc_Conv_VectorToString_ReturnValue_1) == 0x0002E0, "Member 'BP_EpicBattleSequenceActor_C_ApplySequenceSnapping::CallFunc_Conv_VectorToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EpicBattleSequenceActor_C_ApplySequenceSnapping, CallFunc_Conv_StringToText_ReturnValue_1) == 0x0002F0, "Member 'BP_EpicBattleSequenceActor_C_ApplySequenceSnapping::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EpicBattleSequenceActor_C_ApplySequenceSnapping, K2Node_MakeStruct_FormatArgumentData_2) == 0x000300, "Member 'BP_EpicBattleSequenceActor_C_ApplySequenceSnapping::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(BP_EpicBattleSequenceActor_C_ApplySequenceSnapping, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000348, "Member 'BP_EpicBattleSequenceActor_C_ApplySequenceSnapping::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EpicBattleSequenceActor_C_ApplySequenceSnapping, K2Node_MakeArray_Array) == 0x000360, "Member 'BP_EpicBattleSequenceActor_C_ApplySequenceSnapping::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_EpicBattleSequenceActor_C_ApplySequenceSnapping, CallFunc_BreakVector_X) == 0x000370, "Member 'BP_EpicBattleSequenceActor_C_ApplySequenceSnapping::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_EpicBattleSequenceActor_C_ApplySequenceSnapping, CallFunc_BreakVector_Y) == 0x000378, "Member 'BP_EpicBattleSequenceActor_C_ApplySequenceSnapping::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_EpicBattleSequenceActor_C_ApplySequenceSnapping, CallFunc_BreakVector_Z) == 0x000380, "Member 'BP_EpicBattleSequenceActor_C_ApplySequenceSnapping::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_EpicBattleSequenceActor_C_ApplySequenceSnapping, CallFunc_Format_ReturnValue) == 0x000388, "Member 'BP_EpicBattleSequenceActor_C_ApplySequenceSnapping::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EpicBattleSequenceActor_C_ApplySequenceSnapping, CallFunc_MakeVector_ReturnValue) == 0x000398, "Member 'BP_EpicBattleSequenceActor_C_ApplySequenceSnapping::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EpicBattleSequenceActor_C_ApplySequenceSnapping, CallFunc_Array_Get_Item_3) == 0x0003B0, "Member 'BP_EpicBattleSequenceActor_C_ApplySequenceSnapping::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(BP_EpicBattleSequenceActor_C_ApplySequenceSnapping, CallFunc_Array_Get_Item_4) == 0x0003B8, "Member 'BP_EpicBattleSequenceActor_C_ApplySequenceSnapping::CallFunc_Array_Get_Item_4' has a wrong offset!");
static_assert(offsetof(BP_EpicBattleSequenceActor_C_ApplySequenceSnapping, CallFunc_Compute_Move_to_Character_Transform_NewParam) == 0x0003C0, "Member 'BP_EpicBattleSequenceActor_C_ApplySequenceSnapping::CallFunc_Compute_Move_to_Character_Transform_NewParam' has a wrong offset!");
static_assert(offsetof(BP_EpicBattleSequenceActor_C_ApplySequenceSnapping, K2Node_Select_Default) == 0x0003D8, "Member 'BP_EpicBattleSequenceActor_C_ApplySequenceSnapping::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_EpicBattleSequenceActor_C_ApplySequenceSnapping, CallFunc_BreakVector_X_1) == 0x0003F0, "Member 'BP_EpicBattleSequenceActor_C_ApplySequenceSnapping::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(BP_EpicBattleSequenceActor_C_ApplySequenceSnapping, CallFunc_BreakVector_Y_1) == 0x0003F8, "Member 'BP_EpicBattleSequenceActor_C_ApplySequenceSnapping::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(BP_EpicBattleSequenceActor_C_ApplySequenceSnapping, CallFunc_BreakVector_Z_1) == 0x000400, "Member 'BP_EpicBattleSequenceActor_C_ApplySequenceSnapping::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(BP_EpicBattleSequenceActor_C_ApplySequenceSnapping, CallFunc_MakeVector_ReturnValue_1) == 0x000408, "Member 'BP_EpicBattleSequenceActor_C_ApplySequenceSnapping::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EpicBattleSequenceActor_C_ApplySequenceSnapping, CallFunc_FindLookAtRotation_ReturnValue) == 0x000420, "Member 'BP_EpicBattleSequenceActor_C_ApplySequenceSnapping::CallFunc_FindLookAtRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EpicBattleSequenceActor_C_ApplySequenceSnapping, CallFunc_FindLookAtRotation_ReturnValue_1) == 0x000438, "Member 'BP_EpicBattleSequenceActor_C_ApplySequenceSnapping::CallFunc_FindLookAtRotation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EpicBattleSequenceActor_C_ApplySequenceSnapping, CallFunc_SelectRotator_ReturnValue) == 0x000450, "Member 'BP_EpicBattleSequenceActor_C_ApplySequenceSnapping::CallFunc_SelectRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EpicBattleSequenceActor_C_ApplySequenceSnapping, CallFunc_SelectRotator_ReturnValue_1) == 0x000468, "Member 'BP_EpicBattleSequenceActor_C_ApplySequenceSnapping::CallFunc_SelectRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EpicBattleSequenceActor_C_ApplySequenceSnapping, CallFunc_SelectRotator_ReturnValue_2) == 0x000480, "Member 'BP_EpicBattleSequenceActor_C_ApplySequenceSnapping::CallFunc_SelectRotator_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_EpicBattleSequenceActor_C_ApplySequenceSnapping, CallFunc_MakeTransform_ReturnValue) == 0x0004A0, "Member 'BP_EpicBattleSequenceActor_C_ApplySequenceSnapping::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EpicBattleSequenceActor_C_ApplySequenceSnapping, CallFunc_K2_SetActorTransform_SweepHitResult) == 0x000500, "Member 'BP_EpicBattleSequenceActor_C_ApplySequenceSnapping::CallFunc_K2_SetActorTransform_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_EpicBattleSequenceActor_C_ApplySequenceSnapping, CallFunc_K2_SetActorTransform_ReturnValue) == 0x0005F8, "Member 'BP_EpicBattleSequenceActor_C_ApplySequenceSnapping::CallFunc_K2_SetActorTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EpicBattleSequenceActor_C_ApplySequenceSnapping, CallFunc_BreakTransform_Location_2) == 0x000600, "Member 'BP_EpicBattleSequenceActor_C_ApplySequenceSnapping::CallFunc_BreakTransform_Location_2' has a wrong offset!");
static_assert(offsetof(BP_EpicBattleSequenceActor_C_ApplySequenceSnapping, CallFunc_BreakTransform_Rotation_2) == 0x000618, "Member 'BP_EpicBattleSequenceActor_C_ApplySequenceSnapping::CallFunc_BreakTransform_Rotation_2' has a wrong offset!");
static_assert(offsetof(BP_EpicBattleSequenceActor_C_ApplySequenceSnapping, CallFunc_BreakTransform_Scale_2) == 0x000630, "Member 'BP_EpicBattleSequenceActor_C_ApplySequenceSnapping::CallFunc_BreakTransform_Scale_2' has a wrong offset!");
static_assert(offsetof(BP_EpicBattleSequenceActor_C_ApplySequenceSnapping, CallFunc_Conv_VectorToText_ReturnValue) == 0x000648, "Member 'BP_EpicBattleSequenceActor_C_ApplySequenceSnapping::CallFunc_Conv_VectorToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EpicBattleSequenceActor_C_ApplySequenceSnapping, CallFunc_Conv_VectorToText_ReturnValue_1) == 0x000658, "Member 'BP_EpicBattleSequenceActor_C_ApplySequenceSnapping::CallFunc_Conv_VectorToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EpicBattleSequenceActor_C_ApplySequenceSnapping, K2Node_MakeStruct_FormatArgumentData_3) == 0x000668, "Member 'BP_EpicBattleSequenceActor_C_ApplySequenceSnapping::K2Node_MakeStruct_FormatArgumentData_3' has a wrong offset!");
static_assert(offsetof(BP_EpicBattleSequenceActor_C_ApplySequenceSnapping, K2Node_MakeStruct_FormatArgumentData_4) == 0x0006B0, "Member 'BP_EpicBattleSequenceActor_C_ApplySequenceSnapping::K2Node_MakeStruct_FormatArgumentData_4' has a wrong offset!");
static_assert(offsetof(BP_EpicBattleSequenceActor_C_ApplySequenceSnapping, CallFunc_Conv_RotatorToText_ReturnValue) == 0x0006F8, "Member 'BP_EpicBattleSequenceActor_C_ApplySequenceSnapping::CallFunc_Conv_RotatorToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EpicBattleSequenceActor_C_ApplySequenceSnapping, K2Node_MakeStruct_FormatArgumentData_5) == 0x000708, "Member 'BP_EpicBattleSequenceActor_C_ApplySequenceSnapping::K2Node_MakeStruct_FormatArgumentData_5' has a wrong offset!");
static_assert(offsetof(BP_EpicBattleSequenceActor_C_ApplySequenceSnapping, K2Node_MakeArray_Array_1) == 0x000750, "Member 'BP_EpicBattleSequenceActor_C_ApplySequenceSnapping::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BP_EpicBattleSequenceActor_C_ApplySequenceSnapping, CallFunc_Format_ReturnValue_1) == 0x000760, "Member 'BP_EpicBattleSequenceActor_C_ApplySequenceSnapping::CallFunc_Format_ReturnValue_1' has a wrong offset!");

// Function BP_EpicBattleSequenceActor.BP_EpicBattleSequenceActor_C.BindActionEffectEvent
// 0x0010 (0x0010 - 0x0000)
struct BP_EpicBattleSequenceActor_C_BindActionEffectEvent final
{
public:
	TDelegate<void(int32 ActionEffectIndex)>      Event;                                             // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EpicBattleSequenceActor_C_BindActionEffectEvent) == 0x000004, "Wrong alignment on BP_EpicBattleSequenceActor_C_BindActionEffectEvent");
static_assert(sizeof(BP_EpicBattleSequenceActor_C_BindActionEffectEvent) == 0x000010, "Wrong size on BP_EpicBattleSequenceActor_C_BindActionEffectEvent");
static_assert(offsetof(BP_EpicBattleSequenceActor_C_BindActionEffectEvent, Event) == 0x000000, "Member 'BP_EpicBattleSequenceActor_C_BindActionEffectEvent::Event' has a wrong offset!");

// Function BP_EpicBattleSequenceActor.BP_EpicBattleSequenceActor_C.ClearActiveSequenceEventBindings
// 0x0030 (0x0030 - 0x0000)
struct BP_EpicBattleSequenceActor_C_ClearActiveSequenceEventBindings final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULevelSequencePlayer*                   CallFunc_GetSequencePlayer_ReturnValue;            // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EpicBattleSequenceActor_C_ClearActiveSequenceEventBindings) == 0x000008, "Wrong alignment on BP_EpicBattleSequenceActor_C_ClearActiveSequenceEventBindings");
static_assert(sizeof(BP_EpicBattleSequenceActor_C_ClearActiveSequenceEventBindings) == 0x000030, "Wrong size on BP_EpicBattleSequenceActor_C_ClearActiveSequenceEventBindings");
static_assert(offsetof(BP_EpicBattleSequenceActor_C_ClearActiveSequenceEventBindings, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'BP_EpicBattleSequenceActor_C_ClearActiveSequenceEventBindings::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_EpicBattleSequenceActor_C_ClearActiveSequenceEventBindings, K2Node_CreateDelegate_OutputDelegate_1) == 0x000010, "Member 'BP_EpicBattleSequenceActor_C_ClearActiveSequenceEventBindings::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_EpicBattleSequenceActor_C_ClearActiveSequenceEventBindings, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'BP_EpicBattleSequenceActor_C_ClearActiveSequenceEventBindings::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EpicBattleSequenceActor_C_ClearActiveSequenceEventBindings, CallFunc_GetSequencePlayer_ReturnValue) == 0x000028, "Member 'BP_EpicBattleSequenceActor_C_ClearActiveSequenceEventBindings::CallFunc_GetSequencePlayer_ReturnValue' has a wrong offset!");

// Function BP_EpicBattleSequenceActor.BP_EpicBattleSequenceActor_C.ExecuteUbergraph_BP_EpicBattleSequenceActor
// 0x07E0 (0x07E0 - 0x0000)
struct BP_EpicBattleSequenceActor_C_ExecuteUbergraph_BP_EpicBattleSequenceActor final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsNotEmpty_ReturnValue;             // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0028(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0038(0x0048)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_ObjectToText_ReturnValue;            // 0x0080(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0090(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00D8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00E8(0x0010)()
	class FText                                   CallFunc_AppendStack__Content__Result;             // 0x00F8(0x0010)()
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULevelSequencePlayer*                   CallFunc_GetSequencePlayer_ReturnValue;            // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0118(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0128(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0138(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0180(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0190(0x0010)()
	class ULevelSequencePlayer*                   CallFunc_GetSequencePlayer_ReturnValue_1;          // 0x01A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x01A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1AA[0x6];                                      // 0x01AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ULevelSequence*                         CallFunc_GetSequence_ReturnValue;                  // 0x01B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_ObjectToText_ReturnValue_1;          // 0x01B8(0x0010)()
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x01C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x01E0(0x0048)(HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_VectorToString_ReturnValue;          // 0x0228(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_2;                          // 0x0238(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_2;          // 0x0248(0x0010)()
	class FText                                   CallFunc_Format_ReturnValue_2;                     // 0x0258(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_4;            // 0x0268(0x0048)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_BoolToText_ReturnValue;              // 0x02B0(0x0010)()
	class FText                                   CallFunc_Conv_BoolToText_ReturnValue_1;            // 0x02C0(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_5;            // 0x02D0(0x0048)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_6;            // 0x0318(0x0048)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_BoolToText_ReturnValue_2;            // 0x0360(0x0010)()
	class FText                                   CallFunc_Conv_BoolToText_ReturnValue_3;            // 0x0370(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_7;            // 0x0380(0x0048)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_8;            // 0x03C8(0x0048)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_BoolToText_ReturnValue_4;            // 0x0410(0x0010)()
	class FText                                   CallFunc_Conv_BoolToText_ReturnValue_5;            // 0x0420(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_9;            // 0x0430(0x0048)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_10;           // 0x0478(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_3;                          // 0x04C0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_3;                     // 0x04D0(0x0010)()
	class ULevelSequencePlayer*                   CallFunc_GetSequencePlayer_ReturnValue_2;          // 0x04E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_jRPG_Character_Battle_Base_C*       CallFunc_GetOwnerCharacter_Character;              // 0x04E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ULevelSequence*                         CallFunc_GetSequence_ReturnValue_1;                // 0x04F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_ObjectToText_ReturnValue_2;          // 0x04F8(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_11;           // 0x0508(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_4;                          // 0x0550(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_4;                     // 0x0560(0x0010)()
	class ABP_jRPG_Character_Battle_Base_C*       CallFunc_Array_Get_Item;                           // 0x0570(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0578(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_579[0x3];                                      // 0x0579(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x057C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0580(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0581(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_582[0x6];                                      // 0x0582(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USF_BlueprintLatentAction*              K2Node_CustomEvent_CompletedLatentAction;          // 0x0588(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_ObjectToText_ReturnValue_3;          // 0x0590(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_12;           // 0x05A0(0x0048)(HasGetValueTypeHash)
	double                                        CallFunc_StartSequence_SequenceDuration;           // 0x05E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_5;                          // 0x05F0(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Format_ReturnValue_5;                     // 0x0600(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetBattleSequenceAttackerTag_ReturnValue; // 0x0610(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FMovieSceneObjectBindingID>     CallFunc_FindNamedBindings_ReturnValue;            // 0x0618(0x0010)(ConstParm, ReferenceParm)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0628(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsNotEmpty_ReturnValue_1;           // 0x0640(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_641[0xF];                                      // 0x0641(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetInitialActorPositionInSequence_ReturnValue; // 0x0650(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x06B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x06C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x06E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x06F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0710(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULevelSequencePlayer*                   CallFunc_GetSequencePlayer_ReturnValue_3;          // 0x0770(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0778(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldEnableBattleCameraMovements_Enable; // 0x0780(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_781[0x7];                                      // 0x0781(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAC_jRPG_DynamicCameraManager_C*        CallFunc_GetComponentByClass_ReturnValue;          // 0x0788(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0790(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0791(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_792[0x2];                                      // 0x0792(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMovieSceneSequenceLoopCount           K2Node_MakeStruct_MovieSceneSequenceLoopCount;     // 0x0794(0x0004)(NoDestructor)
	bool                                          CallFunc_IsPackagedForDistribution_ReturnValue;    // 0x0798(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_799[0x3];                                      // 0x0799(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMovieSceneSequencePlaybackSettings    K2Node_MakeStruct_MovieSceneSequencePlaybackSettings; // 0x079C(0x0028)(NoDestructor)
	uint8                                         Pad_7C4[0x4];                                      // 0x07C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ALevelSequenceActor*                    CallFunc_CreateLevelSequencePlayer_OutActor;       // 0x07C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ULevelSequencePlayer*                   CallFunc_CreateLevelSequencePlayer_ReturnValue;    // 0x07D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EpicBattleSequenceActor_C_ExecuteUbergraph_BP_EpicBattleSequenceActor) == 0x000010, "Wrong alignment on BP_EpicBattleSequenceActor_C_ExecuteUbergraph_BP_EpicBattleSequenceActor");
static_assert(sizeof(BP_EpicBattleSequenceActor_C_ExecuteUbergraph_BP_EpicBattleSequenceActor) == 0x0007E0, "Wrong size on BP_EpicBattleSequenceActor_C_ExecuteUbergraph_BP_EpicBattleSequenceActor");
static_assert(offsetof(BP_EpicBattleSequenceActor_C_ExecuteUbergraph_BP_EpicBattleSequenceActor, EntryPoint) == 0x000000, "Member 'BP_EpicBattleSequenceActor_C_ExecuteUbergraph_BP_EpicBattleSequenceActor::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_EpicBattleSequenceActor_C_ExecuteUbergraph_BP_EpicBattleSequenceActor, Temp_int_Array_Index_Variable) == 0x000004, "Member 'BP_EpicBattleSequenceActor_C_ExecuteUbergraph_BP_EpicBattleSequenceActor::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_EpicBattleSequenceActor_C_ExecuteUbergraph_BP_EpicBattleSequenceActor, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'BP_EpicBattleSequenceActor_C_ExecuteUbergraph_BP_EpicBattleSequenceActor::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_EpicBattleSequenceActor_C_ExecuteUbergraph_BP_EpicBattleSequenceActor, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'BP_EpicBattleSequenceActor_C_ExecuteUbergraph_BP_EpicBattleSequenceActor::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EpicBattleSequenceActor_C_ExecuteUbergraph_BP_EpicBattleSequenceActor, CallFunc_Array_IsNotEmpty_ReturnValue) == 0x000010, "Member 'BP_EpicBattleSequenceActor_C_ExecuteUbergraph_BP_EpicBattleSequenceActor::CallFunc_Array_IsNotEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EpicBattleSequenceActor_C_ExecuteUbergraph_BP_EpicBattleSequenceActor, CallFunc_GetDisplayName_ReturnValue) == 0x000018, "Member 'BP_EpicBattleSequenceActor_C_ExecuteUbergraph_BP_EpicBattleSequenceActor::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EpicBattleSequenceActor_C_ExecuteUbergraph_BP_EpicBattleSequenceActor, CallFunc_Conv_StringToText_ReturnValue) == 0x000028, "Member 'BP_EpicBattleSequenceActor_C_ExecuteUbergraph_BP_EpicBattleSequenceActor::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EpicBattleSequenceActor_C_ExecuteUbergraph_BP_EpicBattleSequenceActor, K2Node_MakeStruct_FormatArgumentData) == 0x000038, "Member 'BP_EpicBattleSequenceActor_C_ExecuteUbergraph_BP_EpicBattleSequenceActor::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_EpicBattleSequenceActor_C_ExecuteUbergraph_BP_EpicBattleSequenceActor, CallFunc_Conv_ObjectToText_ReturnValue) == 0x000080, "Member 'BP_EpicBattleSequenceActor_C_ExecuteUbergraph_BP_EpicBattleSequenceActor::CallFunc_Conv_ObjectToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EpicBattleSequenceActor_C_ExecuteUbergraph_BP_EpicBattleSequenceActor, K2Node_MakeStruct_FormatArgumentData_1) == 0x000090, "Member 'BP_EpicBattleSequenceActor_C_ExecuteUbergraph_BP_EpicBattleSequenceActor::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BP_EpicBattleSequenceActor_C_ExecuteUbergraph_BP_EpicBattleSequenceActor, K2Node_MakeArray_Array) == 0x0000D8, "Member 'BP_EpicBattleSequenceActor_C_ExecuteUbergraph_BP_EpicBattleSequenceActor::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_EpicBattleSequenceActor_C_ExecuteUbergraph_BP_EpicBattleSequenceActor, CallFunc_Format_ReturnValue) == 0x0000E8, "Member 'BP_EpicBattleSequenceActor_C_ExecuteUbergraph_BP_EpicBattleSequenceActor::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EpicBattleSequenceActor_C_ExecuteUbergraph_BP_EpicBattleSequenceActor, CallFunc_AppendStack__Content__Result) == 0x0000F8, "Member 'BP_EpicBattleSequenceActor_C_ExecuteUbergraph_BP_EpicBattleSequenceActor::CallFunc_AppendStack__Content__Result' has a wrong offset!");
static_assert(offsetof(BP_EpicBattleSequenceActor_C_ExecuteUbergraph_BP_EpicBattleSequenceActor, K2Node_Event_EndPlayReason) == 0x000108, "Member 'BP_EpicBattleSequenceActor_C_ExecuteUbergraph_BP_EpicBattleSequenceActor::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BP_EpicBattleSequenceActor_C_ExecuteUbergraph_BP_EpicBattleSequenceActor, CallFunc_GetSequencePlayer_ReturnValue) == 0x000110, "Member 'BP_EpicBattleSequenceActor_C_ExecuteUbergraph_BP_EpicBattleSequenceActor::CallFunc_GetSequencePlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EpicBattleSequenceActor_C_ExecuteUbergraph_BP_EpicBattleSequenceActor, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x000118, "Member 'BP_EpicBattleSequenceActor_C_ExecuteUbergraph_BP_EpicBattleSequenceActor::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EpicBattleSequenceActor_C_ExecuteUbergraph_BP_EpicBattleSequenceActor, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000128, "Member 'BP_EpicBattleSequenceActor_C_ExecuteUbergraph_BP_EpicBattleSequenceActor::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EpicBattleSequenceActor_C_ExecuteUbergraph_BP_EpicBattleSequenceActor, K2Node_MakeStruct_FormatArgumentData_2) == 0x000138, "Member 'BP_EpicBattleSequenceActor_C_ExecuteUbergraph_BP_EpicBattleSequenceActor::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(BP_EpicBattleSequenceActor_C_ExecuteUbergraph_BP_EpicBattleSequenceActor, K2Node_MakeArray_Array_1) == 0x000180, "Member 'BP_EpicBattleSequenceActor_C_ExecuteUbergraph_BP_EpicBattleSequenceActor::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BP_EpicBattleSequenceActor_C_ExecuteUbergraph_BP_EpicBattleSequenceActor, CallFunc_Format_ReturnValue_1) == 0x000190, "Member 'BP_EpicBattleSequenceActor_C_ExecuteUbergraph_BP_EpicBattleSequenceActor::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EpicBattleSequenceActor_C_ExecuteUbergraph_BP_EpicBattleSequenceActor, CallFunc_GetSequencePlayer_ReturnValue_1) == 0x0001A0, "Member 'BP_EpicBattleSequenceActor_C_ExecuteUbergraph_BP_EpicBattleSequenceActor::CallFunc_GetSequencePlayer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EpicBattleSequenceActor_C_ExecuteUbergraph_BP_EpicBattleSequenceActor, CallFunc_IsValid_ReturnValue) == 0x0001A8, "Member 'BP_EpicBattleSequenceActor_C_ExecuteUbergraph_BP_EpicBattleSequenceActor::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EpicBattleSequenceActor_C_ExecuteUbergraph_BP_EpicBattleSequenceActor, CallFunc_Not_PreBool_ReturnValue) == 0x0001A9, "Member 'BP_EpicBattleSequenceActor_C_ExecuteUbergraph_BP_EpicBattleSequenceActor::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EpicBattleSequenceActor_C_ExecuteUbergraph_BP_EpicBattleSequenceActor, CallFunc_GetSequence_ReturnValue) == 0x0001B0, "Member 'BP_EpicBattleSequenceActor_C_ExecuteUbergraph_BP_EpicBattleSequenceActor::CallFunc_GetSequence_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EpicBattleSequenceActor_C_ExecuteUbergraph_BP_EpicBattleSequenceActor, CallFunc_Conv_ObjectToText_ReturnValue_1) == 0x0001B8, "Member 'BP_EpicBattleSequenceActor_C_ExecuteUbergraph_BP_EpicBattleSequenceActor::CallFunc_Conv_ObjectToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EpicBattleSequenceActor_C_ExecuteUbergraph_BP_EpicBattleSequenceActor, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0001C8, "Member 'BP_EpicBattleSequenceActor_C_ExecuteUbergraph_BP_EpicBattleSequenceActor::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EpicBattleSequenceActor_C_ExecuteUbergraph_BP_EpicBattleSequenceActor, K2Node_MakeStruct_FormatArgumentData_3) == 0x0001E0, "Member 'BP_EpicBattleSequenceActor_C_ExecuteUbergraph_BP_EpicBattleSequenceActor::K2Node_MakeStruct_FormatArgumentData_3' has a wrong offset!");
static_assert(offsetof(BP_EpicBattleSequenceActor_C_ExecuteUbergraph_BP_EpicBattleSequenceActor, CallFunc_Conv_VectorToString_ReturnValue) == 0x000228, "Member 'BP_EpicBattleSequenceActor_C_ExecuteUbergraph_BP_EpicBattleSequenceActor::CallFunc_Conv_VectorToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EpicBattleSequenceActor_C_ExecuteUbergraph_BP_EpicBattleSequenceActor, K2Node_MakeArray_Array_2) == 0x000238, "Member 'BP_EpicBattleSequenceActor_C_ExecuteUbergraph_BP_EpicBattleSequenceActor::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(BP_EpicBattleSequenceActor_C_ExecuteUbergraph_BP_EpicBattleSequenceActor, CallFunc_Conv_StringToText_ReturnValue_2) == 0x000248, "Member 'BP_EpicBattleSequenceActor_C_ExecuteUbergraph_BP_EpicBattleSequenceActor::CallFunc_Conv_StringToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_EpicBattleSequenceActor_C_ExecuteUbergraph_BP_EpicBattleSequenceActor, CallFunc_Format_ReturnValue_2) == 0x000258, "Member 'BP_EpicBattleSequenceActor_C_ExecuteUbergraph_BP_EpicBattleSequenceActor::CallFunc_Format_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_EpicBattleSequenceActor_C_ExecuteUbergraph_BP_EpicBattleSequenceActor, K2Node_MakeStruct_FormatArgumentData_4) == 0x000268, "Member 'BP_EpicBattleSequenceActor_C_ExecuteUbergraph_BP_EpicBattleSequenceActor::K2Node_MakeStruct_FormatArgumentData_4' has a wrong offset!");
static_assert(offsetof(BP_EpicBattleSequenceActor_C_ExecuteUbergraph_BP_EpicBattleSequenceActor, CallFunc_Conv_BoolToText_ReturnValue) == 0x0002B0, "Member 'BP_EpicBattleSequenceActor_C_ExecuteUbergraph_BP_EpicBattleSequenceActor::CallFunc_Conv_BoolToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EpicBattleSequenceActor_C_ExecuteUbergraph_BP_EpicBattleSequenceActor, CallFunc_Conv_BoolToText_ReturnValue_1) == 0x0002C0, "Member 'BP_EpicBattleSequenceActor_C_ExecuteUbergraph_BP_EpicBattleSequenceActor::CallFunc_Conv_BoolToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EpicBattleSequenceActor_C_ExecuteUbergraph_BP_EpicBattleSequenceActor, K2Node_MakeStruct_FormatArgumentData_5) == 0x0002D0, "Member 'BP_EpicBattleSequenceActor_C_ExecuteUbergraph_BP_EpicBattleSequenceActor::K2Node_MakeStruct_FormatArgumentData_5' has a wrong offset!");
static_assert(offsetof(BP_EpicBattleSequenceActor_C_ExecuteUbergraph_BP_EpicBattleSequenceActor, K2Node_MakeStruct_FormatArgumentData_6) == 0x000318, "Member 'BP_EpicBattleSequenceActor_C_ExecuteUbergraph_BP_EpicBattleSequenceActor::K2Node_MakeStruct_FormatArgumentData_6' has a wrong offset!");
static_assert(offsetof(BP_EpicBattleSequenceActor_C_ExecuteUbergraph_BP_EpicBattleSequenceActor, CallFunc_Conv_BoolToText_ReturnValue_2) == 0x000360, "Member 'BP_EpicBattleSequenceActor_C_ExecuteUbergraph_BP_EpicBattleSequenceActor::CallFunc_Conv_BoolToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_EpicBattleSequenceActor_C_ExecuteUbergraph_BP_EpicBattleSequenceActor, CallFunc_Conv_BoolToText_ReturnValue_3) == 0x000370, "Member 'BP_EpicBattleSequenceActor_C_ExecuteUbergraph_BP_EpicBattleSequenceActor::CallFunc_Conv_BoolToText_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_EpicBattleSequenceActor_C_ExecuteUbergraph_BP_EpicBattleSequenceActor, K2Node_MakeStruct_FormatArgumentData_7) == 0x000380, "Member 'BP_EpicBattleSequenceActor_C_ExecuteUbergraph_BP_EpicBattleSequenceActor::K2Node_MakeStruct_FormatArgumentData_7' has a wrong offset!");
static_assert(offsetof(BP_EpicBattleSequenceActor_C_ExecuteUbergraph_BP_EpicBattleSequenceActor, K2Node_MakeStruct_FormatArgumentData_8) == 0x0003C8, "Member 'BP_EpicBattleSequenceActor_C_ExecuteUbergraph_BP_EpicBattleSequenceActor::K2Node_MakeStruct_FormatArgumentData_8' has a wrong offset!");
static_assert(offsetof(BP_EpicBattleSequenceActor_C_ExecuteUbergraph_BP_EpicBattleSequenceActor, CallFunc_Conv_BoolToText_ReturnValue_4) == 0x000410, "Member 'BP_EpicBattleSequenceActor_C_ExecuteUbergraph_BP_EpicBattleSequenceActor::CallFunc_Conv_BoolToText_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_EpicBattleSequenceActor_C_ExecuteUbergraph_BP_EpicBattleSequenceActor, CallFunc_Conv_BoolToText_ReturnValue_5) == 0x000420, "Member 'BP_EpicBattleSequenceActor_C_ExecuteUbergraph_BP_EpicBattleSequenceActor::CallFunc_Conv_BoolToText_ReturnValue_5' has a wrong offset!");
