#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_EnviroDestructible

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_EnviroDestructible.BP_EnviroDestructible_C
// 0x0030 (0x02C0 - 0x0290)
class ABP_EnviroDestructible_C : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   ObjectGlobalID;                                    // 0x02A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ChestID;                                           // 0x02A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_jRPG_Character_World_C*             As_BP_J_RPG_Character_World;                       // 0x02B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          DoesntRespawnIfInteracted;                         // 0x02B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsInteractionStatePersistent;                      // 0x02B9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HasBeenInteractedWith;                             // 0x02BA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShouldRegisterInSave;                              // 0x02BB(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void CanInteractWithMount(bool* CanInteract);
	void Destroy();
	void ExecuteUbergraph_BP_EnviroDestructible(int32 EntryPoint);
	void ExplorationAttacked(class ABP_jRPG_Character_World_C* PlayerCharacter, const struct FVector& ImpactPoint);
	bool FindDuplicateID_Chest();
	bool FindDuplicateID_Destructible();
	void FreeAimHit(class ABP_jRPG_Character_World_C* PlayerCharacterWorld, const struct FVector& HitLocation, bool IsDisabled);
	void GetInteractionPromptParams(struct FFPromptParams* PromptParams);
	void GetInteractionState(bool* InteractionState);
	void InteractedStateAfterShot();
	void IsFreeAimTargetDisabled(bool* IsDisabled);
	void IsInteractionAvailable(bool* Available);
	void IsInteractionDone(bool* Done);
	void OnEnemyBattleStateLoaded(bool BattleState);
	void OnInteractionDisabled();
	void OnInteractionEnabled();
	void OnInteractionRequested(class ABP_jRPG_Character_World_C* InteractingWorldCharacter, bool Instant);
	void OnObjectInteractionStateLoaded(bool InteractionState);
	void ReceiveBeginPlay();
	void SetInteractionState(const bool Value);
	bool ShouldHideDistantInteraction();
	void UserConstructionScript();

	void GetInteractionFeedbackLocation(struct FVector* Location) const;
	void GetInteractionLocation(struct FVector* Location) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_EnviroDestructible_C">();
	}
	static class ABP_EnviroDestructible_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_EnviroDestructible_C>();
	}
};
static_assert(alignof(ABP_EnviroDestructible_C) == 0x000008, "Wrong alignment on ABP_EnviroDestructible_C");
static_assert(sizeof(ABP_EnviroDestructible_C) == 0x0002C0, "Wrong size on ABP_EnviroDestructible_C");
static_assert(offsetof(ABP_EnviroDestructible_C, UberGraphFrame) == 0x000290, "Member 'ABP_EnviroDestructible_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_EnviroDestructible_C, DefaultSceneRoot) == 0x000298, "Member 'ABP_EnviroDestructible_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_EnviroDestructible_C, ObjectGlobalID) == 0x0002A0, "Member 'ABP_EnviroDestructible_C::ObjectGlobalID' has a wrong offset!");
static_assert(offsetof(ABP_EnviroDestructible_C, ChestID) == 0x0002A8, "Member 'ABP_EnviroDestructible_C::ChestID' has a wrong offset!");
static_assert(offsetof(ABP_EnviroDestructible_C, As_BP_J_RPG_Character_World) == 0x0002B0, "Member 'ABP_EnviroDestructible_C::As_BP_J_RPG_Character_World' has a wrong offset!");
static_assert(offsetof(ABP_EnviroDestructible_C, DoesntRespawnIfInteracted) == 0x0002B8, "Member 'ABP_EnviroDestructible_C::DoesntRespawnIfInteracted' has a wrong offset!");
static_assert(offsetof(ABP_EnviroDestructible_C, IsInteractionStatePersistent) == 0x0002B9, "Member 'ABP_EnviroDestructible_C::IsInteractionStatePersistent' has a wrong offset!");
static_assert(offsetof(ABP_EnviroDestructible_C, HasBeenInteractedWith) == 0x0002BA, "Member 'ABP_EnviroDestructible_C::HasBeenInteractedWith' has a wrong offset!");
static_assert(offsetof(ABP_EnviroDestructible_C, ShouldRegisterInSave) == 0x0002BB, "Member 'ABP_EnviroDestructible_C::ShouldRegisterInSave' has a wrong offset!");

}

