#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_EnemyWorld_Bourgeon

#include "Basic.hpp"

#include "BP_jRPG_Enemy_World_Base_Seamless_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_EnemyWorld_Bourgeon.BP_EnemyWorld_Bourgeon_C
// 0x0020 (0x0D10 - 0x0CF0)
class ABP_EnemyWorld_Bourgeon_C final : public ABP_jRPG_Enemy_World_Base_Seamless_C
{
public:
	class UAudioComponent*                        AC_Bubble_Idle;                                    // 0x0CF0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      FX_Spit;                                           // 0x0CF8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      Bubbles;                                           // 0x0D00(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_EnemyWorld_Bourgeon_C">();
	}
	static class ABP_EnemyWorld_Bourgeon_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_EnemyWorld_Bourgeon_C>();
	}
};
static_assert(alignof(ABP_EnemyWorld_Bourgeon_C) == 0x000010, "Wrong alignment on ABP_EnemyWorld_Bourgeon_C");
static_assert(sizeof(ABP_EnemyWorld_Bourgeon_C) == 0x000D10, "Wrong size on ABP_EnemyWorld_Bourgeon_C");
static_assert(offsetof(ABP_EnemyWorld_Bourgeon_C, AC_Bubble_Idle) == 0x000CF0, "Member 'ABP_EnemyWorld_Bourgeon_C::AC_Bubble_Idle' has a wrong offset!");
static_assert(offsetof(ABP_EnemyWorld_Bourgeon_C, FX_Spit) == 0x000CF8, "Member 'ABP_EnemyWorld_Bourgeon_C::FX_Spit' has a wrong offset!");
static_assert(offsetof(ABP_EnemyWorld_Bourgeon_C, Bubbles) == 0x000D00, "Member 'ABP_EnemyWorld_Bourgeon_C::Bubbles' has a wrong offset!");

}

