#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_EnviroDestructible_Props

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_EnviroDestructible_Props.BP_EnviroDestructible_Props_C.DrawDebug
// 0x00E8 (0x00E8 - 0x0000)
struct BP_EnviroDestructible_Props_C_DrawDebug final
{
public:
	struct FLinearColor                           CallFunc_GetDebugColor_ReturnValue;                // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_IsValidTimerHandle_ReturnValue;        // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_K2_GetTimerRemainingTimeHandle_ReturnValue; // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetComponentBounds_Origin;                // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetComponentBounds_BoxExtent;             // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetComponentBounds_SphereRadius;          // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0058(0x0048)(HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00B8(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Format_ReturnValue;                       // 0x00C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetBoolCVar_ReturnValue;                  // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_A_ImplicitCast;               // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EnviroDestructible_Props_C_DrawDebug) == 0x000008, "Wrong alignment on BP_EnviroDestructible_Props_C_DrawDebug");
static_assert(sizeof(BP_EnviroDestructible_Props_C_DrawDebug) == 0x0000E8, "Wrong size on BP_EnviroDestructible_Props_C_DrawDebug");
static_assert(offsetof(BP_EnviroDestructible_Props_C_DrawDebug, CallFunc_GetDebugColor_ReturnValue) == 0x000000, "Member 'BP_EnviroDestructible_Props_C_DrawDebug::CallFunc_GetDebugColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_Props_C_DrawDebug, CallFunc_K2_IsValidTimerHandle_ReturnValue) == 0x000010, "Member 'BP_EnviroDestructible_Props_C_DrawDebug::CallFunc_K2_IsValidTimerHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_Props_C_DrawDebug, CallFunc_K2_GetTimerRemainingTimeHandle_ReturnValue) == 0x000014, "Member 'BP_EnviroDestructible_Props_C_DrawDebug::CallFunc_K2_GetTimerRemainingTimeHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_Props_C_DrawDebug, CallFunc_SelectFloat_ReturnValue) == 0x000018, "Member 'BP_EnviroDestructible_Props_C_DrawDebug::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_Props_C_DrawDebug, CallFunc_GetComponentBounds_Origin) == 0x000020, "Member 'BP_EnviroDestructible_Props_C_DrawDebug::CallFunc_GetComponentBounds_Origin' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_Props_C_DrawDebug, CallFunc_GetComponentBounds_BoxExtent) == 0x000038, "Member 'BP_EnviroDestructible_Props_C_DrawDebug::CallFunc_GetComponentBounds_BoxExtent' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_Props_C_DrawDebug, CallFunc_GetComponentBounds_SphereRadius) == 0x000050, "Member 'BP_EnviroDestructible_Props_C_DrawDebug::CallFunc_GetComponentBounds_SphereRadius' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_Props_C_DrawDebug, K2Node_MakeStruct_FormatArgumentData) == 0x000058, "Member 'BP_EnviroDestructible_Props_C_DrawDebug::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_Props_C_DrawDebug, CallFunc_Add_VectorVector_ReturnValue) == 0x0000A0, "Member 'BP_EnviroDestructible_Props_C_DrawDebug::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_Props_C_DrawDebug, K2Node_MakeArray_Array) == 0x0000B8, "Member 'BP_EnviroDestructible_Props_C_DrawDebug::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_Props_C_DrawDebug, CallFunc_Format_ReturnValue) == 0x0000C8, "Member 'BP_EnviroDestructible_Props_C_DrawDebug::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_Props_C_DrawDebug, CallFunc_GetBoolCVar_ReturnValue) == 0x0000D8, "Member 'BP_EnviroDestructible_Props_C_DrawDebug::CallFunc_GetBoolCVar_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_Props_C_DrawDebug, CallFunc_SelectFloat_A_ImplicitCast) == 0x0000E0, "Member 'BP_EnviroDestructible_Props_C_DrawDebug::CallFunc_SelectFloat_A_ImplicitCast' has a wrong offset!");

// Function BP_EnviroDestructible_Props.BP_EnviroDestructible_Props_C.Editor_Migrate
// 0x0110 (0x0110 - 0x0000)
struct BP_EnviroDestructible_Props_C_Editor_Migrate final
{
public:
	class UGeometryCollectionComponent*           GeometryCollComp;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_ObjectToText_ReturnValue;            // 0x0008(0x0010)()
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0028(0x0048)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0070(0x0010)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0080(0x0010)(ReferenceParm)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0090(0x0048)(HasGetValueTypeHash)
	class FString                                 CallFunc_Format_ReturnValue;                       // 0x00D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x00E8(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Format_ReturnValue_1;                     // 0x00F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_GetMass_ReturnValue;                      // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x010C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EnviroDestructible_Props_C_Editor_Migrate) == 0x000008, "Wrong alignment on BP_EnviroDestructible_Props_C_Editor_Migrate");
static_assert(sizeof(BP_EnviroDestructible_Props_C_Editor_Migrate) == 0x000110, "Wrong size on BP_EnviroDestructible_Props_C_Editor_Migrate");
static_assert(offsetof(BP_EnviroDestructible_Props_C_Editor_Migrate, GeometryCollComp) == 0x000000, "Member 'BP_EnviroDestructible_Props_C_Editor_Migrate::GeometryCollComp' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_Props_C_Editor_Migrate, CallFunc_Conv_ObjectToText_ReturnValue) == 0x000008, "Member 'BP_EnviroDestructible_Props_C_Editor_Migrate::CallFunc_Conv_ObjectToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_Props_C_Editor_Migrate, CallFunc_GetDisplayName_ReturnValue) == 0x000018, "Member 'BP_EnviroDestructible_Props_C_Editor_Migrate::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_Props_C_Editor_Migrate, K2Node_MakeStruct_FormatArgumentData) == 0x000028, "Member 'BP_EnviroDestructible_Props_C_Editor_Migrate::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_Props_C_Editor_Migrate, CallFunc_Conv_StringToText_ReturnValue) == 0x000070, "Member 'BP_EnviroDestructible_Props_C_Editor_Migrate::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_Props_C_Editor_Migrate, K2Node_MakeArray_Array) == 0x000080, "Member 'BP_EnviroDestructible_Props_C_Editor_Migrate::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_Props_C_Editor_Migrate, K2Node_MakeStruct_FormatArgumentData_1) == 0x000090, "Member 'BP_EnviroDestructible_Props_C_Editor_Migrate::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_Props_C_Editor_Migrate, CallFunc_Format_ReturnValue) == 0x0000D8, "Member 'BP_EnviroDestructible_Props_C_Editor_Migrate::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_Props_C_Editor_Migrate, K2Node_MakeArray_Array_1) == 0x0000E8, "Member 'BP_EnviroDestructible_Props_C_Editor_Migrate::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_Props_C_Editor_Migrate, CallFunc_Format_ReturnValue_1) == 0x0000F8, "Member 'BP_EnviroDestructible_Props_C_Editor_Migrate::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_Props_C_Editor_Migrate, CallFunc_GetMass_ReturnValue) == 0x000108, "Member 'BP_EnviroDestructible_Props_C_Editor_Migrate::CallFunc_GetMass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_Props_C_Editor_Migrate, CallFunc_IsValid_ReturnValue) == 0x00010C, "Member 'BP_EnviroDestructible_Props_C_Editor_Migrate::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_EnviroDestructible_Props.BP_EnviroDestructible_Props_C.ExecuteUbergraph_BP_EnviroDestructible_Props
// 0x0188 (0x0188 - 0x0000)
struct BP_EnviroDestructible_Props_C_ExecuteUbergraph_BP_EnviroDestructible_Props final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_jRPG_Character_World_C*             K2Node_Event_PlayerCharacterWorld;                 // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_HitLocation;                          // 0x0010(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDisabled;                           // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCameraComponent*                       CallFunc_GetMainCamera_MainCamera;                 // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ABP_jRPG_Character_World_C*             K2Node_Event_PlayerCharacter;                      // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_ImpactPoint;                          // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue;      // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0070(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_CustomEvent_Location;                       // 0x0090(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               K2Node_CustomEvent_Rotation;                       // 0x00A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FChaosBreakEvent                       K2Node_CustomEvent_BreakEvent;                     // 0x00C0(0x0078)(ConstParm, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0138(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPackagedForDistribution_ReturnValue;    // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0151(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_152[0x6];                                      // 0x0152(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Lerp_ReturnValue;                         // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UPrimitiveComponent* HitComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, const struct FVector& NormalImpulse, const struct FHitResult& Hit)> K2Node_CreateDelegate_OutputDelegate; // 0x0164(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0174(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_175[0x3];                                      // 0x0175(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Lerp_Alpha_ImplicitCast;                  // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValueOnMaterials_ParameterValue_ImplicitCast; // 0x0180(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EnviroDestructible_Props_C_ExecuteUbergraph_BP_EnviroDestructible_Props) == 0x000008, "Wrong alignment on BP_EnviroDestructible_Props_C_ExecuteUbergraph_BP_EnviroDestructible_Props");
static_assert(sizeof(BP_EnviroDestructible_Props_C_ExecuteUbergraph_BP_EnviroDestructible_Props) == 0x000188, "Wrong size on BP_EnviroDestructible_Props_C_ExecuteUbergraph_BP_EnviroDestructible_Props");
static_assert(offsetof(BP_EnviroDestructible_Props_C_ExecuteUbergraph_BP_EnviroDestructible_Props, EntryPoint) == 0x000000, "Member 'BP_EnviroDestructible_Props_C_ExecuteUbergraph_BP_EnviroDestructible_Props::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_Props_C_ExecuteUbergraph_BP_EnviroDestructible_Props, K2Node_Event_PlayerCharacterWorld) == 0x000008, "Member 'BP_EnviroDestructible_Props_C_ExecuteUbergraph_BP_EnviroDestructible_Props::K2Node_Event_PlayerCharacterWorld' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_Props_C_ExecuteUbergraph_BP_EnviroDestructible_Props, K2Node_Event_HitLocation) == 0x000010, "Member 'BP_EnviroDestructible_Props_C_ExecuteUbergraph_BP_EnviroDestructible_Props::K2Node_Event_HitLocation' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_Props_C_ExecuteUbergraph_BP_EnviroDestructible_Props, K2Node_Event_IsDisabled) == 0x000028, "Member 'BP_EnviroDestructible_Props_C_ExecuteUbergraph_BP_EnviroDestructible_Props::K2Node_Event_IsDisabled' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_Props_C_ExecuteUbergraph_BP_EnviroDestructible_Props, CallFunc_GetMainCamera_MainCamera) == 0x000030, "Member 'BP_EnviroDestructible_Props_C_ExecuteUbergraph_BP_EnviroDestructible_Props::CallFunc_GetMainCamera_MainCamera' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_Props_C_ExecuteUbergraph_BP_EnviroDestructible_Props, K2Node_Event_PlayerCharacter) == 0x000038, "Member 'BP_EnviroDestructible_Props_C_ExecuteUbergraph_BP_EnviroDestructible_Props::K2Node_Event_PlayerCharacter' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_Props_C_ExecuteUbergraph_BP_EnviroDestructible_Props, K2Node_Event_ImpactPoint) == 0x000040, "Member 'BP_EnviroDestructible_Props_C_ExecuteUbergraph_BP_EnviroDestructible_Props::K2Node_Event_ImpactPoint' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_Props_C_ExecuteUbergraph_BP_EnviroDestructible_Props, CallFunc_K2_GetComponentRotation_ReturnValue) == 0x000058, "Member 'BP_EnviroDestructible_Props_C_ExecuteUbergraph_BP_EnviroDestructible_Props::CallFunc_K2_GetComponentRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_Props_C_ExecuteUbergraph_BP_EnviroDestructible_Props, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000070, "Member 'BP_EnviroDestructible_Props_C_ExecuteUbergraph_BP_EnviroDestructible_Props::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_Props_C_ExecuteUbergraph_BP_EnviroDestructible_Props, CallFunc_Not_PreBool_ReturnValue) == 0x000088, "Member 'BP_EnviroDestructible_Props_C_ExecuteUbergraph_BP_EnviroDestructible_Props::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_Props_C_ExecuteUbergraph_BP_EnviroDestructible_Props, K2Node_CustomEvent_Location) == 0x000090, "Member 'BP_EnviroDestructible_Props_C_ExecuteUbergraph_BP_EnviroDestructible_Props::K2Node_CustomEvent_Location' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_Props_C_ExecuteUbergraph_BP_EnviroDestructible_Props, K2Node_CustomEvent_Rotation) == 0x0000A8, "Member 'BP_EnviroDestructible_Props_C_ExecuteUbergraph_BP_EnviroDestructible_Props::K2Node_CustomEvent_Rotation' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_Props_C_ExecuteUbergraph_BP_EnviroDestructible_Props, K2Node_CustomEvent_BreakEvent) == 0x0000C0, "Member 'BP_EnviroDestructible_Props_C_ExecuteUbergraph_BP_EnviroDestructible_Props::K2Node_CustomEvent_BreakEvent' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_Props_C_ExecuteUbergraph_BP_EnviroDestructible_Props, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000138, "Member 'BP_EnviroDestructible_Props_C_ExecuteUbergraph_BP_EnviroDestructible_Props::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_Props_C_ExecuteUbergraph_BP_EnviroDestructible_Props, CallFunc_IsPackagedForDistribution_ReturnValue) == 0x000150, "Member 'BP_EnviroDestructible_Props_C_ExecuteUbergraph_BP_EnviroDestructible_Props::CallFunc_IsPackagedForDistribution_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_Props_C_ExecuteUbergraph_BP_EnviroDestructible_Props, CallFunc_Not_PreBool_ReturnValue_1) == 0x000151, "Member 'BP_EnviroDestructible_Props_C_ExecuteUbergraph_BP_EnviroDestructible_Props::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_Props_C_ExecuteUbergraph_BP_EnviroDestructible_Props, CallFunc_Lerp_ReturnValue) == 0x000158, "Member 'BP_EnviroDestructible_Props_C_ExecuteUbergraph_BP_EnviroDestructible_Props::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_Props_C_ExecuteUbergraph_BP_EnviroDestructible_Props, K2Node_Event_DeltaSeconds) == 0x000160, "Member 'BP_EnviroDestructible_Props_C_ExecuteUbergraph_BP_EnviroDestructible_Props::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_Props_C_ExecuteUbergraph_BP_EnviroDestructible_Props, K2Node_CreateDelegate_OutputDelegate) == 0x000164, "Member 'BP_EnviroDestructible_Props_C_ExecuteUbergraph_BP_EnviroDestructible_Props::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_Props_C_ExecuteUbergraph_BP_EnviroDestructible_Props, CallFunc_Not_PreBool_ReturnValue_2) == 0x000174, "Member 'BP_EnviroDestructible_Props_C_ExecuteUbergraph_BP_EnviroDestructible_Props::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_Props_C_ExecuteUbergraph_BP_EnviroDestructible_Props, CallFunc_Lerp_Alpha_ImplicitCast) == 0x000178, "Member 'BP_EnviroDestructible_Props_C_ExecuteUbergraph_BP_EnviroDestructible_Props::CallFunc_Lerp_Alpha_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_Props_C_ExecuteUbergraph_BP_EnviroDestructible_Props, CallFunc_SetScalarParameterValueOnMaterials_ParameterValue_ImplicitCast) == 0x000180, "Member 'BP_EnviroDestructible_Props_C_ExecuteUbergraph_BP_EnviroDestructible_Props::CallFunc_SetScalarParameterValueOnMaterials_ParameterValue_ImplicitCast' has a wrong offset!");

// Function BP_EnviroDestructible_Props.BP_EnviroDestructible_Props_C.ExplorationAttacked
// 0x0020 (0x0020 - 0x0000)
struct BP_EnviroDestructible_Props_C_ExplorationAttacked final
{
public:
	class ABP_jRPG_Character_World_C*             PlayerCharacter;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ImpactPoint;                                       // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EnviroDestructible_Props_C_ExplorationAttacked) == 0x000008, "Wrong alignment on BP_EnviroDestructible_Props_C_ExplorationAttacked");
static_assert(sizeof(BP_EnviroDestructible_Props_C_ExplorationAttacked) == 0x000020, "Wrong size on BP_EnviroDestructible_Props_C_ExplorationAttacked");
static_assert(offsetof(BP_EnviroDestructible_Props_C_ExplorationAttacked, PlayerCharacter) == 0x000000, "Member 'BP_EnviroDestructible_Props_C_ExplorationAttacked::PlayerCharacter' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_Props_C_ExplorationAttacked, ImpactPoint) == 0x000008, "Member 'BP_EnviroDestructible_Props_C_ExplorationAttacked::ImpactPoint' has a wrong offset!");

// Function BP_EnviroDestructible_Props.BP_EnviroDestructible_Props_C.ForceDestroyDestructible
// 0x0030 (0x0030 - 0x0000)
struct BP_EnviroDestructible_Props_C_ForceDestroyDestructible final
{
public:
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0000(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue;      // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_EnviroDestructible_Props_C_ForceDestroyDestructible) == 0x000008, "Wrong alignment on BP_EnviroDestructible_Props_C_ForceDestroyDestructible");
static_assert(sizeof(BP_EnviroDestructible_Props_C_ForceDestroyDestructible) == 0x000030, "Wrong size on BP_EnviroDestructible_Props_C_ForceDestroyDestructible");
static_assert(offsetof(BP_EnviroDestructible_Props_C_ForceDestroyDestructible, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000000, "Member 'BP_EnviroDestructible_Props_C_ForceDestroyDestructible::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_Props_C_ForceDestroyDestructible, CallFunc_K2_GetComponentRotation_ReturnValue) == 0x000018, "Member 'BP_EnviroDestructible_Props_C_ForceDestroyDestructible::CallFunc_K2_GetComponentRotation_ReturnValue' has a wrong offset!");

// Function BP_EnviroDestructible_Props.BP_EnviroDestructible_Props_C.FreeAimHit
// 0x0028 (0x0028 - 0x0000)
struct BP_EnviroDestructible_Props_C_FreeAimHit final
{
public:
	class ABP_jRPG_Character_World_C*             PlayerCharacterWorld;                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HitLocation;                                       // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsDisabled;                                        // 0x0020(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EnviroDestructible_Props_C_FreeAimHit) == 0x000008, "Wrong alignment on BP_EnviroDestructible_Props_C_FreeAimHit");
static_assert(sizeof(BP_EnviroDestructible_Props_C_FreeAimHit) == 0x000028, "Wrong size on BP_EnviroDestructible_Props_C_FreeAimHit");
static_assert(offsetof(BP_EnviroDestructible_Props_C_FreeAimHit, PlayerCharacterWorld) == 0x000000, "Member 'BP_EnviroDestructible_Props_C_FreeAimHit::PlayerCharacterWorld' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_Props_C_FreeAimHit, HitLocation) == 0x000008, "Member 'BP_EnviroDestructible_Props_C_FreeAimHit::HitLocation' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_Props_C_FreeAimHit, IsDisabled) == 0x000020, "Member 'BP_EnviroDestructible_Props_C_FreeAimHit::IsDisabled' has a wrong offset!");

// Function BP_EnviroDestructible_Props.BP_EnviroDestructible_Props_C.GetDebugColor
// 0x0044 (0x0044 - 0x0000)
struct BP_EnviroDestructible_Props_C_GetDebugColor final
{
public:
	struct FLinearColor                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue;                  // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue_1;                // 0x0024(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue_2;                // 0x0034(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EnviroDestructible_Props_C_GetDebugColor) == 0x000004, "Wrong alignment on BP_EnviroDestructible_Props_C_GetDebugColor");
static_assert(sizeof(BP_EnviroDestructible_Props_C_GetDebugColor) == 0x000044, "Wrong size on BP_EnviroDestructible_Props_C_GetDebugColor");
static_assert(offsetof(BP_EnviroDestructible_Props_C_GetDebugColor, ReturnValue) == 0x000000, "Member 'BP_EnviroDestructible_Props_C_GetDebugColor::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_Props_C_GetDebugColor, CallFunc_SelectColor_ReturnValue) == 0x000010, "Member 'BP_EnviroDestructible_Props_C_GetDebugColor::CallFunc_SelectColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_Props_C_GetDebugColor, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'BP_EnviroDestructible_Props_C_GetDebugColor::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_Props_C_GetDebugColor, CallFunc_SelectColor_ReturnValue_1) == 0x000024, "Member 'BP_EnviroDestructible_Props_C_GetDebugColor::CallFunc_SelectColor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_Props_C_GetDebugColor, CallFunc_SelectColor_ReturnValue_2) == 0x000034, "Member 'BP_EnviroDestructible_Props_C_GetDebugColor::CallFunc_SelectColor_ReturnValue_2' has a wrong offset!");

// Function BP_EnviroDestructible_Props.BP_EnviroDestructible_Props_C.IsFreeAimTargetDisabled
// 0x0001 (0x0001 - 0x0000)
struct BP_EnviroDestructible_Props_C_IsFreeAimTargetDisabled final
{
public:
	bool                                          IsDisabled;                                        // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EnviroDestructible_Props_C_IsFreeAimTargetDisabled) == 0x000001, "Wrong alignment on BP_EnviroDestructible_Props_C_IsFreeAimTargetDisabled");
static_assert(sizeof(BP_EnviroDestructible_Props_C_IsFreeAimTargetDisabled) == 0x000001, "Wrong size on BP_EnviroDestructible_Props_C_IsFreeAimTargetDisabled");
static_assert(offsetof(BP_EnviroDestructible_Props_C_IsFreeAimTargetDisabled, IsDisabled) == 0x000000, "Member 'BP_EnviroDestructible_Props_C_IsFreeAimTargetDisabled::IsDisabled' has a wrong offset!");

// Function BP_EnviroDestructible_Props.BP_EnviroDestructible_Props_C.OnChaosBreak
// 0x0078 (0x0078 - 0x0000)
struct BP_EnviroDestructible_Props_C_OnChaosBreak final
{
public:
	struct FChaosBreakEvent                       BreakEvent;                                        // 0x0000(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_EnviroDestructible_Props_C_OnChaosBreak) == 0x000008, "Wrong alignment on BP_EnviroDestructible_Props_C_OnChaosBreak");
static_assert(sizeof(BP_EnviroDestructible_Props_C_OnChaosBreak) == 0x000078, "Wrong size on BP_EnviroDestructible_Props_C_OnChaosBreak");
static_assert(offsetof(BP_EnviroDestructible_Props_C_OnChaosBreak, BreakEvent) == 0x000000, "Member 'BP_EnviroDestructible_Props_C_OnChaosBreak::BreakEvent' has a wrong offset!");

// Function BP_EnviroDestructible_Props.BP_EnviroDestructible_Props_C.OnHitReceived
// 0x0030 (0x0030 - 0x0000)
struct BP_EnviroDestructible_Props_C_OnHitReceived final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               Rotation;                                          // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_EnviroDestructible_Props_C_OnHitReceived) == 0x000008, "Wrong alignment on BP_EnviroDestructible_Props_C_OnHitReceived");
static_assert(sizeof(BP_EnviroDestructible_Props_C_OnHitReceived) == 0x000030, "Wrong size on BP_EnviroDestructible_Props_C_OnHitReceived");
static_assert(offsetof(BP_EnviroDestructible_Props_C_OnHitReceived, Location) == 0x000000, "Member 'BP_EnviroDestructible_Props_C_OnHitReceived::Location' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_Props_C_OnHitReceived, Rotation) == 0x000018, "Member 'BP_EnviroDestructible_Props_C_OnHitReceived::Rotation' has a wrong offset!");

// Function BP_EnviroDestructible_Props.BP_EnviroDestructible_Props_C.OnStaticMeshComponentHit
// 0x0190 (0x0190 - 0x0000)
struct BP_EnviroDestructible_Props_C_OnStaticMeshComponentHit final
{
public:
	class UPrimitiveComponent*                    HitComponent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                NormalImpulse;                                     // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0030(0x00F8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0128(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetComponentBounds_Origin;                // 0x0140(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetComponentBounds_BoxExtent;             // 0x0158(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetComponentBounds_SphereRadius;          // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_174[0x4];                                      // 0x0174(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue;           // 0x0178(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_EnviroDestructible_Props_C_OnStaticMeshComponentHit) == 0x000008, "Wrong alignment on BP_EnviroDestructible_Props_C_OnStaticMeshComponentHit");
static_assert(sizeof(BP_EnviroDestructible_Props_C_OnStaticMeshComponentHit) == 0x000190, "Wrong size on BP_EnviroDestructible_Props_C_OnStaticMeshComponentHit");
static_assert(offsetof(BP_EnviroDestructible_Props_C_OnStaticMeshComponentHit, HitComponent) == 0x000000, "Member 'BP_EnviroDestructible_Props_C_OnStaticMeshComponentHit::HitComponent' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_Props_C_OnStaticMeshComponentHit, OtherActor) == 0x000008, "Member 'BP_EnviroDestructible_Props_C_OnStaticMeshComponentHit::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_Props_C_OnStaticMeshComponentHit, OtherComp) == 0x000010, "Member 'BP_EnviroDestructible_Props_C_OnStaticMeshComponentHit::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_Props_C_OnStaticMeshComponentHit, NormalImpulse) == 0x000018, "Member 'BP_EnviroDestructible_Props_C_OnStaticMeshComponentHit::NormalImpulse' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_Props_C_OnStaticMeshComponentHit, Hit) == 0x000030, "Member 'BP_EnviroDestructible_Props_C_OnStaticMeshComponentHit::Hit' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_Props_C_OnStaticMeshComponentHit, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000128, "Member 'BP_EnviroDestructible_Props_C_OnStaticMeshComponentHit::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_Props_C_OnStaticMeshComponentHit, CallFunc_GetComponentBounds_Origin) == 0x000140, "Member 'BP_EnviroDestructible_Props_C_OnStaticMeshComponentHit::CallFunc_GetComponentBounds_Origin' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_Props_C_OnStaticMeshComponentHit, CallFunc_GetComponentBounds_BoxExtent) == 0x000158, "Member 'BP_EnviroDestructible_Props_C_OnStaticMeshComponentHit::CallFunc_GetComponentBounds_BoxExtent' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_Props_C_OnStaticMeshComponentHit, CallFunc_GetComponentBounds_SphereRadius) == 0x000170, "Member 'BP_EnviroDestructible_Props_C_OnStaticMeshComponentHit::CallFunc_GetComponentBounds_SphereRadius' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_Props_C_OnStaticMeshComponentHit, CallFunc_FindLookAtRotation_ReturnValue) == 0x000178, "Member 'BP_EnviroDestructible_Props_C_OnStaticMeshComponentHit::CallFunc_FindLookAtRotation_ReturnValue' has a wrong offset!");

// Function BP_EnviroDestructible_Props.BP_EnviroDestructible_Props_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_EnviroDestructible_Props_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EnviroDestructible_Props_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_EnviroDestructible_Props_C_ReceiveTick");
static_assert(sizeof(BP_EnviroDestructible_Props_C_ReceiveTick) == 0x000004, "Wrong size on BP_EnviroDestructible_Props_C_ReceiveTick");
static_assert(offsetof(BP_EnviroDestructible_Props_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_EnviroDestructible_Props_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_EnviroDestructible_Props.BP_EnviroDestructible_Props_C.SpawnDestructionField
// 0x00A0 (0x00A0 - 0x0000)
struct BP_EnviroDestructible_Props_C_SpawnDestructionField final
{
public:
	struct FVector                                SpawnTransform_Location;                           // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               SpawnTransform_Rotation;                           // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0030(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_MasterField_DestructibleProps_FreeAimHit_C* CallFunc_FinishSpawningActor_ReturnValue;  // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EnviroDestructible_Props_C_SpawnDestructionField) == 0x000010, "Wrong alignment on BP_EnviroDestructible_Props_C_SpawnDestructionField");
static_assert(sizeof(BP_EnviroDestructible_Props_C_SpawnDestructionField) == 0x0000A0, "Wrong size on BP_EnviroDestructible_Props_C_SpawnDestructionField");
static_assert(offsetof(BP_EnviroDestructible_Props_C_SpawnDestructionField, SpawnTransform_Location) == 0x000000, "Member 'BP_EnviroDestructible_Props_C_SpawnDestructionField::SpawnTransform_Location' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_Props_C_SpawnDestructionField, SpawnTransform_Rotation) == 0x000018, "Member 'BP_EnviroDestructible_Props_C_SpawnDestructionField::SpawnTransform_Rotation' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_Props_C_SpawnDestructionField, CallFunc_MakeTransform_ReturnValue) == 0x000030, "Member 'BP_EnviroDestructible_Props_C_SpawnDestructionField::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_Props_C_SpawnDestructionField, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000090, "Member 'BP_EnviroDestructible_Props_C_SpawnDestructionField::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_Props_C_SpawnDestructionField, CallFunc_FinishSpawningActor_ReturnValue) == 0x000098, "Member 'BP_EnviroDestructible_Props_C_SpawnDestructionField::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");

// Function BP_EnviroDestructible_Props.BP_EnviroDestructible_Props_C.SpawnGeometryCollectionIfNeeded
// 0x00A0 (0x00A0 - 0x0000)
struct BP_EnviroDestructible_Props_C_SpawnGeometryCollectionIfNeeded final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0010(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FChaosBreakEvent& BreakEvent)> K2Node_CreateDelegate_OutputDelegate_1; // 0x0018(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0030(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGeometryCollectionComponent*           CallFunc_SpawnGeometryCollectionComponentWithRestCollection_ReturnValue; // 0x0090(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_SetTimerDelegate_Time_ImplicitCast;    // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EnviroDestructible_Props_C_SpawnGeometryCollectionIfNeeded) == 0x000010, "Wrong alignment on BP_EnviroDestructible_Props_C_SpawnGeometryCollectionIfNeeded");
static_assert(sizeof(BP_EnviroDestructible_Props_C_SpawnGeometryCollectionIfNeeded) == 0x0000A0, "Wrong size on BP_EnviroDestructible_Props_C_SpawnGeometryCollectionIfNeeded");
static_assert(offsetof(BP_EnviroDestructible_Props_C_SpawnGeometryCollectionIfNeeded, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'BP_EnviroDestructible_Props_C_SpawnGeometryCollectionIfNeeded::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_Props_C_SpawnGeometryCollectionIfNeeded, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000010, "Member 'BP_EnviroDestructible_Props_C_SpawnGeometryCollectionIfNeeded::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_Props_C_SpawnGeometryCollectionIfNeeded, K2Node_CreateDelegate_OutputDelegate_1) == 0x000018, "Member 'BP_EnviroDestructible_Props_C_SpawnGeometryCollectionIfNeeded::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_Props_C_SpawnGeometryCollectionIfNeeded, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'BP_EnviroDestructible_Props_C_SpawnGeometryCollectionIfNeeded::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_Props_C_SpawnGeometryCollectionIfNeeded, CallFunc_Not_PreBool_ReturnValue) == 0x000029, "Member 'BP_EnviroDestructible_Props_C_SpawnGeometryCollectionIfNeeded::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_Props_C_SpawnGeometryCollectionIfNeeded, CallFunc_GetTransform_ReturnValue) == 0x000030, "Member 'BP_EnviroDestructible_Props_C_SpawnGeometryCollectionIfNeeded::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_Props_C_SpawnGeometryCollectionIfNeeded, CallFunc_SpawnGeometryCollectionComponentWithRestCollection_ReturnValue) == 0x000090, "Member 'BP_EnviroDestructible_Props_C_SpawnGeometryCollectionIfNeeded::CallFunc_SpawnGeometryCollectionComponentWithRestCollection_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_Props_C_SpawnGeometryCollectionIfNeeded, CallFunc_K2_SetTimerDelegate_Time_ImplicitCast) == 0x000098, "Member 'BP_EnviroDestructible_Props_C_SpawnGeometryCollectionIfNeeded::CallFunc_K2_SetTimerDelegate_Time_ImplicitCast' has a wrong offset!");

// Function BP_EnviroDestructible_Props.BP_EnviroDestructible_Props_C.SpawnGeometryCollectionOfSurroundingDestructibles
// 0x02A0 (0x02A0 - 0x0000)
struct BP_EnviroDestructible_Props_C_SpawnGeometryCollectionOfSurroundingDestructibles final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0010(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Conv_IntToVector_ReturnValue;             // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetComponentBounds_Origin;                // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetComponentBounds_BoxExtent;             // 0x0070(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetComponentBounds_SphereRadius;          // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0090(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FHitResult>                     CallFunc_BoxTraceMulti_OutHits;                    // 0x00A8(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_BoxTraceMulti_ReturnValue;                // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_Array_Get_Item;                           // 0x00C0(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x01B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x01BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1BB[0x1];                                      // 0x01BB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x01BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C4[0x4];                                      // 0x01C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x01C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x01E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x01F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0210(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0228(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0230(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0238(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0250(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x0254(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0258(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25C[0x4];                                      // 0x025C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0260(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0278(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_EnviroDestructible_Props_C*         K2Node_DynamicCast_AsBP_Enviro_Destructible_Props; // 0x0290(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EnviroDestructible_Props_C_SpawnGeometryCollectionOfSurroundingDestructibles) == 0x000008, "Wrong alignment on BP_EnviroDestructible_Props_C_SpawnGeometryCollectionOfSurroundingDestructibles");
static_assert(sizeof(BP_EnviroDestructible_Props_C_SpawnGeometryCollectionOfSurroundingDestructibles) == 0x0002A0, "Wrong size on BP_EnviroDestructible_Props_C_SpawnGeometryCollectionOfSurroundingDestructibles");
static_assert(offsetof(BP_EnviroDestructible_Props_C_SpawnGeometryCollectionOfSurroundingDestructibles, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BP_EnviroDestructible_Props_C_SpawnGeometryCollectionOfSurroundingDestructibles::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_Props_C_SpawnGeometryCollectionOfSurroundingDestructibles, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_EnviroDestructible_Props_C_SpawnGeometryCollectionOfSurroundingDestructibles::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_Props_C_SpawnGeometryCollectionOfSurroundingDestructibles, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_EnviroDestructible_Props_C_SpawnGeometryCollectionOfSurroundingDestructibles::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_Props_C_SpawnGeometryCollectionOfSurroundingDestructibles, Temp_object_Variable) == 0x000010, "Member 'BP_EnviroDestructible_Props_C_SpawnGeometryCollectionOfSurroundingDestructibles::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_Props_C_SpawnGeometryCollectionOfSurroundingDestructibles, CallFunc_Not_PreBool_ReturnValue) == 0x000020, "Member 'BP_EnviroDestructible_Props_C_SpawnGeometryCollectionOfSurroundingDestructibles::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_Props_C_SpawnGeometryCollectionOfSurroundingDestructibles, CallFunc_Conv_IntToVector_ReturnValue) == 0x000028, "Member 'BP_EnviroDestructible_Props_C_SpawnGeometryCollectionOfSurroundingDestructibles::CallFunc_Conv_IntToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_Props_C_SpawnGeometryCollectionOfSurroundingDestructibles, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000040, "Member 'BP_EnviroDestructible_Props_C_SpawnGeometryCollectionOfSurroundingDestructibles::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_Props_C_SpawnGeometryCollectionOfSurroundingDestructibles, CallFunc_GetComponentBounds_Origin) == 0x000058, "Member 'BP_EnviroDestructible_Props_C_SpawnGeometryCollectionOfSurroundingDestructibles::CallFunc_GetComponentBounds_Origin' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_Props_C_SpawnGeometryCollectionOfSurroundingDestructibles, CallFunc_GetComponentBounds_BoxExtent) == 0x000070, "Member 'BP_EnviroDestructible_Props_C_SpawnGeometryCollectionOfSurroundingDestructibles::CallFunc_GetComponentBounds_BoxExtent' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_Props_C_SpawnGeometryCollectionOfSurroundingDestructibles, CallFunc_GetComponentBounds_SphereRadius) == 0x000088, "Member 'BP_EnviroDestructible_Props_C_SpawnGeometryCollectionOfSurroundingDestructibles::CallFunc_GetComponentBounds_SphereRadius' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_Props_C_SpawnGeometryCollectionOfSurroundingDestructibles, CallFunc_Add_VectorVector_ReturnValue) == 0x000090, "Member 'BP_EnviroDestructible_Props_C_SpawnGeometryCollectionOfSurroundingDestructibles::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_Props_C_SpawnGeometryCollectionOfSurroundingDestructibles, CallFunc_BoxTraceMulti_OutHits) == 0x0000A8, "Member 'BP_EnviroDestructible_Props_C_SpawnGeometryCollectionOfSurroundingDestructibles::CallFunc_BoxTraceMulti_OutHits' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_Props_C_SpawnGeometryCollectionOfSurroundingDestructibles, CallFunc_BoxTraceMulti_ReturnValue) == 0x0000B8, "Member 'BP_EnviroDestructible_Props_C_SpawnGeometryCollectionOfSurroundingDestructibles::CallFunc_BoxTraceMulti_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_Props_C_SpawnGeometryCollectionOfSurroundingDestructibles, CallFunc_Array_Length_ReturnValue) == 0x0000BC, "Member 'BP_EnviroDestructible_Props_C_SpawnGeometryCollectionOfSurroundingDestructibles::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_Props_C_SpawnGeometryCollectionOfSurroundingDestructibles, CallFunc_Array_Get_Item) == 0x0000C0, "Member 'BP_EnviroDestructible_Props_C_SpawnGeometryCollectionOfSurroundingDestructibles::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_Props_C_SpawnGeometryCollectionOfSurroundingDestructibles, CallFunc_Less_IntInt_ReturnValue) == 0x0001B8, "Member 'BP_EnviroDestructible_Props_C_SpawnGeometryCollectionOfSurroundingDestructibles::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_Props_C_SpawnGeometryCollectionOfSurroundingDestructibles, CallFunc_BreakHitResult_bBlockingHit) == 0x0001B9, "Member 'BP_EnviroDestructible_Props_C_SpawnGeometryCollectionOfSurroundingDestructibles::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
