#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_EnviroDestructible

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "FPromptParams_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_EnviroDestructible.BP_EnviroDestructible_C.CanInteractWithMount
// 0x0001 (0x0001 - 0x0000)
struct BP_EnviroDestructible_C_CanInteractWithMount final
{
public:
	bool                                          CanInteract;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EnviroDestructible_C_CanInteractWithMount) == 0x000001, "Wrong alignment on BP_EnviroDestructible_C_CanInteractWithMount");
static_assert(sizeof(BP_EnviroDestructible_C_CanInteractWithMount) == 0x000001, "Wrong size on BP_EnviroDestructible_C_CanInteractWithMount");
static_assert(offsetof(BP_EnviroDestructible_C_CanInteractWithMount, CanInteract) == 0x000000, "Member 'BP_EnviroDestructible_C_CanInteractWithMount::CanInteract' has a wrong offset!");

// Function BP_EnviroDestructible.BP_EnviroDestructible_C.ExecuteUbergraph_BP_EnviroDestructible
// 0x0128 (0x0128 - 0x0000)
struct BP_EnviroDestructible_C_ExecuteUbergraph_BP_EnviroDestructible final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_jRPG_Character_World_C*             K2Node_Event_PlayerCharacterWorld;                 // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_HitLocation;                          // 0x0010(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDisabled;                           // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class AActor*                           Temp_object_Variable;                              // 0x0030(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_jRPG_Character_World_C*             K2Node_Event_InteractingWorldCharacter;            // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_Instant;                              // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_InteractionState;                     // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_BattleState;                          // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_43[0x5];                                       // 0x0043(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_jRPG_GI_Custom_C*                   K2Node_DynamicCast_AsBP_J_RPG_GI_Custom;           // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_Value;                           // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B[0x5];                                       // 0x005B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_jRPG_Character_World_C*             K2Node_DynamicCast_AsBP_J_RPG_Character_World;     // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_72[0x6];                                       // 0x0072(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_1;            // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_jRPG_GI_Custom_C*                   K2Node_DynamicCast_AsBP_J_RPG_GI_Custom_1;         // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_ObjectToText_ReturnValue;            // 0x0090(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x00A0(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00E8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00F8(0x0010)()
	class ABP_jRPG_Character_World_C*             K2Node_Event_PlayerCharacter;                      // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_ImpactPoint;                          // 0x0110(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EnviroDestructible_C_ExecuteUbergraph_BP_EnviroDestructible) == 0x000008, "Wrong alignment on BP_EnviroDestructible_C_ExecuteUbergraph_BP_EnviroDestructible");
static_assert(sizeof(BP_EnviroDestructible_C_ExecuteUbergraph_BP_EnviroDestructible) == 0x000128, "Wrong size on BP_EnviroDestructible_C_ExecuteUbergraph_BP_EnviroDestructible");
static_assert(offsetof(BP_EnviroDestructible_C_ExecuteUbergraph_BP_EnviroDestructible, EntryPoint) == 0x000000, "Member 'BP_EnviroDestructible_C_ExecuteUbergraph_BP_EnviroDestructible::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_C_ExecuteUbergraph_BP_EnviroDestructible, K2Node_Event_PlayerCharacterWorld) == 0x000008, "Member 'BP_EnviroDestructible_C_ExecuteUbergraph_BP_EnviroDestructible::K2Node_Event_PlayerCharacterWorld' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_C_ExecuteUbergraph_BP_EnviroDestructible, K2Node_Event_HitLocation) == 0x000010, "Member 'BP_EnviroDestructible_C_ExecuteUbergraph_BP_EnviroDestructible::K2Node_Event_HitLocation' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_C_ExecuteUbergraph_BP_EnviroDestructible, K2Node_Event_IsDisabled) == 0x000028, "Member 'BP_EnviroDestructible_C_ExecuteUbergraph_BP_EnviroDestructible::K2Node_Event_IsDisabled' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_C_ExecuteUbergraph_BP_EnviroDestructible, Temp_object_Variable) == 0x000030, "Member 'BP_EnviroDestructible_C_ExecuteUbergraph_BP_EnviroDestructible::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_C_ExecuteUbergraph_BP_EnviroDestructible, K2Node_Event_InteractingWorldCharacter) == 0x000038, "Member 'BP_EnviroDestructible_C_ExecuteUbergraph_BP_EnviroDestructible::K2Node_Event_InteractingWorldCharacter' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_C_ExecuteUbergraph_BP_EnviroDestructible, K2Node_Event_Instant) == 0x000040, "Member 'BP_EnviroDestructible_C_ExecuteUbergraph_BP_EnviroDestructible::K2Node_Event_Instant' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_C_ExecuteUbergraph_BP_EnviroDestructible, K2Node_Event_InteractionState) == 0x000041, "Member 'BP_EnviroDestructible_C_ExecuteUbergraph_BP_EnviroDestructible::K2Node_Event_InteractionState' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_C_ExecuteUbergraph_BP_EnviroDestructible, K2Node_Event_BattleState) == 0x000042, "Member 'BP_EnviroDestructible_C_ExecuteUbergraph_BP_EnviroDestructible::K2Node_Event_BattleState' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_C_ExecuteUbergraph_BP_EnviroDestructible, CallFunc_GetGameInstance_ReturnValue) == 0x000048, "Member 'BP_EnviroDestructible_C_ExecuteUbergraph_BP_EnviroDestructible::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_C_ExecuteUbergraph_BP_EnviroDestructible, K2Node_DynamicCast_AsBP_J_RPG_GI_Custom) == 0x000050, "Member 'BP_EnviroDestructible_C_ExecuteUbergraph_BP_EnviroDestructible::K2Node_DynamicCast_AsBP_J_RPG_GI_Custom' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_C_ExecuteUbergraph_BP_EnviroDestructible, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'BP_EnviroDestructible_C_ExecuteUbergraph_BP_EnviroDestructible::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_C_ExecuteUbergraph_BP_EnviroDestructible, CallFunc_Map_Find_Value) == 0x000059, "Member 'BP_EnviroDestructible_C_ExecuteUbergraph_BP_EnviroDestructible::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_C_ExecuteUbergraph_BP_EnviroDestructible, CallFunc_Map_Find_ReturnValue) == 0x00005A, "Member 'BP_EnviroDestructible_C_ExecuteUbergraph_BP_EnviroDestructible::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_C_ExecuteUbergraph_BP_EnviroDestructible, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000060, "Member 'BP_EnviroDestructible_C_ExecuteUbergraph_BP_EnviroDestructible::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_C_ExecuteUbergraph_BP_EnviroDestructible, K2Node_DynamicCast_AsBP_J_RPG_Character_World) == 0x000068, "Member 'BP_EnviroDestructible_C_ExecuteUbergraph_BP_EnviroDestructible::K2Node_DynamicCast_AsBP_J_RPG_Character_World' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_C_ExecuteUbergraph_BP_EnviroDestructible, K2Node_DynamicCast_bSuccess_1) == 0x000070, "Member 'BP_EnviroDestructible_C_ExecuteUbergraph_BP_EnviroDestructible::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_C_ExecuteUbergraph_BP_EnviroDestructible, CallFunc_NotEqual_NameName_ReturnValue) == 0x000071, "Member 'BP_EnviroDestructible_C_ExecuteUbergraph_BP_EnviroDestructible::CallFunc_NotEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_C_ExecuteUbergraph_BP_EnviroDestructible, CallFunc_GetGameInstance_ReturnValue_1) == 0x000078, "Member 'BP_EnviroDestructible_C_ExecuteUbergraph_BP_EnviroDestructible::CallFunc_GetGameInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_C_ExecuteUbergraph_BP_EnviroDestructible, K2Node_DynamicCast_AsBP_J_RPG_GI_Custom_1) == 0x000080, "Member 'BP_EnviroDestructible_C_ExecuteUbergraph_BP_EnviroDestructible::K2Node_DynamicCast_AsBP_J_RPG_GI_Custom_1' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_C_ExecuteUbergraph_BP_EnviroDestructible, K2Node_DynamicCast_bSuccess_2) == 0x000088, "Member 'BP_EnviroDestructible_C_ExecuteUbergraph_BP_EnviroDestructible::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_C_ExecuteUbergraph_BP_EnviroDestructible, CallFunc_Conv_ObjectToText_ReturnValue) == 0x000090, "Member 'BP_EnviroDestructible_C_ExecuteUbergraph_BP_EnviroDestructible::CallFunc_Conv_ObjectToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_C_ExecuteUbergraph_BP_EnviroDestructible, K2Node_MakeStruct_FormatArgumentData) == 0x0000A0, "Member 'BP_EnviroDestructible_C_ExecuteUbergraph_BP_EnviroDestructible::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_C_ExecuteUbergraph_BP_EnviroDestructible, K2Node_MakeArray_Array) == 0x0000E8, "Member 'BP_EnviroDestructible_C_ExecuteUbergraph_BP_EnviroDestructible::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_C_ExecuteUbergraph_BP_EnviroDestructible, CallFunc_Format_ReturnValue) == 0x0000F8, "Member 'BP_EnviroDestructible_C_ExecuteUbergraph_BP_EnviroDestructible::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_C_ExecuteUbergraph_BP_EnviroDestructible, K2Node_Event_PlayerCharacter) == 0x000108, "Member 'BP_EnviroDestructible_C_ExecuteUbergraph_BP_EnviroDestructible::K2Node_Event_PlayerCharacter' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_C_ExecuteUbergraph_BP_EnviroDestructible, K2Node_Event_ImpactPoint) == 0x000110, "Member 'BP_EnviroDestructible_C_ExecuteUbergraph_BP_EnviroDestructible::K2Node_Event_ImpactPoint' has a wrong offset!");

// Function BP_EnviroDestructible.BP_EnviroDestructible_C.ExplorationAttacked
// 0x0020 (0x0020 - 0x0000)
struct BP_EnviroDestructible_C_ExplorationAttacked final
{
public:
	class ABP_jRPG_Character_World_C*             PlayerCharacter;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ImpactPoint;                                       // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EnviroDestructible_C_ExplorationAttacked) == 0x000008, "Wrong alignment on BP_EnviroDestructible_C_ExplorationAttacked");
static_assert(sizeof(BP_EnviroDestructible_C_ExplorationAttacked) == 0x000020, "Wrong size on BP_EnviroDestructible_C_ExplorationAttacked");
static_assert(offsetof(BP_EnviroDestructible_C_ExplorationAttacked, PlayerCharacter) == 0x000000, "Member 'BP_EnviroDestructible_C_ExplorationAttacked::PlayerCharacter' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_C_ExplorationAttacked, ImpactPoint) == 0x000008, "Member 'BP_EnviroDestructible_C_ExplorationAttacked::ImpactPoint' has a wrong offset!");

// Function BP_EnviroDestructible.BP_EnviroDestructible_C.FindDuplicateID_Chest
// 0x0068 (0x0068 - 0x0000)
struct BP_EnviroDestructible_C_FindDuplicateID_Chest final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_EnviroDestructible_C*>       CallFunc_GetAllActorsOfClass_OutActors;            // 0x0020(0x0010)(ReferenceParm)
	class ABP_EnviroDestructible_C*               CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x003E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x003F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_Chest_Regular_C*>            CallFunc_GetAllActorsOfClass_OutActors_1;          // 0x0040(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Chest_Regular_C*                    CallFunc_Array_Get_Item_1;                         // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_1;        // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EnviroDestructible_C_FindDuplicateID_Chest) == 0x000008, "Wrong alignment on BP_EnviroDestructible_C_FindDuplicateID_Chest");
static_assert(sizeof(BP_EnviroDestructible_C_FindDuplicateID_Chest) == 0x000068, "Wrong size on BP_EnviroDestructible_C_FindDuplicateID_Chest");
static_assert(offsetof(BP_EnviroDestructible_C_FindDuplicateID_Chest, ReturnValue) == 0x000000, "Member 'BP_EnviroDestructible_C_FindDuplicateID_Chest::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_C_FindDuplicateID_Chest, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_EnviroDestructible_C_FindDuplicateID_Chest::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_C_FindDuplicateID_Chest, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_EnviroDestructible_C_FindDuplicateID_Chest::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_C_FindDuplicateID_Chest, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'BP_EnviroDestructible_C_FindDuplicateID_Chest::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_C_FindDuplicateID_Chest, Temp_int_Array_Index_Variable_1) == 0x000010, "Member 'BP_EnviroDestructible_C_FindDuplicateID_Chest::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_C_FindDuplicateID_Chest, Temp_int_Loop_Counter_Variable_1) == 0x000014, "Member 'BP_EnviroDestructible_C_FindDuplicateID_Chest::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_C_FindDuplicateID_Chest, CallFunc_Add_IntInt_ReturnValue_1) == 0x000018, "Member 'BP_EnviroDestructible_C_FindDuplicateID_Chest::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_C_FindDuplicateID_Chest, CallFunc_GetAllActorsOfClass_OutActors) == 0x000020, "Member 'BP_EnviroDestructible_C_FindDuplicateID_Chest::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_C_FindDuplicateID_Chest, CallFunc_Array_Get_Item) == 0x000030, "Member 'BP_EnviroDestructible_C_FindDuplicateID_Chest::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_C_FindDuplicateID_Chest, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'BP_EnviroDestructible_C_FindDuplicateID_Chest::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_C_FindDuplicateID_Chest, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x00003C, "Member 'BP_EnviroDestructible_C_FindDuplicateID_Chest::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_C_FindDuplicateID_Chest, CallFunc_Less_IntInt_ReturnValue) == 0x00003D, "Member 'BP_EnviroDestructible_C_FindDuplicateID_Chest::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_C_FindDuplicateID_Chest, CallFunc_EqualEqual_NameName_ReturnValue) == 0x00003E, "Member 'BP_EnviroDestructible_C_FindDuplicateID_Chest::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_C_FindDuplicateID_Chest, CallFunc_BooleanAND_ReturnValue) == 0x00003F, "Member 'BP_EnviroDestructible_C_FindDuplicateID_Chest::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_C_FindDuplicateID_Chest, CallFunc_GetAllActorsOfClass_OutActors_1) == 0x000040, "Member 'BP_EnviroDestructible_C_FindDuplicateID_Chest::CallFunc_GetAllActorsOfClass_OutActors_1' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_C_FindDuplicateID_Chest, CallFunc_Array_Length_ReturnValue_1) == 0x000050, "Member 'BP_EnviroDestructible_C_FindDuplicateID_Chest::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_C_FindDuplicateID_Chest, CallFunc_Array_Get_Item_1) == 0x000058, "Member 'BP_EnviroDestructible_C_FindDuplicateID_Chest::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_C_FindDuplicateID_Chest, CallFunc_Less_IntInt_ReturnValue_1) == 0x000060, "Member 'BP_EnviroDestructible_C_FindDuplicateID_Chest::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_C_FindDuplicateID_Chest, CallFunc_EqualEqual_NameName_ReturnValue_1) == 0x000061, "Member 'BP_EnviroDestructible_C_FindDuplicateID_Chest::CallFunc_EqualEqual_NameName_ReturnValue_1' has a wrong offset!");

// Function BP_EnviroDestructible.BP_EnviroDestructible_C.FindDuplicateID_Destructible
// 0x0038 (0x0038 - 0x0000)
struct BP_EnviroDestructible_C_FindDuplicateID_Destructible final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_EnviroDestructible_C*>       CallFunc_GetAllActorsOfClass_OutActors;            // 0x0010(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_EnviroDestructible_C*               CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EnviroDestructible_C_FindDuplicateID_Destructible) == 0x000008, "Wrong alignment on BP_EnviroDestructible_C_FindDuplicateID_Destructible");
static_assert(sizeof(BP_EnviroDestructible_C_FindDuplicateID_Destructible) == 0x000038, "Wrong size on BP_EnviroDestructible_C_FindDuplicateID_Destructible");
static_assert(offsetof(BP_EnviroDestructible_C_FindDuplicateID_Destructible, ReturnValue) == 0x000000, "Member 'BP_EnviroDestructible_C_FindDuplicateID_Destructible::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_C_FindDuplicateID_Destructible, Temp_int_Array_Index_Variable) == 0x000004, "Member 'BP_EnviroDestructible_C_FindDuplicateID_Destructible::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_C_FindDuplicateID_Destructible, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'BP_EnviroDestructible_C_FindDuplicateID_Destructible::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_C_FindDuplicateID_Destructible, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'BP_EnviroDestructible_C_FindDuplicateID_Destructible::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_C_FindDuplicateID_Destructible, CallFunc_GetAllActorsOfClass_OutActors) == 0x000010, "Member 'BP_EnviroDestructible_C_FindDuplicateID_Destructible::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_C_FindDuplicateID_Destructible, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'BP_EnviroDestructible_C_FindDuplicateID_Destructible::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_C_FindDuplicateID_Destructible, CallFunc_Array_Get_Item) == 0x000028, "Member 'BP_EnviroDestructible_C_FindDuplicateID_Destructible::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_C_FindDuplicateID_Destructible, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'BP_EnviroDestructible_C_FindDuplicateID_Destructible::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_C_FindDuplicateID_Destructible, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000031, "Member 'BP_EnviroDestructible_C_FindDuplicateID_Destructible::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_C_FindDuplicateID_Destructible, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000032, "Member 'BP_EnviroDestructible_C_FindDuplicateID_Destructible::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_C_FindDuplicateID_Destructible, CallFunc_BooleanAND_ReturnValue) == 0x000033, "Member 'BP_EnviroDestructible_C_FindDuplicateID_Destructible::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BP_EnviroDestructible.BP_EnviroDestructible_C.FreeAimHit
// 0x0028 (0x0028 - 0x0000)
struct BP_EnviroDestructible_C_FreeAimHit final
{
public:
	class ABP_jRPG_Character_World_C*             PlayerCharacterWorld;                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HitLocation;                                       // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsDisabled;                                        // 0x0020(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EnviroDestructible_C_FreeAimHit) == 0x000008, "Wrong alignment on BP_EnviroDestructible_C_FreeAimHit");
static_assert(sizeof(BP_EnviroDestructible_C_FreeAimHit) == 0x000028, "Wrong size on BP_EnviroDestructible_C_FreeAimHit");
static_assert(offsetof(BP_EnviroDestructible_C_FreeAimHit, PlayerCharacterWorld) == 0x000000, "Member 'BP_EnviroDestructible_C_FreeAimHit::PlayerCharacterWorld' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_C_FreeAimHit, HitLocation) == 0x000008, "Member 'BP_EnviroDestructible_C_FreeAimHit::HitLocation' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_C_FreeAimHit, IsDisabled) == 0x000020, "Member 'BP_EnviroDestructible_C_FreeAimHit::IsDisabled' has a wrong offset!");

// Function BP_EnviroDestructible.BP_EnviroDestructible_C.GetInteractionPromptParams
// 0x0018 (0x0018 - 0x0000)
struct BP_EnviroDestructible_C_GetInteractionPromptParams final
{
public:
	struct FFPromptParams                         PromptParams;                                      // 0x0000(0x0018)(Parm, OutParm, HasGetValueTypeHash)
};
static_assert(alignof(BP_EnviroDestructible_C_GetInteractionPromptParams) == 0x000008, "Wrong alignment on BP_EnviroDestructible_C_GetInteractionPromptParams");
static_assert(sizeof(BP_EnviroDestructible_C_GetInteractionPromptParams) == 0x000018, "Wrong size on BP_EnviroDestructible_C_GetInteractionPromptParams");
static_assert(offsetof(BP_EnviroDestructible_C_GetInteractionPromptParams, PromptParams) == 0x000000, "Member 'BP_EnviroDestructible_C_GetInteractionPromptParams::PromptParams' has a wrong offset!");

// Function BP_EnviroDestructible.BP_EnviroDestructible_C.GetInteractionState
// 0x0020 (0x0020 - 0x0000)
struct BP_EnviroDestructible_C_GetInteractionState final
{
public:
	bool                                          InteractionState;                                  // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_jRPG_GI_Custom_C*                   K2Node_DynamicCast_AsBP_J_RPG_GI_Custom;           // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_Value;                           // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EnviroDestructible_C_GetInteractionState) == 0x000008, "Wrong alignment on BP_EnviroDestructible_C_GetInteractionState");
static_assert(sizeof(BP_EnviroDestructible_C_GetInteractionState) == 0x000020, "Wrong size on BP_EnviroDestructible_C_GetInteractionState");
static_assert(offsetof(BP_EnviroDestructible_C_GetInteractionState, InteractionState) == 0x000000, "Member 'BP_EnviroDestructible_C_GetInteractionState::InteractionState' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_C_GetInteractionState, CallFunc_GetGameInstance_ReturnValue) == 0x000008, "Member 'BP_EnviroDestructible_C_GetInteractionState::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_C_GetInteractionState, K2Node_DynamicCast_AsBP_J_RPG_GI_Custom) == 0x000010, "Member 'BP_EnviroDestructible_C_GetInteractionState::K2Node_DynamicCast_AsBP_J_RPG_GI_Custom' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_C_GetInteractionState, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_EnviroDestructible_C_GetInteractionState::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_C_GetInteractionState, CallFunc_Map_Find_Value) == 0x000019, "Member 'BP_EnviroDestructible_C_GetInteractionState::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_C_GetInteractionState, CallFunc_Map_Find_ReturnValue) == 0x00001A, "Member 'BP_EnviroDestructible_C_GetInteractionState::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_C_GetInteractionState, CallFunc_BooleanAND_ReturnValue) == 0x00001B, "Member 'BP_EnviroDestructible_C_GetInteractionState::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BP_EnviroDestructible.BP_EnviroDestructible_C.IsFreeAimTargetDisabled
// 0x0001 (0x0001 - 0x0000)
struct BP_EnviroDestructible_C_IsFreeAimTargetDisabled final
{
public:
	bool                                          IsDisabled;                                        // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EnviroDestructible_C_IsFreeAimTargetDisabled) == 0x000001, "Wrong alignment on BP_EnviroDestructible_C_IsFreeAimTargetDisabled");
static_assert(sizeof(BP_EnviroDestructible_C_IsFreeAimTargetDisabled) == 0x000001, "Wrong size on BP_EnviroDestructible_C_IsFreeAimTargetDisabled");
static_assert(offsetof(BP_EnviroDestructible_C_IsFreeAimTargetDisabled, IsDisabled) == 0x000000, "Member 'BP_EnviroDestructible_C_IsFreeAimTargetDisabled::IsDisabled' has a wrong offset!");

// Function BP_EnviroDestructible.BP_EnviroDestructible_C.IsInteractionAvailable
// 0x0001 (0x0001 - 0x0000)
struct BP_EnviroDestructible_C_IsInteractionAvailable final
{
public:
	bool                                          Available;                                         // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EnviroDestructible_C_IsInteractionAvailable) == 0x000001, "Wrong alignment on BP_EnviroDestructible_C_IsInteractionAvailable");
static_assert(sizeof(BP_EnviroDestructible_C_IsInteractionAvailable) == 0x000001, "Wrong size on BP_EnviroDestructible_C_IsInteractionAvailable");
static_assert(offsetof(BP_EnviroDestructible_C_IsInteractionAvailable, Available) == 0x000000, "Member 'BP_EnviroDestructible_C_IsInteractionAvailable::Available' has a wrong offset!");

// Function BP_EnviroDestructible.BP_EnviroDestructible_C.IsInteractionDone
// 0x0001 (0x0001 - 0x0000)
struct BP_EnviroDestructible_C_IsInteractionDone final
{
public:
	bool                                          Done;                                              // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EnviroDestructible_C_IsInteractionDone) == 0x000001, "Wrong alignment on BP_EnviroDestructible_C_IsInteractionDone");
static_assert(sizeof(BP_EnviroDestructible_C_IsInteractionDone) == 0x000001, "Wrong size on BP_EnviroDestructible_C_IsInteractionDone");
static_assert(offsetof(BP_EnviroDestructible_C_IsInteractionDone, Done) == 0x000000, "Member 'BP_EnviroDestructible_C_IsInteractionDone::Done' has a wrong offset!");

// Function BP_EnviroDestructible.BP_EnviroDestructible_C.OnEnemyBattleStateLoaded
// 0x0001 (0x0001 - 0x0000)
struct BP_EnviroDestructible_C_OnEnemyBattleStateLoaded final
{
public:
	bool                                          BattleState;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EnviroDestructible_C_OnEnemyBattleStateLoaded) == 0x000001, "Wrong alignment on BP_EnviroDestructible_C_OnEnemyBattleStateLoaded");
static_assert(sizeof(BP_EnviroDestructible_C_OnEnemyBattleStateLoaded) == 0x000001, "Wrong size on BP_EnviroDestructible_C_OnEnemyBattleStateLoaded");
static_assert(offsetof(BP_EnviroDestructible_C_OnEnemyBattleStateLoaded, BattleState) == 0x000000, "Member 'BP_EnviroDestructible_C_OnEnemyBattleStateLoaded::BattleState' has a wrong offset!");

// Function BP_EnviroDestructible.BP_EnviroDestructible_C.OnInteractionRequested
// 0x0010 (0x0010 - 0x0000)
struct BP_EnviroDestructible_C_OnInteractionRequested final
{
public:
	class ABP_jRPG_Character_World_C*             InteractingWorldCharacter;                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Instant;                                           // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EnviroDestructible_C_OnInteractionRequested) == 0x000008, "Wrong alignment on BP_EnviroDestructible_C_OnInteractionRequested");
static_assert(sizeof(BP_EnviroDestructible_C_OnInteractionRequested) == 0x000010, "Wrong size on BP_EnviroDestructible_C_OnInteractionRequested");
static_assert(offsetof(BP_EnviroDestructible_C_OnInteractionRequested, InteractingWorldCharacter) == 0x000000, "Member 'BP_EnviroDestructible_C_OnInteractionRequested::InteractingWorldCharacter' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_C_OnInteractionRequested, Instant) == 0x000008, "Member 'BP_EnviroDestructible_C_OnInteractionRequested::Instant' has a wrong offset!");

// Function BP_EnviroDestructible.BP_EnviroDestructible_C.OnObjectInteractionStateLoaded
// 0x0001 (0x0001 - 0x0000)
struct BP_EnviroDestructible_C_OnObjectInteractionStateLoaded final
{
public:
	bool                                          InteractionState;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EnviroDestructible_C_OnObjectInteractionStateLoaded) == 0x000001, "Wrong alignment on BP_EnviroDestructible_C_OnObjectInteractionStateLoaded");
static_assert(sizeof(BP_EnviroDestructible_C_OnObjectInteractionStateLoaded) == 0x000001, "Wrong size on BP_EnviroDestructible_C_OnObjectInteractionStateLoaded");
static_assert(offsetof(BP_EnviroDestructible_C_OnObjectInteractionStateLoaded, InteractionState) == 0x000000, "Member 'BP_EnviroDestructible_C_OnObjectInteractionStateLoaded::InteractionState' has a wrong offset!");

// Function BP_EnviroDestructible.BP_EnviroDestructible_C.SetInteractionState
// 0x0020 (0x0020 - 0x0000)
struct BP_EnviroDestructible_C_SetInteractionState final
{
public:
	bool                                          Value;                                             // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_jRPG_GI_Custom_C*                   K2Node_DynamicCast_AsBP_J_RPG_GI_Custom;           // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EnviroDestructible_C_SetInteractionState) == 0x000008, "Wrong alignment on BP_EnviroDestructible_C_SetInteractionState");
static_assert(sizeof(BP_EnviroDestructible_C_SetInteractionState) == 0x000020, "Wrong size on BP_EnviroDestructible_C_SetInteractionState");
static_assert(offsetof(BP_EnviroDestructible_C_SetInteractionState, Value) == 0x000000, "Member 'BP_EnviroDestructible_C_SetInteractionState::Value' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_C_SetInteractionState, CallFunc_GetGameInstance_ReturnValue) == 0x000008, "Member 'BP_EnviroDestructible_C_SetInteractionState::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_C_SetInteractionState, K2Node_DynamicCast_AsBP_J_RPG_GI_Custom) == 0x000010, "Member 'BP_EnviroDestructible_C_SetInteractionState::K2Node_DynamicCast_AsBP_J_RPG_GI_Custom' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_C_SetInteractionState, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_EnviroDestructible_C_SetInteractionState::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BP_EnviroDestructible.BP_EnviroDestructible_C.ShouldHideDistantInteraction
// 0x0001 (0x0001 - 0x0000)
struct BP_EnviroDestructible_C_ShouldHideDistantInteraction final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EnviroDestructible_C_ShouldHideDistantInteraction) == 0x000001, "Wrong alignment on BP_EnviroDestructible_C_ShouldHideDistantInteraction");
static_assert(sizeof(BP_EnviroDestructible_C_ShouldHideDistantInteraction) == 0x000001, "Wrong size on BP_EnviroDestructible_C_ShouldHideDistantInteraction");
static_assert(offsetof(BP_EnviroDestructible_C_ShouldHideDistantInteraction, ReturnValue) == 0x000000, "Member 'BP_EnviroDestructible_C_ShouldHideDistantInteraction::ReturnValue' has a wrong offset!");

// Function BP_EnviroDestructible.BP_EnviroDestructible_C.UserConstructionScript
// 0x0088 (0x0088 - 0x0000)
struct BP_EnviroDestructible_C_UserConstructionScript final
{
public:
	bool                                          CallFunc_IsPackagedBuild_ReturnValue;              // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FindDuplicateID_Chest_ReturnValue;        // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPackagedBuild_ReturnValue_1;            // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGuid                                  CallFunc_NewGuid_ReturnValue;                      // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FindDuplicateID_Destructible_ReturnValue; // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_GuidToString_ReturnValue;            // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_1;        // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0044(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGuid                                  CallFunc_NewGuid_ReturnValue_1;                    // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_GuidToString_ReturnValue_1;          // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_1;          // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EnviroDestructible_C_UserConstructionScript) == 0x000008, "Wrong alignment on BP_EnviroDestructible_C_UserConstructionScript");
static_assert(sizeof(BP_EnviroDestructible_C_UserConstructionScript) == 0x000088, "Wrong size on BP_EnviroDestructible_C_UserConstructionScript");
static_assert(offsetof(BP_EnviroDestructible_C_UserConstructionScript, CallFunc_IsPackagedBuild_ReturnValue) == 0x000000, "Member 'BP_EnviroDestructible_C_UserConstructionScript::CallFunc_IsPackagedBuild_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_C_UserConstructionScript, CallFunc_FindDuplicateID_Chest_ReturnValue) == 0x000001, "Member 'BP_EnviroDestructible_C_UserConstructionScript::CallFunc_FindDuplicateID_Chest_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_C_UserConstructionScript, CallFunc_IsPackagedBuild_ReturnValue_1) == 0x000002, "Member 'BP_EnviroDestructible_C_UserConstructionScript::CallFunc_IsPackagedBuild_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_C_UserConstructionScript, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000003, "Member 'BP_EnviroDestructible_C_UserConstructionScript::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_C_UserConstructionScript, CallFunc_BooleanOR_ReturnValue) == 0x000004, "Member 'BP_EnviroDestructible_C_UserConstructionScript::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_C_UserConstructionScript, CallFunc_NewGuid_ReturnValue) == 0x000008, "Member 'BP_EnviroDestructible_C_UserConstructionScript::CallFunc_NewGuid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_C_UserConstructionScript, CallFunc_FindDuplicateID_Destructible_ReturnValue) == 0x000018, "Member 'BP_EnviroDestructible_C_UserConstructionScript::CallFunc_FindDuplicateID_Destructible_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_C_UserConstructionScript, CallFunc_Conv_GuidToString_ReturnValue) == 0x000020, "Member 'BP_EnviroDestructible_C_UserConstructionScript::CallFunc_Conv_GuidToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_C_UserConstructionScript, CallFunc_Concat_StrStr_ReturnValue) == 0x000030, "Member 'BP_EnviroDestructible_C_UserConstructionScript::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_C_UserConstructionScript, CallFunc_EqualEqual_NameName_ReturnValue_1) == 0x000040, "Member 'BP_EnviroDestructible_C_UserConstructionScript::CallFunc_EqualEqual_NameName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_C_UserConstructionScript, CallFunc_Conv_StringToName_ReturnValue) == 0x000044, "Member 'BP_EnviroDestructible_C_UserConstructionScript::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_C_UserConstructionScript, CallFunc_BooleanOR_ReturnValue_1) == 0x00004C, "Member 'BP_EnviroDestructible_C_UserConstructionScript::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_C_UserConstructionScript, CallFunc_NewGuid_ReturnValue_1) == 0x000050, "Member 'BP_EnviroDestructible_C_UserConstructionScript::CallFunc_NewGuid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_C_UserConstructionScript, CallFunc_Conv_GuidToString_ReturnValue_1) == 0x000060, "Member 'BP_EnviroDestructible_C_UserConstructionScript::CallFunc_Conv_GuidToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_C_UserConstructionScript, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000070, "Member 'BP_EnviroDestructible_C_UserConstructionScript::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EnviroDestructible_C_UserConstructionScript, CallFunc_Conv_StringToName_ReturnValue_1) == 0x000080, "Member 'BP_EnviroDestructible_C_UserConstructionScript::CallFunc_Conv_StringToName_ReturnValue_1' has a wrong offset!");

// Function BP_EnviroDestructible.BP_EnviroDestructible_C.GetInteractionFeedbackLocation
// 0x0018 (0x0018 - 0x0000)
struct BP_EnviroDestructible_C_GetInteractionFeedbackLocation final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EnviroDestructible_C_GetInteractionFeedbackLocation) == 0x000008, "Wrong alignment on BP_EnviroDestructible_C_GetInteractionFeedbackLocation");
static_assert(sizeof(BP_EnviroDestructible_C_GetInteractionFeedbackLocation) == 0x000018, "Wrong size on BP_EnviroDestructible_C_GetInteractionFeedbackLocation");
static_assert(offsetof(BP_EnviroDestructible_C_GetInteractionFeedbackLocation, Location) == 0x000000, "Member 'BP_EnviroDestructible_C_GetInteractionFeedbackLocation::Location' has a wrong offset!");

// Function BP_EnviroDestructible.BP_EnviroDestructible_C.GetInteractionLocation
// 0x0018 (0x0018 - 0x0000)
struct BP_EnviroDestructible_C_GetInteractionLocation final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EnviroDestructible_C_GetInteractionLocation) == 0x000008, "Wrong alignment on BP_EnviroDestructible_C_GetInteractionLocation");
static_assert(sizeof(BP_EnviroDestructible_C_GetInteractionLocation) == 0x000018, "Wrong size on BP_EnviroDestructible_C_GetInteractionLocation");
static_assert(offsetof(BP_EnviroDestructible_C_GetInteractionLocation, Location) == 0x000000, "Member 'BP_EnviroDestructible_C_GetInteractionLocation::Location' has a wrong offset!");

}

