#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_EnemyGroup

#include "Basic.hpp"

#include "SandFall_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_EnemyGroup.BP_EnemyGroup_C.CheckForErrors
// 0x00D8 (0x00D8 - 0x0000)
struct BP_EnemyGroup_C_CheckForErrors final
{
public:
	TArray<class FText>                           ErrorMessages;                                     // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInPlayMode_ReturnValue;                 // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0030(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0078(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0088(0x0010)()
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class ABP_jRPG_Enemy_World_Base_Seamless_C> CallFunc_Array_Get_Item;              // 0x00A8(0x0028)(HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EnemyGroup_C_CheckForErrors) == 0x000008, "Wrong alignment on BP_EnemyGroup_C_CheckForErrors");
static_assert(sizeof(BP_EnemyGroup_C_CheckForErrors) == 0x0000D8, "Wrong size on BP_EnemyGroup_C_CheckForErrors");
static_assert(offsetof(BP_EnemyGroup_C_CheckForErrors, ErrorMessages) == 0x000000, "Member 'BP_EnemyGroup_C_CheckForErrors::ErrorMessages' has a wrong offset!");
static_assert(offsetof(BP_EnemyGroup_C_CheckForErrors, ReturnValue) == 0x000010, "Member 'BP_EnemyGroup_C_CheckForErrors::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnemyGroup_C_CheckForErrors, Temp_int_Array_Index_Variable) == 0x000014, "Member 'BP_EnemyGroup_C_CheckForErrors::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_EnemyGroup_C_CheckForErrors, CallFunc_IsInPlayMode_ReturnValue) == 0x000018, "Member 'BP_EnemyGroup_C_CheckForErrors::CallFunc_IsInPlayMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnemyGroup_C_CheckForErrors, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000020, "Member 'BP_EnemyGroup_C_CheckForErrors::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnemyGroup_C_CheckForErrors, CallFunc_Not_PreBool_ReturnValue) == 0x000028, "Member 'BP_EnemyGroup_C_CheckForErrors::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnemyGroup_C_CheckForErrors, K2Node_MakeStruct_FormatArgumentData) == 0x000030, "Member 'BP_EnemyGroup_C_CheckForErrors::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_EnemyGroup_C_CheckForErrors, K2Node_MakeArray_Array) == 0x000078, "Member 'BP_EnemyGroup_C_CheckForErrors::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_EnemyGroup_C_CheckForErrors, CallFunc_Format_ReturnValue) == 0x000088, "Member 'BP_EnemyGroup_C_CheckForErrors::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnemyGroup_C_CheckForErrors, Temp_int_Loop_Counter_Variable) == 0x000098, "Member 'BP_EnemyGroup_C_CheckForErrors::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_EnemyGroup_C_CheckForErrors, CallFunc_Array_Add_ReturnValue) == 0x00009C, "Member 'BP_EnemyGroup_C_CheckForErrors::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnemyGroup_C_CheckForErrors, CallFunc_Add_IntInt_ReturnValue) == 0x0000A0, "Member 'BP_EnemyGroup_C_CheckForErrors::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnemyGroup_C_CheckForErrors, CallFunc_Array_Length_ReturnValue) == 0x0000A4, "Member 'BP_EnemyGroup_C_CheckForErrors::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnemyGroup_C_CheckForErrors, CallFunc_Array_Get_Item) == 0x0000A8, "Member 'BP_EnemyGroup_C_CheckForErrors::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_EnemyGroup_C_CheckForErrors, CallFunc_Less_IntInt_ReturnValue) == 0x0000D0, "Member 'BP_EnemyGroup_C_CheckForErrors::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnemyGroup_C_CheckForErrors, CallFunc_IsValidSoftObjectReference_ReturnValue) == 0x0000D1, "Member 'BP_EnemyGroup_C_CheckForErrors::CallFunc_IsValidSoftObjectReference_ReturnValue' has a wrong offset!");

// Function BP_EnemyGroup.BP_EnemyGroup_C.GetGlobalObjectID
// 0x0010 (0x0010 - 0x0000)
struct BP_EnemyGroup_C_GetGlobalObjectID final
{
public:
	class FName                                   ObjectId;                                          // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetGlobalObjectID_ObjectID;               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EnemyGroup_C_GetGlobalObjectID) == 0x000004, "Wrong alignment on BP_EnemyGroup_C_GetGlobalObjectID");
static_assert(sizeof(BP_EnemyGroup_C_GetGlobalObjectID) == 0x000010, "Wrong size on BP_EnemyGroup_C_GetGlobalObjectID");
static_assert(offsetof(BP_EnemyGroup_C_GetGlobalObjectID, ObjectId) == 0x000000, "Member 'BP_EnemyGroup_C_GetGlobalObjectID::ObjectId' has a wrong offset!");
static_assert(offsetof(BP_EnemyGroup_C_GetGlobalObjectID, CallFunc_GetGlobalObjectID_ObjectID) == 0x000008, "Member 'BP_EnemyGroup_C_GetGlobalObjectID::CallFunc_GetGlobalObjectID_ObjectID' has a wrong offset!");

// Function BP_EnemyGroup.BP_EnemyGroup_C.RefreshLinks
// 0x0070 (0x0070 - 0x0000)
struct BP_EnemyGroup_C_RefreshLinks final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_jRPG_Enemy_World_Base_Seamless_C*> CallFunc_GetAllActorsOfClass_OutActors;      // 0x0010(0x0010)(ReferenceParm)
	bool                                          CallFunc_IsPackagedBuild_ReturnValue;              // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_jRPG_Enemy_World_Base_Seamless_C*   CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class ABP_jRPG_Enemy_World_Base_Seamless_C> CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue; // 0x0038(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInPlayMode_ReturnValue;                 // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x006B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EnemyGroup_C_RefreshLinks) == 0x000008, "Wrong alignment on BP_EnemyGroup_C_RefreshLinks");
static_assert(sizeof(BP_EnemyGroup_C_RefreshLinks) == 0x000070, "Wrong size on BP_EnemyGroup_C_RefreshLinks");
static_assert(offsetof(BP_EnemyGroup_C_RefreshLinks, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BP_EnemyGroup_C_RefreshLinks::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_EnemyGroup_C_RefreshLinks, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_EnemyGroup_C_RefreshLinks::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_EnemyGroup_C_RefreshLinks, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_EnemyGroup_C_RefreshLinks::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnemyGroup_C_RefreshLinks, CallFunc_GetAllActorsOfClass_OutActors) == 0x000010, "Member 'BP_EnemyGroup_C_RefreshLinks::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(BP_EnemyGroup_C_RefreshLinks, CallFunc_IsPackagedBuild_ReturnValue) == 0x000020, "Member 'BP_EnemyGroup_C_RefreshLinks::CallFunc_IsPackagedBuild_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnemyGroup_C_RefreshLinks, CallFunc_Array_Get_Item) == 0x000028, "Member 'BP_EnemyGroup_C_RefreshLinks::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_EnemyGroup_C_RefreshLinks, CallFunc_Not_PreBool_ReturnValue) == 0x000030, "Member 'BP_EnemyGroup_C_RefreshLinks::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnemyGroup_C_RefreshLinks, CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue) == 0x000038, "Member 'BP_EnemyGroup_C_RefreshLinks::CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnemyGroup_C_RefreshLinks, CallFunc_Array_Contains_ReturnValue) == 0x000060, "Member 'BP_EnemyGroup_C_RefreshLinks::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnemyGroup_C_RefreshLinks, CallFunc_Array_Length_ReturnValue) == 0x000064, "Member 'BP_EnemyGroup_C_RefreshLinks::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnemyGroup_C_RefreshLinks, CallFunc_IsInPlayMode_ReturnValue) == 0x000068, "Member 'BP_EnemyGroup_C_RefreshLinks::CallFunc_IsInPlayMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnemyGroup_C_RefreshLinks, CallFunc_Less_IntInt_ReturnValue) == 0x000069, "Member 'BP_EnemyGroup_C_RefreshLinks::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnemyGroup_C_RefreshLinks, CallFunc_Not_PreBool_ReturnValue_1) == 0x00006A, "Member 'BP_EnemyGroup_C_RefreshLinks::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EnemyGroup_C_RefreshLinks, CallFunc_BooleanAND_ReturnValue) == 0x00006B, "Member 'BP_EnemyGroup_C_RefreshLinks::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BP_EnemyGroup.BP_EnemyGroup_C.UserConstructionScript
// 0x0001 (0x0001 - 0x0000)
struct BP_EnemyGroup_C_UserConstructionScript final
{
public:
	bool                                          CallFunc_IsPackagedBuild_ReturnValue;              // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EnemyGroup_C_UserConstructionScript) == 0x000001, "Wrong alignment on BP_EnemyGroup_C_UserConstructionScript");
static_assert(sizeof(BP_EnemyGroup_C_UserConstructionScript) == 0x000001, "Wrong size on BP_EnemyGroup_C_UserConstructionScript");
static_assert(offsetof(BP_EnemyGroup_C_UserConstructionScript, CallFunc_IsPackagedBuild_ReturnValue) == 0x000000, "Member 'BP_EnemyGroup_C_UserConstructionScript::CallFunc_IsPackagedBuild_ReturnValue' has a wrong offset!");

// Function BP_EnemyGroup.BP_EnemyGroup_C.Editor_DrawDebugShapes
// 0x0090 (0x0090 - 0x0000)
struct BP_EnemyGroup_C_Editor_DrawDebugShapes final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0010(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class ABP_jRPG_Enemy_World_Base_Seamless_C> CallFunc_Array_Get_Item;              // 0x0028(0x0028)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_jRPG_Enemy_World_Base_Seamless_C*   K2Node_DynamicCast_AsBP_J_RPG_Enemy_World_Base_Seamless; // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_72[0x6];                                       // 0x0072(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0078(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EnemyGroup_C_Editor_DrawDebugShapes) == 0x000008, "Wrong alignment on BP_EnemyGroup_C_Editor_DrawDebugShapes");
static_assert(sizeof(BP_EnemyGroup_C_Editor_DrawDebugShapes) == 0x000090, "Wrong size on BP_EnemyGroup_C_Editor_DrawDebugShapes");
static_assert(offsetof(BP_EnemyGroup_C_Editor_DrawDebugShapes, ReturnValue) == 0x000000, "Member 'BP_EnemyGroup_C_Editor_DrawDebugShapes::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnemyGroup_C_Editor_DrawDebugShapes, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_EnemyGroup_C_Editor_DrawDebugShapes::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_EnemyGroup_C_Editor_DrawDebugShapes, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_EnemyGroup_C_Editor_DrawDebugShapes::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnemyGroup_C_Editor_DrawDebugShapes, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'BP_EnemyGroup_C_Editor_DrawDebugShapes::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_EnemyGroup_C_Editor_DrawDebugShapes, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000010, "Member 'BP_EnemyGroup_C_Editor_DrawDebugShapes::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnemyGroup_C_Editor_DrawDebugShapes, CallFunc_Array_Get_Item) == 0x000028, "Member 'BP_EnemyGroup_C_Editor_DrawDebugShapes::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_EnemyGroup_C_Editor_DrawDebugShapes, CallFunc_Array_Length_ReturnValue) == 0x000050, "Member 'BP_EnemyGroup_C_Editor_DrawDebugShapes::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnemyGroup_C_Editor_DrawDebugShapes, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue) == 0x000058, "Member 'BP_EnemyGroup_C_Editor_DrawDebugShapes::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnemyGroup_C_Editor_DrawDebugShapes, CallFunc_Less_IntInt_ReturnValue) == 0x000060, "Member 'BP_EnemyGroup_C_Editor_DrawDebugShapes::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnemyGroup_C_Editor_DrawDebugShapes, K2Node_DynamicCast_AsBP_J_RPG_Enemy_World_Base_Seamless) == 0x000068, "Member 'BP_EnemyGroup_C_Editor_DrawDebugShapes::K2Node_DynamicCast_AsBP_J_RPG_Enemy_World_Base_Seamless' has a wrong offset!");
static_assert(offsetof(BP_EnemyGroup_C_Editor_DrawDebugShapes, K2Node_DynamicCast_bSuccess) == 0x000070, "Member 'BP_EnemyGroup_C_Editor_DrawDebugShapes::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_EnemyGroup_C_Editor_DrawDebugShapes, CallFunc_IsValid_ReturnValue) == 0x000071, "Member 'BP_EnemyGroup_C_Editor_DrawDebugShapes::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnemyGroup_C_Editor_DrawDebugShapes, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000078, "Member 'BP_EnemyGroup_C_Editor_DrawDebugShapes::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");

// Function BP_EnemyGroup.BP_EnemyGroup_C.Editor_GetDebugShapes
// 0x0028 (0x0028 - 0x0000)
struct BP_EnemyGroup_C_Editor_GetDebugShapes final
{
public:
	TArray<struct FEditorDebugShape_Arrow>        Arrows;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<struct FEditorDebugShape_Arrow>        Lines;                                             // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EnemyGroup_C_Editor_GetDebugShapes) == 0x000008, "Wrong alignment on BP_EnemyGroup_C_Editor_GetDebugShapes");
static_assert(sizeof(BP_EnemyGroup_C_Editor_GetDebugShapes) == 0x000028, "Wrong size on BP_EnemyGroup_C_Editor_GetDebugShapes");
static_assert(offsetof(BP_EnemyGroup_C_Editor_GetDebugShapes, Arrows) == 0x000000, "Member 'BP_EnemyGroup_C_Editor_GetDebugShapes::Arrows' has a wrong offset!");
static_assert(offsetof(BP_EnemyGroup_C_Editor_GetDebugShapes, Lines) == 0x000010, "Member 'BP_EnemyGroup_C_Editor_GetDebugShapes::Lines' has a wrong offset!");
static_assert(offsetof(BP_EnemyGroup_C_Editor_GetDebugShapes, ReturnValue) == 0x000020, "Member 'BP_EnemyGroup_C_Editor_GetDebugShapes::ReturnValue' has a wrong offset!");

}

