#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ExtendedDebugCameraController

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_ExtendedDebugCameraController.BP_ExtendedDebugCameraController_C.ExecuteUbergraph_BP_ExtendedDebugCameraController
// 0x0038 (0x0038 - 0x0000)
struct BP_ExtendedDebugCameraController_C_ExecuteUbergraph_BP_ExtendedDebugCameraController final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      K2Node_Event_OriginalPC;                           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      K2Node_Event_RestoredPC;                           // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_UINavigationComponent_C*            CallFunc_GetUINavigationComponent_ReturnValue;     // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ASpectatorPawn*                         CallFunc_GetSpectatorPawn_ReturnValue;             // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_UINavigationComponent_C*            CallFunc_GetUINavigationComponent_ReturnValue_1;   // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ExtendedDebugCameraController_C_ExecuteUbergraph_BP_ExtendedDebugCameraController) == 0x000008, "Wrong alignment on BP_ExtendedDebugCameraController_C_ExecuteUbergraph_BP_ExtendedDebugCameraController");
static_assert(sizeof(BP_ExtendedDebugCameraController_C_ExecuteUbergraph_BP_ExtendedDebugCameraController) == 0x000038, "Wrong size on BP_ExtendedDebugCameraController_C_ExecuteUbergraph_BP_ExtendedDebugCameraController");
static_assert(offsetof(BP_ExtendedDebugCameraController_C_ExecuteUbergraph_BP_ExtendedDebugCameraController, EntryPoint) == 0x000000, "Member 'BP_ExtendedDebugCameraController_C_ExecuteUbergraph_BP_ExtendedDebugCameraController::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ExtendedDebugCameraController_C_ExecuteUbergraph_BP_ExtendedDebugCameraController, K2Node_Event_OriginalPC) == 0x000008, "Member 'BP_ExtendedDebugCameraController_C_ExecuteUbergraph_BP_ExtendedDebugCameraController::K2Node_Event_OriginalPC' has a wrong offset!");
static_assert(offsetof(BP_ExtendedDebugCameraController_C_ExecuteUbergraph_BP_ExtendedDebugCameraController, K2Node_Event_RestoredPC) == 0x000010, "Member 'BP_ExtendedDebugCameraController_C_ExecuteUbergraph_BP_ExtendedDebugCameraController::K2Node_Event_RestoredPC' has a wrong offset!");
static_assert(offsetof(BP_ExtendedDebugCameraController_C_ExecuteUbergraph_BP_ExtendedDebugCameraController, CallFunc_GetUINavigationComponent_ReturnValue) == 0x000018, "Member 'BP_ExtendedDebugCameraController_C_ExecuteUbergraph_BP_ExtendedDebugCameraController::CallFunc_GetUINavigationComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ExtendedDebugCameraController_C_ExecuteUbergraph_BP_ExtendedDebugCameraController, K2Node_Event_DeltaSeconds) == 0x000020, "Member 'BP_ExtendedDebugCameraController_C_ExecuteUbergraph_BP_ExtendedDebugCameraController::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_ExtendedDebugCameraController_C_ExecuteUbergraph_BP_ExtendedDebugCameraController, CallFunc_GetSpectatorPawn_ReturnValue) == 0x000028, "Member 'BP_ExtendedDebugCameraController_C_ExecuteUbergraph_BP_ExtendedDebugCameraController::CallFunc_GetSpectatorPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ExtendedDebugCameraController_C_ExecuteUbergraph_BP_ExtendedDebugCameraController, CallFunc_GetUINavigationComponent_ReturnValue_1) == 0x000030, "Member 'BP_ExtendedDebugCameraController_C_ExecuteUbergraph_BP_ExtendedDebugCameraController::CallFunc_GetUINavigationComponent_ReturnValue_1' has a wrong offset!");

// Function BP_ExtendedDebugCameraController.BP_ExtendedDebugCameraController_C.ReceiveOnActivate
// 0x0008 (0x0008 - 0x0000)
struct BP_ExtendedDebugCameraController_C_ReceiveOnActivate final
{
public:
	class APlayerController*                      OriginalPC;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ExtendedDebugCameraController_C_ReceiveOnActivate) == 0x000008, "Wrong alignment on BP_ExtendedDebugCameraController_C_ReceiveOnActivate");
static_assert(sizeof(BP_ExtendedDebugCameraController_C_ReceiveOnActivate) == 0x000008, "Wrong size on BP_ExtendedDebugCameraController_C_ReceiveOnActivate");
static_assert(offsetof(BP_ExtendedDebugCameraController_C_ReceiveOnActivate, OriginalPC) == 0x000000, "Member 'BP_ExtendedDebugCameraController_C_ReceiveOnActivate::OriginalPC' has a wrong offset!");

// Function BP_ExtendedDebugCameraController.BP_ExtendedDebugCameraController_C.ReceiveOnDeactivate
// 0x0008 (0x0008 - 0x0000)
struct BP_ExtendedDebugCameraController_C_ReceiveOnDeactivate final
{
public:
	class APlayerController*                      RestoredPC;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ExtendedDebugCameraController_C_ReceiveOnDeactivate) == 0x000008, "Wrong alignment on BP_ExtendedDebugCameraController_C_ReceiveOnDeactivate");
static_assert(sizeof(BP_ExtendedDebugCameraController_C_ReceiveOnDeactivate) == 0x000008, "Wrong size on BP_ExtendedDebugCameraController_C_ReceiveOnDeactivate");
static_assert(offsetof(BP_ExtendedDebugCameraController_C_ReceiveOnDeactivate, RestoredPC) == 0x000000, "Member 'BP_ExtendedDebugCameraController_C_ReceiveOnDeactivate::RestoredPC' has a wrong offset!");

// Function BP_ExtendedDebugCameraController.BP_ExtendedDebugCameraController_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_ExtendedDebugCameraController_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ExtendedDebugCameraController_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_ExtendedDebugCameraController_C_ReceiveTick");
static_assert(sizeof(BP_ExtendedDebugCameraController_C_ReceiveTick) == 0x000004, "Wrong size on BP_ExtendedDebugCameraController_C_ReceiveTick");
static_assert(offsetof(BP_ExtendedDebugCameraController_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_ExtendedDebugCameraController_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

