#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_EnvironmentInteractorComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_EnvironmentInteractorComponent.BP_EnvironmentInteractorComponent_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_EnvironmentInteractorComponent_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EnvironmentInteractorComponent_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_EnvironmentInteractorComponent_C_ReceiveTick");
static_assert(sizeof(BP_EnvironmentInteractorComponent_C_ReceiveTick) == 0x000004, "Wrong size on BP_EnvironmentInteractorComponent_C_ReceiveTick");
static_assert(offsetof(BP_EnvironmentInteractorComponent_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_EnvironmentInteractorComponent_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_EnvironmentInteractorComponent.BP_EnvironmentInteractorComponent_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_EnvironmentInteractorComponent_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EnvironmentInteractorComponent_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_EnvironmentInteractorComponent_C_ReceiveEndPlay");
static_assert(sizeof(BP_EnvironmentInteractorComponent_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_EnvironmentInteractorComponent_C_ReceiveEndPlay");
static_assert(offsetof(BP_EnvironmentInteractorComponent_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_EnvironmentInteractorComponent_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function BP_EnvironmentInteractorComponent.BP_EnvironmentInteractorComponent_C.ExecuteUbergraph_BP_EnvironmentInteractorComponent
// 0x00C0 (0x00C0 - 0x0000)
struct BP_EnvironmentInteractorComponent_C_ExecuteUbergraph_BP_EnvironmentInteractorComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             K2Node_DynamicCast_AsCharacter;                    // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AALS_CharacterBP_C*                     K2Node_DynamicCast_AsALS_Character_BP;             // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_2;                    // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_InteractiveEnvironmentManagerComponent_C* CallFunc_GetComponentByClass_ReturnValue;    // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_InteractiveEnvironmentManagerComponent_C* CallFunc_GetComponentByClass_ReturnValue_1;  // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_3;      // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UBP_EnvironmentInteractorComponent_C* Temp_object_Variable;                          // 0x0098(0x0008)(ConstParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_4;      // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_5;      // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_InteractiveEnvironmentManagerComponent_C* Temp_wildcard_Variable;                      // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EnvironmentInteractorComponent_C_ExecuteUbergraph_BP_EnvironmentInteractorComponent) == 0x000008, "Wrong alignment on BP_EnvironmentInteractorComponent_C_ExecuteUbergraph_BP_EnvironmentInteractorComponent");
static_assert(sizeof(BP_EnvironmentInteractorComponent_C_ExecuteUbergraph_BP_EnvironmentInteractorComponent) == 0x0000C0, "Wrong size on BP_EnvironmentInteractorComponent_C_ExecuteUbergraph_BP_EnvironmentInteractorComponent");
static_assert(offsetof(BP_EnvironmentInteractorComponent_C_ExecuteUbergraph_BP_EnvironmentInteractorComponent, EntryPoint) == 0x000000, "Member 'BP_EnvironmentInteractorComponent_C_ExecuteUbergraph_BP_EnvironmentInteractorComponent::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_EnvironmentInteractorComponent_C_ExecuteUbergraph_BP_EnvironmentInteractorComponent, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'BP_EnvironmentInteractorComponent_C_ExecuteUbergraph_BP_EnvironmentInteractorComponent::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_EnvironmentInteractorComponent_C_ExecuteUbergraph_BP_EnvironmentInteractorComponent, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'BP_EnvironmentInteractorComponent_C_ExecuteUbergraph_BP_EnvironmentInteractorComponent::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnvironmentInteractorComponent_C_ExecuteUbergraph_BP_EnvironmentInteractorComponent, CallFunc_GetOwner_ReturnValue_1) == 0x000010, "Member 'BP_EnvironmentInteractorComponent_C_ExecuteUbergraph_BP_EnvironmentInteractorComponent::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EnvironmentInteractorComponent_C_ExecuteUbergraph_BP_EnvironmentInteractorComponent, K2Node_DynamicCast_AsCharacter) == 0x000018, "Member 'BP_EnvironmentInteractorComponent_C_ExecuteUbergraph_BP_EnvironmentInteractorComponent::K2Node_DynamicCast_AsCharacter' has a wrong offset!");
static_assert(offsetof(BP_EnvironmentInteractorComponent_C_ExecuteUbergraph_BP_EnvironmentInteractorComponent, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_EnvironmentInteractorComponent_C_ExecuteUbergraph_BP_EnvironmentInteractorComponent::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_EnvironmentInteractorComponent_C_ExecuteUbergraph_BP_EnvironmentInteractorComponent, K2Node_DynamicCast_AsALS_Character_BP) == 0x000028, "Member 'BP_EnvironmentInteractorComponent_C_ExecuteUbergraph_BP_EnvironmentInteractorComponent::K2Node_DynamicCast_AsALS_Character_BP' has a wrong offset!");
static_assert(offsetof(BP_EnvironmentInteractorComponent_C_ExecuteUbergraph_BP_EnvironmentInteractorComponent, K2Node_DynamicCast_bSuccess_1) == 0x000030, "Member 'BP_EnvironmentInteractorComponent_C_ExecuteUbergraph_BP_EnvironmentInteractorComponent::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_EnvironmentInteractorComponent_C_ExecuteUbergraph_BP_EnvironmentInteractorComponent, K2Node_SwitchEnum_CmpSuccess) == 0x000031, "Member 'BP_EnvironmentInteractorComponent_C_ExecuteUbergraph_BP_EnvironmentInteractorComponent::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_EnvironmentInteractorComponent_C_ExecuteUbergraph_BP_EnvironmentInteractorComponent, K2Node_SwitchEnum_CmpSuccess_1) == 0x000032, "Member 'BP_EnvironmentInteractorComponent_C_ExecuteUbergraph_BP_EnvironmentInteractorComponent::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_EnvironmentInteractorComponent_C_ExecuteUbergraph_BP_EnvironmentInteractorComponent, K2Node_SwitchEnum_CmpSuccess_2) == 0x000033, "Member 'BP_EnvironmentInteractorComponent_C_ExecuteUbergraph_BP_EnvironmentInteractorComponent::K2Node_SwitchEnum_CmpSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_EnvironmentInteractorComponent_C_ExecuteUbergraph_BP_EnvironmentInteractorComponent, K2Node_Event_EndPlayReason) == 0x000034, "Member 'BP_EnvironmentInteractorComponent_C_ExecuteUbergraph_BP_EnvironmentInteractorComponent::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BP_EnvironmentInteractorComponent_C_ExecuteUbergraph_BP_EnvironmentInteractorComponent, CallFunc_GetPlayerController_ReturnValue) == 0x000038, "Member 'BP_EnvironmentInteractorComponent_C_ExecuteUbergraph_BP_EnvironmentInteractorComponent::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnvironmentInteractorComponent_C_ExecuteUbergraph_BP_EnvironmentInteractorComponent, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000040, "Member 'BP_EnvironmentInteractorComponent_C_ExecuteUbergraph_BP_EnvironmentInteractorComponent::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnvironmentInteractorComponent_C_ExecuteUbergraph_BP_EnvironmentInteractorComponent, CallFunc_GetComponentByClass_ReturnValue) == 0x000048, "Member 'BP_EnvironmentInteractorComponent_C_ExecuteUbergraph_BP_EnvironmentInteractorComponent::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnvironmentInteractorComponent_C_ExecuteUbergraph_BP_EnvironmentInteractorComponent, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000050, "Member 'BP_EnvironmentInteractorComponent_C_ExecuteUbergraph_BP_EnvironmentInteractorComponent::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EnvironmentInteractorComponent_C_ExecuteUbergraph_BP_EnvironmentInteractorComponent, CallFunc_GetPlayerController_ReturnValue_1) == 0x000058, "Member 'BP_EnvironmentInteractorComponent_C_ExecuteUbergraph_BP_EnvironmentInteractorComponent::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EnvironmentInteractorComponent_C_ExecuteUbergraph_BP_EnvironmentInteractorComponent, CallFunc_BooleanOR_ReturnValue) == 0x000060, "Member 'BP_EnvironmentInteractorComponent_C_ExecuteUbergraph_BP_EnvironmentInteractorComponent::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnvironmentInteractorComponent_C_ExecuteUbergraph_BP_EnvironmentInteractorComponent, CallFunc_GetComponentByClass_ReturnValue_1) == 0x000068, "Member 'BP_EnvironmentInteractorComponent_C_ExecuteUbergraph_BP_EnvironmentInteractorComponent::CallFunc_GetComponentByClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EnvironmentInteractorComponent_C_ExecuteUbergraph_BP_EnvironmentInteractorComponent, CallFunc_IsValid_ReturnValue) == 0x000070, "Member 'BP_EnvironmentInteractorComponent_C_ExecuteUbergraph_BP_EnvironmentInteractorComponent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnvironmentInteractorComponent_C_ExecuteUbergraph_BP_EnvironmentInteractorComponent, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000078, "Member 'BP_EnvironmentInteractorComponent_C_ExecuteUbergraph_BP_EnvironmentInteractorComponent::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnvironmentInteractorComponent_C_ExecuteUbergraph_BP_EnvironmentInteractorComponent, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000080, "Member 'BP_EnvironmentInteractorComponent_C_ExecuteUbergraph_BP_EnvironmentInteractorComponent::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EnvironmentInteractorComponent_C_ExecuteUbergraph_BP_EnvironmentInteractorComponent, CallFunc_Multiply_DoubleDouble_ReturnValue_2) == 0x000088, "Member 'BP_EnvironmentInteractorComponent_C_ExecuteUbergraph_BP_EnvironmentInteractorComponent::CallFunc_Multiply_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_EnvironmentInteractorComponent_C_ExecuteUbergraph_BP_EnvironmentInteractorComponent, CallFunc_Multiply_DoubleDouble_ReturnValue_3) == 0x000090, "Member 'BP_EnvironmentInteractorComponent_C_ExecuteUbergraph_BP_EnvironmentInteractorComponent::CallFunc_Multiply_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_EnvironmentInteractorComponent_C_ExecuteUbergraph_BP_EnvironmentInteractorComponent, Temp_object_Variable) == 0x000098, "Member 'BP_EnvironmentInteractorComponent_C_ExecuteUbergraph_BP_EnvironmentInteractorComponent::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_EnvironmentInteractorComponent_C_ExecuteUbergraph_BP_EnvironmentInteractorComponent, CallFunc_Multiply_DoubleDouble_ReturnValue_4) == 0x0000A0, "Member 'BP_EnvironmentInteractorComponent_C_ExecuteUbergraph_BP_EnvironmentInteractorComponent::CallFunc_Multiply_DoubleDouble_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_EnvironmentInteractorComponent_C_ExecuteUbergraph_BP_EnvironmentInteractorComponent, CallFunc_Multiply_DoubleDouble_ReturnValue_5) == 0x0000A8, "Member 'BP_EnvironmentInteractorComponent_C_ExecuteUbergraph_BP_EnvironmentInteractorComponent::CallFunc_Multiply_DoubleDouble_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_EnvironmentInteractorComponent_C_ExecuteUbergraph_BP_EnvironmentInteractorComponent, Temp_wildcard_Variable) == 0x0000B0, "Member 'BP_EnvironmentInteractorComponent_C_ExecuteUbergraph_BP_EnvironmentInteractorComponent::Temp_wildcard_Variable' has a wrong offset!");
static_assert(offsetof(BP_EnvironmentInteractorComponent_C_ExecuteUbergraph_BP_EnvironmentInteractorComponent, CallFunc_IsValid_ReturnValue_1) == 0x0000B8, "Member 'BP_EnvironmentInteractorComponent_C_ExecuteUbergraph_BP_EnvironmentInteractorComponent::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

}

