#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_EnvironmentInteractorComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_EnvironmentInteractorComponent.BP_EnvironmentInteractorComponent_C
// 0x0060 (0x0290 - 0x0230)
class UBP_EnvironmentInteractorComponent_C final : public USceneComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0230(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         Interaction_Size;                                  // 0x0238(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Impact_Duration;                                   // 0x023C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         _Alpha;                                            // 0x0240(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         _Optimisation;                                     // 0x0244(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UMaterialInterface*>             OverrideMaterialList;                              // 0x0248(0x0010)(Edit, BlueprintVisible)
	double                                        Radius;                                            // 0x0258(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Active_Interactor;                                 // 0x0260(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_261[0x7];                                      // 0x0261(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Impact_Size;                                       // 0x0268(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Save_Impact_Size;                                  // 0x0270(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Impact_Opacity;                                    // 0x0278(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Save_Impact_Opacity;                               // 0x0280(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          AllowRotationMaterial;                             // 0x0288(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void ExecuteUbergraph_BP_EnvironmentInteractorComponent(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_EnvironmentInteractorComponent_C">();
	}
	static class UBP_EnvironmentInteractorComponent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_EnvironmentInteractorComponent_C>();
	}
};
static_assert(alignof(UBP_EnvironmentInteractorComponent_C) == 0x000010, "Wrong alignment on UBP_EnvironmentInteractorComponent_C");
static_assert(sizeof(UBP_EnvironmentInteractorComponent_C) == 0x000290, "Wrong size on UBP_EnvironmentInteractorComponent_C");
static_assert(offsetof(UBP_EnvironmentInteractorComponent_C, UberGraphFrame) == 0x000230, "Member 'UBP_EnvironmentInteractorComponent_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_EnvironmentInteractorComponent_C, Interaction_Size) == 0x000238, "Member 'UBP_EnvironmentInteractorComponent_C::Interaction_Size' has a wrong offset!");
static_assert(offsetof(UBP_EnvironmentInteractorComponent_C, Impact_Duration) == 0x00023C, "Member 'UBP_EnvironmentInteractorComponent_C::Impact_Duration' has a wrong offset!");
static_assert(offsetof(UBP_EnvironmentInteractorComponent_C, _Alpha) == 0x000240, "Member 'UBP_EnvironmentInteractorComponent_C::_Alpha' has a wrong offset!");
static_assert(offsetof(UBP_EnvironmentInteractorComponent_C, _Optimisation) == 0x000244, "Member 'UBP_EnvironmentInteractorComponent_C::_Optimisation' has a wrong offset!");
static_assert(offsetof(UBP_EnvironmentInteractorComponent_C, OverrideMaterialList) == 0x000248, "Member 'UBP_EnvironmentInteractorComponent_C::OverrideMaterialList' has a wrong offset!");
static_assert(offsetof(UBP_EnvironmentInteractorComponent_C, Radius) == 0x000258, "Member 'UBP_EnvironmentInteractorComponent_C::Radius' has a wrong offset!");
static_assert(offsetof(UBP_EnvironmentInteractorComponent_C, Active_Interactor) == 0x000260, "Member 'UBP_EnvironmentInteractorComponent_C::Active_Interactor' has a wrong offset!");
static_assert(offsetof(UBP_EnvironmentInteractorComponent_C, Impact_Size) == 0x000268, "Member 'UBP_EnvironmentInteractorComponent_C::Impact_Size' has a wrong offset!");
static_assert(offsetof(UBP_EnvironmentInteractorComponent_C, Save_Impact_Size) == 0x000270, "Member 'UBP_EnvironmentInteractorComponent_C::Save_Impact_Size' has a wrong offset!");
static_assert(offsetof(UBP_EnvironmentInteractorComponent_C, Impact_Opacity) == 0x000278, "Member 'UBP_EnvironmentInteractorComponent_C::Impact_Opacity' has a wrong offset!");
static_assert(offsetof(UBP_EnvironmentInteractorComponent_C, Save_Impact_Opacity) == 0x000280, "Member 'UBP_EnvironmentInteractorComponent_C::Save_Impact_Opacity' has a wrong offset!");
static_assert(offsetof(UBP_EnvironmentInteractorComponent_C, AllowRotationMaterial) == 0x000288, "Member 'UBP_EnvironmentInteractorComponent_C::AllowRotationMaterial' has a wrong offset!");

}

