#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FL_CharacterCustomizationHelpers

#include "Basic.hpp"

#include "E_CustomizationItemUser_structs.hpp"
#include "S_CharacterCustomizationItemData_structs.hpp"
#include "S_CharacterCustomization_structs.hpp"


namespace SDK::Params
{

// Function BP_FL_CharacterCustomizationHelpers.BP_FL_CharacterCustomizationHelpers_C.Equal (CharacterCustomization)
// 0x00B0 (0x00B0 - 0x0000)
struct BP_FL_CharacterCustomizationHelpers_C_Equal__CharacterCustomization_ final
{
public:
	struct FS_CharacterCustomization              LeftCustomization;                                 // 0x0000(0x0050)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	struct FS_CharacterCustomization              RightCustomization;                                // 0x0050(0x0050)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x00A0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x00A8(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_SoftClassReference_ReturnValue; // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_SoftClassReference_ReturnValue_1; // 0x00AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00AB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FL_CharacterCustomizationHelpers_C_Equal__CharacterCustomization_) == 0x000008, "Wrong alignment on BP_FL_CharacterCustomizationHelpers_C_Equal__CharacterCustomization_");
static_assert(sizeof(BP_FL_CharacterCustomizationHelpers_C_Equal__CharacterCustomization_) == 0x0000B0, "Wrong size on BP_FL_CharacterCustomizationHelpers_C_Equal__CharacterCustomization_");
static_assert(offsetof(BP_FL_CharacterCustomizationHelpers_C_Equal__CharacterCustomization_, LeftCustomization) == 0x000000, "Member 'BP_FL_CharacterCustomizationHelpers_C_Equal__CharacterCustomization_::LeftCustomization' has a wrong offset!");
static_assert(offsetof(BP_FL_CharacterCustomizationHelpers_C_Equal__CharacterCustomization_, RightCustomization) == 0x000050, "Member 'BP_FL_CharacterCustomizationHelpers_C_Equal__CharacterCustomization_::RightCustomization' has a wrong offset!");
static_assert(offsetof(BP_FL_CharacterCustomizationHelpers_C_Equal__CharacterCustomization_, __WorldContext) == 0x0000A0, "Member 'BP_FL_CharacterCustomizationHelpers_C_Equal__CharacterCustomization_::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_FL_CharacterCustomizationHelpers_C_Equal__CharacterCustomization_, Result) == 0x0000A8, "Member 'BP_FL_CharacterCustomizationHelpers_C_Equal__CharacterCustomization_::Result' has a wrong offset!");
static_assert(offsetof(BP_FL_CharacterCustomizationHelpers_C_Equal__CharacterCustomization_, CallFunc_EqualEqual_SoftClassReference_ReturnValue) == 0x0000A9, "Member 'BP_FL_CharacterCustomizationHelpers_C_Equal__CharacterCustomization_::CallFunc_EqualEqual_SoftClassReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FL_CharacterCustomizationHelpers_C_Equal__CharacterCustomization_, CallFunc_EqualEqual_SoftClassReference_ReturnValue_1) == 0x0000AA, "Member 'BP_FL_CharacterCustomizationHelpers_C_Equal__CharacterCustomization_::CallFunc_EqualEqual_SoftClassReference_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FL_CharacterCustomizationHelpers_C_Equal__CharacterCustomization_, CallFunc_BooleanAND_ReturnValue) == 0x0000AB, "Member 'BP_FL_CharacterCustomizationHelpers_C_Equal__CharacterCustomization_::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BP_FL_CharacterCustomizationHelpers.BP_FL_CharacterCustomizationHelpers_C.Equal (CharacterCustomizationItemData)
// 0x0030 (0x0030 - 0x0000)
struct BP_FL_CharacterCustomizationHelpers_C_Equal__CharacterCustomizationItemData_ final
{
public:
	struct FS_CharacterCustomizationItemData      LeftCustomization;                                 // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_CharacterCustomizationItemData      RightCustomization;                                // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_1;        // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FL_CharacterCustomizationHelpers_C_Equal__CharacterCustomizationItemData_) == 0x000008, "Wrong alignment on BP_FL_CharacterCustomizationHelpers_C_Equal__CharacterCustomizationItemData_");
static_assert(sizeof(BP_FL_CharacterCustomizationHelpers_C_Equal__CharacterCustomizationItemData_) == 0x000030, "Wrong size on BP_FL_CharacterCustomizationHelpers_C_Equal__CharacterCustomizationItemData_");
static_assert(offsetof(BP_FL_CharacterCustomizationHelpers_C_Equal__CharacterCustomizationItemData_, LeftCustomization) == 0x000000, "Member 'BP_FL_CharacterCustomizationHelpers_C_Equal__CharacterCustomizationItemData_::LeftCustomization' has a wrong offset!");
static_assert(offsetof(BP_FL_CharacterCustomizationHelpers_C_Equal__CharacterCustomizationItemData_, RightCustomization) == 0x000010, "Member 'BP_FL_CharacterCustomizationHelpers_C_Equal__CharacterCustomizationItemData_::RightCustomization' has a wrong offset!");
static_assert(offsetof(BP_FL_CharacterCustomizationHelpers_C_Equal__CharacterCustomizationItemData_, __WorldContext) == 0x000020, "Member 'BP_FL_CharacterCustomizationHelpers_C_Equal__CharacterCustomizationItemData_::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_FL_CharacterCustomizationHelpers_C_Equal__CharacterCustomizationItemData_, Result) == 0x000028, "Member 'BP_FL_CharacterCustomizationHelpers_C_Equal__CharacterCustomizationItemData_::Result' has a wrong offset!");
static_assert(offsetof(BP_FL_CharacterCustomizationHelpers_C_Equal__CharacterCustomizationItemData_, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000029, "Member 'BP_FL_CharacterCustomizationHelpers_C_Equal__CharacterCustomizationItemData_::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FL_CharacterCustomizationHelpers_C_Equal__CharacterCustomizationItemData_, CallFunc_EqualEqual_NameName_ReturnValue_1) == 0x00002A, "Member 'BP_FL_CharacterCustomizationHelpers_C_Equal__CharacterCustomizationItemData_::CallFunc_EqualEqual_NameName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FL_CharacterCustomizationHelpers_C_Equal__CharacterCustomizationItemData_, CallFunc_BooleanAND_ReturnValue) == 0x00002B, "Member 'BP_FL_CharacterCustomizationHelpers_C_Equal__CharacterCustomizationItemData_::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BP_FL_CharacterCustomizationHelpers.BP_FL_CharacterCustomizationHelpers_C.GetCharacterHardcodedName
// 0x0020 (0x0020 - 0x0000)
struct BP_FL_CharacterCustomizationHelpers_C_GetCharacterHardcodedName final
{
public:
	E_CustomizationItemUser                       CustomizationItemUser;                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   CharacterHardcodedName;                            // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FL_CharacterCustomizationHelpers_C_GetCharacterHardcodedName) == 0x000008, "Wrong alignment on BP_FL_CharacterCustomizationHelpers_C_GetCharacterHardcodedName");
static_assert(sizeof(BP_FL_CharacterCustomizationHelpers_C_GetCharacterHardcodedName) == 0x000020, "Wrong size on BP_FL_CharacterCustomizationHelpers_C_GetCharacterHardcodedName");
static_assert(offsetof(BP_FL_CharacterCustomizationHelpers_C_GetCharacterHardcodedName, CustomizationItemUser) == 0x000000, "Member 'BP_FL_CharacterCustomizationHelpers_C_GetCharacterHardcodedName::CustomizationItemUser' has a wrong offset!");
static_assert(offsetof(BP_FL_CharacterCustomizationHelpers_C_GetCharacterHardcodedName, __WorldContext) == 0x000008, "Member 'BP_FL_CharacterCustomizationHelpers_C_GetCharacterHardcodedName::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_FL_CharacterCustomizationHelpers_C_GetCharacterHardcodedName, CharacterHardcodedName) == 0x000010, "Member 'BP_FL_CharacterCustomizationHelpers_C_GetCharacterHardcodedName::CharacterHardcodedName' has a wrong offset!");
static_assert(offsetof(BP_FL_CharacterCustomizationHelpers_C_GetCharacterHardcodedName, K2Node_SwitchEnum_CmpSuccess) == 0x000018, "Member 'BP_FL_CharacterCustomizationHelpers_C_GetCharacterHardcodedName::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function BP_FL_CharacterCustomizationHelpers.BP_FL_CharacterCustomizationHelpers_C.IsValid (CharacterCustomization)
// 0x0060 (0x0060 - 0x0000)
struct BP_FL_CharacterCustomizationHelpers_C_IsValid__CharacterCustomization_ final
{
public:
	struct FS_CharacterCustomization              CharacterCustomization;                            // 0x0000(0x0050)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0050(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Valid;                                             // 0x0058(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftClassReference_ReturnValue;    // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FL_CharacterCustomizationHelpers_C_IsValid__CharacterCustomization_) == 0x000008, "Wrong alignment on BP_FL_CharacterCustomizationHelpers_C_IsValid__CharacterCustomization_");
static_assert(sizeof(BP_FL_CharacterCustomizationHelpers_C_IsValid__CharacterCustomization_) == 0x000060, "Wrong size on BP_FL_CharacterCustomizationHelpers_C_IsValid__CharacterCustomization_");
static_assert(offsetof(BP_FL_CharacterCustomizationHelpers_C_IsValid__CharacterCustomization_, CharacterCustomization) == 0x000000, "Member 'BP_FL_CharacterCustomizationHelpers_C_IsValid__CharacterCustomization_::CharacterCustomization' has a wrong offset!");
static_assert(offsetof(BP_FL_CharacterCustomizationHelpers_C_IsValid__CharacterCustomization_, __WorldContext) == 0x000050, "Member 'BP_FL_CharacterCustomizationHelpers_C_IsValid__CharacterCustomization_::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_FL_CharacterCustomizationHelpers_C_IsValid__CharacterCustomization_, Valid) == 0x000058, "Member 'BP_FL_CharacterCustomizationHelpers_C_IsValid__CharacterCustomization_::Valid' has a wrong offset!");
static_assert(offsetof(BP_FL_CharacterCustomizationHelpers_C_IsValid__CharacterCustomization_, CallFunc_IsValidSoftClassReference_ReturnValue) == 0x000059, "Member 'BP_FL_CharacterCustomizationHelpers_C_IsValid__CharacterCustomization_::CallFunc_IsValidSoftClassReference_ReturnValue' has a wrong offset!");

// Function BP_FL_CharacterCustomizationHelpers.BP_FL_CharacterCustomizationHelpers_C.IsValid (CharacterCustomizationItemData)
// 0x0020 (0x0020 - 0x0000)
struct BP_FL_CharacterCustomizationHelpers_C_IsValid__CharacterCustomizationItemData_ final
{
public:
	struct FS_CharacterCustomizationItemData      CharacterCustomization;                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Valid;                                             // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue_1;          // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FL_CharacterCustomizationHelpers_C_IsValid__CharacterCustomizationItemData_) == 0x000008, "Wrong alignment on BP_FL_CharacterCustomizationHelpers_C_IsValid__CharacterCustomizationItemData_");
static_assert(sizeof(BP_FL_CharacterCustomizationHelpers_C_IsValid__CharacterCustomizationItemData_) == 0x000020, "Wrong size on BP_FL_CharacterCustomizationHelpers_C_IsValid__CharacterCustomizationItemData_");
static_assert(offsetof(BP_FL_CharacterCustomizationHelpers_C_IsValid__CharacterCustomizationItemData_, CharacterCustomization) == 0x000000, "Member 'BP_FL_CharacterCustomizationHelpers_C_IsValid__CharacterCustomizationItemData_::CharacterCustomization' has a wrong offset!");
static_assert(offsetof(BP_FL_CharacterCustomizationHelpers_C_IsValid__CharacterCustomizationItemData_, __WorldContext) == 0x000010, "Member 'BP_FL_CharacterCustomizationHelpers_C_IsValid__CharacterCustomizationItemData_::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_FL_CharacterCustomizationHelpers_C_IsValid__CharacterCustomizationItemData_, Valid) == 0x000018, "Member 'BP_FL_CharacterCustomizationHelpers_C_IsValid__CharacterCustomizationItemData_::Valid' has a wrong offset!");
static_assert(offsetof(BP_FL_CharacterCustomizationHelpers_C_IsValid__CharacterCustomizationItemData_, CallFunc_NotEqual_NameName_ReturnValue) == 0x000019, "Member 'BP_FL_CharacterCustomizationHelpers_C_IsValid__CharacterCustomizationItemData_::CallFunc_NotEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FL_CharacterCustomizationHelpers_C_IsValid__CharacterCustomizationItemData_, CallFunc_NotEqual_NameName_ReturnValue_1) == 0x00001A, "Member 'BP_FL_CharacterCustomizationHelpers_C_IsValid__CharacterCustomizationItemData_::CallFunc_NotEqual_NameName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FL_CharacterCustomizationHelpers_C_IsValid__CharacterCustomizationItemData_, CallFunc_BooleanAND_ReturnValue) == 0x00001B, "Member 'BP_FL_CharacterCustomizationHelpers_C_IsValid__CharacterCustomizationItemData_::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BP_FL_CharacterCustomizationHelpers.BP_FL_CharacterCustomizationHelpers_C.NotEqual (CharacterCustomization)
// 0x00B0 (0x00B0 - 0x0000)
struct BP_FL_CharacterCustomizationHelpers_C_NotEqual__CharacterCustomization_ final
{
public:
	struct FS_CharacterCustomization              LeftCustomization;                                 // 0x0000(0x0050)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	struct FS_CharacterCustomization              RightCustomization;                                // 0x0050(0x0050)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x00A0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x00A8(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Equal__CharacterCustomization__Result;    // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FL_CharacterCustomizationHelpers_C_NotEqual__CharacterCustomization_) == 0x000008, "Wrong alignment on BP_FL_CharacterCustomizationHelpers_C_NotEqual__CharacterCustomization_");
static_assert(sizeof(BP_FL_CharacterCustomizationHelpers_C_NotEqual__CharacterCustomization_) == 0x0000B0, "Wrong size on BP_FL_CharacterCustomizationHelpers_C_NotEqual__CharacterCustomization_");
static_assert(offsetof(BP_FL_CharacterCustomizationHelpers_C_NotEqual__CharacterCustomization_, LeftCustomization) == 0x000000, "Member 'BP_FL_CharacterCustomizationHelpers_C_NotEqual__CharacterCustomization_::LeftCustomization' has a wrong offset!");
static_assert(offsetof(BP_FL_CharacterCustomizationHelpers_C_NotEqual__CharacterCustomization_, RightCustomization) == 0x000050, "Member 'BP_FL_CharacterCustomizationHelpers_C_NotEqual__CharacterCustomization_::RightCustomization' has a wrong offset!");
static_assert(offsetof(BP_FL_CharacterCustomizationHelpers_C_NotEqual__CharacterCustomization_, __WorldContext) == 0x0000A0, "Member 'BP_FL_CharacterCustomizationHelpers_C_NotEqual__CharacterCustomization_::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_FL_CharacterCustomizationHelpers_C_NotEqual__CharacterCustomization_, Result) == 0x0000A8, "Member 'BP_FL_CharacterCustomizationHelpers_C_NotEqual__CharacterCustomization_::Result' has a wrong offset!");
static_assert(offsetof(BP_FL_CharacterCustomizationHelpers_C_NotEqual__CharacterCustomization_, CallFunc_Equal__CharacterCustomization__Result) == 0x0000A9, "Member 'BP_FL_CharacterCustomizationHelpers_C_NotEqual__CharacterCustomization_::CallFunc_Equal__CharacterCustomization__Result' has a wrong offset!");
static_assert(offsetof(BP_FL_CharacterCustomizationHelpers_C_NotEqual__CharacterCustomization_, CallFunc_Not_PreBool_ReturnValue) == 0x0000AA, "Member 'BP_FL_CharacterCustomizationHelpers_C_NotEqual__CharacterCustomization_::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function BP_FL_CharacterCustomizationHelpers.BP_FL_CharacterCustomizationHelpers_C.NotEqual (CharacterCustomizationItemData)
// 0x0030 (0x0030 - 0x0000)
struct BP_FL_CharacterCustomizationHelpers_C_NotEqual__CharacterCustomizationItemData_ final
{
public:
	struct FS_CharacterCustomizationItemData      LeftCustomization;                                 // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_CharacterCustomizationItemData      RightCustomization;                                // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Equal__CharacterCustomizationItemData__Result; // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FL_CharacterCustomizationHelpers_C_NotEqual__CharacterCustomizationItemData_) == 0x000008, "Wrong alignment on BP_FL_CharacterCustomizationHelpers_C_NotEqual__CharacterCustomizationItemData_");
static_assert(sizeof(BP_FL_CharacterCustomizationHelpers_C_NotEqual__CharacterCustomizationItemData_) == 0x000030, "Wrong size on BP_FL_CharacterCustomizationHelpers_C_NotEqual__CharacterCustomizationItemData_");
static_assert(offsetof(BP_FL_CharacterCustomizationHelpers_C_NotEqual__CharacterCustomizationItemData_, LeftCustomization) == 0x000000, "Member 'BP_FL_CharacterCustomizationHelpers_C_NotEqual__CharacterCustomizationItemData_::LeftCustomization' has a wrong offset!");
static_assert(offsetof(BP_FL_CharacterCustomizationHelpers_C_NotEqual__CharacterCustomizationItemData_, RightCustomization) == 0x000010, "Member 'BP_FL_CharacterCustomizationHelpers_C_NotEqual__CharacterCustomizationItemData_::RightCustomization' has a wrong offset!");
static_assert(offsetof(BP_FL_CharacterCustomizationHelpers_C_NotEqual__CharacterCustomizationItemData_, __WorldContext) == 0x000020, "Member 'BP_FL_CharacterCustomizationHelpers_C_NotEqual__CharacterCustomizationItemData_::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_FL_CharacterCustomizationHelpers_C_NotEqual__CharacterCustomizationItemData_, Result) == 0x000028, "Member 'BP_FL_CharacterCustomizationHelpers_C_NotEqual__CharacterCustomizationItemData_::Result' has a wrong offset!");
static_assert(offsetof(BP_FL_CharacterCustomizationHelpers_C_NotEqual__CharacterCustomizationItemData_, CallFunc_Equal__CharacterCustomizationItemData__Result) == 0x000029, "Member 'BP_FL_CharacterCustomizationHelpers_C_NotEqual__CharacterCustomizationItemData_::CallFunc_Equal__CharacterCustomizationItemData__Result' has a wrong offset!");
static_assert(offsetof(BP_FL_CharacterCustomizationHelpers_C_NotEqual__CharacterCustomizationItemData_, CallFunc_Not_PreBool_ReturnValue) == 0x00002A, "Member 'BP_FL_CharacterCustomizationHelpers_C_NotEqual__CharacterCustomizationItemData_::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

}

