#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FL_TutorialHelpers

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "S_TutorialCardParameters_structs.hpp"
#include "S_TutorialHintParameters_structs.hpp"


namespace SDK::Params
{

// Function BP_FL_TutorialHelpers.BP_FL_TutorialHelpers_C.SetTutorialCompletedByID
// 0x0020 (0x0020 - 0x0000)
struct BP_FL_TutorialHelpers_C_SetTutorialCompletedByID final
{
public:
	bool                                          Completed;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   TutorialID;                                        // 0x0004(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_jRPG_GI_Custom_C*                   CallFunc_GetCustomGI_ReturnValue;                  // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FL_TutorialHelpers_C_SetTutorialCompletedByID) == 0x000008, "Wrong alignment on BP_FL_TutorialHelpers_C_SetTutorialCompletedByID");
static_assert(sizeof(BP_FL_TutorialHelpers_C_SetTutorialCompletedByID) == 0x000020, "Wrong size on BP_FL_TutorialHelpers_C_SetTutorialCompletedByID");
static_assert(offsetof(BP_FL_TutorialHelpers_C_SetTutorialCompletedByID, Completed) == 0x000000, "Member 'BP_FL_TutorialHelpers_C_SetTutorialCompletedByID::Completed' has a wrong offset!");
static_assert(offsetof(BP_FL_TutorialHelpers_C_SetTutorialCompletedByID, TutorialID) == 0x000004, "Member 'BP_FL_TutorialHelpers_C_SetTutorialCompletedByID::TutorialID' has a wrong offset!");
static_assert(offsetof(BP_FL_TutorialHelpers_C_SetTutorialCompletedByID, __WorldContext) == 0x000010, "Member 'BP_FL_TutorialHelpers_C_SetTutorialCompletedByID::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_FL_TutorialHelpers_C_SetTutorialCompletedByID, CallFunc_GetCustomGI_ReturnValue) == 0x000018, "Member 'BP_FL_TutorialHelpers_C_SetTutorialCompletedByID::CallFunc_GetCustomGI_ReturnValue' has a wrong offset!");

// Function BP_FL_TutorialHelpers.BP_FL_TutorialHelpers_C.SetTutorialCompletedByDataTableRow
// 0x0020 (0x0020 - 0x0000)
struct BP_FL_TutorialHelpers_C_SetTutorialCompletedByDataTableRow final
{
public:
	bool                                          Completed;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    TutorialCardRow;                                   // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	class UObject*                                __WorldContext;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FL_TutorialHelpers_C_SetTutorialCompletedByDataTableRow) == 0x000008, "Wrong alignment on BP_FL_TutorialHelpers_C_SetTutorialCompletedByDataTableRow");
static_assert(sizeof(BP_FL_TutorialHelpers_C_SetTutorialCompletedByDataTableRow) == 0x000020, "Wrong size on BP_FL_TutorialHelpers_C_SetTutorialCompletedByDataTableRow");
static_assert(offsetof(BP_FL_TutorialHelpers_C_SetTutorialCompletedByDataTableRow, Completed) == 0x000000, "Member 'BP_FL_TutorialHelpers_C_SetTutorialCompletedByDataTableRow::Completed' has a wrong offset!");
static_assert(offsetof(BP_FL_TutorialHelpers_C_SetTutorialCompletedByDataTableRow, TutorialCardRow) == 0x000008, "Member 'BP_FL_TutorialHelpers_C_SetTutorialCompletedByDataTableRow::TutorialCardRow' has a wrong offset!");
static_assert(offsetof(BP_FL_TutorialHelpers_C_SetTutorialCompletedByDataTableRow, __WorldContext) == 0x000018, "Member 'BP_FL_TutorialHelpers_C_SetTutorialCompletedByDataTableRow::__WorldContext' has a wrong offset!");

// Function BP_FL_TutorialHelpers.BP_FL_TutorialHelpers_C.SetSkipTurnPrevented
// 0x0020 (0x0020 - 0x0000)
struct BP_FL_TutorialHelpers_C_SetSkipTurnPrevented final
{
public:
	bool                                          Prevented;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAC_jRPG_BattleManager_C*               CallFunc_GetBattleManager_ReturnValue;             // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FL_TutorialHelpers_C_SetSkipTurnPrevented) == 0x000008, "Wrong alignment on BP_FL_TutorialHelpers_C_SetSkipTurnPrevented");
static_assert(sizeof(BP_FL_TutorialHelpers_C_SetSkipTurnPrevented) == 0x000020, "Wrong size on BP_FL_TutorialHelpers_C_SetSkipTurnPrevented");
static_assert(offsetof(BP_FL_TutorialHelpers_C_SetSkipTurnPrevented, Prevented) == 0x000000, "Member 'BP_FL_TutorialHelpers_C_SetSkipTurnPrevented::Prevented' has a wrong offset!");
static_assert(offsetof(BP_FL_TutorialHelpers_C_SetSkipTurnPrevented, __WorldContext) == 0x000008, "Member 'BP_FL_TutorialHelpers_C_SetSkipTurnPrevented::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_FL_TutorialHelpers_C_SetSkipTurnPrevented, CallFunc_Not_PreBool_ReturnValue) == 0x000010, "Member 'BP_FL_TutorialHelpers_C_SetSkipTurnPrevented::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FL_TutorialHelpers_C_SetSkipTurnPrevented, CallFunc_GetBattleManager_ReturnValue) == 0x000018, "Member 'BP_FL_TutorialHelpers_C_SetSkipTurnPrevented::CallFunc_GetBattleManager_ReturnValue' has a wrong offset!");

// Function BP_FL_TutorialHelpers.BP_FL_TutorialHelpers_C.OneTimeDisplayTutorialCard
// 0x0060 (0x0060 - 0x0000)
struct BP_FL_TutorialHelpers_C_OneTimeDisplayTutorialCard final
{
public:
	class FName                                   TutorialID;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FDataTableRowHandle                    K2Node_MakeStruct_DataTableRowHandle;              // 0x0010(0x0010)(NoDestructor)
	class UBP_TutorialSystemComponent_C*          CallFunc_GetTutorialSystemComponent_ReturnValue;   // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FS_TutorialCardParameters              K2Node_MakeStruct_S_TutorialCardParameters;        // 0x0028(0x0020)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasActiveTutorialCard_ReturnValue;        // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_TutorialSystemComponent_C*          CallFunc_GetTutorialSystemComponent_ReturnValue_1; // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasPlayedTutorial_Result;                 // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FL_TutorialHelpers_C_OneTimeDisplayTutorialCard) == 0x000008, "Wrong alignment on BP_FL_TutorialHelpers_C_OneTimeDisplayTutorialCard");
static_assert(sizeof(BP_FL_TutorialHelpers_C_OneTimeDisplayTutorialCard) == 0x000060, "Wrong size on BP_FL_TutorialHelpers_C_OneTimeDisplayTutorialCard");
static_assert(offsetof(BP_FL_TutorialHelpers_C_OneTimeDisplayTutorialCard, TutorialID) == 0x000000, "Member 'BP_FL_TutorialHelpers_C_OneTimeDisplayTutorialCard::TutorialID' has a wrong offset!");
static_assert(offsetof(BP_FL_TutorialHelpers_C_OneTimeDisplayTutorialCard, __WorldContext) == 0x000008, "Member 'BP_FL_TutorialHelpers_C_OneTimeDisplayTutorialCard::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_FL_TutorialHelpers_C_OneTimeDisplayTutorialCard, K2Node_MakeStruct_DataTableRowHandle) == 0x000010, "Member 'BP_FL_TutorialHelpers_C_OneTimeDisplayTutorialCard::K2Node_MakeStruct_DataTableRowHandle' has a wrong offset!");
static_assert(offsetof(BP_FL_TutorialHelpers_C_OneTimeDisplayTutorialCard, CallFunc_GetTutorialSystemComponent_ReturnValue) == 0x000020, "Member 'BP_FL_TutorialHelpers_C_OneTimeDisplayTutorialCard::CallFunc_GetTutorialSystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FL_TutorialHelpers_C_OneTimeDisplayTutorialCard, K2Node_MakeStruct_S_TutorialCardParameters) == 0x000028, "Member 'BP_FL_TutorialHelpers_C_OneTimeDisplayTutorialCard::K2Node_MakeStruct_S_TutorialCardParameters' has a wrong offset!");
static_assert(offsetof(BP_FL_TutorialHelpers_C_OneTimeDisplayTutorialCard, CallFunc_HasActiveTutorialCard_ReturnValue) == 0x000048, "Member 'BP_FL_TutorialHelpers_C_OneTimeDisplayTutorialCard::CallFunc_HasActiveTutorialCard_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FL_TutorialHelpers_C_OneTimeDisplayTutorialCard, CallFunc_Not_PreBool_ReturnValue) == 0x000049, "Member 'BP_FL_TutorialHelpers_C_OneTimeDisplayTutorialCard::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FL_TutorialHelpers_C_OneTimeDisplayTutorialCard, CallFunc_GetTutorialSystemComponent_ReturnValue_1) == 0x000050, "Member 'BP_FL_TutorialHelpers_C_OneTimeDisplayTutorialCard::CallFunc_GetTutorialSystemComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FL_TutorialHelpers_C_OneTimeDisplayTutorialCard, CallFunc_HasPlayedTutorial_Result) == 0x000058, "Member 'BP_FL_TutorialHelpers_C_OneTimeDisplayTutorialCard::CallFunc_HasPlayedTutorial_Result' has a wrong offset!");
static_assert(offsetof(BP_FL_TutorialHelpers_C_OneTimeDisplayTutorialCard, CallFunc_Not_PreBool_ReturnValue_1) == 0x000059, "Member 'BP_FL_TutorialHelpers_C_OneTimeDisplayTutorialCard::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FL_TutorialHelpers_C_OneTimeDisplayTutorialCard, CallFunc_BooleanAND_ReturnValue) == 0x00005A, "Member 'BP_FL_TutorialHelpers_C_OneTimeDisplayTutorialCard::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BP_FL_TutorialHelpers.BP_FL_TutorialHelpers_C.HighlightTutorialWidget
// 0x0020 (0x0020 - 0x0000)
struct BP_FL_TutorialHelpers_C_HighlightTutorialWidget final
{
public:
	class UWidget*                                TargetWidget;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_Tuto_BlurIndicator_C*              AreaHighlightWidget;                               // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_Tuto_BlurIndicator_C*              CallFunc_Create_ReturnValue;                       // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FL_TutorialHelpers_C_HighlightTutorialWidget) == 0x000008, "Wrong alignment on BP_FL_TutorialHelpers_C_HighlightTutorialWidget");
static_assert(sizeof(BP_FL_TutorialHelpers_C_HighlightTutorialWidget) == 0x000020, "Wrong size on BP_FL_TutorialHelpers_C_HighlightTutorialWidget");
static_assert(offsetof(BP_FL_TutorialHelpers_C_HighlightTutorialWidget, TargetWidget) == 0x000000, "Member 'BP_FL_TutorialHelpers_C_HighlightTutorialWidget::TargetWidget' has a wrong offset!");
static_assert(offsetof(BP_FL_TutorialHelpers_C_HighlightTutorialWidget, __WorldContext) == 0x000008, "Member 'BP_FL_TutorialHelpers_C_HighlightTutorialWidget::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_FL_TutorialHelpers_C_HighlightTutorialWidget, AreaHighlightWidget) == 0x000010, "Member 'BP_FL_TutorialHelpers_C_HighlightTutorialWidget::AreaHighlightWidget' has a wrong offset!");
static_assert(offsetof(BP_FL_TutorialHelpers_C_HighlightTutorialWidget, CallFunc_Create_ReturnValue) == 0x000018, "Member 'BP_FL_TutorialHelpers_C_HighlightTutorialWidget::CallFunc_Create_ReturnValue' has a wrong offset!");

// Function BP_FL_TutorialHelpers.BP_FL_TutorialHelpers_C.GetWBP_BattleWheelAction
// 0x0028 (0x0028 - 0x0000)
struct BP_FL_TutorialHelpers_C_GetWBP_BattleWheelAction final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_BattleWheel_C*                     WBP_BattleWheel_Action;                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAC_jRPG_BattleManager_C*               CallFunc_GetBattleManager_ReturnValue;             // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ABP_LGUI_UIContainer_BattleWheelRoot_C* CallFunc_GetLGUIActor_BattleWheels_ReturnValue;    // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_HUD_WheelsContainer_C*             CallFunc_GetWheelsContainerWidget_ReturnValue;     // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FL_TutorialHelpers_C_GetWBP_BattleWheelAction) == 0x000008, "Wrong alignment on BP_FL_TutorialHelpers_C_GetWBP_BattleWheelAction");
static_assert(sizeof(BP_FL_TutorialHelpers_C_GetWBP_BattleWheelAction) == 0x000028, "Wrong size on BP_FL_TutorialHelpers_C_GetWBP_BattleWheelAction");
static_assert(offsetof(BP_FL_TutorialHelpers_C_GetWBP_BattleWheelAction, __WorldContext) == 0x000000, "Member 'BP_FL_TutorialHelpers_C_GetWBP_BattleWheelAction::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_FL_TutorialHelpers_C_GetWBP_BattleWheelAction, WBP_BattleWheel_Action) == 0x000008, "Member 'BP_FL_TutorialHelpers_C_GetWBP_BattleWheelAction::WBP_BattleWheel_Action' has a wrong offset!");
static_assert(offsetof(BP_FL_TutorialHelpers_C_GetWBP_BattleWheelAction, CallFunc_GetBattleManager_ReturnValue) == 0x000010, "Member 'BP_FL_TutorialHelpers_C_GetWBP_BattleWheelAction::CallFunc_GetBattleManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FL_TutorialHelpers_C_GetWBP_BattleWheelAction, CallFunc_GetLGUIActor_BattleWheels_ReturnValue) == 0x000018, "Member 'BP_FL_TutorialHelpers_C_GetWBP_BattleWheelAction::CallFunc_GetLGUIActor_BattleWheels_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FL_TutorialHelpers_C_GetWBP_BattleWheelAction, CallFunc_GetWheelsContainerWidget_ReturnValue) == 0x000020, "Member 'BP_FL_TutorialHelpers_C_GetWBP_BattleWheelAction::CallFunc_GetWheelsContainerWidget_ReturnValue' has a wrong offset!");

// Function BP_FL_TutorialHelpers.BP_FL_TutorialHelpers_C.DisableUI_InputsBlock
// 0x0018 (0x0018 - 0x0000)
struct BP_FL_TutorialHelpers_C_DisableUI_InputsBlock final
{
public:
	class UWBP_CommonUI_InvisibleModalInputBlocker_C* WBPInputBlocker;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, InstancedReference, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FL_TutorialHelpers_C_DisableUI_InputsBlock) == 0x000008, "Wrong alignment on BP_FL_TutorialHelpers_C_DisableUI_InputsBlock");
static_assert(sizeof(BP_FL_TutorialHelpers_C_DisableUI_InputsBlock) == 0x000018, "Wrong size on BP_FL_TutorialHelpers_C_DisableUI_InputsBlock");
static_assert(offsetof(BP_FL_TutorialHelpers_C_DisableUI_InputsBlock, WBPInputBlocker) == 0x000000, "Member 'BP_FL_TutorialHelpers_C_DisableUI_InputsBlock::WBPInputBlocker' has a wrong offset!");
static_assert(offsetof(BP_FL_TutorialHelpers_C_DisableUI_InputsBlock, __WorldContext) == 0x000008, "Member 'BP_FL_TutorialHelpers_C_DisableUI_InputsBlock::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_FL_TutorialHelpers_C_DisableUI_InputsBlock, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'BP_FL_TutorialHelpers_C_DisableUI_InputsBlock::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_FL_TutorialHelpers.BP_FL_TutorialHelpers_C.EnableUI_InputsBlock
// 0x0018 (0x0018 - 0x0000)
struct BP_FL_TutorialHelpers_C_EnableUI_InputsBlock final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_CommonUI_InvisibleModalInputBlocker_C* ReturnValue;                                   // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_CommonUI_InvisibleModalInputBlocker_C* CallFunc_Create_ReturnValue;                   // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FL_TutorialHelpers_C_EnableUI_InputsBlock) == 0x000008, "Wrong alignment on BP_FL_TutorialHelpers_C_EnableUI_InputsBlock");
static_assert(sizeof(BP_FL_TutorialHelpers_C_EnableUI_InputsBlock) == 0x000018, "Wrong size on BP_FL_TutorialHelpers_C_EnableUI_InputsBlock");
static_assert(offsetof(BP_FL_TutorialHelpers_C_EnableUI_InputsBlock, __WorldContext) == 0x000000, "Member 'BP_FL_TutorialHelpers_C_EnableUI_InputsBlock::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_FL_TutorialHelpers_C_EnableUI_InputsBlock, ReturnValue) == 0x000008, "Member 'BP_FL_TutorialHelpers_C_EnableUI_InputsBlock::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FL_TutorialHelpers_C_EnableUI_InputsBlock, CallFunc_Create_ReturnValue) == 0x000010, "Member 'BP_FL_TutorialHelpers_C_EnableUI_InputsBlock::CallFunc_Create_ReturnValue' has a wrong offset!");

// Function BP_FL_TutorialHelpers.BP_FL_TutorialHelpers_C.DisplayTutorialHint
// 0x0028 (0x0028 - 0x0000)
struct BP_FL_TutorialHelpers_C_DisplayTutorialHint final
{
public:
	struct FS_TutorialHintParameters              TutorialHintParameters;                            // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_TutorialSystemComponent_C*          CallFunc_GetTutorialSystemComponent_ReturnValue;   // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FL_TutorialHelpers_C_DisplayTutorialHint) == 0x000008, "Wrong alignment on BP_FL_TutorialHelpers_C_DisplayTutorialHint");
static_assert(sizeof(BP_FL_TutorialHelpers_C_DisplayTutorialHint) == 0x000028, "Wrong size on BP_FL_TutorialHelpers_C_DisplayTutorialHint");
static_assert(offsetof(BP_FL_TutorialHelpers_C_DisplayTutorialHint, TutorialHintParameters) == 0x000000, "Member 'BP_FL_TutorialHelpers_C_DisplayTutorialHint::TutorialHintParameters' has a wrong offset!");
static_assert(offsetof(BP_FL_TutorialHelpers_C_DisplayTutorialHint, __WorldContext) == 0x000018, "Member 'BP_FL_TutorialHelpers_C_DisplayTutorialHint::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_FL_TutorialHelpers_C_DisplayTutorialHint, CallFunc_GetTutorialSystemComponent_ReturnValue) == 0x000020, "Member 'BP_FL_TutorialHelpers_C_DisplayTutorialHint::CallFunc_GetTutorialSystemComponent_ReturnValue' has a wrong offset!");

// Function BP_FL_TutorialHelpers.BP_FL_TutorialHelpers_C.DisplayTutorialCard
// 0x0058 (0x0058 - 0x0000)
struct BP_FL_TutorialHelpers_C_DisplayTutorialCard final
{
public:
	struct FS_TutorialCardParameters              TutorialCardParameters;                            // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             Event;                                             // 0x0020(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_TutorialSystemComponent_C*          CallFunc_GetTutorialSystemComponent_ReturnValue;   // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UBP_TutorialListener_CardCompletedDispatcher_C* CallFunc_SpawnObject_ReturnValue;          // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_TutorialListenerInterface_C> CallFunc_AddTutorialListener_Listener_CastInput; // 0x0048(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FL_TutorialHelpers_C_DisplayTutorialCard) == 0x000008, "Wrong alignment on BP_FL_TutorialHelpers_C_DisplayTutorialCard");
static_assert(sizeof(BP_FL_TutorialHelpers_C_DisplayTutorialCard) == 0x000058, "Wrong size on BP_FL_TutorialHelpers_C_DisplayTutorialCard");
static_assert(offsetof(BP_FL_TutorialHelpers_C_DisplayTutorialCard, TutorialCardParameters) == 0x000000, "Member 'BP_FL_TutorialHelpers_C_DisplayTutorialCard::TutorialCardParameters' has a wrong offset!");
static_assert(offsetof(BP_FL_TutorialHelpers_C_DisplayTutorialCard, Event) == 0x000020, "Member 'BP_FL_TutorialHelpers_C_DisplayTutorialCard::Event' has a wrong offset!");
static_assert(offsetof(BP_FL_TutorialHelpers_C_DisplayTutorialCard, __WorldContext) == 0x000030, "Member 'BP_FL_TutorialHelpers_C_DisplayTutorialCard::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_FL_TutorialHelpers_C_DisplayTutorialCard, CallFunc_GetTutorialSystemComponent_ReturnValue) == 0x000038, "Member 'BP_FL_TutorialHelpers_C_DisplayTutorialCard::CallFunc_GetTutorialSystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FL_TutorialHelpers_C_DisplayTutorialCard, CallFunc_SpawnObject_ReturnValue) == 0x000040, "Member 'BP_FL_TutorialHelpers_C_DisplayTutorialCard::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FL_TutorialHelpers_C_DisplayTutorialCard, CallFunc_AddTutorialListener_Listener_CastInput) == 0x000048, "Member 'BP_FL_TutorialHelpers_C_DisplayTutorialCard::CallFunc_AddTutorialListener_Listener_CastInput' has a wrong offset!");

// Function BP_FL_TutorialHelpers.BP_FL_TutorialHelpers_C.AreTutorialsEnabled
// 0x0020 (0x0020 - 0x0000)
struct BP_FL_TutorialHelpers_C_AreTutorialsEnabled final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_TutorialSystemComponent_C*          CallFunc_GetTutorialSystemComponent_ReturnValue;   // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AreTutorialsEnabled_ReturnValue;          // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FL_TutorialHelpers_C_AreTutorialsEnabled) == 0x000008, "Wrong alignment on BP_FL_TutorialHelpers_C_AreTutorialsEnabled");
static_assert(sizeof(BP_FL_TutorialHelpers_C_AreTutorialsEnabled) == 0x000020, "Wrong size on BP_FL_TutorialHelpers_C_AreTutorialsEnabled");
static_assert(offsetof(BP_FL_TutorialHelpers_C_AreTutorialsEnabled, __WorldContext) == 0x000000, "Member 'BP_FL_TutorialHelpers_C_AreTutorialsEnabled::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_FL_TutorialHelpers_C_AreTutorialsEnabled, ReturnValue) == 0x000008, "Member 'BP_FL_TutorialHelpers_C_AreTutorialsEnabled::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FL_TutorialHelpers_C_AreTutorialsEnabled, CallFunc_GetTutorialSystemComponent_ReturnValue) == 0x000010, "Member 'BP_FL_TutorialHelpers_C_AreTutorialsEnabled::CallFunc_GetTutorialSystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FL_TutorialHelpers_C_AreTutorialsEnabled, CallFunc_AreTutorialsEnabled_ReturnValue) == 0x000018, "Member 'BP_FL_TutorialHelpers_C_AreTutorialsEnabled::CallFunc_AreTutorialsEnabled_ReturnValue' has a wrong offset!");

// Function BP_FL_TutorialHelpers.BP_FL_TutorialHelpers_C.GetTutorialSystemComponent
// 0x0020 (0x0020 - 0x0000)
struct BP_FL_TutorialHelpers_C_GetTutorialSystemComponent final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_TutorialSystemComponent_C*          ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_TutorialSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FL_TutorialHelpers_C_GetTutorialSystemComponent) == 0x000008, "Wrong alignment on BP_FL_TutorialHelpers_C_GetTutorialSystemComponent");
static_assert(sizeof(BP_FL_TutorialHelpers_C_GetTutorialSystemComponent) == 0x000020, "Wrong size on BP_FL_TutorialHelpers_C_GetTutorialSystemComponent");
static_assert(offsetof(BP_FL_TutorialHelpers_C_GetTutorialSystemComponent, __WorldContext) == 0x000000, "Member 'BP_FL_TutorialHelpers_C_GetTutorialSystemComponent::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_FL_TutorialHelpers_C_GetTutorialSystemComponent, ReturnValue) == 0x000008, "Member 'BP_FL_TutorialHelpers_C_GetTutorialSystemComponent::ReturnValue' has a wrong offset!");
