#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FacialAnimationComponent

#include "Basic.hpp"

#include "E_Facial_LookAt_structs.hpp"
#include "E_FacialExpressionsNPC_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_FacialAnimationComponent.BP_FacialAnimationComponent_C
// 0x0008 (0x00A8 - 0x00A0)
class UBP_FacialAnimationComponent_C final : public UActorComponent
{
public:
	bool                                          Talking;                                           // 0x00A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_FacialExpressionsNPC                        FacialExpression;                                  // 0x00A1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_Facial_LookAt                               EyesLook;                                          // 0x00A2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_FacialAnimationComponent_C">();
	}
	static class UBP_FacialAnimationComponent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_FacialAnimationComponent_C>();
	}
};
static_assert(alignof(UBP_FacialAnimationComponent_C) == 0x000008, "Wrong alignment on UBP_FacialAnimationComponent_C");
static_assert(sizeof(UBP_FacialAnimationComponent_C) == 0x0000A8, "Wrong size on UBP_FacialAnimationComponent_C");
static_assert(offsetof(UBP_FacialAnimationComponent_C, Talking) == 0x0000A0, "Member 'UBP_FacialAnimationComponent_C::Talking' has a wrong offset!");
static_assert(offsetof(UBP_FacialAnimationComponent_C, FacialExpression) == 0x0000A1, "Member 'UBP_FacialAnimationComponent_C::FacialExpression' has a wrong offset!");
static_assert(offsetof(UBP_FacialAnimationComponent_C, EyesLook) == 0x0000A2, "Member 'UBP_FacialAnimationComponent_C::EyesLook' has a wrong offset!");

}

