#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FL_GameFlowHelpers

#include "Basic.hpp"

#include "FLevelDataEntry_structs.hpp"
#include "S_GameFlowTransitionRequest_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function BP_FL_GameFlowHelpers.BP_FL_GameFlowHelpers_C.ReleaseAndWaitGameFlowTransitionFadeOut
// 0x0020 (0x0020 - 0x0000)
struct BP_FL_GameFlowHelpers_C_ReleaseAndWaitGameFlowTransitionFadeOut final
{
public:
	double                                        OverrideFadeOutTransition;                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USF_BlueprintLatentAction*              LatentAction;                                      // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_LatentAction_WaitForGameflowTransitionFadeOut_C* CallFunc_SpawnObject_ReturnValue;     // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FL_GameFlowHelpers_C_ReleaseAndWaitGameFlowTransitionFadeOut) == 0x000008, "Wrong alignment on BP_FL_GameFlowHelpers_C_ReleaseAndWaitGameFlowTransitionFadeOut");
static_assert(sizeof(BP_FL_GameFlowHelpers_C_ReleaseAndWaitGameFlowTransitionFadeOut) == 0x000020, "Wrong size on BP_FL_GameFlowHelpers_C_ReleaseAndWaitGameFlowTransitionFadeOut");
static_assert(offsetof(BP_FL_GameFlowHelpers_C_ReleaseAndWaitGameFlowTransitionFadeOut, OverrideFadeOutTransition) == 0x000000, "Member 'BP_FL_GameFlowHelpers_C_ReleaseAndWaitGameFlowTransitionFadeOut::OverrideFadeOutTransition' has a wrong offset!");
static_assert(offsetof(BP_FL_GameFlowHelpers_C_ReleaseAndWaitGameFlowTransitionFadeOut, __WorldContext) == 0x000008, "Member 'BP_FL_GameFlowHelpers_C_ReleaseAndWaitGameFlowTransitionFadeOut::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_FL_GameFlowHelpers_C_ReleaseAndWaitGameFlowTransitionFadeOut, LatentAction) == 0x000010, "Member 'BP_FL_GameFlowHelpers_C_ReleaseAndWaitGameFlowTransitionFadeOut::LatentAction' has a wrong offset!");
static_assert(offsetof(BP_FL_GameFlowHelpers_C_ReleaseAndWaitGameFlowTransitionFadeOut, CallFunc_SpawnObject_ReturnValue) == 0x000018, "Member 'BP_FL_GameFlowHelpers_C_ReleaseAndWaitGameFlowTransitionFadeOut::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");

// Function BP_FL_GameFlowHelpers.BP_FL_GameFlowHelpers_C.ReleaseAndWaitGameFlowTransition
// 0x0020 (0x0020 - 0x0000)
struct BP_FL_GameFlowHelpers_C_ReleaseAndWaitGameFlowTransition final
{
public:
	double                                        OverrideFadeOutTransition;                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USF_BlueprintLatentAction*              LatentAction;                                      // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_LatentAction_WaitForGameflowTransition_C* CallFunc_SpawnObject_ReturnValue;            // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FL_GameFlowHelpers_C_ReleaseAndWaitGameFlowTransition) == 0x000008, "Wrong alignment on BP_FL_GameFlowHelpers_C_ReleaseAndWaitGameFlowTransition");
static_assert(sizeof(BP_FL_GameFlowHelpers_C_ReleaseAndWaitGameFlowTransition) == 0x000020, "Wrong size on BP_FL_GameFlowHelpers_C_ReleaseAndWaitGameFlowTransition");
static_assert(offsetof(BP_FL_GameFlowHelpers_C_ReleaseAndWaitGameFlowTransition, OverrideFadeOutTransition) == 0x000000, "Member 'BP_FL_GameFlowHelpers_C_ReleaseAndWaitGameFlowTransition::OverrideFadeOutTransition' has a wrong offset!");
static_assert(offsetof(BP_FL_GameFlowHelpers_C_ReleaseAndWaitGameFlowTransition, __WorldContext) == 0x000008, "Member 'BP_FL_GameFlowHelpers_C_ReleaseAndWaitGameFlowTransition::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_FL_GameFlowHelpers_C_ReleaseAndWaitGameFlowTransition, LatentAction) == 0x000010, "Member 'BP_FL_GameFlowHelpers_C_ReleaseAndWaitGameFlowTransition::LatentAction' has a wrong offset!");
static_assert(offsetof(BP_FL_GameFlowHelpers_C_ReleaseAndWaitGameFlowTransition, CallFunc_SpawnObject_ReturnValue) == 0x000018, "Member 'BP_FL_GameFlowHelpers_C_ReleaseAndWaitGameFlowTransition::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");

// Function BP_FL_GameFlowHelpers.BP_FL_GameFlowHelpers_C.ReleaseGameFlowTransition
// 0x0018 (0x0018 - 0x0000)
struct BP_FL_GameFlowHelpers_C_ReleaseGameFlowTransition final
{
public:
	double                                        OverrideFadeOutTransition;                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_GameFlowTransitionSystem_C*         CallFunc_GetGameFlowTransitionSystem_GameFlowTransitionSystem; // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FL_GameFlowHelpers_C_ReleaseGameFlowTransition) == 0x000008, "Wrong alignment on BP_FL_GameFlowHelpers_C_ReleaseGameFlowTransition");
static_assert(sizeof(BP_FL_GameFlowHelpers_C_ReleaseGameFlowTransition) == 0x000018, "Wrong size on BP_FL_GameFlowHelpers_C_ReleaseGameFlowTransition");
static_assert(offsetof(BP_FL_GameFlowHelpers_C_ReleaseGameFlowTransition, OverrideFadeOutTransition) == 0x000000, "Member 'BP_FL_GameFlowHelpers_C_ReleaseGameFlowTransition::OverrideFadeOutTransition' has a wrong offset!");
static_assert(offsetof(BP_FL_GameFlowHelpers_C_ReleaseGameFlowTransition, __WorldContext) == 0x000008, "Member 'BP_FL_GameFlowHelpers_C_ReleaseGameFlowTransition::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_FL_GameFlowHelpers_C_ReleaseGameFlowTransition, CallFunc_GetGameFlowTransitionSystem_GameFlowTransitionSystem) == 0x000010, "Member 'BP_FL_GameFlowHelpers_C_ReleaseGameFlowTransition::CallFunc_GetGameFlowTransitionSystem_GameFlowTransitionSystem' has a wrong offset!");

// Function BP_FL_GameFlowHelpers.BP_FL_GameFlowHelpers_C.HoldGameFlowTransition
// 0x0010 (0x0010 - 0x0000)
struct BP_FL_GameFlowHelpers_C_HoldGameFlowTransition final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_GameFlowTransitionSystem_C*         CallFunc_GetGameFlowTransitionSystem_GameFlowTransitionSystem; // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FL_GameFlowHelpers_C_HoldGameFlowTransition) == 0x000008, "Wrong alignment on BP_FL_GameFlowHelpers_C_HoldGameFlowTransition");
static_assert(sizeof(BP_FL_GameFlowHelpers_C_HoldGameFlowTransition) == 0x000010, "Wrong size on BP_FL_GameFlowHelpers_C_HoldGameFlowTransition");
static_assert(offsetof(BP_FL_GameFlowHelpers_C_HoldGameFlowTransition, __WorldContext) == 0x000000, "Member 'BP_FL_GameFlowHelpers_C_HoldGameFlowTransition::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_FL_GameFlowHelpers_C_HoldGameFlowTransition, CallFunc_GetGameFlowTransitionSystem_GameFlowTransitionSystem) == 0x000008, "Member 'BP_FL_GameFlowHelpers_C_HoldGameFlowTransition::CallFunc_GetGameFlowTransitionSystem_GameFlowTransitionSystem' has a wrong offset!");

// Function BP_FL_GameFlowHelpers.BP_FL_GameFlowHelpers_C.RequestGameFlowTransition
// 0x0020 (0x0020 - 0x0000)
struct BP_FL_GameFlowHelpers_C_RequestGameFlowTransition final
{
public:
	struct FS_GameFlowTransitionRequest           TransitionRequest;                                 // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_GameFlowTransitionSystem_C*         CallFunc_GetGameFlowTransitionSystem_GameFlowTransitionSystem; // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FL_GameFlowHelpers_C_RequestGameFlowTransition) == 0x000008, "Wrong alignment on BP_FL_GameFlowHelpers_C_RequestGameFlowTransition");
static_assert(sizeof(BP_FL_GameFlowHelpers_C_RequestGameFlowTransition) == 0x000020, "Wrong size on BP_FL_GameFlowHelpers_C_RequestGameFlowTransition");
static_assert(offsetof(BP_FL_GameFlowHelpers_C_RequestGameFlowTransition, TransitionRequest) == 0x000000, "Member 'BP_FL_GameFlowHelpers_C_RequestGameFlowTransition::TransitionRequest' has a wrong offset!");
static_assert(offsetof(BP_FL_GameFlowHelpers_C_RequestGameFlowTransition, __WorldContext) == 0x000010, "Member 'BP_FL_GameFlowHelpers_C_RequestGameFlowTransition::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_FL_GameFlowHelpers_C_RequestGameFlowTransition, CallFunc_GetGameFlowTransitionSystem_GameFlowTransitionSystem) == 0x000018, "Member 'BP_FL_GameFlowHelpers_C_RequestGameFlowTransition::CallFunc_GetGameFlowTransitionSystem_GameFlowTransitionSystem' has a wrong offset!");

// Function BP_FL_GameFlowHelpers.BP_FL_GameFlowHelpers_C.GetGameFlowTransitionSystem
// 0x0020 (0x0020 - 0x0000)
struct BP_FL_GameFlowHelpers_C_GetGameFlowTransitionSystem final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_GameFlowTransitionSystem_C*         GameFlowTransitionSystem;                          // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue;                  // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_GameFlowTransitionSystem_C*         CallFunc_GetComponentByClass_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FL_GameFlowHelpers_C_GetGameFlowTransitionSystem) == 0x000008, "Wrong alignment on BP_FL_GameFlowHelpers_C_GetGameFlowTransitionSystem");
static_assert(sizeof(BP_FL_GameFlowHelpers_C_GetGameFlowTransitionSystem) == 0x000020, "Wrong size on BP_FL_GameFlowHelpers_C_GetGameFlowTransitionSystem");
static_assert(offsetof(BP_FL_GameFlowHelpers_C_GetGameFlowTransitionSystem, __WorldContext) == 0x000000, "Member 'BP_FL_GameFlowHelpers_C_GetGameFlowTransitionSystem::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_FL_GameFlowHelpers_C_GetGameFlowTransitionSystem, GameFlowTransitionSystem) == 0x000008, "Member 'BP_FL_GameFlowHelpers_C_GetGameFlowTransitionSystem::GameFlowTransitionSystem' has a wrong offset!");
static_assert(offsetof(BP_FL_GameFlowHelpers_C_GetGameFlowTransitionSystem, CallFunc_GetGameMode_ReturnValue) == 0x000010, "Member 'BP_FL_GameFlowHelpers_C_GetGameFlowTransitionSystem::CallFunc_GetGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FL_GameFlowHelpers_C_GetGameFlowTransitionSystem, CallFunc_GetComponentByClass_ReturnValue) == 0x000018, "Member 'BP_FL_GameFlowHelpers_C_GetGameFlowTransitionSystem::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");

// Function BP_FL_GameFlowHelpers.BP_FL_GameFlowHelpers_C.GetProjectConfiguration
// 0x0040 (0x0040 - 0x0000)
struct BP_FL_GameFlowHelpers_C_GetProjectConfiguration final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_DataAsset_ProjectConfiguration_C*   ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPackagedBuild_ReturnValue;              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInPlayMode_ReturnValue;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_DataAsset_ProjectConfiguration_C*   K2Node_DynamicCast_AsBP_Data_Asset_Project_Configuration; // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_jRPG_GI_Custom_C*                   CallFunc_GetCustomGI_ReturnValue;                  // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FL_GameFlowHelpers_C_GetProjectConfiguration) == 0x000008, "Wrong alignment on BP_FL_GameFlowHelpers_C_GetProjectConfiguration");
static_assert(sizeof(BP_FL_GameFlowHelpers_C_GetProjectConfiguration) == 0x000040, "Wrong size on BP_FL_GameFlowHelpers_C_GetProjectConfiguration");
static_assert(offsetof(BP_FL_GameFlowHelpers_C_GetProjectConfiguration, __WorldContext) == 0x000000, "Member 'BP_FL_GameFlowHelpers_C_GetProjectConfiguration::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_FL_GameFlowHelpers_C_GetProjectConfiguration, ReturnValue) == 0x000008, "Member 'BP_FL_GameFlowHelpers_C_GetProjectConfiguration::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FL_GameFlowHelpers_C_GetProjectConfiguration, CallFunc_IsPackagedBuild_ReturnValue) == 0x000010, "Member 'BP_FL_GameFlowHelpers_C_GetProjectConfiguration::CallFunc_IsPackagedBuild_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FL_GameFlowHelpers_C_GetProjectConfiguration, CallFunc_LoadAsset_Blocking_ReturnValue) == 0x000018, "Member 'BP_FL_GameFlowHelpers_C_GetProjectConfiguration::CallFunc_LoadAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FL_GameFlowHelpers_C_GetProjectConfiguration, CallFunc_IsInPlayMode_ReturnValue) == 0x000020, "Member 'BP_FL_GameFlowHelpers_C_GetProjectConfiguration::CallFunc_IsInPlayMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FL_GameFlowHelpers_C_GetProjectConfiguration, K2Node_DynamicCast_AsBP_Data_Asset_Project_Configuration) == 0x000028, "Member 'BP_FL_GameFlowHelpers_C_GetProjectConfiguration::K2Node_DynamicCast_AsBP_Data_Asset_Project_Configuration' has a wrong offset!");
static_assert(offsetof(BP_FL_GameFlowHelpers_C_GetProjectConfiguration, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'BP_FL_GameFlowHelpers_C_GetProjectConfiguration::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_FL_GameFlowHelpers_C_GetProjectConfiguration, CallFunc_GetCustomGI_ReturnValue) == 0x000038, "Member 'BP_FL_GameFlowHelpers_C_GetProjectConfiguration::CallFunc_GetCustomGI_ReturnValue' has a wrong offset!");

// Function BP_FL_GameFlowHelpers.BP_FL_GameFlowHelpers_C.GetDemoLevelData
// 0x0038 (0x0038 - 0x0000)
struct BP_FL_GameFlowHelpers_C_GetDemoLevelData final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UWorld>                  LevelDestination;                                  // 0x0008(0x0028)(ConstParm, Parm, OutParm, UObjectWrapper, HasGetValueTypeHash)
	struct FGameplayTag                           SpawnPointTag;                                     // 0x0030(0x0008)(Parm, OutParm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FL_GameFlowHelpers_C_GetDemoLevelData) == 0x000008, "Wrong alignment on BP_FL_GameFlowHelpers_C_GetDemoLevelData");
static_assert(sizeof(BP_FL_GameFlowHelpers_C_GetDemoLevelData) == 0x000038, "Wrong size on BP_FL_GameFlowHelpers_C_GetDemoLevelData");
static_assert(offsetof(BP_FL_GameFlowHelpers_C_GetDemoLevelData, __WorldContext) == 0x000000, "Member 'BP_FL_GameFlowHelpers_C_GetDemoLevelData::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_FL_GameFlowHelpers_C_GetDemoLevelData, LevelDestination) == 0x000008, "Member 'BP_FL_GameFlowHelpers_C_GetDemoLevelData::LevelDestination' has a wrong offset!");
static_assert(offsetof(BP_FL_GameFlowHelpers_C_GetDemoLevelData, SpawnPointTag) == 0x000030, "Member 'BP_FL_GameFlowHelpers_C_GetDemoLevelData::SpawnPointTag' has a wrong offset!");

// Function BP_FL_GameFlowHelpers.BP_FL_GameFlowHelpers_C.IsInWorldMap
// 0x01D0 (0x01D0 - 0x0000)
struct BP_FL_GameFlowHelpers_C_IsInWorldMap final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FindCurrentLevelData_Found;               // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFLevelDataEntry                       CallFunc_FindCurrentLevelData_LevelData;           // 0x0010(0x01B0)(HasGetValueTypeHash)
	class FName                                   CallFunc_FindCurrentLevelData_RowName;             // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x01C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FL_GameFlowHelpers_C_IsInWorldMap) == 0x000008, "Wrong alignment on BP_FL_GameFlowHelpers_C_IsInWorldMap");
static_assert(sizeof(BP_FL_GameFlowHelpers_C_IsInWorldMap) == 0x0001D0, "Wrong size on BP_FL_GameFlowHelpers_C_IsInWorldMap");
static_assert(offsetof(BP_FL_GameFlowHelpers_C_IsInWorldMap, __WorldContext) == 0x000000, "Member 'BP_FL_GameFlowHelpers_C_IsInWorldMap::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_FL_GameFlowHelpers_C_IsInWorldMap, Result) == 0x000008, "Member 'BP_FL_GameFlowHelpers_C_IsInWorldMap::Result' has a wrong offset!");
static_assert(offsetof(BP_FL_GameFlowHelpers_C_IsInWorldMap, CallFunc_FindCurrentLevelData_Found) == 0x000009, "Member 'BP_FL_GameFlowHelpers_C_IsInWorldMap::CallFunc_FindCurrentLevelData_Found' has a wrong offset!");
static_assert(offsetof(BP_FL_GameFlowHelpers_C_IsInWorldMap, CallFunc_FindCurrentLevelData_LevelData) == 0x000010, "Member 'BP_FL_GameFlowHelpers_C_IsInWorldMap::CallFunc_FindCurrentLevelData_LevelData' has a wrong offset!");
static_assert(offsetof(BP_FL_GameFlowHelpers_C_IsInWorldMap, CallFunc_FindCurrentLevelData_RowName) == 0x0001C0, "Member 'BP_FL_GameFlowHelpers_C_IsInWorldMap::CallFunc_FindCurrentLevelData_RowName' has a wrong offset!");
static_assert(offsetof(BP_FL_GameFlowHelpers_C_IsInWorldMap, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0001C8, "Member 'BP_FL_GameFlowHelpers_C_IsInWorldMap::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FL_GameFlowHelpers_C_IsInWorldMap, CallFunc_BooleanAND_ReturnValue) == 0x0001C9, "Member 'BP_FL_GameFlowHelpers_C_IsInWorldMap::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BP_FL_GameFlowHelpers.BP_FL_GameFlowHelpers_C.IsTransitionRequestValid
// 0x0020 (0x0020 - 0x0000)
struct BP_FL_GameFlowHelpers_C_IsTransitionRequestValid final
{
public:
	struct FS_GameFlowTransitionRequest           GameFlowTransitionRequest;                         // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          IsValid;                                           // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FL_GameFlowHelpers_C_IsTransitionRequestValid) == 0x000008, "Wrong alignment on BP_FL_GameFlowHelpers_C_IsTransitionRequestValid");
static_assert(sizeof(BP_FL_GameFlowHelpers_C_IsTransitionRequestValid) == 0x000020, "Wrong size on BP_FL_GameFlowHelpers_C_IsTransitionRequestValid");
static_assert(offsetof(BP_FL_GameFlowHelpers_C_IsTransitionRequestValid, GameFlowTransitionRequest) == 0x000000, "Member 'BP_FL_GameFlowHelpers_C_IsTransitionRequestValid::GameFlowTransitionRequest' has a wrong offset!");
static_assert(offsetof(BP_FL_GameFlowHelpers_C_IsTransitionRequestValid, __WorldContext) == 0x000010, "Member 'BP_FL_GameFlowHelpers_C_IsTransitionRequestValid::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_FL_GameFlowHelpers_C_IsTransitionRequestValid, IsValid) == 0x000018, "Member 'BP_FL_GameFlowHelpers_C_IsTransitionRequestValid::IsValid' has a wrong offset!");
static_assert(offsetof(BP_FL_GameFlowHelpers_C_IsTransitionRequestValid, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000019, "Member 'BP_FL_GameFlowHelpers_C_IsTransitionRequestValid::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");

}

