#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FL_RelationshipHelpers

#include "Basic.hpp"

#include "E_CharacterList_structs.hpp"


namespace SDK::Params
{

// Function BP_FL_RelationshipHelpers.BP_FL_RelationshipHelpers_C.SetCurrentRelationshipLevel
// 0x0018 (0x0018 - 0x0000)
struct BP_FL_RelationshipHelpers_C_SetCurrentRelationshipLevel final
{
public:
	E_CharacterList                               Character;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Level;                                             // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_RelationshipSystem_C*               CallFunc_GetRelationshipSystem_RelationshipSystem; // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FL_RelationshipHelpers_C_SetCurrentRelationshipLevel) == 0x000008, "Wrong alignment on BP_FL_RelationshipHelpers_C_SetCurrentRelationshipLevel");
static_assert(sizeof(BP_FL_RelationshipHelpers_C_SetCurrentRelationshipLevel) == 0x000018, "Wrong size on BP_FL_RelationshipHelpers_C_SetCurrentRelationshipLevel");
static_assert(offsetof(BP_FL_RelationshipHelpers_C_SetCurrentRelationshipLevel, Character) == 0x000000, "Member 'BP_FL_RelationshipHelpers_C_SetCurrentRelationshipLevel::Character' has a wrong offset!");
static_assert(offsetof(BP_FL_RelationshipHelpers_C_SetCurrentRelationshipLevel, Level) == 0x000004, "Member 'BP_FL_RelationshipHelpers_C_SetCurrentRelationshipLevel::Level' has a wrong offset!");
static_assert(offsetof(BP_FL_RelationshipHelpers_C_SetCurrentRelationshipLevel, __WorldContext) == 0x000008, "Member 'BP_FL_RelationshipHelpers_C_SetCurrentRelationshipLevel::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_FL_RelationshipHelpers_C_SetCurrentRelationshipLevel, CallFunc_GetRelationshipSystem_RelationshipSystem) == 0x000010, "Member 'BP_FL_RelationshipHelpers_C_SetCurrentRelationshipLevel::CallFunc_GetRelationshipSystem_RelationshipSystem' has a wrong offset!");

// Function BP_FL_RelationshipHelpers.BP_FL_RelationshipHelpers_C.GetCurrentRelationshipLevel
// 0x0028 (0x0028 - 0x0000)
struct BP_FL_RelationshipHelpers_C_GetCurrentRelationshipLevel final
{
public:
	E_CharacterList                               Character;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Level;                                             // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_RelationshipSystem_C*               CallFunc_GetRelationshipSystem_RelationshipSystem; // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCurrentRelationshipLevel_Level;        // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FL_RelationshipHelpers_C_GetCurrentRelationshipLevel) == 0x000008, "Wrong alignment on BP_FL_RelationshipHelpers_C_GetCurrentRelationshipLevel");
static_assert(sizeof(BP_FL_RelationshipHelpers_C_GetCurrentRelationshipLevel) == 0x000028, "Wrong size on BP_FL_RelationshipHelpers_C_GetCurrentRelationshipLevel");
static_assert(offsetof(BP_FL_RelationshipHelpers_C_GetCurrentRelationshipLevel, Character) == 0x000000, "Member 'BP_FL_RelationshipHelpers_C_GetCurrentRelationshipLevel::Character' has a wrong offset!");
static_assert(offsetof(BP_FL_RelationshipHelpers_C_GetCurrentRelationshipLevel, __WorldContext) == 0x000008, "Member 'BP_FL_RelationshipHelpers_C_GetCurrentRelationshipLevel::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_FL_RelationshipHelpers_C_GetCurrentRelationshipLevel, Level) == 0x000010, "Member 'BP_FL_RelationshipHelpers_C_GetCurrentRelationshipLevel::Level' has a wrong offset!");
static_assert(offsetof(BP_FL_RelationshipHelpers_C_GetCurrentRelationshipLevel, CallFunc_GetRelationshipSystem_RelationshipSystem) == 0x000018, "Member 'BP_FL_RelationshipHelpers_C_GetCurrentRelationshipLevel::CallFunc_GetRelationshipSystem_RelationshipSystem' has a wrong offset!");
static_assert(offsetof(BP_FL_RelationshipHelpers_C_GetCurrentRelationshipLevel, CallFunc_GetCurrentRelationshipLevel_Level) == 0x000020, "Member 'BP_FL_RelationshipHelpers_C_GetCurrentRelationshipLevel::CallFunc_GetCurrentRelationshipLevel_Level' has a wrong offset!");

// Function BP_FL_RelationshipHelpers.BP_FL_RelationshipHelpers_C.GetRelationshipSystem
// 0x0018 (0x0018 - 0x0000)
struct BP_FL_RelationshipHelpers_C_GetRelationshipSystem final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_RelationshipSystem_C*               RelationshipSystem;                                // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_jRPG_GI_Custom_C*                   CallFunc_GetCustomGI_ReturnValue;                  // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FL_RelationshipHelpers_C_GetRelationshipSystem) == 0x000008, "Wrong alignment on BP_FL_RelationshipHelpers_C_GetRelationshipSystem");
static_assert(sizeof(BP_FL_RelationshipHelpers_C_GetRelationshipSystem) == 0x000018, "Wrong size on BP_FL_RelationshipHelpers_C_GetRelationshipSystem");
static_assert(offsetof(BP_FL_RelationshipHelpers_C_GetRelationshipSystem, __WorldContext) == 0x000000, "Member 'BP_FL_RelationshipHelpers_C_GetRelationshipSystem::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_FL_RelationshipHelpers_C_GetRelationshipSystem, RelationshipSystem) == 0x000008, "Member 'BP_FL_RelationshipHelpers_C_GetRelationshipSystem::RelationshipSystem' has a wrong offset!");
static_assert(offsetof(BP_FL_RelationshipHelpers_C_GetRelationshipSystem, CallFunc_GetCustomGI_ReturnValue) == 0x000010, "Member 'BP_FL_RelationshipHelpers_C_GetRelationshipSystem::CallFunc_GetCustomGI_ReturnValue' has a wrong offset!");

}

