#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FL_GameDifficultyHelpers

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "E_GameDifficulty_structs.hpp"


namespace SDK::Params
{

// Function BP_FL_GameDifficultyHelpers.BP_FL_GameDifficultyHelpers_C.GetArchetypeScalingDataTableForBattle
// 0x0128 (0x0128 - 0x0000)
struct BP_FL_GameDifficultyHelpers_C_GetArchetypeScalingDataTableForBattle final
{
public:
	class UBP_DataAsset_EnemyBattleArchetype_C*   EnemyArchetype;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAC_jRPG_BattleManager_C*               BattleManager;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash)
	E_GameDifficulty                              CallFunc_GetCurrentBattleDifficulty_ReturnValue;   // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0048(0x0010)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0058(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0068(0x0048)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00B0(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00F8(0x0010)(ReferenceParm)
	class UDataTable*                             CallFunc_Map_Find_Value;                           // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Format_ReturnValue;                       // 0x0118(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FL_GameDifficultyHelpers_C_GetArchetypeScalingDataTableForBattle) == 0x000008, "Wrong alignment on BP_FL_GameDifficultyHelpers_C_GetArchetypeScalingDataTableForBattle");
static_assert(sizeof(BP_FL_GameDifficultyHelpers_C_GetArchetypeScalingDataTableForBattle) == 0x000128, "Wrong size on BP_FL_GameDifficultyHelpers_C_GetArchetypeScalingDataTableForBattle");
static_assert(offsetof(BP_FL_GameDifficultyHelpers_C_GetArchetypeScalingDataTableForBattle, EnemyArchetype) == 0x000000, "Member 'BP_FL_GameDifficultyHelpers_C_GetArchetypeScalingDataTableForBattle::EnemyArchetype' has a wrong offset!");
static_assert(offsetof(BP_FL_GameDifficultyHelpers_C_GetArchetypeScalingDataTableForBattle, BattleManager) == 0x000008, "Member 'BP_FL_GameDifficultyHelpers_C_GetArchetypeScalingDataTableForBattle::BattleManager' has a wrong offset!");
static_assert(offsetof(BP_FL_GameDifficultyHelpers_C_GetArchetypeScalingDataTableForBattle, __WorldContext) == 0x000010, "Member 'BP_FL_GameDifficultyHelpers_C_GetArchetypeScalingDataTableForBattle::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_FL_GameDifficultyHelpers_C_GetArchetypeScalingDataTableForBattle, ReturnValue) == 0x000018, "Member 'BP_FL_GameDifficultyHelpers_C_GetArchetypeScalingDataTableForBattle::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FL_GameDifficultyHelpers_C_GetArchetypeScalingDataTableForBattle, CallFunc_GetCurrentBattleDifficulty_ReturnValue) == 0x000020, "Member 'BP_FL_GameDifficultyHelpers_C_GetArchetypeScalingDataTableForBattle::CallFunc_GetCurrentBattleDifficulty_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FL_GameDifficultyHelpers_C_GetArchetypeScalingDataTableForBattle, CallFunc_GetDisplayName_ReturnValue) == 0x000028, "Member 'BP_FL_GameDifficultyHelpers_C_GetArchetypeScalingDataTableForBattle::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FL_GameDifficultyHelpers_C_GetArchetypeScalingDataTableForBattle, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x000038, "Member 'BP_FL_GameDifficultyHelpers_C_GetArchetypeScalingDataTableForBattle::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FL_GameDifficultyHelpers_C_GetArchetypeScalingDataTableForBattle, CallFunc_Conv_StringToText_ReturnValue) == 0x000048, "Member 'BP_FL_GameDifficultyHelpers_C_GetArchetypeScalingDataTableForBattle::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FL_GameDifficultyHelpers_C_GetArchetypeScalingDataTableForBattle, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000058, "Member 'BP_FL_GameDifficultyHelpers_C_GetArchetypeScalingDataTableForBattle::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FL_GameDifficultyHelpers_C_GetArchetypeScalingDataTableForBattle, K2Node_MakeStruct_FormatArgumentData) == 0x000068, "Member 'BP_FL_GameDifficultyHelpers_C_GetArchetypeScalingDataTableForBattle::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_FL_GameDifficultyHelpers_C_GetArchetypeScalingDataTableForBattle, K2Node_MakeStruct_FormatArgumentData_1) == 0x0000B0, "Member 'BP_FL_GameDifficultyHelpers_C_GetArchetypeScalingDataTableForBattle::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BP_FL_GameDifficultyHelpers_C_GetArchetypeScalingDataTableForBattle, K2Node_MakeArray_Array) == 0x0000F8, "Member 'BP_FL_GameDifficultyHelpers_C_GetArchetypeScalingDataTableForBattle::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_FL_GameDifficultyHelpers_C_GetArchetypeScalingDataTableForBattle, CallFunc_Map_Find_Value) == 0x000108, "Member 'BP_FL_GameDifficultyHelpers_C_GetArchetypeScalingDataTableForBattle::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BP_FL_GameDifficultyHelpers_C_GetArchetypeScalingDataTableForBattle, CallFunc_Map_Find_ReturnValue) == 0x000110, "Member 'BP_FL_GameDifficultyHelpers_C_GetArchetypeScalingDataTableForBattle::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FL_GameDifficultyHelpers_C_GetArchetypeScalingDataTableForBattle, CallFunc_Format_ReturnValue) == 0x000118, "Member 'BP_FL_GameDifficultyHelpers_C_GetArchetypeScalingDataTableForBattle::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function BP_FL_GameDifficultyHelpers.BP_FL_GameDifficultyHelpers_C.GetGameDifficulty
// 0x0020 (0x0020 - 0x0000)
struct BP_FL_GameDifficultyHelpers_C_GetGameDifficulty final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	E_GameDifficulty                              ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_GameDifficultyManager_C*            CallFunc_GetDifficultyManager_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	E_GameDifficulty                              CallFunc_GetCurrentDifficulty_ReturnValue;         // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FL_GameDifficultyHelpers_C_GetGameDifficulty) == 0x000008, "Wrong alignment on BP_FL_GameDifficultyHelpers_C_GetGameDifficulty");
static_assert(sizeof(BP_FL_GameDifficultyHelpers_C_GetGameDifficulty) == 0x000020, "Wrong size on BP_FL_GameDifficultyHelpers_C_GetGameDifficulty");
static_assert(offsetof(BP_FL_GameDifficultyHelpers_C_GetGameDifficulty, __WorldContext) == 0x000000, "Member 'BP_FL_GameDifficultyHelpers_C_GetGameDifficulty::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_FL_GameDifficultyHelpers_C_GetGameDifficulty, ReturnValue) == 0x000008, "Member 'BP_FL_GameDifficultyHelpers_C_GetGameDifficulty::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FL_GameDifficultyHelpers_C_GetGameDifficulty, CallFunc_GetDifficultyManager_ReturnValue) == 0x000010, "Member 'BP_FL_GameDifficultyHelpers_C_GetGameDifficulty::CallFunc_GetDifficultyManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FL_GameDifficultyHelpers_C_GetGameDifficulty, CallFunc_GetCurrentDifficulty_ReturnValue) == 0x000018, "Member 'BP_FL_GameDifficultyHelpers_C_GetGameDifficulty::CallFunc_GetCurrentDifficulty_ReturnValue' has a wrong offset!");

// Function BP_FL_GameDifficultyHelpers.BP_FL_GameDifficultyHelpers_C.GetDifficultyManager
// 0x0018 (0x0018 - 0x0000)
struct BP_FL_GameDifficultyHelpers_C_GetDifficultyManager final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_GameDifficultyManager_C*            ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash)
	class UBP_jRPG_GI_Custom_C*                   CallFunc_GetCustomGI_ReturnValue;                  // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FL_GameDifficultyHelpers_C_GetDifficultyManager) == 0x000008, "Wrong alignment on BP_FL_GameDifficultyHelpers_C_GetDifficultyManager");
static_assert(sizeof(BP_FL_GameDifficultyHelpers_C_GetDifficultyManager) == 0x000018, "Wrong size on BP_FL_GameDifficultyHelpers_C_GetDifficultyManager");
static_assert(offsetof(BP_FL_GameDifficultyHelpers_C_GetDifficultyManager, __WorldContext) == 0x000000, "Member 'BP_FL_GameDifficultyHelpers_C_GetDifficultyManager::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_FL_GameDifficultyHelpers_C_GetDifficultyManager, ReturnValue) == 0x000008, "Member 'BP_FL_GameDifficultyHelpers_C_GetDifficultyManager::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FL_GameDifficultyHelpers_C_GetDifficultyManager, CallFunc_GetCustomGI_ReturnValue) == 0x000010, "Member 'BP_FL_GameDifficultyHelpers_C_GetDifficultyManager::CallFunc_GetCustomGI_ReturnValue' has a wrong offset!");

}

