#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FL_SaveGameHelpers

#include "Basic.hpp"

#include "E_SaveManagerLoadingStatus_structs.hpp"
#include "S_jRPG_Item_DynamicData_structs.hpp"
#include "S_jRPG_Item_StaticData_structs.hpp"
#include "S_LoadGameRequest_structs.hpp"


namespace SDK::Params
{

// Function BP_FL_SaveGameHelpers.BP_FL_SaveGameHelpers_C.CreateModalPopupFromLoadingError
// 0x0038 (0x0038 - 0x0000)
struct BP_FL_SaveGameHelpers_C_CreateModalPopupFromLoadingError final
{
public:
	class UBP_LatentAction_LoadGame_C*            LoadGameLatentAction;                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_ModalPopup_C*                      ModalPopup;                                        // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_ModalPopup_C*                      CallFunc_CreateModalWindow_OutputPin;              // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_ModalPopup_C*                      CallFunc_CreateModalWindow_OutputPin_1;            // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_ModalPopup_C*                      CallFunc_CreateModalWindow_OutputPin_2;            // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	E_SaveManagerLoadingStatus                    CallFunc_GetStatus_ReturnValue;                    // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FL_SaveGameHelpers_C_CreateModalPopupFromLoadingError) == 0x000008, "Wrong alignment on BP_FL_SaveGameHelpers_C_CreateModalPopupFromLoadingError");
static_assert(sizeof(BP_FL_SaveGameHelpers_C_CreateModalPopupFromLoadingError) == 0x000038, "Wrong size on BP_FL_SaveGameHelpers_C_CreateModalPopupFromLoadingError");
static_assert(offsetof(BP_FL_SaveGameHelpers_C_CreateModalPopupFromLoadingError, LoadGameLatentAction) == 0x000000, "Member 'BP_FL_SaveGameHelpers_C_CreateModalPopupFromLoadingError::LoadGameLatentAction' has a wrong offset!");
static_assert(offsetof(BP_FL_SaveGameHelpers_C_CreateModalPopupFromLoadingError, __WorldContext) == 0x000008, "Member 'BP_FL_SaveGameHelpers_C_CreateModalPopupFromLoadingError::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_FL_SaveGameHelpers_C_CreateModalPopupFromLoadingError, ModalPopup) == 0x000010, "Member 'BP_FL_SaveGameHelpers_C_CreateModalPopupFromLoadingError::ModalPopup' has a wrong offset!");
static_assert(offsetof(BP_FL_SaveGameHelpers_C_CreateModalPopupFromLoadingError, CallFunc_CreateModalWindow_OutputPin) == 0x000018, "Member 'BP_FL_SaveGameHelpers_C_CreateModalPopupFromLoadingError::CallFunc_CreateModalWindow_OutputPin' has a wrong offset!");
static_assert(offsetof(BP_FL_SaveGameHelpers_C_CreateModalPopupFromLoadingError, CallFunc_CreateModalWindow_OutputPin_1) == 0x000020, "Member 'BP_FL_SaveGameHelpers_C_CreateModalPopupFromLoadingError::CallFunc_CreateModalWindow_OutputPin_1' has a wrong offset!");
static_assert(offsetof(BP_FL_SaveGameHelpers_C_CreateModalPopupFromLoadingError, CallFunc_CreateModalWindow_OutputPin_2) == 0x000028, "Member 'BP_FL_SaveGameHelpers_C_CreateModalPopupFromLoadingError::CallFunc_CreateModalWindow_OutputPin_2' has a wrong offset!");
static_assert(offsetof(BP_FL_SaveGameHelpers_C_CreateModalPopupFromLoadingError, CallFunc_GetStatus_ReturnValue) == 0x000030, "Member 'BP_FL_SaveGameHelpers_C_CreateModalPopupFromLoadingError::CallFunc_GetStatus_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FL_SaveGameHelpers_C_CreateModalPopupFromLoadingError, K2Node_SwitchEnum_CmpSuccess) == 0x000031, "Member 'BP_FL_SaveGameHelpers_C_CreateModalPopupFromLoadingError::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_FL_SaveGameHelpers_C_CreateModalPopupFromLoadingError, CallFunc_IsValid_ReturnValue) == 0x000032, "Member 'BP_FL_SaveGameHelpers_C_CreateModalPopupFromLoadingError::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_FL_SaveGameHelpers.BP_FL_SaveGameHelpers_C.GetSaveUpgraderDataTable
// 0x0010 (0x0010 - 0x0000)
struct BP_FL_SaveGameHelpers_C_GetSaveUpgraderDataTable final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FL_SaveGameHelpers_C_GetSaveUpgraderDataTable) == 0x000008, "Wrong alignment on BP_FL_SaveGameHelpers_C_GetSaveUpgraderDataTable");
static_assert(sizeof(BP_FL_SaveGameHelpers_C_GetSaveUpgraderDataTable) == 0x000010, "Wrong size on BP_FL_SaveGameHelpers_C_GetSaveUpgraderDataTable");
static_assert(offsetof(BP_FL_SaveGameHelpers_C_GetSaveUpgraderDataTable, __WorldContext) == 0x000000, "Member 'BP_FL_SaveGameHelpers_C_GetSaveUpgraderDataTable::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_FL_SaveGameHelpers_C_GetSaveUpgraderDataTable, ReturnValue) == 0x000008, "Member 'BP_FL_SaveGameHelpers_C_GetSaveUpgraderDataTable::ReturnValue' has a wrong offset!");

// Function BP_FL_SaveGameHelpers.BP_FL_SaveGameHelpers_C.GetSaveManager
// 0x0018 (0x0018 - 0x0000)
struct BP_FL_SaveGameHelpers_C_GetSaveManager final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_SaveManager_C*                      SaveManager;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_jRPG_GI_Custom_C*                   CallFunc_GetCustomGI_ReturnValue;                  // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FL_SaveGameHelpers_C_GetSaveManager) == 0x000008, "Wrong alignment on BP_FL_SaveGameHelpers_C_GetSaveManager");
static_assert(sizeof(BP_FL_SaveGameHelpers_C_GetSaveManager) == 0x000018, "Wrong size on BP_FL_SaveGameHelpers_C_GetSaveManager");
static_assert(offsetof(BP_FL_SaveGameHelpers_C_GetSaveManager, __WorldContext) == 0x000000, "Member 'BP_FL_SaveGameHelpers_C_GetSaveManager::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_FL_SaveGameHelpers_C_GetSaveManager, SaveManager) == 0x000008, "Member 'BP_FL_SaveGameHelpers_C_GetSaveManager::SaveManager' has a wrong offset!");
static_assert(offsetof(BP_FL_SaveGameHelpers_C_GetSaveManager, CallFunc_GetCustomGI_ReturnValue) == 0x000010, "Member 'BP_FL_SaveGameHelpers_C_GetSaveManager::CallFunc_GetCustomGI_ReturnValue' has a wrong offset!");

// Function BP_FL_SaveGameHelpers.BP_FL_SaveGameHelpers_C.ForceLoadLastSave
// 0x0040 (0x0040 - 0x0000)
struct BP_FL_SaveGameHelpers_C_ForceLoadLastSave final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_SaveManager_C*                      CallFunc_GetSaveManager_SaveManager;               // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetSaveNameForSelectedSlot_ReturnValue;   // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FS_LoadGameRequest                     K2Node_MakeStruct_S_LoadGameRequest;               // 0x0020(0x0020)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FL_SaveGameHelpers_C_ForceLoadLastSave) == 0x000008, "Wrong alignment on BP_FL_SaveGameHelpers_C_ForceLoadLastSave");
static_assert(sizeof(BP_FL_SaveGameHelpers_C_ForceLoadLastSave) == 0x000040, "Wrong size on BP_FL_SaveGameHelpers_C_ForceLoadLastSave");
static_assert(offsetof(BP_FL_SaveGameHelpers_C_ForceLoadLastSave, __WorldContext) == 0x000000, "Member 'BP_FL_SaveGameHelpers_C_ForceLoadLastSave::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_FL_SaveGameHelpers_C_ForceLoadLastSave, CallFunc_GetSaveManager_SaveManager) == 0x000008, "Member 'BP_FL_SaveGameHelpers_C_ForceLoadLastSave::CallFunc_GetSaveManager_SaveManager' has a wrong offset!");
static_assert(offsetof(BP_FL_SaveGameHelpers_C_ForceLoadLastSave, CallFunc_GetSaveNameForSelectedSlot_ReturnValue) == 0x000010, "Member 'BP_FL_SaveGameHelpers_C_ForceLoadLastSave::CallFunc_GetSaveNameForSelectedSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FL_SaveGameHelpers_C_ForceLoadLastSave, K2Node_MakeStruct_S_LoadGameRequest) == 0x000020, "Member 'BP_FL_SaveGameHelpers_C_ForceLoadLastSave::K2Node_MakeStruct_S_LoadGameRequest' has a wrong offset!");

// Function BP_FL_SaveGameHelpers.BP_FL_SaveGameHelpers_C.ForceAutoSave
// 0x0020 (0x0020 - 0x0000)
struct BP_FL_SaveGameHelpers_C_ForceAutoSave final
{
public:
	class FString                                 DebugReason;                                       // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_SaveManager_C*                      CallFunc_GetSaveManager_SaveManager;               // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FL_SaveGameHelpers_C_ForceAutoSave) == 0x000008, "Wrong alignment on BP_FL_SaveGameHelpers_C_ForceAutoSave");
static_assert(sizeof(BP_FL_SaveGameHelpers_C_ForceAutoSave) == 0x000020, "Wrong size on BP_FL_SaveGameHelpers_C_ForceAutoSave");
static_assert(offsetof(BP_FL_SaveGameHelpers_C_ForceAutoSave, DebugReason) == 0x000000, "Member 'BP_FL_SaveGameHelpers_C_ForceAutoSave::DebugReason' has a wrong offset!");
static_assert(offsetof(BP_FL_SaveGameHelpers_C_ForceAutoSave, __WorldContext) == 0x000010, "Member 'BP_FL_SaveGameHelpers_C_ForceAutoSave::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_FL_SaveGameHelpers_C_ForceAutoSave, CallFunc_GetSaveManager_SaveManager) == 0x000018, "Member 'BP_FL_SaveGameHelpers_C_ForceAutoSave::CallFunc_GetSaveManager_SaveManager' has a wrong offset!");

// Function BP_FL_SaveGameHelpers.BP_FL_SaveGameHelpers_C.RequestAutoSave
// 0x0020 (0x0020 - 0x0000)
struct BP_FL_SaveGameHelpers_C_RequestAutoSave final
{
public:
	class FString                                 DebugReason;                                       // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_SaveManager_C*                      CallFunc_GetSaveManager_SaveManager;               // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FL_SaveGameHelpers_C_RequestAutoSave) == 0x000008, "Wrong alignment on BP_FL_SaveGameHelpers_C_RequestAutoSave");
static_assert(sizeof(BP_FL_SaveGameHelpers_C_RequestAutoSave) == 0x000020, "Wrong size on BP_FL_SaveGameHelpers_C_RequestAutoSave");
static_assert(offsetof(BP_FL_SaveGameHelpers_C_RequestAutoSave, DebugReason) == 0x000000, "Member 'BP_FL_SaveGameHelpers_C_RequestAutoSave::DebugReason' has a wrong offset!");
static_assert(offsetof(BP_FL_SaveGameHelpers_C_RequestAutoSave, __WorldContext) == 0x000010, "Member 'BP_FL_SaveGameHelpers_C_RequestAutoSave::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_FL_SaveGameHelpers_C_RequestAutoSave, CallFunc_GetSaveManager_SaveManager) == 0x000018, "Member 'BP_FL_SaveGameHelpers_C_RequestAutoSave::CallFunc_GetSaveManager_SaveManager' has a wrong offset!");

// Function BP_FL_SaveGameHelpers.BP_FL_SaveGameHelpers_C.ConvertItemsFromSave
// 0x0338 (0x0338 - 0x0000)
struct BP_FL_SaveGameHelpers_C_ConvertItemsFromSave final
{
public:
	TMap<class FName, int32>                      Items;                                             // 0x0000(0x0050)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UObject*                                __WorldContext;                                    // 0x0050(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FS_jRPG_Item_DynamicData>       DynamicItems;                                      // 0x0058(0x0010)(Parm, OutParm, ContainsInstancedReference)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_Map_Keys_Keys;                            // 0x0070(0x0010)(ReferenceParm)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FS_jRPG_Item_DynamicData>       Temp_wildcard_We_need_a_second_array_to_store_the_result_and_be_able_to_wipe_the_first__buffer__array_Variable; // 0x0090(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_jRPG_Item_StaticData                CallFunc_GetDataTableRowFromName_OutRow;           // 0x00A8(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D9[0x3];                                      // 0x01D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Map_Find_Value;                           // 0x01DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E1[0x7];                                      // 0x01E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_jRPG_Item_DynamicData               K2Node_MakeStruct_S_jRPG_Item_DynamicData;         // 0x01E8(0x0138)(ContainsInstancedReference, HasGetValueTypeHash)
	TArray<struct FS_jRPG_Item_DynamicData>       Temp_wildcard_Temp_buffer_array_Variable;          // 0x0320(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0330(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FL_SaveGameHelpers_C_ConvertItemsFromSave) == 0x000008, "Wrong alignment on BP_FL_SaveGameHelpers_C_ConvertItemsFromSave");
static_assert(sizeof(BP_FL_SaveGameHelpers_C_ConvertItemsFromSave) == 0x000338, "Wrong size on BP_FL_SaveGameHelpers_C_ConvertItemsFromSave");
static_assert(offsetof(BP_FL_SaveGameHelpers_C_ConvertItemsFromSave, Items) == 0x000000, "Member 'BP_FL_SaveGameHelpers_C_ConvertItemsFromSave::Items' has a wrong offset!");
static_assert(offsetof(BP_FL_SaveGameHelpers_C_ConvertItemsFromSave, __WorldContext) == 0x000050, "Member 'BP_FL_SaveGameHelpers_C_ConvertItemsFromSave::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_FL_SaveGameHelpers_C_ConvertItemsFromSave, DynamicItems) == 0x000058, "Member 'BP_FL_SaveGameHelpers_C_ConvertItemsFromSave::DynamicItems' has a wrong offset!");
static_assert(offsetof(BP_FL_SaveGameHelpers_C_ConvertItemsFromSave, Temp_int_Loop_Counter_Variable) == 0x000068, "Member 'BP_FL_SaveGameHelpers_C_ConvertItemsFromSave::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_FL_SaveGameHelpers_C_ConvertItemsFromSave, CallFunc_Map_Keys_Keys) == 0x000070, "Member 'BP_FL_SaveGameHelpers_C_ConvertItemsFromSave::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(BP_FL_SaveGameHelpers_C_ConvertItemsFromSave, CallFunc_Add_IntInt_ReturnValue) == 0x000080, "Member 'BP_FL_SaveGameHelpers_C_ConvertItemsFromSave::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FL_SaveGameHelpers_C_ConvertItemsFromSave, CallFunc_Array_Length_ReturnValue) == 0x000084, "Member 'BP_FL_SaveGameHelpers_C_ConvertItemsFromSave::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FL_SaveGameHelpers_C_ConvertItemsFromSave, CallFunc_Less_IntInt_ReturnValue) == 0x000088, "Member 'BP_FL_SaveGameHelpers_C_ConvertItemsFromSave::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FL_SaveGameHelpers_C_ConvertItemsFromSave, Temp_int_Array_Index_Variable) == 0x00008C, "Member 'BP_FL_SaveGameHelpers_C_ConvertItemsFromSave::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_FL_SaveGameHelpers_C_ConvertItemsFromSave, Temp_wildcard_We_need_a_second_array_to_store_the_result_and_be_able_to_wipe_the_first__buffer__array_Variable) == 0x000090, "Member 'BP_FL_SaveGameHelpers_C_ConvertItemsFromSave::Temp_wildcard_We_need_a_second_array_to_store_the_result_and_be_able_to_wipe_the_first__buffer__array_Variable' has a wrong offset!");
static_assert(offsetof(BP_FL_SaveGameHelpers_C_ConvertItemsFromSave, CallFunc_Array_Get_Item) == 0x0000A0, "Member 'BP_FL_SaveGameHelpers_C_ConvertItemsFromSave::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_FL_SaveGameHelpers_C_ConvertItemsFromSave, CallFunc_GetDataTableRowFromName_OutRow) == 0x0000A8, "Member 'BP_FL_SaveGameHelpers_C_ConvertItemsFromSave::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BP_FL_SaveGameHelpers_C_ConvertItemsFromSave, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x0001D8, "Member 'BP_FL_SaveGameHelpers_C_ConvertItemsFromSave::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FL_SaveGameHelpers_C_ConvertItemsFromSave, CallFunc_Map_Find_Value) == 0x0001DC, "Member 'BP_FL_SaveGameHelpers_C_ConvertItemsFromSave::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BP_FL_SaveGameHelpers_C_ConvertItemsFromSave, CallFunc_Map_Find_ReturnValue) == 0x0001E0, "Member 'BP_FL_SaveGameHelpers_C_ConvertItemsFromSave::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FL_SaveGameHelpers_C_ConvertItemsFromSave, K2Node_MakeStruct_S_jRPG_Item_DynamicData) == 0x0001E8, "Member 'BP_FL_SaveGameHelpers_C_ConvertItemsFromSave::K2Node_MakeStruct_S_jRPG_Item_DynamicData' has a wrong offset!");
static_assert(offsetof(BP_FL_SaveGameHelpers_C_ConvertItemsFromSave, Temp_wildcard_Temp_buffer_array_Variable) == 0x000320, "Member 'BP_FL_SaveGameHelpers_C_ConvertItemsFromSave::Temp_wildcard_Temp_buffer_array_Variable' has a wrong offset!");
static_assert(offsetof(BP_FL_SaveGameHelpers_C_ConvertItemsFromSave, CallFunc_Array_Add_ReturnValue) == 0x000330, "Member 'BP_FL_SaveGameHelpers_C_ConvertItemsFromSave::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function BP_FL_SaveGameHelpers.BP_FL_SaveGameHelpers_C.ConvertItemsToSave
// 0x0208 (0x0208 - 0x0000)
struct BP_FL_SaveGameHelpers_C_ConvertItemsToSave final
{
public:
	TArray<struct FS_jRPG_Item_DynamicData>       DynamicItems;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TMap<class FName, int32>                      SavedItems;                                        // 0x0018(0x0050)(Parm, OutParm)
	TMap<class FName, int32>                      local_savedItems;                                  // 0x0068(0x0050)(Edit, BlueprintVisible)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_jRPG_Item_DynamicData               CallFunc_Array_Get_Item;                           // 0x00C8(0x0138)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_201[0x3];                                      // 0x0201(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0204(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FL_SaveGameHelpers_C_ConvertItemsToSave) == 0x000008, "Wrong alignment on BP_FL_SaveGameHelpers_C_ConvertItemsToSave");
static_assert(sizeof(BP_FL_SaveGameHelpers_C_ConvertItemsToSave) == 0x000208, "Wrong size on BP_FL_SaveGameHelpers_C_ConvertItemsToSave");
static_assert(offsetof(BP_FL_SaveGameHelpers_C_ConvertItemsToSave, DynamicItems) == 0x000000, "Member 'BP_FL_SaveGameHelpers_C_ConvertItemsToSave::DynamicItems' has a wrong offset!");
static_assert(offsetof(BP_FL_SaveGameHelpers_C_ConvertItemsToSave, __WorldContext) == 0x000010, "Member 'BP_FL_SaveGameHelpers_C_ConvertItemsToSave::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_FL_SaveGameHelpers_C_ConvertItemsToSave, SavedItems) == 0x000018, "Member 'BP_FL_SaveGameHelpers_C_ConvertItemsToSave::SavedItems' has a wrong offset!");
static_assert(offsetof(BP_FL_SaveGameHelpers_C_ConvertItemsToSave, local_savedItems) == 0x000068, "Member 'BP_FL_SaveGameHelpers_C_ConvertItemsToSave::local_savedItems' has a wrong offset!");
static_assert(offsetof(BP_FL_SaveGameHelpers_C_ConvertItemsToSave, CallFunc_Array_Length_ReturnValue) == 0x0000B8, "Member 'BP_FL_SaveGameHelpers_C_ConvertItemsToSave::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FL_SaveGameHelpers_C_ConvertItemsToSave, Temp_int_Array_Index_Variable) == 0x0000BC, "Member 'BP_FL_SaveGameHelpers_C_ConvertItemsToSave::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_FL_SaveGameHelpers_C_ConvertItemsToSave, Temp_int_Loop_Counter_Variable) == 0x0000C0, "Member 'BP_FL_SaveGameHelpers_C_ConvertItemsToSave::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_FL_SaveGameHelpers_C_ConvertItemsToSave, CallFunc_Array_Get_Item) == 0x0000C8, "Member 'BP_FL_SaveGameHelpers_C_ConvertItemsToSave::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_FL_SaveGameHelpers_C_ConvertItemsToSave, CallFunc_Less_IntInt_ReturnValue) == 0x000200, "Member 'BP_FL_SaveGameHelpers_C_ConvertItemsToSave::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FL_SaveGameHelpers_C_ConvertItemsToSave, CallFunc_Add_IntInt_ReturnValue) == 0x000204, "Member 'BP_FL_SaveGameHelpers_C_ConvertItemsToSave::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

}

