#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FreeAimCamera

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_FreeAimCamera.BP_FreeAimCamera_C.ExecuteUbergraph_BP_FreeAimCamera
// 0x0050 (0x0050 - 0x0000)
struct BP_FreeAimCamera_C_ExecuteUbergraph_BP_FreeAimCamera final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Lerp_ReturnValue;                         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue_1;                       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue_2;                       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable_1;               // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable_1;                     // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Lerp_Alpha_ImplicitCast;                  // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_Alpha_ImplicitCast_1;                // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_Alpha_ImplicitCast_2;                // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast; // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast_1; // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast_2; // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FreeAimCamera_C_ExecuteUbergraph_BP_FreeAimCamera) == 0x000008, "Wrong alignment on BP_FreeAimCamera_C_ExecuteUbergraph_BP_FreeAimCamera");
static_assert(sizeof(BP_FreeAimCamera_C_ExecuteUbergraph_BP_FreeAimCamera) == 0x000050, "Wrong size on BP_FreeAimCamera_C_ExecuteUbergraph_BP_FreeAimCamera");
static_assert(offsetof(BP_FreeAimCamera_C_ExecuteUbergraph_BP_FreeAimCamera, EntryPoint) == 0x000000, "Member 'BP_FreeAimCamera_C_ExecuteUbergraph_BP_FreeAimCamera::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_FreeAimCamera_C_ExecuteUbergraph_BP_FreeAimCamera, CallFunc_Lerp_ReturnValue) == 0x000008, "Member 'BP_FreeAimCamera_C_ExecuteUbergraph_BP_FreeAimCamera::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FreeAimCamera_C_ExecuteUbergraph_BP_FreeAimCamera, CallFunc_Lerp_ReturnValue_1) == 0x000010, "Member 'BP_FreeAimCamera_C_ExecuteUbergraph_BP_FreeAimCamera::CallFunc_Lerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FreeAimCamera_C_ExecuteUbergraph_BP_FreeAimCamera, CallFunc_Lerp_ReturnValue_2) == 0x000018, "Member 'BP_FreeAimCamera_C_ExecuteUbergraph_BP_FreeAimCamera::CallFunc_Lerp_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_FreeAimCamera_C_ExecuteUbergraph_BP_FreeAimCamera, Temp_bool_Has_Been_Initd_Variable) == 0x000020, "Member 'BP_FreeAimCamera_C_ExecuteUbergraph_BP_FreeAimCamera::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_FreeAimCamera_C_ExecuteUbergraph_BP_FreeAimCamera, Temp_bool_IsClosed_Variable) == 0x000021, "Member 'BP_FreeAimCamera_C_ExecuteUbergraph_BP_FreeAimCamera::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_FreeAimCamera_C_ExecuteUbergraph_BP_FreeAimCamera, Temp_bool_Has_Been_Initd_Variable_1) == 0x000022, "Member 'BP_FreeAimCamera_C_ExecuteUbergraph_BP_FreeAimCamera::Temp_bool_Has_Been_Initd_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_FreeAimCamera_C_ExecuteUbergraph_BP_FreeAimCamera, Temp_bool_IsClosed_Variable_1) == 0x000023, "Member 'BP_FreeAimCamera_C_ExecuteUbergraph_BP_FreeAimCamera::Temp_bool_IsClosed_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_FreeAimCamera_C_ExecuteUbergraph_BP_FreeAimCamera, CallFunc_Lerp_Alpha_ImplicitCast) == 0x000028, "Member 'BP_FreeAimCamera_C_ExecuteUbergraph_BP_FreeAimCamera::CallFunc_Lerp_Alpha_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_FreeAimCamera_C_ExecuteUbergraph_BP_FreeAimCamera, CallFunc_Lerp_Alpha_ImplicitCast_1) == 0x000030, "Member 'BP_FreeAimCamera_C_ExecuteUbergraph_BP_FreeAimCamera::CallFunc_Lerp_Alpha_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_FreeAimCamera_C_ExecuteUbergraph_BP_FreeAimCamera, CallFunc_Lerp_Alpha_ImplicitCast_2) == 0x000038, "Member 'BP_FreeAimCamera_C_ExecuteUbergraph_BP_FreeAimCamera::CallFunc_Lerp_Alpha_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(BP_FreeAimCamera_C_ExecuteUbergraph_BP_FreeAimCamera, CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast) == 0x000040, "Member 'BP_FreeAimCamera_C_ExecuteUbergraph_BP_FreeAimCamera::CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_FreeAimCamera_C_ExecuteUbergraph_BP_FreeAimCamera, CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast_1) == 0x000044, "Member 'BP_FreeAimCamera_C_ExecuteUbergraph_BP_FreeAimCamera::CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_FreeAimCamera_C_ExecuteUbergraph_BP_FreeAimCamera, CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast_2) == 0x000048, "Member 'BP_FreeAimCamera_C_ExecuteUbergraph_BP_FreeAimCamera::CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast_2' has a wrong offset!");

}

