#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FL_StringManipulationHelpers

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_FL_StringManipulationHelpers.BP_FL_StringManipulationHelpers_C.AppendFillString
// 0x0060 (0x0060 - 0x0000)
struct BP_FL_StringManipulationHelpers_C_AppendFillString final
{
public:
	class FString                                 String;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	int32                                         Count;                                             // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Filler;                                            // 0x0018(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 ReturnValue;                                       // 0x0030(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
	class FString                                 CallFunc_CreateFillString_Result;                  // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FL_StringManipulationHelpers_C_AppendFillString) == 0x000008, "Wrong alignment on BP_FL_StringManipulationHelpers_C_AppendFillString");
static_assert(sizeof(BP_FL_StringManipulationHelpers_C_AppendFillString) == 0x000060, "Wrong size on BP_FL_StringManipulationHelpers_C_AppendFillString");
static_assert(offsetof(BP_FL_StringManipulationHelpers_C_AppendFillString, String) == 0x000000, "Member 'BP_FL_StringManipulationHelpers_C_AppendFillString::String' has a wrong offset!");
static_assert(offsetof(BP_FL_StringManipulationHelpers_C_AppendFillString, Count) == 0x000010, "Member 'BP_FL_StringManipulationHelpers_C_AppendFillString::Count' has a wrong offset!");
static_assert(offsetof(BP_FL_StringManipulationHelpers_C_AppendFillString, Filler) == 0x000018, "Member 'BP_FL_StringManipulationHelpers_C_AppendFillString::Filler' has a wrong offset!");
static_assert(offsetof(BP_FL_StringManipulationHelpers_C_AppendFillString, __WorldContext) == 0x000028, "Member 'BP_FL_StringManipulationHelpers_C_AppendFillString::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_FL_StringManipulationHelpers_C_AppendFillString, ReturnValue) == 0x000030, "Member 'BP_FL_StringManipulationHelpers_C_AppendFillString::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FL_StringManipulationHelpers_C_AppendFillString, CallFunc_CreateFillString_Result) == 0x000040, "Member 'BP_FL_StringManipulationHelpers_C_AppendFillString::CallFunc_CreateFillString_Result' has a wrong offset!");
static_assert(offsetof(BP_FL_StringManipulationHelpers_C_AppendFillString, CallFunc_Concat_StrStr_ReturnValue) == 0x000050, "Member 'BP_FL_StringManipulationHelpers_C_AppendFillString::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");

// Function BP_FL_StringManipulationHelpers.BP_FL_StringManipulationHelpers_C.CreateFillString
// 0x0060 (0x0060 - 0x0000)
struct BP_FL_StringManipulationHelpers_C_CreateFillString final
{
public:
	int32                                         Count;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Filler;                                            // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 Result;                                            // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 local_ResultString;                                // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FL_StringManipulationHelpers_C_CreateFillString) == 0x000008, "Wrong alignment on BP_FL_StringManipulationHelpers_C_CreateFillString");
static_assert(sizeof(BP_FL_StringManipulationHelpers_C_CreateFillString) == 0x000060, "Wrong size on BP_FL_StringManipulationHelpers_C_CreateFillString");
static_assert(offsetof(BP_FL_StringManipulationHelpers_C_CreateFillString, Count) == 0x000000, "Member 'BP_FL_StringManipulationHelpers_C_CreateFillString::Count' has a wrong offset!");
static_assert(offsetof(BP_FL_StringManipulationHelpers_C_CreateFillString, Filler) == 0x000008, "Member 'BP_FL_StringManipulationHelpers_C_CreateFillString::Filler' has a wrong offset!");
static_assert(offsetof(BP_FL_StringManipulationHelpers_C_CreateFillString, __WorldContext) == 0x000018, "Member 'BP_FL_StringManipulationHelpers_C_CreateFillString::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_FL_StringManipulationHelpers_C_CreateFillString, Result) == 0x000020, "Member 'BP_FL_StringManipulationHelpers_C_CreateFillString::Result' has a wrong offset!");
static_assert(offsetof(BP_FL_StringManipulationHelpers_C_CreateFillString, local_ResultString) == 0x000030, "Member 'BP_FL_StringManipulationHelpers_C_CreateFillString::local_ResultString' has a wrong offset!");
static_assert(offsetof(BP_FL_StringManipulationHelpers_C_CreateFillString, CallFunc_Concat_StrStr_ReturnValue) == 0x000040, "Member 'BP_FL_StringManipulationHelpers_C_CreateFillString::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FL_StringManipulationHelpers_C_CreateFillString, Temp_int_Variable) == 0x000050, "Member 'BP_FL_StringManipulationHelpers_C_CreateFillString::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_FL_StringManipulationHelpers_C_CreateFillString, CallFunc_Add_IntInt_ReturnValue) == 0x000054, "Member 'BP_FL_StringManipulationHelpers_C_CreateFillString::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FL_StringManipulationHelpers_C_CreateFillString, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000058, "Member 'BP_FL_StringManipulationHelpers_C_CreateFillString::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");

// Function BP_FL_StringManipulationHelpers.BP_FL_StringManipulationHelpers_C.Get Elapsed Time As Text
// 0x0178 (0x0178 - 0x0000)
struct BP_FL_StringManipulationHelpers_C_Get_Elapsed_Time_As_Text final
{
public:
	double                                        Time;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   Text;                                              // 0x0010(0x0010)(Parm, OutParm)
	struct FTimespan                              CallFunc_FromSeconds_ReturnValue;                  // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakTimespan_Days;                       // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakTimespan_Hours;                      // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakTimespan_Minutes;                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakTimespan_Seconds;                    // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakTimespan_Milliseconds;               // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue;              // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0040(0x0010)()
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0058(0x0048)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x00A0(0x0010)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_2;             // 0x00B0(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00C0(0x0048)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0108(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0150(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0160(0x0010)()
	float                                         CallFunc_FromSeconds_Seconds_ImplicitCast;         // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FL_StringManipulationHelpers_C_Get_Elapsed_Time_As_Text) == 0x000008, "Wrong alignment on BP_FL_StringManipulationHelpers_C_Get_Elapsed_Time_As_Text");
static_assert(sizeof(BP_FL_StringManipulationHelpers_C_Get_Elapsed_Time_As_Text) == 0x000178, "Wrong size on BP_FL_StringManipulationHelpers_C_Get_Elapsed_Time_As_Text");
static_assert(offsetof(BP_FL_StringManipulationHelpers_C_Get_Elapsed_Time_As_Text, Time) == 0x000000, "Member 'BP_FL_StringManipulationHelpers_C_Get_Elapsed_Time_As_Text::Time' has a wrong offset!");
static_assert(offsetof(BP_FL_StringManipulationHelpers_C_Get_Elapsed_Time_As_Text, __WorldContext) == 0x000008, "Member 'BP_FL_StringManipulationHelpers_C_Get_Elapsed_Time_As_Text::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_FL_StringManipulationHelpers_C_Get_Elapsed_Time_As_Text, Text) == 0x000010, "Member 'BP_FL_StringManipulationHelpers_C_Get_Elapsed_Time_As_Text::Text' has a wrong offset!");
static_assert(offsetof(BP_FL_StringManipulationHelpers_C_Get_Elapsed_Time_As_Text, CallFunc_FromSeconds_ReturnValue) == 0x000020, "Member 'BP_FL_StringManipulationHelpers_C_Get_Elapsed_Time_As_Text::CallFunc_FromSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FL_StringManipulationHelpers_C_Get_Elapsed_Time_As_Text, CallFunc_BreakTimespan_Days) == 0x000028, "Member 'BP_FL_StringManipulationHelpers_C_Get_Elapsed_Time_As_Text::CallFunc_BreakTimespan_Days' has a wrong offset!");
static_assert(offsetof(BP_FL_StringManipulationHelpers_C_Get_Elapsed_Time_As_Text, CallFunc_BreakTimespan_Hours) == 0x00002C, "Member 'BP_FL_StringManipulationHelpers_C_Get_Elapsed_Time_As_Text::CallFunc_BreakTimespan_Hours' has a wrong offset!");
static_assert(offsetof(BP_FL_StringManipulationHelpers_C_Get_Elapsed_Time_As_Text, CallFunc_BreakTimespan_Minutes) == 0x000030, "Member 'BP_FL_StringManipulationHelpers_C_Get_Elapsed_Time_As_Text::CallFunc_BreakTimespan_Minutes' has a wrong offset!");
static_assert(offsetof(BP_FL_StringManipulationHelpers_C_Get_Elapsed_Time_As_Text, CallFunc_BreakTimespan_Seconds) == 0x000034, "Member 'BP_FL_StringManipulationHelpers_C_Get_Elapsed_Time_As_Text::CallFunc_BreakTimespan_Seconds' has a wrong offset!");
static_assert(offsetof(BP_FL_StringManipulationHelpers_C_Get_Elapsed_Time_As_Text, CallFunc_BreakTimespan_Milliseconds) == 0x000038, "Member 'BP_FL_StringManipulationHelpers_C_Get_Elapsed_Time_As_Text::CallFunc_BreakTimespan_Milliseconds' has a wrong offset!");
static_assert(offsetof(BP_FL_StringManipulationHelpers_C_Get_Elapsed_Time_As_Text, CallFunc_Multiply_IntInt_ReturnValue) == 0x00003C, "Member 'BP_FL_StringManipulationHelpers_C_Get_Elapsed_Time_As_Text::CallFunc_Multiply_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FL_StringManipulationHelpers_C_Get_Elapsed_Time_As_Text, CallFunc_Conv_IntToText_ReturnValue) == 0x000040, "Member 'BP_FL_StringManipulationHelpers_C_Get_Elapsed_Time_As_Text::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FL_StringManipulationHelpers_C_Get_Elapsed_Time_As_Text, CallFunc_Add_IntInt_ReturnValue) == 0x000050, "Member 'BP_FL_StringManipulationHelpers_C_Get_Elapsed_Time_As_Text::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FL_StringManipulationHelpers_C_Get_Elapsed_Time_As_Text, K2Node_MakeStruct_FormatArgumentData) == 0x000058, "Member 'BP_FL_StringManipulationHelpers_C_Get_Elapsed_Time_As_Text::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_FL_StringManipulationHelpers_C_Get_Elapsed_Time_As_Text, CallFunc_Conv_IntToText_ReturnValue_1) == 0x0000A0, "Member 'BP_FL_StringManipulationHelpers_C_Get_Elapsed_Time_As_Text::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FL_StringManipulationHelpers_C_Get_Elapsed_Time_As_Text, CallFunc_Conv_IntToText_ReturnValue_2) == 0x0000B0, "Member 'BP_FL_StringManipulationHelpers_C_Get_Elapsed_Time_As_Text::CallFunc_Conv_IntToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_FL_StringManipulationHelpers_C_Get_Elapsed_Time_As_Text, K2Node_MakeStruct_FormatArgumentData_1) == 0x0000C0, "Member 'BP_FL_StringManipulationHelpers_C_Get_Elapsed_Time_As_Text::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BP_FL_StringManipulationHelpers_C_Get_Elapsed_Time_As_Text, K2Node_MakeStruct_FormatArgumentData_2) == 0x000108, "Member 'BP_FL_StringManipulationHelpers_C_Get_Elapsed_Time_As_Text::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(BP_FL_StringManipulationHelpers_C_Get_Elapsed_Time_As_Text, K2Node_MakeArray_Array) == 0x000150, "Member 'BP_FL_StringManipulationHelpers_C_Get_Elapsed_Time_As_Text::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_FL_StringManipulationHelpers_C_Get_Elapsed_Time_As_Text, CallFunc_Format_ReturnValue) == 0x000160, "Member 'BP_FL_StringManipulationHelpers_C_Get_Elapsed_Time_As_Text::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FL_StringManipulationHelpers_C_Get_Elapsed_Time_As_Text, CallFunc_FromSeconds_Seconds_ImplicitCast) == 0x000170, "Member 'BP_FL_StringManipulationHelpers_C_Get_Elapsed_Time_As_Text::CallFunc_FromSeconds_Seconds_ImplicitCast' has a wrong offset!");

// Function BP_FL_StringManipulationHelpers.BP_FL_StringManipulationHelpers_C.GetCurrentTimeAsString
// 0x0140 (0x0140 - 0x0000)
struct BP_FL_StringManipulationHelpers_C_GetCurrentTimeAsString final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
	struct FDateTime                              CallFunc_UtcNow_ReturnValue;                       // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Year;                       // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Month;                      // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Day;                        // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Hour;                       // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Minute;                     // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Second;                     // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Millisecond;                // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_1;           // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_2;           // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_3;           // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_4;           // 0x0090(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_5;           // 0x00A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x00B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x00C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x00D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_4;              // 0x00E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_5;              // 0x00F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_6;              // 0x0100(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_7;              // 0x0110(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_8;              // 0x0120(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_9;              // 0x0130(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FL_StringManipulationHelpers_C_GetCurrentTimeAsString) == 0x000008, "Wrong alignment on BP_FL_StringManipulationHelpers_C_GetCurrentTimeAsString");
static_assert(sizeof(BP_FL_StringManipulationHelpers_C_GetCurrentTimeAsString) == 0x000140, "Wrong size on BP_FL_StringManipulationHelpers_C_GetCurrentTimeAsString");
static_assert(offsetof(BP_FL_StringManipulationHelpers_C_GetCurrentTimeAsString, __WorldContext) == 0x000000, "Member 'BP_FL_StringManipulationHelpers_C_GetCurrentTimeAsString::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_FL_StringManipulationHelpers_C_GetCurrentTimeAsString, ReturnValue) == 0x000008, "Member 'BP_FL_StringManipulationHelpers_C_GetCurrentTimeAsString::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FL_StringManipulationHelpers_C_GetCurrentTimeAsString, CallFunc_UtcNow_ReturnValue) == 0x000018, "Member 'BP_FL_StringManipulationHelpers_C_GetCurrentTimeAsString::CallFunc_UtcNow_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FL_StringManipulationHelpers_C_GetCurrentTimeAsString, CallFunc_BreakDateTime_Year) == 0x000020, "Member 'BP_FL_StringManipulationHelpers_C_GetCurrentTimeAsString::CallFunc_BreakDateTime_Year' has a wrong offset!");
static_assert(offsetof(BP_FL_StringManipulationHelpers_C_GetCurrentTimeAsString, CallFunc_BreakDateTime_Month) == 0x000024, "Member 'BP_FL_StringManipulationHelpers_C_GetCurrentTimeAsString::CallFunc_BreakDateTime_Month' has a wrong offset!");
static_assert(offsetof(BP_FL_StringManipulationHelpers_C_GetCurrentTimeAsString, CallFunc_BreakDateTime_Day) == 0x000028, "Member 'BP_FL_StringManipulationHelpers_C_GetCurrentTimeAsString::CallFunc_BreakDateTime_Day' has a wrong offset!");
static_assert(offsetof(BP_FL_StringManipulationHelpers_C_GetCurrentTimeAsString, CallFunc_BreakDateTime_Hour) == 0x00002C, "Member 'BP_FL_StringManipulationHelpers_C_GetCurrentTimeAsString::CallFunc_BreakDateTime_Hour' has a wrong offset!");
static_assert(offsetof(BP_FL_StringManipulationHelpers_C_GetCurrentTimeAsString, CallFunc_BreakDateTime_Minute) == 0x000030, "Member 'BP_FL_StringManipulationHelpers_C_GetCurrentTimeAsString::CallFunc_BreakDateTime_Minute' has a wrong offset!");
static_assert(offsetof(BP_FL_StringManipulationHelpers_C_GetCurrentTimeAsString, CallFunc_BreakDateTime_Second) == 0x000034, "Member 'BP_FL_StringManipulationHelpers_C_GetCurrentTimeAsString::CallFunc_BreakDateTime_Second' has a wrong offset!");
static_assert(offsetof(BP_FL_StringManipulationHelpers_C_GetCurrentTimeAsString, CallFunc_BreakDateTime_Millisecond) == 0x000038, "Member 'BP_FL_StringManipulationHelpers_C_GetCurrentTimeAsString::CallFunc_BreakDateTime_Millisecond' has a wrong offset!");
static_assert(offsetof(BP_FL_StringManipulationHelpers_C_GetCurrentTimeAsString, CallFunc_Conv_IntToString_ReturnValue) == 0x000040, "Member 'BP_FL_StringManipulationHelpers_C_GetCurrentTimeAsString::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FL_StringManipulationHelpers_C_GetCurrentTimeAsString, CallFunc_Conv_IntToString_ReturnValue_1) == 0x000050, "Member 'BP_FL_StringManipulationHelpers_C_GetCurrentTimeAsString::CallFunc_Conv_IntToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FL_StringManipulationHelpers_C_GetCurrentTimeAsString, CallFunc_Concat_StrStr_ReturnValue) == 0x000060, "Member 'BP_FL_StringManipulationHelpers_C_GetCurrentTimeAsString::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FL_StringManipulationHelpers_C_GetCurrentTimeAsString, CallFunc_Conv_IntToString_ReturnValue_2) == 0x000070, "Member 'BP_FL_StringManipulationHelpers_C_GetCurrentTimeAsString::CallFunc_Conv_IntToString_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_FL_StringManipulationHelpers_C_GetCurrentTimeAsString, CallFunc_Conv_IntToString_ReturnValue_3) == 0x000080, "Member 'BP_FL_StringManipulationHelpers_C_GetCurrentTimeAsString::CallFunc_Conv_IntToString_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_FL_StringManipulationHelpers_C_GetCurrentTimeAsString, CallFunc_Conv_IntToString_ReturnValue_4) == 0x000090, "Member 'BP_FL_StringManipulationHelpers_C_GetCurrentTimeAsString::CallFunc_Conv_IntToString_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_FL_StringManipulationHelpers_C_GetCurrentTimeAsString, CallFunc_Conv_IntToString_ReturnValue_5) == 0x0000A0, "Member 'BP_FL_StringManipulationHelpers_C_GetCurrentTimeAsString::CallFunc_Conv_IntToString_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_FL_StringManipulationHelpers_C_GetCurrentTimeAsString, CallFunc_Concat_StrStr_ReturnValue_1) == 0x0000B0, "Member 'BP_FL_StringManipulationHelpers_C_GetCurrentTimeAsString::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FL_StringManipulationHelpers_C_GetCurrentTimeAsString, CallFunc_Concat_StrStr_ReturnValue_2) == 0x0000C0, "Member 'BP_FL_StringManipulationHelpers_C_GetCurrentTimeAsString::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_FL_StringManipulationHelpers_C_GetCurrentTimeAsString, CallFunc_Concat_StrStr_ReturnValue_3) == 0x0000D0, "Member 'BP_FL_StringManipulationHelpers_C_GetCurrentTimeAsString::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_FL_StringManipulationHelpers_C_GetCurrentTimeAsString, CallFunc_Concat_StrStr_ReturnValue_4) == 0x0000E0, "Member 'BP_FL_StringManipulationHelpers_C_GetCurrentTimeAsString::CallFunc_Concat_StrStr_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_FL_StringManipulationHelpers_C_GetCurrentTimeAsString, CallFunc_Concat_StrStr_ReturnValue_5) == 0x0000F0, "Member 'BP_FL_StringManipulationHelpers_C_GetCurrentTimeAsString::CallFunc_Concat_StrStr_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_FL_StringManipulationHelpers_C_GetCurrentTimeAsString, CallFunc_Concat_StrStr_ReturnValue_6) == 0x000100, "Member 'BP_FL_StringManipulationHelpers_C_GetCurrentTimeAsString::CallFunc_Concat_StrStr_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_FL_StringManipulationHelpers_C_GetCurrentTimeAsString, CallFunc_Concat_StrStr_ReturnValue_7) == 0x000110, "Member 'BP_FL_StringManipulationHelpers_C_GetCurrentTimeAsString::CallFunc_Concat_StrStr_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_FL_StringManipulationHelpers_C_GetCurrentTimeAsString, CallFunc_Concat_StrStr_ReturnValue_8) == 0x000120, "Member 'BP_FL_StringManipulationHelpers_C_GetCurrentTimeAsString::CallFunc_Concat_StrStr_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_FL_StringManipulationHelpers_C_GetCurrentTimeAsString, CallFunc_Concat_StrStr_ReturnValue_9) == 0x000130, "Member 'BP_FL_StringManipulationHelpers_C_GetCurrentTimeAsString::CallFunc_Concat_StrStr_ReturnValue_9' has a wrong offset!");

// Function BP_FL_StringManipulationHelpers.BP_FL_StringManipulationHelpers_C.MergeStringArray
// 0x0090 (0x0090 - 0x0000)
struct BP_FL_StringManipulationHelpers_C_MergeStringArray final
{
public:
	TArray<class FString>                         StringArray;                                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FString                                 Separator;                                         // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 Result;                                            // 0x0028(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 local_String;                                      // 0x0038(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Array_Get_Item;                           // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FL_StringManipulationHelpers_C_MergeStringArray) == 0x000008, "Wrong alignment on BP_FL_StringManipulationHelpers_C_MergeStringArray");
static_assert(sizeof(BP_FL_StringManipulationHelpers_C_MergeStringArray) == 0x000090, "Wrong size on BP_FL_StringManipulationHelpers_C_MergeStringArray");
static_assert(offsetof(BP_FL_StringManipulationHelpers_C_MergeStringArray, StringArray) == 0x000000, "Member 'BP_FL_StringManipulationHelpers_C_MergeStringArray::StringArray' has a wrong offset!");
static_assert(offsetof(BP_FL_StringManipulationHelpers_C_MergeStringArray, Separator) == 0x000010, "Member 'BP_FL_StringManipulationHelpers_C_MergeStringArray::Separator' has a wrong offset!");
static_assert(offsetof(BP_FL_StringManipulationHelpers_C_MergeStringArray, __WorldContext) == 0x000020, "Member 'BP_FL_StringManipulationHelpers_C_MergeStringArray::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_FL_StringManipulationHelpers_C_MergeStringArray, Result) == 0x000028, "Member 'BP_FL_StringManipulationHelpers_C_MergeStringArray::Result' has a wrong offset!");
static_assert(offsetof(BP_FL_StringManipulationHelpers_C_MergeStringArray, local_String) == 0x000038, "Member 'BP_FL_StringManipulationHelpers_C_MergeStringArray::local_String' has a wrong offset!");
static_assert(offsetof(BP_FL_StringManipulationHelpers_C_MergeStringArray, CallFunc_Array_Length_ReturnValue) == 0x000048, "Member 'BP_FL_StringManipulationHelpers_C_MergeStringArray::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FL_StringManipulationHelpers_C_MergeStringArray, Temp_int_Array_Index_Variable) == 0x00004C, "Member 'BP_FL_StringManipulationHelpers_C_MergeStringArray::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_FL_StringManipulationHelpers_C_MergeStringArray, Temp_int_Loop_Counter_Variable) == 0x000050, "Member 'BP_FL_StringManipulationHelpers_C_MergeStringArray::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_FL_StringManipulationHelpers_C_MergeStringArray, CallFunc_Array_Get_Item) == 0x000058, "Member 'BP_FL_StringManipulationHelpers_C_MergeStringArray::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_FL_StringManipulationHelpers_C_MergeStringArray, CallFunc_Less_IntInt_ReturnValue) == 0x000068, "Member 'BP_FL_StringManipulationHelpers_C_MergeStringArray::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FL_StringManipulationHelpers_C_MergeStringArray, CallFunc_Add_IntInt_ReturnValue) == 0x00006C, "Member 'BP_FL_StringManipulationHelpers_C_MergeStringArray::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FL_StringManipulationHelpers_C_MergeStringArray, CallFunc_Concat_StrStr_ReturnValue) == 0x000070, "Member 'BP_FL_StringManipulationHelpers_C_MergeStringArray::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FL_StringManipulationHelpers_C_MergeStringArray, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000080, "Member 'BP_FL_StringManipulationHelpers_C_MergeStringArray::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");

// Function BP_FL_StringManipulationHelpers.BP_FL_StringManipulationHelpers_C.PadString
// 0x00F0 (0x00F0 - 0x0000)
struct BP_FL_StringManipulationHelpers_C_PadString final
{
public:
	class FString                                 String;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	int32                                         Count;                                             // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Filler;                                            // 0x0018(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 Result;                                            // 0x0030(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	TArray<class FString>                         local_StringArray;                                 // 0x0040(0x0010)(Edit, BlueprintVisible)
	class FString                                 local_ResultString;                                // 0x0050(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	TArray<class FString>                         CallFunc_ParseIntoArray_ReturnValue;               // 0x0060(0x0010)(ReferenceParm)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Array_Get_Item;                           // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_AppendFillString_ReturnValue;             // 0x0090(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A5[0x3];                                       // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Array_Get_Item_1;                         // 0x00A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsNotEmpty_ReturnValue;             // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_AppendFillString_ReturnValue_1;           // 0x00C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x00D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x00E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FL_StringManipulationHelpers_C_PadString) == 0x000008, "Wrong alignment on BP_FL_StringManipulationHelpers_C_PadString");
static_assert(sizeof(BP_FL_StringManipulationHelpers_C_PadString) == 0x0000F0, "Wrong size on BP_FL_StringManipulationHelpers_C_PadString");
static_assert(offsetof(BP_FL_StringManipulationHelpers_C_PadString, String) == 0x000000, "Member 'BP_FL_StringManipulationHelpers_C_PadString::String' has a wrong offset!");
static_assert(offsetof(BP_FL_StringManipulationHelpers_C_PadString, Count) == 0x000010, "Member 'BP_FL_StringManipulationHelpers_C_PadString::Count' has a wrong offset!");
static_assert(offsetof(BP_FL_StringManipulationHelpers_C_PadString, Filler) == 0x000018, "Member 'BP_FL_StringManipulationHelpers_C_PadString::Filler' has a wrong offset!");
