#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FL_MainQuestHelper

#include "Basic.hpp"

#include "S_QuestObjective_structs.hpp"
#include "S_MainQuestData_structs.hpp"
#include "E_QuestStatus_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "SandFall_structs.hpp"
#include "E_CurrentAct_structs.hpp"
#include "E_MainQuest_Step_structs.hpp"


namespace SDK::Params
{

// Function BP_FL_MainQuestHelper.BP_FL_MainQuestHelper_C.GetCurrentQuestLevelIdentifiers
// 0x01B8 (0x01B8 - 0x0000)
struct BP_FL_MainQuestHelper_C_GetCurrentQuestLevelIdentifiers final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FGameplayTag>                   LevelIdentifiers;                                  // 0x0008(0x0010)(Parm, OutParm)
	TArray<struct FGameplayTag>                   local_LevelIdentifiers;                            // 0x0018(0x0010)(Edit, BlueprintVisible)
	bool                                          CallFunc_HasPersistentFlag_Result;                 // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_QuestSystem_C*                      CallFunc_GetQuestSystem_QuestSystem;               // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasPersistentFlag_Result_1;               // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_QuestSystem_C*                      CallFunc_GetQuestSystem_QuestSystem_1;             // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasPersistentFlag_Result_2;               // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasPersistentFlag_Result_3;               // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasPersistentFlag_Result_4;               // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B[0x5];                                       // 0x004B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_QuestSystem_C*                      CallFunc_GetQuestSystem_QuestSystem_2;             // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_CreateQuestIdentifier_ReturnValue;        // 0x0064(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FQuestObjectiveIdentifier              Temp_wildcard_Variable;                            // 0x006C(0x0010)(NoDestructor)
	struct FQuestObjectiveIdentifier              CallFunc_CreateQuestObjectiveIdentifier_ReturnValue; // 0x007C(0x0010)(NoDestructor)
	E_QuestStatus                                 CallFunc_GetObjectiveStatus_Status;                // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8D[0x3];                                       // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_MainQuestData                       CallFunc_GetDataTableRowFromName_OutRow;           // 0x0090(0x0028)(HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BA[0x2];                                       // 0x00BA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           Temp_struct_Variable;                              // 0x00BC(0x0008)(ConstParm, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable_1;                            // 0x00C4(0x0008)(ConstParm, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue_1;           // 0x00CD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CE[0x2];                                       // 0x00CE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuestObjectiveIdentifier              CallFunc_CreateQuestObjectiveIdentifier_ReturnValue_1; // 0x00D0(0x0010)(NoDestructor)
	struct FS_MainQuestData                       CallFunc_GetDataTableRowFromName_OutRow_1;         // 0x00E0(0x0028)(HasGetValueTypeHash)
	E_QuestStatus                                 CallFunc_GetObjectiveStatus_Status_1;              // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_1;          // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x010A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10B[0x1];                                      // 0x010B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuestObjectiveIdentifier              CallFunc_CreateQuestObjectiveIdentifier_ReturnValue_2; // 0x010C(0x0010)(NoDestructor)
	E_QuestStatus                                 CallFunc_GetObjectiveStatus_Status_2;              // 0x011C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11D[0x3];                                      // 0x011D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_MainQuestData                       CallFunc_GetDataTableRowFromName_OutRow_2;         // 0x0120(0x0028)(HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_2;          // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14A[0x6];                                      // 0x014A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames;         // 0x0150(0x0010)(ReferenceParm)
	E_QuestStatus                                 CallFunc_GetQuestStatus_Status;                    // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_161[0x3];                                      // 0x0161(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0164(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x016C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16D[0x3];                                      // 0x016D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_MainQuestData                       CallFunc_GetDataTableRowFromName_OutRow_3;         // 0x0170(0x0028)(HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Equal_FQuestObjectiveIdentifier_ReturnValue; // 0x0199(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19A[0x2];                                      // 0x019A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A1[0x3];                                      // 0x01A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuestObjectiveIdentifier              CallFunc_GetLastMainQuestObjectiveWithStatus_QuestObjective; // 0x01A4(0x0010)(NoDestructor)
	bool                                          CallFunc_GetLastMainQuestObjectiveWithStatus_IsValid; // 0x01B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FL_MainQuestHelper_C_GetCurrentQuestLevelIdentifiers) == 0x000008, "Wrong alignment on BP_FL_MainQuestHelper_C_GetCurrentQuestLevelIdentifiers");
static_assert(sizeof(BP_FL_MainQuestHelper_C_GetCurrentQuestLevelIdentifiers) == 0x0001B8, "Wrong size on BP_FL_MainQuestHelper_C_GetCurrentQuestLevelIdentifiers");
static_assert(offsetof(BP_FL_MainQuestHelper_C_GetCurrentQuestLevelIdentifiers, __WorldContext) == 0x000000, "Member 'BP_FL_MainQuestHelper_C_GetCurrentQuestLevelIdentifiers::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_FL_MainQuestHelper_C_GetCurrentQuestLevelIdentifiers, LevelIdentifiers) == 0x000008, "Member 'BP_FL_MainQuestHelper_C_GetCurrentQuestLevelIdentifiers::LevelIdentifiers' has a wrong offset!");
static_assert(offsetof(BP_FL_MainQuestHelper_C_GetCurrentQuestLevelIdentifiers, local_LevelIdentifiers) == 0x000018, "Member 'BP_FL_MainQuestHelper_C_GetCurrentQuestLevelIdentifiers::local_LevelIdentifiers' has a wrong offset!");
static_assert(offsetof(BP_FL_MainQuestHelper_C_GetCurrentQuestLevelIdentifiers, CallFunc_HasPersistentFlag_Result) == 0x000028, "Member 'BP_FL_MainQuestHelper_C_GetCurrentQuestLevelIdentifiers::CallFunc_HasPersistentFlag_Result' has a wrong offset!");
static_assert(offsetof(BP_FL_MainQuestHelper_C_GetCurrentQuestLevelIdentifiers, CallFunc_GetQuestSystem_QuestSystem) == 0x000030, "Member 'BP_FL_MainQuestHelper_C_GetCurrentQuestLevelIdentifiers::CallFunc_GetQuestSystem_QuestSystem' has a wrong offset!");
static_assert(offsetof(BP_FL_MainQuestHelper_C_GetCurrentQuestLevelIdentifiers, CallFunc_HasPersistentFlag_Result_1) == 0x000038, "Member 'BP_FL_MainQuestHelper_C_GetCurrentQuestLevelIdentifiers::CallFunc_HasPersistentFlag_Result_1' has a wrong offset!");
static_assert(offsetof(BP_FL_MainQuestHelper_C_GetCurrentQuestLevelIdentifiers, CallFunc_GetQuestSystem_QuestSystem_1) == 0x000040, "Member 'BP_FL_MainQuestHelper_C_GetCurrentQuestLevelIdentifiers::CallFunc_GetQuestSystem_QuestSystem_1' has a wrong offset!");
static_assert(offsetof(BP_FL_MainQuestHelper_C_GetCurrentQuestLevelIdentifiers, CallFunc_HasPersistentFlag_Result_2) == 0x000048, "Member 'BP_FL_MainQuestHelper_C_GetCurrentQuestLevelIdentifiers::CallFunc_HasPersistentFlag_Result_2' has a wrong offset!");
static_assert(offsetof(BP_FL_MainQuestHelper_C_GetCurrentQuestLevelIdentifiers, CallFunc_HasPersistentFlag_Result_3) == 0x000049, "Member 'BP_FL_MainQuestHelper_C_GetCurrentQuestLevelIdentifiers::CallFunc_HasPersistentFlag_Result_3' has a wrong offset!");
static_assert(offsetof(BP_FL_MainQuestHelper_C_GetCurrentQuestLevelIdentifiers, CallFunc_HasPersistentFlag_Result_4) == 0x00004A, "Member 'BP_FL_MainQuestHelper_C_GetCurrentQuestLevelIdentifiers::CallFunc_HasPersistentFlag_Result_4' has a wrong offset!");
static_assert(offsetof(BP_FL_MainQuestHelper_C_GetCurrentQuestLevelIdentifiers, CallFunc_GetQuestSystem_QuestSystem_2) == 0x000050, "Member 'BP_FL_MainQuestHelper_C_GetCurrentQuestLevelIdentifiers::CallFunc_GetQuestSystem_QuestSystem_2' has a wrong offset!");
static_assert(offsetof(BP_FL_MainQuestHelper_C_GetCurrentQuestLevelIdentifiers, Temp_int_Array_Index_Variable) == 0x000058, "Member 'BP_FL_MainQuestHelper_C_GetCurrentQuestLevelIdentifiers::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_FL_MainQuestHelper_C_GetCurrentQuestLevelIdentifiers, Temp_int_Loop_Counter_Variable) == 0x00005C, "Member 'BP_FL_MainQuestHelper_C_GetCurrentQuestLevelIdentifiers::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_FL_MainQuestHelper_C_GetCurrentQuestLevelIdentifiers, CallFunc_Add_IntInt_ReturnValue) == 0x000060, "Member 'BP_FL_MainQuestHelper_C_GetCurrentQuestLevelIdentifiers::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FL_MainQuestHelper_C_GetCurrentQuestLevelIdentifiers, CallFunc_CreateQuestIdentifier_ReturnValue) == 0x000064, "Member 'BP_FL_MainQuestHelper_C_GetCurrentQuestLevelIdentifiers::CallFunc_CreateQuestIdentifier_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FL_MainQuestHelper_C_GetCurrentQuestLevelIdentifiers, Temp_wildcard_Variable) == 0x00006C, "Member 'BP_FL_MainQuestHelper_C_GetCurrentQuestLevelIdentifiers::Temp_wildcard_Variable' has a wrong offset!");
static_assert(offsetof(BP_FL_MainQuestHelper_C_GetCurrentQuestLevelIdentifiers, CallFunc_CreateQuestObjectiveIdentifier_ReturnValue) == 0x00007C, "Member 'BP_FL_MainQuestHelper_C_GetCurrentQuestLevelIdentifiers::CallFunc_CreateQuestObjectiveIdentifier_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FL_MainQuestHelper_C_GetCurrentQuestLevelIdentifiers, CallFunc_GetObjectiveStatus_Status) == 0x00008C, "Member 'BP_FL_MainQuestHelper_C_GetCurrentQuestLevelIdentifiers::CallFunc_GetObjectiveStatus_Status' has a wrong offset!");
static_assert(offsetof(BP_FL_MainQuestHelper_C_GetCurrentQuestLevelIdentifiers, CallFunc_GetDataTableRowFromName_OutRow) == 0x000090, "Member 'BP_FL_MainQuestHelper_C_GetCurrentQuestLevelIdentifiers::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BP_FL_MainQuestHelper_C_GetCurrentQuestLevelIdentifiers, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x0000B8, "Member 'BP_FL_MainQuestHelper_C_GetCurrentQuestLevelIdentifiers::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FL_MainQuestHelper_C_GetCurrentQuestLevelIdentifiers, CallFunc_BooleanAND_ReturnValue) == 0x0000B9, "Member 'BP_FL_MainQuestHelper_C_GetCurrentQuestLevelIdentifiers::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FL_MainQuestHelper_C_GetCurrentQuestLevelIdentifiers, Temp_struct_Variable) == 0x0000BC, "Member 'BP_FL_MainQuestHelper_C_GetCurrentQuestLevelIdentifiers::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_FL_MainQuestHelper_C_GetCurrentQuestLevelIdentifiers, Temp_struct_Variable_1) == 0x0000C4, "Member 'BP_FL_MainQuestHelper_C_GetCurrentQuestLevelIdentifiers::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_FL_MainQuestHelper_C_GetCurrentQuestLevelIdentifiers, CallFunc_Array_RemoveItem_ReturnValue) == 0x0000CC, "Member 'BP_FL_MainQuestHelper_C_GetCurrentQuestLevelIdentifiers::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FL_MainQuestHelper_C_GetCurrentQuestLevelIdentifiers, CallFunc_Array_RemoveItem_ReturnValue_1) == 0x0000CD, "Member 'BP_FL_MainQuestHelper_C_GetCurrentQuestLevelIdentifiers::CallFunc_Array_RemoveItem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FL_MainQuestHelper_C_GetCurrentQuestLevelIdentifiers, CallFunc_CreateQuestObjectiveIdentifier_ReturnValue_1) == 0x0000D0, "Member 'BP_FL_MainQuestHelper_C_GetCurrentQuestLevelIdentifiers::CallFunc_CreateQuestObjectiveIdentifier_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FL_MainQuestHelper_C_GetCurrentQuestLevelIdentifiers, CallFunc_GetDataTableRowFromName_OutRow_1) == 0x0000E0, "Member 'BP_FL_MainQuestHelper_C_GetCurrentQuestLevelIdentifiers::CallFunc_GetDataTableRowFromName_OutRow_1' has a wrong offset!");
static_assert(offsetof(BP_FL_MainQuestHelper_C_GetCurrentQuestLevelIdentifiers, CallFunc_GetObjectiveStatus_Status_1) == 0x000108, "Member 'BP_FL_MainQuestHelper_C_GetCurrentQuestLevelIdentifiers::CallFunc_GetObjectiveStatus_Status_1' has a wrong offset!");
static_assert(offsetof(BP_FL_MainQuestHelper_C_GetCurrentQuestLevelIdentifiers, CallFunc_NotEqual_ByteByte_ReturnValue_1) == 0x000109, "Member 'BP_FL_MainQuestHelper_C_GetCurrentQuestLevelIdentifiers::CallFunc_NotEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FL_MainQuestHelper_C_GetCurrentQuestLevelIdentifiers, CallFunc_BooleanAND_ReturnValue_1) == 0x00010A, "Member 'BP_FL_MainQuestHelper_C_GetCurrentQuestLevelIdentifiers::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FL_MainQuestHelper_C_GetCurrentQuestLevelIdentifiers, CallFunc_CreateQuestObjectiveIdentifier_ReturnValue_2) == 0x00010C, "Member 'BP_FL_MainQuestHelper_C_GetCurrentQuestLevelIdentifiers::CallFunc_CreateQuestObjectiveIdentifier_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_FL_MainQuestHelper_C_GetCurrentQuestLevelIdentifiers, CallFunc_GetObjectiveStatus_Status_2) == 0x00011C, "Member 'BP_FL_MainQuestHelper_C_GetCurrentQuestLevelIdentifiers::CallFunc_GetObjectiveStatus_Status_2' has a wrong offset!");
static_assert(offsetof(BP_FL_MainQuestHelper_C_GetCurrentQuestLevelIdentifiers, CallFunc_GetDataTableRowFromName_OutRow_2) == 0x000120, "Member 'BP_FL_MainQuestHelper_C_GetCurrentQuestLevelIdentifiers::CallFunc_GetDataTableRowFromName_OutRow_2' has a wrong offset!");
static_assert(offsetof(BP_FL_MainQuestHelper_C_GetCurrentQuestLevelIdentifiers, CallFunc_NotEqual_ByteByte_ReturnValue_2) == 0x000148, "Member 'BP_FL_MainQuestHelper_C_GetCurrentQuestLevelIdentifiers::CallFunc_NotEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_FL_MainQuestHelper_C_GetCurrentQuestLevelIdentifiers, CallFunc_BooleanAND_ReturnValue_2) == 0x000149, "Member 'BP_FL_MainQuestHelper_C_GetCurrentQuestLevelIdentifiers::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_FL_MainQuestHelper_C_GetCurrentQuestLevelIdentifiers, CallFunc_GetDataTableRowNames_OutRowNames) == 0x000150, "Member 'BP_FL_MainQuestHelper_C_GetCurrentQuestLevelIdentifiers::CallFunc_GetDataTableRowNames_OutRowNames' has a wrong offset!");
static_assert(offsetof(BP_FL_MainQuestHelper_C_GetCurrentQuestLevelIdentifiers, CallFunc_GetQuestStatus_Status) == 0x000160, "Member 'BP_FL_MainQuestHelper_C_GetCurrentQuestLevelIdentifiers::CallFunc_GetQuestStatus_Status' has a wrong offset!");
static_assert(offsetof(BP_FL_MainQuestHelper_C_GetCurrentQuestLevelIdentifiers, CallFunc_Array_Get_Item) == 0x000164, "Member 'BP_FL_MainQuestHelper_C_GetCurrentQuestLevelIdentifiers::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_FL_MainQuestHelper_C_GetCurrentQuestLevelIdentifiers, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00016C, "Member 'BP_FL_MainQuestHelper_C_GetCurrentQuestLevelIdentifiers::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FL_MainQuestHelper_C_GetCurrentQuestLevelIdentifiers, CallFunc_GetDataTableRowFromName_OutRow_3) == 0x000170, "Member 'BP_FL_MainQuestHelper_C_GetCurrentQuestLevelIdentifiers::CallFunc_GetDataTableRowFromName_OutRow_3' has a wrong offset!");
static_assert(offsetof(BP_FL_MainQuestHelper_C_GetCurrentQuestLevelIdentifiers, CallFunc_Not_PreBool_ReturnValue) == 0x000198, "Member 'BP_FL_MainQuestHelper_C_GetCurrentQuestLevelIdentifiers::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FL_MainQuestHelper_C_GetCurrentQuestLevelIdentifiers, CallFunc_Equal_FQuestObjectiveIdentifier_ReturnValue) == 0x000199, "Member 'BP_FL_MainQuestHelper_C_GetCurrentQuestLevelIdentifiers::CallFunc_Equal_FQuestObjectiveIdentifier_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FL_MainQuestHelper_C_GetCurrentQuestLevelIdentifiers, CallFunc_Array_Length_ReturnValue) == 0x00019C, "Member 'BP_FL_MainQuestHelper_C_GetCurrentQuestLevelIdentifiers::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FL_MainQuestHelper_C_GetCurrentQuestLevelIdentifiers, CallFunc_Less_IntInt_ReturnValue) == 0x0001A0, "Member 'BP_FL_MainQuestHelper_C_GetCurrentQuestLevelIdentifiers::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FL_MainQuestHelper_C_GetCurrentQuestLevelIdentifiers, CallFunc_GetLastMainQuestObjectiveWithStatus_QuestObjective) == 0x0001A4, "Member 'BP_FL_MainQuestHelper_C_GetCurrentQuestLevelIdentifiers::CallFunc_GetLastMainQuestObjectiveWithStatus_QuestObjective' has a wrong offset!");
static_assert(offsetof(BP_FL_MainQuestHelper_C_GetCurrentQuestLevelIdentifiers, CallFunc_GetLastMainQuestObjectiveWithStatus_IsValid) == 0x0001B4, "Member 'BP_FL_MainQuestHelper_C_GetCurrentQuestLevelIdentifiers::CallFunc_GetLastMainQuestObjectiveWithStatus_IsValid' has a wrong offset!");

// Function BP_FL_MainQuestHelper.BP_FL_MainQuestHelper_C.IsInActOrHigher
// 0x0020 (0x0020 - 0x0000)
struct BP_FL_MainQuestHelper_C_IsInActOrHigher final
{
public:
	E_CurrentAct                                  ActToCheck;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_CurrentAct                                  CurrentAct;                                        // 0x0011(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_CurrentAct                                  CallFunc_GetCurrentMainPathStatus_CurrentAct;      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_MainQuest_Step                              CallFunc_GetCurrentMainPathStatus_CurrentStep;     // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FL_MainQuestHelper_C_IsInActOrHigher) == 0x000008, "Wrong alignment on BP_FL_MainQuestHelper_C_IsInActOrHigher");
static_assert(sizeof(BP_FL_MainQuestHelper_C_IsInActOrHigher) == 0x000020, "Wrong size on BP_FL_MainQuestHelper_C_IsInActOrHigher");
static_assert(offsetof(BP_FL_MainQuestHelper_C_IsInActOrHigher, ActToCheck) == 0x000000, "Member 'BP_FL_MainQuestHelper_C_IsInActOrHigher::ActToCheck' has a wrong offset!");
static_assert(offsetof(BP_FL_MainQuestHelper_C_IsInActOrHigher, __WorldContext) == 0x000008, "Member 'BP_FL_MainQuestHelper_C_IsInActOrHigher::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_FL_MainQuestHelper_C_IsInActOrHigher, ReturnValue) == 0x000010, "Member 'BP_FL_MainQuestHelper_C_IsInActOrHigher::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FL_MainQuestHelper_C_IsInActOrHigher, CurrentAct) == 0x000011, "Member 'BP_FL_MainQuestHelper_C_IsInActOrHigher::CurrentAct' has a wrong offset!");
static_assert(offsetof(BP_FL_MainQuestHelper_C_IsInActOrHigher, K2Node_SwitchEnum_CmpSuccess) == 0x000012, "Member 'BP_FL_MainQuestHelper_C_IsInActOrHigher::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_FL_MainQuestHelper_C_IsInActOrHigher, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000013, "Member 'BP_FL_MainQuestHelper_C_IsInActOrHigher::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FL_MainQuestHelper_C_IsInActOrHigher, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000014, "Member 'BP_FL_MainQuestHelper_C_IsInActOrHigher::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FL_MainQuestHelper_C_IsInActOrHigher, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x000015, "Member 'BP_FL_MainQuestHelper_C_IsInActOrHigher::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_FL_MainQuestHelper_C_IsInActOrHigher, CallFunc_BooleanOR_ReturnValue) == 0x000016, "Member 'BP_FL_MainQuestHelper_C_IsInActOrHigher::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FL_MainQuestHelper_C_IsInActOrHigher, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000017, "Member 'BP_FL_MainQuestHelper_C_IsInActOrHigher::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FL_MainQuestHelper_C_IsInActOrHigher, CallFunc_GetCurrentMainPathStatus_CurrentAct) == 0x000018, "Member 'BP_FL_MainQuestHelper_C_IsInActOrHigher::CallFunc_GetCurrentMainPathStatus_CurrentAct' has a wrong offset!");
static_assert(offsetof(BP_FL_MainQuestHelper_C_IsInActOrHigher, CallFunc_GetCurrentMainPathStatus_CurrentStep) == 0x000019, "Member 'BP_FL_MainQuestHelper_C_IsInActOrHigher::CallFunc_GetCurrentMainPathStatus_CurrentStep' has a wrong offset!");

// Function BP_FL_MainQuestHelper.BP_FL_MainQuestHelper_C.GetLastMainQuestObjectiveWithStatus
// 0x0078 (0x0078 - 0x0000)
struct BP_FL_MainQuestHelper_C_GetLastMainQuestObjectiveWithStatus final
{
public:
	E_QuestStatus                                 Status;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FQuestObjectiveIdentifier              QuestObjective;                                    // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
	bool                                          IsValid;                                           // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuestObjectiveIdentifier              local_LastCompletedObjective;                      // 0x0024(0x0010)(Edit, BlueprintVisible, NoDestructor)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42[0x2];                                       // 0x0042(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_CreateQuestIdentifier_ReturnValue;        // 0x0044(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FQuestObjectiveIdentifier>      CallFunc_GetObjectiveList_ObjectiveIdentifiers;    // 0x0050(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FQuestObjectiveIdentifier              CallFunc_Array_Get_Item;                           // 0x0064(0x0010)(NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0075(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_QuestStatus                                 CallFunc_GetObjectiveStatus_Status;                // 0x0076(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0077(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FL_MainQuestHelper_C_GetLastMainQuestObjectiveWithStatus) == 0x000008, "Wrong alignment on BP_FL_MainQuestHelper_C_GetLastMainQuestObjectiveWithStatus");
static_assert(sizeof(BP_FL_MainQuestHelper_C_GetLastMainQuestObjectiveWithStatus) == 0x000078, "Wrong size on BP_FL_MainQuestHelper_C_GetLastMainQuestObjectiveWithStatus");
static_assert(offsetof(BP_FL_MainQuestHelper_C_GetLastMainQuestObjectiveWithStatus, Status) == 0x000000, "Member 'BP_FL_MainQuestHelper_C_GetLastMainQuestObjectiveWithStatus::Status' has a wrong offset!");
static_assert(offsetof(BP_FL_MainQuestHelper_C_GetLastMainQuestObjectiveWithStatus, __WorldContext) == 0x000008, "Member 'BP_FL_MainQuestHelper_C_GetLastMainQuestObjectiveWithStatus::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_FL_MainQuestHelper_C_GetLastMainQuestObjectiveWithStatus, QuestObjective) == 0x000010, "Member 'BP_FL_MainQuestHelper_C_GetLastMainQuestObjectiveWithStatus::QuestObjective' has a wrong offset!");
static_assert(offsetof(BP_FL_MainQuestHelper_C_GetLastMainQuestObjectiveWithStatus, IsValid) == 0x000020, "Member 'BP_FL_MainQuestHelper_C_GetLastMainQuestObjectiveWithStatus::IsValid' has a wrong offset!");
static_assert(offsetof(BP_FL_MainQuestHelper_C_GetLastMainQuestObjectiveWithStatus, local_LastCompletedObjective) == 0x000024, "Member 'BP_FL_MainQuestHelper_C_GetLastMainQuestObjectiveWithStatus::local_LastCompletedObjective' has a wrong offset!");
static_assert(offsetof(BP_FL_MainQuestHelper_C_GetLastMainQuestObjectiveWithStatus, Temp_int_Array_Index_Variable) == 0x000034, "Member 'BP_FL_MainQuestHelper_C_GetLastMainQuestObjectiveWithStatus::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_FL_MainQuestHelper_C_GetLastMainQuestObjectiveWithStatus, Temp_int_Loop_Counter_Variable) == 0x000038, "Member 'BP_FL_MainQuestHelper_C_GetLastMainQuestObjectiveWithStatus::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_FL_MainQuestHelper_C_GetLastMainQuestObjectiveWithStatus, CallFunc_Add_IntInt_ReturnValue) == 0x00003C, "Member 'BP_FL_MainQuestHelper_C_GetLastMainQuestObjectiveWithStatus::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FL_MainQuestHelper_C_GetLastMainQuestObjectiveWithStatus, Temp_bool_True_if_break_was_hit_Variable) == 0x000040, "Member 'BP_FL_MainQuestHelper_C_GetLastMainQuestObjectiveWithStatus::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(BP_FL_MainQuestHelper_C_GetLastMainQuestObjectiveWithStatus, CallFunc_Not_PreBool_ReturnValue) == 0x000041, "Member 'BP_FL_MainQuestHelper_C_GetLastMainQuestObjectiveWithStatus::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FL_MainQuestHelper_C_GetLastMainQuestObjectiveWithStatus, CallFunc_CreateQuestIdentifier_ReturnValue) == 0x000044, "Member 'BP_FL_MainQuestHelper_C_GetLastMainQuestObjectiveWithStatus::CallFunc_CreateQuestIdentifier_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FL_MainQuestHelper_C_GetLastMainQuestObjectiveWithStatus, CallFunc_NotEqual_NameName_ReturnValue) == 0x00004C, "Member 'BP_FL_MainQuestHelper_C_GetLastMainQuestObjectiveWithStatus::CallFunc_NotEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FL_MainQuestHelper_C_GetLastMainQuestObjectiveWithStatus, CallFunc_GetObjectiveList_ObjectiveIdentifiers) == 0x000050, "Member 'BP_FL_MainQuestHelper_C_GetLastMainQuestObjectiveWithStatus::CallFunc_GetObjectiveList_ObjectiveIdentifiers' has a wrong offset!");
static_assert(offsetof(BP_FL_MainQuestHelper_C_GetLastMainQuestObjectiveWithStatus, CallFunc_Array_Length_ReturnValue) == 0x000060, "Member 'BP_FL_MainQuestHelper_C_GetLastMainQuestObjectiveWithStatus::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FL_MainQuestHelper_C_GetLastMainQuestObjectiveWithStatus, CallFunc_Array_Get_Item) == 0x000064, "Member 'BP_FL_MainQuestHelper_C_GetLastMainQuestObjectiveWithStatus::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_FL_MainQuestHelper_C_GetLastMainQuestObjectiveWithStatus, CallFunc_Less_IntInt_ReturnValue) == 0x000074, "Member 'BP_FL_MainQuestHelper_C_GetLastMainQuestObjectiveWithStatus::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FL_MainQuestHelper_C_GetLastMainQuestObjectiveWithStatus, CallFunc_BooleanAND_ReturnValue) == 0x000075, "Member 'BP_FL_MainQuestHelper_C_GetLastMainQuestObjectiveWithStatus::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FL_MainQuestHelper_C_GetLastMainQuestObjectiveWithStatus, CallFunc_GetObjectiveStatus_Status) == 0x000076, "Member 'BP_FL_MainQuestHelper_C_GetLastMainQuestObjectiveWithStatus::CallFunc_GetObjectiveStatus_Status' has a wrong offset!");
static_assert(offsetof(BP_FL_MainQuestHelper_C_GetLastMainQuestObjectiveWithStatus, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000077, "Member 'BP_FL_MainQuestHelper_C_GetLastMainQuestObjectiveWithStatus::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function BP_FL_MainQuestHelper.BP_FL_MainQuestHelper_C.GetCurrentMainPathStatus
// 0x00A0 (0x00A0 - 0x0000)
struct BP_FL_MainQuestHelper_C_GetCurrentMainPathStatus final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	E_CurrentAct                                  CurrentAct;                                        // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_MainQuest_Step                              CurrentStep;                                       // 0x0009(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuestObjectiveIdentifier              local_LastCompletedObjective;                      // 0x000C(0x0010)(Edit, BlueprintVisible, NoDestructor)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_CreateQuestIdentifier_ReturnValue;        // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_QuestStatus                                 CallFunc_GetQuestStatus_Status;                    // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames;         // 0x0038(0x0010)(ReferenceParm)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Array_Get_Item;                           // 0x004C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_MainQuestData                       CallFunc_GetDataTableRowFromName_OutRow;           // 0x0058(0x0028)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Equal_FQuestObjectiveIdentifier_ReturnValue; // 0x0085(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_86[0x2];                                       // 0x0086(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuestObjectiveIdentifier              CallFunc_GetLastMainQuestObjectiveWithStatus_QuestObjective; // 0x0088(0x0010)(NoDestructor)
	bool                                          CallFunc_GetLastMainQuestObjectiveWithStatus_IsValid; // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FL_MainQuestHelper_C_GetCurrentMainPathStatus) == 0x000008, "Wrong alignment on BP_FL_MainQuestHelper_C_GetCurrentMainPathStatus");
static_assert(sizeof(BP_FL_MainQuestHelper_C_GetCurrentMainPathStatus) == 0x0000A0, "Wrong size on BP_FL_MainQuestHelper_C_GetCurrentMainPathStatus");
static_assert(offsetof(BP_FL_MainQuestHelper_C_GetCurrentMainPathStatus, __WorldContext) == 0x000000, "Member 'BP_FL_MainQuestHelper_C_GetCurrentMainPathStatus::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_FL_MainQuestHelper_C_GetCurrentMainPathStatus, CurrentAct) == 0x000008, "Member 'BP_FL_MainQuestHelper_C_GetCurrentMainPathStatus::CurrentAct' has a wrong offset!");
static_assert(offsetof(BP_FL_MainQuestHelper_C_GetCurrentMainPathStatus, CurrentStep) == 0x000009, "Member 'BP_FL_MainQuestHelper_C_GetCurrentMainPathStatus::CurrentStep' has a wrong offset!");
static_assert(offsetof(BP_FL_MainQuestHelper_C_GetCurrentMainPathStatus, local_LastCompletedObjective) == 0x00000C, "Member 'BP_FL_MainQuestHelper_C_GetCurrentMainPathStatus::local_LastCompletedObjective' has a wrong offset!");
static_assert(offsetof(BP_FL_MainQuestHelper_C_GetCurrentMainPathStatus, Temp_int_Array_Index_Variable) == 0x00001C, "Member 'BP_FL_MainQuestHelper_C_GetCurrentMainPathStatus::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_FL_MainQuestHelper_C_GetCurrentMainPathStatus, Temp_int_Loop_Counter_Variable) == 0x000020, "Member 'BP_FL_MainQuestHelper_C_GetCurrentMainPathStatus::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_FL_MainQuestHelper_C_GetCurrentMainPathStatus, CallFunc_Add_IntInt_ReturnValue) == 0x000024, "Member 'BP_FL_MainQuestHelper_C_GetCurrentMainPathStatus::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FL_MainQuestHelper_C_GetCurrentMainPathStatus, CallFunc_CreateQuestIdentifier_ReturnValue) == 0x000028, "Member 'BP_FL_MainQuestHelper_C_GetCurrentMainPathStatus::CallFunc_CreateQuestIdentifier_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FL_MainQuestHelper_C_GetCurrentMainPathStatus, CallFunc_GetQuestStatus_Status) == 0x000030, "Member 'BP_FL_MainQuestHelper_C_GetCurrentMainPathStatus::CallFunc_GetQuestStatus_Status' has a wrong offset!");
static_assert(offsetof(BP_FL_MainQuestHelper_C_GetCurrentMainPathStatus, CallFunc_GetDataTableRowNames_OutRowNames) == 0x000038, "Member 'BP_FL_MainQuestHelper_C_GetCurrentMainPathStatus::CallFunc_GetDataTableRowNames_OutRowNames' has a wrong offset!");
static_assert(offsetof(BP_FL_MainQuestHelper_C_GetCurrentMainPathStatus, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000048, "Member 'BP_FL_MainQuestHelper_C_GetCurrentMainPathStatus::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FL_MainQuestHelper_C_GetCurrentMainPathStatus, CallFunc_Array_Get_Item) == 0x00004C, "Member 'BP_FL_MainQuestHelper_C_GetCurrentMainPathStatus::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_FL_MainQuestHelper_C_GetCurrentMainPathStatus, CallFunc_GetDataTableRowFromName_OutRow) == 0x000058, "Member 'BP_FL_MainQuestHelper_C_GetCurrentMainPathStatus::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BP_FL_MainQuestHelper_C_GetCurrentMainPathStatus, CallFunc_Array_Length_ReturnValue) == 0x000080, "Member 'BP_FL_MainQuestHelper_C_GetCurrentMainPathStatus::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FL_MainQuestHelper_C_GetCurrentMainPathStatus, CallFunc_Less_IntInt_ReturnValue) == 0x000084, "Member 'BP_FL_MainQuestHelper_C_GetCurrentMainPathStatus::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FL_MainQuestHelper_C_GetCurrentMainPathStatus, CallFunc_Equal_FQuestObjectiveIdentifier_ReturnValue) == 0x000085, "Member 'BP_FL_MainQuestHelper_C_GetCurrentMainPathStatus::CallFunc_Equal_FQuestObjectiveIdentifier_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FL_MainQuestHelper_C_GetCurrentMainPathStatus, CallFunc_GetLastMainQuestObjectiveWithStatus_QuestObjective) == 0x000088, "Member 'BP_FL_MainQuestHelper_C_GetCurrentMainPathStatus::CallFunc_GetLastMainQuestObjectiveWithStatus_QuestObjective' has a wrong offset!");
static_assert(offsetof(BP_FL_MainQuestHelper_C_GetCurrentMainPathStatus, CallFunc_GetLastMainQuestObjectiveWithStatus_IsValid) == 0x000098, "Member 'BP_FL_MainQuestHelper_C_GetCurrentMainPathStatus::CallFunc_GetLastMainQuestObjectiveWithStatus_IsValid' has a wrong offset!");

// Function BP_FL_MainQuestHelper.BP_FL_MainQuestHelper_C.GetMainQuestObjectiveText
// 0x0050 (0x0050 - 0x0000)
struct BP_FL_MainQuestHelper_C_GetMainQuestObjectiveText final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   Text;                                              // 0x0008(0x0010)(Parm, OutParm)
	struct FQuestObjectiveIdentifier              CallFunc_GetLastMainQuestObjectiveWithStatus_QuestObjective; // 0x0018(0x0010)(NoDestructor)
	bool                                          CallFunc_GetLastMainQuestObjectiveWithStatus_IsValid; // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDataTable*                             CallFunc_GetObjectiveDataTable_ReturnValue;        // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FS_QuestObjective                      CallFunc_GetDataTableRowFromName_OutRow;           // 0x0038(0x0010)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FL_MainQuestHelper_C_GetMainQuestObjectiveText) == 0x000008, "Wrong alignment on BP_FL_MainQuestHelper_C_GetMainQuestObjectiveText");
static_assert(sizeof(BP_FL_MainQuestHelper_C_GetMainQuestObjectiveText) == 0x000050, "Wrong size on BP_FL_MainQuestHelper_C_GetMainQuestObjectiveText");
static_assert(offsetof(BP_FL_MainQuestHelper_C_GetMainQuestObjectiveText, __WorldContext) == 0x000000, "Member 'BP_FL_MainQuestHelper_C_GetMainQuestObjectiveText::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_FL_MainQuestHelper_C_GetMainQuestObjectiveText, Text) == 0x000008, "Member 'BP_FL_MainQuestHelper_C_GetMainQuestObjectiveText::Text' has a wrong offset!");
