#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FL_SpawnPointHelpers

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_FL_SpawnPointHelpers.BP_FL_SpawnPointHelpers_C.GetSpawnPointManager
// 0x0018 (0x0018 - 0x0000)
struct BP_FL_SpawnPointHelpers_C_GetSpawnPointManager final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_SpawnPointManager_C*                SpawnPointManager;                                 // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_jRPG_GI_Custom_C*                   CallFunc_GetCustomGI_ReturnValue;                  // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FL_SpawnPointHelpers_C_GetSpawnPointManager) == 0x000008, "Wrong alignment on BP_FL_SpawnPointHelpers_C_GetSpawnPointManager");
static_assert(sizeof(BP_FL_SpawnPointHelpers_C_GetSpawnPointManager) == 0x000018, "Wrong size on BP_FL_SpawnPointHelpers_C_GetSpawnPointManager");
static_assert(offsetof(BP_FL_SpawnPointHelpers_C_GetSpawnPointManager, __WorldContext) == 0x000000, "Member 'BP_FL_SpawnPointHelpers_C_GetSpawnPointManager::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_FL_SpawnPointHelpers_C_GetSpawnPointManager, SpawnPointManager) == 0x000008, "Member 'BP_FL_SpawnPointHelpers_C_GetSpawnPointManager::SpawnPointManager' has a wrong offset!");
static_assert(offsetof(BP_FL_SpawnPointHelpers_C_GetSpawnPointManager, CallFunc_GetCustomGI_ReturnValue) == 0x000010, "Member 'BP_FL_SpawnPointHelpers_C_GetSpawnPointManager::CallFunc_GetCustomGI_ReturnValue' has a wrong offset!");

}

