#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FreeAimCamera

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_FreeAimCamera.BP_FreeAimCamera_C
// 0x0038 (0x02C8 - 0x0290)
class ABP_FreeAimCamera_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCameraComponent*                       FreeAimCamera;                                     // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_Alpha_D8D5930744498794AD9D0E88635DC5EA; // 0x02A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_D8D5930744498794AD9D0E88635DC5EA; // 0x02AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2AD[0x3];                                      // 0x02AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         _TO1_Alpha_D873B6904FA48C1BD2534ABDAB7973FA;       // 0x02B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            _TO1__Direction_D873B6904FA48C1BD2534ABDAB7973FA;  // 0x02BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2BD[0x3];                                      // 0x02BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Zeroto1;                                           // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void ZeroTO1__FinishedFunc();
	void ZeroTO1__UpdateFunc();
	void ExecuteUbergraph_BP_FreeAimCamera(int32 EntryPoint);
	void Timeline_0__FinishedFunc();
	void Timeline_0__UpdateFunc();
	void TPinAim();
	void TPNotInAim();
	void TPShot();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_FreeAimCamera_C">();
	}
	static class ABP_FreeAimCamera_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_FreeAimCamera_C>();
	}
};
static_assert(alignof(ABP_FreeAimCamera_C) == 0x000008, "Wrong alignment on ABP_FreeAimCamera_C");
static_assert(sizeof(ABP_FreeAimCamera_C) == 0x0002C8, "Wrong size on ABP_FreeAimCamera_C");
static_assert(offsetof(ABP_FreeAimCamera_C, UberGraphFrame) == 0x000290, "Member 'ABP_FreeAimCamera_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_FreeAimCamera_C, FreeAimCamera) == 0x000298, "Member 'ABP_FreeAimCamera_C::FreeAimCamera' has a wrong offset!");
static_assert(offsetof(ABP_FreeAimCamera_C, DefaultSceneRoot) == 0x0002A0, "Member 'ABP_FreeAimCamera_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_FreeAimCamera_C, Timeline_0_Alpha_D8D5930744498794AD9D0E88635DC5EA) == 0x0002A8, "Member 'ABP_FreeAimCamera_C::Timeline_0_Alpha_D8D5930744498794AD9D0E88635DC5EA' has a wrong offset!");
static_assert(offsetof(ABP_FreeAimCamera_C, Timeline_0__Direction_D8D5930744498794AD9D0E88635DC5EA) == 0x0002AC, "Member 'ABP_FreeAimCamera_C::Timeline_0__Direction_D8D5930744498794AD9D0E88635DC5EA' has a wrong offset!");
static_assert(offsetof(ABP_FreeAimCamera_C, Timeline_0) == 0x0002B0, "Member 'ABP_FreeAimCamera_C::Timeline_0' has a wrong offset!");
static_assert(offsetof(ABP_FreeAimCamera_C, _TO1_Alpha_D873B6904FA48C1BD2534ABDAB7973FA) == 0x0002B8, "Member 'ABP_FreeAimCamera_C::_TO1_Alpha_D873B6904FA48C1BD2534ABDAB7973FA' has a wrong offset!");
static_assert(offsetof(ABP_FreeAimCamera_C, _TO1__Direction_D873B6904FA48C1BD2534ABDAB7973FA) == 0x0002BC, "Member 'ABP_FreeAimCamera_C::_TO1__Direction_D873B6904FA48C1BD2534ABDAB7973FA' has a wrong offset!");
static_assert(offsetof(ABP_FreeAimCamera_C, Zeroto1) == 0x0002C0, "Member 'ABP_FreeAimCamera_C::Zeroto1' has a wrong offset!");

}

