#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FL_GameModeHelpers

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_FL_GameModeHelpers.BP_FL_GameModeHelpers_C.GetWorldInfoComponent
// 0x0020 (0x0020 - 0x0000)
struct BP_FL_GameModeHelpers_C_GetWorldInfoComponent final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldInfoComponent_C*               ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue;                  // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldInfoComponent_C*               CallFunc_GetComponentByClass_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FL_GameModeHelpers_C_GetWorldInfoComponent) == 0x000008, "Wrong alignment on BP_FL_GameModeHelpers_C_GetWorldInfoComponent");
static_assert(sizeof(BP_FL_GameModeHelpers_C_GetWorldInfoComponent) == 0x000020, "Wrong size on BP_FL_GameModeHelpers_C_GetWorldInfoComponent");
static_assert(offsetof(BP_FL_GameModeHelpers_C_GetWorldInfoComponent, __WorldContext) == 0x000000, "Member 'BP_FL_GameModeHelpers_C_GetWorldInfoComponent::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_FL_GameModeHelpers_C_GetWorldInfoComponent, ReturnValue) == 0x000008, "Member 'BP_FL_GameModeHelpers_C_GetWorldInfoComponent::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FL_GameModeHelpers_C_GetWorldInfoComponent, CallFunc_GetGameMode_ReturnValue) == 0x000010, "Member 'BP_FL_GameModeHelpers_C_GetWorldInfoComponent::CallFunc_GetGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FL_GameModeHelpers_C_GetWorldInfoComponent, CallFunc_GetComponentByClass_ReturnValue) == 0x000018, "Member 'BP_FL_GameModeHelpers_C_GetWorldInfoComponent::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");

}

