#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FunctionLibrary_ConditionCheckerHelpers

#include "Basic.hpp"

#include "SandFall_structs.hpp"


namespace SDK::Params
{

// Function BP_FunctionLibrary_ConditionCheckerHelpers.BP_FunctionLibrary_ConditionCheckerHelpers_C.CheckCondition
// 0x0018 (0x0018 - 0x0000)
struct BP_FunctionLibrary_ConditionCheckerHelpers_C_CheckCondition final
{
public:
	struct FConditionChecker_Wrapper              ConditionCheckerWrapper;                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Check_ReturnValue;                        // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FunctionLibrary_ConditionCheckerHelpers_C_CheckCondition) == 0x000008, "Wrong alignment on BP_FunctionLibrary_ConditionCheckerHelpers_C_CheckCondition");
static_assert(sizeof(BP_FunctionLibrary_ConditionCheckerHelpers_C_CheckCondition) == 0x000018, "Wrong size on BP_FunctionLibrary_ConditionCheckerHelpers_C_CheckCondition");
static_assert(offsetof(BP_FunctionLibrary_ConditionCheckerHelpers_C_CheckCondition, ConditionCheckerWrapper) == 0x000000, "Member 'BP_FunctionLibrary_ConditionCheckerHelpers_C_CheckCondition::ConditionCheckerWrapper' has a wrong offset!");
static_assert(offsetof(BP_FunctionLibrary_ConditionCheckerHelpers_C_CheckCondition, __WorldContext) == 0x000008, "Member 'BP_FunctionLibrary_ConditionCheckerHelpers_C_CheckCondition::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_FunctionLibrary_ConditionCheckerHelpers_C_CheckCondition, Result) == 0x000010, "Member 'BP_FunctionLibrary_ConditionCheckerHelpers_C_CheckCondition::Result' has a wrong offset!");
static_assert(offsetof(BP_FunctionLibrary_ConditionCheckerHelpers_C_CheckCondition, CallFunc_Check_ReturnValue) == 0x000011, "Member 'BP_FunctionLibrary_ConditionCheckerHelpers_C_CheckCondition::CallFunc_Check_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FunctionLibrary_ConditionCheckerHelpers_C_CheckCondition, CallFunc_IsValid_ReturnValue) == 0x000012, "Member 'BP_FunctionLibrary_ConditionCheckerHelpers_C_CheckCondition::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_FunctionLibrary_ConditionCheckerHelpers.BP_FunctionLibrary_ConditionCheckerHelpers_C.CheckOptionalCondition
// 0x0018 (0x0018 - 0x0000)
struct BP_FunctionLibrary_ConditionCheckerHelpers_C_CheckOptionalCondition final
{
public:
	struct FConditionChecker_Wrapper              ConditionCheckerWrapper;                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Check_ReturnValue;                        // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FunctionLibrary_ConditionCheckerHelpers_C_CheckOptionalCondition) == 0x000008, "Wrong alignment on BP_FunctionLibrary_ConditionCheckerHelpers_C_CheckOptionalCondition");
static_assert(sizeof(BP_FunctionLibrary_ConditionCheckerHelpers_C_CheckOptionalCondition) == 0x000018, "Wrong size on BP_FunctionLibrary_ConditionCheckerHelpers_C_CheckOptionalCondition");
static_assert(offsetof(BP_FunctionLibrary_ConditionCheckerHelpers_C_CheckOptionalCondition, ConditionCheckerWrapper) == 0x000000, "Member 'BP_FunctionLibrary_ConditionCheckerHelpers_C_CheckOptionalCondition::ConditionCheckerWrapper' has a wrong offset!");
static_assert(offsetof(BP_FunctionLibrary_ConditionCheckerHelpers_C_CheckOptionalCondition, __WorldContext) == 0x000008, "Member 'BP_FunctionLibrary_ConditionCheckerHelpers_C_CheckOptionalCondition::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_FunctionLibrary_ConditionCheckerHelpers_C_CheckOptionalCondition, Result) == 0x000010, "Member 'BP_FunctionLibrary_ConditionCheckerHelpers_C_CheckOptionalCondition::Result' has a wrong offset!");
static_assert(offsetof(BP_FunctionLibrary_ConditionCheckerHelpers_C_CheckOptionalCondition, CallFunc_IsValid_ReturnValue) == 0x000011, "Member 'BP_FunctionLibrary_ConditionCheckerHelpers_C_CheckOptionalCondition::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FunctionLibrary_ConditionCheckerHelpers_C_CheckOptionalCondition, CallFunc_Check_ReturnValue) == 0x000012, "Member 'BP_FunctionLibrary_ConditionCheckerHelpers_C_CheckOptionalCondition::CallFunc_Check_ReturnValue' has a wrong offset!");

// Function BP_FunctionLibrary_ConditionCheckerHelpers.BP_FunctionLibrary_ConditionCheckerHelpers_C.IsConditionSet
// 0x0018 (0x0018 - 0x0000)
struct BP_FunctionLibrary_ConditionCheckerHelpers_C_IsConditionSet final
{
public:
	struct FConditionChecker_Wrapper              ConditionCheckerWrapper;                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FunctionLibrary_ConditionCheckerHelpers_C_IsConditionSet) == 0x000008, "Wrong alignment on BP_FunctionLibrary_ConditionCheckerHelpers_C_IsConditionSet");
static_assert(sizeof(BP_FunctionLibrary_ConditionCheckerHelpers_C_IsConditionSet) == 0x000018, "Wrong size on BP_FunctionLibrary_ConditionCheckerHelpers_C_IsConditionSet");
static_assert(offsetof(BP_FunctionLibrary_ConditionCheckerHelpers_C_IsConditionSet, ConditionCheckerWrapper) == 0x000000, "Member 'BP_FunctionLibrary_ConditionCheckerHelpers_C_IsConditionSet::ConditionCheckerWrapper' has a wrong offset!");
static_assert(offsetof(BP_FunctionLibrary_ConditionCheckerHelpers_C_IsConditionSet, __WorldContext) == 0x000008, "Member 'BP_FunctionLibrary_ConditionCheckerHelpers_C_IsConditionSet::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_FunctionLibrary_ConditionCheckerHelpers_C_IsConditionSet, Result) == 0x000010, "Member 'BP_FunctionLibrary_ConditionCheckerHelpers_C_IsConditionSet::Result' has a wrong offset!");
static_assert(offsetof(BP_FunctionLibrary_ConditionCheckerHelpers_C_IsConditionSet, CallFunc_IsValid_ReturnValue) == 0x000011, "Member 'BP_FunctionLibrary_ConditionCheckerHelpers_C_IsConditionSet::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_FunctionLibrary_ConditionCheckerHelpers.BP_FunctionLibrary_ConditionCheckerHelpers_C.ValidateCondition
// 0x0048 (0x0048 - 0x0000)
struct BP_FunctionLibrary_ConditionCheckerHelpers_C_ValidateCondition final
{
public:
	struct FConditionChecker_Wrapper              Condition;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	TArray<class FText>                           ErrorMessages;                                     // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FString                                 PropertyPath;                                      // 0x0018(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_ConditionChecker_C*                 K2Node_DynamicCast_AsBP_Condition_Checker;         // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FunctionLibrary_ConditionCheckerHelpers_C_ValidateCondition) == 0x000008, "Wrong alignment on BP_FunctionLibrary_ConditionCheckerHelpers_C_ValidateCondition");
static_assert(sizeof(BP_FunctionLibrary_ConditionCheckerHelpers_C_ValidateCondition) == 0x000048, "Wrong size on BP_FunctionLibrary_ConditionCheckerHelpers_C_ValidateCondition");
static_assert(offsetof(BP_FunctionLibrary_ConditionCheckerHelpers_C_ValidateCondition, Condition) == 0x000000, "Member 'BP_FunctionLibrary_ConditionCheckerHelpers_C_ValidateCondition::Condition' has a wrong offset!");
static_assert(offsetof(BP_FunctionLibrary_ConditionCheckerHelpers_C_ValidateCondition, ErrorMessages) == 0x000008, "Member 'BP_FunctionLibrary_ConditionCheckerHelpers_C_ValidateCondition::ErrorMessages' has a wrong offset!");
static_assert(offsetof(BP_FunctionLibrary_ConditionCheckerHelpers_C_ValidateCondition, PropertyPath) == 0x000018, "Member 'BP_FunctionLibrary_ConditionCheckerHelpers_C_ValidateCondition::PropertyPath' has a wrong offset!");
static_assert(offsetof(BP_FunctionLibrary_ConditionCheckerHelpers_C_ValidateCondition, __WorldContext) == 0x000028, "Member 'BP_FunctionLibrary_ConditionCheckerHelpers_C_ValidateCondition::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_FunctionLibrary_ConditionCheckerHelpers_C_ValidateCondition, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'BP_FunctionLibrary_ConditionCheckerHelpers_C_ValidateCondition::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FunctionLibrary_ConditionCheckerHelpers_C_ValidateCondition, K2Node_DynamicCast_AsBP_Condition_Checker) == 0x000038, "Member 'BP_FunctionLibrary_ConditionCheckerHelpers_C_ValidateCondition::K2Node_DynamicCast_AsBP_Condition_Checker' has a wrong offset!");
static_assert(offsetof(BP_FunctionLibrary_ConditionCheckerHelpers_C_ValidateCondition, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'BP_FunctionLibrary_ConditionCheckerHelpers_C_ValidateCondition::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BP_FunctionLibrary_ConditionCheckerHelpers.BP_FunctionLibrary_ConditionCheckerHelpers_C.BindEventOnGameStateChanged
// 0x0030 (0x0030 - 0x0000)
struct BP_FunctionLibrary_ConditionCheckerHelpers_C_BindEventOnGameStateChanged final
{
public:
	TDelegate<void()>                             Event;                                             // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	struct FConditionChecker_Wrapper              Condition;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class UObject*                                __WorldContext;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_ConditionChecker_C*                 K2Node_DynamicCast_AsBP_Condition_Checker;         // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FunctionLibrary_ConditionCheckerHelpers_C_BindEventOnGameStateChanged) == 0x000008, "Wrong alignment on BP_FunctionLibrary_ConditionCheckerHelpers_C_BindEventOnGameStateChanged");
static_assert(sizeof(BP_FunctionLibrary_ConditionCheckerHelpers_C_BindEventOnGameStateChanged) == 0x000030, "Wrong size on BP_FunctionLibrary_ConditionCheckerHelpers_C_BindEventOnGameStateChanged");
static_assert(offsetof(BP_FunctionLibrary_ConditionCheckerHelpers_C_BindEventOnGameStateChanged, Event) == 0x000000, "Member 'BP_FunctionLibrary_ConditionCheckerHelpers_C_BindEventOnGameStateChanged::Event' has a wrong offset!");
static_assert(offsetof(BP_FunctionLibrary_ConditionCheckerHelpers_C_BindEventOnGameStateChanged, Condition) == 0x000010, "Member 'BP_FunctionLibrary_ConditionCheckerHelpers_C_BindEventOnGameStateChanged::Condition' has a wrong offset!");
static_assert(offsetof(BP_FunctionLibrary_ConditionCheckerHelpers_C_BindEventOnGameStateChanged, __WorldContext) == 0x000018, "Member 'BP_FunctionLibrary_ConditionCheckerHelpers_C_BindEventOnGameStateChanged::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_FunctionLibrary_ConditionCheckerHelpers_C_BindEventOnGameStateChanged, K2Node_DynamicCast_AsBP_Condition_Checker) == 0x000020, "Member 'BP_FunctionLibrary_ConditionCheckerHelpers_C_BindEventOnGameStateChanged::K2Node_DynamicCast_AsBP_Condition_Checker' has a wrong offset!");
static_assert(offsetof(BP_FunctionLibrary_ConditionCheckerHelpers_C_BindEventOnGameStateChanged, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BP_FunctionLibrary_ConditionCheckerHelpers_C_BindEventOnGameStateChanged::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BP_FunctionLibrary_ConditionCheckerHelpers.BP_FunctionLibrary_ConditionCheckerHelpers_C.UnbindEventOnGameStateChanged
// 0x0030 (0x0030 - 0x0000)
struct BP_FunctionLibrary_ConditionCheckerHelpers_C_UnbindEventOnGameStateChanged final
{
public:
	TDelegate<void()>                             Event;                                             // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	struct FConditionChecker_Wrapper              Condition;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class UObject*                                __WorldContext;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_ConditionChecker_C*                 K2Node_DynamicCast_AsBP_Condition_Checker;         // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FunctionLibrary_ConditionCheckerHelpers_C_UnbindEventOnGameStateChanged) == 0x000008, "Wrong alignment on BP_FunctionLibrary_ConditionCheckerHelpers_C_UnbindEventOnGameStateChanged");
static_assert(sizeof(BP_FunctionLibrary_ConditionCheckerHelpers_C_UnbindEventOnGameStateChanged) == 0x000030, "Wrong size on BP_FunctionLibrary_ConditionCheckerHelpers_C_UnbindEventOnGameStateChanged");
static_assert(offsetof(BP_FunctionLibrary_ConditionCheckerHelpers_C_UnbindEventOnGameStateChanged, Event) == 0x000000, "Member 'BP_FunctionLibrary_ConditionCheckerHelpers_C_UnbindEventOnGameStateChanged::Event' has a wrong offset!");
static_assert(offsetof(BP_FunctionLibrary_ConditionCheckerHelpers_C_UnbindEventOnGameStateChanged, Condition) == 0x000010, "Member 'BP_FunctionLibrary_ConditionCheckerHelpers_C_UnbindEventOnGameStateChanged::Condition' has a wrong offset!");
static_assert(offsetof(BP_FunctionLibrary_ConditionCheckerHelpers_C_UnbindEventOnGameStateChanged, __WorldContext) == 0x000018, "Member 'BP_FunctionLibrary_ConditionCheckerHelpers_C_UnbindEventOnGameStateChanged::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_FunctionLibrary_ConditionCheckerHelpers_C_UnbindEventOnGameStateChanged, K2Node_DynamicCast_AsBP_Condition_Checker) == 0x000020, "Member 'BP_FunctionLibrary_ConditionCheckerHelpers_C_UnbindEventOnGameStateChanged::K2Node_DynamicCast_AsBP_Condition_Checker' has a wrong offset!");
static_assert(offsetof(BP_FunctionLibrary_ConditionCheckerHelpers_C_UnbindEventOnGameStateChanged, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BP_FunctionLibrary_ConditionCheckerHelpers_C_UnbindEventOnGameStateChanged::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

