#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FL_DialogueHelpers

#include "Basic.hpp"

#include "SandFall_structs.hpp"
#include "S_jRPG_Item_StaticData_structs.hpp"


namespace SDK::Params
{

// Function BP_FL_DialogueHelpers.BP_FL_DialogueHelpers_C.GetItemStructFromDataTableRowHandle
// 0x0288 (0x0288 - 0x0000)
struct BP_FL_DialogueHelpers_C_GetItemStructFromDataTableRowHandle final
{
public:
	struct FItemDataTableRowHandle                ItemDataTableRowHandle;                            // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Found;                                             // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_jRPG_Item_StaticData                ItemStruct;                                        // 0x0020(0x0130)(Parm, OutParm, ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_GetItemStaticDefinitionFromID_Found;      // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_jRPG_Item_StaticData                CallFunc_GetItemStaticDefinitionFromID_ReturnValue; // 0x0158(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
};
static_assert(alignof(BP_FL_DialogueHelpers_C_GetItemStructFromDataTableRowHandle) == 0x000008, "Wrong alignment on BP_FL_DialogueHelpers_C_GetItemStructFromDataTableRowHandle");
static_assert(sizeof(BP_FL_DialogueHelpers_C_GetItemStructFromDataTableRowHandle) == 0x000288, "Wrong size on BP_FL_DialogueHelpers_C_GetItemStructFromDataTableRowHandle");
static_assert(offsetof(BP_FL_DialogueHelpers_C_GetItemStructFromDataTableRowHandle, ItemDataTableRowHandle) == 0x000000, "Member 'BP_FL_DialogueHelpers_C_GetItemStructFromDataTableRowHandle::ItemDataTableRowHandle' has a wrong offset!");
static_assert(offsetof(BP_FL_DialogueHelpers_C_GetItemStructFromDataTableRowHandle, __WorldContext) == 0x000010, "Member 'BP_FL_DialogueHelpers_C_GetItemStructFromDataTableRowHandle::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_FL_DialogueHelpers_C_GetItemStructFromDataTableRowHandle, Found) == 0x000018, "Member 'BP_FL_DialogueHelpers_C_GetItemStructFromDataTableRowHandle::Found' has a wrong offset!");
static_assert(offsetof(BP_FL_DialogueHelpers_C_GetItemStructFromDataTableRowHandle, ItemStruct) == 0x000020, "Member 'BP_FL_DialogueHelpers_C_GetItemStructFromDataTableRowHandle::ItemStruct' has a wrong offset!");
static_assert(offsetof(BP_FL_DialogueHelpers_C_GetItemStructFromDataTableRowHandle, CallFunc_GetItemStaticDefinitionFromID_Found) == 0x000150, "Member 'BP_FL_DialogueHelpers_C_GetItemStructFromDataTableRowHandle::CallFunc_GetItemStaticDefinitionFromID_Found' has a wrong offset!");
static_assert(offsetof(BP_FL_DialogueHelpers_C_GetItemStructFromDataTableRowHandle, CallFunc_GetItemStaticDefinitionFromID_ReturnValue) == 0x000158, "Member 'BP_FL_DialogueHelpers_C_GetItemStructFromDataTableRowHandle::CallFunc_GetItemStaticDefinitionFromID_ReturnValue' has a wrong offset!");

// Function BP_FL_DialogueHelpers.BP_FL_DialogueHelpers_C.SetSpeakerIsActive
// 0x0028 (0x0028 - 0x0000)
struct BP_FL_DialogueHelpers_C_SetSpeakerIsActive final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          IsActive;                                          // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_jRPG_NPC_Dialog_C*                  K2Node_DynamicCast_AsBP_J_RPG_NPC_Dialog;          // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FL_DialogueHelpers_C_SetSpeakerIsActive) == 0x000008, "Wrong alignment on BP_FL_DialogueHelpers_C_SetSpeakerIsActive");
static_assert(sizeof(BP_FL_DialogueHelpers_C_SetSpeakerIsActive) == 0x000028, "Wrong size on BP_FL_DialogueHelpers_C_SetSpeakerIsActive");
static_assert(offsetof(BP_FL_DialogueHelpers_C_SetSpeakerIsActive, Actor) == 0x000000, "Member 'BP_FL_DialogueHelpers_C_SetSpeakerIsActive::Actor' has a wrong offset!");
static_assert(offsetof(BP_FL_DialogueHelpers_C_SetSpeakerIsActive, IsActive) == 0x000008, "Member 'BP_FL_DialogueHelpers_C_SetSpeakerIsActive::IsActive' has a wrong offset!");
static_assert(offsetof(BP_FL_DialogueHelpers_C_SetSpeakerIsActive, __WorldContext) == 0x000010, "Member 'BP_FL_DialogueHelpers_C_SetSpeakerIsActive::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_FL_DialogueHelpers_C_SetSpeakerIsActive, K2Node_DynamicCast_AsBP_J_RPG_NPC_Dialog) == 0x000018, "Member 'BP_FL_DialogueHelpers_C_SetSpeakerIsActive::K2Node_DynamicCast_AsBP_J_RPG_NPC_Dialog' has a wrong offset!");
static_assert(offsetof(BP_FL_DialogueHelpers_C_SetSpeakerIsActive, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_FL_DialogueHelpers_C_SetSpeakerIsActive::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_FL_DialogueHelpers_C_SetSpeakerIsActive, CallFunc_Not_PreBool_ReturnValue) == 0x000021, "Member 'BP_FL_DialogueHelpers_C_SetSpeakerIsActive::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

}

