#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FL_EnemyGroup_Helpers

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_FL_EnemyGroup_Helpers.BP_FL_EnemyGroup_Helpers_C.UnlinkEnemyWorldToGroup
// 0x0060 (0x0060 - 0x0000)
struct BP_FL_EnemyGroup_Helpers_C_UnlinkEnemyWorldToGroup final
{
public:
	class ABP_EnemyGroup_C*                       Group;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_jRPG_Enemy_World_Base_Seamless_C*   EnemyWorld;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class ABP_jRPG_Enemy_World_Base_Seamless_C> CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue; // 0x0018(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_EnemyGroup_C*                       K2Node_DynamicCast_AsBP_Enemy_Group;               // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FL_EnemyGroup_Helpers_C_UnlinkEnemyWorldToGroup) == 0x000008, "Wrong alignment on BP_FL_EnemyGroup_Helpers_C_UnlinkEnemyWorldToGroup");
static_assert(sizeof(BP_FL_EnemyGroup_Helpers_C_UnlinkEnemyWorldToGroup) == 0x000060, "Wrong size on BP_FL_EnemyGroup_Helpers_C_UnlinkEnemyWorldToGroup");
static_assert(offsetof(BP_FL_EnemyGroup_Helpers_C_UnlinkEnemyWorldToGroup, Group) == 0x000000, "Member 'BP_FL_EnemyGroup_Helpers_C_UnlinkEnemyWorldToGroup::Group' has a wrong offset!");
static_assert(offsetof(BP_FL_EnemyGroup_Helpers_C_UnlinkEnemyWorldToGroup, EnemyWorld) == 0x000008, "Member 'BP_FL_EnemyGroup_Helpers_C_UnlinkEnemyWorldToGroup::EnemyWorld' has a wrong offset!");
static_assert(offsetof(BP_FL_EnemyGroup_Helpers_C_UnlinkEnemyWorldToGroup, __WorldContext) == 0x000010, "Member 'BP_FL_EnemyGroup_Helpers_C_UnlinkEnemyWorldToGroup::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_FL_EnemyGroup_Helpers_C_UnlinkEnemyWorldToGroup, CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue) == 0x000018, "Member 'BP_FL_EnemyGroup_Helpers_C_UnlinkEnemyWorldToGroup::CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FL_EnemyGroup_Helpers_C_UnlinkEnemyWorldToGroup, CallFunc_Array_RemoveItem_ReturnValue) == 0x000040, "Member 'BP_FL_EnemyGroup_Helpers_C_UnlinkEnemyWorldToGroup::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FL_EnemyGroup_Helpers_C_UnlinkEnemyWorldToGroup, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue) == 0x000048, "Member 'BP_FL_EnemyGroup_Helpers_C_UnlinkEnemyWorldToGroup::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FL_EnemyGroup_Helpers_C_UnlinkEnemyWorldToGroup, K2Node_DynamicCast_AsBP_Enemy_Group) == 0x000050, "Member 'BP_FL_EnemyGroup_Helpers_C_UnlinkEnemyWorldToGroup::K2Node_DynamicCast_AsBP_Enemy_Group' has a wrong offset!");
static_assert(offsetof(BP_FL_EnemyGroup_Helpers_C_UnlinkEnemyWorldToGroup, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'BP_FL_EnemyGroup_Helpers_C_UnlinkEnemyWorldToGroup::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_FL_EnemyGroup_Helpers_C_UnlinkEnemyWorldToGroup, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000059, "Member 'BP_FL_EnemyGroup_Helpers_C_UnlinkEnemyWorldToGroup::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");

// Function BP_FL_EnemyGroup_Helpers.BP_FL_EnemyGroup_Helpers_C.LinkEnemyWorldToGroup
// 0x00C0 (0x00C0 - 0x0000)
struct BP_FL_EnemyGroup_Helpers_C_LinkEnemyWorldToGroup final
{
public:
	class ABP_EnemyGroup_C*                       Group;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_jRPG_Enemy_World_Base_Seamless_C*   EnemyWorld;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class ABP_jRPG_Enemy_World_Base_Seamless_C> CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue; // 0x0018(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	TSoftObjectPtr<class ABP_EnemyGroup_C>        CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue_1; // 0x0040(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_EnemyGroup_C*                       K2Node_DynamicCast_AsBP_Enemy_Group;               // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_1; // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_EnemyGroup_C*                       K2Node_DynamicCast_AsBP_Enemy_Group_1;             // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_2; // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_EnemyGroup_C*                       K2Node_DynamicCast_AsBP_Enemy_Group_2;             // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x3];                                       // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FL_EnemyGroup_Helpers_C_LinkEnemyWorldToGroup) == 0x000008, "Wrong alignment on BP_FL_EnemyGroup_Helpers_C_LinkEnemyWorldToGroup");
static_assert(sizeof(BP_FL_EnemyGroup_Helpers_C_LinkEnemyWorldToGroup) == 0x0000C0, "Wrong size on BP_FL_EnemyGroup_Helpers_C_LinkEnemyWorldToGroup");
static_assert(offsetof(BP_FL_EnemyGroup_Helpers_C_LinkEnemyWorldToGroup, Group) == 0x000000, "Member 'BP_FL_EnemyGroup_Helpers_C_LinkEnemyWorldToGroup::Group' has a wrong offset!");
static_assert(offsetof(BP_FL_EnemyGroup_Helpers_C_LinkEnemyWorldToGroup, EnemyWorld) == 0x000008, "Member 'BP_FL_EnemyGroup_Helpers_C_LinkEnemyWorldToGroup::EnemyWorld' has a wrong offset!");
static_assert(offsetof(BP_FL_EnemyGroup_Helpers_C_LinkEnemyWorldToGroup, __WorldContext) == 0x000010, "Member 'BP_FL_EnemyGroup_Helpers_C_LinkEnemyWorldToGroup::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_FL_EnemyGroup_Helpers_C_LinkEnemyWorldToGroup, CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue) == 0x000018, "Member 'BP_FL_EnemyGroup_Helpers_C_LinkEnemyWorldToGroup::CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FL_EnemyGroup_Helpers_C_LinkEnemyWorldToGroup, CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue_1) == 0x000040, "Member 'BP_FL_EnemyGroup_Helpers_C_LinkEnemyWorldToGroup::CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FL_EnemyGroup_Helpers_C_LinkEnemyWorldToGroup, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue) == 0x000068, "Member 'BP_FL_EnemyGroup_Helpers_C_LinkEnemyWorldToGroup::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FL_EnemyGroup_Helpers_C_LinkEnemyWorldToGroup, K2Node_DynamicCast_AsBP_Enemy_Group) == 0x000070, "Member 'BP_FL_EnemyGroup_Helpers_C_LinkEnemyWorldToGroup::K2Node_DynamicCast_AsBP_Enemy_Group' has a wrong offset!");
static_assert(offsetof(BP_FL_EnemyGroup_Helpers_C_LinkEnemyWorldToGroup, K2Node_DynamicCast_bSuccess) == 0x000078, "Member 'BP_FL_EnemyGroup_Helpers_C_LinkEnemyWorldToGroup::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_FL_EnemyGroup_Helpers_C_LinkEnemyWorldToGroup, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_1) == 0x000080, "Member 'BP_FL_EnemyGroup_Helpers_C_LinkEnemyWorldToGroup::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FL_EnemyGroup_Helpers_C_LinkEnemyWorldToGroup, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000088, "Member 'BP_FL_EnemyGroup_Helpers_C_LinkEnemyWorldToGroup::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FL_EnemyGroup_Helpers_C_LinkEnemyWorldToGroup, K2Node_DynamicCast_AsBP_Enemy_Group_1) == 0x000090, "Member 'BP_FL_EnemyGroup_Helpers_C_LinkEnemyWorldToGroup::K2Node_DynamicCast_AsBP_Enemy_Group_1' has a wrong offset!");
static_assert(offsetof(BP_FL_EnemyGroup_Helpers_C_LinkEnemyWorldToGroup, K2Node_DynamicCast_bSuccess_1) == 0x000098, "Member 'BP_FL_EnemyGroup_Helpers_C_LinkEnemyWorldToGroup::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_FL_EnemyGroup_Helpers_C_LinkEnemyWorldToGroup, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_2) == 0x0000A0, "Member 'BP_FL_EnemyGroup_Helpers_C_LinkEnemyWorldToGroup::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_FL_EnemyGroup_Helpers_C_LinkEnemyWorldToGroup, K2Node_DynamicCast_AsBP_Enemy_Group_2) == 0x0000A8, "Member 'BP_FL_EnemyGroup_Helpers_C_LinkEnemyWorldToGroup::K2Node_DynamicCast_AsBP_Enemy_Group_2' has a wrong offset!");
static_assert(offsetof(BP_FL_EnemyGroup_Helpers_C_LinkEnemyWorldToGroup, K2Node_DynamicCast_bSuccess_2) == 0x0000B0, "Member 'BP_FL_EnemyGroup_Helpers_C_LinkEnemyWorldToGroup::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_FL_EnemyGroup_Helpers_C_LinkEnemyWorldToGroup, CallFunc_Array_AddUnique_ReturnValue) == 0x0000B4, "Member 'BP_FL_EnemyGroup_Helpers_C_LinkEnemyWorldToGroup::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FL_EnemyGroup_Helpers_C_LinkEnemyWorldToGroup, CallFunc_IsValid_ReturnValue) == 0x0000B8, "Member 'BP_FL_EnemyGroup_Helpers_C_LinkEnemyWorldToGroup::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FL_EnemyGroup_Helpers_C_LinkEnemyWorldToGroup, CallFunc_BooleanAND_ReturnValue) == 0x0000B9, "Member 'BP_FL_EnemyGroup_Helpers_C_LinkEnemyWorldToGroup::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

}

