#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FootstepVisualComponent

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_FootstepVisualComponent.BP_FootstepVisualComponent_C.ExecuteUbergraph_BP_FootstepVisualComponent
// 0x0088 (0x0088 - 0x0000)
struct BP_FootstepVisualComponent_C_ExecuteUbergraph_BP_FootstepVisualComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_MakeLiteralDouble_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MakeLiteralDouble_ReturnValue_1;          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_IsRightFoot;                    // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_CustomEvent_Location;                       // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               K2Node_CustomEvent_Rotation;                       // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        CallFunc_SpawnDecalAtLocation_ReturnValue;         // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        CallFunc_SpawnDecalAtLocation_ReturnValue_1;       // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_1;      // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SpawnDecalAtLocation_LifeSpan_ImplicitCast; // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetFadeOut_Duration_ImplicitCast;         // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetFadeOut_Duration_ImplicitCast_1;       // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetFadeOut_StartDelay_ImplicitCast;       // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SpawnDecalAtLocation_LifeSpan_ImplicitCast_1; // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetFadeOut_StartDelay_ImplicitCast_1;     // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FootstepVisualComponent_C_ExecuteUbergraph_BP_FootstepVisualComponent) == 0x000008, "Wrong alignment on BP_FootstepVisualComponent_C_ExecuteUbergraph_BP_FootstepVisualComponent");
static_assert(sizeof(BP_FootstepVisualComponent_C_ExecuteUbergraph_BP_FootstepVisualComponent) == 0x000088, "Wrong size on BP_FootstepVisualComponent_C_ExecuteUbergraph_BP_FootstepVisualComponent");
static_assert(offsetof(BP_FootstepVisualComponent_C_ExecuteUbergraph_BP_FootstepVisualComponent, EntryPoint) == 0x000000, "Member 'BP_FootstepVisualComponent_C_ExecuteUbergraph_BP_FootstepVisualComponent::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_FootstepVisualComponent_C_ExecuteUbergraph_BP_FootstepVisualComponent, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'BP_FootstepVisualComponent_C_ExecuteUbergraph_BP_FootstepVisualComponent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FootstepVisualComponent_C_ExecuteUbergraph_BP_FootstepVisualComponent, CallFunc_MakeLiteralDouble_ReturnValue) == 0x000008, "Member 'BP_FootstepVisualComponent_C_ExecuteUbergraph_BP_FootstepVisualComponent::CallFunc_MakeLiteralDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FootstepVisualComponent_C_ExecuteUbergraph_BP_FootstepVisualComponent, CallFunc_MakeLiteralDouble_ReturnValue_1) == 0x000010, "Member 'BP_FootstepVisualComponent_C_ExecuteUbergraph_BP_FootstepVisualComponent::CallFunc_MakeLiteralDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FootstepVisualComponent_C_ExecuteUbergraph_BP_FootstepVisualComponent, K2Node_CustomEvent_IsRightFoot) == 0x000018, "Member 'BP_FootstepVisualComponent_C_ExecuteUbergraph_BP_FootstepVisualComponent::K2Node_CustomEvent_IsRightFoot' has a wrong offset!");
static_assert(offsetof(BP_FootstepVisualComponent_C_ExecuteUbergraph_BP_FootstepVisualComponent, K2Node_CustomEvent_Location) == 0x000020, "Member 'BP_FootstepVisualComponent_C_ExecuteUbergraph_BP_FootstepVisualComponent::K2Node_CustomEvent_Location' has a wrong offset!");
static_assert(offsetof(BP_FootstepVisualComponent_C_ExecuteUbergraph_BP_FootstepVisualComponent, K2Node_CustomEvent_Rotation) == 0x000038, "Member 'BP_FootstepVisualComponent_C_ExecuteUbergraph_BP_FootstepVisualComponent::K2Node_CustomEvent_Rotation' has a wrong offset!");
static_assert(offsetof(BP_FootstepVisualComponent_C_ExecuteUbergraph_BP_FootstepVisualComponent, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000050, "Member 'BP_FootstepVisualComponent_C_ExecuteUbergraph_BP_FootstepVisualComponent::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FootstepVisualComponent_C_ExecuteUbergraph_BP_FootstepVisualComponent, CallFunc_SpawnDecalAtLocation_ReturnValue) == 0x000058, "Member 'BP_FootstepVisualComponent_C_ExecuteUbergraph_BP_FootstepVisualComponent::CallFunc_SpawnDecalAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FootstepVisualComponent_C_ExecuteUbergraph_BP_FootstepVisualComponent, CallFunc_SpawnDecalAtLocation_ReturnValue_1) == 0x000060, "Member 'BP_FootstepVisualComponent_C_ExecuteUbergraph_BP_FootstepVisualComponent::CallFunc_SpawnDecalAtLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FootstepVisualComponent_C_ExecuteUbergraph_BP_FootstepVisualComponent, CallFunc_Subtract_DoubleDouble_ReturnValue_1) == 0x000068, "Member 'BP_FootstepVisualComponent_C_ExecuteUbergraph_BP_FootstepVisualComponent::CallFunc_Subtract_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FootstepVisualComponent_C_ExecuteUbergraph_BP_FootstepVisualComponent, CallFunc_SpawnDecalAtLocation_LifeSpan_ImplicitCast) == 0x000070, "Member 'BP_FootstepVisualComponent_C_ExecuteUbergraph_BP_FootstepVisualComponent::CallFunc_SpawnDecalAtLocation_LifeSpan_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_FootstepVisualComponent_C_ExecuteUbergraph_BP_FootstepVisualComponent, CallFunc_SetFadeOut_Duration_ImplicitCast) == 0x000074, "Member 'BP_FootstepVisualComponent_C_ExecuteUbergraph_BP_FootstepVisualComponent::CallFunc_SetFadeOut_Duration_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_FootstepVisualComponent_C_ExecuteUbergraph_BP_FootstepVisualComponent, CallFunc_SetFadeOut_Duration_ImplicitCast_1) == 0x000078, "Member 'BP_FootstepVisualComponent_C_ExecuteUbergraph_BP_FootstepVisualComponent::CallFunc_SetFadeOut_Duration_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_FootstepVisualComponent_C_ExecuteUbergraph_BP_FootstepVisualComponent, CallFunc_SetFadeOut_StartDelay_ImplicitCast) == 0x00007C, "Member 'BP_FootstepVisualComponent_C_ExecuteUbergraph_BP_FootstepVisualComponent::CallFunc_SetFadeOut_StartDelay_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_FootstepVisualComponent_C_ExecuteUbergraph_BP_FootstepVisualComponent, CallFunc_SpawnDecalAtLocation_LifeSpan_ImplicitCast_1) == 0x000080, "Member 'BP_FootstepVisualComponent_C_ExecuteUbergraph_BP_FootstepVisualComponent::CallFunc_SpawnDecalAtLocation_LifeSpan_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_FootstepVisualComponent_C_ExecuteUbergraph_BP_FootstepVisualComponent, CallFunc_SetFadeOut_StartDelay_ImplicitCast_1) == 0x000084, "Member 'BP_FootstepVisualComponent_C_ExecuteUbergraph_BP_FootstepVisualComponent::CallFunc_SetFadeOut_StartDelay_ImplicitCast_1' has a wrong offset!");

// Function BP_FootstepVisualComponent.BP_FootstepVisualComponent_C.FootstepVisualEvent
// 0x0038 (0x0038 - 0x0000)
struct BP_FootstepVisualComponent_C_FootstepVisualEvent final
{
public:
	bool                                          IsRightFoot;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Location;                                          // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               Rotation;                                          // 0x0020(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_FootstepVisualComponent_C_FootstepVisualEvent) == 0x000008, "Wrong alignment on BP_FootstepVisualComponent_C_FootstepVisualEvent");
static_assert(sizeof(BP_FootstepVisualComponent_C_FootstepVisualEvent) == 0x000038, "Wrong size on BP_FootstepVisualComponent_C_FootstepVisualEvent");
static_assert(offsetof(BP_FootstepVisualComponent_C_FootstepVisualEvent, IsRightFoot) == 0x000000, "Member 'BP_FootstepVisualComponent_C_FootstepVisualEvent::IsRightFoot' has a wrong offset!");
static_assert(offsetof(BP_FootstepVisualComponent_C_FootstepVisualEvent, Location) == 0x000008, "Member 'BP_FootstepVisualComponent_C_FootstepVisualEvent::Location' has a wrong offset!");
static_assert(offsetof(BP_FootstepVisualComponent_C_FootstepVisualEvent, Rotation) == 0x000020, "Member 'BP_FootstepVisualComponent_C_FootstepVisualEvent::Rotation' has a wrong offset!");

}

