#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FL_ManorDoorHelpers

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "S_ManorDoors_structs.hpp"
#include "FLevelDataEntry_structs.hpp"


namespace SDK::Params
{

// Function BP_FL_ManorDoorHelpers.BP_FL_ManorDoorHelpers_C.TeleportToManor
// 0x0210 (0x0210 - 0x0000)
struct BP_FL_ManorDoorHelpers_C_TeleportToManor final
{
public:
	struct FGameplayTag                           CurrentLevelSpawnPointTag;                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           DestinationSpawnPointTag;                          // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetCurrentLevelName_ReturnValue;          // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_jRPG_GI_Custom_C*                   K2Node_DynamicCast_AsBP_J_RPG_GI_Custom;           // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_ManorDoors                          K2Node_MakeStruct_S_ManorDoors;                    // 0x004C(0x0010)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetLevelData_Found;                       // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFLevelDataEntry                       CallFunc_GetLevelData_LevelData;                   // 0x0060(0x01B0)(HasGetValueTypeHash)
};
static_assert(alignof(BP_FL_ManorDoorHelpers_C_TeleportToManor) == 0x000008, "Wrong alignment on BP_FL_ManorDoorHelpers_C_TeleportToManor");
static_assert(sizeof(BP_FL_ManorDoorHelpers_C_TeleportToManor) == 0x000210, "Wrong size on BP_FL_ManorDoorHelpers_C_TeleportToManor");
static_assert(offsetof(BP_FL_ManorDoorHelpers_C_TeleportToManor, CurrentLevelSpawnPointTag) == 0x000000, "Member 'BP_FL_ManorDoorHelpers_C_TeleportToManor::CurrentLevelSpawnPointTag' has a wrong offset!");
static_assert(offsetof(BP_FL_ManorDoorHelpers_C_TeleportToManor, DestinationSpawnPointTag) == 0x000008, "Member 'BP_FL_ManorDoorHelpers_C_TeleportToManor::DestinationSpawnPointTag' has a wrong offset!");
static_assert(offsetof(BP_FL_ManorDoorHelpers_C_TeleportToManor, __WorldContext) == 0x000010, "Member 'BP_FL_ManorDoorHelpers_C_TeleportToManor::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_FL_ManorDoorHelpers_C_TeleportToManor, CallFunc_MakeLiteralName_ReturnValue) == 0x000018, "Member 'BP_FL_ManorDoorHelpers_C_TeleportToManor::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FL_ManorDoorHelpers_C_TeleportToManor, CallFunc_GetCurrentLevelName_ReturnValue) == 0x000020, "Member 'BP_FL_ManorDoorHelpers_C_TeleportToManor::CallFunc_GetCurrentLevelName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FL_ManorDoorHelpers_C_TeleportToManor, CallFunc_GetGameInstance_ReturnValue) == 0x000030, "Member 'BP_FL_ManorDoorHelpers_C_TeleportToManor::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FL_ManorDoorHelpers_C_TeleportToManor, CallFunc_Conv_StringToName_ReturnValue) == 0x000038, "Member 'BP_FL_ManorDoorHelpers_C_TeleportToManor::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FL_ManorDoorHelpers_C_TeleportToManor, K2Node_DynamicCast_AsBP_J_RPG_GI_Custom) == 0x000040, "Member 'BP_FL_ManorDoorHelpers_C_TeleportToManor::K2Node_DynamicCast_AsBP_J_RPG_GI_Custom' has a wrong offset!");
static_assert(offsetof(BP_FL_ManorDoorHelpers_C_TeleportToManor, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'BP_FL_ManorDoorHelpers_C_TeleportToManor::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_FL_ManorDoorHelpers_C_TeleportToManor, K2Node_MakeStruct_S_ManorDoors) == 0x00004C, "Member 'BP_FL_ManorDoorHelpers_C_TeleportToManor::K2Node_MakeStruct_S_ManorDoors' has a wrong offset!");
static_assert(offsetof(BP_FL_ManorDoorHelpers_C_TeleportToManor, CallFunc_GetLevelData_Found) == 0x00005C, "Member 'BP_FL_ManorDoorHelpers_C_TeleportToManor::CallFunc_GetLevelData_Found' has a wrong offset!");
static_assert(offsetof(BP_FL_ManorDoorHelpers_C_TeleportToManor, CallFunc_GetLevelData_LevelData) == 0x000060, "Member 'BP_FL_ManorDoorHelpers_C_TeleportToManor::CallFunc_GetLevelData_LevelData' has a wrong offset!");

}

