#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FreeAimTarget_Button

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_FreeAimTarget_Button.BP_FreeAimTarget_Button_C.TriggerTargets
// 0x0098 (0x0098 - 0x0000)
struct BP_FreeAimTarget_Button_C_TriggerTargets final
{
public:
	bool                                          Instant;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         local_Index;                                       // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 local_Target;                                      // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_ButtonTrigger_C>  K2Node_DynamicCast_AsBPI_Button_Trigger;           // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_ButtonTrigger_C>  K2Node_DynamicCast_AsBPI_Button_Trigger_1;         // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A[0x2];                                       // 0x004A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class AActor>                  CallFunc_Array_Get_Item;                           // 0x0050(0x0028)(HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_DynamicCast_AsActor;                        // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoesImplementInterface_ReturnValue;       // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FreeAimTarget_Button_C_TriggerTargets) == 0x000008, "Wrong alignment on BP_FreeAimTarget_Button_C_TriggerTargets");
static_assert(sizeof(BP_FreeAimTarget_Button_C_TriggerTargets) == 0x000098, "Wrong size on BP_FreeAimTarget_Button_C_TriggerTargets");
static_assert(offsetof(BP_FreeAimTarget_Button_C_TriggerTargets, Instant) == 0x000000, "Member 'BP_FreeAimTarget_Button_C_TriggerTargets::Instant' has a wrong offset!");
static_assert(offsetof(BP_FreeAimTarget_Button_C_TriggerTargets, local_Index) == 0x000004, "Member 'BP_FreeAimTarget_Button_C_TriggerTargets::local_Index' has a wrong offset!");
static_assert(offsetof(BP_FreeAimTarget_Button_C_TriggerTargets, local_Target) == 0x000008, "Member 'BP_FreeAimTarget_Button_C_TriggerTargets::local_Target' has a wrong offset!");
static_assert(offsetof(BP_FreeAimTarget_Button_C_TriggerTargets, Temp_int_Array_Index_Variable) == 0x000010, "Member 'BP_FreeAimTarget_Button_C_TriggerTargets::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_FreeAimTarget_Button_C_TriggerTargets, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'BP_FreeAimTarget_Button_C_TriggerTargets::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_FreeAimTarget_Button_C_TriggerTargets, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'BP_FreeAimTarget_Button_C_TriggerTargets::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FreeAimTarget_Button_C_TriggerTargets, K2Node_DynamicCast_AsBPI_Button_Trigger) == 0x000020, "Member 'BP_FreeAimTarget_Button_C_TriggerTargets::K2Node_DynamicCast_AsBPI_Button_Trigger' has a wrong offset!");
static_assert(offsetof(BP_FreeAimTarget_Button_C_TriggerTargets, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'BP_FreeAimTarget_Button_C_TriggerTargets::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_FreeAimTarget_Button_C_TriggerTargets, K2Node_DynamicCast_AsBPI_Button_Trigger_1) == 0x000038, "Member 'BP_FreeAimTarget_Button_C_TriggerTargets::K2Node_DynamicCast_AsBPI_Button_Trigger_1' has a wrong offset!");
static_assert(offsetof(BP_FreeAimTarget_Button_C_TriggerTargets, K2Node_DynamicCast_bSuccess_1) == 0x000048, "Member 'BP_FreeAimTarget_Button_C_TriggerTargets::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_FreeAimTarget_Button_C_TriggerTargets, CallFunc_IsValid_ReturnValue) == 0x000049, "Member 'BP_FreeAimTarget_Button_C_TriggerTargets::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FreeAimTarget_Button_C_TriggerTargets, CallFunc_Array_Length_ReturnValue) == 0x00004C, "Member 'BP_FreeAimTarget_Button_C_TriggerTargets::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FreeAimTarget_Button_C_TriggerTargets, CallFunc_Array_Get_Item) == 0x000050, "Member 'BP_FreeAimTarget_Button_C_TriggerTargets::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_FreeAimTarget_Button_C_TriggerTargets, CallFunc_Less_IntInt_ReturnValue) == 0x000078, "Member 'BP_FreeAimTarget_Button_C_TriggerTargets::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FreeAimTarget_Button_C_TriggerTargets, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue) == 0x000080, "Member 'BP_FreeAimTarget_Button_C_TriggerTargets::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FreeAimTarget_Button_C_TriggerTargets, K2Node_DynamicCast_AsActor) == 0x000088, "Member 'BP_FreeAimTarget_Button_C_TriggerTargets::K2Node_DynamicCast_AsActor' has a wrong offset!");
static_assert(offsetof(BP_FreeAimTarget_Button_C_TriggerTargets, K2Node_DynamicCast_bSuccess_2) == 0x000090, "Member 'BP_FreeAimTarget_Button_C_TriggerTargets::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_FreeAimTarget_Button_C_TriggerTargets, CallFunc_DoesImplementInterface_ReturnValue) == 0x000091, "Member 'BP_FreeAimTarget_Button_C_TriggerTargets::CallFunc_DoesImplementInterface_ReturnValue' has a wrong offset!");

// Function BP_FreeAimTarget_Button.BP_FreeAimTarget_Button_C.SpawnFlyingIndicator
// 0x0070 (0x0070 - 0x0000)
struct BP_FreeAimTarget_Button_C_SpawnFlyingIndicator final
{
public:
	class AActor*                                 ActorToTrigger_0;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Transform;                                         // 0x0010(0x0060)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FreeAimTarget_Button_C_SpawnFlyingIndicator) == 0x000010, "Wrong alignment on BP_FreeAimTarget_Button_C_SpawnFlyingIndicator");
static_assert(sizeof(BP_FreeAimTarget_Button_C_SpawnFlyingIndicator) == 0x000070, "Wrong size on BP_FreeAimTarget_Button_C_SpawnFlyingIndicator");
static_assert(offsetof(BP_FreeAimTarget_Button_C_SpawnFlyingIndicator, ActorToTrigger_0) == 0x000000, "Member 'BP_FreeAimTarget_Button_C_SpawnFlyingIndicator::ActorToTrigger_0' has a wrong offset!");
static_assert(offsetof(BP_FreeAimTarget_Button_C_SpawnFlyingIndicator, Transform) == 0x000010, "Member 'BP_FreeAimTarget_Button_C_SpawnFlyingIndicator::Transform' has a wrong offset!");

// Function BP_FreeAimTarget_Button.BP_FreeAimTarget_Button_C.OnObjectInteractionStateLoaded
// 0x0001 (0x0001 - 0x0000)
struct BP_FreeAimTarget_Button_C_OnObjectInteractionStateLoaded final
{
public:
	bool                                          InteractionState;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FreeAimTarget_Button_C_OnObjectInteractionStateLoaded) == 0x000001, "Wrong alignment on BP_FreeAimTarget_Button_C_OnObjectInteractionStateLoaded");
static_assert(sizeof(BP_FreeAimTarget_Button_C_OnObjectInteractionStateLoaded) == 0x000001, "Wrong size on BP_FreeAimTarget_Button_C_OnObjectInteractionStateLoaded");
static_assert(offsetof(BP_FreeAimTarget_Button_C_OnObjectInteractionStateLoaded, InteractionState) == 0x000000, "Member 'BP_FreeAimTarget_Button_C_OnObjectInteractionStateLoaded::InteractionState' has a wrong offset!");

// Function BP_FreeAimTarget_Button.BP_FreeAimTarget_Button_C.IsInteractionAvailable
// 0x0001 (0x0001 - 0x0000)
struct BP_FreeAimTarget_Button_C_IsInteractionAvailable final
{
public:
	bool                                          Available;                                         // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FreeAimTarget_Button_C_IsInteractionAvailable) == 0x000001, "Wrong alignment on BP_FreeAimTarget_Button_C_IsInteractionAvailable");
static_assert(sizeof(BP_FreeAimTarget_Button_C_IsInteractionAvailable) == 0x000001, "Wrong size on BP_FreeAimTarget_Button_C_IsInteractionAvailable");
static_assert(offsetof(BP_FreeAimTarget_Button_C_IsInteractionAvailable, Available) == 0x000000, "Member 'BP_FreeAimTarget_Button_C_IsInteractionAvailable::Available' has a wrong offset!");

// Function BP_FreeAimTarget_Button.BP_FreeAimTarget_Button_C.FreeAimHit
// 0x0028 (0x0028 - 0x0000)
struct BP_FreeAimTarget_Button_C_FreeAimHit final
{
public:
	class ABP_jRPG_Character_World_C*             PlayerCharacterWorld;                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HitLocation;                                       // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsDisabled;                                        // 0x0020(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FreeAimTarget_Button_C_FreeAimHit) == 0x000008, "Wrong alignment on BP_FreeAimTarget_Button_C_FreeAimHit");
static_assert(sizeof(BP_FreeAimTarget_Button_C_FreeAimHit) == 0x000028, "Wrong size on BP_FreeAimTarget_Button_C_FreeAimHit");
static_assert(offsetof(BP_FreeAimTarget_Button_C_FreeAimHit, PlayerCharacterWorld) == 0x000000, "Member 'BP_FreeAimTarget_Button_C_FreeAimHit::PlayerCharacterWorld' has a wrong offset!");
static_assert(offsetof(BP_FreeAimTarget_Button_C_FreeAimHit, HitLocation) == 0x000008, "Member 'BP_FreeAimTarget_Button_C_FreeAimHit::HitLocation' has a wrong offset!");
static_assert(offsetof(BP_FreeAimTarget_Button_C_FreeAimHit, IsDisabled) == 0x000020, "Member 'BP_FreeAimTarget_Button_C_FreeAimHit::IsDisabled' has a wrong offset!");

// Function BP_FreeAimTarget_Button.BP_FreeAimTarget_Button_C.ExplorationAttacked
// 0x0020 (0x0020 - 0x0000)
struct BP_FreeAimTarget_Button_C_ExplorationAttacked final
{
public:
	class ABP_jRPG_Character_World_C*             PlayerCharacter;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ImpactPoint;                                       // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FreeAimTarget_Button_C_ExplorationAttacked) == 0x000008, "Wrong alignment on BP_FreeAimTarget_Button_C_ExplorationAttacked");
static_assert(sizeof(BP_FreeAimTarget_Button_C_ExplorationAttacked) == 0x000020, "Wrong size on BP_FreeAimTarget_Button_C_ExplorationAttacked");
static_assert(offsetof(BP_FreeAimTarget_Button_C_ExplorationAttacked, PlayerCharacter) == 0x000000, "Member 'BP_FreeAimTarget_Button_C_ExplorationAttacked::PlayerCharacter' has a wrong offset!");
static_assert(offsetof(BP_FreeAimTarget_Button_C_ExplorationAttacked, ImpactPoint) == 0x000008, "Member 'BP_FreeAimTarget_Button_C_ExplorationAttacked::ImpactPoint' has a wrong offset!");

// Function BP_FreeAimTarget_Button.BP_FreeAimTarget_Button_C.ExecuteUbergraph_BP_FreeAimTarget_Button
// 0x0150 (0x0150 - 0x0000)
struct BP_FreeAimTarget_Button_C_ExecuteUbergraph_BP_FreeAimTarget_Button final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_jRPG_Character_World_C*             K2Node_Event_PlayerCharacter;                      // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_ImpactPoint;                          // 0x0010(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_jRPG_Character_World_C*             K2Node_Event_PlayerCharacterWorld;                 // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_HitLocation;                          // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDisabled;                           // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     CallFunc_GetMaterial_ReturnValue;                  // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class AActor>                  CallFunc_Array_Get_Item;                           // 0x0060(0x0028)(HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_DynamicCast_AsActor;                        // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x00B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x00E0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_InteractionState;                     // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14A[0x2];                                      // 0x014A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FreeAimTarget_Button_C_ExecuteUbergraph_BP_FreeAimTarget_Button) == 0x000010, "Wrong alignment on BP_FreeAimTarget_Button_C_ExecuteUbergraph_BP_FreeAimTarget_Button");
static_assert(sizeof(BP_FreeAimTarget_Button_C_ExecuteUbergraph_BP_FreeAimTarget_Button) == 0x000150, "Wrong size on BP_FreeAimTarget_Button_C_ExecuteUbergraph_BP_FreeAimTarget_Button");
static_assert(offsetof(BP_FreeAimTarget_Button_C_ExecuteUbergraph_BP_FreeAimTarget_Button, EntryPoint) == 0x000000, "Member 'BP_FreeAimTarget_Button_C_ExecuteUbergraph_BP_FreeAimTarget_Button::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_FreeAimTarget_Button_C_ExecuteUbergraph_BP_FreeAimTarget_Button, K2Node_Event_PlayerCharacter) == 0x000008, "Member 'BP_FreeAimTarget_Button_C_ExecuteUbergraph_BP_FreeAimTarget_Button::K2Node_Event_PlayerCharacter' has a wrong offset!");
static_assert(offsetof(BP_FreeAimTarget_Button_C_ExecuteUbergraph_BP_FreeAimTarget_Button, K2Node_Event_ImpactPoint) == 0x000010, "Member 'BP_FreeAimTarget_Button_C_ExecuteUbergraph_BP_FreeAimTarget_Button::K2Node_Event_ImpactPoint' has a wrong offset!");
static_assert(offsetof(BP_FreeAimTarget_Button_C_ExecuteUbergraph_BP_FreeAimTarget_Button, Temp_int_Array_Index_Variable) == 0x000028, "Member 'BP_FreeAimTarget_Button_C_ExecuteUbergraph_BP_FreeAimTarget_Button::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_FreeAimTarget_Button_C_ExecuteUbergraph_BP_FreeAimTarget_Button, K2Node_Event_PlayerCharacterWorld) == 0x000030, "Member 'BP_FreeAimTarget_Button_C_ExecuteUbergraph_BP_FreeAimTarget_Button::K2Node_Event_PlayerCharacterWorld' has a wrong offset!");
static_assert(offsetof(BP_FreeAimTarget_Button_C_ExecuteUbergraph_BP_FreeAimTarget_Button, K2Node_Event_HitLocation) == 0x000038, "Member 'BP_FreeAimTarget_Button_C_ExecuteUbergraph_BP_FreeAimTarget_Button::K2Node_Event_HitLocation' has a wrong offset!");
static_assert(offsetof(BP_FreeAimTarget_Button_C_ExecuteUbergraph_BP_FreeAimTarget_Button, K2Node_Event_IsDisabled) == 0x000050, "Member 'BP_FreeAimTarget_Button_C_ExecuteUbergraph_BP_FreeAimTarget_Button::K2Node_Event_IsDisabled' has a wrong offset!");
static_assert(offsetof(BP_FreeAimTarget_Button_C_ExecuteUbergraph_BP_FreeAimTarget_Button, CallFunc_GetMaterial_ReturnValue) == 0x000058, "Member 'BP_FreeAimTarget_Button_C_ExecuteUbergraph_BP_FreeAimTarget_Button::CallFunc_GetMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FreeAimTarget_Button_C_ExecuteUbergraph_BP_FreeAimTarget_Button, CallFunc_Array_Get_Item) == 0x000060, "Member 'BP_FreeAimTarget_Button_C_ExecuteUbergraph_BP_FreeAimTarget_Button::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_FreeAimTarget_Button_C_ExecuteUbergraph_BP_FreeAimTarget_Button, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000088, "Member 'BP_FreeAimTarget_Button_C_ExecuteUbergraph_BP_FreeAimTarget_Button::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FreeAimTarget_Button_C_ExecuteUbergraph_BP_FreeAimTarget_Button, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue) == 0x000090, "Member 'BP_FreeAimTarget_Button_C_ExecuteUbergraph_BP_FreeAimTarget_Button::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FreeAimTarget_Button_C_ExecuteUbergraph_BP_FreeAimTarget_Button, K2Node_DynamicCast_AsActor) == 0x000098, "Member 'BP_FreeAimTarget_Button_C_ExecuteUbergraph_BP_FreeAimTarget_Button::K2Node_DynamicCast_AsActor' has a wrong offset!");
static_assert(offsetof(BP_FreeAimTarget_Button_C_ExecuteUbergraph_BP_FreeAimTarget_Button, K2Node_DynamicCast_bSuccess) == 0x0000A0, "Member 'BP_FreeAimTarget_Button_C_ExecuteUbergraph_BP_FreeAimTarget_Button::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_FreeAimTarget_Button_C_ExecuteUbergraph_BP_FreeAimTarget_Button, CallFunc_Array_Length_ReturnValue) == 0x0000A4, "Member 'BP_FreeAimTarget_Button_C_ExecuteUbergraph_BP_FreeAimTarget_Button::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FreeAimTarget_Button_C_ExecuteUbergraph_BP_FreeAimTarget_Button, CallFunc_IsValid_ReturnValue) == 0x0000A8, "Member 'BP_FreeAimTarget_Button_C_ExecuteUbergraph_BP_FreeAimTarget_Button::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FreeAimTarget_Button_C_ExecuteUbergraph_BP_FreeAimTarget_Button, CallFunc_K2_GetActorRotation_ReturnValue) == 0x0000B0, "Member 'BP_FreeAimTarget_Button_C_ExecuteUbergraph_BP_FreeAimTarget_Button::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FreeAimTarget_Button_C_ExecuteUbergraph_BP_FreeAimTarget_Button, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0000C8, "Member 'BP_FreeAimTarget_Button_C_ExecuteUbergraph_BP_FreeAimTarget_Button::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FreeAimTarget_Button_C_ExecuteUbergraph_BP_FreeAimTarget_Button, CallFunc_MakeTransform_ReturnValue) == 0x0000E0, "Member 'BP_FreeAimTarget_Button_C_ExecuteUbergraph_BP_FreeAimTarget_Button::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FreeAimTarget_Button_C_ExecuteUbergraph_BP_FreeAimTarget_Button, CallFunc_Array_AddUnique_ReturnValue) == 0x000140, "Member 'BP_FreeAimTarget_Button_C_ExecuteUbergraph_BP_FreeAimTarget_Button::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FreeAimTarget_Button_C_ExecuteUbergraph_BP_FreeAimTarget_Button, Temp_int_Loop_Counter_Variable) == 0x000144, "Member 'BP_FreeAimTarget_Button_C_ExecuteUbergraph_BP_FreeAimTarget_Button::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_FreeAimTarget_Button_C_ExecuteUbergraph_BP_FreeAimTarget_Button, K2Node_Event_InteractionState) == 0x000148, "Member 'BP_FreeAimTarget_Button_C_ExecuteUbergraph_BP_FreeAimTarget_Button::K2Node_Event_InteractionState' has a wrong offset!");
static_assert(offsetof(BP_FreeAimTarget_Button_C_ExecuteUbergraph_BP_FreeAimTarget_Button, CallFunc_Less_IntInt_ReturnValue) == 0x000149, "Member 'BP_FreeAimTarget_Button_C_ExecuteUbergraph_BP_FreeAimTarget_Button::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FreeAimTarget_Button_C_ExecuteUbergraph_BP_FreeAimTarget_Button, CallFunc_Add_IntInt_ReturnValue) == 0x00014C, "Member 'BP_FreeAimTarget_Button_C_ExecuteUbergraph_BP_FreeAimTarget_Button::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function BP_FreeAimTarget_Button.BP_FreeAimTarget_Button_C.CreateDynamicFlyingBehavior
// 0x00E0 (0x00E0 - 0x0000)
struct BP_FreeAimTarget_Button_C_CreateDynamicFlyingBehavior final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             TargetTransform;                                   // 0x0010(0x0060)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0070(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_FlyingIndicator_C*                  CallFunc_FinishSpawningActor_ReturnValue;          // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FreeAimTarget_Button_C_CreateDynamicFlyingBehavior) == 0x000010, "Wrong alignment on BP_FreeAimTarget_Button_C_CreateDynamicFlyingBehavior");
static_assert(sizeof(BP_FreeAimTarget_Button_C_CreateDynamicFlyingBehavior) == 0x0000E0, "Wrong size on BP_FreeAimTarget_Button_C_CreateDynamicFlyingBehavior");
static_assert(offsetof(BP_FreeAimTarget_Button_C_CreateDynamicFlyingBehavior, Target) == 0x000000, "Member 'BP_FreeAimTarget_Button_C_CreateDynamicFlyingBehavior::Target' has a wrong offset!");
static_assert(offsetof(BP_FreeAimTarget_Button_C_CreateDynamicFlyingBehavior, TargetTransform) == 0x000010, "Member 'BP_FreeAimTarget_Button_C_CreateDynamicFlyingBehavior::TargetTransform' has a wrong offset!");
static_assert(offsetof(BP_FreeAimTarget_Button_C_CreateDynamicFlyingBehavior, CallFunc_GetTransform_ReturnValue) == 0x000070, "Member 'BP_FreeAimTarget_Button_C_CreateDynamicFlyingBehavior::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FreeAimTarget_Button_C_CreateDynamicFlyingBehavior, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0000D0, "Member 'BP_FreeAimTarget_Button_C_CreateDynamicFlyingBehavior::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FreeAimTarget_Button_C_CreateDynamicFlyingBehavior, CallFunc_FinishSpawningActor_ReturnValue) == 0x0000D8, "Member 'BP_FreeAimTarget_Button_C_CreateDynamicFlyingBehavior::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");

}

