#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: bp_FogSheet_GOOD

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass bp_FogSheet_GOOD.bp_FogSheet_GOOD_C
// 0x0088 (0x0318 - 0x0290)
class Abp_FogSheet_GOOD_C final : public AActor
{
public:
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0290(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBillboardComponent*                    FogSheet;                                          // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceConstant*              FogSheetMasterMaterial;                            // 0x02A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               FogSheetMID;                                       // 0x02A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Color;                                             // 0x02B0(0x0010)(Edit, ConstParm, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	double                                        Brightness;                                        // 0x02C0(0x0008)(Edit, ConstParm, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Size;                                              // 0x02C8(0x0018)(Edit, ConstParm, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Opacity;                                           // 0x02E0(0x0008)(Edit, ConstParm, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DepthFadeDistance;                                 // 0x02E8(0x0008)(Edit, ConstParm, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        NoiseProjectionDistance;                           // 0x02F0(0x0008)(Edit, ConstParm, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        NoiseSize;                                         // 0x02F8(0x0008)(Edit, ConstParm, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        PanningSpeed;                                      // 0x0300(0x0008)(Edit, ConstParm, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        FadeDistance;                                      // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        EyeAdaptation;                                     // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"bp_FogSheet_GOOD_C">();
	}
	static class Abp_FogSheet_GOOD_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<Abp_FogSheet_GOOD_C>();
	}
};
static_assert(alignof(Abp_FogSheet_GOOD_C) == 0x000008, "Wrong alignment on Abp_FogSheet_GOOD_C");
static_assert(sizeof(Abp_FogSheet_GOOD_C) == 0x000318, "Wrong size on Abp_FogSheet_GOOD_C");
static_assert(offsetof(Abp_FogSheet_GOOD_C, StaticMesh) == 0x000290, "Member 'Abp_FogSheet_GOOD_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(Abp_FogSheet_GOOD_C, FogSheet) == 0x000298, "Member 'Abp_FogSheet_GOOD_C::FogSheet' has a wrong offset!");
static_assert(offsetof(Abp_FogSheet_GOOD_C, FogSheetMasterMaterial) == 0x0002A0, "Member 'Abp_FogSheet_GOOD_C::FogSheetMasterMaterial' has a wrong offset!");
static_assert(offsetof(Abp_FogSheet_GOOD_C, FogSheetMID) == 0x0002A8, "Member 'Abp_FogSheet_GOOD_C::FogSheetMID' has a wrong offset!");
static_assert(offsetof(Abp_FogSheet_GOOD_C, Color) == 0x0002B0, "Member 'Abp_FogSheet_GOOD_C::Color' has a wrong offset!");
static_assert(offsetof(Abp_FogSheet_GOOD_C, Brightness) == 0x0002C0, "Member 'Abp_FogSheet_GOOD_C::Brightness' has a wrong offset!");
static_assert(offsetof(Abp_FogSheet_GOOD_C, Size) == 0x0002C8, "Member 'Abp_FogSheet_GOOD_C::Size' has a wrong offset!");
static_assert(offsetof(Abp_FogSheet_GOOD_C, Opacity) == 0x0002E0, "Member 'Abp_FogSheet_GOOD_C::Opacity' has a wrong offset!");
static_assert(offsetof(Abp_FogSheet_GOOD_C, DepthFadeDistance) == 0x0002E8, "Member 'Abp_FogSheet_GOOD_C::DepthFadeDistance' has a wrong offset!");
static_assert(offsetof(Abp_FogSheet_GOOD_C, NoiseProjectionDistance) == 0x0002F0, "Member 'Abp_FogSheet_GOOD_C::NoiseProjectionDistance' has a wrong offset!");
static_assert(offsetof(Abp_FogSheet_GOOD_C, NoiseSize) == 0x0002F8, "Member 'Abp_FogSheet_GOOD_C::NoiseSize' has a wrong offset!");
static_assert(offsetof(Abp_FogSheet_GOOD_C, PanningSpeed) == 0x000300, "Member 'Abp_FogSheet_GOOD_C::PanningSpeed' has a wrong offset!");
static_assert(offsetof(Abp_FogSheet_GOOD_C, FadeDistance) == 0x000308, "Member 'Abp_FogSheet_GOOD_C::FadeDistance' has a wrong offset!");
static_assert(offsetof(Abp_FogSheet_GOOD_C, EyeAdaptation) == 0x000310, "Member 'Abp_FogSheet_GOOD_C::EyeAdaptation' has a wrong offset!");

}

