#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GrapplePoint

#include "Basic.hpp"

#include "SandFall_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FPromptParams_structs.hpp"


namespace SDK::Params
{

// Function BP_GrapplePoint.BP_GrapplePoint_C.BndEvt__BP_GrapplePoint_DeactivationZone_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
// 0x0118 (0x0118 - 0x0000)
struct BP_GrapplePoint_C_BndEvt__BP_GrapplePoint_DeactivationZone_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x00F8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_GrapplePoint_C_BndEvt__BP_GrapplePoint_DeactivationZone_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_GrapplePoint_C_BndEvt__BP_GrapplePoint_DeactivationZone_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_GrapplePoint_C_BndEvt__BP_GrapplePoint_DeactivationZone_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000118, "Wrong size on BP_GrapplePoint_C_BndEvt__BP_GrapplePoint_DeactivationZone_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_GrapplePoint_C_BndEvt__BP_GrapplePoint_DeactivationZone_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_GrapplePoint_C_BndEvt__BP_GrapplePoint_DeactivationZone_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_GrapplePoint_C_BndEvt__BP_GrapplePoint_DeactivationZone_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_GrapplePoint_C_BndEvt__BP_GrapplePoint_DeactivationZone_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_GrapplePoint_C_BndEvt__BP_GrapplePoint_DeactivationZone_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_GrapplePoint_C_BndEvt__BP_GrapplePoint_DeactivationZone_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_GrapplePoint_C_BndEvt__BP_GrapplePoint_DeactivationZone_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_GrapplePoint_C_BndEvt__BP_GrapplePoint_DeactivationZone_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_GrapplePoint_C_BndEvt__BP_GrapplePoint_DeactivationZone_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'BP_GrapplePoint_C_BndEvt__BP_GrapplePoint_DeactivationZone_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_GrapplePoint_C_BndEvt__BP_GrapplePoint_DeactivationZone_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'BP_GrapplePoint_C_BndEvt__BP_GrapplePoint_DeactivationZone_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function BP_GrapplePoint.BP_GrapplePoint_C.BndEvt__BP_GrapplePoint_DeactivationZone_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct BP_GrapplePoint_C_BndEvt__BP_GrapplePoint_DeactivationZone_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GrapplePoint_C_BndEvt__BP_GrapplePoint_DeactivationZone_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_GrapplePoint_C_BndEvt__BP_GrapplePoint_DeactivationZone_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_GrapplePoint_C_BndEvt__BP_GrapplePoint_DeactivationZone_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature) == 0x000020, "Wrong size on BP_GrapplePoint_C_BndEvt__BP_GrapplePoint_DeactivationZone_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_GrapplePoint_C_BndEvt__BP_GrapplePoint_DeactivationZone_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_GrapplePoint_C_BndEvt__BP_GrapplePoint_DeactivationZone_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_GrapplePoint_C_BndEvt__BP_GrapplePoint_DeactivationZone_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_GrapplePoint_C_BndEvt__BP_GrapplePoint_DeactivationZone_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_GrapplePoint_C_BndEvt__BP_GrapplePoint_DeactivationZone_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_GrapplePoint_C_BndEvt__BP_GrapplePoint_DeactivationZone_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_GrapplePoint_C_BndEvt__BP_GrapplePoint_DeactivationZone_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_GrapplePoint_C_BndEvt__BP_GrapplePoint_DeactivationZone_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");

// Function BP_GrapplePoint.BP_GrapplePoint_C.BndEvt__BP_GrapplePoint_InteractionRange_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature
// 0x0118 (0x0118 - 0x0000)
struct BP_GrapplePoint_C_BndEvt__BP_GrapplePoint_InteractionRange_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x00F8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_GrapplePoint_C_BndEvt__BP_GrapplePoint_InteractionRange_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_GrapplePoint_C_BndEvt__BP_GrapplePoint_InteractionRange_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_GrapplePoint_C_BndEvt__BP_GrapplePoint_InteractionRange_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature) == 0x000118, "Wrong size on BP_GrapplePoint_C_BndEvt__BP_GrapplePoint_InteractionRange_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_GrapplePoint_C_BndEvt__BP_GrapplePoint_InteractionRange_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_GrapplePoint_C_BndEvt__BP_GrapplePoint_InteractionRange_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_GrapplePoint_C_BndEvt__BP_GrapplePoint_InteractionRange_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_GrapplePoint_C_BndEvt__BP_GrapplePoint_InteractionRange_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_GrapplePoint_C_BndEvt__BP_GrapplePoint_InteractionRange_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_GrapplePoint_C_BndEvt__BP_GrapplePoint_InteractionRange_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_GrapplePoint_C_BndEvt__BP_GrapplePoint_InteractionRange_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_GrapplePoint_C_BndEvt__BP_GrapplePoint_InteractionRange_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_GrapplePoint_C_BndEvt__BP_GrapplePoint_InteractionRange_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'BP_GrapplePoint_C_BndEvt__BP_GrapplePoint_InteractionRange_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_GrapplePoint_C_BndEvt__BP_GrapplePoint_InteractionRange_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'BP_GrapplePoint_C_BndEvt__BP_GrapplePoint_InteractionRange_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function BP_GrapplePoint.BP_GrapplePoint_C.BndEvt__BP_GrapplePoint_InteractionRange_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct BP_GrapplePoint_C_BndEvt__BP_GrapplePoint_InteractionRange_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GrapplePoint_C_BndEvt__BP_GrapplePoint_InteractionRange_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_GrapplePoint_C_BndEvt__BP_GrapplePoint_InteractionRange_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_GrapplePoint_C_BndEvt__BP_GrapplePoint_InteractionRange_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature) == 0x000020, "Wrong size on BP_GrapplePoint_C_BndEvt__BP_GrapplePoint_InteractionRange_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_GrapplePoint_C_BndEvt__BP_GrapplePoint_InteractionRange_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_GrapplePoint_C_BndEvt__BP_GrapplePoint_InteractionRange_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_GrapplePoint_C_BndEvt__BP_GrapplePoint_InteractionRange_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_GrapplePoint_C_BndEvt__BP_GrapplePoint_InteractionRange_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_GrapplePoint_C_BndEvt__BP_GrapplePoint_InteractionRange_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_GrapplePoint_C_BndEvt__BP_GrapplePoint_InteractionRange_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_GrapplePoint_C_BndEvt__BP_GrapplePoint_InteractionRange_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_GrapplePoint_C_BndEvt__BP_GrapplePoint_InteractionRange_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");

// Function BP_GrapplePoint.BP_GrapplePoint_C.CheckForErrors
// 0x01E0 (0x01E0 - 0x0000)
struct BP_GrapplePoint_C_CheckForErrors final
{
public:
	TArray<class FText>                           ErrorMessages;                                     // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0030(0x0048)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0078(0x0010)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0088(0x0010)(ReferenceParm)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0098(0x0048)(HasGetValueTypeHash)
	class FString                                 CallFunc_Format_ReturnValue;                       // 0x00E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	double                                        CallFunc_MakeLiteralDouble_ReturnValue;            // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x00F8(0x0048)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x0140(0x0048)(HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_189[0x7];                                      // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0190(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x01A0(0x0010)()
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MakeLiteralBool_ReturnValue;              // 0x01B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B5[0x3];                                      // 0x01B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1BC[0x4];                                      // 0x01BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameAction_Wrapper                    CallFunc_Array_Get_Item;                           // 0x01C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D5[0x3];                                      // 0x01D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GrapplePoint_C_CheckForErrors) == 0x000008, "Wrong alignment on BP_GrapplePoint_C_CheckForErrors");
static_assert(sizeof(BP_GrapplePoint_C_CheckForErrors) == 0x0001E0, "Wrong size on BP_GrapplePoint_C_CheckForErrors");
static_assert(offsetof(BP_GrapplePoint_C_CheckForErrors, ErrorMessages) == 0x000000, "Member 'BP_GrapplePoint_C_CheckForErrors::ErrorMessages' has a wrong offset!");
static_assert(offsetof(BP_GrapplePoint_C_CheckForErrors, ReturnValue) == 0x000010, "Member 'BP_GrapplePoint_C_CheckForErrors::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GrapplePoint_C_CheckForErrors, Temp_int_Array_Index_Variable) == 0x000014, "Member 'BP_GrapplePoint_C_CheckForErrors::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_GrapplePoint_C_CheckForErrors, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000018, "Member 'BP_GrapplePoint_C_CheckForErrors::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GrapplePoint_C_CheckForErrors, CallFunc_GetDisplayName_ReturnValue) == 0x000020, "Member 'BP_GrapplePoint_C_CheckForErrors::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GrapplePoint_C_CheckForErrors, K2Node_MakeStruct_FormatArgumentData) == 0x000030, "Member 'BP_GrapplePoint_C_CheckForErrors::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_GrapplePoint_C_CheckForErrors, CallFunc_Conv_StringToText_ReturnValue) == 0x000078, "Member 'BP_GrapplePoint_C_CheckForErrors::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GrapplePoint_C_CheckForErrors, K2Node_MakeArray_Array) == 0x000088, "Member 'BP_GrapplePoint_C_CheckForErrors::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_GrapplePoint_C_CheckForErrors, K2Node_MakeStruct_FormatArgumentData_1) == 0x000098, "Member 'BP_GrapplePoint_C_CheckForErrors::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BP_GrapplePoint_C_CheckForErrors, CallFunc_Format_ReturnValue) == 0x0000E0, "Member 'BP_GrapplePoint_C_CheckForErrors::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GrapplePoint_C_CheckForErrors, CallFunc_MakeLiteralDouble_ReturnValue) == 0x0000F0, "Member 'BP_GrapplePoint_C_CheckForErrors::CallFunc_MakeLiteralDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GrapplePoint_C_CheckForErrors, K2Node_MakeStruct_FormatArgumentData_2) == 0x0000F8, "Member 'BP_GrapplePoint_C_CheckForErrors::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(BP_GrapplePoint_C_CheckForErrors, K2Node_MakeStruct_FormatArgumentData_3) == 0x000140, "Member 'BP_GrapplePoint_C_CheckForErrors::K2Node_MakeStruct_FormatArgumentData_3' has a wrong offset!");
static_assert(offsetof(BP_GrapplePoint_C_CheckForErrors, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000188, "Member 'BP_GrapplePoint_C_CheckForErrors::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GrapplePoint_C_CheckForErrors, K2Node_MakeArray_Array_1) == 0x000190, "Member 'BP_GrapplePoint_C_CheckForErrors::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BP_GrapplePoint_C_CheckForErrors, CallFunc_Format_ReturnValue_1) == 0x0001A0, "Member 'BP_GrapplePoint_C_CheckForErrors::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GrapplePoint_C_CheckForErrors, CallFunc_Array_Add_ReturnValue) == 0x0001B0, "Member 'BP_GrapplePoint_C_CheckForErrors::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GrapplePoint_C_CheckForErrors, CallFunc_MakeLiteralBool_ReturnValue) == 0x0001B4, "Member 'BP_GrapplePoint_C_CheckForErrors::CallFunc_MakeLiteralBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GrapplePoint_C_CheckForErrors, Temp_int_Loop_Counter_Variable) == 0x0001B8, "Member 'BP_GrapplePoint_C_CheckForErrors::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_GrapplePoint_C_CheckForErrors, CallFunc_Array_Get_Item) == 0x0001C0, "Member 'BP_GrapplePoint_C_CheckForErrors::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_GrapplePoint_C_CheckForErrors, CallFunc_Array_Length_ReturnValue) == 0x0001D0, "Member 'BP_GrapplePoint_C_CheckForErrors::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GrapplePoint_C_CheckForErrors, CallFunc_Less_IntInt_ReturnValue) == 0x0001D4, "Member 'BP_GrapplePoint_C_CheckForErrors::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GrapplePoint_C_CheckForErrors, CallFunc_Add_IntInt_ReturnValue) == 0x0001D8, "Member 'BP_GrapplePoint_C_CheckForErrors::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function BP_GrapplePoint.BP_GrapplePoint_C.DEBUG_ValidateInteractionRadius
// 0x0128 (0x0128 - 0x0000)
struct BP_GrapplePoint_C_DEBUG_ValidateInteractionRadius final
{
public:
	double                                        CallFunc_MakeLiteralDouble_ReturnValue;            // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0018(0x0048)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0060(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0070(0x0048)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x00B8(0x0048)(HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0108(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Format_ReturnValue;                       // 0x0118(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GrapplePoint_C_DEBUG_ValidateInteractionRadius) == 0x000008, "Wrong alignment on BP_GrapplePoint_C_DEBUG_ValidateInteractionRadius");
static_assert(sizeof(BP_GrapplePoint_C_DEBUG_ValidateInteractionRadius) == 0x000128, "Wrong size on BP_GrapplePoint_C_DEBUG_ValidateInteractionRadius");
static_assert(offsetof(BP_GrapplePoint_C_DEBUG_ValidateInteractionRadius, CallFunc_MakeLiteralDouble_ReturnValue) == 0x000000, "Member 'BP_GrapplePoint_C_DEBUG_ValidateInteractionRadius::CallFunc_MakeLiteralDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GrapplePoint_C_DEBUG_ValidateInteractionRadius, CallFunc_GetDisplayName_ReturnValue) == 0x000008, "Member 'BP_GrapplePoint_C_DEBUG_ValidateInteractionRadius::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GrapplePoint_C_DEBUG_ValidateInteractionRadius, K2Node_MakeStruct_FormatArgumentData) == 0x000018, "Member 'BP_GrapplePoint_C_DEBUG_ValidateInteractionRadius::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_GrapplePoint_C_DEBUG_ValidateInteractionRadius, CallFunc_Conv_StringToText_ReturnValue) == 0x000060, "Member 'BP_GrapplePoint_C_DEBUG_ValidateInteractionRadius::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GrapplePoint_C_DEBUG_ValidateInteractionRadius, K2Node_MakeStruct_FormatArgumentData_1) == 0x000070, "Member 'BP_GrapplePoint_C_DEBUG_ValidateInteractionRadius::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BP_GrapplePoint_C_DEBUG_ValidateInteractionRadius, K2Node_MakeStruct_FormatArgumentData_2) == 0x0000B8, "Member 'BP_GrapplePoint_C_DEBUG_ValidateInteractionRadius::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(BP_GrapplePoint_C_DEBUG_ValidateInteractionRadius, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000100, "Member 'BP_GrapplePoint_C_DEBUG_ValidateInteractionRadius::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GrapplePoint_C_DEBUG_ValidateInteractionRadius, K2Node_MakeArray_Array) == 0x000108, "Member 'BP_GrapplePoint_C_DEBUG_ValidateInteractionRadius::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_GrapplePoint_C_DEBUG_ValidateInteractionRadius, CallFunc_Format_ReturnValue) == 0x000118, "Member 'BP_GrapplePoint_C_DEBUG_ValidateInteractionRadius::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function BP_GrapplePoint.BP_GrapplePoint_C.ExecuteUbergraph_BP_GrapplePoint
// 0x0348 (0x0348 - 0x0000)
struct BP_GrapplePoint_C_ExecuteUbergraph_BP_GrapplePoint final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable;                                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_1;                              // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPackagedForDistribution_ReturnValue;    // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_jRPG_Character_World_C*             K2Node_Event_InteractingWorldCharacter;            // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_Instant;                              // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent_3;  // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor_3;           // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp_3;            // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex_3;       // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep_1;           // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult_1;          // 0x0050(0x00F8)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent_2;  // 0x0148(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor_2;           // 0x0150(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp_2;            // 0x0158(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex_2;       // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_164[0x4];                                      // 0x0164(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_jRPG_Character_World_C*             K2Node_DynamicCast_AsBP_J_RPG_Character_World;     // 0x0168(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_171[0x7];                                      // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_jRPG_Character_World_C*             K2Node_DynamicCast_AsBP_J_RPG_Character_World_1;   // 0x0178(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_181[0x7];                                      // 0x0181(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameAction_Wrapper                    CallFunc_Array_Get_Item;                           // 0x0188(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19C[0x4];                                      // 0x019C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent_1;  // 0x01A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor_1;           // 0x01A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp_1;            // 0x01B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex_1;       // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x01BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1BD[0x3];                                      // 0x01BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x01C0(0x00F8)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x02B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x02C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x02C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x02D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D4[0x4];                                      // 0x02D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_jRPG_Character_World_C*             K2Node_DynamicCast_AsBP_J_RPG_Character_World_2;   // 0x02D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x02E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E1[0x7];                                      // 0x02E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_jRPG_Character_World_C*             K2Node_DynamicCast_AsBP_J_RPG_Character_World_3;   // 0x02E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x02F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F1[0x7];                                      // 0x02F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UNiagaraComponent*>              CallFunc_GetArmRingComponents_ArmRingComponents;   // 0x02F8(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UNiagaraComponent*                      CallFunc_Array_Get_Item_1;                         // 0x0308(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0310(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0314(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_WasRecentlyRendered_ReturnValue;          // 0x0315(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0316(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_317[0x1];                                      // 0x0317(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0318(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_jRPG_Controller_World_C*            K2Node_DynamicCast_AsBP_J_RPG_Controller_World;    // 0x0320(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0328(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInBattle_ReturnValue;                   // 0x0329(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x032A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x032B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x032C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32D[0x3];                                      // 0x032D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x0330(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0334(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0338(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_339[0x3];                                      // 0x0339(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x033C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0340(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GrapplePoint_C_ExecuteUbergraph_BP_GrapplePoint) == 0x000008, "Wrong alignment on BP_GrapplePoint_C_ExecuteUbergraph_BP_GrapplePoint");
static_assert(sizeof(BP_GrapplePoint_C_ExecuteUbergraph_BP_GrapplePoint) == 0x000348, "Wrong size on BP_GrapplePoint_C_ExecuteUbergraph_BP_GrapplePoint");
static_assert(offsetof(BP_GrapplePoint_C_ExecuteUbergraph_BP_GrapplePoint, EntryPoint) == 0x000000, "Member 'BP_GrapplePoint_C_ExecuteUbergraph_BP_GrapplePoint::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_GrapplePoint_C_ExecuteUbergraph_BP_GrapplePoint, Temp_real_Variable) == 0x000004, "Member 'BP_GrapplePoint_C_ExecuteUbergraph_BP_GrapplePoint::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(BP_GrapplePoint_C_ExecuteUbergraph_BP_GrapplePoint, Temp_int_Array_Index_Variable) == 0x000008, "Member 'BP_GrapplePoint_C_ExecuteUbergraph_BP_GrapplePoint::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_GrapplePoint_C_ExecuteUbergraph_BP_GrapplePoint, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'BP_GrapplePoint_C_ExecuteUbergraph_BP_GrapplePoint::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_GrapplePoint_C_ExecuteUbergraph_BP_GrapplePoint, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'BP_GrapplePoint_C_ExecuteUbergraph_BP_GrapplePoint::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GrapplePoint_C_ExecuteUbergraph_BP_GrapplePoint, Temp_int_Array_Index_Variable_1) == 0x000014, "Member 'BP_GrapplePoint_C_ExecuteUbergraph_BP_GrapplePoint::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_GrapplePoint_C_ExecuteUbergraph_BP_GrapplePoint, Temp_real_Variable_1) == 0x000018, "Member 'BP_GrapplePoint_C_ExecuteUbergraph_BP_GrapplePoint::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_GrapplePoint_C_ExecuteUbergraph_BP_GrapplePoint, CallFunc_IsPackagedForDistribution_ReturnValue) == 0x00001C, "Member 'BP_GrapplePoint_C_ExecuteUbergraph_BP_GrapplePoint::CallFunc_IsPackagedForDistribution_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GrapplePoint_C_ExecuteUbergraph_BP_GrapplePoint, K2Node_Event_InteractingWorldCharacter) == 0x000020, "Member 'BP_GrapplePoint_C_ExecuteUbergraph_BP_GrapplePoint::K2Node_Event_InteractingWorldCharacter' has a wrong offset!");
static_assert(offsetof(BP_GrapplePoint_C_ExecuteUbergraph_BP_GrapplePoint, K2Node_Event_Instant) == 0x000028, "Member 'BP_GrapplePoint_C_ExecuteUbergraph_BP_GrapplePoint::K2Node_Event_Instant' has a wrong offset!");
static_assert(offsetof(BP_GrapplePoint_C_ExecuteUbergraph_BP_GrapplePoint, K2Node_ComponentBoundEvent_OverlappedComponent_3) == 0x000030, "Member 'BP_GrapplePoint_C_ExecuteUbergraph_BP_GrapplePoint::K2Node_ComponentBoundEvent_OverlappedComponent_3' has a wrong offset!");
static_assert(offsetof(BP_GrapplePoint_C_ExecuteUbergraph_BP_GrapplePoint, K2Node_ComponentBoundEvent_OtherActor_3) == 0x000038, "Member 'BP_GrapplePoint_C_ExecuteUbergraph_BP_GrapplePoint::K2Node_ComponentBoundEvent_OtherActor_3' has a wrong offset!");
static_assert(offsetof(BP_GrapplePoint_C_ExecuteUbergraph_BP_GrapplePoint, K2Node_ComponentBoundEvent_OtherComp_3) == 0x000040, "Member 'BP_GrapplePoint_C_ExecuteUbergraph_BP_GrapplePoint::K2Node_ComponentBoundEvent_OtherComp_3' has a wrong offset!");
static_assert(offsetof(BP_GrapplePoint_C_ExecuteUbergraph_BP_GrapplePoint, K2Node_ComponentBoundEvent_OtherBodyIndex_3) == 0x000048, "Member 'BP_GrapplePoint_C_ExecuteUbergraph_BP_GrapplePoint::K2Node_ComponentBoundEvent_OtherBodyIndex_3' has a wrong offset!");
static_assert(offsetof(BP_GrapplePoint_C_ExecuteUbergraph_BP_GrapplePoint, K2Node_ComponentBoundEvent_bFromSweep_1) == 0x00004C, "Member 'BP_GrapplePoint_C_ExecuteUbergraph_BP_GrapplePoint::K2Node_ComponentBoundEvent_bFromSweep_1' has a wrong offset!");
static_assert(offsetof(BP_GrapplePoint_C_ExecuteUbergraph_BP_GrapplePoint, K2Node_ComponentBoundEvent_SweepResult_1) == 0x000050, "Member 'BP_GrapplePoint_C_ExecuteUbergraph_BP_GrapplePoint::K2Node_ComponentBoundEvent_SweepResult_1' has a wrong offset!");
static_assert(offsetof(BP_GrapplePoint_C_ExecuteUbergraph_BP_GrapplePoint, K2Node_ComponentBoundEvent_OverlappedComponent_2) == 0x000148, "Member 'BP_GrapplePoint_C_ExecuteUbergraph_BP_GrapplePoint::K2Node_ComponentBoundEvent_OverlappedComponent_2' has a wrong offset!");
static_assert(offsetof(BP_GrapplePoint_C_ExecuteUbergraph_BP_GrapplePoint, K2Node_ComponentBoundEvent_OtherActor_2) == 0x000150, "Member 'BP_GrapplePoint_C_ExecuteUbergraph_BP_GrapplePoint::K2Node_ComponentBoundEvent_OtherActor_2' has a wrong offset!");
static_assert(offsetof(BP_GrapplePoint_C_ExecuteUbergraph_BP_GrapplePoint, K2Node_ComponentBoundEvent_OtherComp_2) == 0x000158, "Member 'BP_GrapplePoint_C_ExecuteUbergraph_BP_GrapplePoint::K2Node_ComponentBoundEvent_OtherComp_2' has a wrong offset!");
static_assert(offsetof(BP_GrapplePoint_C_ExecuteUbergraph_BP_GrapplePoint, K2Node_ComponentBoundEvent_OtherBodyIndex_2) == 0x000160, "Member 'BP_GrapplePoint_C_ExecuteUbergraph_BP_GrapplePoint::K2Node_ComponentBoundEvent_OtherBodyIndex_2' has a wrong offset!");
static_assert(offsetof(BP_GrapplePoint_C_ExecuteUbergraph_BP_GrapplePoint, K2Node_DynamicCast_AsBP_J_RPG_Character_World) == 0x000168, "Member 'BP_GrapplePoint_C_ExecuteUbergraph_BP_GrapplePoint::K2Node_DynamicCast_AsBP_J_RPG_Character_World' has a wrong offset!");
static_assert(offsetof(BP_GrapplePoint_C_ExecuteUbergraph_BP_GrapplePoint, K2Node_DynamicCast_bSuccess) == 0x000170, "Member 'BP_GrapplePoint_C_ExecuteUbergraph_BP_GrapplePoint::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_GrapplePoint_C_ExecuteUbergraph_BP_GrapplePoint, K2Node_DynamicCast_AsBP_J_RPG_Character_World_1) == 0x000178, "Member 'BP_GrapplePoint_C_ExecuteUbergraph_BP_GrapplePoint::K2Node_DynamicCast_AsBP_J_RPG_Character_World_1' has a wrong offset!");
static_assert(offsetof(BP_GrapplePoint_C_ExecuteUbergraph_BP_GrapplePoint, K2Node_DynamicCast_bSuccess_1) == 0x000180, "Member 'BP_GrapplePoint_C_ExecuteUbergraph_BP_GrapplePoint::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_GrapplePoint_C_ExecuteUbergraph_BP_GrapplePoint, CallFunc_Array_Get_Item) == 0x000188, "Member 'BP_GrapplePoint_C_ExecuteUbergraph_BP_GrapplePoint::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_GrapplePoint_C_ExecuteUbergraph_BP_GrapplePoint, CallFunc_Array_Length_ReturnValue) == 0x000198, "Member 'BP_GrapplePoint_C_ExecuteUbergraph_BP_GrapplePoint::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GrapplePoint_C_ExecuteUbergraph_BP_GrapplePoint, K2Node_ComponentBoundEvent_OverlappedComponent_1) == 0x0001A0, "Member 'BP_GrapplePoint_C_ExecuteUbergraph_BP_GrapplePoint::K2Node_ComponentBoundEvent_OverlappedComponent_1' has a wrong offset!");
static_assert(offsetof(BP_GrapplePoint_C_ExecuteUbergraph_BP_GrapplePoint, K2Node_ComponentBoundEvent_OtherActor_1) == 0x0001A8, "Member 'BP_GrapplePoint_C_ExecuteUbergraph_BP_GrapplePoint::K2Node_ComponentBoundEvent_OtherActor_1' has a wrong offset!");
static_assert(offsetof(BP_GrapplePoint_C_ExecuteUbergraph_BP_GrapplePoint, K2Node_ComponentBoundEvent_OtherComp_1) == 0x0001B0, "Member 'BP_GrapplePoint_C_ExecuteUbergraph_BP_GrapplePoint::K2Node_ComponentBoundEvent_OtherComp_1' has a wrong offset!");
static_assert(offsetof(BP_GrapplePoint_C_ExecuteUbergraph_BP_GrapplePoint, K2Node_ComponentBoundEvent_OtherBodyIndex_1) == 0x0001B8, "Member 'BP_GrapplePoint_C_ExecuteUbergraph_BP_GrapplePoint::K2Node_ComponentBoundEvent_OtherBodyIndex_1' has a wrong offset!");
static_assert(offsetof(BP_GrapplePoint_C_ExecuteUbergraph_BP_GrapplePoint, K2Node_ComponentBoundEvent_bFromSweep) == 0x0001BC, "Member 'BP_GrapplePoint_C_ExecuteUbergraph_BP_GrapplePoint::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_GrapplePoint_C_ExecuteUbergraph_BP_GrapplePoint, K2Node_ComponentBoundEvent_SweepResult) == 0x0001C0, "Member 'BP_GrapplePoint_C_ExecuteUbergraph_BP_GrapplePoint::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(BP_GrapplePoint_C_ExecuteUbergraph_BP_GrapplePoint, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x0002B8, "Member 'BP_GrapplePoint_C_ExecuteUbergraph_BP_GrapplePoint::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_GrapplePoint_C_ExecuteUbergraph_BP_GrapplePoint, K2Node_ComponentBoundEvent_OtherActor) == 0x0002C0, "Member 'BP_GrapplePoint_C_ExecuteUbergraph_BP_GrapplePoint::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(BP_GrapplePoint_C_ExecuteUbergraph_BP_GrapplePoint, K2Node_ComponentBoundEvent_OtherComp) == 0x0002C8, "Member 'BP_GrapplePoint_C_ExecuteUbergraph_BP_GrapplePoint::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(BP_GrapplePoint_C_ExecuteUbergraph_BP_GrapplePoint, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x0002D0, "Member 'BP_GrapplePoint_C_ExecuteUbergraph_BP_GrapplePoint::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_GrapplePoint_C_ExecuteUbergraph_BP_GrapplePoint, K2Node_DynamicCast_AsBP_J_RPG_Character_World_2) == 0x0002D8, "Member 'BP_GrapplePoint_C_ExecuteUbergraph_BP_GrapplePoint::K2Node_DynamicCast_AsBP_J_RPG_Character_World_2' has a wrong offset!");
static_assert(offsetof(BP_GrapplePoint_C_ExecuteUbergraph_BP_GrapplePoint, K2Node_DynamicCast_bSuccess_2) == 0x0002E0, "Member 'BP_GrapplePoint_C_ExecuteUbergraph_BP_GrapplePoint::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_GrapplePoint_C_ExecuteUbergraph_BP_GrapplePoint, K2Node_DynamicCast_AsBP_J_RPG_Character_World_3) == 0x0002E8, "Member 'BP_GrapplePoint_C_ExecuteUbergraph_BP_GrapplePoint::K2Node_DynamicCast_AsBP_J_RPG_Character_World_3' has a wrong offset!");
static_assert(offsetof(BP_GrapplePoint_C_ExecuteUbergraph_BP_GrapplePoint, K2Node_DynamicCast_bSuccess_3) == 0x0002F0, "Member 'BP_GrapplePoint_C_ExecuteUbergraph_BP_GrapplePoint::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BP_GrapplePoint_C_ExecuteUbergraph_BP_GrapplePoint, CallFunc_GetArmRingComponents_ArmRingComponents) == 0x0002F8, "Member 'BP_GrapplePoint_C_ExecuteUbergraph_BP_GrapplePoint::CallFunc_GetArmRingComponents_ArmRingComponents' has a wrong offset!");
static_assert(offsetof(BP_GrapplePoint_C_ExecuteUbergraph_BP_GrapplePoint, CallFunc_Array_Get_Item_1) == 0x000308, "Member 'BP_GrapplePoint_C_ExecuteUbergraph_BP_GrapplePoint::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_GrapplePoint_C_ExecuteUbergraph_BP_GrapplePoint, CallFunc_Array_Length_ReturnValue_1) == 0x000310, "Member 'BP_GrapplePoint_C_ExecuteUbergraph_BP_GrapplePoint::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GrapplePoint_C_ExecuteUbergraph_BP_GrapplePoint, CallFunc_Less_IntInt_ReturnValue) == 0x000314, "Member 'BP_GrapplePoint_C_ExecuteUbergraph_BP_GrapplePoint::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GrapplePoint_C_ExecuteUbergraph_BP_GrapplePoint, CallFunc_WasRecentlyRendered_ReturnValue) == 0x000315, "Member 'BP_GrapplePoint_C_ExecuteUbergraph_BP_GrapplePoint::CallFunc_WasRecentlyRendered_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GrapplePoint_C_ExecuteUbergraph_BP_GrapplePoint, Temp_bool_Variable) == 0x000316, "Member 'BP_GrapplePoint_C_ExecuteUbergraph_BP_GrapplePoint::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_GrapplePoint_C_ExecuteUbergraph_BP_GrapplePoint, CallFunc_GetPlayerController_ReturnValue) == 0x000318, "Member 'BP_GrapplePoint_C_ExecuteUbergraph_BP_GrapplePoint::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GrapplePoint_C_ExecuteUbergraph_BP_GrapplePoint, K2Node_DynamicCast_AsBP_J_RPG_Controller_World) == 0x000320, "Member 'BP_GrapplePoint_C_ExecuteUbergraph_BP_GrapplePoint::K2Node_DynamicCast_AsBP_J_RPG_Controller_World' has a wrong offset!");
static_assert(offsetof(BP_GrapplePoint_C_ExecuteUbergraph_BP_GrapplePoint, K2Node_DynamicCast_bSuccess_4) == 0x000328, "Member 'BP_GrapplePoint_C_ExecuteUbergraph_BP_GrapplePoint::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(BP_GrapplePoint_C_ExecuteUbergraph_BP_GrapplePoint, CallFunc_IsInBattle_ReturnValue) == 0x000329, "Member 'BP_GrapplePoint_C_ExecuteUbergraph_BP_GrapplePoint::CallFunc_IsInBattle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GrapplePoint_C_ExecuteUbergraph_BP_GrapplePoint, CallFunc_Not_PreBool_ReturnValue) == 0x00032A, "Member 'BP_GrapplePoint_C_ExecuteUbergraph_BP_GrapplePoint::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GrapplePoint_C_ExecuteUbergraph_BP_GrapplePoint, CallFunc_Not_PreBool_ReturnValue_1) == 0x00032B, "Member 'BP_GrapplePoint_C_ExecuteUbergraph_BP_GrapplePoint::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GrapplePoint_C_ExecuteUbergraph_BP_GrapplePoint, CallFunc_BooleanAND_ReturnValue) == 0x00032C, "Member 'BP_GrapplePoint_C_ExecuteUbergraph_BP_GrapplePoint::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GrapplePoint_C_ExecuteUbergraph_BP_GrapplePoint, K2Node_Select_Default) == 0x000330, "Member 'BP_GrapplePoint_C_ExecuteUbergraph_BP_GrapplePoint::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_GrapplePoint_C_ExecuteUbergraph_BP_GrapplePoint, Temp_int_Loop_Counter_Variable_1) == 0x000334, "Member 'BP_GrapplePoint_C_ExecuteUbergraph_BP_GrapplePoint::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_GrapplePoint_C_ExecuteUbergraph_BP_GrapplePoint, CallFunc_Less_IntInt_ReturnValue_1) == 0x000338, "Member 'BP_GrapplePoint_C_ExecuteUbergraph_BP_GrapplePoint::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GrapplePoint_C_ExecuteUbergraph_BP_GrapplePoint, CallFunc_Add_IntInt_ReturnValue_1) == 0x00033C, "Member 'BP_GrapplePoint_C_ExecuteUbergraph_BP_GrapplePoint::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GrapplePoint_C_ExecuteUbergraph_BP_GrapplePoint, K2Node_Event_DeltaSeconds) == 0x000340, "Member 'BP_GrapplePoint_C_ExecuteUbergraph_BP_GrapplePoint::K2Node_Event_DeltaSeconds' has a wrong offset!");

// Function BP_GrapplePoint.BP_GrapplePoint_C.GetInteractionPromptParams
// 0x0030 (0x0030 - 0x0000)
struct BP_GrapplePoint_C_GetInteractionPromptParams final
{
public:
	struct FFPromptParams                         PromptParams;                                      // 0x0000(0x0018)(Parm, OutParm, HasGetValueTypeHash)
	struct FFPromptParams                         K2Node_MakeStruct_FPromptParams;                   // 0x0018(0x0018)(HasGetValueTypeHash)
};
static_assert(alignof(BP_GrapplePoint_C_GetInteractionPromptParams) == 0x000008, "Wrong alignment on BP_GrapplePoint_C_GetInteractionPromptParams");
static_assert(sizeof(BP_GrapplePoint_C_GetInteractionPromptParams) == 0x000030, "Wrong size on BP_GrapplePoint_C_GetInteractionPromptParams");
static_assert(offsetof(BP_GrapplePoint_C_GetInteractionPromptParams, PromptParams) == 0x000000, "Member 'BP_GrapplePoint_C_GetInteractionPromptParams::PromptParams' has a wrong offset!");
static_assert(offsetof(BP_GrapplePoint_C_GetInteractionPromptParams, K2Node_MakeStruct_FPromptParams) == 0x000018, "Member 'BP_GrapplePoint_C_GetInteractionPromptParams::K2Node_MakeStruct_FPromptParams' has a wrong offset!");

// Function BP_GrapplePoint.BP_GrapplePoint_C.OnInteractionRequested
// 0x0010 (0x0010 - 0x0000)
struct BP_GrapplePoint_C_OnInteractionRequested final
{
public:
	class ABP_jRPG_Character_World_C*             InteractingWorldCharacter;                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Instant;                                           // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
