#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GameplayRoom

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_GameplayRoom.BP_GameplayRoom_C
// 0x0018 (0x02A8 - 0x0290)
class ABP_GameplayRoom_C final : public AActor
{
public:
	class UTextRenderComponent*                   TextRender;                                        // 0x0290(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Box;                                               // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_GameplayRoom_C">();
	}
	static class ABP_GameplayRoom_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_GameplayRoom_C>();
	}
};
static_assert(alignof(ABP_GameplayRoom_C) == 0x000008, "Wrong alignment on ABP_GameplayRoom_C");
static_assert(sizeof(ABP_GameplayRoom_C) == 0x0002A8, "Wrong size on ABP_GameplayRoom_C");
static_assert(offsetof(ABP_GameplayRoom_C, TextRender) == 0x000290, "Member 'ABP_GameplayRoom_C::TextRender' has a wrong offset!");
static_assert(offsetof(ABP_GameplayRoom_C, Box) == 0x000298, "Member 'ABP_GameplayRoom_C::Box' has a wrong offset!");
static_assert(offsetof(ABP_GameplayRoom_C, DefaultSceneRoot) == 0x0002A0, "Member 'ABP_GameplayRoom_C::DefaultSceneRoot' has a wrong offset!");

}

