#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GroupInstance_Base

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_GroupInstance_Base.BP_GroupInstance_Base_C.AddMatchingObject
// 0x0010 (0x0010 - 0x0000)
struct BP_GroupInstance_Base_C_AddMatchingObject final
{
public:
	const class UObject*                          NewItem;                                           // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GroupInstance_Base_C_AddMatchingObject) == 0x000008, "Wrong alignment on BP_GroupInstance_Base_C_AddMatchingObject");
static_assert(sizeof(BP_GroupInstance_Base_C_AddMatchingObject) == 0x000010, "Wrong size on BP_GroupInstance_Base_C_AddMatchingObject");
static_assert(offsetof(BP_GroupInstance_Base_C_AddMatchingObject, NewItem) == 0x000000, "Member 'BP_GroupInstance_Base_C_AddMatchingObject::NewItem' has a wrong offset!");
static_assert(offsetof(BP_GroupInstance_Base_C_AddMatchingObject, CallFunc_Array_AddUnique_ReturnValue) == 0x000008, "Member 'BP_GroupInstance_Base_C_AddMatchingObject::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");

// Function BP_GroupInstance_Base.BP_GroupInstance_Base_C.DoesObjectMatch
// 0x0010 (0x0010 - 0x0000)
struct BP_GroupInstance_Base_C_DoesObjectMatch final
{
public:
	class UObject*                                Object;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          MatchesGroup;                                      // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GroupInstance_Base_C_DoesObjectMatch) == 0x000008, "Wrong alignment on BP_GroupInstance_Base_C_DoesObjectMatch");
static_assert(sizeof(BP_GroupInstance_Base_C_DoesObjectMatch) == 0x000010, "Wrong size on BP_GroupInstance_Base_C_DoesObjectMatch");
static_assert(offsetof(BP_GroupInstance_Base_C_DoesObjectMatch, Object) == 0x000000, "Member 'BP_GroupInstance_Base_C_DoesObjectMatch::Object' has a wrong offset!");
static_assert(offsetof(BP_GroupInstance_Base_C_DoesObjectMatch, MatchesGroup) == 0x000008, "Member 'BP_GroupInstance_Base_C_DoesObjectMatch::MatchesGroup' has a wrong offset!");

// Function BP_GroupInstance_Base.BP_GroupInstance_Base_C.GetGroupDisplayName
// 0x0010 (0x0010 - 0x0000)
struct BP_GroupInstance_Base_C_GetGroupDisplayName final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm)
};
static_assert(alignof(BP_GroupInstance_Base_C_GetGroupDisplayName) == 0x000008, "Wrong alignment on BP_GroupInstance_Base_C_GetGroupDisplayName");
static_assert(sizeof(BP_GroupInstance_Base_C_GetGroupDisplayName) == 0x000010, "Wrong size on BP_GroupInstance_Base_C_GetGroupDisplayName");
static_assert(offsetof(BP_GroupInstance_Base_C_GetGroupDisplayName, ReturnValue) == 0x000000, "Member 'BP_GroupInstance_Base_C_GetGroupDisplayName::ReturnValue' has a wrong offset!");

// Function BP_GroupInstance_Base.BP_GroupInstance_Base_C.GetMatchingObjects
// 0x0010 (0x0010 - 0x0000)
struct BP_GroupInstance_Base_C_GetMatchingObjects final
{
public:
	TArray<class UObject*>                        ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm)
};
static_assert(alignof(BP_GroupInstance_Base_C_GetMatchingObjects) == 0x000008, "Wrong alignment on BP_GroupInstance_Base_C_GetMatchingObjects");
static_assert(sizeof(BP_GroupInstance_Base_C_GetMatchingObjects) == 0x000010, "Wrong size on BP_GroupInstance_Base_C_GetMatchingObjects");
static_assert(offsetof(BP_GroupInstance_Base_C_GetMatchingObjects, ReturnValue) == 0x000000, "Member 'BP_GroupInstance_Base_C_GetMatchingObjects::ReturnValue' has a wrong offset!");

}

