#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GameActionInstance_PlayInWorldDialogue

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_GameActionInstance_PlayInWorldDialogue.BP_GameActionInstance_PlayInWorldDialogue_C.ExecuteUbergraph_BP_GameActionInstance_PlayInWorldDialogue
// 0x0040 (0x0040 - 0x0000)
struct BP_GameActionInstance_PlayInWorldDialogue_C_ExecuteUbergraph_BP_GameActionInstance_PlayInWorldDialogue final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_GameAction_PlayInworldDialogue_C*   K2Node_DynamicCast_As_DIALOGUE__Play_In_World_Dialogue; // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	const class APlayerController*                K2Node_Event_Controller;                           // 0x0028(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_jRPG_Controller_World_C*            K2Node_DynamicCast_AsBP_J_RPG_Controller_World;    // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_PlayInWorldDialogue_DialogueNotPlayed;    // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GameActionInstance_PlayInWorldDialogue_C_ExecuteUbergraph_BP_GameActionInstance_PlayInWorldDialogue) == 0x000008, "Wrong alignment on BP_GameActionInstance_PlayInWorldDialogue_C_ExecuteUbergraph_BP_GameActionInstance_PlayInWorldDialogue");
static_assert(sizeof(BP_GameActionInstance_PlayInWorldDialogue_C_ExecuteUbergraph_BP_GameActionInstance_PlayInWorldDialogue) == 0x000040, "Wrong size on BP_GameActionInstance_PlayInWorldDialogue_C_ExecuteUbergraph_BP_GameActionInstance_PlayInWorldDialogue");
static_assert(offsetof(BP_GameActionInstance_PlayInWorldDialogue_C_ExecuteUbergraph_BP_GameActionInstance_PlayInWorldDialogue, EntryPoint) == 0x000000, "Member 'BP_GameActionInstance_PlayInWorldDialogue_C_ExecuteUbergraph_BP_GameActionInstance_PlayInWorldDialogue::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_PlayInWorldDialogue_C_ExecuteUbergraph_BP_GameActionInstance_PlayInWorldDialogue, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BP_GameActionInstance_PlayInWorldDialogue_C_ExecuteUbergraph_BP_GameActionInstance_PlayInWorldDialogue::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_PlayInWorldDialogue_C_ExecuteUbergraph_BP_GameActionInstance_PlayInWorldDialogue, K2Node_DynamicCast_As_DIALOGUE__Play_In_World_Dialogue) == 0x000018, "Member 'BP_GameActionInstance_PlayInWorldDialogue_C_ExecuteUbergraph_BP_GameActionInstance_PlayInWorldDialogue::K2Node_DynamicCast_As_DIALOGUE__Play_In_World_Dialogue' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_PlayInWorldDialogue_C_ExecuteUbergraph_BP_GameActionInstance_PlayInWorldDialogue, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_GameActionInstance_PlayInWorldDialogue_C_ExecuteUbergraph_BP_GameActionInstance_PlayInWorldDialogue::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_PlayInWorldDialogue_C_ExecuteUbergraph_BP_GameActionInstance_PlayInWorldDialogue, CallFunc_Not_PreBool_ReturnValue) == 0x000021, "Member 'BP_GameActionInstance_PlayInWorldDialogue_C_ExecuteUbergraph_BP_GameActionInstance_PlayInWorldDialogue::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_PlayInWorldDialogue_C_ExecuteUbergraph_BP_GameActionInstance_PlayInWorldDialogue, K2Node_Event_Controller) == 0x000028, "Member 'BP_GameActionInstance_PlayInWorldDialogue_C_ExecuteUbergraph_BP_GameActionInstance_PlayInWorldDialogue::K2Node_Event_Controller' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_PlayInWorldDialogue_C_ExecuteUbergraph_BP_GameActionInstance_PlayInWorldDialogue, K2Node_DynamicCast_AsBP_J_RPG_Controller_World) == 0x000030, "Member 'BP_GameActionInstance_PlayInWorldDialogue_C_ExecuteUbergraph_BP_GameActionInstance_PlayInWorldDialogue::K2Node_DynamicCast_AsBP_J_RPG_Controller_World' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_PlayInWorldDialogue_C_ExecuteUbergraph_BP_GameActionInstance_PlayInWorldDialogue, K2Node_DynamicCast_bSuccess_1) == 0x000038, "Member 'BP_GameActionInstance_PlayInWorldDialogue_C_ExecuteUbergraph_BP_GameActionInstance_PlayInWorldDialogue::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_PlayInWorldDialogue_C_ExecuteUbergraph_BP_GameActionInstance_PlayInWorldDialogue, CallFunc_PlayInWorldDialogue_DialogueNotPlayed) == 0x000039, "Member 'BP_GameActionInstance_PlayInWorldDialogue_C_ExecuteUbergraph_BP_GameActionInstance_PlayInWorldDialogue::CallFunc_PlayInWorldDialogue_DialogueNotPlayed' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_PlayInWorldDialogue_C_ExecuteUbergraph_BP_GameActionInstance_PlayInWorldDialogue, CallFunc_BooleanOR_ReturnValue) == 0x00003A, "Member 'BP_GameActionInstance_PlayInWorldDialogue_C_ExecuteUbergraph_BP_GameActionInstance_PlayInWorldDialogue::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function BP_GameActionInstance_PlayInWorldDialogue.BP_GameActionInstance_PlayInWorldDialogue_C.ExecuteGameAction
// 0x0008 (0x0008 - 0x0000)
struct BP_GameActionInstance_PlayInWorldDialogue_C_ExecuteGameAction final
{
public:
	const class APlayerController*                Controller;                                        // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GameActionInstance_PlayInWorldDialogue_C_ExecuteGameAction) == 0x000008, "Wrong alignment on BP_GameActionInstance_PlayInWorldDialogue_C_ExecuteGameAction");
static_assert(sizeof(BP_GameActionInstance_PlayInWorldDialogue_C_ExecuteGameAction) == 0x000008, "Wrong size on BP_GameActionInstance_PlayInWorldDialogue_C_ExecuteGameAction");
static_assert(offsetof(BP_GameActionInstance_PlayInWorldDialogue_C_ExecuteGameAction, Controller) == 0x000000, "Member 'BP_GameActionInstance_PlayInWorldDialogue_C_ExecuteGameAction::Controller' has a wrong offset!");

// Function BP_GameActionInstance_PlayInWorldDialogue.BP_GameActionInstance_PlayInWorldDialogue_C.ShouldTriggerAutoSaveAfterExecution
// 0x0001 (0x0001 - 0x0000)
struct BP_GameActionInstance_PlayInWorldDialogue_C_ShouldTriggerAutoSaveAfterExecution final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GameActionInstance_PlayInWorldDialogue_C_ShouldTriggerAutoSaveAfterExecution) == 0x000001, "Wrong alignment on BP_GameActionInstance_PlayInWorldDialogue_C_ShouldTriggerAutoSaveAfterExecution");
static_assert(sizeof(BP_GameActionInstance_PlayInWorldDialogue_C_ShouldTriggerAutoSaveAfterExecution) == 0x000001, "Wrong size on BP_GameActionInstance_PlayInWorldDialogue_C_ShouldTriggerAutoSaveAfterExecution");
static_assert(offsetof(BP_GameActionInstance_PlayInWorldDialogue_C_ShouldTriggerAutoSaveAfterExecution, ReturnValue) == 0x000000, "Member 'BP_GameActionInstance_PlayInWorldDialogue_C_ShouldTriggerAutoSaveAfterExecution::ReturnValue' has a wrong offset!");

// Function BP_GameActionInstance_PlayInWorldDialogue.BP_GameActionInstance_PlayInWorldDialogue_C.ShouldBlockAutoSaveDuringExecution
// 0x0001 (0x0001 - 0x0000)
struct BP_GameActionInstance_PlayInWorldDialogue_C_ShouldBlockAutoSaveDuringExecution final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GameActionInstance_PlayInWorldDialogue_C_ShouldBlockAutoSaveDuringExecution) == 0x000001, "Wrong alignment on BP_GameActionInstance_PlayInWorldDialogue_C_ShouldBlockAutoSaveDuringExecution");
static_assert(sizeof(BP_GameActionInstance_PlayInWorldDialogue_C_ShouldBlockAutoSaveDuringExecution) == 0x000001, "Wrong size on BP_GameActionInstance_PlayInWorldDialogue_C_ShouldBlockAutoSaveDuringExecution");
static_assert(offsetof(BP_GameActionInstance_PlayInWorldDialogue_C_ShouldBlockAutoSaveDuringExecution, ReturnValue) == 0x000000, "Member 'BP_GameActionInstance_PlayInWorldDialogue_C_ShouldBlockAutoSaveDuringExecution::ReturnValue' has a wrong offset!");

// Function BP_GameActionInstance_PlayInWorldDialogue.BP_GameActionInstance_PlayInWorldDialogue_C.GetDebugString
// 0x0110 (0x0110 - 0x0000)
struct BP_GameActionInstance_PlayInWorldDialogue_C_GetDebugString final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UBP_GameAction_PlayInworldDialogue_C*   K2Node_DynamicCast_As_DIALOGUE__Play_In_World_Dialogue; // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0030(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0040(0x0048)(HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue_1;             // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0098(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00A8(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00F0(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Format_ReturnValue;                       // 0x0100(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GameActionInstance_PlayInWorldDialogue_C_GetDebugString) == 0x000008, "Wrong alignment on BP_GameActionInstance_PlayInWorldDialogue_C_GetDebugString");
static_assert(sizeof(BP_GameActionInstance_PlayInWorldDialogue_C_GetDebugString) == 0x000110, "Wrong size on BP_GameActionInstance_PlayInWorldDialogue_C_GetDebugString");
static_assert(offsetof(BP_GameActionInstance_PlayInWorldDialogue_C_GetDebugString, ReturnValue) == 0x000000, "Member 'BP_GameActionInstance_PlayInWorldDialogue_C_GetDebugString::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_PlayInWorldDialogue_C_GetDebugString, CallFunc_GetDisplayName_ReturnValue) == 0x000010, "Member 'BP_GameActionInstance_PlayInWorldDialogue_C_GetDebugString::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_PlayInWorldDialogue_C_GetDebugString, K2Node_DynamicCast_As_DIALOGUE__Play_In_World_Dialogue) == 0x000020, "Member 'BP_GameActionInstance_PlayInWorldDialogue_C_GetDebugString::K2Node_DynamicCast_As_DIALOGUE__Play_In_World_Dialogue' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_PlayInWorldDialogue_C_GetDebugString, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BP_GameActionInstance_PlayInWorldDialogue_C_GetDebugString::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_PlayInWorldDialogue_C_GetDebugString, CallFunc_Conv_StringToText_ReturnValue) == 0x000030, "Member 'BP_GameActionInstance_PlayInWorldDialogue_C_GetDebugString::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_PlayInWorldDialogue_C_GetDebugString, K2Node_MakeStruct_FormatArgumentData) == 0x000040, "Member 'BP_GameActionInstance_PlayInWorldDialogue_C_GetDebugString::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_PlayInWorldDialogue_C_GetDebugString, CallFunc_GetDisplayName_ReturnValue_1) == 0x000088, "Member 'BP_GameActionInstance_PlayInWorldDialogue_C_GetDebugString::CallFunc_GetDisplayName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_PlayInWorldDialogue_C_GetDebugString, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000098, "Member 'BP_GameActionInstance_PlayInWorldDialogue_C_GetDebugString::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_PlayInWorldDialogue_C_GetDebugString, K2Node_MakeStruct_FormatArgumentData_1) == 0x0000A8, "Member 'BP_GameActionInstance_PlayInWorldDialogue_C_GetDebugString::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_PlayInWorldDialogue_C_GetDebugString, K2Node_MakeArray_Array) == 0x0000F0, "Member 'BP_GameActionInstance_PlayInWorldDialogue_C_GetDebugString::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_PlayInWorldDialogue_C_GetDebugString, CallFunc_Format_ReturnValue) == 0x000100, "Member 'BP_GameActionInstance_PlayInWorldDialogue_C_GetDebugString::CallFunc_Format_ReturnValue' has a wrong offset!");

}

