#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GameAction_GoToCamp

#include "Basic.hpp"

#include "FLevelDataEntry_structs.hpp"


namespace SDK::Params
{

// Function BP_GameAction_GoToCamp.BP_GameAction_GoToCamp_C.ValidateGameAction
// 0x0208 (0x0208 - 0x0000)
struct BP_GameAction_GoToCamp_C_ValidateGameAction final
{
public:
	TArray<class FText>                           ErrorMessages;                                     // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FString                                 PropertyPath;                                      // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, HasGetValueTypeHash)
	bool                                          ExploreAssetChildren;                              // 0x0020(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_AppendPropertyPath_ReturnValue;           // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_AppendPropertyPath_ReturnValue_1;         // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGameplayTagValid_ReturnValue;           // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B[0x5];                                       // 0x004B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFLevelDataEntry                       CallFunc_GetDataTableRowFromName_OutRow;           // 0x0050(0x01B0)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GameAction_GoToCamp_C_ValidateGameAction) == 0x000008, "Wrong alignment on BP_GameAction_GoToCamp_C_ValidateGameAction");
static_assert(sizeof(BP_GameAction_GoToCamp_C_ValidateGameAction) == 0x000208, "Wrong size on BP_GameAction_GoToCamp_C_ValidateGameAction");
static_assert(offsetof(BP_GameAction_GoToCamp_C_ValidateGameAction, ErrorMessages) == 0x000000, "Member 'BP_GameAction_GoToCamp_C_ValidateGameAction::ErrorMessages' has a wrong offset!");
static_assert(offsetof(BP_GameAction_GoToCamp_C_ValidateGameAction, PropertyPath) == 0x000010, "Member 'BP_GameAction_GoToCamp_C_ValidateGameAction::PropertyPath' has a wrong offset!");
static_assert(offsetof(BP_GameAction_GoToCamp_C_ValidateGameAction, ExploreAssetChildren) == 0x000020, "Member 'BP_GameAction_GoToCamp_C_ValidateGameAction::ExploreAssetChildren' has a wrong offset!");
static_assert(offsetof(BP_GameAction_GoToCamp_C_ValidateGameAction, CallFunc_AppendPropertyPath_ReturnValue) == 0x000028, "Member 'BP_GameAction_GoToCamp_C_ValidateGameAction::CallFunc_AppendPropertyPath_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameAction_GoToCamp_C_ValidateGameAction, CallFunc_AppendPropertyPath_ReturnValue_1) == 0x000038, "Member 'BP_GameAction_GoToCamp_C_ValidateGameAction::CallFunc_AppendPropertyPath_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GameAction_GoToCamp_C_ValidateGameAction, CallFunc_IsGameplayTagValid_ReturnValue) == 0x000048, "Member 'BP_GameAction_GoToCamp_C_ValidateGameAction::CallFunc_IsGameplayTagValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameAction_GoToCamp_C_ValidateGameAction, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000049, "Member 'BP_GameAction_GoToCamp_C_ValidateGameAction::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameAction_GoToCamp_C_ValidateGameAction, CallFunc_NotEqual_NameName_ReturnValue) == 0x00004A, "Member 'BP_GameAction_GoToCamp_C_ValidateGameAction::CallFunc_NotEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameAction_GoToCamp_C_ValidateGameAction, CallFunc_GetDataTableRowFromName_OutRow) == 0x000050, "Member 'BP_GameAction_GoToCamp_C_ValidateGameAction::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BP_GameAction_GoToCamp_C_ValidateGameAction, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000200, "Member 'BP_GameAction_GoToCamp_C_ValidateGameAction::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");

// Function BP_GameAction_GoToCamp.BP_GameAction_GoToCamp_C.GetInstanceClass
// 0x0008 (0x0008 - 0x0000)
struct BP_GameAction_GoToCamp_C_GetInstanceClass final
{
public:
	TSubclassOf<class UGameActionInstance>        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(BP_GameAction_GoToCamp_C_GetInstanceClass) == 0x000008, "Wrong alignment on BP_GameAction_GoToCamp_C_GetInstanceClass");
static_assert(sizeof(BP_GameAction_GoToCamp_C_GetInstanceClass) == 0x000008, "Wrong size on BP_GameAction_GoToCamp_C_GetInstanceClass");
static_assert(offsetof(BP_GameAction_GoToCamp_C_GetInstanceClass, ReturnValue) == 0x000000, "Member 'BP_GameAction_GoToCamp_C_GetInstanceClass::ReturnValue' has a wrong offset!");

}

