#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GameActionInstance_MultiGameAction

#include "Basic.hpp"

#include "SandFall_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_GameActionInstance_MultiGameAction.BP_GameActionInstance_MultiGameAction_C
// 0x0028 (0x0068 - 0x0040)
class UBP_GameActionInstance_MultiGameAction_C final : public UGameActionInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0040(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	int32                                         GameActionExecutedCount;                           // 0x0048(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UGameActionInstance*>            GameActionInstances;                               // 0x0050(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          ShouldTriggerAutoSave;                             // 0x0060(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteGameAction(const class APlayerController* Controller);
	void ExecuteUbergraph_BP_GameActionInstance_MultiGameAction(int32 EntryPoint);
	void OnGameActionExecutionFinished(class UGameActionInstance* GameActionInstance);

	class FString GetDebugString() const;
	bool ShouldTriggerAutoSaveAfterExecution() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_GameActionInstance_MultiGameAction_C">();
	}
	static class UBP_GameActionInstance_MultiGameAction_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_GameActionInstance_MultiGameAction_C>();
	}
};
static_assert(alignof(UBP_GameActionInstance_MultiGameAction_C) == 0x000008, "Wrong alignment on UBP_GameActionInstance_MultiGameAction_C");
static_assert(sizeof(UBP_GameActionInstance_MultiGameAction_C) == 0x000068, "Wrong size on UBP_GameActionInstance_MultiGameAction_C");
static_assert(offsetof(UBP_GameActionInstance_MultiGameAction_C, UberGraphFrame) == 0x000040, "Member 'UBP_GameActionInstance_MultiGameAction_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_GameActionInstance_MultiGameAction_C, GameActionExecutedCount) == 0x000048, "Member 'UBP_GameActionInstance_MultiGameAction_C::GameActionExecutedCount' has a wrong offset!");
static_assert(offsetof(UBP_GameActionInstance_MultiGameAction_C, GameActionInstances) == 0x000050, "Member 'UBP_GameActionInstance_MultiGameAction_C::GameActionInstances' has a wrong offset!");
static_assert(offsetof(UBP_GameActionInstance_MultiGameAction_C, ShouldTriggerAutoSave) == 0x000060, "Member 'UBP_GameActionInstance_MultiGameAction_C::ShouldTriggerAutoSave' has a wrong offset!");

}

