#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GroupInstance_UniqueMechanic_Stains

#include "Basic.hpp"

#include "BP_GroupInstance_Skill_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_GroupInstance_UniqueMechanic_Stains.BP_GroupInstance_UniqueMechanic_Stains_C
// 0x0008 (0x0040 - 0x0038)
class UBP_GroupInstance_UniqueMechanic_Stains_C final : public UBP_GroupInstance_Skill_Base_C
{
public:
	bool                                          ProducesStains;                                    // 0x0038(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          ConsumesStains;                                    // 0x0039(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          OnlyExotic;                                        // 0x003A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          UnsetOnly;                                         // 0x003B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void DoesSkillMatch(class UBP_DataAsset_Skill_C* SkillData, bool* MatchesGroup);
	class FText GetGroupDisplayName();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_GroupInstance_UniqueMechanic_Stains_C">();
	}
	static class UBP_GroupInstance_UniqueMechanic_Stains_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_GroupInstance_UniqueMechanic_Stains_C>();
	}
};
static_assert(alignof(UBP_GroupInstance_UniqueMechanic_Stains_C) == 0x000008, "Wrong alignment on UBP_GroupInstance_UniqueMechanic_Stains_C");
static_assert(sizeof(UBP_GroupInstance_UniqueMechanic_Stains_C) == 0x000040, "Wrong size on UBP_GroupInstance_UniqueMechanic_Stains_C");
static_assert(offsetof(UBP_GroupInstance_UniqueMechanic_Stains_C, ProducesStains) == 0x000038, "Member 'UBP_GroupInstance_UniqueMechanic_Stains_C::ProducesStains' has a wrong offset!");
static_assert(offsetof(UBP_GroupInstance_UniqueMechanic_Stains_C, ConsumesStains) == 0x000039, "Member 'UBP_GroupInstance_UniqueMechanic_Stains_C::ConsumesStains' has a wrong offset!");
static_assert(offsetof(UBP_GroupInstance_UniqueMechanic_Stains_C, OnlyExotic) == 0x00003A, "Member 'UBP_GroupInstance_UniqueMechanic_Stains_C::OnlyExotic' has a wrong offset!");
static_assert(offsetof(UBP_GroupInstance_UniqueMechanic_Stains_C, UnsetOnly) == 0x00003B, "Member 'UBP_GroupInstance_UniqueMechanic_Stains_C::UnsetOnly' has a wrong offset!");

}

