#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GameActionInstance_GoToCamp

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_GameActionInstance_GoToCamp.BP_GameActionInstance_GoToCamp_C.GetLevelParametersAfterCamp
// 0x0020 (0x0020 - 0x0000)
struct BP_GameActionInstance_GoToCamp_C_GetLevelParametersAfterCamp final
{
public:
	class FName                                   LevelDestinationName;                              // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           SpawnPointTag;                                     // 0x0008(0x0008)(Parm, OutParm, NoDestructor, HasGetValueTypeHash)
	class UBP_GameAction_GoToCamp_C*              K2Node_DynamicCast_AsGo_To_Camp;                   // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GameActionInstance_GoToCamp_C_GetLevelParametersAfterCamp) == 0x000008, "Wrong alignment on BP_GameActionInstance_GoToCamp_C_GetLevelParametersAfterCamp");
static_assert(sizeof(BP_GameActionInstance_GoToCamp_C_GetLevelParametersAfterCamp) == 0x000020, "Wrong size on BP_GameActionInstance_GoToCamp_C_GetLevelParametersAfterCamp");
static_assert(offsetof(BP_GameActionInstance_GoToCamp_C_GetLevelParametersAfterCamp, LevelDestinationName) == 0x000000, "Member 'BP_GameActionInstance_GoToCamp_C_GetLevelParametersAfterCamp::LevelDestinationName' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_GoToCamp_C_GetLevelParametersAfterCamp, SpawnPointTag) == 0x000008, "Member 'BP_GameActionInstance_GoToCamp_C_GetLevelParametersAfterCamp::SpawnPointTag' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_GoToCamp_C_GetLevelParametersAfterCamp, K2Node_DynamicCast_AsGo_To_Camp) == 0x000010, "Member 'BP_GameActionInstance_GoToCamp_C_GetLevelParametersAfterCamp::K2Node_DynamicCast_AsGo_To_Camp' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_GoToCamp_C_GetLevelParametersAfterCamp, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_GameActionInstance_GoToCamp_C_GetLevelParametersAfterCamp::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BP_GameActionInstance_GoToCamp.BP_GameActionInstance_GoToCamp_C.ExecuteUbergraph_BP_GameActionInstance_GoToCamp
// 0x0028 (0x0028 - 0x0000)
struct BP_GameActionInstance_GoToCamp_C_ExecuteUbergraph_BP_GameActionInstance_GoToCamp final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetLevelParametersAfterCamp_LevelDestinationName; // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_GetLevelParametersAfterCamp_SpawnPointTag; // 0x000C(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_jRPG_GI_Custom_C*                   CallFunc_GetCustomGI_ReturnValue;                  // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class APlayerController*                K2Node_Event_Controller;                           // 0x0020(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GameActionInstance_GoToCamp_C_ExecuteUbergraph_BP_GameActionInstance_GoToCamp) == 0x000008, "Wrong alignment on BP_GameActionInstance_GoToCamp_C_ExecuteUbergraph_BP_GameActionInstance_GoToCamp");
static_assert(sizeof(BP_GameActionInstance_GoToCamp_C_ExecuteUbergraph_BP_GameActionInstance_GoToCamp) == 0x000028, "Wrong size on BP_GameActionInstance_GoToCamp_C_ExecuteUbergraph_BP_GameActionInstance_GoToCamp");
static_assert(offsetof(BP_GameActionInstance_GoToCamp_C_ExecuteUbergraph_BP_GameActionInstance_GoToCamp, EntryPoint) == 0x000000, "Member 'BP_GameActionInstance_GoToCamp_C_ExecuteUbergraph_BP_GameActionInstance_GoToCamp::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_GoToCamp_C_ExecuteUbergraph_BP_GameActionInstance_GoToCamp, CallFunc_GetLevelParametersAfterCamp_LevelDestinationName) == 0x000004, "Member 'BP_GameActionInstance_GoToCamp_C_ExecuteUbergraph_BP_GameActionInstance_GoToCamp::CallFunc_GetLevelParametersAfterCamp_LevelDestinationName' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_GoToCamp_C_ExecuteUbergraph_BP_GameActionInstance_GoToCamp, CallFunc_GetLevelParametersAfterCamp_SpawnPointTag) == 0x00000C, "Member 'BP_GameActionInstance_GoToCamp_C_ExecuteUbergraph_BP_GameActionInstance_GoToCamp::CallFunc_GetLevelParametersAfterCamp_SpawnPointTag' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_GoToCamp_C_ExecuteUbergraph_BP_GameActionInstance_GoToCamp, CallFunc_GetCustomGI_ReturnValue) == 0x000018, "Member 'BP_GameActionInstance_GoToCamp_C_ExecuteUbergraph_BP_GameActionInstance_GoToCamp::CallFunc_GetCustomGI_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_GoToCamp_C_ExecuteUbergraph_BP_GameActionInstance_GoToCamp, K2Node_Event_Controller) == 0x000020, "Member 'BP_GameActionInstance_GoToCamp_C_ExecuteUbergraph_BP_GameActionInstance_GoToCamp::K2Node_Event_Controller' has a wrong offset!");

// Function BP_GameActionInstance_GoToCamp.BP_GameActionInstance_GoToCamp_C.ExecuteGameAction
// 0x0008 (0x0008 - 0x0000)
struct BP_GameActionInstance_GoToCamp_C_ExecuteGameAction final
{
public:
	const class APlayerController*                Controller;                                        // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GameActionInstance_GoToCamp_C_ExecuteGameAction) == 0x000008, "Wrong alignment on BP_GameActionInstance_GoToCamp_C_ExecuteGameAction");
static_assert(sizeof(BP_GameActionInstance_GoToCamp_C_ExecuteGameAction) == 0x000008, "Wrong size on BP_GameActionInstance_GoToCamp_C_ExecuteGameAction");
static_assert(offsetof(BP_GameActionInstance_GoToCamp_C_ExecuteGameAction, Controller) == 0x000000, "Member 'BP_GameActionInstance_GoToCamp_C_ExecuteGameAction::Controller' has a wrong offset!");

// Function BP_GameActionInstance_GoToCamp.BP_GameActionInstance_GoToCamp_C.GetDebugString
// 0x0098 (0x0098 - 0x0000)
struct BP_GameActionInstance_GoToCamp_C_GetDebugString final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0020(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0030(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0078(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Format_ReturnValue;                       // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GameActionInstance_GoToCamp_C_GetDebugString) == 0x000008, "Wrong alignment on BP_GameActionInstance_GoToCamp_C_GetDebugString");
static_assert(sizeof(BP_GameActionInstance_GoToCamp_C_GetDebugString) == 0x000098, "Wrong size on BP_GameActionInstance_GoToCamp_C_GetDebugString");
static_assert(offsetof(BP_GameActionInstance_GoToCamp_C_GetDebugString, ReturnValue) == 0x000000, "Member 'BP_GameActionInstance_GoToCamp_C_GetDebugString::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_GoToCamp_C_GetDebugString, CallFunc_GetDisplayName_ReturnValue) == 0x000010, "Member 'BP_GameActionInstance_GoToCamp_C_GetDebugString::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_GoToCamp_C_GetDebugString, CallFunc_Conv_StringToText_ReturnValue) == 0x000020, "Member 'BP_GameActionInstance_GoToCamp_C_GetDebugString::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_GoToCamp_C_GetDebugString, K2Node_MakeStruct_FormatArgumentData) == 0x000030, "Member 'BP_GameActionInstance_GoToCamp_C_GetDebugString::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_GoToCamp_C_GetDebugString, K2Node_MakeArray_Array) == 0x000078, "Member 'BP_GameActionInstance_GoToCamp_C_GetDebugString::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_GoToCamp_C_GetDebugString, CallFunc_Format_ReturnValue) == 0x000088, "Member 'BP_GameActionInstance_GoToCamp_C_GetDebugString::CallFunc_Format_ReturnValue' has a wrong offset!");

}

