#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GameActionInstance_CinematicWithLightingScenario

#include "Basic.hpp"

#include "SandFall_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_GameActionInstance_CinematicWithLightingScenario.BP_GameActionInstance_CinematicWithLightingScenario_C
// 0x0018 (0x0058 - 0x0040)
class UBP_GameActionInstance_CinematicWithLightingScenario_C final : public UGameActionInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0040(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ABP_LightingScenarioReference_C*        LightingScenarioBeforeCinematic;                   // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USF_BlueprintLatentAction*              CinematicLatentAction;                             // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void GetLightingScenarioToActivateAfterCinematic(class ABP_LightingScenarioReference_C** Scenario);
	void ExecuteUbergraph_BP_GameActionInstance_CinematicWithLightingScenario(int32 EntryPoint);
	void ExecuteGameAction(const class APlayerController* Controller);
	void CacheCurrentLightingScenario();
	void ActivateLightingScenarioAfterCinematic();
	void ActivateLightingScenario(class ABP_LightingScenarioReference_C* LigthingScenario);

	void GetParameters(struct FS_TriggerCinematicVariables* CinematicParameters, TSoftObjectPtr<class ABP_LightingScenarioReference_C>* ScenarioReferenceOnEnd) const;
	class FString GetDebugString() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_GameActionInstance_CinematicWithLightingScenario_C">();
	}
	static class UBP_GameActionInstance_CinematicWithLightingScenario_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_GameActionInstance_CinematicWithLightingScenario_C>();
	}
};
static_assert(alignof(UBP_GameActionInstance_CinematicWithLightingScenario_C) == 0x000008, "Wrong alignment on UBP_GameActionInstance_CinematicWithLightingScenario_C");
static_assert(sizeof(UBP_GameActionInstance_CinematicWithLightingScenario_C) == 0x000058, "Wrong size on UBP_GameActionInstance_CinematicWithLightingScenario_C");
static_assert(offsetof(UBP_GameActionInstance_CinematicWithLightingScenario_C, UberGraphFrame) == 0x000040, "Member 'UBP_GameActionInstance_CinematicWithLightingScenario_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_GameActionInstance_CinematicWithLightingScenario_C, LightingScenarioBeforeCinematic) == 0x000048, "Member 'UBP_GameActionInstance_CinematicWithLightingScenario_C::LightingScenarioBeforeCinematic' has a wrong offset!");
static_assert(offsetof(UBP_GameActionInstance_CinematicWithLightingScenario_C, CinematicLatentAction) == 0x000050, "Member 'UBP_GameActionInstance_CinematicWithLightingScenario_C::CinematicLatentAction' has a wrong offset!");

}

