#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GameActionInstance_TriggerBattle

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_GameActionInstance_TriggerBattle.BP_GameActionInstance_TriggerBattle_C.ExecuteGameAction
// 0x0008 (0x0008 - 0x0000)
struct BP_GameActionInstance_TriggerBattle_C_ExecuteGameAction final
{
public:
	const class APlayerController*                Controller;                                        // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GameActionInstance_TriggerBattle_C_ExecuteGameAction) == 0x000008, "Wrong alignment on BP_GameActionInstance_TriggerBattle_C_ExecuteGameAction");
static_assert(sizeof(BP_GameActionInstance_TriggerBattle_C_ExecuteGameAction) == 0x000008, "Wrong size on BP_GameActionInstance_TriggerBattle_C_ExecuteGameAction");
static_assert(offsetof(BP_GameActionInstance_TriggerBattle_C_ExecuteGameAction, Controller) == 0x000000, "Member 'BP_GameActionInstance_TriggerBattle_C_ExecuteGameAction::Controller' has a wrong offset!");

// Function BP_GameActionInstance_TriggerBattle.BP_GameActionInstance_TriggerBattle_C.ExecuteUbergraph_BP_GameActionInstance_TriggerBattle
// 0x0048 (0x0048 - 0x0000)
struct BP_GameActionInstance_TriggerBattle_C_ExecuteUbergraph_BP_GameActionInstance_TriggerBattle final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool Victory)>                 K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAC_jRPG_BattleManager_C*               CallFunc_GetBattleManager_ReturnValue;             // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAC_jRPG_BattleManager_C*               CallFunc_GetBattleManager_ReturnValue_1;           // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Victory;                        // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class APlayerController*                K2Node_Event_Controller;                           // 0x0030(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_GameAction_TriggerBattle_C*         K2Node_DynamicCast_AsStart_Battle;                 // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GameActionInstance_TriggerBattle_C_ExecuteUbergraph_BP_GameActionInstance_TriggerBattle) == 0x000008, "Wrong alignment on BP_GameActionInstance_TriggerBattle_C_ExecuteUbergraph_BP_GameActionInstance_TriggerBattle");
static_assert(sizeof(BP_GameActionInstance_TriggerBattle_C_ExecuteUbergraph_BP_GameActionInstance_TriggerBattle) == 0x000048, "Wrong size on BP_GameActionInstance_TriggerBattle_C_ExecuteUbergraph_BP_GameActionInstance_TriggerBattle");
static_assert(offsetof(BP_GameActionInstance_TriggerBattle_C_ExecuteUbergraph_BP_GameActionInstance_TriggerBattle, EntryPoint) == 0x000000, "Member 'BP_GameActionInstance_TriggerBattle_C_ExecuteUbergraph_BP_GameActionInstance_TriggerBattle::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_TriggerBattle_C_ExecuteUbergraph_BP_GameActionInstance_TriggerBattle, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BP_GameActionInstance_TriggerBattle_C_ExecuteUbergraph_BP_GameActionInstance_TriggerBattle::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_TriggerBattle_C_ExecuteUbergraph_BP_GameActionInstance_TriggerBattle, CallFunc_GetBattleManager_ReturnValue) == 0x000018, "Member 'BP_GameActionInstance_TriggerBattle_C_ExecuteUbergraph_BP_GameActionInstance_TriggerBattle::CallFunc_GetBattleManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_TriggerBattle_C_ExecuteUbergraph_BP_GameActionInstance_TriggerBattle, CallFunc_GetBattleManager_ReturnValue_1) == 0x000020, "Member 'BP_GameActionInstance_TriggerBattle_C_ExecuteUbergraph_BP_GameActionInstance_TriggerBattle::CallFunc_GetBattleManager_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_TriggerBattle_C_ExecuteUbergraph_BP_GameActionInstance_TriggerBattle, K2Node_CustomEvent_Victory) == 0x000028, "Member 'BP_GameActionInstance_TriggerBattle_C_ExecuteUbergraph_BP_GameActionInstance_TriggerBattle::K2Node_CustomEvent_Victory' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_TriggerBattle_C_ExecuteUbergraph_BP_GameActionInstance_TriggerBattle, K2Node_Event_Controller) == 0x000030, "Member 'BP_GameActionInstance_TriggerBattle_C_ExecuteUbergraph_BP_GameActionInstance_TriggerBattle::K2Node_Event_Controller' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_TriggerBattle_C_ExecuteUbergraph_BP_GameActionInstance_TriggerBattle, K2Node_DynamicCast_AsStart_Battle) == 0x000038, "Member 'BP_GameActionInstance_TriggerBattle_C_ExecuteUbergraph_BP_GameActionInstance_TriggerBattle::K2Node_DynamicCast_AsStart_Battle' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_TriggerBattle_C_ExecuteUbergraph_BP_GameActionInstance_TriggerBattle, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'BP_GameActionInstance_TriggerBattle_C_ExecuteUbergraph_BP_GameActionInstance_TriggerBattle::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BP_GameActionInstance_TriggerBattle.BP_GameActionInstance_TriggerBattle_C.OnBattleFinished
// 0x0001 (0x0001 - 0x0000)
struct BP_GameActionInstance_TriggerBattle_C_OnBattleFinished final
{
public:
	bool                                          Victory;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GameActionInstance_TriggerBattle_C_OnBattleFinished) == 0x000001, "Wrong alignment on BP_GameActionInstance_TriggerBattle_C_OnBattleFinished");
static_assert(sizeof(BP_GameActionInstance_TriggerBattle_C_OnBattleFinished) == 0x000001, "Wrong size on BP_GameActionInstance_TriggerBattle_C_OnBattleFinished");
static_assert(offsetof(BP_GameActionInstance_TriggerBattle_C_OnBattleFinished, Victory) == 0x000000, "Member 'BP_GameActionInstance_TriggerBattle_C_OnBattleFinished::Victory' has a wrong offset!");

// Function BP_GameActionInstance_TriggerBattle.BP_GameActionInstance_TriggerBattle_C.GetDebugString
// 0x0130 (0x0130 - 0x0000)
struct BP_GameActionInstance_TriggerBattle_C_GetDebugString final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
	class FString                                 CallFunc_PadString_Result;                         // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UBP_GameAction_TriggerBattle_C*         K2Node_DynamicCast_AsStart_Battle;                 // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0040(0x0010)()
	class FString                                 CallFunc_GetDisplayName_ReturnValue_1;             // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0060(0x0048)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x00A8(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00B8(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0100(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Format_ReturnValue;                       // 0x0110(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0120(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GameActionInstance_TriggerBattle_C_GetDebugString) == 0x000008, "Wrong alignment on BP_GameActionInstance_TriggerBattle_C_GetDebugString");
static_assert(sizeof(BP_GameActionInstance_TriggerBattle_C_GetDebugString) == 0x000130, "Wrong size on BP_GameActionInstance_TriggerBattle_C_GetDebugString");
static_assert(offsetof(BP_GameActionInstance_TriggerBattle_C_GetDebugString, ReturnValue) == 0x000000, "Member 'BP_GameActionInstance_TriggerBattle_C_GetDebugString::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_TriggerBattle_C_GetDebugString, CallFunc_PadString_Result) == 0x000010, "Member 'BP_GameActionInstance_TriggerBattle_C_GetDebugString::CallFunc_PadString_Result' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_TriggerBattle_C_GetDebugString, CallFunc_GetDisplayName_ReturnValue) == 0x000020, "Member 'BP_GameActionInstance_TriggerBattle_C_GetDebugString::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_TriggerBattle_C_GetDebugString, K2Node_DynamicCast_AsStart_Battle) == 0x000030, "Member 'BP_GameActionInstance_TriggerBattle_C_GetDebugString::K2Node_DynamicCast_AsStart_Battle' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_TriggerBattle_C_GetDebugString, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'BP_GameActionInstance_TriggerBattle_C_GetDebugString::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_TriggerBattle_C_GetDebugString, CallFunc_Conv_StringToText_ReturnValue) == 0x000040, "Member 'BP_GameActionInstance_TriggerBattle_C_GetDebugString::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_TriggerBattle_C_GetDebugString, CallFunc_GetDisplayName_ReturnValue_1) == 0x000050, "Member 'BP_GameActionInstance_TriggerBattle_C_GetDebugString::CallFunc_GetDisplayName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_TriggerBattle_C_GetDebugString, K2Node_MakeStruct_FormatArgumentData) == 0x000060, "Member 'BP_GameActionInstance_TriggerBattle_C_GetDebugString::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_TriggerBattle_C_GetDebugString, CallFunc_Conv_StringToText_ReturnValue_1) == 0x0000A8, "Member 'BP_GameActionInstance_TriggerBattle_C_GetDebugString::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_TriggerBattle_C_GetDebugString, K2Node_MakeStruct_FormatArgumentData_1) == 0x0000B8, "Member 'BP_GameActionInstance_TriggerBattle_C_GetDebugString::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_TriggerBattle_C_GetDebugString, K2Node_MakeArray_Array) == 0x000100, "Member 'BP_GameActionInstance_TriggerBattle_C_GetDebugString::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_TriggerBattle_C_GetDebugString, CallFunc_Format_ReturnValue) == 0x000110, "Member 'BP_GameActionInstance_TriggerBattle_C_GetDebugString::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_TriggerBattle_C_GetDebugString, CallFunc_Concat_StrStr_ReturnValue) == 0x000120, "Member 'BP_GameActionInstance_TriggerBattle_C_GetDebugString::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");

}

