#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GradientGaugeSystem

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EGradientChangeReason_structs.hpp"
#include "EAPChangeReason_structs.hpp"


namespace SDK::Params
{

// Function BP_GradientGaugeSystem.BP_GradientGaugeSystem_C.ApplyGaugeChangeFromEvent
// 0x00A0 (0x00A0 - 0x0000)
struct BP_GradientGaugeSystem_C_ApplyGaugeChangeFromEvent final
{
public:
	class UBP_GradientGaugeChangeEvent_C*         Event;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetChangeAmount_ChangeAmount;             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGradientChangeReason                         CallFunc_GetReason_ReturnValue;                    // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0028(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0038(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0080(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Format_ReturnValue;                       // 0x0090(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GradientGaugeSystem_C_ApplyGaugeChangeFromEvent) == 0x000008, "Wrong alignment on BP_GradientGaugeSystem_C_ApplyGaugeChangeFromEvent");
static_assert(sizeof(BP_GradientGaugeSystem_C_ApplyGaugeChangeFromEvent) == 0x0000A0, "Wrong size on BP_GradientGaugeSystem_C_ApplyGaugeChangeFromEvent");
static_assert(offsetof(BP_GradientGaugeSystem_C_ApplyGaugeChangeFromEvent, Event) == 0x000000, "Member 'BP_GradientGaugeSystem_C_ApplyGaugeChangeFromEvent::Event' has a wrong offset!");
static_assert(offsetof(BP_GradientGaugeSystem_C_ApplyGaugeChangeFromEvent, CallFunc_GetChangeAmount_ChangeAmount) == 0x000008, "Member 'BP_GradientGaugeSystem_C_ApplyGaugeChangeFromEvent::CallFunc_GetChangeAmount_ChangeAmount' has a wrong offset!");
static_assert(offsetof(BP_GradientGaugeSystem_C_ApplyGaugeChangeFromEvent, CallFunc_GetReason_ReturnValue) == 0x000010, "Member 'BP_GradientGaugeSystem_C_ApplyGaugeChangeFromEvent::CallFunc_GetReason_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GradientGaugeSystem_C_ApplyGaugeChangeFromEvent, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x000018, "Member 'BP_GradientGaugeSystem_C_ApplyGaugeChangeFromEvent::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GradientGaugeSystem_C_ApplyGaugeChangeFromEvent, CallFunc_Conv_StringToText_ReturnValue) == 0x000028, "Member 'BP_GradientGaugeSystem_C_ApplyGaugeChangeFromEvent::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GradientGaugeSystem_C_ApplyGaugeChangeFromEvent, K2Node_MakeStruct_FormatArgumentData) == 0x000038, "Member 'BP_GradientGaugeSystem_C_ApplyGaugeChangeFromEvent::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_GradientGaugeSystem_C_ApplyGaugeChangeFromEvent, K2Node_MakeArray_Array) == 0x000080, "Member 'BP_GradientGaugeSystem_C_ApplyGaugeChangeFromEvent::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_GradientGaugeSystem_C_ApplyGaugeChangeFromEvent, CallFunc_Format_ReturnValue) == 0x000090, "Member 'BP_GradientGaugeSystem_C_ApplyGaugeChangeFromEvent::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function BP_GradientGaugeSystem.BP_GradientGaugeSystem_C.CanAffordCharges
// 0x0008 (0x0008 - 0x0000)
struct BP_GradientGaugeSystem_C_CanAffordCharges final
{
public:
	int32                                         Amount;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GradientGaugeSystem_C_CanAffordCharges) == 0x000004, "Wrong alignment on BP_GradientGaugeSystem_C_CanAffordCharges");
static_assert(sizeof(BP_GradientGaugeSystem_C_CanAffordCharges) == 0x000008, "Wrong size on BP_GradientGaugeSystem_C_CanAffordCharges");
static_assert(offsetof(BP_GradientGaugeSystem_C_CanAffordCharges, Amount) == 0x000000, "Member 'BP_GradientGaugeSystem_C_CanAffordCharges::Amount' has a wrong offset!");
static_assert(offsetof(BP_GradientGaugeSystem_C_CanAffordCharges, ReturnValue) == 0x000004, "Member 'BP_GradientGaugeSystem_C_CanAffordCharges::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GradientGaugeSystem_C_CanAffordCharges, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000005, "Member 'BP_GradientGaugeSystem_C_CanAffordCharges::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");

// Function BP_GradientGaugeSystem.BP_GradientGaugeSystem_C.ChangeGradientGauge
// 0x01E8 (0x01E8 - 0x0000)
struct BP_GradientGaugeSystem_C_ChangeGradientGauge final
{
public:
	double                                        Delta;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Reason;                                            // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	int32                                         local_newAvailableCharges;                         // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         local_previousCharges;                             // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        local_previousProgress;                            // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         local_createdCharges;                              // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        local_newProgressValue;                            // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0038(0x0010)()
	bool                                          CallFunc_IsEmpty_ReturnValue;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0050(0x0048)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue;            // 0x0098(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00A8(0x0048)(HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPackagedForDistribution_ReturnValue;    // 0x00F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00F5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F6[0x2];                                       // 0x00F6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0104(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_105[0x3];                                      // 0x0105(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_119[0x3];                                      // 0x0119(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0128(0x0048)(HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_171[0x7];                                      // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x0178(0x0048)(HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x01C8(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Format_ReturnValue;                       // 0x01D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GradientGaugeSystem_C_ChangeGradientGauge) == 0x000008, "Wrong alignment on BP_GradientGaugeSystem_C_ChangeGradientGauge");
static_assert(sizeof(BP_GradientGaugeSystem_C_ChangeGradientGauge) == 0x0001E8, "Wrong size on BP_GradientGaugeSystem_C_ChangeGradientGauge");
static_assert(offsetof(BP_GradientGaugeSystem_C_ChangeGradientGauge, Delta) == 0x000000, "Member 'BP_GradientGaugeSystem_C_ChangeGradientGauge::Delta' has a wrong offset!");
static_assert(offsetof(BP_GradientGaugeSystem_C_ChangeGradientGauge, Reason) == 0x000008, "Member 'BP_GradientGaugeSystem_C_ChangeGradientGauge::Reason' has a wrong offset!");
static_assert(offsetof(BP_GradientGaugeSystem_C_ChangeGradientGauge, local_newAvailableCharges) == 0x000018, "Member 'BP_GradientGaugeSystem_C_ChangeGradientGauge::local_newAvailableCharges' has a wrong offset!");
static_assert(offsetof(BP_GradientGaugeSystem_C_ChangeGradientGauge, local_previousCharges) == 0x00001C, "Member 'BP_GradientGaugeSystem_C_ChangeGradientGauge::local_previousCharges' has a wrong offset!");
static_assert(offsetof(BP_GradientGaugeSystem_C_ChangeGradientGauge, local_previousProgress) == 0x000020, "Member 'BP_GradientGaugeSystem_C_ChangeGradientGauge::local_previousProgress' has a wrong offset!");
static_assert(offsetof(BP_GradientGaugeSystem_C_ChangeGradientGauge, local_createdCharges) == 0x000028, "Member 'BP_GradientGaugeSystem_C_ChangeGradientGauge::local_createdCharges' has a wrong offset!");
static_assert(offsetof(BP_GradientGaugeSystem_C_ChangeGradientGauge, local_newProgressValue) == 0x000030, "Member 'BP_GradientGaugeSystem_C_ChangeGradientGauge::local_newProgressValue' has a wrong offset!");
static_assert(offsetof(BP_GradientGaugeSystem_C_ChangeGradientGauge, CallFunc_Conv_StringToText_ReturnValue) == 0x000038, "Member 'BP_GradientGaugeSystem_C_ChangeGradientGauge::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GradientGaugeSystem_C_ChangeGradientGauge, CallFunc_IsEmpty_ReturnValue) == 0x000048, "Member 'BP_GradientGaugeSystem_C_ChangeGradientGauge::CallFunc_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GradientGaugeSystem_C_ChangeGradientGauge, K2Node_MakeStruct_FormatArgumentData) == 0x000050, "Member 'BP_GradientGaugeSystem_C_ChangeGradientGauge::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_GradientGaugeSystem_C_ChangeGradientGauge, CallFunc_Conv_DoubleToText_ReturnValue) == 0x000098, "Member 'BP_GradientGaugeSystem_C_ChangeGradientGauge::CallFunc_Conv_DoubleToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GradientGaugeSystem_C_ChangeGradientGauge, K2Node_MakeStruct_FormatArgumentData_1) == 0x0000A8, "Member 'BP_GradientGaugeSystem_C_ChangeGradientGauge::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BP_GradientGaugeSystem_C_ChangeGradientGauge, Temp_int_Variable) == 0x0000F0, "Member 'BP_GradientGaugeSystem_C_ChangeGradientGauge::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_GradientGaugeSystem_C_ChangeGradientGauge, CallFunc_IsPackagedForDistribution_ReturnValue) == 0x0000F4, "Member 'BP_GradientGaugeSystem_C_ChangeGradientGauge::CallFunc_IsPackagedForDistribution_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GradientGaugeSystem_C_ChangeGradientGauge, CallFunc_Not_PreBool_ReturnValue) == 0x0000F5, "Member 'BP_GradientGaugeSystem_C_ChangeGradientGauge::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GradientGaugeSystem_C_ChangeGradientGauge, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x0000F8, "Member 'BP_GradientGaugeSystem_C_ChangeGradientGauge::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GradientGaugeSystem_C_ChangeGradientGauge, CallFunc_Add_IntInt_ReturnValue) == 0x000100, "Member 'BP_GradientGaugeSystem_C_ChangeGradientGauge::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GradientGaugeSystem_C_ChangeGradientGauge, CallFunc_Less_IntInt_ReturnValue) == 0x000104, "Member 'BP_GradientGaugeSystem_C_ChangeGradientGauge::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GradientGaugeSystem_C_ChangeGradientGauge, CallFunc_FClamp_ReturnValue) == 0x000108, "Member 'BP_GradientGaugeSystem_C_ChangeGradientGauge::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GradientGaugeSystem_C_ChangeGradientGauge, CallFunc_Add_IntInt_ReturnValue_1) == 0x000110, "Member 'BP_GradientGaugeSystem_C_ChangeGradientGauge::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GradientGaugeSystem_C_ChangeGradientGauge, CallFunc_Add_IntInt_ReturnValue_2) == 0x000114, "Member 'BP_GradientGaugeSystem_C_ChangeGradientGauge::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_GradientGaugeSystem_C_ChangeGradientGauge, CallFunc_Less_IntInt_ReturnValue_1) == 0x000118, "Member 'BP_GradientGaugeSystem_C_ChangeGradientGauge::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GradientGaugeSystem_C_ChangeGradientGauge, CallFunc_Add_IntInt_ReturnValue_3) == 0x00011C, "Member 'BP_GradientGaugeSystem_C_ChangeGradientGauge::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_GradientGaugeSystem_C_ChangeGradientGauge, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x000120, "Member 'BP_GradientGaugeSystem_C_ChangeGradientGauge::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GradientGaugeSystem_C_ChangeGradientGauge, K2Node_MakeStruct_FormatArgumentData_2) == 0x000128, "Member 'BP_GradientGaugeSystem_C_ChangeGradientGauge::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(BP_GradientGaugeSystem_C_ChangeGradientGauge, CallFunc_BooleanAND_ReturnValue) == 0x000170, "Member 'BP_GradientGaugeSystem_C_ChangeGradientGauge::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GradientGaugeSystem_C_ChangeGradientGauge, K2Node_MakeStruct_FormatArgumentData_3) == 0x000178, "Member 'BP_GradientGaugeSystem_C_ChangeGradientGauge::K2Node_MakeStruct_FormatArgumentData_3' has a wrong offset!");
static_assert(offsetof(BP_GradientGaugeSystem_C_ChangeGradientGauge, CallFunc_Add_DoubleDouble_ReturnValue) == 0x0001C0, "Member 'BP_GradientGaugeSystem_C_ChangeGradientGauge::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GradientGaugeSystem_C_ChangeGradientGauge, K2Node_MakeArray_Array) == 0x0001C8, "Member 'BP_GradientGaugeSystem_C_ChangeGradientGauge::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_GradientGaugeSystem_C_ChangeGradientGauge, CallFunc_Format_ReturnValue) == 0x0001D8, "Member 'BP_GradientGaugeSystem_C_ChangeGradientGauge::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function BP_GradientGaugeSystem.BP_GradientGaugeSystem_C.ConsumeCharge
// 0x0028 (0x0028 - 0x0000)
struct BP_GradientGaugeSystem_C_ConsumeCharge final
{
public:
	int32                                         Amount;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        local_newProgress;                                 // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_AchievementManager_C*               CallFunc_GetAchievementManager_ReturnValue;        // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanAffordCharges_ReturnValue;             // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B[0x1];                                       // 0x001B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GradientGaugeSystem_C_ConsumeCharge) == 0x000008, "Wrong alignment on BP_GradientGaugeSystem_C_ConsumeCharge");
static_assert(sizeof(BP_GradientGaugeSystem_C_ConsumeCharge) == 0x000028, "Wrong size on BP_GradientGaugeSystem_C_ConsumeCharge");
static_assert(offsetof(BP_GradientGaugeSystem_C_ConsumeCharge, Amount) == 0x000000, "Member 'BP_GradientGaugeSystem_C_ConsumeCharge::Amount' has a wrong offset!");
static_assert(offsetof(BP_GradientGaugeSystem_C_ConsumeCharge, local_newProgress) == 0x000008, "Member 'BP_GradientGaugeSystem_C_ConsumeCharge::local_newProgress' has a wrong offset!");
static_assert(offsetof(BP_GradientGaugeSystem_C_ConsumeCharge, CallFunc_GetAchievementManager_ReturnValue) == 0x000010, "Member 'BP_GradientGaugeSystem_C_ConsumeCharge::CallFunc_GetAchievementManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GradientGaugeSystem_C_ConsumeCharge, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000018, "Member 'BP_GradientGaugeSystem_C_ConsumeCharge::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GradientGaugeSystem_C_ConsumeCharge, CallFunc_CanAffordCharges_ReturnValue) == 0x000019, "Member 'BP_GradientGaugeSystem_C_ConsumeCharge::CallFunc_CanAffordCharges_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GradientGaugeSystem_C_ConsumeCharge, CallFunc_Not_PreBool_ReturnValue) == 0x00001A, "Member 'BP_GradientGaugeSystem_C_ConsumeCharge::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GradientGaugeSystem_C_ConsumeCharge, CallFunc_Subtract_IntInt_ReturnValue) == 0x00001C, "Member 'BP_GradientGaugeSystem_C_ConsumeCharge::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GradientGaugeSystem_C_ConsumeCharge, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x000020, "Member 'BP_GradientGaugeSystem_C_ConsumeCharge::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GradientGaugeSystem_C_ConsumeCharge, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000021, "Member 'BP_GradientGaugeSystem_C_ConsumeCharge::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");

// Function BP_GradientGaugeSystem.BP_GradientGaugeSystem_C.GetAvailableCharges
// 0x0004 (0x0004 - 0x0000)
struct BP_GradientGaugeSystem_C_GetAvailableCharges final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GradientGaugeSystem_C_GetAvailableCharges) == 0x000004, "Wrong alignment on BP_GradientGaugeSystem_C_GetAvailableCharges");
static_assert(sizeof(BP_GradientGaugeSystem_C_GetAvailableCharges) == 0x000004, "Wrong size on BP_GradientGaugeSystem_C_GetAvailableCharges");
static_assert(offsetof(BP_GradientGaugeSystem_C_GetAvailableCharges, ReturnValue) == 0x000000, "Member 'BP_GradientGaugeSystem_C_GetAvailableCharges::ReturnValue' has a wrong offset!");

// Function BP_GradientGaugeSystem.BP_GradientGaugeSystem_C.GetCurrentProgress
// 0x0008 (0x0008 - 0x0000)
struct BP_GradientGaugeSystem_C_GetCurrentProgress final
{
public:
	double                                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GradientGaugeSystem_C_GetCurrentProgress) == 0x000008, "Wrong alignment on BP_GradientGaugeSystem_C_GetCurrentProgress");
static_assert(sizeof(BP_GradientGaugeSystem_C_GetCurrentProgress) == 0x000008, "Wrong size on BP_GradientGaugeSystem_C_GetCurrentProgress");
static_assert(offsetof(BP_GradientGaugeSystem_C_GetCurrentProgress, ReturnValue) == 0x000000, "Member 'BP_GradientGaugeSystem_C_GetCurrentProgress::ReturnValue' has a wrong offset!");

// Function BP_GradientGaugeSystem.BP_GradientGaugeSystem_C.OnCharacterAPChangedEvent
// 0x0088 (0x0088 - 0x0000)
struct BP_GradientGaugeSystem_C_OnCharacterAPChangedEvent final
{
public:
	class UBP_BattleEvent_APChange_C*             APChange;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_GradientGaugeChangeEvent_C*         local_changeEvent;                                 // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EAPChangeReason                               CallFunc_GetChangeReason_ReturnValue;              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLoss_ReturnValue;                       // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13[0x1];                                       // 0x0013(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetDelta_ReturnValue;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Abs_Int_ReturnValue;                      // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_jRPG_Character_Battle_Base_C*> Temp_wildcard_Variable;                          // 0x0038(0x0010)(ReferenceParm)
	class UBP_GradientGaugeChangeEvent_C*         CallFunc_SpawnObject_ReturnValue;                  // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_jRPG_Character_Battle_Base_C*       CallFunc_Array_Get_Item;                           // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAC_jRPG_BattleManager_C*               CallFunc_GetBattleManager_ReturnValue;             // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_jRPG_Character_Battle_Base_C*> CallFunc_GetAllCharacters_AllCharacters;         // 0x0068(0x0010)(ReferenceParm)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_B_ImplicitCast;     // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GradientGaugeSystem_C_OnCharacterAPChangedEvent) == 0x000008, "Wrong alignment on BP_GradientGaugeSystem_C_OnCharacterAPChangedEvent");
static_assert(sizeof(BP_GradientGaugeSystem_C_OnCharacterAPChangedEvent) == 0x000088, "Wrong size on BP_GradientGaugeSystem_C_OnCharacterAPChangedEvent");
static_assert(offsetof(BP_GradientGaugeSystem_C_OnCharacterAPChangedEvent, APChange) == 0x000000, "Member 'BP_GradientGaugeSystem_C_OnCharacterAPChangedEvent::APChange' has a wrong offset!");
static_assert(offsetof(BP_GradientGaugeSystem_C_OnCharacterAPChangedEvent, local_changeEvent) == 0x000008, "Member 'BP_GradientGaugeSystem_C_OnCharacterAPChangedEvent::local_changeEvent' has a wrong offset!");
static_assert(offsetof(BP_GradientGaugeSystem_C_OnCharacterAPChangedEvent, CallFunc_GetChangeReason_ReturnValue) == 0x000010, "Member 'BP_GradientGaugeSystem_C_OnCharacterAPChangedEvent::CallFunc_GetChangeReason_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GradientGaugeSystem_C_OnCharacterAPChangedEvent, CallFunc_IsLoss_ReturnValue) == 0x000011, "Member 'BP_GradientGaugeSystem_C_OnCharacterAPChangedEvent::CallFunc_IsLoss_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GradientGaugeSystem_C_OnCharacterAPChangedEvent, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000012, "Member 'BP_GradientGaugeSystem_C_OnCharacterAPChangedEvent::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GradientGaugeSystem_C_OnCharacterAPChangedEvent, CallFunc_GetDelta_ReturnValue) == 0x000014, "Member 'BP_GradientGaugeSystem_C_OnCharacterAPChangedEvent::CallFunc_GetDelta_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GradientGaugeSystem_C_OnCharacterAPChangedEvent, CallFunc_BooleanAND_ReturnValue) == 0x000018, "Member 'BP_GradientGaugeSystem_C_OnCharacterAPChangedEvent::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GradientGaugeSystem_C_OnCharacterAPChangedEvent, CallFunc_Abs_Int_ReturnValue) == 0x00001C, "Member 'BP_GradientGaugeSystem_C_OnCharacterAPChangedEvent::CallFunc_Abs_Int_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GradientGaugeSystem_C_OnCharacterAPChangedEvent, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000020, "Member 'BP_GradientGaugeSystem_C_OnCharacterAPChangedEvent::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GradientGaugeSystem_C_OnCharacterAPChangedEvent, Temp_int_Array_Index_Variable) == 0x000028, "Member 'BP_GradientGaugeSystem_C_OnCharacterAPChangedEvent::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_GradientGaugeSystem_C_OnCharacterAPChangedEvent, Temp_int_Loop_Counter_Variable) == 0x00002C, "Member 'BP_GradientGaugeSystem_C_OnCharacterAPChangedEvent::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_GradientGaugeSystem_C_OnCharacterAPChangedEvent, CallFunc_Add_IntInt_ReturnValue) == 0x000030, "Member 'BP_GradientGaugeSystem_C_OnCharacterAPChangedEvent::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GradientGaugeSystem_C_OnCharacterAPChangedEvent, Temp_wildcard_Variable) == 0x000038, "Member 'BP_GradientGaugeSystem_C_OnCharacterAPChangedEvent::Temp_wildcard_Variable' has a wrong offset!");
static_assert(offsetof(BP_GradientGaugeSystem_C_OnCharacterAPChangedEvent, CallFunc_SpawnObject_ReturnValue) == 0x000048, "Member 'BP_GradientGaugeSystem_C_OnCharacterAPChangedEvent::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GradientGaugeSystem_C_OnCharacterAPChangedEvent, CallFunc_Array_Get_Item) == 0x000050, "Member 'BP_GradientGaugeSystem_C_OnCharacterAPChangedEvent::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_GradientGaugeSystem_C_OnCharacterAPChangedEvent, CallFunc_Array_Length_ReturnValue) == 0x000058, "Member 'BP_GradientGaugeSystem_C_OnCharacterAPChangedEvent::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GradientGaugeSystem_C_OnCharacterAPChangedEvent, CallFunc_Less_IntInt_ReturnValue) == 0x00005C, "Member 'BP_GradientGaugeSystem_C_OnCharacterAPChangedEvent::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GradientGaugeSystem_C_OnCharacterAPChangedEvent, CallFunc_GetBattleManager_ReturnValue) == 0x000060, "Member 'BP_GradientGaugeSystem_C_OnCharacterAPChangedEvent::CallFunc_GetBattleManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GradientGaugeSystem_C_OnCharacterAPChangedEvent, CallFunc_GetAllCharacters_AllCharacters) == 0x000068, "Member 'BP_GradientGaugeSystem_C_OnCharacterAPChangedEvent::CallFunc_GetAllCharacters_AllCharacters' has a wrong offset!");
static_assert(offsetof(BP_GradientGaugeSystem_C_OnCharacterAPChangedEvent, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000078, "Member 'BP_GradientGaugeSystem_C_OnCharacterAPChangedEvent::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GradientGaugeSystem_C_OnCharacterAPChangedEvent, CallFunc_Multiply_DoubleDouble_B_ImplicitCast) == 0x000080, "Member 'BP_GradientGaugeSystem_C_OnCharacterAPChangedEvent::CallFunc_Multiply_DoubleDouble_B_ImplicitCast' has a wrong offset!");

// Function BP_GradientGaugeSystem.BP_GradientGaugeSystem_C.OnCharacterAPChangedInternal
// 0x0020 (0x0020 - 0x0000)
struct BP_GradientGaugeSystem_C_OnCharacterAPChangedInternal final
{
public:
	int32                                         NewAP;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PreviousAP;                                        // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAC_jRPG_CharacterBattleStats_C*        CharacterStats;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UBP_GradientGaugeChangeEvent_C*         local_changeEvent;                                 // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         local_delta;                                       // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GradientGaugeSystem_C_OnCharacterAPChangedInternal) == 0x000008, "Wrong alignment on BP_GradientGaugeSystem_C_OnCharacterAPChangedInternal");
static_assert(sizeof(BP_GradientGaugeSystem_C_OnCharacterAPChangedInternal) == 0x000020, "Wrong size on BP_GradientGaugeSystem_C_OnCharacterAPChangedInternal");
static_assert(offsetof(BP_GradientGaugeSystem_C_OnCharacterAPChangedInternal, NewAP) == 0x000000, "Member 'BP_GradientGaugeSystem_C_OnCharacterAPChangedInternal::NewAP' has a wrong offset!");
static_assert(offsetof(BP_GradientGaugeSystem_C_OnCharacterAPChangedInternal, PreviousAP) == 0x000004, "Member 'BP_GradientGaugeSystem_C_OnCharacterAPChangedInternal::PreviousAP' has a wrong offset!");
static_assert(offsetof(BP_GradientGaugeSystem_C_OnCharacterAPChangedInternal, CharacterStats) == 0x000008, "Member 'BP_GradientGaugeSystem_C_OnCharacterAPChangedInternal::CharacterStats' has a wrong offset!");
static_assert(offsetof(BP_GradientGaugeSystem_C_OnCharacterAPChangedInternal, local_changeEvent) == 0x000010, "Member 'BP_GradientGaugeSystem_C_OnCharacterAPChangedInternal::local_changeEvent' has a wrong offset!");
static_assert(offsetof(BP_GradientGaugeSystem_C_OnCharacterAPChangedInternal, local_delta) == 0x000018, "Member 'BP_GradientGaugeSystem_C_OnCharacterAPChangedInternal::local_delta' has a wrong offset!");

// Function BP_GradientGaugeSystem.BP_GradientGaugeSystem_C.RegisterSourceCharacter
// 0x0020 (0x0020 - 0x0000)
struct BP_GradientGaugeSystem_C_RegisterSourceCharacter final
{
public:
	class UAC_jRPG_CharacterBattleStats_C*        CharacterStats;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UBP_BattleEvent_APChange_C* APChangeEvent)> K2Node_CreateDelegate_OutputDelegate; // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GradientGaugeSystem_C_RegisterSourceCharacter) == 0x000008, "Wrong alignment on BP_GradientGaugeSystem_C_RegisterSourceCharacter");
static_assert(sizeof(BP_GradientGaugeSystem_C_RegisterSourceCharacter) == 0x000020, "Wrong size on BP_GradientGaugeSystem_C_RegisterSourceCharacter");
static_assert(offsetof(BP_GradientGaugeSystem_C_RegisterSourceCharacter, CharacterStats) == 0x000000, "Member 'BP_GradientGaugeSystem_C_RegisterSourceCharacter::CharacterStats' has a wrong offset!");
static_assert(offsetof(BP_GradientGaugeSystem_C_RegisterSourceCharacter, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'BP_GradientGaugeSystem_C_RegisterSourceCharacter::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_GradientGaugeSystem_C_RegisterSourceCharacter, CallFunc_Array_AddUnique_ReturnValue) == 0x000018, "Member 'BP_GradientGaugeSystem_C_RegisterSourceCharacter::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");

// Function BP_GradientGaugeSystem.BP_GradientGaugeSystem_C.SetCurrentGradientGauge
// 0x0138 (0x0138 - 0x0000)
struct BP_GradientGaugeSystem_C_SetCurrentGradientGauge final
{
public:
	int32                                         NewCharges;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        NewProgress;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Reason;                                            // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	int32                                         local_previousCharges;                             // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        local_previousProgress;                            // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0030(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0040(0x0048)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0088(0x0048)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x00D0(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0118(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Format_ReturnValue;                       // 0x0128(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GradientGaugeSystem_C_SetCurrentGradientGauge) == 0x000008, "Wrong alignment on BP_GradientGaugeSystem_C_SetCurrentGradientGauge");
static_assert(sizeof(BP_GradientGaugeSystem_C_SetCurrentGradientGauge) == 0x000138, "Wrong size on BP_GradientGaugeSystem_C_SetCurrentGradientGauge");
static_assert(offsetof(BP_GradientGaugeSystem_C_SetCurrentGradientGauge, NewCharges) == 0x000000, "Member 'BP_GradientGaugeSystem_C_SetCurrentGradientGauge::NewCharges' has a wrong offset!");
static_assert(offsetof(BP_GradientGaugeSystem_C_SetCurrentGradientGauge, NewProgress) == 0x000008, "Member 'BP_GradientGaugeSystem_C_SetCurrentGradientGauge::NewProgress' has a wrong offset!");
static_assert(offsetof(BP_GradientGaugeSystem_C_SetCurrentGradientGauge, Reason) == 0x000010, "Member 'BP_GradientGaugeSystem_C_SetCurrentGradientGauge::Reason' has a wrong offset!");
