#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GameActionInstance_LevelSequenceOneShot

#include "Basic.hpp"

#include "SandFall_classes.hpp"
#include "Engine_structs.hpp"
#include "MovieScene_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_GameActionInstance_LevelSequenceOneShot.BP_GameActionInstance_LevelSequenceOneShot_C
// 0x0038 (0x0078 - 0x0040)
class UBP_GameActionInstance_LevelSequenceOneShot_C final : public UGameActionInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0040(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FMovieSceneSequencePlaybackSettings    PlaybackSettings;                                  // 0x0048(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	class ULevelSequencePlayer*                   LevelSequencePlayer;                               // 0x0070(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void OnSequenceFinished();
	void OnLoaded_00B72F264D7E28FC81C24ABDE548956A(class UObject* Loaded);
	void ExecuteUbergraph_BP_GameActionInstance_LevelSequenceOneShot(int32 EntryPoint);
	void ExecuteGameAction(const class APlayerController* Controller);

	bool ShouldTriggerAutoSaveAfterExecution() const;
	void GetLevelSequenceData(TSoftObjectPtr<class ULevelSequence>* LevelSequence) const;
	class FString GetDebugString() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_GameActionInstance_LevelSequenceOneShot_C">();
	}
	static class UBP_GameActionInstance_LevelSequenceOneShot_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_GameActionInstance_LevelSequenceOneShot_C>();
	}
};
static_assert(alignof(UBP_GameActionInstance_LevelSequenceOneShot_C) == 0x000008, "Wrong alignment on UBP_GameActionInstance_LevelSequenceOneShot_C");
static_assert(sizeof(UBP_GameActionInstance_LevelSequenceOneShot_C) == 0x000078, "Wrong size on UBP_GameActionInstance_LevelSequenceOneShot_C");
static_assert(offsetof(UBP_GameActionInstance_LevelSequenceOneShot_C, UberGraphFrame) == 0x000040, "Member 'UBP_GameActionInstance_LevelSequenceOneShot_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_GameActionInstance_LevelSequenceOneShot_C, PlaybackSettings) == 0x000048, "Member 'UBP_GameActionInstance_LevelSequenceOneShot_C::PlaybackSettings' has a wrong offset!");
static_assert(offsetof(UBP_GameActionInstance_LevelSequenceOneShot_C, LevelSequencePlayer) == 0x000070, "Member 'UBP_GameActionInstance_LevelSequenceOneShot_C::LevelSequencePlayer' has a wrong offset!");

}

