#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GlobalVariablesFunctionLibrary

#include "Basic.hpp"

#include "E_CharacterList_structs.hpp"
#include "E_QuestStatus_structs.hpp"
#include "E_ExplorationCapacity_structs.hpp"
#include "SandFall_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "E_jRPG_ItemType_structs.hpp"
#include "E_WorldMapExplorationCapacity_structs.hpp"
#include "S_jRPG_Item_StaticData_structs.hpp"
#include "E_jRPG_ItemSubtype_structs.hpp"


namespace SDK::Params
{

// Function BP_GlobalVariablesFunctionLibrary.BP_GlobalVariablesFunctionLibrary_C.HasEncounteredEnemy
// 0x0030 (0x0030 - 0x0000)
struct BP_GlobalVariablesFunctionLibrary_C_HasEncounteredEnemy final
{
public:
	class FName                                   EnemyGlobalID;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_jRPG_GI_Custom_C*                   K2Node_DynamicCast_AsBP_J_RPG_GI_Custom;           // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_Value;                           // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GlobalVariablesFunctionLibrary_C_HasEncounteredEnemy) == 0x000008, "Wrong alignment on BP_GlobalVariablesFunctionLibrary_C_HasEncounteredEnemy");
static_assert(sizeof(BP_GlobalVariablesFunctionLibrary_C_HasEncounteredEnemy) == 0x000030, "Wrong size on BP_GlobalVariablesFunctionLibrary_C_HasEncounteredEnemy");
static_assert(offsetof(BP_GlobalVariablesFunctionLibrary_C_HasEncounteredEnemy, EnemyGlobalID) == 0x000000, "Member 'BP_GlobalVariablesFunctionLibrary_C_HasEncounteredEnemy::EnemyGlobalID' has a wrong offset!");
static_assert(offsetof(BP_GlobalVariablesFunctionLibrary_C_HasEncounteredEnemy, __WorldContext) == 0x000008, "Member 'BP_GlobalVariablesFunctionLibrary_C_HasEncounteredEnemy::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_GlobalVariablesFunctionLibrary_C_HasEncounteredEnemy, Result) == 0x000010, "Member 'BP_GlobalVariablesFunctionLibrary_C_HasEncounteredEnemy::Result' has a wrong offset!");
static_assert(offsetof(BP_GlobalVariablesFunctionLibrary_C_HasEncounteredEnemy, CallFunc_GetGameInstance_ReturnValue) == 0x000018, "Member 'BP_GlobalVariablesFunctionLibrary_C_HasEncounteredEnemy::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GlobalVariablesFunctionLibrary_C_HasEncounteredEnemy, K2Node_DynamicCast_AsBP_J_RPG_GI_Custom) == 0x000020, "Member 'BP_GlobalVariablesFunctionLibrary_C_HasEncounteredEnemy::K2Node_DynamicCast_AsBP_J_RPG_GI_Custom' has a wrong offset!");
static_assert(offsetof(BP_GlobalVariablesFunctionLibrary_C_HasEncounteredEnemy, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BP_GlobalVariablesFunctionLibrary_C_HasEncounteredEnemy::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_GlobalVariablesFunctionLibrary_C_HasEncounteredEnemy, CallFunc_Map_Find_Value) == 0x000029, "Member 'BP_GlobalVariablesFunctionLibrary_C_HasEncounteredEnemy::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BP_GlobalVariablesFunctionLibrary_C_HasEncounteredEnemy, CallFunc_Map_Find_ReturnValue) == 0x00002A, "Member 'BP_GlobalVariablesFunctionLibrary_C_HasEncounteredEnemy::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GlobalVariablesFunctionLibrary_C_HasEncounteredEnemy, CallFunc_BooleanAND_ReturnValue) == 0x00002B, "Member 'BP_GlobalVariablesFunctionLibrary_C_HasEncounteredEnemy::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BP_GlobalVariablesFunctionLibrary.BP_GlobalVariablesFunctionLibrary_C.HasExplorationCapacity
// 0x0030 (0x0030 - 0x0000)
struct BP_GlobalVariablesFunctionLibrary_C_HasExplorationCapacity final
{
public:
	E_ExplorationCapacity                         Capacity;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_jRPG_GI_Custom_C*                   K2Node_DynamicCast_AsBP_J_RPG_GI_Custom;           // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsExplorationCapacityUnlocked_IsUnlocked; // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GlobalVariablesFunctionLibrary_C_HasExplorationCapacity) == 0x000008, "Wrong alignment on BP_GlobalVariablesFunctionLibrary_C_HasExplorationCapacity");
static_assert(sizeof(BP_GlobalVariablesFunctionLibrary_C_HasExplorationCapacity) == 0x000030, "Wrong size on BP_GlobalVariablesFunctionLibrary_C_HasExplorationCapacity");
static_assert(offsetof(BP_GlobalVariablesFunctionLibrary_C_HasExplorationCapacity, Capacity) == 0x000000, "Member 'BP_GlobalVariablesFunctionLibrary_C_HasExplorationCapacity::Capacity' has a wrong offset!");
static_assert(offsetof(BP_GlobalVariablesFunctionLibrary_C_HasExplorationCapacity, __WorldContext) == 0x000008, "Member 'BP_GlobalVariablesFunctionLibrary_C_HasExplorationCapacity::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_GlobalVariablesFunctionLibrary_C_HasExplorationCapacity, Result) == 0x000010, "Member 'BP_GlobalVariablesFunctionLibrary_C_HasExplorationCapacity::Result' has a wrong offset!");
static_assert(offsetof(BP_GlobalVariablesFunctionLibrary_C_HasExplorationCapacity, CallFunc_GetGameInstance_ReturnValue) == 0x000018, "Member 'BP_GlobalVariablesFunctionLibrary_C_HasExplorationCapacity::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GlobalVariablesFunctionLibrary_C_HasExplorationCapacity, K2Node_DynamicCast_AsBP_J_RPG_GI_Custom) == 0x000020, "Member 'BP_GlobalVariablesFunctionLibrary_C_HasExplorationCapacity::K2Node_DynamicCast_AsBP_J_RPG_GI_Custom' has a wrong offset!");
static_assert(offsetof(BP_GlobalVariablesFunctionLibrary_C_HasExplorationCapacity, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BP_GlobalVariablesFunctionLibrary_C_HasExplorationCapacity::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_GlobalVariablesFunctionLibrary_C_HasExplorationCapacity, CallFunc_IsExplorationCapacityUnlocked_IsUnlocked) == 0x000029, "Member 'BP_GlobalVariablesFunctionLibrary_C_HasExplorationCapacity::CallFunc_IsExplorationCapacityUnlocked_IsUnlocked' has a wrong offset!");

// Function BP_GlobalVariablesFunctionLibrary.BP_GlobalVariablesFunctionLibrary_C.HasUnlockedGradientParry
// 0x0030 (0x0030 - 0x0000)
struct BP_GlobalVariablesFunctionLibrary_C_HasUnlockedGradientParry final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuestObjectiveIdentifier              CallFunc_CreateQuestObjectiveIdentifier_ReturnValue; // 0x000C(0x0010)(NoDestructor)
	bool                                          CallFunc_HasPersistentFlag_Result;                 // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_QuestSystem_C*                      CallFunc_GetQuestSystem_QuestSystem;               // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	E_QuestStatus                                 CallFunc_GetObjectiveStatus_Status;                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GlobalVariablesFunctionLibrary_C_HasUnlockedGradientParry) == 0x000008, "Wrong alignment on BP_GlobalVariablesFunctionLibrary_C_HasUnlockedGradientParry");
static_assert(sizeof(BP_GlobalVariablesFunctionLibrary_C_HasUnlockedGradientParry) == 0x000030, "Wrong size on BP_GlobalVariablesFunctionLibrary_C_HasUnlockedGradientParry");
static_assert(offsetof(BP_GlobalVariablesFunctionLibrary_C_HasUnlockedGradientParry, __WorldContext) == 0x000000, "Member 'BP_GlobalVariablesFunctionLibrary_C_HasUnlockedGradientParry::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_GlobalVariablesFunctionLibrary_C_HasUnlockedGradientParry, ReturnValue) == 0x000008, "Member 'BP_GlobalVariablesFunctionLibrary_C_HasUnlockedGradientParry::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GlobalVariablesFunctionLibrary_C_HasUnlockedGradientParry, CallFunc_CreateQuestObjectiveIdentifier_ReturnValue) == 0x00000C, "Member 'BP_GlobalVariablesFunctionLibrary_C_HasUnlockedGradientParry::CallFunc_CreateQuestObjectiveIdentifier_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GlobalVariablesFunctionLibrary_C_HasUnlockedGradientParry, CallFunc_HasPersistentFlag_Result) == 0x00001C, "Member 'BP_GlobalVariablesFunctionLibrary_C_HasUnlockedGradientParry::CallFunc_HasPersistentFlag_Result' has a wrong offset!");
static_assert(offsetof(BP_GlobalVariablesFunctionLibrary_C_HasUnlockedGradientParry, CallFunc_GetQuestSystem_QuestSystem) == 0x000020, "Member 'BP_GlobalVariablesFunctionLibrary_C_HasUnlockedGradientParry::CallFunc_GetQuestSystem_QuestSystem' has a wrong offset!");
static_assert(offsetof(BP_GlobalVariablesFunctionLibrary_C_HasUnlockedGradientParry, CallFunc_GetObjectiveStatus_Status) == 0x000028, "Member 'BP_GlobalVariablesFunctionLibrary_C_HasUnlockedGradientParry::CallFunc_GetObjectiveStatus_Status' has a wrong offset!");
static_assert(offsetof(BP_GlobalVariablesFunctionLibrary_C_HasUnlockedGradientParry, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000029, "Member 'BP_GlobalVariablesFunctionLibrary_C_HasUnlockedGradientParry::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GlobalVariablesFunctionLibrary_C_HasUnlockedGradientParry, CallFunc_BooleanOR_ReturnValue) == 0x00002A, "Member 'BP_GlobalVariablesFunctionLibrary_C_HasUnlockedGradientParry::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function BP_GlobalVariablesFunctionLibrary.BP_GlobalVariablesFunctionLibrary_C.HasUnlockedJump
// 0x0030 (0x0030 - 0x0000)
struct BP_GlobalVariablesFunctionLibrary_C_HasUnlockedJump final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuestObjectiveIdentifier              CallFunc_CreateQuestObjectiveIdentifier_ReturnValue; // 0x000C(0x0010)(NoDestructor)
	bool                                          CallFunc_HasPersistentFlag_Result;                 // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_QuestSystem_C*                      CallFunc_GetQuestSystem_QuestSystem;               // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	E_QuestStatus                                 CallFunc_GetObjectiveStatus_Status;                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GlobalVariablesFunctionLibrary_C_HasUnlockedJump) == 0x000008, "Wrong alignment on BP_GlobalVariablesFunctionLibrary_C_HasUnlockedJump");
static_assert(sizeof(BP_GlobalVariablesFunctionLibrary_C_HasUnlockedJump) == 0x000030, "Wrong size on BP_GlobalVariablesFunctionLibrary_C_HasUnlockedJump");
static_assert(offsetof(BP_GlobalVariablesFunctionLibrary_C_HasUnlockedJump, __WorldContext) == 0x000000, "Member 'BP_GlobalVariablesFunctionLibrary_C_HasUnlockedJump::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_GlobalVariablesFunctionLibrary_C_HasUnlockedJump, ReturnValue) == 0x000008, "Member 'BP_GlobalVariablesFunctionLibrary_C_HasUnlockedJump::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GlobalVariablesFunctionLibrary_C_HasUnlockedJump, CallFunc_CreateQuestObjectiveIdentifier_ReturnValue) == 0x00000C, "Member 'BP_GlobalVariablesFunctionLibrary_C_HasUnlockedJump::CallFunc_CreateQuestObjectiveIdentifier_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GlobalVariablesFunctionLibrary_C_HasUnlockedJump, CallFunc_HasPersistentFlag_Result) == 0x00001C, "Member 'BP_GlobalVariablesFunctionLibrary_C_HasUnlockedJump::CallFunc_HasPersistentFlag_Result' has a wrong offset!");
static_assert(offsetof(BP_GlobalVariablesFunctionLibrary_C_HasUnlockedJump, CallFunc_GetQuestSystem_QuestSystem) == 0x000020, "Member 'BP_GlobalVariablesFunctionLibrary_C_HasUnlockedJump::CallFunc_GetQuestSystem_QuestSystem' has a wrong offset!");
static_assert(offsetof(BP_GlobalVariablesFunctionLibrary_C_HasUnlockedJump, CallFunc_GetObjectiveStatus_Status) == 0x000028, "Member 'BP_GlobalVariablesFunctionLibrary_C_HasUnlockedJump::CallFunc_GetObjectiveStatus_Status' has a wrong offset!");
static_assert(offsetof(BP_GlobalVariablesFunctionLibrary_C_HasUnlockedJump, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000029, "Member 'BP_GlobalVariablesFunctionLibrary_C_HasUnlockedJump::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GlobalVariablesFunctionLibrary_C_HasUnlockedJump, CallFunc_BooleanOR_ReturnValue) == 0x00002A, "Member 'BP_GlobalVariablesFunctionLibrary_C_HasUnlockedJump::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function BP_GlobalVariablesFunctionLibrary.BP_GlobalVariablesFunctionLibrary_C.HasPlayedTutorial
// 0x0030 (0x0030 - 0x0000)
struct BP_GlobalVariablesFunctionLibrary_C_HasPlayedTutorial final
{
public:
	class FName                                   TutorialID;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_jRPG_GI_Custom_C*                   K2Node_DynamicCast_AsBP_J_RPG_GI_Custom;           // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckHasPlayedTutorial_HasPlayed;         // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GlobalVariablesFunctionLibrary_C_HasPlayedTutorial) == 0x000008, "Wrong alignment on BP_GlobalVariablesFunctionLibrary_C_HasPlayedTutorial");
static_assert(sizeof(BP_GlobalVariablesFunctionLibrary_C_HasPlayedTutorial) == 0x000030, "Wrong size on BP_GlobalVariablesFunctionLibrary_C_HasPlayedTutorial");
static_assert(offsetof(BP_GlobalVariablesFunctionLibrary_C_HasPlayedTutorial, TutorialID) == 0x000000, "Member 'BP_GlobalVariablesFunctionLibrary_C_HasPlayedTutorial::TutorialID' has a wrong offset!");
static_assert(offsetof(BP_GlobalVariablesFunctionLibrary_C_HasPlayedTutorial, __WorldContext) == 0x000008, "Member 'BP_GlobalVariablesFunctionLibrary_C_HasPlayedTutorial::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_GlobalVariablesFunctionLibrary_C_HasPlayedTutorial, Result) == 0x000010, "Member 'BP_GlobalVariablesFunctionLibrary_C_HasPlayedTutorial::Result' has a wrong offset!");
static_assert(offsetof(BP_GlobalVariablesFunctionLibrary_C_HasPlayedTutorial, CallFunc_GetGameInstance_ReturnValue) == 0x000018, "Member 'BP_GlobalVariablesFunctionLibrary_C_HasPlayedTutorial::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GlobalVariablesFunctionLibrary_C_HasPlayedTutorial, K2Node_DynamicCast_AsBP_J_RPG_GI_Custom) == 0x000020, "Member 'BP_GlobalVariablesFunctionLibrary_C_HasPlayedTutorial::K2Node_DynamicCast_AsBP_J_RPG_GI_Custom' has a wrong offset!");
static_assert(offsetof(BP_GlobalVariablesFunctionLibrary_C_HasPlayedTutorial, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BP_GlobalVariablesFunctionLibrary_C_HasPlayedTutorial::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_GlobalVariablesFunctionLibrary_C_HasPlayedTutorial, CallFunc_CheckHasPlayedTutorial_HasPlayed) == 0x000029, "Member 'BP_GlobalVariablesFunctionLibrary_C_HasPlayedTutorial::CallFunc_CheckHasPlayedTutorial_HasPlayed' has a wrong offset!");

// Function BP_GlobalVariablesFunctionLibrary.BP_GlobalVariablesFunctionLibrary_C.GetPlayedTime
// 0x0028 (0x0028 - 0x0000)
struct BP_GlobalVariablesFunctionLibrary_C_GetPlayedTime final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        PlayedTime;                                        // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_jRPG_GI_Custom_C*                   K2Node_DynamicCast_AsBP_J_RPG_GI_Custom;           // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GlobalVariablesFunctionLibrary_C_GetPlayedTime) == 0x000008, "Wrong alignment on BP_GlobalVariablesFunctionLibrary_C_GetPlayedTime");
static_assert(sizeof(BP_GlobalVariablesFunctionLibrary_C_GetPlayedTime) == 0x000028, "Wrong size on BP_GlobalVariablesFunctionLibrary_C_GetPlayedTime");
static_assert(offsetof(BP_GlobalVariablesFunctionLibrary_C_GetPlayedTime, __WorldContext) == 0x000000, "Member 'BP_GlobalVariablesFunctionLibrary_C_GetPlayedTime::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_GlobalVariablesFunctionLibrary_C_GetPlayedTime, PlayedTime) == 0x000008, "Member 'BP_GlobalVariablesFunctionLibrary_C_GetPlayedTime::PlayedTime' has a wrong offset!");
static_assert(offsetof(BP_GlobalVariablesFunctionLibrary_C_GetPlayedTime, CallFunc_GetGameInstance_ReturnValue) == 0x000010, "Member 'BP_GlobalVariablesFunctionLibrary_C_GetPlayedTime::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GlobalVariablesFunctionLibrary_C_GetPlayedTime, K2Node_DynamicCast_AsBP_J_RPG_GI_Custom) == 0x000018, "Member 'BP_GlobalVariablesFunctionLibrary_C_GetPlayedTime::K2Node_DynamicCast_AsBP_J_RPG_GI_Custom' has a wrong offset!");
static_assert(offsetof(BP_GlobalVariablesFunctionLibrary_C_GetPlayedTime, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_GlobalVariablesFunctionLibrary_C_GetPlayedTime::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BP_GlobalVariablesFunctionLibrary.BP_GlobalVariablesFunctionLibrary_C.GetFinishedGameCount
// 0x0028 (0x0028 - 0x0000)
struct BP_GlobalVariablesFunctionLibrary_C_GetFinishedGameCount final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         FinishedGameCount;                                 // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_jRPG_GI_Custom_C*                   K2Node_DynamicCast_AsBP_J_RPG_GI_Custom;           // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GlobalVariablesFunctionLibrary_C_GetFinishedGameCount) == 0x000008, "Wrong alignment on BP_GlobalVariablesFunctionLibrary_C_GetFinishedGameCount");
static_assert(sizeof(BP_GlobalVariablesFunctionLibrary_C_GetFinishedGameCount) == 0x000028, "Wrong size on BP_GlobalVariablesFunctionLibrary_C_GetFinishedGameCount");
static_assert(offsetof(BP_GlobalVariablesFunctionLibrary_C_GetFinishedGameCount, __WorldContext) == 0x000000, "Member 'BP_GlobalVariablesFunctionLibrary_C_GetFinishedGameCount::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_GlobalVariablesFunctionLibrary_C_GetFinishedGameCount, FinishedGameCount) == 0x000008, "Member 'BP_GlobalVariablesFunctionLibrary_C_GetFinishedGameCount::FinishedGameCount' has a wrong offset!");
static_assert(offsetof(BP_GlobalVariablesFunctionLibrary_C_GetFinishedGameCount, CallFunc_GetGameInstance_ReturnValue) == 0x000010, "Member 'BP_GlobalVariablesFunctionLibrary_C_GetFinishedGameCount::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GlobalVariablesFunctionLibrary_C_GetFinishedGameCount, K2Node_DynamicCast_AsBP_J_RPG_GI_Custom) == 0x000018, "Member 'BP_GlobalVariablesFunctionLibrary_C_GetFinishedGameCount::K2Node_DynamicCast_AsBP_J_RPG_GI_Custom' has a wrong offset!");
static_assert(offsetof(BP_GlobalVariablesFunctionLibrary_C_GetFinishedGameCount, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_GlobalVariablesFunctionLibrary_C_GetFinishedGameCount::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BP_GlobalVariablesFunctionLibrary.BP_GlobalVariablesFunctionLibrary_C.HasAlreadyFinishedGame
// 0x0018 (0x0018 - 0x0000)
struct BP_GlobalVariablesFunctionLibrary_C_HasAlreadyFinishedGame final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetFinishedGameCount_FinishedGameCount;   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GlobalVariablesFunctionLibrary_C_HasAlreadyFinishedGame) == 0x000008, "Wrong alignment on BP_GlobalVariablesFunctionLibrary_C_HasAlreadyFinishedGame");
static_assert(sizeof(BP_GlobalVariablesFunctionLibrary_C_HasAlreadyFinishedGame) == 0x000018, "Wrong size on BP_GlobalVariablesFunctionLibrary_C_HasAlreadyFinishedGame");
static_assert(offsetof(BP_GlobalVariablesFunctionLibrary_C_HasAlreadyFinishedGame, __WorldContext) == 0x000000, "Member 'BP_GlobalVariablesFunctionLibrary_C_HasAlreadyFinishedGame::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_GlobalVariablesFunctionLibrary_C_HasAlreadyFinishedGame, Result) == 0x000008, "Member 'BP_GlobalVariablesFunctionLibrary_C_HasAlreadyFinishedGame::Result' has a wrong offset!");
static_assert(offsetof(BP_GlobalVariablesFunctionLibrary_C_HasAlreadyFinishedGame, CallFunc_GetFinishedGameCount_FinishedGameCount) == 0x00000C, "Member 'BP_GlobalVariablesFunctionLibrary_C_HasAlreadyFinishedGame::CallFunc_GetFinishedGameCount_FinishedGameCount' has a wrong offset!");
static_assert(offsetof(BP_GlobalVariablesFunctionLibrary_C_HasAlreadyFinishedGame, CallFunc_Greater_IntInt_ReturnValue) == 0x000010, "Member 'BP_GlobalVariablesFunctionLibrary_C_HasAlreadyFinishedGame::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

// Function BP_GlobalVariablesFunctionLibrary.BP_GlobalVariablesFunctionLibrary_C.HasPlayedDialogueStage
// 0x0040 (0x0040 - 0x0000)
struct BP_GlobalVariablesFunctionLibrary_C_HasPlayedDialogueStage final
{
public:
	struct FGuid                                  DialogueGUID;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Stage;                                             // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_jRPG_GI_Custom_C*                   K2Node_DynamicCast_AsBP_J_RPG_GI_Custom;           // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckDialogueIsAtLeastAtStage_IsAtLeastAtStage; // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GlobalVariablesFunctionLibrary_C_HasPlayedDialogueStage) == 0x000008, "Wrong alignment on BP_GlobalVariablesFunctionLibrary_C_HasPlayedDialogueStage");
static_assert(sizeof(BP_GlobalVariablesFunctionLibrary_C_HasPlayedDialogueStage) == 0x000040, "Wrong size on BP_GlobalVariablesFunctionLibrary_C_HasPlayedDialogueStage");
static_assert(offsetof(BP_GlobalVariablesFunctionLibrary_C_HasPlayedDialogueStage, DialogueGUID) == 0x000000, "Member 'BP_GlobalVariablesFunctionLibrary_C_HasPlayedDialogueStage::DialogueGUID' has a wrong offset!");
static_assert(offsetof(BP_GlobalVariablesFunctionLibrary_C_HasPlayedDialogueStage, Stage) == 0x000010, "Member 'BP_GlobalVariablesFunctionLibrary_C_HasPlayedDialogueStage::Stage' has a wrong offset!");
static_assert(offsetof(BP_GlobalVariablesFunctionLibrary_C_HasPlayedDialogueStage, __WorldContext) == 0x000018, "Member 'BP_GlobalVariablesFunctionLibrary_C_HasPlayedDialogueStage::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_GlobalVariablesFunctionLibrary_C_HasPlayedDialogueStage, Result) == 0x000020, "Member 'BP_GlobalVariablesFunctionLibrary_C_HasPlayedDialogueStage::Result' has a wrong offset!");
static_assert(offsetof(BP_GlobalVariablesFunctionLibrary_C_HasPlayedDialogueStage, CallFunc_GetGameInstance_ReturnValue) == 0x000028, "Member 'BP_GlobalVariablesFunctionLibrary_C_HasPlayedDialogueStage::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GlobalVariablesFunctionLibrary_C_HasPlayedDialogueStage, K2Node_DynamicCast_AsBP_J_RPG_GI_Custom) == 0x000030, "Member 'BP_GlobalVariablesFunctionLibrary_C_HasPlayedDialogueStage::K2Node_DynamicCast_AsBP_J_RPG_GI_Custom' has a wrong offset!");
static_assert(offsetof(BP_GlobalVariablesFunctionLibrary_C_HasPlayedDialogueStage, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'BP_GlobalVariablesFunctionLibrary_C_HasPlayedDialogueStage::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_GlobalVariablesFunctionLibrary_C_HasPlayedDialogueStage, CallFunc_CheckDialogueIsAtLeastAtStage_IsAtLeastAtStage) == 0x000039, "Member 'BP_GlobalVariablesFunctionLibrary_C_HasPlayedDialogueStage::CallFunc_CheckDialogueIsAtLeastAtStage_IsAtLeastAtStage' has a wrong offset!");

// Function BP_GlobalVariablesFunctionLibrary.BP_GlobalVariablesFunctionLibrary_C.HasAtLeastGoldAmount
// 0x0020 (0x0020 - 0x0000)
struct BP_GlobalVariablesFunctionLibrary_C_HasAtLeastGoldAmount final
{
public:
	int32                                         GoldAmount;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetGoldAmount_GoldAmount;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GlobalVariablesFunctionLibrary_C_HasAtLeastGoldAmount) == 0x000008, "Wrong alignment on BP_GlobalVariablesFunctionLibrary_C_HasAtLeastGoldAmount");
static_assert(sizeof(BP_GlobalVariablesFunctionLibrary_C_HasAtLeastGoldAmount) == 0x000020, "Wrong size on BP_GlobalVariablesFunctionLibrary_C_HasAtLeastGoldAmount");
static_assert(offsetof(BP_GlobalVariablesFunctionLibrary_C_HasAtLeastGoldAmount, GoldAmount) == 0x000000, "Member 'BP_GlobalVariablesFunctionLibrary_C_HasAtLeastGoldAmount::GoldAmount' has a wrong offset!");
static_assert(offsetof(BP_GlobalVariablesFunctionLibrary_C_HasAtLeastGoldAmount, __WorldContext) == 0x000008, "Member 'BP_GlobalVariablesFunctionLibrary_C_HasAtLeastGoldAmount::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_GlobalVariablesFunctionLibrary_C_HasAtLeastGoldAmount, Result) == 0x000010, "Member 'BP_GlobalVariablesFunctionLibrary_C_HasAtLeastGoldAmount::Result' has a wrong offset!");
static_assert(offsetof(BP_GlobalVariablesFunctionLibrary_C_HasAtLeastGoldAmount, CallFunc_GetGoldAmount_GoldAmount) == 0x000014, "Member 'BP_GlobalVariablesFunctionLibrary_C_HasAtLeastGoldAmount::CallFunc_GetGoldAmount_GoldAmount' has a wrong offset!");
static_assert(offsetof(BP_GlobalVariablesFunctionLibrary_C_HasAtLeastGoldAmount, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000018, "Member 'BP_GlobalVariablesFunctionLibrary_C_HasAtLeastGoldAmount::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");

// Function BP_GlobalVariablesFunctionLibrary.BP_GlobalVariablesFunctionLibrary_C.GetGoldAmount
// 0x0028 (0x0028 - 0x0000)
struct BP_GlobalVariablesFunctionLibrary_C_GetGoldAmount final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         GoldAmount;                                        // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_jRPG_GI_Custom_C*                   K2Node_DynamicCast_AsBP_J_RPG_GI_Custom;           // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GlobalVariablesFunctionLibrary_C_GetGoldAmount) == 0x000008, "Wrong alignment on BP_GlobalVariablesFunctionLibrary_C_GetGoldAmount");
static_assert(sizeof(BP_GlobalVariablesFunctionLibrary_C_GetGoldAmount) == 0x000028, "Wrong size on BP_GlobalVariablesFunctionLibrary_C_GetGoldAmount");
static_assert(offsetof(BP_GlobalVariablesFunctionLibrary_C_GetGoldAmount, __WorldContext) == 0x000000, "Member 'BP_GlobalVariablesFunctionLibrary_C_GetGoldAmount::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_GlobalVariablesFunctionLibrary_C_GetGoldAmount, GoldAmount) == 0x000008, "Member 'BP_GlobalVariablesFunctionLibrary_C_GetGoldAmount::GoldAmount' has a wrong offset!");
static_assert(offsetof(BP_GlobalVariablesFunctionLibrary_C_GetGoldAmount, CallFunc_GetGameInstance_ReturnValue) == 0x000010, "Member 'BP_GlobalVariablesFunctionLibrary_C_GetGoldAmount::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GlobalVariablesFunctionLibrary_C_GetGoldAmount, K2Node_DynamicCast_AsBP_J_RPG_GI_Custom) == 0x000018, "Member 'BP_GlobalVariablesFunctionLibrary_C_GetGoldAmount::K2Node_DynamicCast_AsBP_J_RPG_GI_Custom' has a wrong offset!");
static_assert(offsetof(BP_GlobalVariablesFunctionLibrary_C_GetGoldAmount, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_GlobalVariablesFunctionLibrary_C_GetGoldAmount::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BP_GlobalVariablesFunctionLibrary.BP_GlobalVariablesFunctionLibrary_C.HasCharacterInParty
// 0x0020 (0x0020 - 0x0000)
struct BP_GlobalVariablesFunctionLibrary_C_HasCharacterInParty final
{
public:
	E_CharacterList                               Character;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_ToHardcodedName_HardcodedName;            // 0x0014(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasCharacterInPartyByHardcodedName_Result; // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GlobalVariablesFunctionLibrary_C_HasCharacterInParty) == 0x000008, "Wrong alignment on BP_GlobalVariablesFunctionLibrary_C_HasCharacterInParty");
static_assert(sizeof(BP_GlobalVariablesFunctionLibrary_C_HasCharacterInParty) == 0x000020, "Wrong size on BP_GlobalVariablesFunctionLibrary_C_HasCharacterInParty");
static_assert(offsetof(BP_GlobalVariablesFunctionLibrary_C_HasCharacterInParty, Character) == 0x000000, "Member 'BP_GlobalVariablesFunctionLibrary_C_HasCharacterInParty::Character' has a wrong offset!");
static_assert(offsetof(BP_GlobalVariablesFunctionLibrary_C_HasCharacterInParty, __WorldContext) == 0x000008, "Member 'BP_GlobalVariablesFunctionLibrary_C_HasCharacterInParty::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_GlobalVariablesFunctionLibrary_C_HasCharacterInParty, Result) == 0x000010, "Member 'BP_GlobalVariablesFunctionLibrary_C_HasCharacterInParty::Result' has a wrong offset!");
static_assert(offsetof(BP_GlobalVariablesFunctionLibrary_C_HasCharacterInParty, CallFunc_ToHardcodedName_HardcodedName) == 0x000014, "Member 'BP_GlobalVariablesFunctionLibrary_C_HasCharacterInParty::CallFunc_ToHardcodedName_HardcodedName' has a wrong offset!");
static_assert(offsetof(BP_GlobalVariablesFunctionLibrary_C_HasCharacterInParty, CallFunc_HasCharacterInPartyByHardcodedName_Result) == 0x00001C, "Member 'BP_GlobalVariablesFunctionLibrary_C_HasCharacterInParty::CallFunc_HasCharacterInPartyByHardcodedName_Result' has a wrong offset!");

// Function BP_GlobalVariablesFunctionLibrary.BP_GlobalVariablesFunctionLibrary_C.HasCharacterInPartyByHardcodedName
// 0x0030 (0x0030 - 0x0000)
struct BP_GlobalVariablesFunctionLibrary_C_HasCharacterInPartyByHardcodedName final
{
public:
	class FName                                   HardcodedName;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_jRPG_GI_Custom_C*                   K2Node_DynamicCast_AsBP_J_RPG_GI_Custom;           // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCharacterInParty_ReturnValue;           // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GlobalVariablesFunctionLibrary_C_HasCharacterInPartyByHardcodedName) == 0x000008, "Wrong alignment on BP_GlobalVariablesFunctionLibrary_C_HasCharacterInPartyByHardcodedName");
static_assert(sizeof(BP_GlobalVariablesFunctionLibrary_C_HasCharacterInPartyByHardcodedName) == 0x000030, "Wrong size on BP_GlobalVariablesFunctionLibrary_C_HasCharacterInPartyByHardcodedName");
static_assert(offsetof(BP_GlobalVariablesFunctionLibrary_C_HasCharacterInPartyByHardcodedName, HardcodedName) == 0x000000, "Member 'BP_GlobalVariablesFunctionLibrary_C_HasCharacterInPartyByHardcodedName::HardcodedName' has a wrong offset!");
static_assert(offsetof(BP_GlobalVariablesFunctionLibrary_C_HasCharacterInPartyByHardcodedName, __WorldContext) == 0x000008, "Member 'BP_GlobalVariablesFunctionLibrary_C_HasCharacterInPartyByHardcodedName::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_GlobalVariablesFunctionLibrary_C_HasCharacterInPartyByHardcodedName, Result) == 0x000010, "Member 'BP_GlobalVariablesFunctionLibrary_C_HasCharacterInPartyByHardcodedName::Result' has a wrong offset!");
static_assert(offsetof(BP_GlobalVariablesFunctionLibrary_C_HasCharacterInPartyByHardcodedName, CallFunc_GetGameInstance_ReturnValue) == 0x000018, "Member 'BP_GlobalVariablesFunctionLibrary_C_HasCharacterInPartyByHardcodedName::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GlobalVariablesFunctionLibrary_C_HasCharacterInPartyByHardcodedName, K2Node_DynamicCast_AsBP_J_RPG_GI_Custom) == 0x000020, "Member 'BP_GlobalVariablesFunctionLibrary_C_HasCharacterInPartyByHardcodedName::K2Node_DynamicCast_AsBP_J_RPG_GI_Custom' has a wrong offset!");
static_assert(offsetof(BP_GlobalVariablesFunctionLibrary_C_HasCharacterInPartyByHardcodedName, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BP_GlobalVariablesFunctionLibrary_C_HasCharacterInPartyByHardcodedName::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_GlobalVariablesFunctionLibrary_C_HasCharacterInPartyByHardcodedName, CallFunc_IsCharacterInParty_ReturnValue) == 0x000029, "Member 'BP_GlobalVariablesFunctionLibrary_C_HasCharacterInPartyByHardcodedName::CallFunc_IsCharacterInParty_ReturnValue' has a wrong offset!");

// Function BP_GlobalVariablesFunctionLibrary.BP_GlobalVariablesFunctionLibrary_C.HasCharacterInCollection
// 0x0020 (0x0020 - 0x0000)
struct BP_GlobalVariablesFunctionLibrary_C_HasCharacterInCollection final
{
public:
	E_CharacterList                               Character;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CheckExcludedCharacters;                           // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_ToHardcodedName_HardcodedName;            // 0x0014(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasCharacterInCollectionByHardcodedName_Result; // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GlobalVariablesFunctionLibrary_C_HasCharacterInCollection) == 0x000008, "Wrong alignment on BP_GlobalVariablesFunctionLibrary_C_HasCharacterInCollection");
static_assert(sizeof(BP_GlobalVariablesFunctionLibrary_C_HasCharacterInCollection) == 0x000020, "Wrong size on BP_GlobalVariablesFunctionLibrary_C_HasCharacterInCollection");
static_assert(offsetof(BP_GlobalVariablesFunctionLibrary_C_HasCharacterInCollection, Character) == 0x000000, "Member 'BP_GlobalVariablesFunctionLibrary_C_HasCharacterInCollection::Character' has a wrong offset!");
static_assert(offsetof(BP_GlobalVariablesFunctionLibrary_C_HasCharacterInCollection, CheckExcludedCharacters) == 0x000001, "Member 'BP_GlobalVariablesFunctionLibrary_C_HasCharacterInCollection::CheckExcludedCharacters' has a wrong offset!");
static_assert(offsetof(BP_GlobalVariablesFunctionLibrary_C_HasCharacterInCollection, __WorldContext) == 0x000008, "Member 'BP_GlobalVariablesFunctionLibrary_C_HasCharacterInCollection::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_GlobalVariablesFunctionLibrary_C_HasCharacterInCollection, Result) == 0x000010, "Member 'BP_GlobalVariablesFunctionLibrary_C_HasCharacterInCollection::Result' has a wrong offset!");
static_assert(offsetof(BP_GlobalVariablesFunctionLibrary_C_HasCharacterInCollection, CallFunc_ToHardcodedName_HardcodedName) == 0x000014, "Member 'BP_GlobalVariablesFunctionLibrary_C_HasCharacterInCollection::CallFunc_ToHardcodedName_HardcodedName' has a wrong offset!");
static_assert(offsetof(BP_GlobalVariablesFunctionLibrary_C_HasCharacterInCollection, CallFunc_HasCharacterInCollectionByHardcodedName_Result) == 0x00001C, "Member 'BP_GlobalVariablesFunctionLibrary_C_HasCharacterInCollection::CallFunc_HasCharacterInCollectionByHardcodedName_Result' has a wrong offset!");

// Function BP_GlobalVariablesFunctionLibrary.BP_GlobalVariablesFunctionLibrary_C.HasCharacterInCollectionByHardcodedName
// 0x0050 (0x0050 - 0x0000)
struct BP_GlobalVariablesFunctionLibrary_C_HasCharacterInCollectionByHardcodedName final
{
public:
	class FName                                   HardcodedName;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CheckExcludedCharacters;                           // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasWorldMapCapacity_Result;               // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_jRPG_GI_Custom_C*                   K2Node_DynamicCast_AsBP_J_RPG_GI_Custom;           // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_CharacterData_C*                    CallFunc_Map_Find_Value;                           // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsExcluded_Excluded;                   // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GlobalVariablesFunctionLibrary_C_HasCharacterInCollectionByHardcodedName) == 0x000008, "Wrong alignment on BP_GlobalVariablesFunctionLibrary_C_HasCharacterInCollectionByHardcodedName");
static_assert(sizeof(BP_GlobalVariablesFunctionLibrary_C_HasCharacterInCollectionByHardcodedName) == 0x000050, "Wrong size on BP_GlobalVariablesFunctionLibrary_C_HasCharacterInCollectionByHardcodedName");
static_assert(offsetof(BP_GlobalVariablesFunctionLibrary_C_HasCharacterInCollectionByHardcodedName, HardcodedName) == 0x000000, "Member 'BP_GlobalVariablesFunctionLibrary_C_HasCharacterInCollectionByHardcodedName::HardcodedName' has a wrong offset!");
static_assert(offsetof(BP_GlobalVariablesFunctionLibrary_C_HasCharacterInCollectionByHardcodedName, CheckExcludedCharacters) == 0x000008, "Member 'BP_GlobalVariablesFunctionLibrary_C_HasCharacterInCollectionByHardcodedName::CheckExcludedCharacters' has a wrong offset!");
static_assert(offsetof(BP_GlobalVariablesFunctionLibrary_C_HasCharacterInCollectionByHardcodedName, __WorldContext) == 0x000010, "Member 'BP_GlobalVariablesFunctionLibrary_C_HasCharacterInCollectionByHardcodedName::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_GlobalVariablesFunctionLibrary_C_HasCharacterInCollectionByHardcodedName, Result) == 0x000018, "Member 'BP_GlobalVariablesFunctionLibrary_C_HasCharacterInCollectionByHardcodedName::Result' has a wrong offset!");
static_assert(offsetof(BP_GlobalVariablesFunctionLibrary_C_HasCharacterInCollectionByHardcodedName, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000019, "Member 'BP_GlobalVariablesFunctionLibrary_C_HasCharacterInCollectionByHardcodedName::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GlobalVariablesFunctionLibrary_C_HasCharacterInCollectionByHardcodedName, CallFunc_GetGameInstance_ReturnValue) == 0x000020, "Member 'BP_GlobalVariablesFunctionLibrary_C_HasCharacterInCollectionByHardcodedName::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GlobalVariablesFunctionLibrary_C_HasCharacterInCollectionByHardcodedName, CallFunc_HasWorldMapCapacity_Result) == 0x000028, "Member 'BP_GlobalVariablesFunctionLibrary_C_HasCharacterInCollectionByHardcodedName::CallFunc_HasWorldMapCapacity_Result' has a wrong offset!");
static_assert(offsetof(BP_GlobalVariablesFunctionLibrary_C_HasCharacterInCollectionByHardcodedName, K2Node_DynamicCast_AsBP_J_RPG_GI_Custom) == 0x000030, "Member 'BP_GlobalVariablesFunctionLibrary_C_HasCharacterInCollectionByHardcodedName::K2Node_DynamicCast_AsBP_J_RPG_GI_Custom' has a wrong offset!");
static_assert(offsetof(BP_GlobalVariablesFunctionLibrary_C_HasCharacterInCollectionByHardcodedName, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'BP_GlobalVariablesFunctionLibrary_C_HasCharacterInCollectionByHardcodedName::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_GlobalVariablesFunctionLibrary_C_HasCharacterInCollectionByHardcodedName, CallFunc_Map_Find_Value) == 0x000040, "Member 'BP_GlobalVariablesFunctionLibrary_C_HasCharacterInCollectionByHardcodedName::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BP_GlobalVariablesFunctionLibrary_C_HasCharacterInCollectionByHardcodedName, CallFunc_Map_Find_ReturnValue) == 0x000048, "Member 'BP_GlobalVariablesFunctionLibrary_C_HasCharacterInCollectionByHardcodedName::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GlobalVariablesFunctionLibrary_C_HasCharacterInCollectionByHardcodedName, CallFunc_GetIsExcluded_Excluded) == 0x000049, "Member 'BP_GlobalVariablesFunctionLibrary_C_HasCharacterInCollectionByHardcodedName::CallFunc_GetIsExcluded_Excluded' has a wrong offset!");
static_assert(offsetof(BP_GlobalVariablesFunctionLibrary_C_HasCharacterInCollectionByHardcodedName, CallFunc_Not_PreBool_ReturnValue) == 0x00004A, "Member 'BP_GlobalVariablesFunctionLibrary_C_HasCharacterInCollectionByHardcodedName::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function BP_GlobalVariablesFunctionLibrary.BP_GlobalVariablesFunctionLibrary_C.HasAtLeastRelationshipLevel
// 0x0020 (0x0020 - 0x0000)
struct BP_GlobalVariablesFunctionLibrary_C_HasAtLeastRelationshipLevel final
{
public:
	E_CharacterList                               Character;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Level;                                             // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetCurrentRelationshipLevel_Level;        // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GlobalVariablesFunctionLibrary_C_HasAtLeastRelationshipLevel) == 0x000008, "Wrong alignment on BP_GlobalVariablesFunctionLibrary_C_HasAtLeastRelationshipLevel");
static_assert(sizeof(BP_GlobalVariablesFunctionLibrary_C_HasAtLeastRelationshipLevel) == 0x000020, "Wrong size on BP_GlobalVariablesFunctionLibrary_C_HasAtLeastRelationshipLevel");
static_assert(offsetof(BP_GlobalVariablesFunctionLibrary_C_HasAtLeastRelationshipLevel, Character) == 0x000000, "Member 'BP_GlobalVariablesFunctionLibrary_C_HasAtLeastRelationshipLevel::Character' has a wrong offset!");
