#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GrappleHook_Rope

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_GrappleHook_Rope.BP_GrappleHook_Rope_C.ExecuteUbergraph_BP_GrappleHook_Rope
// 0x0240 (0x0240 - 0x0000)
struct BP_GrappleHook_Rope_C_ExecuteUbergraph_BP_GrappleHook_Rope final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_RandomFloatInRange_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0010(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x0058(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	double                                        CallFunc_VSize_ReturnValue;                        // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x0158(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0178(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x0190(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue;           // 0x0198(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue_1;      // 0x01B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x01B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x01D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue_1;         // 0x01E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0200(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_SetActorRotation_ReturnValue;          // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_219[0x7];                                      // 0x0219(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0220(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Roll_ImplicitCast;            // 0x0238(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetFloatParameter_Param_ImplicitCast;     // 0x023C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GrappleHook_Rope_C_ExecuteUbergraph_BP_GrappleHook_Rope) == 0x000008, "Wrong alignment on BP_GrappleHook_Rope_C_ExecuteUbergraph_BP_GrappleHook_Rope");
static_assert(sizeof(BP_GrappleHook_Rope_C_ExecuteUbergraph_BP_GrappleHook_Rope) == 0x000240, "Wrong size on BP_GrappleHook_Rope_C_ExecuteUbergraph_BP_GrappleHook_Rope");
static_assert(offsetof(BP_GrappleHook_Rope_C_ExecuteUbergraph_BP_GrappleHook_Rope, EntryPoint) == 0x000000, "Member 'BP_GrappleHook_Rope_C_ExecuteUbergraph_BP_GrappleHook_Rope::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_GrappleHook_Rope_C_ExecuteUbergraph_BP_GrappleHook_Rope, CallFunc_RandomFloatInRange_ReturnValue) == 0x000008, "Member 'BP_GrappleHook_Rope_C_ExecuteUbergraph_BP_GrappleHook_Rope::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GrappleHook_Rope_C_ExecuteUbergraph_BP_GrappleHook_Rope, CallFunc_MakeRotator_ReturnValue) == 0x000010, "Member 'BP_GrappleHook_Rope_C_ExecuteUbergraph_BP_GrappleHook_Rope::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GrappleHook_Rope_C_ExecuteUbergraph_BP_GrappleHook_Rope, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000028, "Member 'BP_GrappleHook_Rope_C_ExecuteUbergraph_BP_GrappleHook_Rope::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GrappleHook_Rope_C_ExecuteUbergraph_BP_GrappleHook_Rope, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000040, "Member 'BP_GrappleHook_Rope_C_ExecuteUbergraph_BP_GrappleHook_Rope::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GrappleHook_Rope_C_ExecuteUbergraph_BP_GrappleHook_Rope, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x000058, "Member 'BP_GrappleHook_Rope_C_ExecuteUbergraph_BP_GrappleHook_Rope::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_GrappleHook_Rope_C_ExecuteUbergraph_BP_GrappleHook_Rope, CallFunc_VSize_ReturnValue) == 0x000150, "Member 'BP_GrappleHook_Rope_C_ExecuteUbergraph_BP_GrappleHook_Rope::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GrappleHook_Rope_C_ExecuteUbergraph_BP_GrappleHook_Rope, CallFunc_Normal_ReturnValue) == 0x000158, "Member 'BP_GrappleHook_Rope_C_ExecuteUbergraph_BP_GrappleHook_Rope::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GrappleHook_Rope_C_ExecuteUbergraph_BP_GrappleHook_Rope, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000170, "Member 'BP_GrappleHook_Rope_C_ExecuteUbergraph_BP_GrappleHook_Rope::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GrappleHook_Rope_C_ExecuteUbergraph_BP_GrappleHook_Rope, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000178, "Member 'BP_GrappleHook_Rope_C_ExecuteUbergraph_BP_GrappleHook_Rope::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GrappleHook_Rope_C_ExecuteUbergraph_BP_GrappleHook_Rope, CallFunc_SpawnSystemAtLocation_ReturnValue) == 0x000190, "Member 'BP_GrappleHook_Rope_C_ExecuteUbergraph_BP_GrappleHook_Rope::CallFunc_SpawnSystemAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GrappleHook_Rope_C_ExecuteUbergraph_BP_GrappleHook_Rope, CallFunc_FindLookAtRotation_ReturnValue) == 0x000198, "Member 'BP_GrappleHook_Rope_C_ExecuteUbergraph_BP_GrappleHook_Rope::CallFunc_FindLookAtRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GrappleHook_Rope_C_ExecuteUbergraph_BP_GrappleHook_Rope, CallFunc_SpawnSystemAtLocation_ReturnValue_1) == 0x0001B0, "Member 'BP_GrappleHook_Rope_C_ExecuteUbergraph_BP_GrappleHook_Rope::CallFunc_SpawnSystemAtLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GrappleHook_Rope_C_ExecuteUbergraph_BP_GrappleHook_Rope, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x0001B8, "Member 'BP_GrappleHook_Rope_C_ExecuteUbergraph_BP_GrappleHook_Rope::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_GrappleHook_Rope_C_ExecuteUbergraph_BP_GrappleHook_Rope, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x0001D0, "Member 'BP_GrappleHook_Rope_C_ExecuteUbergraph_BP_GrappleHook_Rope::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GrappleHook_Rope_C_ExecuteUbergraph_BP_GrappleHook_Rope, CallFunc_FindLookAtRotation_ReturnValue_1) == 0x0001E8, "Member 'BP_GrappleHook_Rope_C_ExecuteUbergraph_BP_GrappleHook_Rope::CallFunc_FindLookAtRotation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GrappleHook_Rope_C_ExecuteUbergraph_BP_GrappleHook_Rope, CallFunc_Multiply_VectorVector_ReturnValue) == 0x000200, "Member 'BP_GrappleHook_Rope_C_ExecuteUbergraph_BP_GrappleHook_Rope::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GrappleHook_Rope_C_ExecuteUbergraph_BP_GrappleHook_Rope, CallFunc_K2_SetActorRotation_ReturnValue) == 0x000218, "Member 'BP_GrappleHook_Rope_C_ExecuteUbergraph_BP_GrappleHook_Rope::CallFunc_K2_SetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GrappleHook_Rope_C_ExecuteUbergraph_BP_GrappleHook_Rope, CallFunc_Add_VectorVector_ReturnValue) == 0x000220, "Member 'BP_GrappleHook_Rope_C_ExecuteUbergraph_BP_GrappleHook_Rope::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GrappleHook_Rope_C_ExecuteUbergraph_BP_GrappleHook_Rope, CallFunc_MakeRotator_Roll_ImplicitCast) == 0x000238, "Member 'BP_GrappleHook_Rope_C_ExecuteUbergraph_BP_GrappleHook_Rope::CallFunc_MakeRotator_Roll_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_GrappleHook_Rope_C_ExecuteUbergraph_BP_GrappleHook_Rope, CallFunc_SetFloatParameter_Param_ImplicitCast) == 0x00023C, "Member 'BP_GrappleHook_Rope_C_ExecuteUbergraph_BP_GrappleHook_Rope::CallFunc_SetFloatParameter_Param_ImplicitCast' has a wrong offset!");

}

