#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GameActionInstance_Conditional

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_GameActionInstance_ChildExecutor_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_GameActionInstance_Conditional.BP_GameActionInstance_Conditional_C
// 0x0010 (0x0058 - 0x0048)
class UBP_GameActionInstance_Conditional_C final : public UBP_GameActionInstance_ChildExecutor_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0048(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          ConditionResult;                                   // 0x0050(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShouldTriggerAutoSave;                             // 0x0051(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteGameAction(const class APlayerController* Controller);
	void ExecuteUbergraph_BP_GameActionInstance_Conditional(int32 EntryPoint);
	void OnChildGameActionFinished(class UGameActionInstance* GameActionInstance);

	class FString GetDebugString() const;
	bool ShouldTriggerAutoSaveAfterExecution() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_GameActionInstance_Conditional_C">();
	}
	static class UBP_GameActionInstance_Conditional_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_GameActionInstance_Conditional_C>();
	}
};
static_assert(alignof(UBP_GameActionInstance_Conditional_C) == 0x000008, "Wrong alignment on UBP_GameActionInstance_Conditional_C");
static_assert(sizeof(UBP_GameActionInstance_Conditional_C) == 0x000058, "Wrong size on UBP_GameActionInstance_Conditional_C");
static_assert(offsetof(UBP_GameActionInstance_Conditional_C, UberGraphFrame) == 0x000048, "Member 'UBP_GameActionInstance_Conditional_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_GameActionInstance_Conditional_C, ConditionResult) == 0x000050, "Member 'UBP_GameActionInstance_Conditional_C::ConditionResult' has a wrong offset!");
static_assert(offsetof(UBP_GameActionInstance_Conditional_C, ShouldTriggerAutoSave) == 0x000051, "Member 'UBP_GameActionInstance_Conditional_C::ShouldTriggerAutoSave' has a wrong offset!");

}

