#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GameActionInstance_DisplayTutorialCard

#include "Basic.hpp"

#include "S_TutorialCardParameters_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_GameActionInstance_DisplayTutorialCard.BP_GameActionInstance_DisplayTutorialCard_C.ExecuteUbergraph_BP_GameActionInstance_DisplayTutorialCard
// 0x0040 (0x0040 - 0x0000)
struct BP_GameActionInstance_DisplayTutorialCard_C_ExecuteUbergraph_BP_GameActionInstance_DisplayTutorialCard final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class APlayerController*                K2Node_Event_Controller;                           // 0x0018(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FS_TutorialCardParameters              CallFunc_GetTutorialCardParameters_TutorialCardParameters; // 0x0020(0x0020)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GameActionInstance_DisplayTutorialCard_C_ExecuteUbergraph_BP_GameActionInstance_DisplayTutorialCard) == 0x000008, "Wrong alignment on BP_GameActionInstance_DisplayTutorialCard_C_ExecuteUbergraph_BP_GameActionInstance_DisplayTutorialCard");
static_assert(sizeof(BP_GameActionInstance_DisplayTutorialCard_C_ExecuteUbergraph_BP_GameActionInstance_DisplayTutorialCard) == 0x000040, "Wrong size on BP_GameActionInstance_DisplayTutorialCard_C_ExecuteUbergraph_BP_GameActionInstance_DisplayTutorialCard");
static_assert(offsetof(BP_GameActionInstance_DisplayTutorialCard_C_ExecuteUbergraph_BP_GameActionInstance_DisplayTutorialCard, EntryPoint) == 0x000000, "Member 'BP_GameActionInstance_DisplayTutorialCard_C_ExecuteUbergraph_BP_GameActionInstance_DisplayTutorialCard::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_DisplayTutorialCard_C_ExecuteUbergraph_BP_GameActionInstance_DisplayTutorialCard, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BP_GameActionInstance_DisplayTutorialCard_C_ExecuteUbergraph_BP_GameActionInstance_DisplayTutorialCard::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_DisplayTutorialCard_C_ExecuteUbergraph_BP_GameActionInstance_DisplayTutorialCard, K2Node_Event_Controller) == 0x000018, "Member 'BP_GameActionInstance_DisplayTutorialCard_C_ExecuteUbergraph_BP_GameActionInstance_DisplayTutorialCard::K2Node_Event_Controller' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_DisplayTutorialCard_C_ExecuteUbergraph_BP_GameActionInstance_DisplayTutorialCard, CallFunc_GetTutorialCardParameters_TutorialCardParameters) == 0x000020, "Member 'BP_GameActionInstance_DisplayTutorialCard_C_ExecuteUbergraph_BP_GameActionInstance_DisplayTutorialCard::CallFunc_GetTutorialCardParameters_TutorialCardParameters' has a wrong offset!");

// Function BP_GameActionInstance_DisplayTutorialCard.BP_GameActionInstance_DisplayTutorialCard_C.ExecuteGameAction
// 0x0008 (0x0008 - 0x0000)
struct BP_GameActionInstance_DisplayTutorialCard_C_ExecuteGameAction final
{
public:
	const class APlayerController*                Controller;                                        // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GameActionInstance_DisplayTutorialCard_C_ExecuteGameAction) == 0x000008, "Wrong alignment on BP_GameActionInstance_DisplayTutorialCard_C_ExecuteGameAction");
static_assert(sizeof(BP_GameActionInstance_DisplayTutorialCard_C_ExecuteGameAction) == 0x000008, "Wrong size on BP_GameActionInstance_DisplayTutorialCard_C_ExecuteGameAction");
static_assert(offsetof(BP_GameActionInstance_DisplayTutorialCard_C_ExecuteGameAction, Controller) == 0x000000, "Member 'BP_GameActionInstance_DisplayTutorialCard_C_ExecuteGameAction::Controller' has a wrong offset!");

// Function BP_GameActionInstance_DisplayTutorialCard.BP_GameActionInstance_DisplayTutorialCard_C.GetTutorialCardParameters
// 0x0030 (0x0030 - 0x0000)
struct BP_GameActionInstance_DisplayTutorialCard_C_GetTutorialCardParameters final
{
public:
	struct FS_TutorialCardParameters              TutorialCardParameters;                            // 0x0000(0x0020)(Parm, OutParm, NoDestructor, HasGetValueTypeHash)
	class UBP_GameAction_DisplayTutorialCard_C*   K2Node_DynamicCast_AsBP_Game_Action_Display_Tutorial_Card; // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GameActionInstance_DisplayTutorialCard_C_GetTutorialCardParameters) == 0x000008, "Wrong alignment on BP_GameActionInstance_DisplayTutorialCard_C_GetTutorialCardParameters");
static_assert(sizeof(BP_GameActionInstance_DisplayTutorialCard_C_GetTutorialCardParameters) == 0x000030, "Wrong size on BP_GameActionInstance_DisplayTutorialCard_C_GetTutorialCardParameters");
static_assert(offsetof(BP_GameActionInstance_DisplayTutorialCard_C_GetTutorialCardParameters, TutorialCardParameters) == 0x000000, "Member 'BP_GameActionInstance_DisplayTutorialCard_C_GetTutorialCardParameters::TutorialCardParameters' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_DisplayTutorialCard_C_GetTutorialCardParameters, K2Node_DynamicCast_AsBP_Game_Action_Display_Tutorial_Card) == 0x000020, "Member 'BP_GameActionInstance_DisplayTutorialCard_C_GetTutorialCardParameters::K2Node_DynamicCast_AsBP_Game_Action_Display_Tutorial_Card' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_DisplayTutorialCard_C_GetTutorialCardParameters, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BP_GameActionInstance_DisplayTutorialCard_C_GetTutorialCardParameters::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BP_GameActionInstance_DisplayTutorialCard.BP_GameActionInstance_DisplayTutorialCard_C.GetDebugString
// 0x0110 (0x0110 - 0x0000)
struct BP_GameActionInstance_DisplayTutorialCard_C_GetDebugString final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
	struct FS_TutorialCardParameters              CallFunc_GetTutorialCardParameters_TutorialCardParameters; // 0x0010(0x0020)(NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0040(0x0010)()
	class FText                                   CallFunc_Conv_NameToText_ReturnValue;              // 0x0050(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0060(0x0048)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00A8(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00F0(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Format_ReturnValue;                       // 0x0100(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GameActionInstance_DisplayTutorialCard_C_GetDebugString) == 0x000008, "Wrong alignment on BP_GameActionInstance_DisplayTutorialCard_C_GetDebugString");
static_assert(sizeof(BP_GameActionInstance_DisplayTutorialCard_C_GetDebugString) == 0x000110, "Wrong size on BP_GameActionInstance_DisplayTutorialCard_C_GetDebugString");
static_assert(offsetof(BP_GameActionInstance_DisplayTutorialCard_C_GetDebugString, ReturnValue) == 0x000000, "Member 'BP_GameActionInstance_DisplayTutorialCard_C_GetDebugString::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_DisplayTutorialCard_C_GetDebugString, CallFunc_GetTutorialCardParameters_TutorialCardParameters) == 0x000010, "Member 'BP_GameActionInstance_DisplayTutorialCard_C_GetDebugString::CallFunc_GetTutorialCardParameters_TutorialCardParameters' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_DisplayTutorialCard_C_GetDebugString, CallFunc_GetDisplayName_ReturnValue) == 0x000030, "Member 'BP_GameActionInstance_DisplayTutorialCard_C_GetDebugString::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_DisplayTutorialCard_C_GetDebugString, CallFunc_Conv_StringToText_ReturnValue) == 0x000040, "Member 'BP_GameActionInstance_DisplayTutorialCard_C_GetDebugString::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_DisplayTutorialCard_C_GetDebugString, CallFunc_Conv_NameToText_ReturnValue) == 0x000050, "Member 'BP_GameActionInstance_DisplayTutorialCard_C_GetDebugString::CallFunc_Conv_NameToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_DisplayTutorialCard_C_GetDebugString, K2Node_MakeStruct_FormatArgumentData) == 0x000060, "Member 'BP_GameActionInstance_DisplayTutorialCard_C_GetDebugString::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_DisplayTutorialCard_C_GetDebugString, K2Node_MakeStruct_FormatArgumentData_1) == 0x0000A8, "Member 'BP_GameActionInstance_DisplayTutorialCard_C_GetDebugString::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_DisplayTutorialCard_C_GetDebugString, K2Node_MakeArray_Array) == 0x0000F0, "Member 'BP_GameActionInstance_DisplayTutorialCard_C_GetDebugString::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_DisplayTutorialCard_C_GetDebugString, CallFunc_Format_ReturnValue) == 0x000100, "Member 'BP_GameActionInstance_DisplayTutorialCard_C_GetDebugString::CallFunc_Format_ReturnValue' has a wrong offset!");

}

