#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GameMenuScene

#include "Basic.hpp"

#include "E_GameMenuPage_structs.hpp"
#include "E_Characters_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SandFall_structs.hpp"
#include "Engine_structs.hpp"
#include "S_jRPG_Item_StaticData_structs.hpp"
#include "S_GameMenuParameters_structs.hpp"
#include "E_WorldMapExplorationCapacity_structs.hpp"
#include "CinematicCamera_structs.hpp"
#include "GameplayCameras_structs.hpp"
#include "E_QuestStatus_structs.hpp"


namespace SDK::Params
{

// Function BP_GameMenuScene.BP_GameMenuScene_C.ApplyCharacterCustomization
// 0x0008 (0x0008 - 0x0000)
struct BP_GameMenuScene_C_ApplyCharacterCustomization final
{
public:
	class UBP_CharacterData_C*                    Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GameMenuScene_C_ApplyCharacterCustomization) == 0x000008, "Wrong alignment on BP_GameMenuScene_C_ApplyCharacterCustomization");
static_assert(sizeof(BP_GameMenuScene_C_ApplyCharacterCustomization) == 0x000008, "Wrong size on BP_GameMenuScene_C_ApplyCharacterCustomization");
static_assert(offsetof(BP_GameMenuScene_C_ApplyCharacterCustomization, Character) == 0x000000, "Member 'BP_GameMenuScene_C_ApplyCharacterCustomization::Character' has a wrong offset!");

// Function BP_GameMenuScene.BP_GameMenuScene_C.ApplyCustomization
// 0x0098 (0x0098 - 0x0000)
struct BP_GameMenuScene_C_ApplyCustomization final
{
public:
	class UBP_CharacterData_C*                    CharacterData;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          HasCostumeChanged;                                 // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HasHaircutChanged;                                 // 0x0009(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetActorForCharacter_Actor;               // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_CharacterSkinComponent_C*           CallFunc_GetComponentByClass_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_SoftClassReference_ReturnValue; // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_SoftClassReference_ReturnValue_1; // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0027(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UChildActorComponent*>           CallFunc_Map_Keys_Keys;                            // 0x0030(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UChildActorComponent*                   CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_CharacterData_C*                    CallFunc_Map_Find_Value;                           // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62[0x6];                                       // 0x0062(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USkeletalMeshComponent*>         CallFunc_GetComponentsByTag_ReturnValue;           // 0x0068(0x0010)(ReferenceParm, ContainsInstancedReference)
	class USkeletalMeshComponent*                 CallFunc_Array_Get_Item_1;                         // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UABP_GameMenu_Characters_C*             K2Node_DynamicCast_AsABP_Game_Menu_Characters;     // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GameMenuScene_C_ApplyCustomization) == 0x000008, "Wrong alignment on BP_GameMenuScene_C_ApplyCustomization");
static_assert(sizeof(BP_GameMenuScene_C_ApplyCustomization) == 0x000098, "Wrong size on BP_GameMenuScene_C_ApplyCustomization");
static_assert(offsetof(BP_GameMenuScene_C_ApplyCustomization, CharacterData) == 0x000000, "Member 'BP_GameMenuScene_C_ApplyCustomization::CharacterData' has a wrong offset!");
static_assert(offsetof(BP_GameMenuScene_C_ApplyCustomization, HasCostumeChanged) == 0x000008, "Member 'BP_GameMenuScene_C_ApplyCustomization::HasCostumeChanged' has a wrong offset!");
static_assert(offsetof(BP_GameMenuScene_C_ApplyCustomization, HasHaircutChanged) == 0x000009, "Member 'BP_GameMenuScene_C_ApplyCustomization::HasHaircutChanged' has a wrong offset!");
static_assert(offsetof(BP_GameMenuScene_C_ApplyCustomization, CallFunc_GetActorForCharacter_Actor) == 0x000010, "Member 'BP_GameMenuScene_C_ApplyCustomization::CallFunc_GetActorForCharacter_Actor' has a wrong offset!");
static_assert(offsetof(BP_GameMenuScene_C_ApplyCustomization, CallFunc_GetComponentByClass_ReturnValue) == 0x000018, "Member 'BP_GameMenuScene_C_ApplyCustomization::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameMenuScene_C_ApplyCustomization, Temp_int_Array_Index_Variable) == 0x000020, "Member 'BP_GameMenuScene_C_ApplyCustomization::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_GameMenuScene_C_ApplyCustomization, CallFunc_EqualEqual_SoftClassReference_ReturnValue) == 0x000024, "Member 'BP_GameMenuScene_C_ApplyCustomization::CallFunc_EqualEqual_SoftClassReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameMenuScene_C_ApplyCustomization, CallFunc_EqualEqual_SoftClassReference_ReturnValue_1) == 0x000025, "Member 'BP_GameMenuScene_C_ApplyCustomization::CallFunc_EqualEqual_SoftClassReference_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GameMenuScene_C_ApplyCustomization, CallFunc_Not_PreBool_ReturnValue) == 0x000026, "Member 'BP_GameMenuScene_C_ApplyCustomization::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameMenuScene_C_ApplyCustomization, CallFunc_Not_PreBool_ReturnValue_1) == 0x000027, "Member 'BP_GameMenuScene_C_ApplyCustomization::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GameMenuScene_C_ApplyCustomization, Temp_int_Loop_Counter_Variable) == 0x000028, "Member 'BP_GameMenuScene_C_ApplyCustomization::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_GameMenuScene_C_ApplyCustomization, CallFunc_Add_IntInt_ReturnValue) == 0x00002C, "Member 'BP_GameMenuScene_C_ApplyCustomization::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameMenuScene_C_ApplyCustomization, CallFunc_Map_Keys_Keys) == 0x000030, "Member 'BP_GameMenuScene_C_ApplyCustomization::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(BP_GameMenuScene_C_ApplyCustomization, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'BP_GameMenuScene_C_ApplyCustomization::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameMenuScene_C_ApplyCustomization, CallFunc_Array_Get_Item) == 0x000048, "Member 'BP_GameMenuScene_C_ApplyCustomization::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_GameMenuScene_C_ApplyCustomization, CallFunc_Less_IntInt_ReturnValue) == 0x000050, "Member 'BP_GameMenuScene_C_ApplyCustomization::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameMenuScene_C_ApplyCustomization, CallFunc_Map_Find_Value) == 0x000058, "Member 'BP_GameMenuScene_C_ApplyCustomization::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BP_GameMenuScene_C_ApplyCustomization, CallFunc_Map_Find_ReturnValue) == 0x000060, "Member 'BP_GameMenuScene_C_ApplyCustomization::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameMenuScene_C_ApplyCustomization, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000061, "Member 'BP_GameMenuScene_C_ApplyCustomization::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameMenuScene_C_ApplyCustomization, CallFunc_GetComponentsByTag_ReturnValue) == 0x000068, "Member 'BP_GameMenuScene_C_ApplyCustomization::CallFunc_GetComponentsByTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameMenuScene_C_ApplyCustomization, CallFunc_Array_Get_Item_1) == 0x000078, "Member 'BP_GameMenuScene_C_ApplyCustomization::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_GameMenuScene_C_ApplyCustomization, CallFunc_GetAnimInstance_ReturnValue) == 0x000080, "Member 'BP_GameMenuScene_C_ApplyCustomization::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameMenuScene_C_ApplyCustomization, K2Node_DynamicCast_AsABP_Game_Menu_Characters) == 0x000088, "Member 'BP_GameMenuScene_C_ApplyCustomization::K2Node_DynamicCast_AsABP_Game_Menu_Characters' has a wrong offset!");
static_assert(offsetof(BP_GameMenuScene_C_ApplyCustomization, K2Node_DynamicCast_bSuccess) == 0x000090, "Member 'BP_GameMenuScene_C_ApplyCustomization::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BP_GameMenuScene.BP_GameMenuScene_C.CleanPreviousSequence
// 0x0010 (0x0010 - 0x0000)
struct BP_GameMenuScene_C_CleanPreviousSequence final
{
public:
	class ULevelSequencePlayer*                   CallFunc_GetSequencePlayer_ReturnValue;            // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GameMenuScene_C_CleanPreviousSequence) == 0x000008, "Wrong alignment on BP_GameMenuScene_C_CleanPreviousSequence");
static_assert(sizeof(BP_GameMenuScene_C_CleanPreviousSequence) == 0x000010, "Wrong size on BP_GameMenuScene_C_CleanPreviousSequence");
static_assert(offsetof(BP_GameMenuScene_C_CleanPreviousSequence, CallFunc_GetSequencePlayer_ReturnValue) == 0x000000, "Member 'BP_GameMenuScene_C_CleanPreviousSequence::CallFunc_GetSequencePlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameMenuScene_C_CleanPreviousSequence, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'BP_GameMenuScene_C_CleanPreviousSequence::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_GameMenuScene.BP_GameMenuScene_C.CreateUIMenu
// 0x0030 (0x0030 - 0x0000)
struct BP_GameMenuScene_C_CreateUIMenu final
{
public:
	struct FS_GameMenuParameters                  GameMenuParameters;                                // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	class UWBP_GameMenu_v3_C*                     CallFunc_Create_ReturnValue;                       // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsNameValid_ReturnValue;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GameMenuScene_C_CreateUIMenu) == 0x000008, "Wrong alignment on BP_GameMenuScene_C_CreateUIMenu");
static_assert(sizeof(BP_GameMenuScene_C_CreateUIMenu) == 0x000030, "Wrong size on BP_GameMenuScene_C_CreateUIMenu");
static_assert(offsetof(BP_GameMenuScene_C_CreateUIMenu, GameMenuParameters) == 0x000000, "Member 'BP_GameMenuScene_C_CreateUIMenu::GameMenuParameters' has a wrong offset!");
static_assert(offsetof(BP_GameMenuScene_C_CreateUIMenu, CallFunc_Create_ReturnValue) == 0x000018, "Member 'BP_GameMenuScene_C_CreateUIMenu::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameMenuScene_C_CreateUIMenu, CallFunc_IsNameValid_ReturnValue) == 0x000020, "Member 'BP_GameMenuScene_C_CreateUIMenu::CallFunc_IsNameValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameMenuScene_C_CreateUIMenu, CallFunc_GetPlayerController_ReturnValue) == 0x000028, "Member 'BP_GameMenuScene_C_CreateUIMenu::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");

// Function BP_GameMenuScene.BP_GameMenuScene_C.DEBUG_SpotlightCharacterVisibility
// 0x0038 (0x0038 - 0x0000)
struct BP_GameMenuScene_C_DEBUG_SpotlightCharacterVisibility final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USpotLightComponent*>            CallFunc_GetComponentsByTag_ReturnValue;           // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USpotLightComponent*                    CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GameMenuScene_C_DEBUG_SpotlightCharacterVisibility) == 0x000008, "Wrong alignment on BP_GameMenuScene_C_DEBUG_SpotlightCharacterVisibility");
static_assert(sizeof(BP_GameMenuScene_C_DEBUG_SpotlightCharacterVisibility) == 0x000038, "Wrong size on BP_GameMenuScene_C_DEBUG_SpotlightCharacterVisibility");
static_assert(offsetof(BP_GameMenuScene_C_DEBUG_SpotlightCharacterVisibility, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BP_GameMenuScene_C_DEBUG_SpotlightCharacterVisibility::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_GameMenuScene_C_DEBUG_SpotlightCharacterVisibility, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_GameMenuScene_C_DEBUG_SpotlightCharacterVisibility::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_GameMenuScene_C_DEBUG_SpotlightCharacterVisibility, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_GameMenuScene_C_DEBUG_SpotlightCharacterVisibility::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameMenuScene_C_DEBUG_SpotlightCharacterVisibility, CallFunc_GetComponentsByTag_ReturnValue) == 0x000010, "Member 'BP_GameMenuScene_C_DEBUG_SpotlightCharacterVisibility::CallFunc_GetComponentsByTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameMenuScene_C_DEBUG_SpotlightCharacterVisibility, CallFunc_Not_PreBool_ReturnValue) == 0x000020, "Member 'BP_GameMenuScene_C_DEBUG_SpotlightCharacterVisibility::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameMenuScene_C_DEBUG_SpotlightCharacterVisibility, CallFunc_Array_Get_Item) == 0x000028, "Member 'BP_GameMenuScene_C_DEBUG_SpotlightCharacterVisibility::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_GameMenuScene_C_DEBUG_SpotlightCharacterVisibility, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'BP_GameMenuScene_C_DEBUG_SpotlightCharacterVisibility::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameMenuScene_C_DEBUG_SpotlightCharacterVisibility, CallFunc_Less_IntInt_ReturnValue) == 0x000034, "Member 'BP_GameMenuScene_C_DEBUG_SpotlightCharacterVisibility::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function BP_GameMenuScene.BP_GameMenuScene_C.EnableGameMenuLighting
// 0x0001 (0x0001 - 0x0000)
struct BP_GameMenuScene_C_EnableGameMenuLighting final
{
public:
	bool                                          bNewVisibility;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GameMenuScene_C_EnableGameMenuLighting) == 0x000001, "Wrong alignment on BP_GameMenuScene_C_EnableGameMenuLighting");
static_assert(sizeof(BP_GameMenuScene_C_EnableGameMenuLighting) == 0x000001, "Wrong size on BP_GameMenuScene_C_EnableGameMenuLighting");
static_assert(offsetof(BP_GameMenuScene_C_EnableGameMenuLighting, bNewVisibility) == 0x000000, "Member 'BP_GameMenuScene_C_EnableGameMenuLighting::bNewVisibility' has a wrong offset!");

// Function BP_GameMenuScene.BP_GameMenuScene_C.EnableGameMenuScene
// 0x0038 (0x0038 - 0x0000)
struct BP_GameMenuScene_C_EnableGameMenuScene final
{
public:
	TArray<class UBP_CharacterData_C*>            CharacterCollection;                               // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<E_WorldMapExplorationCapacity>         UnlockedWorldMapCapacities;                        // 0x0010(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FS_GameMenuParameters                  GameMenuParameters;                                // 0x0020(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(BP_GameMenuScene_C_EnableGameMenuScene) == 0x000008, "Wrong alignment on BP_GameMenuScene_C_EnableGameMenuScene");
static_assert(sizeof(BP_GameMenuScene_C_EnableGameMenuScene) == 0x000038, "Wrong size on BP_GameMenuScene_C_EnableGameMenuScene");
static_assert(offsetof(BP_GameMenuScene_C_EnableGameMenuScene, CharacterCollection) == 0x000000, "Member 'BP_GameMenuScene_C_EnableGameMenuScene::CharacterCollection' has a wrong offset!");
static_assert(offsetof(BP_GameMenuScene_C_EnableGameMenuScene, UnlockedWorldMapCapacities) == 0x000010, "Member 'BP_GameMenuScene_C_EnableGameMenuScene::UnlockedWorldMapCapacities' has a wrong offset!");
static_assert(offsetof(BP_GameMenuScene_C_EnableGameMenuScene, GameMenuParameters) == 0x000020, "Member 'BP_GameMenuScene_C_EnableGameMenuScene::GameMenuParameters' has a wrong offset!");

// Function BP_GameMenuScene.BP_GameMenuScene_C.ExecuteUbergraph_BP_GameMenuScene
// 0x0830 (0x0830 - 0x0000)
struct BP_GameMenuScene_C_ExecuteUbergraph_BP_GameMenuScene final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FQuestObjectiveIdentifier              CallFunc_CreateQuestObjectiveIdentifier_ReturnValue; // 0x0004(0x0010)(NoDestructor)
	struct FQuestObjectiveIdentifier              CallFunc_CreateQuestObjectiveIdentifier_ReturnValue_1; // 0x0014(0x0010)(NoDestructor)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 Temp_class_Variable;                               // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class ABP_GameMenuScene_C>     CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue; // 0x0030(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	class UClass*                                 K2Node_ClassDynamicCast_AsBP_Weapon_Skin;          // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidClass_ReturnValue;                 // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62[0x6];                                       // 0x0062(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCameraTrackingFocusSettings           K2Node_MakeStruct_CameraTrackingFocusSettings;     // 0x0068(0x0048)()
	class UBP_jRPG_GI_Custom_C*                   CallFunc_GetCustomGI_ReturnValue;                  // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UBP_CharacterData_C*>            CallFunc_GetCharacterCollection_Characters;        // 0x00B8(0x0010)(ReferenceParm)
	class UBP_CharacterData_C*                    K2Node_CustomEvent_Character_1;                    // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAC_jRPG_CharactersManager_C*           CallFunc_GetComponentByClass_ReturnValue;          // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UBP_jRPG_GI_Custom_C*                   CallFunc_GetCustomGI_ReturnValue_1;                // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UBP_CharacterData_C*>            CallFunc_GetCharacterCollection_Characters_1;      // 0x00E8(0x0010)(ReferenceParm)
	TSubclassOf<class UObject>                    K2Node_CustomEvent_Loaded;                         // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	E_GameMenuPage                                K2Node_CustomEvent_MenuPage;                       // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_CharacterData_C*                    K2Node_CustomEvent_CurrentCharacter;               // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCineCameraComponent*                   K2Node_CustomEvent_CameraToMoveTo;                 // 0x0110(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0118(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0130(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue_1;     // 0x0190(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x01F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UCineCameraComponent*>           CallFunc_K2_GetComponentsByClass_ReturnValue;      // 0x01F8(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_20C[0x4];                                      // 0x020C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0210(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21C[0x4];                                      // 0x021C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCineCameraComponent*                   CallFunc_Array_Get_Item;                           // 0x0220(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0228(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22C[0x4];                                      // 0x022C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_UINavigationComponent_C*            CallFunc_GetUINavigationComponent_ReturnValue;     // 0x0230(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0238(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23C[0x4];                                      // 0x023C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_CharacterData_C*                    K2Node_CustomEvent_Character;                      // 0x0240(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_249[0x3];                                      // 0x0249(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x024C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UBP_CharacterData_C*>            K2Node_CustomEvent_CharacterCollection;            // 0x0250(0x0010)(ReferenceParm)
	TArray<E_WorldMapExplorationCapacity>         K2Node_CustomEvent_UnlockedWorldMapCapacities;     // 0x0260(0x0010)(ConstParm, ReferenceParm)
	struct FS_GameMenuParameters                  K2Node_CustomEvent_GameMenuParameters;             // 0x0270(0x0018)(HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x0288(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_3;        // 0x0290(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FCameraAnimationParams                 K2Node_MakeStruct_CameraAnimationParams;           // 0x0298(0x0048)(NoDestructor)
	class ABP_CineCharacter_Main_C*               K2Node_DynamicCast_AsBP_Cine_Character_Main;       // 0x02E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x02E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E9[0x7];                                      // 0x02E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x02F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_2;    // 0x0308(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0320(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_VSize_ReturnValue;                        // 0x0338(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCameraFocusSettings                   K2Node_MakeStruct_CameraFocusSettings;             // 0x0340(0x0060)()
	TArray<class USpotLightComponent*>            CallFunc_GetComponentsByTag_ReturnValue;           // 0x03A0(0x0010)(ReferenceParm, ContainsInstancedReference)
	class USpotLightComponent*                    CallFunc_Array_Get_Item_1;                         // 0x03B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x03B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x03BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x03BD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BE[0x2];                                      // 0x03BE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class APostProcessVolume*                     K2Node_DynamicCast_AsPost_Process_Volume;          // 0x03C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x03C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C9[0x7];                                      // 0x03C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APostProcessVolume*                     K2Node_DynamicCast_AsPost_Process_Volume_1;        // 0x03D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x03D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D9[0x7];                                      // 0x03D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameplayCamerasSubsystem*              CallFunc_GetWorldSubsystem_ReturnValue;            // 0x03E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APostProcessVolume*                     K2Node_DynamicCast_AsPost_Process_Volume_2;        // 0x03E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x03F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F1[0x1];                                      // 0x03F1(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCameraAnimationHandle                 CallFunc_PlayCameraAnimation_ReturnValue;          // 0x03F2(0x0004)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F6[0x2];                                      // 0x03F6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameplayCamerasSubsystem*              CallFunc_GetWorldSubsystem_ReturnValue_1;          // 0x03F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_CineCharacter_Main_C*               K2Node_DynamicCast_AsBP_Cine_Character_Main_1;     // 0x0400(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0408(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_409[0x7];                                      // 0x0409(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_jRPG_Item_StaticData                K2Node_CustomEvent_S_jRPG_Item_StaticData;         // 0x0410(0x0130)(ConstParm, ContainsInstancedReference, HasGetValueTypeHash)
	class UBP_CharacterData_C*                    K2Node_CustomEvent_CurrentCharacterData;           // 0x0540(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_3;    // 0x0548(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   CallFunc_GetChildActorComponentForCharacter_Value; // 0x0560(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_1;      // 0x0568(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_VSize_ReturnValue_1;                      // 0x0580(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_CineCharacter_Main_C*               K2Node_DynamicCast_AsBP_Cine_Character_Main_2;     // 0x0588(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0590(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_591[0x7];                                      // 0x0591(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCameraFocusSettings                   K2Node_MakeStruct_CameraFocusSettings_1;           // 0x0598(0x0060)()
	class UBP_DataAsset_Weapon_C*                 K2Node_DynamicCast_AsBP_Data_Asset_Weapon;         // 0x05F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x0600(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_601[0x7];                                      // 0x0601(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_4;        // 0x0608(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftClassReference_ReturnValue;    // 0x0610(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_611[0x7];                                      // 0x0611(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_5;        // 0x0618(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_6;        // 0x0620(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_7;        // 0x0628(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_InPageName;                     // 0x0630(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0638(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_QuestSystem_C*                      CallFunc_GetQuestSystem_QuestSystem;               // 0x0650(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	E_QuestStatus                                 CallFunc_GetObjectiveStatus_Status;                // 0x0658(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_659[0x7];                                      // 0x0659(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Lerp_ReturnValue;                         // 0x0660(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0668(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_669[0x7];                                      // 0x0669(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_QuestSystem_C*                      CallFunc_GetQuestSystem_QuestSystem_1;             // 0x0670(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_678[0x8];                                      // 0x0678(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_TLerp_ReturnValue;                        // 0x0680(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_QuestStatus                                 CallFunc_GetObjectiveStatus_Status_1;              // 0x06E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6E1[0x7];                                      // 0x06E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetWorldTransform_SweepHitResult;      // 0x06E8(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x07E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7E1[0x3];                                      // 0x07E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x07E4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(TSubclassOf<class UObject> Loaded)> K2Node_CreateDelegate_OutputDelegate_1;       // 0x07F4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_804[0x4];                                      // 0x0804(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Lerp_B_ImplicitCast;                      // 0x0808(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_A_ImplicitCast;                      // 0x0810(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_ManualFocusDistance_ImplicitCast; // 0x0818(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_ManualFocusDistance_ImplicitCast_1; // 0x081C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_Alpha_ImplicitCast;                  // 0x0820(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetCurrentFocalLength_InFocalLength_ImplicitCast; // 0x0828(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GameMenuScene_C_ExecuteUbergraph_BP_GameMenuScene) == 0x000010, "Wrong alignment on BP_GameMenuScene_C_ExecuteUbergraph_BP_GameMenuScene");
static_assert(sizeof(BP_GameMenuScene_C_ExecuteUbergraph_BP_GameMenuScene) == 0x000830, "Wrong size on BP_GameMenuScene_C_ExecuteUbergraph_BP_GameMenuScene");
static_assert(offsetof(BP_GameMenuScene_C_ExecuteUbergraph_BP_GameMenuScene, EntryPoint) == 0x000000, "Member 'BP_GameMenuScene_C_ExecuteUbergraph_BP_GameMenuScene::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_GameMenuScene_C_ExecuteUbergraph_BP_GameMenuScene, CallFunc_CreateQuestObjectiveIdentifier_ReturnValue) == 0x000004, "Member 'BP_GameMenuScene_C_ExecuteUbergraph_BP_GameMenuScene::CallFunc_CreateQuestObjectiveIdentifier_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameMenuScene_C_ExecuteUbergraph_BP_GameMenuScene, CallFunc_CreateQuestObjectiveIdentifier_ReturnValue_1) == 0x000014, "Member 'BP_GameMenuScene_C_ExecuteUbergraph_BP_GameMenuScene::CallFunc_CreateQuestObjectiveIdentifier_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GameMenuScene_C_ExecuteUbergraph_BP_GameMenuScene, Temp_class_Variable) == 0x000028, "Member 'BP_GameMenuScene_C_ExecuteUbergraph_BP_GameMenuScene::Temp_class_Variable' has a wrong offset!");
static_assert(offsetof(BP_GameMenuScene_C_ExecuteUbergraph_BP_GameMenuScene, CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue) == 0x000030, "Member 'BP_GameMenuScene_C_ExecuteUbergraph_BP_GameMenuScene::CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameMenuScene_C_ExecuteUbergraph_BP_GameMenuScene, K2Node_ClassDynamicCast_AsBP_Weapon_Skin) == 0x000058, "Member 'BP_GameMenuScene_C_ExecuteUbergraph_BP_GameMenuScene::K2Node_ClassDynamicCast_AsBP_Weapon_Skin' has a wrong offset!");
static_assert(offsetof(BP_GameMenuScene_C_ExecuteUbergraph_BP_GameMenuScene, K2Node_ClassDynamicCast_bSuccess) == 0x000060, "Member 'BP_GameMenuScene_C_ExecuteUbergraph_BP_GameMenuScene::K2Node_ClassDynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_GameMenuScene_C_ExecuteUbergraph_BP_GameMenuScene, CallFunc_IsValidClass_ReturnValue) == 0x000061, "Member 'BP_GameMenuScene_C_ExecuteUbergraph_BP_GameMenuScene::CallFunc_IsValidClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameMenuScene_C_ExecuteUbergraph_BP_GameMenuScene, K2Node_MakeStruct_CameraTrackingFocusSettings) == 0x000068, "Member 'BP_GameMenuScene_C_ExecuteUbergraph_BP_GameMenuScene::K2Node_MakeStruct_CameraTrackingFocusSettings' has a wrong offset!");
static_assert(offsetof(BP_GameMenuScene_C_ExecuteUbergraph_BP_GameMenuScene, CallFunc_GetCustomGI_ReturnValue) == 0x0000B0, "Member 'BP_GameMenuScene_C_ExecuteUbergraph_BP_GameMenuScene::CallFunc_GetCustomGI_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameMenuScene_C_ExecuteUbergraph_BP_GameMenuScene, CallFunc_GetCharacterCollection_Characters) == 0x0000B8, "Member 'BP_GameMenuScene_C_ExecuteUbergraph_BP_GameMenuScene::CallFunc_GetCharacterCollection_Characters' has a wrong offset!");
static_assert(offsetof(BP_GameMenuScene_C_ExecuteUbergraph_BP_GameMenuScene, K2Node_CustomEvent_Character_1) == 0x0000C8, "Member 'BP_GameMenuScene_C_ExecuteUbergraph_BP_GameMenuScene::K2Node_CustomEvent_Character_1' has a wrong offset!");
static_assert(offsetof(BP_GameMenuScene_C_ExecuteUbergraph_BP_GameMenuScene, CallFunc_GetPlayerController_ReturnValue) == 0x0000D0, "Member 'BP_GameMenuScene_C_ExecuteUbergraph_BP_GameMenuScene::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameMenuScene_C_ExecuteUbergraph_BP_GameMenuScene, CallFunc_GetComponentByClass_ReturnValue) == 0x0000D8, "Member 'BP_GameMenuScene_C_ExecuteUbergraph_BP_GameMenuScene::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameMenuScene_C_ExecuteUbergraph_BP_GameMenuScene, CallFunc_GetCustomGI_ReturnValue_1) == 0x0000E0, "Member 'BP_GameMenuScene_C_ExecuteUbergraph_BP_GameMenuScene::CallFunc_GetCustomGI_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GameMenuScene_C_ExecuteUbergraph_BP_GameMenuScene, CallFunc_GetCharacterCollection_Characters_1) == 0x0000E8, "Member 'BP_GameMenuScene_C_ExecuteUbergraph_BP_GameMenuScene::CallFunc_GetCharacterCollection_Characters_1' has a wrong offset!");
static_assert(offsetof(BP_GameMenuScene_C_ExecuteUbergraph_BP_GameMenuScene, K2Node_CustomEvent_Loaded) == 0x0000F8, "Member 'BP_GameMenuScene_C_ExecuteUbergraph_BP_GameMenuScene::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(BP_GameMenuScene_C_ExecuteUbergraph_BP_GameMenuScene, K2Node_CustomEvent_MenuPage) == 0x000100, "Member 'BP_GameMenuScene_C_ExecuteUbergraph_BP_GameMenuScene::K2Node_CustomEvent_MenuPage' has a wrong offset!");
static_assert(offsetof(BP_GameMenuScene_C_ExecuteUbergraph_BP_GameMenuScene, K2Node_CustomEvent_CurrentCharacter) == 0x000108, "Member 'BP_GameMenuScene_C_ExecuteUbergraph_BP_GameMenuScene::K2Node_CustomEvent_CurrentCharacter' has a wrong offset!");
static_assert(offsetof(BP_GameMenuScene_C_ExecuteUbergraph_BP_GameMenuScene, K2Node_CustomEvent_CameraToMoveTo) == 0x000110, "Member 'BP_GameMenuScene_C_ExecuteUbergraph_BP_GameMenuScene::K2Node_CustomEvent_CameraToMoveTo' has a wrong offset!");
static_assert(offsetof(BP_GameMenuScene_C_ExecuteUbergraph_BP_GameMenuScene, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000118, "Member 'BP_GameMenuScene_C_ExecuteUbergraph_BP_GameMenuScene::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameMenuScene_C_ExecuteUbergraph_BP_GameMenuScene, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x000130, "Member 'BP_GameMenuScene_C_ExecuteUbergraph_BP_GameMenuScene::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameMenuScene_C_ExecuteUbergraph_BP_GameMenuScene, CallFunc_K2_GetComponentToWorld_ReturnValue_1) == 0x000190, "Member 'BP_GameMenuScene_C_ExecuteUbergraph_BP_GameMenuScene::CallFunc_K2_GetComponentToWorld_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GameMenuScene_C_ExecuteUbergraph_BP_GameMenuScene, Temp_int_Loop_Counter_Variable) == 0x0001F0, "Member 'BP_GameMenuScene_C_ExecuteUbergraph_BP_GameMenuScene::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_GameMenuScene_C_ExecuteUbergraph_BP_GameMenuScene, CallFunc_Add_IntInt_ReturnValue) == 0x0001F4, "Member 'BP_GameMenuScene_C_ExecuteUbergraph_BP_GameMenuScene::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameMenuScene_C_ExecuteUbergraph_BP_GameMenuScene, CallFunc_K2_GetComponentsByClass_ReturnValue) == 0x0001F8, "Member 'BP_GameMenuScene_C_ExecuteUbergraph_BP_GameMenuScene::CallFunc_K2_GetComponentsByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameMenuScene_C_ExecuteUbergraph_BP_GameMenuScene, CallFunc_Array_Length_ReturnValue) == 0x000208, "Member 'BP_GameMenuScene_C_ExecuteUbergraph_BP_GameMenuScene::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameMenuScene_C_ExecuteUbergraph_BP_GameMenuScene, CallFunc_GetPlayerController_ReturnValue_1) == 0x000210, "Member 'BP_GameMenuScene_C_ExecuteUbergraph_BP_GameMenuScene::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GameMenuScene_C_ExecuteUbergraph_BP_GameMenuScene, Temp_int_Array_Index_Variable) == 0x000218, "Member 'BP_GameMenuScene_C_ExecuteUbergraph_BP_GameMenuScene::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_GameMenuScene_C_ExecuteUbergraph_BP_GameMenuScene, CallFunc_Array_Get_Item) == 0x000220, "Member 'BP_GameMenuScene_C_ExecuteUbergraph_BP_GameMenuScene::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_GameMenuScene_C_ExecuteUbergraph_BP_GameMenuScene, Temp_int_Array_Index_Variable_1) == 0x000228, "Member 'BP_GameMenuScene_C_ExecuteUbergraph_BP_GameMenuScene::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_GameMenuScene_C_ExecuteUbergraph_BP_GameMenuScene, CallFunc_GetUINavigationComponent_ReturnValue) == 0x000230, "Member 'BP_GameMenuScene_C_ExecuteUbergraph_BP_GameMenuScene::CallFunc_GetUINavigationComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameMenuScene_C_ExecuteUbergraph_BP_GameMenuScene, Temp_int_Loop_Counter_Variable_1) == 0x000238, "Member 'BP_GameMenuScene_C_ExecuteUbergraph_BP_GameMenuScene::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_GameMenuScene_C_ExecuteUbergraph_BP_GameMenuScene, K2Node_CustomEvent_Character) == 0x000240, "Member 'BP_GameMenuScene_C_ExecuteUbergraph_BP_GameMenuScene::K2Node_CustomEvent_Character' has a wrong offset!");
static_assert(offsetof(BP_GameMenuScene_C_ExecuteUbergraph_BP_GameMenuScene, CallFunc_Less_IntInt_ReturnValue) == 0x000248, "Member 'BP_GameMenuScene_C_ExecuteUbergraph_BP_GameMenuScene::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameMenuScene_C_ExecuteUbergraph_BP_GameMenuScene, CallFunc_Add_IntInt_ReturnValue_1) == 0x00024C, "Member 'BP_GameMenuScene_C_ExecuteUbergraph_BP_GameMenuScene::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GameMenuScene_C_ExecuteUbergraph_BP_GameMenuScene, K2Node_CustomEvent_CharacterCollection) == 0x000250, "Member 'BP_GameMenuScene_C_ExecuteUbergraph_BP_GameMenuScene::K2Node_CustomEvent_CharacterCollection' has a wrong offset!");
static_assert(offsetof(BP_GameMenuScene_C_ExecuteUbergraph_BP_GameMenuScene, K2Node_CustomEvent_UnlockedWorldMapCapacities) == 0x000260, "Member 'BP_GameMenuScene_C_ExecuteUbergraph_BP_GameMenuScene::K2Node_CustomEvent_UnlockedWorldMapCapacities' has a wrong offset!");
static_assert(offsetof(BP_GameMenuScene_C_ExecuteUbergraph_BP_GameMenuScene, K2Node_CustomEvent_GameMenuParameters) == 0x000270, "Member 'BP_GameMenuScene_C_ExecuteUbergraph_BP_GameMenuScene::K2Node_CustomEvent_GameMenuParameters' has a wrong offset!");
static_assert(offsetof(BP_GameMenuScene_C_ExecuteUbergraph_BP_GameMenuScene, CallFunc_GetPlayerController_ReturnValue_2) == 0x000288, "Member 'BP_GameMenuScene_C_ExecuteUbergraph_BP_GameMenuScene::CallFunc_GetPlayerController_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_GameMenuScene_C_ExecuteUbergraph_BP_GameMenuScene, CallFunc_GetPlayerController_ReturnValue_3) == 0x000290, "Member 'BP_GameMenuScene_C_ExecuteUbergraph_BP_GameMenuScene::CallFunc_GetPlayerController_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_GameMenuScene_C_ExecuteUbergraph_BP_GameMenuScene, K2Node_MakeStruct_CameraAnimationParams) == 0x000298, "Member 'BP_GameMenuScene_C_ExecuteUbergraph_BP_GameMenuScene::K2Node_MakeStruct_CameraAnimationParams' has a wrong offset!");
static_assert(offsetof(BP_GameMenuScene_C_ExecuteUbergraph_BP_GameMenuScene, K2Node_DynamicCast_AsBP_Cine_Character_Main) == 0x0002E0, "Member 'BP_GameMenuScene_C_ExecuteUbergraph_BP_GameMenuScene::K2Node_DynamicCast_AsBP_Cine_Character_Main' has a wrong offset!");
static_assert(offsetof(BP_GameMenuScene_C_ExecuteUbergraph_BP_GameMenuScene, K2Node_DynamicCast_bSuccess) == 0x0002E8, "Member 'BP_GameMenuScene_C_ExecuteUbergraph_BP_GameMenuScene::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_GameMenuScene_C_ExecuteUbergraph_BP_GameMenuScene, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x0002F0, "Member 'BP_GameMenuScene_C_ExecuteUbergraph_BP_GameMenuScene::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GameMenuScene_C_ExecuteUbergraph_BP_GameMenuScene, CallFunc_K2_GetComponentLocation_ReturnValue_2) == 0x000308, "Member 'BP_GameMenuScene_C_ExecuteUbergraph_BP_GameMenuScene::CallFunc_K2_GetComponentLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_GameMenuScene_C_ExecuteUbergraph_BP_GameMenuScene, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000320, "Member 'BP_GameMenuScene_C_ExecuteUbergraph_BP_GameMenuScene::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameMenuScene_C_ExecuteUbergraph_BP_GameMenuScene, CallFunc_VSize_ReturnValue) == 0x000338, "Member 'BP_GameMenuScene_C_ExecuteUbergraph_BP_GameMenuScene::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameMenuScene_C_ExecuteUbergraph_BP_GameMenuScene, K2Node_MakeStruct_CameraFocusSettings) == 0x000340, "Member 'BP_GameMenuScene_C_ExecuteUbergraph_BP_GameMenuScene::K2Node_MakeStruct_CameraFocusSettings' has a wrong offset!");
static_assert(offsetof(BP_GameMenuScene_C_ExecuteUbergraph_BP_GameMenuScene, CallFunc_GetComponentsByTag_ReturnValue) == 0x0003A0, "Member 'BP_GameMenuScene_C_ExecuteUbergraph_BP_GameMenuScene::CallFunc_GetComponentsByTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameMenuScene_C_ExecuteUbergraph_BP_GameMenuScene, CallFunc_Array_Get_Item_1) == 0x0003B0, "Member 'BP_GameMenuScene_C_ExecuteUbergraph_BP_GameMenuScene::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_GameMenuScene_C_ExecuteUbergraph_BP_GameMenuScene, CallFunc_Array_Length_ReturnValue_1) == 0x0003B8, "Member 'BP_GameMenuScene_C_ExecuteUbergraph_BP_GameMenuScene::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GameMenuScene_C_ExecuteUbergraph_BP_GameMenuScene, CallFunc_Less_IntInt_ReturnValue_1) == 0x0003BC, "Member 'BP_GameMenuScene_C_ExecuteUbergraph_BP_GameMenuScene::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GameMenuScene_C_ExecuteUbergraph_BP_GameMenuScene, CallFunc_Not_PreBool_ReturnValue) == 0x0003BD, "Member 'BP_GameMenuScene_C_ExecuteUbergraph_BP_GameMenuScene::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameMenuScene_C_ExecuteUbergraph_BP_GameMenuScene, K2Node_DynamicCast_AsPost_Process_Volume) == 0x0003C0, "Member 'BP_GameMenuScene_C_ExecuteUbergraph_BP_GameMenuScene::K2Node_DynamicCast_AsPost_Process_Volume' has a wrong offset!");
static_assert(offsetof(BP_GameMenuScene_C_ExecuteUbergraph_BP_GameMenuScene, K2Node_DynamicCast_bSuccess_1) == 0x0003C8, "Member 'BP_GameMenuScene_C_ExecuteUbergraph_BP_GameMenuScene::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_GameMenuScene_C_ExecuteUbergraph_BP_GameMenuScene, K2Node_DynamicCast_AsPost_Process_Volume_1) == 0x0003D0, "Member 'BP_GameMenuScene_C_ExecuteUbergraph_BP_GameMenuScene::K2Node_DynamicCast_AsPost_Process_Volume_1' has a wrong offset!");
static_assert(offsetof(BP_GameMenuScene_C_ExecuteUbergraph_BP_GameMenuScene, K2Node_DynamicCast_bSuccess_2) == 0x0003D8, "Member 'BP_GameMenuScene_C_ExecuteUbergraph_BP_GameMenuScene::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_GameMenuScene_C_ExecuteUbergraph_BP_GameMenuScene, CallFunc_GetWorldSubsystem_ReturnValue) == 0x0003E0, "Member 'BP_GameMenuScene_C_ExecuteUbergraph_BP_GameMenuScene::CallFunc_GetWorldSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameMenuScene_C_ExecuteUbergraph_BP_GameMenuScene, K2Node_DynamicCast_AsPost_Process_Volume_2) == 0x0003E8, "Member 'BP_GameMenuScene_C_ExecuteUbergraph_BP_GameMenuScene::K2Node_DynamicCast_AsPost_Process_Volume_2' has a wrong offset!");
static_assert(offsetof(BP_GameMenuScene_C_ExecuteUbergraph_BP_GameMenuScene, K2Node_DynamicCast_bSuccess_3) == 0x0003F0, "Member 'BP_GameMenuScene_C_ExecuteUbergraph_BP_GameMenuScene::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BP_GameMenuScene_C_ExecuteUbergraph_BP_GameMenuScene, CallFunc_PlayCameraAnimation_ReturnValue) == 0x0003F2, "Member 'BP_GameMenuScene_C_ExecuteUbergraph_BP_GameMenuScene::CallFunc_PlayCameraAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameMenuScene_C_ExecuteUbergraph_BP_GameMenuScene, CallFunc_GetWorldSubsystem_ReturnValue_1) == 0x0003F8, "Member 'BP_GameMenuScene_C_ExecuteUbergraph_BP_GameMenuScene::CallFunc_GetWorldSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GameMenuScene_C_ExecuteUbergraph_BP_GameMenuScene, K2Node_DynamicCast_AsBP_Cine_Character_Main_1) == 0x000400, "Member 'BP_GameMenuScene_C_ExecuteUbergraph_BP_GameMenuScene::K2Node_DynamicCast_AsBP_Cine_Character_Main_1' has a wrong offset!");
