#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GroupingPolicy_UniqueMechanic_Stances

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_GroupingPolicy_UniqueMechanic_Stances.BP_GroupingPolicy_UniqueMechanic_Stances_C.InitGroupPolicy
// 0x0038 (0x0038 - 0x0000)
struct BP_GroupingPolicy_UniqueMechanic_Stances_C_InitGroupPolicy final
{
public:
	class UBP_GroupInstance_UniqueMechanic_Stances_C* CallFunc_SpawnObject_ReturnValue;              // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_GroupInstance_UniqueMechanic_Stances_C* CallFunc_SpawnObject_ReturnValue_1;            // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue_1;             // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetEnumeratorValueFromIndex_ReturnValue;  // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23[0x1];                                       // 0x0023(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_GroupInstance_UniqueMechanic_Stances_C* CallFunc_SpawnObject_ReturnValue_2;            // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue;               // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GroupingPolicy_UniqueMechanic_Stances_C_InitGroupPolicy) == 0x000008, "Wrong alignment on BP_GroupingPolicy_UniqueMechanic_Stances_C_InitGroupPolicy");
static_assert(sizeof(BP_GroupingPolicy_UniqueMechanic_Stances_C_InitGroupPolicy) == 0x000038, "Wrong size on BP_GroupingPolicy_UniqueMechanic_Stances_C_InitGroupPolicy");
static_assert(offsetof(BP_GroupingPolicy_UniqueMechanic_Stances_C_InitGroupPolicy, CallFunc_SpawnObject_ReturnValue) == 0x000000, "Member 'BP_GroupingPolicy_UniqueMechanic_Stances_C_InitGroupPolicy::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GroupingPolicy_UniqueMechanic_Stances_C_InitGroupPolicy, CallFunc_SpawnObject_ReturnValue_1) == 0x000008, "Member 'BP_GroupingPolicy_UniqueMechanic_Stances_C_InitGroupPolicy::CallFunc_SpawnObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GroupingPolicy_UniqueMechanic_Stances_C_InitGroupPolicy, Temp_int_Variable) == 0x000010, "Member 'BP_GroupingPolicy_UniqueMechanic_Stances_C_InitGroupPolicy::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_GroupingPolicy_UniqueMechanic_Stances_C_InitGroupPolicy, Temp_int_Variable_1) == 0x000014, "Member 'BP_GroupingPolicy_UniqueMechanic_Stances_C_InitGroupPolicy::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_GroupingPolicy_UniqueMechanic_Stances_C_InitGroupPolicy, CallFunc_Conv_IntToByte_ReturnValue) == 0x000018, "Member 'BP_GroupingPolicy_UniqueMechanic_Stances_C_InitGroupPolicy::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GroupingPolicy_UniqueMechanic_Stances_C_InitGroupPolicy, CallFunc_Add_IntInt_ReturnValue) == 0x00001C, "Member 'BP_GroupingPolicy_UniqueMechanic_Stances_C_InitGroupPolicy::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GroupingPolicy_UniqueMechanic_Stances_C_InitGroupPolicy, CallFunc_GetValidValue_ReturnValue) == 0x000020, "Member 'BP_GroupingPolicy_UniqueMechanic_Stances_C_InitGroupPolicy::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GroupingPolicy_UniqueMechanic_Stances_C_InitGroupPolicy, CallFunc_Conv_IntToByte_ReturnValue_1) == 0x000021, "Member 'BP_GroupingPolicy_UniqueMechanic_Stances_C_InitGroupPolicy::CallFunc_Conv_IntToByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GroupingPolicy_UniqueMechanic_Stances_C_InitGroupPolicy, CallFunc_GetEnumeratorValueFromIndex_ReturnValue) == 0x000022, "Member 'BP_GroupingPolicy_UniqueMechanic_Stances_C_InitGroupPolicy::CallFunc_GetEnumeratorValueFromIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GroupingPolicy_UniqueMechanic_Stances_C_InitGroupPolicy, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000024, "Member 'BP_GroupingPolicy_UniqueMechanic_Stances_C_InitGroupPolicy::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GroupingPolicy_UniqueMechanic_Stances_C_InitGroupPolicy, CallFunc_SpawnObject_ReturnValue_2) == 0x000028, "Member 'BP_GroupingPolicy_UniqueMechanic_Stances_C_InitGroupPolicy::CallFunc_SpawnObject_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_GroupingPolicy_UniqueMechanic_Stances_C_InitGroupPolicy, CallFunc_MakeLiteralInt_ReturnValue) == 0x000030, "Member 'BP_GroupingPolicy_UniqueMechanic_Stances_C_InitGroupPolicy::CallFunc_MakeLiteralInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GroupingPolicy_UniqueMechanic_Stances_C_InitGroupPolicy, CallFunc_Less_IntInt_ReturnValue) == 0x000034, "Member 'BP_GroupingPolicy_UniqueMechanic_Stances_C_InitGroupPolicy::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

}

