#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GameActionInstance_WritePersistentFlag

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_GameActionInstance_WritePersistentFlag.BP_GameActionInstance_WritePersistentFlag_C.ExecuteUbergraph_BP_GameActionInstance_WritePersistentFlag
// 0x0038 (0x0038 - 0x0000)
struct BP_GameActionInstance_WritePersistentFlag_C_ExecuteUbergraph_BP_GameActionInstance_WritePersistentFlag final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class APlayerController*                K2Node_Event_Controller;                           // 0x0008(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_jRPG_Controller_World_C*            K2Node_DynamicCast_AsBP_J_RPG_Controller_World;    // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_GameAction_WritePersistentFlag_C*   K2Node_DynamicCast_AsWrite_Persistent_Flag;        // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_jRPG_GI_Custom_C*                   CallFunc_GetCustomGameInstance_BP_J_RPG_GI_Custom; // 0x0030(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(BP_GameActionInstance_WritePersistentFlag_C_ExecuteUbergraph_BP_GameActionInstance_WritePersistentFlag) == 0x000008, "Wrong alignment on BP_GameActionInstance_WritePersistentFlag_C_ExecuteUbergraph_BP_GameActionInstance_WritePersistentFlag");
static_assert(sizeof(BP_GameActionInstance_WritePersistentFlag_C_ExecuteUbergraph_BP_GameActionInstance_WritePersistentFlag) == 0x000038, "Wrong size on BP_GameActionInstance_WritePersistentFlag_C_ExecuteUbergraph_BP_GameActionInstance_WritePersistentFlag");
static_assert(offsetof(BP_GameActionInstance_WritePersistentFlag_C_ExecuteUbergraph_BP_GameActionInstance_WritePersistentFlag, EntryPoint) == 0x000000, "Member 'BP_GameActionInstance_WritePersistentFlag_C_ExecuteUbergraph_BP_GameActionInstance_WritePersistentFlag::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_WritePersistentFlag_C_ExecuteUbergraph_BP_GameActionInstance_WritePersistentFlag, K2Node_Event_Controller) == 0x000008, "Member 'BP_GameActionInstance_WritePersistentFlag_C_ExecuteUbergraph_BP_GameActionInstance_WritePersistentFlag::K2Node_Event_Controller' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_WritePersistentFlag_C_ExecuteUbergraph_BP_GameActionInstance_WritePersistentFlag, K2Node_DynamicCast_AsBP_J_RPG_Controller_World) == 0x000010, "Member 'BP_GameActionInstance_WritePersistentFlag_C_ExecuteUbergraph_BP_GameActionInstance_WritePersistentFlag::K2Node_DynamicCast_AsBP_J_RPG_Controller_World' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_WritePersistentFlag_C_ExecuteUbergraph_BP_GameActionInstance_WritePersistentFlag, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_GameActionInstance_WritePersistentFlag_C_ExecuteUbergraph_BP_GameActionInstance_WritePersistentFlag::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_WritePersistentFlag_C_ExecuteUbergraph_BP_GameActionInstance_WritePersistentFlag, K2Node_DynamicCast_AsWrite_Persistent_Flag) == 0x000020, "Member 'BP_GameActionInstance_WritePersistentFlag_C_ExecuteUbergraph_BP_GameActionInstance_WritePersistentFlag::K2Node_DynamicCast_AsWrite_Persistent_Flag' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_WritePersistentFlag_C_ExecuteUbergraph_BP_GameActionInstance_WritePersistentFlag, K2Node_DynamicCast_bSuccess_1) == 0x000028, "Member 'BP_GameActionInstance_WritePersistentFlag_C_ExecuteUbergraph_BP_GameActionInstance_WritePersistentFlag::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_WritePersistentFlag_C_ExecuteUbergraph_BP_GameActionInstance_WritePersistentFlag, CallFunc_GetCustomGameInstance_BP_J_RPG_GI_Custom) == 0x000030, "Member 'BP_GameActionInstance_WritePersistentFlag_C_ExecuteUbergraph_BP_GameActionInstance_WritePersistentFlag::CallFunc_GetCustomGameInstance_BP_J_RPG_GI_Custom' has a wrong offset!");

// Function BP_GameActionInstance_WritePersistentFlag.BP_GameActionInstance_WritePersistentFlag_C.ExecuteGameAction
// 0x0008 (0x0008 - 0x0000)
struct BP_GameActionInstance_WritePersistentFlag_C_ExecuteGameAction final
{
public:
	const class APlayerController*                Controller;                                        // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GameActionInstance_WritePersistentFlag_C_ExecuteGameAction) == 0x000008, "Wrong alignment on BP_GameActionInstance_WritePersistentFlag_C_ExecuteGameAction");
static_assert(sizeof(BP_GameActionInstance_WritePersistentFlag_C_ExecuteGameAction) == 0x000008, "Wrong size on BP_GameActionInstance_WritePersistentFlag_C_ExecuteGameAction");
static_assert(offsetof(BP_GameActionInstance_WritePersistentFlag_C_ExecuteGameAction, Controller) == 0x000000, "Member 'BP_GameActionInstance_WritePersistentFlag_C_ExecuteGameAction::Controller' has a wrong offset!");

// Function BP_GameActionInstance_WritePersistentFlag.BP_GameActionInstance_WritePersistentFlag_C.GetDebugString
// 0x0140 (0x0140 - 0x0000)
struct BP_GameActionInstance_WritePersistentFlag_C_GetDebugString final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDebugString_ReturnValue;               // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UBP_GameAction_WritePersistentFlag_C*   K2Node_DynamicCast_AsWrite_Persistent_Flag;        // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_PadString_Result;                         // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue_1;             // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0060(0x0010)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0070(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0080(0x0048)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00C8(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0110(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Format_ReturnValue;                       // 0x0120(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0130(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GameActionInstance_WritePersistentFlag_C_GetDebugString) == 0x000008, "Wrong alignment on BP_GameActionInstance_WritePersistentFlag_C_GetDebugString");
static_assert(sizeof(BP_GameActionInstance_WritePersistentFlag_C_GetDebugString) == 0x000140, "Wrong size on BP_GameActionInstance_WritePersistentFlag_C_GetDebugString");
static_assert(offsetof(BP_GameActionInstance_WritePersistentFlag_C_GetDebugString, ReturnValue) == 0x000000, "Member 'BP_GameActionInstance_WritePersistentFlag_C_GetDebugString::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_WritePersistentFlag_C_GetDebugString, CallFunc_GetDebugString_ReturnValue) == 0x000010, "Member 'BP_GameActionInstance_WritePersistentFlag_C_GetDebugString::CallFunc_GetDebugString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_WritePersistentFlag_C_GetDebugString, K2Node_DynamicCast_AsWrite_Persistent_Flag) == 0x000020, "Member 'BP_GameActionInstance_WritePersistentFlag_C_GetDebugString::K2Node_DynamicCast_AsWrite_Persistent_Flag' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_WritePersistentFlag_C_GetDebugString, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BP_GameActionInstance_WritePersistentFlag_C_GetDebugString::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_WritePersistentFlag_C_GetDebugString, CallFunc_PadString_Result) == 0x000030, "Member 'BP_GameActionInstance_WritePersistentFlag_C_GetDebugString::CallFunc_PadString_Result' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_WritePersistentFlag_C_GetDebugString, CallFunc_GetDisplayName_ReturnValue) == 0x000040, "Member 'BP_GameActionInstance_WritePersistentFlag_C_GetDebugString::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_WritePersistentFlag_C_GetDebugString, CallFunc_GetDisplayName_ReturnValue_1) == 0x000050, "Member 'BP_GameActionInstance_WritePersistentFlag_C_GetDebugString::CallFunc_GetDisplayName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_WritePersistentFlag_C_GetDebugString, CallFunc_Conv_StringToText_ReturnValue) == 0x000060, "Member 'BP_GameActionInstance_WritePersistentFlag_C_GetDebugString::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_WritePersistentFlag_C_GetDebugString, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000070, "Member 'BP_GameActionInstance_WritePersistentFlag_C_GetDebugString::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_WritePersistentFlag_C_GetDebugString, K2Node_MakeStruct_FormatArgumentData) == 0x000080, "Member 'BP_GameActionInstance_WritePersistentFlag_C_GetDebugString::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_WritePersistentFlag_C_GetDebugString, K2Node_MakeStruct_FormatArgumentData_1) == 0x0000C8, "Member 'BP_GameActionInstance_WritePersistentFlag_C_GetDebugString::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_WritePersistentFlag_C_GetDebugString, K2Node_MakeArray_Array) == 0x000110, "Member 'BP_GameActionInstance_WritePersistentFlag_C_GetDebugString::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_WritePersistentFlag_C_GetDebugString, CallFunc_Format_ReturnValue) == 0x000120, "Member 'BP_GameActionInstance_WritePersistentFlag_C_GetDebugString::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_WritePersistentFlag_C_GetDebugString, CallFunc_Concat_StrStr_ReturnValue) == 0x000130, "Member 'BP_GameActionInstance_WritePersistentFlag_C_GetDebugString::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");

}

