#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GeneratedItemInfo_UpgradableItem

#include "Basic.hpp"

#include "BP_GeneratedItemInfo_Item_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_GeneratedItemInfo_UpgradableItem.BP_GeneratedItemInfo_UpgradableItem_C
// 0x0010 (0x0178 - 0x0168)
class UBP_GeneratedItemInfo_UpgradableItem_C final : public UBP_GeneratedItemInfo_Item_C
{
public:
	int32                                         PreviousLevel;                                     // 0x0168(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                         CurrentLevel;                                      // 0x016C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                         ConvertedChromaValue;                              // 0x0170(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void GetConvertedChromaValue(int32* BonusChroma);
	void GetCurrentLevel(int32* CurrentLevel_0);
	void GetPreviousLevel(int32* CurrentLevel_0);
	void IsConvertedToChroma(bool* bIsConvertedToChroma);
	bool IsUpgrade();
	void SetUpgradeInfo(int32 CurrentLevel_0, int32 PreviousLevel_0, class UBP_GeneratedItemInfo_UpgradableItem_C** SelfRef);
	bool ShouldShowQuantity();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_GeneratedItemInfo_UpgradableItem_C">();
	}
	static class UBP_GeneratedItemInfo_UpgradableItem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_GeneratedItemInfo_UpgradableItem_C>();
	}
};
static_assert(alignof(UBP_GeneratedItemInfo_UpgradableItem_C) == 0x000008, "Wrong alignment on UBP_GeneratedItemInfo_UpgradableItem_C");
static_assert(sizeof(UBP_GeneratedItemInfo_UpgradableItem_C) == 0x000178, "Wrong size on UBP_GeneratedItemInfo_UpgradableItem_C");
static_assert(offsetof(UBP_GeneratedItemInfo_UpgradableItem_C, PreviousLevel) == 0x000168, "Member 'UBP_GeneratedItemInfo_UpgradableItem_C::PreviousLevel' has a wrong offset!");
static_assert(offsetof(UBP_GeneratedItemInfo_UpgradableItem_C, CurrentLevel) == 0x00016C, "Member 'UBP_GeneratedItemInfo_UpgradableItem_C::CurrentLevel' has a wrong offset!");
static_assert(offsetof(UBP_GeneratedItemInfo_UpgradableItem_C, ConvertedChromaValue) == 0x000170, "Member 'UBP_GeneratedItemInfo_UpgradableItem_C::ConvertedChromaValue' has a wrong offset!");

}

