#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GroupingPolicy_UniqueMechanic_Stains

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_GroupingPolicy_UniqueMechanic_Stains.BP_GroupingPolicy_UniqueMechanic_Stains_C.InitGroupPolicy
// 0x0020 (0x0020 - 0x0000)
struct BP_GroupingPolicy_UniqueMechanic_Stains_C_InitGroupPolicy final
{
public:
	class UBP_GroupInstance_UniqueMechanic_Stains_C* CallFunc_SpawnObject_ReturnValue;               // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_GroupInstance_UniqueMechanic_Stains_C* CallFunc_SpawnObject_ReturnValue_1;             // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_GroupInstance_UniqueMechanic_Stains_C* CallFunc_SpawnObject_ReturnValue_2;             // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_GroupInstance_UniqueMechanic_Stains_C* CallFunc_SpawnObject_ReturnValue_3;             // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GroupingPolicy_UniqueMechanic_Stains_C_InitGroupPolicy) == 0x000008, "Wrong alignment on BP_GroupingPolicy_UniqueMechanic_Stains_C_InitGroupPolicy");
static_assert(sizeof(BP_GroupingPolicy_UniqueMechanic_Stains_C_InitGroupPolicy) == 0x000020, "Wrong size on BP_GroupingPolicy_UniqueMechanic_Stains_C_InitGroupPolicy");
static_assert(offsetof(BP_GroupingPolicy_UniqueMechanic_Stains_C_InitGroupPolicy, CallFunc_SpawnObject_ReturnValue) == 0x000000, "Member 'BP_GroupingPolicy_UniqueMechanic_Stains_C_InitGroupPolicy::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GroupingPolicy_UniqueMechanic_Stains_C_InitGroupPolicy, CallFunc_SpawnObject_ReturnValue_1) == 0x000008, "Member 'BP_GroupingPolicy_UniqueMechanic_Stains_C_InitGroupPolicy::CallFunc_SpawnObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GroupingPolicy_UniqueMechanic_Stains_C_InitGroupPolicy, CallFunc_SpawnObject_ReturnValue_2) == 0x000010, "Member 'BP_GroupingPolicy_UniqueMechanic_Stains_C_InitGroupPolicy::CallFunc_SpawnObject_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_GroupingPolicy_UniqueMechanic_Stains_C_InitGroupPolicy, CallFunc_SpawnObject_ReturnValue_3) == 0x000018, "Member 'BP_GroupingPolicy_UniqueMechanic_Stains_C_InitGroupPolicy::CallFunc_SpawnObject_ReturnValue_3' has a wrong offset!");

}

