#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GameActionInstance_ReplaceCharacter

#include "Basic.hpp"

#include "E_jRPG_ItemType_structs.hpp"
#include "FEquipmentSlot_structs.hpp"
#include "S_ReplaceCharacterParameters_structs.hpp"
#include "S_jRPG_CharacterSaveState_structs.hpp"


namespace SDK::Params
{

// Function BP_GameActionInstance_ReplaceCharacter.BP_GameActionInstance_ReplaceCharacter_C.AddNewCharacterToCollection
// 0x0028 (0x0028 - 0x0000)
struct BP_GameActionInstance_ReplaceCharacter_C_AddNewCharacterToCollection final
{
public:
	class UAC_jRPG_InventoryManager_C*            CallFunc_GetInventoryManager_ReturnValue;          // 0x0000(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UBP_jRPG_GI_Custom_C*                   CallFunc_GetCustomGI_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_CharacterData_C*                    CallFunc_GetCharacterByID_CharacterData;           // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAC_jRPG_CharactersManager_C*           CallFunc_GetComponentByClass_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GameActionInstance_ReplaceCharacter_C_AddNewCharacterToCollection) == 0x000008, "Wrong alignment on BP_GameActionInstance_ReplaceCharacter_C_AddNewCharacterToCollection");
static_assert(sizeof(BP_GameActionInstance_ReplaceCharacter_C_AddNewCharacterToCollection) == 0x000028, "Wrong size on BP_GameActionInstance_ReplaceCharacter_C_AddNewCharacterToCollection");
static_assert(offsetof(BP_GameActionInstance_ReplaceCharacter_C_AddNewCharacterToCollection, CallFunc_GetInventoryManager_ReturnValue) == 0x000000, "Member 'BP_GameActionInstance_ReplaceCharacter_C_AddNewCharacterToCollection::CallFunc_GetInventoryManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_ReplaceCharacter_C_AddNewCharacterToCollection, CallFunc_GetCustomGI_ReturnValue) == 0x000008, "Member 'BP_GameActionInstance_ReplaceCharacter_C_AddNewCharacterToCollection::CallFunc_GetCustomGI_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_ReplaceCharacter_C_AddNewCharacterToCollection, CallFunc_GetPlayerController_ReturnValue) == 0x000010, "Member 'BP_GameActionInstance_ReplaceCharacter_C_AddNewCharacterToCollection::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_ReplaceCharacter_C_AddNewCharacterToCollection, CallFunc_GetCharacterByID_CharacterData) == 0x000018, "Member 'BP_GameActionInstance_ReplaceCharacter_C_AddNewCharacterToCollection::CallFunc_GetCharacterByID_CharacterData' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_ReplaceCharacter_C_AddNewCharacterToCollection, CallFunc_GetComponentByClass_ReturnValue) == 0x000020, "Member 'BP_GameActionInstance_ReplaceCharacter_C_AddNewCharacterToCollection::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");

// Function BP_GameActionInstance_ReplaceCharacter.BP_GameActionInstance_ReplaceCharacter_C.AddNewCharacterToPartyIfNeeded
// 0x0020 (0x0020 - 0x0000)
struct BP_GameActionInstance_ReplaceCharacter_C_AddNewCharacterToPartyIfNeeded final
{
public:
	struct FS_ReplaceCharacterParameters          CallFunc_GetReplaceCharacterParameters_ReplaceCharacterParameters; // 0x0000(0x0009)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAC_jRPG_CharactersManager_C*           CallFunc_GetComponentByClass_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GameActionInstance_ReplaceCharacter_C_AddNewCharacterToPartyIfNeeded) == 0x000008, "Wrong alignment on BP_GameActionInstance_ReplaceCharacter_C_AddNewCharacterToPartyIfNeeded");
static_assert(sizeof(BP_GameActionInstance_ReplaceCharacter_C_AddNewCharacterToPartyIfNeeded) == 0x000020, "Wrong size on BP_GameActionInstance_ReplaceCharacter_C_AddNewCharacterToPartyIfNeeded");
static_assert(offsetof(BP_GameActionInstance_ReplaceCharacter_C_AddNewCharacterToPartyIfNeeded, CallFunc_GetReplaceCharacterParameters_ReplaceCharacterParameters) == 0x000000, "Member 'BP_GameActionInstance_ReplaceCharacter_C_AddNewCharacterToPartyIfNeeded::CallFunc_GetReplaceCharacterParameters_ReplaceCharacterParameters' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_ReplaceCharacter_C_AddNewCharacterToPartyIfNeeded, CallFunc_GetPlayerController_ReturnValue) == 0x000010, "Member 'BP_GameActionInstance_ReplaceCharacter_C_AddNewCharacterToPartyIfNeeded::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_ReplaceCharacter_C_AddNewCharacterToPartyIfNeeded, CallFunc_GetComponentByClass_ReturnValue) == 0x000018, "Member 'BP_GameActionInstance_ReplaceCharacter_C_AddNewCharacterToPartyIfNeeded::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");

// Function BP_GameActionInstance_ReplaceCharacter.BP_GameActionInstance_ReplaceCharacter_C.ComputeNewCharacterSaveState
// 0x03B0 (0x03B0 - 0x0000)
struct BP_GameActionInstance_ReplaceCharacter_C_ComputeNewCharacterSaveState final
{
public:
	struct FS_ReplaceCharacterParameters          CallFunc_GetReplaceCharacterParameters_ReplaceCharacterParameters; // 0x0000(0x0009)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetCharacterIDs_OldCharacter;             // 0x000C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetCharacterIDs_NewCharacter;             // 0x0014(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_jRPG_CharacterSaveState             CallFunc_GetDataTableRowFromName_OutRow;           // 0x0020(0x01C0)(HasGetValueTypeHash)
	class UBP_jRPG_GI_Custom_C*                   CallFunc_GetCustomGI_ReturnValue;                  // 0x01E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_CharacterData_C*                    CallFunc_GetCharacterByID_CharacterData;           // 0x01E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FS_jRPG_CharacterSaveState             CallFunc_SaveCharacterState_StructOut;             // 0x01F0(0x01C0)(HasGetValueTypeHash)
};
static_assert(alignof(BP_GameActionInstance_ReplaceCharacter_C_ComputeNewCharacterSaveState) == 0x000008, "Wrong alignment on BP_GameActionInstance_ReplaceCharacter_C_ComputeNewCharacterSaveState");
static_assert(sizeof(BP_GameActionInstance_ReplaceCharacter_C_ComputeNewCharacterSaveState) == 0x0003B0, "Wrong size on BP_GameActionInstance_ReplaceCharacter_C_ComputeNewCharacterSaveState");
static_assert(offsetof(BP_GameActionInstance_ReplaceCharacter_C_ComputeNewCharacterSaveState, CallFunc_GetReplaceCharacterParameters_ReplaceCharacterParameters) == 0x000000, "Member 'BP_GameActionInstance_ReplaceCharacter_C_ComputeNewCharacterSaveState::CallFunc_GetReplaceCharacterParameters_ReplaceCharacterParameters' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_ReplaceCharacter_C_ComputeNewCharacterSaveState, CallFunc_GetCharacterIDs_OldCharacter) == 0x00000C, "Member 'BP_GameActionInstance_ReplaceCharacter_C_ComputeNewCharacterSaveState::CallFunc_GetCharacterIDs_OldCharacter' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_ReplaceCharacter_C_ComputeNewCharacterSaveState, CallFunc_GetCharacterIDs_NewCharacter) == 0x000014, "Member 'BP_GameActionInstance_ReplaceCharacter_C_ComputeNewCharacterSaveState::CallFunc_GetCharacterIDs_NewCharacter' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_ReplaceCharacter_C_ComputeNewCharacterSaveState, CallFunc_GetDataTableRowFromName_OutRow) == 0x000020, "Member 'BP_GameActionInstance_ReplaceCharacter_C_ComputeNewCharacterSaveState::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_ReplaceCharacter_C_ComputeNewCharacterSaveState, CallFunc_GetCustomGI_ReturnValue) == 0x0001E0, "Member 'BP_GameActionInstance_ReplaceCharacter_C_ComputeNewCharacterSaveState::CallFunc_GetCustomGI_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_ReplaceCharacter_C_ComputeNewCharacterSaveState, CallFunc_GetCharacterByID_CharacterData) == 0x0001E8, "Member 'BP_GameActionInstance_ReplaceCharacter_C_ComputeNewCharacterSaveState::CallFunc_GetCharacterByID_CharacterData' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_ReplaceCharacter_C_ComputeNewCharacterSaveState, CallFunc_SaveCharacterState_StructOut) == 0x0001F0, "Member 'BP_GameActionInstance_ReplaceCharacter_C_ComputeNewCharacterSaveState::CallFunc_SaveCharacterState_StructOut' has a wrong offset!");

// Function BP_GameActionInstance_ReplaceCharacter.BP_GameActionInstance_ReplaceCharacter_C.ExecuteGameAction
// 0x0008 (0x0008 - 0x0000)
struct BP_GameActionInstance_ReplaceCharacter_C_ExecuteGameAction final
{
public:
	const class APlayerController*                Controller;                                        // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GameActionInstance_ReplaceCharacter_C_ExecuteGameAction) == 0x000008, "Wrong alignment on BP_GameActionInstance_ReplaceCharacter_C_ExecuteGameAction");
static_assert(sizeof(BP_GameActionInstance_ReplaceCharacter_C_ExecuteGameAction) == 0x000008, "Wrong size on BP_GameActionInstance_ReplaceCharacter_C_ExecuteGameAction");
static_assert(offsetof(BP_GameActionInstance_ReplaceCharacter_C_ExecuteGameAction, Controller) == 0x000000, "Member 'BP_GameActionInstance_ReplaceCharacter_C_ExecuteGameAction::Controller' has a wrong offset!");

// Function BP_GameActionInstance_ReplaceCharacter.BP_GameActionInstance_ReplaceCharacter_C.ExecuteUbergraph_BP_GameActionInstance_ReplaceCharacter
// 0x0010 (0x0010 - 0x0000)
struct BP_GameActionInstance_ReplaceCharacter_C_ExecuteUbergraph_BP_GameActionInstance_ReplaceCharacter final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class APlayerController*                K2Node_Event_Controller;                           // 0x0008(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GameActionInstance_ReplaceCharacter_C_ExecuteUbergraph_BP_GameActionInstance_ReplaceCharacter) == 0x000008, "Wrong alignment on BP_GameActionInstance_ReplaceCharacter_C_ExecuteUbergraph_BP_GameActionInstance_ReplaceCharacter");
static_assert(sizeof(BP_GameActionInstance_ReplaceCharacter_C_ExecuteUbergraph_BP_GameActionInstance_ReplaceCharacter) == 0x000010, "Wrong size on BP_GameActionInstance_ReplaceCharacter_C_ExecuteUbergraph_BP_GameActionInstance_ReplaceCharacter");
static_assert(offsetof(BP_GameActionInstance_ReplaceCharacter_C_ExecuteUbergraph_BP_GameActionInstance_ReplaceCharacter, EntryPoint) == 0x000000, "Member 'BP_GameActionInstance_ReplaceCharacter_C_ExecuteUbergraph_BP_GameActionInstance_ReplaceCharacter::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_ReplaceCharacter_C_ExecuteUbergraph_BP_GameActionInstance_ReplaceCharacter, K2Node_Event_Controller) == 0x000008, "Member 'BP_GameActionInstance_ReplaceCharacter_C_ExecuteUbergraph_BP_GameActionInstance_ReplaceCharacter::K2Node_Event_Controller' has a wrong offset!");

// Function BP_GameActionInstance_ReplaceCharacter.BP_GameActionInstance_ReplaceCharacter_C.GetCharacterIDs
// 0x002C (0x002C - 0x0000)
struct BP_GameActionInstance_ReplaceCharacter_C_GetCharacterIDs final
{
public:
	class FName                                   OldCharacter;                                      // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   NewCharacter;                                      // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_ReplaceCharacterParameters          CallFunc_GetReplaceCharacterParameters_ReplaceCharacterParameters; // 0x0010(0x0009)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetCharacterID_FromEnum_ReturnValue;      // 0x001C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetCharacterID_FromEnum_ReturnValue_1;    // 0x0024(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GameActionInstance_ReplaceCharacter_C_GetCharacterIDs) == 0x000004, "Wrong alignment on BP_GameActionInstance_ReplaceCharacter_C_GetCharacterIDs");
static_assert(sizeof(BP_GameActionInstance_ReplaceCharacter_C_GetCharacterIDs) == 0x00002C, "Wrong size on BP_GameActionInstance_ReplaceCharacter_C_GetCharacterIDs");
static_assert(offsetof(BP_GameActionInstance_ReplaceCharacter_C_GetCharacterIDs, OldCharacter) == 0x000000, "Member 'BP_GameActionInstance_ReplaceCharacter_C_GetCharacterIDs::OldCharacter' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_ReplaceCharacter_C_GetCharacterIDs, NewCharacter) == 0x000008, "Member 'BP_GameActionInstance_ReplaceCharacter_C_GetCharacterIDs::NewCharacter' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_ReplaceCharacter_C_GetCharacterIDs, CallFunc_GetReplaceCharacterParameters_ReplaceCharacterParameters) == 0x000010, "Member 'BP_GameActionInstance_ReplaceCharacter_C_GetCharacterIDs::CallFunc_GetReplaceCharacterParameters_ReplaceCharacterParameters' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_ReplaceCharacter_C_GetCharacterIDs, CallFunc_GetCharacterID_FromEnum_ReturnValue) == 0x00001C, "Member 'BP_GameActionInstance_ReplaceCharacter_C_GetCharacterIDs::CallFunc_GetCharacterID_FromEnum_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_ReplaceCharacter_C_GetCharacterIDs, CallFunc_GetCharacterID_FromEnum_ReturnValue_1) == 0x000024, "Member 'BP_GameActionInstance_ReplaceCharacter_C_GetCharacterIDs::CallFunc_GetCharacterID_FromEnum_ReturnValue_1' has a wrong offset!");

// Function BP_GameActionInstance_ReplaceCharacter.BP_GameActionInstance_ReplaceCharacter_C.GetReplaceCharacterParameters
// 0x0020 (0x0020 - 0x0000)
struct BP_GameActionInstance_ReplaceCharacter_C_GetReplaceCharacterParameters final
{
public:
	struct FS_ReplaceCharacterParameters          ReplaceCharacterParameters;                        // 0x0000(0x0009)(Parm, OutParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_GameAction_ReplaceCharacter_C*      K2Node_DynamicCast_AsReplace_Character;            // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GameActionInstance_ReplaceCharacter_C_GetReplaceCharacterParameters) == 0x000008, "Wrong alignment on BP_GameActionInstance_ReplaceCharacter_C_GetReplaceCharacterParameters");
static_assert(sizeof(BP_GameActionInstance_ReplaceCharacter_C_GetReplaceCharacterParameters) == 0x000020, "Wrong size on BP_GameActionInstance_ReplaceCharacter_C_GetReplaceCharacterParameters");
static_assert(offsetof(BP_GameActionInstance_ReplaceCharacter_C_GetReplaceCharacterParameters, ReplaceCharacterParameters) == 0x000000, "Member 'BP_GameActionInstance_ReplaceCharacter_C_GetReplaceCharacterParameters::ReplaceCharacterParameters' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_ReplaceCharacter_C_GetReplaceCharacterParameters, K2Node_DynamicCast_AsReplace_Character) == 0x000010, "Member 'BP_GameActionInstance_ReplaceCharacter_C_GetReplaceCharacterParameters::K2Node_DynamicCast_AsReplace_Character' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_ReplaceCharacter_C_GetReplaceCharacterParameters, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_GameActionInstance_ReplaceCharacter_C_GetReplaceCharacterParameters::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BP_GameActionInstance_ReplaceCharacter.BP_GameActionInstance_ReplaceCharacter_C.RemoveOldCharacterFromCollection
// 0x0010 (0x0010 - 0x0000)
struct BP_GameActionInstance_ReplaceCharacter_C_RemoveOldCharacterFromCollection final
{
public:
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAC_jRPG_CharactersManager_C*           CallFunc_GetComponentByClass_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GameActionInstance_ReplaceCharacter_C_RemoveOldCharacterFromCollection) == 0x000008, "Wrong alignment on BP_GameActionInstance_ReplaceCharacter_C_RemoveOldCharacterFromCollection");
static_assert(sizeof(BP_GameActionInstance_ReplaceCharacter_C_RemoveOldCharacterFromCollection) == 0x000010, "Wrong size on BP_GameActionInstance_ReplaceCharacter_C_RemoveOldCharacterFromCollection");
static_assert(offsetof(BP_GameActionInstance_ReplaceCharacter_C_RemoveOldCharacterFromCollection, CallFunc_GetPlayerController_ReturnValue) == 0x000000, "Member 'BP_GameActionInstance_ReplaceCharacter_C_RemoveOldCharacterFromCollection::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_ReplaceCharacter_C_RemoveOldCharacterFromCollection, CallFunc_GetComponentByClass_ReturnValue) == 0x000008, "Member 'BP_GameActionInstance_ReplaceCharacter_C_RemoveOldCharacterFromCollection::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");

// Function BP_GameActionInstance_ReplaceCharacter.BP_GameActionInstance_ReplaceCharacter_C.ReplaceEquippedItemsFromOldToNew
// 0x00C8 (0x00C8 - 0x0000)
struct BP_GameActionInstance_ReplaceCharacter_C_ReplaceEquippedItemsFromOldToNew final
{
public:
	E_jRPG_ItemType                               ItemType;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<struct FFEquipmentSlot, class FName>     local_Equipment;                                   // 0x0008(0x0050)(Edit, BlueprintVisible)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFEquipmentSlot>                CallFunc_Map_Keys_Keys;                            // 0x0068(0x0010)(ReferenceParm)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_85[0x3];                                       // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFEquipmentSlot                        CallFunc_Array_Get_Item;                           // 0x008C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFEquipmentSlot>                CallFunc_Map_Keys_Keys_1;                          // 0x0098(0x0010)(ReferenceParm)
	class FName                                   CallFunc_Map_Find_Value;                           // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x3];                                       // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFEquipmentSlot                        CallFunc_Array_Get_Item_1;                         // 0x00B4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Remove_ReturnValue;                   // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BD[0x3];                                       // 0x00BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00C5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x00C6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GameActionInstance_ReplaceCharacter_C_ReplaceEquippedItemsFromOldToNew) == 0x000008, "Wrong alignment on BP_GameActionInstance_ReplaceCharacter_C_ReplaceEquippedItemsFromOldToNew");
static_assert(sizeof(BP_GameActionInstance_ReplaceCharacter_C_ReplaceEquippedItemsFromOldToNew) == 0x0000C8, "Wrong size on BP_GameActionInstance_ReplaceCharacter_C_ReplaceEquippedItemsFromOldToNew");
static_assert(offsetof(BP_GameActionInstance_ReplaceCharacter_C_ReplaceEquippedItemsFromOldToNew, ItemType) == 0x000000, "Member 'BP_GameActionInstance_ReplaceCharacter_C_ReplaceEquippedItemsFromOldToNew::ItemType' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_ReplaceCharacter_C_ReplaceEquippedItemsFromOldToNew, local_Equipment) == 0x000008, "Member 'BP_GameActionInstance_ReplaceCharacter_C_ReplaceEquippedItemsFromOldToNew::local_Equipment' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_ReplaceCharacter_C_ReplaceEquippedItemsFromOldToNew, Temp_int_Array_Index_Variable) == 0x000058, "Member 'BP_GameActionInstance_ReplaceCharacter_C_ReplaceEquippedItemsFromOldToNew::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_ReplaceCharacter_C_ReplaceEquippedItemsFromOldToNew, Temp_int_Loop_Counter_Variable) == 0x00005C, "Member 'BP_GameActionInstance_ReplaceCharacter_C_ReplaceEquippedItemsFromOldToNew::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_ReplaceCharacter_C_ReplaceEquippedItemsFromOldToNew, CallFunc_Add_IntInt_ReturnValue) == 0x000060, "Member 'BP_GameActionInstance_ReplaceCharacter_C_ReplaceEquippedItemsFromOldToNew::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_ReplaceCharacter_C_ReplaceEquippedItemsFromOldToNew, CallFunc_Map_Keys_Keys) == 0x000068, "Member 'BP_GameActionInstance_ReplaceCharacter_C_ReplaceEquippedItemsFromOldToNew::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_ReplaceCharacter_C_ReplaceEquippedItemsFromOldToNew, Temp_int_Loop_Counter_Variable_1) == 0x000078, "Member 'BP_GameActionInstance_ReplaceCharacter_C_ReplaceEquippedItemsFromOldToNew::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_ReplaceCharacter_C_ReplaceEquippedItemsFromOldToNew, CallFunc_Array_Length_ReturnValue) == 0x00007C, "Member 'BP_GameActionInstance_ReplaceCharacter_C_ReplaceEquippedItemsFromOldToNew::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_ReplaceCharacter_C_ReplaceEquippedItemsFromOldToNew, CallFunc_Add_IntInt_ReturnValue_1) == 0x000080, "Member 'BP_GameActionInstance_ReplaceCharacter_C_ReplaceEquippedItemsFromOldToNew::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_ReplaceCharacter_C_ReplaceEquippedItemsFromOldToNew, CallFunc_Less_IntInt_ReturnValue) == 0x000084, "Member 'BP_GameActionInstance_ReplaceCharacter_C_ReplaceEquippedItemsFromOldToNew::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_ReplaceCharacter_C_ReplaceEquippedItemsFromOldToNew, Temp_int_Array_Index_Variable_1) == 0x000088, "Member 'BP_GameActionInstance_ReplaceCharacter_C_ReplaceEquippedItemsFromOldToNew::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_ReplaceCharacter_C_ReplaceEquippedItemsFromOldToNew, CallFunc_Array_Get_Item) == 0x00008C, "Member 'BP_GameActionInstance_ReplaceCharacter_C_ReplaceEquippedItemsFromOldToNew::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_ReplaceCharacter_C_ReplaceEquippedItemsFromOldToNew, CallFunc_Map_Keys_Keys_1) == 0x000098, "Member 'BP_GameActionInstance_ReplaceCharacter_C_ReplaceEquippedItemsFromOldToNew::CallFunc_Map_Keys_Keys_1' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_ReplaceCharacter_C_ReplaceEquippedItemsFromOldToNew, CallFunc_Map_Find_Value) == 0x0000A8, "Member 'BP_GameActionInstance_ReplaceCharacter_C_ReplaceEquippedItemsFromOldToNew::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_ReplaceCharacter_C_ReplaceEquippedItemsFromOldToNew, CallFunc_Map_Find_ReturnValue) == 0x0000B0, "Member 'BP_GameActionInstance_ReplaceCharacter_C_ReplaceEquippedItemsFromOldToNew::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_ReplaceCharacter_C_ReplaceEquippedItemsFromOldToNew, CallFunc_Array_Get_Item_1) == 0x0000B4, "Member 'BP_GameActionInstance_ReplaceCharacter_C_ReplaceEquippedItemsFromOldToNew::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_ReplaceCharacter_C_ReplaceEquippedItemsFromOldToNew, CallFunc_Map_Remove_ReturnValue) == 0x0000BC, "Member 'BP_GameActionInstance_ReplaceCharacter_C_ReplaceEquippedItemsFromOldToNew::CallFunc_Map_Remove_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_ReplaceCharacter_C_ReplaceEquippedItemsFromOldToNew, CallFunc_Array_Length_ReturnValue_1) == 0x0000C0, "Member 'BP_GameActionInstance_ReplaceCharacter_C_ReplaceEquippedItemsFromOldToNew::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_ReplaceCharacter_C_ReplaceEquippedItemsFromOldToNew, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000C4, "Member 'BP_GameActionInstance_ReplaceCharacter_C_ReplaceEquippedItemsFromOldToNew::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_ReplaceCharacter_C_ReplaceEquippedItemsFromOldToNew, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000C5, "Member 'BP_GameActionInstance_ReplaceCharacter_C_ReplaceEquippedItemsFromOldToNew::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_ReplaceCharacter_C_ReplaceEquippedItemsFromOldToNew, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x0000C6, "Member 'BP_GameActionInstance_ReplaceCharacter_C_ReplaceEquippedItemsFromOldToNew::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");

// Function BP_GameActionInstance_ReplaceCharacter.BP_GameActionInstance_ReplaceCharacter_C.GetDebugString
// 0x0070 (0x0070 - 0x0000)
struct BP_GameActionInstance_ReplaceCharacter_C_GetDebugString final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
	class UBP_GameAction_ShowCredits_C*           K2Node_DynamicCast_AsShow_Credits;                 // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue_1;             // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GameActionInstance_ReplaceCharacter_C_GetDebugString) == 0x000008, "Wrong alignment on BP_GameActionInstance_ReplaceCharacter_C_GetDebugString");
static_assert(sizeof(BP_GameActionInstance_ReplaceCharacter_C_GetDebugString) == 0x000070, "Wrong size on BP_GameActionInstance_ReplaceCharacter_C_GetDebugString");
static_assert(offsetof(BP_GameActionInstance_ReplaceCharacter_C_GetDebugString, ReturnValue) == 0x000000, "Member 'BP_GameActionInstance_ReplaceCharacter_C_GetDebugString::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_ReplaceCharacter_C_GetDebugString, K2Node_DynamicCast_AsShow_Credits) == 0x000010, "Member 'BP_GameActionInstance_ReplaceCharacter_C_GetDebugString::K2Node_DynamicCast_AsShow_Credits' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_ReplaceCharacter_C_GetDebugString, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_GameActionInstance_ReplaceCharacter_C_GetDebugString::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_ReplaceCharacter_C_GetDebugString, CallFunc_GetDisplayName_ReturnValue) == 0x000020, "Member 'BP_GameActionInstance_ReplaceCharacter_C_GetDebugString::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_ReplaceCharacter_C_GetDebugString, CallFunc_Concat_StrStr_ReturnValue) == 0x000030, "Member 'BP_GameActionInstance_ReplaceCharacter_C_GetDebugString::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_ReplaceCharacter_C_GetDebugString, CallFunc_GetDisplayName_ReturnValue_1) == 0x000040, "Member 'BP_GameActionInstance_ReplaceCharacter_C_GetDebugString::CallFunc_GetDisplayName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_ReplaceCharacter_C_GetDebugString, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000050, "Member 'BP_GameActionInstance_ReplaceCharacter_C_GetDebugString::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_ReplaceCharacter_C_GetDebugString, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000060, "Member 'BP_GameActionInstance_ReplaceCharacter_C_GetDebugString::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");

// Function BP_GameActionInstance_ReplaceCharacter.BP_GameActionInstance_ReplaceCharacter_C.ShouldTriggerAutoSaveAfterExecution
// 0x0001 (0x0001 - 0x0000)
struct BP_GameActionInstance_ReplaceCharacter_C_ShouldTriggerAutoSaveAfterExecution final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GameActionInstance_ReplaceCharacter_C_ShouldTriggerAutoSaveAfterExecution) == 0x000001, "Wrong alignment on BP_GameActionInstance_ReplaceCharacter_C_ShouldTriggerAutoSaveAfterExecution");
static_assert(sizeof(BP_GameActionInstance_ReplaceCharacter_C_ShouldTriggerAutoSaveAfterExecution) == 0x000001, "Wrong size on BP_GameActionInstance_ReplaceCharacter_C_ShouldTriggerAutoSaveAfterExecution");
static_assert(offsetof(BP_GameActionInstance_ReplaceCharacter_C_ShouldTriggerAutoSaveAfterExecution, ReturnValue) == 0x000000, "Member 'BP_GameActionInstance_ReplaceCharacter_C_ShouldTriggerAutoSaveAfterExecution::ReturnValue' has a wrong offset!");

}

