#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GameActionInstance_ShowCredits

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_GameActionInstance_ShowCredits.BP_GameActionInstance_ShowCredits_C.ExecuteGameAction
// 0x0008 (0x0008 - 0x0000)
struct BP_GameActionInstance_ShowCredits_C_ExecuteGameAction final
{
public:
	const class APlayerController*                Controller;                                        // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GameActionInstance_ShowCredits_C_ExecuteGameAction) == 0x000008, "Wrong alignment on BP_GameActionInstance_ShowCredits_C_ExecuteGameAction");
static_assert(sizeof(BP_GameActionInstance_ShowCredits_C_ExecuteGameAction) == 0x000008, "Wrong size on BP_GameActionInstance_ShowCredits_C_ExecuteGameAction");
static_assert(offsetof(BP_GameActionInstance_ShowCredits_C_ExecuteGameAction, Controller) == 0x000000, "Member 'BP_GameActionInstance_ShowCredits_C_ExecuteGameAction::Controller' has a wrong offset!");

// Function BP_GameActionInstance_ShowCredits.BP_GameActionInstance_ShowCredits_C.ExecuteUbergraph_BP_GameActionInstance_ShowCredits
// 0x0030 (0x0030 - 0x0000)
struct BP_GameActionInstance_ShowCredits_C_ExecuteUbergraph_BP_GameActionInstance_ShowCredits final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class APlayerController*                K2Node_Event_Controller;                           // 0x0008(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_jRPG_GI_Custom_C*                   CallFunc_GetCustomGI_ReturnValue;                  // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_GameAction_ShowCredits_C*           K2Node_DynamicCast_AsBP_Game_Action_Show_Credits;  // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USF_BlueprintLatentAction*              CallFunc_StartLatentAction_AsyncAction;            // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GameActionInstance_ShowCredits_C_ExecuteUbergraph_BP_GameActionInstance_ShowCredits) == 0x000008, "Wrong alignment on BP_GameActionInstance_ShowCredits_C_ExecuteUbergraph_BP_GameActionInstance_ShowCredits");
static_assert(sizeof(BP_GameActionInstance_ShowCredits_C_ExecuteUbergraph_BP_GameActionInstance_ShowCredits) == 0x000030, "Wrong size on BP_GameActionInstance_ShowCredits_C_ExecuteUbergraph_BP_GameActionInstance_ShowCredits");
static_assert(offsetof(BP_GameActionInstance_ShowCredits_C_ExecuteUbergraph_BP_GameActionInstance_ShowCredits, EntryPoint) == 0x000000, "Member 'BP_GameActionInstance_ShowCredits_C_ExecuteUbergraph_BP_GameActionInstance_ShowCredits::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_ShowCredits_C_ExecuteUbergraph_BP_GameActionInstance_ShowCredits, K2Node_Event_Controller) == 0x000008, "Member 'BP_GameActionInstance_ShowCredits_C_ExecuteUbergraph_BP_GameActionInstance_ShowCredits::K2Node_Event_Controller' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_ShowCredits_C_ExecuteUbergraph_BP_GameActionInstance_ShowCredits, CallFunc_GetCustomGI_ReturnValue) == 0x000010, "Member 'BP_GameActionInstance_ShowCredits_C_ExecuteUbergraph_BP_GameActionInstance_ShowCredits::CallFunc_GetCustomGI_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_ShowCredits_C_ExecuteUbergraph_BP_GameActionInstance_ShowCredits, K2Node_DynamicCast_AsBP_Game_Action_Show_Credits) == 0x000018, "Member 'BP_GameActionInstance_ShowCredits_C_ExecuteUbergraph_BP_GameActionInstance_ShowCredits::K2Node_DynamicCast_AsBP_Game_Action_Show_Credits' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_ShowCredits_C_ExecuteUbergraph_BP_GameActionInstance_ShowCredits, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_GameActionInstance_ShowCredits_C_ExecuteUbergraph_BP_GameActionInstance_ShowCredits::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_ShowCredits_C_ExecuteUbergraph_BP_GameActionInstance_ShowCredits, CallFunc_StartLatentAction_AsyncAction) == 0x000028, "Member 'BP_GameActionInstance_ShowCredits_C_ExecuteUbergraph_BP_GameActionInstance_ShowCredits::CallFunc_StartLatentAction_AsyncAction' has a wrong offset!");

// Function BP_GameActionInstance_ShowCredits.BP_GameActionInstance_ShowCredits_C.GetDebugString
// 0x0070 (0x0070 - 0x0000)
struct BP_GameActionInstance_ShowCredits_C_GetDebugString final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
	class UBP_GameAction_ShowCredits_C*           K2Node_DynamicCast_AsBP_Game_Action_Show_Credits;  // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue_1;             // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GameActionInstance_ShowCredits_C_GetDebugString) == 0x000008, "Wrong alignment on BP_GameActionInstance_ShowCredits_C_GetDebugString");
static_assert(sizeof(BP_GameActionInstance_ShowCredits_C_GetDebugString) == 0x000070, "Wrong size on BP_GameActionInstance_ShowCredits_C_GetDebugString");
static_assert(offsetof(BP_GameActionInstance_ShowCredits_C_GetDebugString, ReturnValue) == 0x000000, "Member 'BP_GameActionInstance_ShowCredits_C_GetDebugString::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_ShowCredits_C_GetDebugString, K2Node_DynamicCast_AsBP_Game_Action_Show_Credits) == 0x000010, "Member 'BP_GameActionInstance_ShowCredits_C_GetDebugString::K2Node_DynamicCast_AsBP_Game_Action_Show_Credits' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_ShowCredits_C_GetDebugString, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_GameActionInstance_ShowCredits_C_GetDebugString::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_ShowCredits_C_GetDebugString, CallFunc_GetDisplayName_ReturnValue) == 0x000020, "Member 'BP_GameActionInstance_ShowCredits_C_GetDebugString::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_ShowCredits_C_GetDebugString, CallFunc_Concat_StrStr_ReturnValue) == 0x000030, "Member 'BP_GameActionInstance_ShowCredits_C_GetDebugString::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_ShowCredits_C_GetDebugString, CallFunc_GetDisplayName_ReturnValue_1) == 0x000040, "Member 'BP_GameActionInstance_ShowCredits_C_GetDebugString::CallFunc_GetDisplayName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_ShowCredits_C_GetDebugString, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000050, "Member 'BP_GameActionInstance_ShowCredits_C_GetDebugString::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_ShowCredits_C_GetDebugString, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000060, "Member 'BP_GameActionInstance_ShowCredits_C_GetDebugString::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");

// Function BP_GameActionInstance_ShowCredits.BP_GameActionInstance_ShowCredits_C.ShouldTriggerAutoSaveAfterExecution
// 0x0001 (0x0001 - 0x0000)
struct BP_GameActionInstance_ShowCredits_C_ShouldTriggerAutoSaveAfterExecution final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GameActionInstance_ShowCredits_C_ShouldTriggerAutoSaveAfterExecution) == 0x000001, "Wrong alignment on BP_GameActionInstance_ShowCredits_C_ShouldTriggerAutoSaveAfterExecution");
static_assert(sizeof(BP_GameActionInstance_ShowCredits_C_ShouldTriggerAutoSaveAfterExecution) == 0x000001, "Wrong size on BP_GameActionInstance_ShowCredits_C_ShouldTriggerAutoSaveAfterExecution");
static_assert(offsetof(BP_GameActionInstance_ShowCredits_C_ShouldTriggerAutoSaveAfterExecution, ReturnValue) == 0x000000, "Member 'BP_GameActionInstance_ShowCredits_C_ShouldTriggerAutoSaveAfterExecution::ReturnValue' has a wrong offset!");

}

