#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GameAction_Conditional

#include "Basic.hpp"

#include "SandFall_structs.hpp"
#include "BP_PDT_GameAction_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_GameAction_Conditional.BP_GameAction_Conditional_C
// 0x0028 (0x0058 - 0x0030)
class UBP_GameAction_Conditional_C final : public UBP_PDT_GameAction_C
{
public:
	struct FGameAction_Wrapper                    IfTrue;                                            // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FGameAction_Wrapper                    IfFalse;                                           // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FConditionChecker_Wrapper              ConditionChecker;                                  // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ContainsInstancedReference)

public:
	TSubclassOf<class UGameActionInstance> GetInstanceClass();
	void ValidateGameAction(TArray<class FText>& ErrorMessages, class FString& PropertyPath, bool& ExploreAssetChildren);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_GameAction_Conditional_C">();
	}
	static class UBP_GameAction_Conditional_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_GameAction_Conditional_C>();
	}
};
static_assert(alignof(UBP_GameAction_Conditional_C) == 0x000008, "Wrong alignment on UBP_GameAction_Conditional_C");
static_assert(sizeof(UBP_GameAction_Conditional_C) == 0x000058, "Wrong size on UBP_GameAction_Conditional_C");
static_assert(offsetof(UBP_GameAction_Conditional_C, IfTrue) == 0x000030, "Member 'UBP_GameAction_Conditional_C::IfTrue' has a wrong offset!");
static_assert(offsetof(UBP_GameAction_Conditional_C, IfFalse) == 0x000040, "Member 'UBP_GameAction_Conditional_C::IfFalse' has a wrong offset!");
static_assert(offsetof(UBP_GameAction_Conditional_C, ConditionChecker) == 0x000050, "Member 'UBP_GameAction_Conditional_C::ConditionChecker' has a wrong offset!");

}

