#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GameAction_ShowCredits

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_GameAction_ShowCredits.BP_GameAction_ShowCredits_C.GetInstanceClass
// 0x0008 (0x0008 - 0x0000)
struct BP_GameAction_ShowCredits_C_GetInstanceClass final
{
public:
	TSubclassOf<class UGameActionInstance>        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(BP_GameAction_ShowCredits_C_GetInstanceClass) == 0x000008, "Wrong alignment on BP_GameAction_ShowCredits_C_GetInstanceClass");
static_assert(sizeof(BP_GameAction_ShowCredits_C_GetInstanceClass) == 0x000008, "Wrong size on BP_GameAction_ShowCredits_C_GetInstanceClass");
static_assert(offsetof(BP_GameAction_ShowCredits_C_GetInstanceClass, ReturnValue) == 0x000000, "Member 'BP_GameAction_ShowCredits_C_GetInstanceClass::ReturnValue' has a wrong offset!");

// Function BP_GameAction_ShowCredits.BP_GameAction_ShowCredits_C.ValidateGameAction
// 0x0050 (0x0050 - 0x0000)
struct BP_GameAction_ShowCredits_C_ValidateGameAction final
{
public:
	TArray<class FText>                           ErrorMessages;                                     // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FString                                 PropertyPath;                                      // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, HasGetValueTypeHash)
	bool                                          ExploreAssetChildren;                              // 0x0020(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0028(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0038(0x0010)()
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GameAction_ShowCredits_C_ValidateGameAction) == 0x000008, "Wrong alignment on BP_GameAction_ShowCredits_C_ValidateGameAction");
static_assert(sizeof(BP_GameAction_ShowCredits_C_ValidateGameAction) == 0x000050, "Wrong size on BP_GameAction_ShowCredits_C_ValidateGameAction");
static_assert(offsetof(BP_GameAction_ShowCredits_C_ValidateGameAction, ErrorMessages) == 0x000000, "Member 'BP_GameAction_ShowCredits_C_ValidateGameAction::ErrorMessages' has a wrong offset!");
static_assert(offsetof(BP_GameAction_ShowCredits_C_ValidateGameAction, PropertyPath) == 0x000010, "Member 'BP_GameAction_ShowCredits_C_ValidateGameAction::PropertyPath' has a wrong offset!");
static_assert(offsetof(BP_GameAction_ShowCredits_C_ValidateGameAction, ExploreAssetChildren) == 0x000020, "Member 'BP_GameAction_ShowCredits_C_ValidateGameAction::ExploreAssetChildren' has a wrong offset!");
static_assert(offsetof(BP_GameAction_ShowCredits_C_ValidateGameAction, K2Node_MakeArray_Array) == 0x000028, "Member 'BP_GameAction_ShowCredits_C_ValidateGameAction::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_GameAction_ShowCredits_C_ValidateGameAction, CallFunc_Format_ReturnValue) == 0x000038, "Member 'BP_GameAction_ShowCredits_C_ValidateGameAction::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameAction_ShowCredits_C_ValidateGameAction, CallFunc_Array_Add_ReturnValue) == 0x000048, "Member 'BP_GameAction_ShowCredits_C_ValidateGameAction::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameAction_ShowCredits_C_ValidateGameAction, CallFunc_IsValid_ReturnValue) == 0x00004C, "Member 'BP_GameAction_ShowCredits_C_ValidateGameAction::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameAction_ShowCredits_C_ValidateGameAction, CallFunc_Not_PreBool_ReturnValue) == 0x00004D, "Member 'BP_GameAction_ShowCredits_C_ValidateGameAction::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

}

