#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_HaussmannBuilding04

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_HaussmannBuilding04.BP_HaussmannBuilding04_C
// 0x01E8 (0x0478 - 0x0290)
class ABP_HaussmannBuilding04_C final : public AActor
{
public:
	class UStaticMeshComponent*                   SM_InvisibleWalls7;                                // 0x0290(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_InvisibleWalls6;                                // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_InvisibleWalls5;                                // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_InvisibleWalls4;                                // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_InvisibleWalls3;                                // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_InvisibleWalls2;                                // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_InvisibleWalls1;                                // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_InvisibleWalls;                                 // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh46;                             // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh45;                             // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh44;                             // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh43;                             // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh42;                             // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh41;                             // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh40;                             // 0x0300(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh39;                             // 0x0308(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh38;                             // 0x0310(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh37;                             // 0x0318(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh36;                             // 0x0320(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh35;                             // 0x0328(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh34;                             // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh33;                             // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh32;                             // 0x0340(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh31;                             // 0x0348(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh30;                             // 0x0350(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh29;                             // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh28;                             // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh27;                             // 0x0368(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh26;                             // 0x0370(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh25;                             // 0x0378(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh24;                             // 0x0380(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh23;                             // 0x0388(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh22;                             // 0x0390(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh21;                             // 0x0398(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh20;                             // 0x03A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh19;                             // 0x03A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh18;                             // 0x03B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh17;                             // 0x03B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh16;                             // 0x03C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh15;                             // 0x03C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh14;                             // 0x03D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh13;                             // 0x03D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh12;                             // 0x03E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh11;                             // 0x03E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh10;                             // 0x03F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh9;                              // 0x03F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh8;                              // 0x0400(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh7;                              // 0x0408(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh6;                              // 0x0410(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh5;                              // 0x0418(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh4;                              // 0x0420(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh3;                              // 0x0428(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh2;                              // 0x0430(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh1;                              // 0x0438(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh;                               // 0x0440(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   HDA_LumiereCity_3_730_0_rendered_collision_geo;    // 0x0448(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   HDA_LumiereCity_3_248_0_collision_geo;             // 0x0450(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   HDA_LumiereCity_3_126_0_main_geo;                  // 0x0458(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   HDA_LumiereCity_3_118_0_main_geo;                  // 0x0460(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   HDA_LumiereCity_3_117_0_main_geo;                  // 0x0468(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0470(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_HaussmannBuilding04_C">();
	}
	static class ABP_HaussmannBuilding04_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_HaussmannBuilding04_C>();
	}
};
static_assert(alignof(ABP_HaussmannBuilding04_C) == 0x000008, "Wrong alignment on ABP_HaussmannBuilding04_C");
static_assert(sizeof(ABP_HaussmannBuilding04_C) == 0x000478, "Wrong size on ABP_HaussmannBuilding04_C");
static_assert(offsetof(ABP_HaussmannBuilding04_C, SM_InvisibleWalls7) == 0x000290, "Member 'ABP_HaussmannBuilding04_C::SM_InvisibleWalls7' has a wrong offset!");
static_assert(offsetof(ABP_HaussmannBuilding04_C, SM_InvisibleWalls6) == 0x000298, "Member 'ABP_HaussmannBuilding04_C::SM_InvisibleWalls6' has a wrong offset!");
static_assert(offsetof(ABP_HaussmannBuilding04_C, SM_InvisibleWalls5) == 0x0002A0, "Member 'ABP_HaussmannBuilding04_C::SM_InvisibleWalls5' has a wrong offset!");
static_assert(offsetof(ABP_HaussmannBuilding04_C, SM_InvisibleWalls4) == 0x0002A8, "Member 'ABP_HaussmannBuilding04_C::SM_InvisibleWalls4' has a wrong offset!");
static_assert(offsetof(ABP_HaussmannBuilding04_C, SM_InvisibleWalls3) == 0x0002B0, "Member 'ABP_HaussmannBuilding04_C::SM_InvisibleWalls3' has a wrong offset!");
static_assert(offsetof(ABP_HaussmannBuilding04_C, SM_InvisibleWalls2) == 0x0002B8, "Member 'ABP_HaussmannBuilding04_C::SM_InvisibleWalls2' has a wrong offset!");
static_assert(offsetof(ABP_HaussmannBuilding04_C, SM_InvisibleWalls1) == 0x0002C0, "Member 'ABP_HaussmannBuilding04_C::SM_InvisibleWalls1' has a wrong offset!");
static_assert(offsetof(ABP_HaussmannBuilding04_C, SM_InvisibleWalls) == 0x0002C8, "Member 'ABP_HaussmannBuilding04_C::SM_InvisibleWalls' has a wrong offset!");
static_assert(offsetof(ABP_HaussmannBuilding04_C, InstancedStaticMesh46) == 0x0002D0, "Member 'ABP_HaussmannBuilding04_C::InstancedStaticMesh46' has a wrong offset!");
static_assert(offsetof(ABP_HaussmannBuilding04_C, InstancedStaticMesh45) == 0x0002D8, "Member 'ABP_HaussmannBuilding04_C::InstancedStaticMesh45' has a wrong offset!");
static_assert(offsetof(ABP_HaussmannBuilding04_C, InstancedStaticMesh44) == 0x0002E0, "Member 'ABP_HaussmannBuilding04_C::InstancedStaticMesh44' has a wrong offset!");
static_assert(offsetof(ABP_HaussmannBuilding04_C, InstancedStaticMesh43) == 0x0002E8, "Member 'ABP_HaussmannBuilding04_C::InstancedStaticMesh43' has a wrong offset!");
static_assert(offsetof(ABP_HaussmannBuilding04_C, InstancedStaticMesh42) == 0x0002F0, "Member 'ABP_HaussmannBuilding04_C::InstancedStaticMesh42' has a wrong offset!");
static_assert(offsetof(ABP_HaussmannBuilding04_C, InstancedStaticMesh41) == 0x0002F8, "Member 'ABP_HaussmannBuilding04_C::InstancedStaticMesh41' has a wrong offset!");
static_assert(offsetof(ABP_HaussmannBuilding04_C, InstancedStaticMesh40) == 0x000300, "Member 'ABP_HaussmannBuilding04_C::InstancedStaticMesh40' has a wrong offset!");
static_assert(offsetof(ABP_HaussmannBuilding04_C, InstancedStaticMesh39) == 0x000308, "Member 'ABP_HaussmannBuilding04_C::InstancedStaticMesh39' has a wrong offset!");
static_assert(offsetof(ABP_HaussmannBuilding04_C, InstancedStaticMesh38) == 0x000310, "Member 'ABP_HaussmannBuilding04_C::InstancedStaticMesh38' has a wrong offset!");
static_assert(offsetof(ABP_HaussmannBuilding04_C, InstancedStaticMesh37) == 0x000318, "Member 'ABP_HaussmannBuilding04_C::InstancedStaticMesh37' has a wrong offset!");
static_assert(offsetof(ABP_HaussmannBuilding04_C, InstancedStaticMesh36) == 0x000320, "Member 'ABP_HaussmannBuilding04_C::InstancedStaticMesh36' has a wrong offset!");
static_assert(offsetof(ABP_HaussmannBuilding04_C, InstancedStaticMesh35) == 0x000328, "Member 'ABP_HaussmannBuilding04_C::InstancedStaticMesh35' has a wrong offset!");
static_assert(offsetof(ABP_HaussmannBuilding04_C, InstancedStaticMesh34) == 0x000330, "Member 'ABP_HaussmannBuilding04_C::InstancedStaticMesh34' has a wrong offset!");
static_assert(offsetof(ABP_HaussmannBuilding04_C, InstancedStaticMesh33) == 0x000338, "Member 'ABP_HaussmannBuilding04_C::InstancedStaticMesh33' has a wrong offset!");
static_assert(offsetof(ABP_HaussmannBuilding04_C, InstancedStaticMesh32) == 0x000340, "Member 'ABP_HaussmannBuilding04_C::InstancedStaticMesh32' has a wrong offset!");
static_assert(offsetof(ABP_HaussmannBuilding04_C, InstancedStaticMesh31) == 0x000348, "Member 'ABP_HaussmannBuilding04_C::InstancedStaticMesh31' has a wrong offset!");
static_assert(offsetof(ABP_HaussmannBuilding04_C, InstancedStaticMesh30) == 0x000350, "Member 'ABP_HaussmannBuilding04_C::InstancedStaticMesh30' has a wrong offset!");
static_assert(offsetof(ABP_HaussmannBuilding04_C, InstancedStaticMesh29) == 0x000358, "Member 'ABP_HaussmannBuilding04_C::InstancedStaticMesh29' has a wrong offset!");
static_assert(offsetof(ABP_HaussmannBuilding04_C, InstancedStaticMesh28) == 0x000360, "Member 'ABP_HaussmannBuilding04_C::InstancedStaticMesh28' has a wrong offset!");
static_assert(offsetof(ABP_HaussmannBuilding04_C, InstancedStaticMesh27) == 0x000368, "Member 'ABP_HaussmannBuilding04_C::InstancedStaticMesh27' has a wrong offset!");
static_assert(offsetof(ABP_HaussmannBuilding04_C, InstancedStaticMesh26) == 0x000370, "Member 'ABP_HaussmannBuilding04_C::InstancedStaticMesh26' has a wrong offset!");
static_assert(offsetof(ABP_HaussmannBuilding04_C, InstancedStaticMesh25) == 0x000378, "Member 'ABP_HaussmannBuilding04_C::InstancedStaticMesh25' has a wrong offset!");
static_assert(offsetof(ABP_HaussmannBuilding04_C, InstancedStaticMesh24) == 0x000380, "Member 'ABP_HaussmannBuilding04_C::InstancedStaticMesh24' has a wrong offset!");
static_assert(offsetof(ABP_HaussmannBuilding04_C, InstancedStaticMesh23) == 0x000388, "Member 'ABP_HaussmannBuilding04_C::InstancedStaticMesh23' has a wrong offset!");
static_assert(offsetof(ABP_HaussmannBuilding04_C, InstancedStaticMesh22) == 0x000390, "Member 'ABP_HaussmannBuilding04_C::InstancedStaticMesh22' has a wrong offset!");
static_assert(offsetof(ABP_HaussmannBuilding04_C, InstancedStaticMesh21) == 0x000398, "Member 'ABP_HaussmannBuilding04_C::InstancedStaticMesh21' has a wrong offset!");
static_assert(offsetof(ABP_HaussmannBuilding04_C, InstancedStaticMesh20) == 0x0003A0, "Member 'ABP_HaussmannBuilding04_C::InstancedStaticMesh20' has a wrong offset!");
static_assert(offsetof(ABP_HaussmannBuilding04_C, InstancedStaticMesh19) == 0x0003A8, "Member 'ABP_HaussmannBuilding04_C::InstancedStaticMesh19' has a wrong offset!");
static_assert(offsetof(ABP_HaussmannBuilding04_C, InstancedStaticMesh18) == 0x0003B0, "Member 'ABP_HaussmannBuilding04_C::InstancedStaticMesh18' has a wrong offset!");
static_assert(offsetof(ABP_HaussmannBuilding04_C, InstancedStaticMesh17) == 0x0003B8, "Member 'ABP_HaussmannBuilding04_C::InstancedStaticMesh17' has a wrong offset!");
static_assert(offsetof(ABP_HaussmannBuilding04_C, InstancedStaticMesh16) == 0x0003C0, "Member 'ABP_HaussmannBuilding04_C::InstancedStaticMesh16' has a wrong offset!");
static_assert(offsetof(ABP_HaussmannBuilding04_C, InstancedStaticMesh15) == 0x0003C8, "Member 'ABP_HaussmannBuilding04_C::InstancedStaticMesh15' has a wrong offset!");
static_assert(offsetof(ABP_HaussmannBuilding04_C, InstancedStaticMesh14) == 0x0003D0, "Member 'ABP_HaussmannBuilding04_C::InstancedStaticMesh14' has a wrong offset!");
static_assert(offsetof(ABP_HaussmannBuilding04_C, InstancedStaticMesh13) == 0x0003D8, "Member 'ABP_HaussmannBuilding04_C::InstancedStaticMesh13' has a wrong offset!");
static_assert(offsetof(ABP_HaussmannBuilding04_C, InstancedStaticMesh12) == 0x0003E0, "Member 'ABP_HaussmannBuilding04_C::InstancedStaticMesh12' has a wrong offset!");
static_assert(offsetof(ABP_HaussmannBuilding04_C, InstancedStaticMesh11) == 0x0003E8, "Member 'ABP_HaussmannBuilding04_C::InstancedStaticMesh11' has a wrong offset!");
static_assert(offsetof(ABP_HaussmannBuilding04_C, InstancedStaticMesh10) == 0x0003F0, "Member 'ABP_HaussmannBuilding04_C::InstancedStaticMesh10' has a wrong offset!");
static_assert(offsetof(ABP_HaussmannBuilding04_C, InstancedStaticMesh9) == 0x0003F8, "Member 'ABP_HaussmannBuilding04_C::InstancedStaticMesh9' has a wrong offset!");
static_assert(offsetof(ABP_HaussmannBuilding04_C, InstancedStaticMesh8) == 0x000400, "Member 'ABP_HaussmannBuilding04_C::InstancedStaticMesh8' has a wrong offset!");
static_assert(offsetof(ABP_HaussmannBuilding04_C, InstancedStaticMesh7) == 0x000408, "Member 'ABP_HaussmannBuilding04_C::InstancedStaticMesh7' has a wrong offset!");
static_assert(offsetof(ABP_HaussmannBuilding04_C, InstancedStaticMesh6) == 0x000410, "Member 'ABP_HaussmannBuilding04_C::InstancedStaticMesh6' has a wrong offset!");
static_assert(offsetof(ABP_HaussmannBuilding04_C, InstancedStaticMesh5) == 0x000418, "Member 'ABP_HaussmannBuilding04_C::InstancedStaticMesh5' has a wrong offset!");
static_assert(offsetof(ABP_HaussmannBuilding04_C, InstancedStaticMesh4) == 0x000420, "Member 'ABP_HaussmannBuilding04_C::InstancedStaticMesh4' has a wrong offset!");
static_assert(offsetof(ABP_HaussmannBuilding04_C, InstancedStaticMesh3) == 0x000428, "Member 'ABP_HaussmannBuilding04_C::InstancedStaticMesh3' has a wrong offset!");
static_assert(offsetof(ABP_HaussmannBuilding04_C, InstancedStaticMesh2) == 0x000430, "Member 'ABP_HaussmannBuilding04_C::InstancedStaticMesh2' has a wrong offset!");
static_assert(offsetof(ABP_HaussmannBuilding04_C, InstancedStaticMesh1) == 0x000438, "Member 'ABP_HaussmannBuilding04_C::InstancedStaticMesh1' has a wrong offset!");
static_assert(offsetof(ABP_HaussmannBuilding04_C, InstancedStaticMesh) == 0x000440, "Member 'ABP_HaussmannBuilding04_C::InstancedStaticMesh' has a wrong offset!");
static_assert(offsetof(ABP_HaussmannBuilding04_C, HDA_LumiereCity_3_730_0_rendered_collision_geo) == 0x000448, "Member 'ABP_HaussmannBuilding04_C::HDA_LumiereCity_3_730_0_rendered_collision_geo' has a wrong offset!");
static_assert(offsetof(ABP_HaussmannBuilding04_C, HDA_LumiereCity_3_248_0_collision_geo) == 0x000450, "Member 'ABP_HaussmannBuilding04_C::HDA_LumiereCity_3_248_0_collision_geo' has a wrong offset!");
static_assert(offsetof(ABP_HaussmannBuilding04_C, HDA_LumiereCity_3_126_0_main_geo) == 0x000458, "Member 'ABP_HaussmannBuilding04_C::HDA_LumiereCity_3_126_0_main_geo' has a wrong offset!");
static_assert(offsetof(ABP_HaussmannBuilding04_C, HDA_LumiereCity_3_118_0_main_geo) == 0x000460, "Member 'ABP_HaussmannBuilding04_C::HDA_LumiereCity_3_118_0_main_geo' has a wrong offset!");
static_assert(offsetof(ABP_HaussmannBuilding04_C, HDA_LumiereCity_3_117_0_main_geo) == 0x000468, "Member 'ABP_HaussmannBuilding04_C::HDA_LumiereCity_3_117_0_main_geo' has a wrong offset!");
static_assert(offsetof(ABP_HaussmannBuilding04_C, DefaultSceneRoot) == 0x000470, "Member 'ABP_HaussmannBuilding04_C::DefaultSceneRoot' has a wrong offset!");

}

