#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ItemUpgradeSystem

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EWeaponQuality_structs.hpp"
#include "S_ItemQuantityList_structs.hpp"
#include "S_ItemQuantity_structs.hpp"
#include "S_WeaponInstanceData_structs.hpp"
#include "S_ItemQuantityPerWeaponUpgrade_structs.hpp"
#include "S_WeaponInstanceHandle_structs.hpp"
#include "S_jRPG_Item_StaticData_structs.hpp"
#include "S_LootContext_structs.hpp"
#include "S_jRPG_Item_DynamicData_structs.hpp"
#include "S_WeaponDefinition_structs.hpp"
#include "S_WeaponScalingLevel_structs.hpp"


namespace SDK::Params
{

// Function BP_ItemUpgradeSystem.BP_ItemUpgradeSystem_C.AddWeaponToInventory
// 0x03E8 (0x03E8 - 0x0000)
struct BP_ItemUpgradeSystem_C_AddWeaponToInventory final
{
public:
	struct FS_WeaponInstanceHandle                WeaponInstanceHandle;                              // 0x0000(0x000C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PreviousLevel;                                     // 0x000C(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_WeaponInstanceData                  local_existingWeaponInstanceData;                  // 0x0010(0x0110)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FS_WeaponInstanceData                  Temp_struct_Variable;                              // 0x0120(0x0110)(ConstParm, HasGetValueTypeHash)
	class UAC_jRPG_InventoryManager_C*            CallFunc_GetInventoryManager_ReturnValue;          // 0x0230(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UBP_ItemInstance_Base_C*                CallFunc_FindItemInstanceByID_ItemInstance;        // 0x0238(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_241[0x7];                                      // 0x0241(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_NameToText_ReturnValue;              // 0x0248(0x0010)()
	class UBP_ItemInstance_Gear_Weapon_C*         K2Node_DynamicCast_AsBP_Item_Instance_Gear_Weapon; // 0x0258(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_261[0x7];                                      // 0x0261(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0268(0x0048)(HasGetValueTypeHash)
	struct FS_WeaponInstanceData                  CallFunc_GetWeaponInstanceData_ReturnValue;        // 0x02B0(0x0110)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x03C0(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Format_ReturnValue;                       // 0x03D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x03E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ItemUpgradeSystem_C_AddWeaponToInventory) == 0x000008, "Wrong alignment on BP_ItemUpgradeSystem_C_AddWeaponToInventory");
static_assert(sizeof(BP_ItemUpgradeSystem_C_AddWeaponToInventory) == 0x0003E8, "Wrong size on BP_ItemUpgradeSystem_C_AddWeaponToInventory");
static_assert(offsetof(BP_ItemUpgradeSystem_C_AddWeaponToInventory, WeaponInstanceHandle) == 0x000000, "Member 'BP_ItemUpgradeSystem_C_AddWeaponToInventory::WeaponInstanceHandle' has a wrong offset!");
static_assert(offsetof(BP_ItemUpgradeSystem_C_AddWeaponToInventory, PreviousLevel) == 0x00000C, "Member 'BP_ItemUpgradeSystem_C_AddWeaponToInventory::PreviousLevel' has a wrong offset!");
static_assert(offsetof(BP_ItemUpgradeSystem_C_AddWeaponToInventory, local_existingWeaponInstanceData) == 0x000010, "Member 'BP_ItemUpgradeSystem_C_AddWeaponToInventory::local_existingWeaponInstanceData' has a wrong offset!");
static_assert(offsetof(BP_ItemUpgradeSystem_C_AddWeaponToInventory, Temp_struct_Variable) == 0x000120, "Member 'BP_ItemUpgradeSystem_C_AddWeaponToInventory::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_ItemUpgradeSystem_C_AddWeaponToInventory, CallFunc_GetInventoryManager_ReturnValue) == 0x000230, "Member 'BP_ItemUpgradeSystem_C_AddWeaponToInventory::CallFunc_GetInventoryManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemUpgradeSystem_C_AddWeaponToInventory, CallFunc_FindItemInstanceByID_ItemInstance) == 0x000238, "Member 'BP_ItemUpgradeSystem_C_AddWeaponToInventory::CallFunc_FindItemInstanceByID_ItemInstance' has a wrong offset!");
static_assert(offsetof(BP_ItemUpgradeSystem_C_AddWeaponToInventory, CallFunc_IsValid_ReturnValue) == 0x000240, "Member 'BP_ItemUpgradeSystem_C_AddWeaponToInventory::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemUpgradeSystem_C_AddWeaponToInventory, CallFunc_Conv_NameToText_ReturnValue) == 0x000248, "Member 'BP_ItemUpgradeSystem_C_AddWeaponToInventory::CallFunc_Conv_NameToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemUpgradeSystem_C_AddWeaponToInventory, K2Node_DynamicCast_AsBP_Item_Instance_Gear_Weapon) == 0x000258, "Member 'BP_ItemUpgradeSystem_C_AddWeaponToInventory::K2Node_DynamicCast_AsBP_Item_Instance_Gear_Weapon' has a wrong offset!");
static_assert(offsetof(BP_ItemUpgradeSystem_C_AddWeaponToInventory, K2Node_DynamicCast_bSuccess) == 0x000260, "Member 'BP_ItemUpgradeSystem_C_AddWeaponToInventory::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ItemUpgradeSystem_C_AddWeaponToInventory, K2Node_MakeStruct_FormatArgumentData) == 0x000268, "Member 'BP_ItemUpgradeSystem_C_AddWeaponToInventory::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_ItemUpgradeSystem_C_AddWeaponToInventory, CallFunc_GetWeaponInstanceData_ReturnValue) == 0x0002B0, "Member 'BP_ItemUpgradeSystem_C_AddWeaponToInventory::CallFunc_GetWeaponInstanceData_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemUpgradeSystem_C_AddWeaponToInventory, K2Node_MakeArray_Array) == 0x0003C0, "Member 'BP_ItemUpgradeSystem_C_AddWeaponToInventory::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_ItemUpgradeSystem_C_AddWeaponToInventory, CallFunc_Format_ReturnValue) == 0x0003D0, "Member 'BP_ItemUpgradeSystem_C_AddWeaponToInventory::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemUpgradeSystem_C_AddWeaponToInventory, CallFunc_Array_Add_ReturnValue) == 0x0003E0, "Member 'BP_ItemUpgradeSystem_C_AddWeaponToInventory::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function BP_ItemUpgradeSystem.BP_ItemUpgradeSystem_C.ComputeWeaponInstanceData
// 0x0690 (0x0690 - 0x0000)
struct BP_ItemUpgradeSystem_C_ComputeWeaponInstanceData final
{
public:
	struct FS_WeaponInstanceHandle                WeaponHandle;                                      // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_WeaponInstanceData                  WeaponInstanceData;                                // 0x0010(0x0110)(Parm, OutParm, HasGetValueTypeHash)
	struct FS_WeaponInstanceHandle                local_weaponHandle;                                // 0x0120(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPackagedForDistribution_ReturnValue;    // 0x012C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12D[0x3];                                      // 0x012D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_WeaponInstanceData                  K2Node_MakeStruct_S_WeaponInstanceData;            // 0x0130(0x0110)(HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_241[0x7];                                      // 0x0241(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0250(0x0048)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_NameToText_ReturnValue;              // 0x0298(0x0010)()
	class FText                                   CallFunc_Conv_NameToText_ReturnValue_1;            // 0x02A8(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x02B8(0x0048)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0300(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0348(0x0010)(ReferenceParm)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0358(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Format_ReturnValue;                       // 0x0368(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Format_ReturnValue_1;                     // 0x0378(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0388(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetWeaponDefinition_Found;                // 0x0389(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_38A[0x6];                                      // 0x038A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_WeaponDefinition                    CallFunc_GetWeaponDefinition_OutRow;               // 0x0390(0x00F0)(HasGetValueTypeHash)
	EWeaponQuality                                CallFunc_GetWeaponQualityForUpgradeLevel_Quality;  // 0x0480(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_481[0x7];                                      // 0x0481(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0488(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0498(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x04A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_WeaponScalingLevel                  CallFunc_GetDataTableRowFromName_OutRow;           // 0x04B0(0x0020)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x04D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D1[0x7];                                      // 0x04D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_NameToText_ReturnValue_2;            // 0x04D8(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x04E8(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_2;                          // 0x0530(0x0010)(ReferenceParm)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0540(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Format_ReturnValue_2;                     // 0x0548(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0558(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue;                        // 0x0560(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_564[0x4];                                      // 0x0564(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0568(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x0570(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue_1;                      // 0x0578(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue_2;                      // 0x057C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_WeaponInstanceData                  K2Node_MakeStruct_S_WeaponInstanceData_1;          // 0x0580(0x0110)(HasGetValueTypeHash)
};
static_assert(alignof(BP_ItemUpgradeSystem_C_ComputeWeaponInstanceData) == 0x000008, "Wrong alignment on BP_ItemUpgradeSystem_C_ComputeWeaponInstanceData");
static_assert(sizeof(BP_ItemUpgradeSystem_C_ComputeWeaponInstanceData) == 0x000690, "Wrong size on BP_ItemUpgradeSystem_C_ComputeWeaponInstanceData");
static_assert(offsetof(BP_ItemUpgradeSystem_C_ComputeWeaponInstanceData, WeaponHandle) == 0x000000, "Member 'BP_ItemUpgradeSystem_C_ComputeWeaponInstanceData::WeaponHandle' has a wrong offset!");
static_assert(offsetof(BP_ItemUpgradeSystem_C_ComputeWeaponInstanceData, WeaponInstanceData) == 0x000010, "Member 'BP_ItemUpgradeSystem_C_ComputeWeaponInstanceData::WeaponInstanceData' has a wrong offset!");
static_assert(offsetof(BP_ItemUpgradeSystem_C_ComputeWeaponInstanceData, local_weaponHandle) == 0x000120, "Member 'BP_ItemUpgradeSystem_C_ComputeWeaponInstanceData::local_weaponHandle' has a wrong offset!");
static_assert(offsetof(BP_ItemUpgradeSystem_C_ComputeWeaponInstanceData, CallFunc_IsPackagedForDistribution_ReturnValue) == 0x00012C, "Member 'BP_ItemUpgradeSystem_C_ComputeWeaponInstanceData::CallFunc_IsPackagedForDistribution_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemUpgradeSystem_C_ComputeWeaponInstanceData, K2Node_MakeStruct_S_WeaponInstanceData) == 0x000130, "Member 'BP_ItemUpgradeSystem_C_ComputeWeaponInstanceData::K2Node_MakeStruct_S_WeaponInstanceData' has a wrong offset!");
static_assert(offsetof(BP_ItemUpgradeSystem_C_ComputeWeaponInstanceData, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000240, "Member 'BP_ItemUpgradeSystem_C_ComputeWeaponInstanceData::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemUpgradeSystem_C_ComputeWeaponInstanceData, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000248, "Member 'BP_ItemUpgradeSystem_C_ComputeWeaponInstanceData::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemUpgradeSystem_C_ComputeWeaponInstanceData, K2Node_MakeStruct_FormatArgumentData) == 0x000250, "Member 'BP_ItemUpgradeSystem_C_ComputeWeaponInstanceData::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_ItemUpgradeSystem_C_ComputeWeaponInstanceData, CallFunc_Conv_NameToText_ReturnValue) == 0x000298, "Member 'BP_ItemUpgradeSystem_C_ComputeWeaponInstanceData::CallFunc_Conv_NameToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemUpgradeSystem_C_ComputeWeaponInstanceData, CallFunc_Conv_NameToText_ReturnValue_1) == 0x0002A8, "Member 'BP_ItemUpgradeSystem_C_ComputeWeaponInstanceData::CallFunc_Conv_NameToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ItemUpgradeSystem_C_ComputeWeaponInstanceData, K2Node_MakeStruct_FormatArgumentData_1) == 0x0002B8, "Member 'BP_ItemUpgradeSystem_C_ComputeWeaponInstanceData::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BP_ItemUpgradeSystem_C_ComputeWeaponInstanceData, K2Node_MakeStruct_FormatArgumentData_2) == 0x000300, "Member 'BP_ItemUpgradeSystem_C_ComputeWeaponInstanceData::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(BP_ItemUpgradeSystem_C_ComputeWeaponInstanceData, K2Node_MakeArray_Array) == 0x000348, "Member 'BP_ItemUpgradeSystem_C_ComputeWeaponInstanceData::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_ItemUpgradeSystem_C_ComputeWeaponInstanceData, K2Node_MakeArray_Array_1) == 0x000358, "Member 'BP_ItemUpgradeSystem_C_ComputeWeaponInstanceData::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BP_ItemUpgradeSystem_C_ComputeWeaponInstanceData, CallFunc_Format_ReturnValue) == 0x000368, "Member 'BP_ItemUpgradeSystem_C_ComputeWeaponInstanceData::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemUpgradeSystem_C_ComputeWeaponInstanceData, CallFunc_Format_ReturnValue_1) == 0x000378, "Member 'BP_ItemUpgradeSystem_C_ComputeWeaponInstanceData::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ItemUpgradeSystem_C_ComputeWeaponInstanceData, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000388, "Member 'BP_ItemUpgradeSystem_C_ComputeWeaponInstanceData::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemUpgradeSystem_C_ComputeWeaponInstanceData, CallFunc_GetWeaponDefinition_Found) == 0x000389, "Member 'BP_ItemUpgradeSystem_C_ComputeWeaponInstanceData::CallFunc_GetWeaponDefinition_Found' has a wrong offset!");
static_assert(offsetof(BP_ItemUpgradeSystem_C_ComputeWeaponInstanceData, CallFunc_GetWeaponDefinition_OutRow) == 0x000390, "Member 'BP_ItemUpgradeSystem_C_ComputeWeaponInstanceData::CallFunc_GetWeaponDefinition_OutRow' has a wrong offset!");
static_assert(offsetof(BP_ItemUpgradeSystem_C_ComputeWeaponInstanceData, CallFunc_GetWeaponQualityForUpgradeLevel_Quality) == 0x000480, "Member 'BP_ItemUpgradeSystem_C_ComputeWeaponInstanceData::CallFunc_GetWeaponQualityForUpgradeLevel_Quality' has a wrong offset!");
static_assert(offsetof(BP_ItemUpgradeSystem_C_ComputeWeaponInstanceData, CallFunc_Conv_IntToString_ReturnValue) == 0x000488, "Member 'BP_ItemUpgradeSystem_C_ComputeWeaponInstanceData::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemUpgradeSystem_C_ComputeWeaponInstanceData, CallFunc_Concat_StrStr_ReturnValue) == 0x000498, "Member 'BP_ItemUpgradeSystem_C_ComputeWeaponInstanceData::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemUpgradeSystem_C_ComputeWeaponInstanceData, CallFunc_Conv_StringToName_ReturnValue) == 0x0004A8, "Member 'BP_ItemUpgradeSystem_C_ComputeWeaponInstanceData::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemUpgradeSystem_C_ComputeWeaponInstanceData, CallFunc_GetDataTableRowFromName_OutRow) == 0x0004B0, "Member 'BP_ItemUpgradeSystem_C_ComputeWeaponInstanceData::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BP_ItemUpgradeSystem_C_ComputeWeaponInstanceData, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x0004D0, "Member 'BP_ItemUpgradeSystem_C_ComputeWeaponInstanceData::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemUpgradeSystem_C_ComputeWeaponInstanceData, CallFunc_Conv_NameToText_ReturnValue_2) == 0x0004D8, "Member 'BP_ItemUpgradeSystem_C_ComputeWeaponInstanceData::CallFunc_Conv_NameToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ItemUpgradeSystem_C_ComputeWeaponInstanceData, K2Node_MakeStruct_FormatArgumentData_3) == 0x0004E8, "Member 'BP_ItemUpgradeSystem_C_ComputeWeaponInstanceData::K2Node_MakeStruct_FormatArgumentData_3' has a wrong offset!");
static_assert(offsetof(BP_ItemUpgradeSystem_C_ComputeWeaponInstanceData, K2Node_MakeArray_Array_2) == 0x000530, "Member 'BP_ItemUpgradeSystem_C_ComputeWeaponInstanceData::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(BP_ItemUpgradeSystem_C_ComputeWeaponInstanceData, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000540, "Member 'BP_ItemUpgradeSystem_C_ComputeWeaponInstanceData::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemUpgradeSystem_C_ComputeWeaponInstanceData, CallFunc_Format_ReturnValue_2) == 0x000548, "Member 'BP_ItemUpgradeSystem_C_ComputeWeaponInstanceData::CallFunc_Format_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ItemUpgradeSystem_C_ComputeWeaponInstanceData, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000558, "Member 'BP_ItemUpgradeSystem_C_ComputeWeaponInstanceData::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemUpgradeSystem_C_ComputeWeaponInstanceData, CallFunc_Round_ReturnValue) == 0x000560, "Member 'BP_ItemUpgradeSystem_C_ComputeWeaponInstanceData::CallFunc_Round_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemUpgradeSystem_C_ComputeWeaponInstanceData, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000568, "Member 'BP_ItemUpgradeSystem_C_ComputeWeaponInstanceData::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ItemUpgradeSystem_C_ComputeWeaponInstanceData, CallFunc_Multiply_DoubleDouble_ReturnValue_2) == 0x000570, "Member 'BP_ItemUpgradeSystem_C_ComputeWeaponInstanceData::CallFunc_Multiply_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ItemUpgradeSystem_C_ComputeWeaponInstanceData, CallFunc_Round_ReturnValue_1) == 0x000578, "Member 'BP_ItemUpgradeSystem_C_ComputeWeaponInstanceData::CallFunc_Round_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ItemUpgradeSystem_C_ComputeWeaponInstanceData, CallFunc_Round_ReturnValue_2) == 0x00057C, "Member 'BP_ItemUpgradeSystem_C_ComputeWeaponInstanceData::CallFunc_Round_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ItemUpgradeSystem_C_ComputeWeaponInstanceData, K2Node_MakeStruct_S_WeaponInstanceData_1) == 0x000580, "Member 'BP_ItemUpgradeSystem_C_ComputeWeaponInstanceData::K2Node_MakeStruct_S_WeaponInstanceData_1' has a wrong offset!");

// Function BP_ItemUpgradeSystem.BP_ItemUpgradeSystem_C.ComputeWeaponUnlockedPassivesFromID
// 0x00F0 (0x00F0 - 0x0000)
struct BP_ItemUpgradeSystem_C_ComputeWeaponUnlockedPassivesFromID final
{
public:
	class FName                                   WeaponID;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           ActivePassiveEffectIDs;                            // 0x0008(0x0010)(Parm, OutParm)
	TMap<EWeaponQuality, class FName>             local_passiveByLevel;                              // 0x0018(0x0050)(Edit, BlueprintVisible)
	EWeaponQuality                                local_weaponQuality;                               // 0x0068(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<EWeaponQuality, class FName>             K2Node_MakeVariable_MakeVariableOutput;            // 0x0070(0x0050)()
	class UBP_ItemUpgradeSystem_C*                CallFunc_GetItemUpgradeSystem_ReturnValue;         // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_ItemInstance_Base_C*                CallFunc_FindItemInstanceByID_ItemInstance;        // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_ItemInstance_Gear_C*                K2Node_DynamicCast_AsBP_Item_Instance_Gear;        // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_GetUnlockedPassiveEffectsIDs_PassiveEffectIDs; // 0x00E0(0x0010)(ReferenceParm)
};
static_assert(alignof(BP_ItemUpgradeSystem_C_ComputeWeaponUnlockedPassivesFromID) == 0x000008, "Wrong alignment on BP_ItemUpgradeSystem_C_ComputeWeaponUnlockedPassivesFromID");
static_assert(sizeof(BP_ItemUpgradeSystem_C_ComputeWeaponUnlockedPassivesFromID) == 0x0000F0, "Wrong size on BP_ItemUpgradeSystem_C_ComputeWeaponUnlockedPassivesFromID");
static_assert(offsetof(BP_ItemUpgradeSystem_C_ComputeWeaponUnlockedPassivesFromID, WeaponID) == 0x000000, "Member 'BP_ItemUpgradeSystem_C_ComputeWeaponUnlockedPassivesFromID::WeaponID' has a wrong offset!");
static_assert(offsetof(BP_ItemUpgradeSystem_C_ComputeWeaponUnlockedPassivesFromID, ActivePassiveEffectIDs) == 0x000008, "Member 'BP_ItemUpgradeSystem_C_ComputeWeaponUnlockedPassivesFromID::ActivePassiveEffectIDs' has a wrong offset!");
static_assert(offsetof(BP_ItemUpgradeSystem_C_ComputeWeaponUnlockedPassivesFromID, local_passiveByLevel) == 0x000018, "Member 'BP_ItemUpgradeSystem_C_ComputeWeaponUnlockedPassivesFromID::local_passiveByLevel' has a wrong offset!");
static_assert(offsetof(BP_ItemUpgradeSystem_C_ComputeWeaponUnlockedPassivesFromID, local_weaponQuality) == 0x000068, "Member 'BP_ItemUpgradeSystem_C_ComputeWeaponUnlockedPassivesFromID::local_weaponQuality' has a wrong offset!");
static_assert(offsetof(BP_ItemUpgradeSystem_C_ComputeWeaponUnlockedPassivesFromID, K2Node_MakeVariable_MakeVariableOutput) == 0x000070, "Member 'BP_ItemUpgradeSystem_C_ComputeWeaponUnlockedPassivesFromID::K2Node_MakeVariable_MakeVariableOutput' has a wrong offset!");
static_assert(offsetof(BP_ItemUpgradeSystem_C_ComputeWeaponUnlockedPassivesFromID, CallFunc_GetItemUpgradeSystem_ReturnValue) == 0x0000C0, "Member 'BP_ItemUpgradeSystem_C_ComputeWeaponUnlockedPassivesFromID::CallFunc_GetItemUpgradeSystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemUpgradeSystem_C_ComputeWeaponUnlockedPassivesFromID, CallFunc_FindItemInstanceByID_ItemInstance) == 0x0000C8, "Member 'BP_ItemUpgradeSystem_C_ComputeWeaponUnlockedPassivesFromID::CallFunc_FindItemInstanceByID_ItemInstance' has a wrong offset!");
static_assert(offsetof(BP_ItemUpgradeSystem_C_ComputeWeaponUnlockedPassivesFromID, K2Node_DynamicCast_AsBP_Item_Instance_Gear) == 0x0000D0, "Member 'BP_ItemUpgradeSystem_C_ComputeWeaponUnlockedPassivesFromID::K2Node_DynamicCast_AsBP_Item_Instance_Gear' has a wrong offset!");
static_assert(offsetof(BP_ItemUpgradeSystem_C_ComputeWeaponUnlockedPassivesFromID, K2Node_DynamicCast_bSuccess) == 0x0000D8, "Member 'BP_ItemUpgradeSystem_C_ComputeWeaponUnlockedPassivesFromID::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ItemUpgradeSystem_C_ComputeWeaponUnlockedPassivesFromID, CallFunc_GetUnlockedPassiveEffectsIDs_PassiveEffectIDs) == 0x0000E0, "Member 'BP_ItemUpgradeSystem_C_ComputeWeaponUnlockedPassivesFromID::CallFunc_GetUnlockedPassiveEffectsIDs_PassiveEffectIDs' has a wrong offset!");

// Function BP_ItemUpgradeSystem.BP_ItemUpgradeSystem_C.CreateInventorySaveState
// 0x0090 (0x0090 - 0x0000)
struct BP_ItemUpgradeSystem_C_CreateInventorySaveState final
{
public:
	TArray<struct FS_WeaponInstanceHandle>        WeaponHandles;                                     // 0x0000(0x0010)(Parm, OutParm)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FS_WeaponInstanceHandle>        Temp_wildcard_Temp_buffer_array_Variable;          // 0x0018(0x0010)(ConstParm, ReferenceParm)
	TArray<struct FS_WeaponInstanceHandle>        Temp_wildcard_We_need_a_second_array_to_store_the_result_and_be_able_to_wipe_the_first__buffer__array_Variable; // 0x0028(0x0010)(ConstParm, ReferenceParm)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UBP_ItemInstance_Base_C*>        CallFunc_Map_Values_Values;                        // 0x0040(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_ItemInstance_Base_C*                CallFunc_Array_Get_Item;                           // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_ItemInstance_Gear_C*                K2Node_DynamicCast_AsBP_Item_Instance_Gear;        // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetCurrentLevel_ReturnValue;              // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetItemDefinitionID_ReturnValue;          // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_WeaponInstanceHandle                K2Node_MakeStruct_S_WeaponInstanceHandle;          // 0x0080(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ItemUpgradeSystem_C_CreateInventorySaveState) == 0x000008, "Wrong alignment on BP_ItemUpgradeSystem_C_CreateInventorySaveState");
static_assert(sizeof(BP_ItemUpgradeSystem_C_CreateInventorySaveState) == 0x000090, "Wrong size on BP_ItemUpgradeSystem_C_CreateInventorySaveState");
static_assert(offsetof(BP_ItemUpgradeSystem_C_CreateInventorySaveState, WeaponHandles) == 0x000000, "Member 'BP_ItemUpgradeSystem_C_CreateInventorySaveState::WeaponHandles' has a wrong offset!");
static_assert(offsetof(BP_ItemUpgradeSystem_C_CreateInventorySaveState, Temp_int_Array_Index_Variable) == 0x000010, "Member 'BP_ItemUpgradeSystem_C_CreateInventorySaveState::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_ItemUpgradeSystem_C_CreateInventorySaveState, Temp_wildcard_Temp_buffer_array_Variable) == 0x000018, "Member 'BP_ItemUpgradeSystem_C_CreateInventorySaveState::Temp_wildcard_Temp_buffer_array_Variable' has a wrong offset!");
static_assert(offsetof(BP_ItemUpgradeSystem_C_CreateInventorySaveState, Temp_wildcard_We_need_a_second_array_to_store_the_result_and_be_able_to_wipe_the_first__buffer__array_Variable) == 0x000028, "Member 'BP_ItemUpgradeSystem_C_CreateInventorySaveState::Temp_wildcard_We_need_a_second_array_to_store_the_result_and_be_able_to_wipe_the_first__buffer__array_Variable' has a wrong offset!");
static_assert(offsetof(BP_ItemUpgradeSystem_C_CreateInventorySaveState, Temp_int_Loop_Counter_Variable) == 0x000038, "Member 'BP_ItemUpgradeSystem_C_CreateInventorySaveState::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_ItemUpgradeSystem_C_CreateInventorySaveState, CallFunc_Add_IntInt_ReturnValue) == 0x00003C, "Member 'BP_ItemUpgradeSystem_C_CreateInventorySaveState::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemUpgradeSystem_C_CreateInventorySaveState, CallFunc_Map_Values_Values) == 0x000040, "Member 'BP_ItemUpgradeSystem_C_CreateInventorySaveState::CallFunc_Map_Values_Values' has a wrong offset!");
static_assert(offsetof(BP_ItemUpgradeSystem_C_CreateInventorySaveState, CallFunc_Array_Length_ReturnValue) == 0x000050, "Member 'BP_ItemUpgradeSystem_C_CreateInventorySaveState::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemUpgradeSystem_C_CreateInventorySaveState, CallFunc_Array_Get_Item) == 0x000058, "Member 'BP_ItemUpgradeSystem_C_CreateInventorySaveState::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_ItemUpgradeSystem_C_CreateInventorySaveState, CallFunc_Less_IntInt_ReturnValue) == 0x000060, "Member 'BP_ItemUpgradeSystem_C_CreateInventorySaveState::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemUpgradeSystem_C_CreateInventorySaveState, K2Node_DynamicCast_AsBP_Item_Instance_Gear) == 0x000068, "Member 'BP_ItemUpgradeSystem_C_CreateInventorySaveState::K2Node_DynamicCast_AsBP_Item_Instance_Gear' has a wrong offset!");
static_assert(offsetof(BP_ItemUpgradeSystem_C_CreateInventorySaveState, K2Node_DynamicCast_bSuccess) == 0x000070, "Member 'BP_ItemUpgradeSystem_C_CreateInventorySaveState::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ItemUpgradeSystem_C_CreateInventorySaveState, CallFunc_GetCurrentLevel_ReturnValue) == 0x000074, "Member 'BP_ItemUpgradeSystem_C_CreateInventorySaveState::CallFunc_GetCurrentLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemUpgradeSystem_C_CreateInventorySaveState, CallFunc_GetItemDefinitionID_ReturnValue) == 0x000078, "Member 'BP_ItemUpgradeSystem_C_CreateInventorySaveState::CallFunc_GetItemDefinitionID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemUpgradeSystem_C_CreateInventorySaveState, K2Node_MakeStruct_S_WeaponInstanceHandle) == 0x000080, "Member 'BP_ItemUpgradeSystem_C_CreateInventorySaveState::K2Node_MakeStruct_S_WeaponInstanceHandle' has a wrong offset!");
static_assert(offsetof(BP_ItemUpgradeSystem_C_CreateInventorySaveState, CallFunc_Array_Add_ReturnValue) == 0x00008C, "Member 'BP_ItemUpgradeSystem_C_CreateInventorySaveState::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function BP_ItemUpgradeSystem.BP_ItemUpgradeSystem_C.CreateItemInstanceInternal
// 0x0150 (0x0150 - 0x0000)
struct BP_ItemUpgradeSystem_C_CreateItemInstanceInternal final
{
public:
	struct FS_jRPG_Item_StaticData                ItemStaticData;                                    // 0x0000(0x0130)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         Quantity;                                          // 0x0130(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_134[0x4];                                      // 0x0134(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_ItemInstance_Base_C*                ItemInstance;                                      // 0x0138(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_GetItemInstanceClassFromData_ReturnValue; // 0x0140(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_ItemInstance_Base_C*                CallFunc_SpawnObject_ReturnValue;                  // 0x0148(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ItemUpgradeSystem_C_CreateItemInstanceInternal) == 0x000008, "Wrong alignment on BP_ItemUpgradeSystem_C_CreateItemInstanceInternal");
static_assert(sizeof(BP_ItemUpgradeSystem_C_CreateItemInstanceInternal) == 0x000150, "Wrong size on BP_ItemUpgradeSystem_C_CreateItemInstanceInternal");
static_assert(offsetof(BP_ItemUpgradeSystem_C_CreateItemInstanceInternal, ItemStaticData) == 0x000000, "Member 'BP_ItemUpgradeSystem_C_CreateItemInstanceInternal::ItemStaticData' has a wrong offset!");
static_assert(offsetof(BP_ItemUpgradeSystem_C_CreateItemInstanceInternal, Quantity) == 0x000130, "Member 'BP_ItemUpgradeSystem_C_CreateItemInstanceInternal::Quantity' has a wrong offset!");
static_assert(offsetof(BP_ItemUpgradeSystem_C_CreateItemInstanceInternal, ItemInstance) == 0x000138, "Member 'BP_ItemUpgradeSystem_C_CreateItemInstanceInternal::ItemInstance' has a wrong offset!");
static_assert(offsetof(BP_ItemUpgradeSystem_C_CreateItemInstanceInternal, CallFunc_GetItemInstanceClassFromData_ReturnValue) == 0x000140, "Member 'BP_ItemUpgradeSystem_C_CreateItemInstanceInternal::CallFunc_GetItemInstanceClassFromData_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemUpgradeSystem_C_CreateItemInstanceInternal, CallFunc_SpawnObject_ReturnValue) == 0x000148, "Member 'BP_ItemUpgradeSystem_C_CreateItemInstanceInternal::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");

// Function BP_ItemUpgradeSystem.BP_ItemUpgradeSystem_C.CreateItemInstanceTransient
// 0x0148 (0x0148 - 0x0000)
struct BP_ItemUpgradeSystem_C_CreateItemInstanceTransient final
{
public:
	struct FS_jRPG_Item_StaticData                ItemStaticData;                                    // 0x0000(0x0130)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         Quantity;                                          // 0x0130(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_134[0x4];                                      // 0x0134(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_ItemInstance_Base_C*                ItemInstance;                                      // 0x0138(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_ItemInstance_Base_C*                CallFunc_CreateItemInstanceInternal_ItemInstance;  // 0x0140(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ItemUpgradeSystem_C_CreateItemInstanceTransient) == 0x000008, "Wrong alignment on BP_ItemUpgradeSystem_C_CreateItemInstanceTransient");
static_assert(sizeof(BP_ItemUpgradeSystem_C_CreateItemInstanceTransient) == 0x000148, "Wrong size on BP_ItemUpgradeSystem_C_CreateItemInstanceTransient");
static_assert(offsetof(BP_ItemUpgradeSystem_C_CreateItemInstanceTransient, ItemStaticData) == 0x000000, "Member 'BP_ItemUpgradeSystem_C_CreateItemInstanceTransient::ItemStaticData' has a wrong offset!");
static_assert(offsetof(BP_ItemUpgradeSystem_C_CreateItemInstanceTransient, Quantity) == 0x000130, "Member 'BP_ItemUpgradeSystem_C_CreateItemInstanceTransient::Quantity' has a wrong offset!");
static_assert(offsetof(BP_ItemUpgradeSystem_C_CreateItemInstanceTransient, ItemInstance) == 0x000138, "Member 'BP_ItemUpgradeSystem_C_CreateItemInstanceTransient::ItemInstance' has a wrong offset!");
static_assert(offsetof(BP_ItemUpgradeSystem_C_CreateItemInstanceTransient, CallFunc_CreateItemInstanceInternal_ItemInstance) == 0x000140, "Member 'BP_ItemUpgradeSystem_C_CreateItemInstanceTransient::CallFunc_CreateItemInstanceInternal_ItemInstance' has a wrong offset!");

// Function BP_ItemUpgradeSystem.BP_ItemUpgradeSystem_C.ExecuteUbergraph_BP_ItemUpgradeSystem
// 0x01E8 (0x01E8 - 0x0000)
struct BP_ItemUpgradeSystem_C_ExecuteUbergraph_BP_ItemUpgradeSystem final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_WeaponID;                       // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_NewLevel;                       // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPackagedForDistribution_ReturnValue;    // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_NameToText_ReturnValue;              // 0x0018(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0028(0x0048)(HasGetValueTypeHash)
	class UBP_ItemInstance_Base_C*                CallFunc_FindItemInstanceByID_ItemInstance;        // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPackagedForDistribution_ReturnValue_1;  // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_ItemInstance_Gear_C*                K2Node_DynamicCast_AsBP_Item_Instance_Gear;        // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetCurrentLevel_ReturnValue;              // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_WeaponID_1;                     // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00A0(0x0048)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_NameToText_ReturnValue_1;            // 0x00E8(0x0010)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00F8(0x0010)(ReferenceParm)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0108(0x0048)(HasGetValueTypeHash)
	class FString                                 CallFunc_Format_ReturnValue;                       // 0x0150(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UBP_ItemInstance_Base_C*                CallFunc_FindItemInstanceByID_ItemInstance_1;      // 0x0160(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_ItemInstance_Gear_C*                K2Node_DynamicCast_AsBP_Item_Instance_Gear_1;      // 0x0168(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_171[0x3];                                      // 0x0171(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetCurrentLevel_ReturnValue_1;            // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue_1;            // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x0180(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x01C8(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Format_ReturnValue_1;                     // 0x01D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ItemUpgradeSystem_C_ExecuteUbergraph_BP_ItemUpgradeSystem) == 0x000008, "Wrong alignment on BP_ItemUpgradeSystem_C_ExecuteUbergraph_BP_ItemUpgradeSystem");
static_assert(sizeof(BP_ItemUpgradeSystem_C_ExecuteUbergraph_BP_ItemUpgradeSystem) == 0x0001E8, "Wrong size on BP_ItemUpgradeSystem_C_ExecuteUbergraph_BP_ItemUpgradeSystem");
static_assert(offsetof(BP_ItemUpgradeSystem_C_ExecuteUbergraph_BP_ItemUpgradeSystem, EntryPoint) == 0x000000, "Member 'BP_ItemUpgradeSystem_C_ExecuteUbergraph_BP_ItemUpgradeSystem::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ItemUpgradeSystem_C_ExecuteUbergraph_BP_ItemUpgradeSystem, K2Node_CustomEvent_WeaponID) == 0x000004, "Member 'BP_ItemUpgradeSystem_C_ExecuteUbergraph_BP_ItemUpgradeSystem::K2Node_CustomEvent_WeaponID' has a wrong offset!");
static_assert(offsetof(BP_ItemUpgradeSystem_C_ExecuteUbergraph_BP_ItemUpgradeSystem, K2Node_CustomEvent_NewLevel) == 0x00000C, "Member 'BP_ItemUpgradeSystem_C_ExecuteUbergraph_BP_ItemUpgradeSystem::K2Node_CustomEvent_NewLevel' has a wrong offset!");
static_assert(offsetof(BP_ItemUpgradeSystem_C_ExecuteUbergraph_BP_ItemUpgradeSystem, CallFunc_IsPackagedForDistribution_ReturnValue) == 0x000010, "Member 'BP_ItemUpgradeSystem_C_ExecuteUbergraph_BP_ItemUpgradeSystem::CallFunc_IsPackagedForDistribution_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemUpgradeSystem_C_ExecuteUbergraph_BP_ItemUpgradeSystem, CallFunc_Conv_NameToText_ReturnValue) == 0x000018, "Member 'BP_ItemUpgradeSystem_C_ExecuteUbergraph_BP_ItemUpgradeSystem::CallFunc_Conv_NameToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemUpgradeSystem_C_ExecuteUbergraph_BP_ItemUpgradeSystem, K2Node_MakeStruct_FormatArgumentData) == 0x000028, "Member 'BP_ItemUpgradeSystem_C_ExecuteUbergraph_BP_ItemUpgradeSystem::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_ItemUpgradeSystem_C_ExecuteUbergraph_BP_ItemUpgradeSystem, CallFunc_FindItemInstanceByID_ItemInstance) == 0x000070, "Member 'BP_ItemUpgradeSystem_C_ExecuteUbergraph_BP_ItemUpgradeSystem::CallFunc_FindItemInstanceByID_ItemInstance' has a wrong offset!");
static_assert(offsetof(BP_ItemUpgradeSystem_C_ExecuteUbergraph_BP_ItemUpgradeSystem, CallFunc_IsPackagedForDistribution_ReturnValue_1) == 0x000078, "Member 'BP_ItemUpgradeSystem_C_ExecuteUbergraph_BP_ItemUpgradeSystem::CallFunc_IsPackagedForDistribution_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ItemUpgradeSystem_C_ExecuteUbergraph_BP_ItemUpgradeSystem, K2Node_DynamicCast_AsBP_Item_Instance_Gear) == 0x000080, "Member 'BP_ItemUpgradeSystem_C_ExecuteUbergraph_BP_ItemUpgradeSystem::K2Node_DynamicCast_AsBP_Item_Instance_Gear' has a wrong offset!");
static_assert(offsetof(BP_ItemUpgradeSystem_C_ExecuteUbergraph_BP_ItemUpgradeSystem, K2Node_DynamicCast_bSuccess) == 0x000088, "Member 'BP_ItemUpgradeSystem_C_ExecuteUbergraph_BP_ItemUpgradeSystem::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ItemUpgradeSystem_C_ExecuteUbergraph_BP_ItemUpgradeSystem, CallFunc_GetCurrentLevel_ReturnValue) == 0x00008C, "Member 'BP_ItemUpgradeSystem_C_ExecuteUbergraph_BP_ItemUpgradeSystem::CallFunc_GetCurrentLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemUpgradeSystem_C_ExecuteUbergraph_BP_ItemUpgradeSystem, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000090, "Member 'BP_ItemUpgradeSystem_C_ExecuteUbergraph_BP_ItemUpgradeSystem::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemUpgradeSystem_C_ExecuteUbergraph_BP_ItemUpgradeSystem, K2Node_CustomEvent_WeaponID_1) == 0x000098, "Member 'BP_ItemUpgradeSystem_C_ExecuteUbergraph_BP_ItemUpgradeSystem::K2Node_CustomEvent_WeaponID_1' has a wrong offset!");
static_assert(offsetof(BP_ItemUpgradeSystem_C_ExecuteUbergraph_BP_ItemUpgradeSystem, K2Node_MakeStruct_FormatArgumentData_1) == 0x0000A0, "Member 'BP_ItemUpgradeSystem_C_ExecuteUbergraph_BP_ItemUpgradeSystem::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BP_ItemUpgradeSystem_C_ExecuteUbergraph_BP_ItemUpgradeSystem, CallFunc_Conv_NameToText_ReturnValue_1) == 0x0000E8, "Member 'BP_ItemUpgradeSystem_C_ExecuteUbergraph_BP_ItemUpgradeSystem::CallFunc_Conv_NameToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ItemUpgradeSystem_C_ExecuteUbergraph_BP_ItemUpgradeSystem, K2Node_MakeArray_Array) == 0x0000F8, "Member 'BP_ItemUpgradeSystem_C_ExecuteUbergraph_BP_ItemUpgradeSystem::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_ItemUpgradeSystem_C_ExecuteUbergraph_BP_ItemUpgradeSystem, K2Node_MakeStruct_FormatArgumentData_2) == 0x000108, "Member 'BP_ItemUpgradeSystem_C_ExecuteUbergraph_BP_ItemUpgradeSystem::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(BP_ItemUpgradeSystem_C_ExecuteUbergraph_BP_ItemUpgradeSystem, CallFunc_Format_ReturnValue) == 0x000150, "Member 'BP_ItemUpgradeSystem_C_ExecuteUbergraph_BP_ItemUpgradeSystem::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemUpgradeSystem_C_ExecuteUbergraph_BP_ItemUpgradeSystem, CallFunc_FindItemInstanceByID_ItemInstance_1) == 0x000160, "Member 'BP_ItemUpgradeSystem_C_ExecuteUbergraph_BP_ItemUpgradeSystem::CallFunc_FindItemInstanceByID_ItemInstance_1' has a wrong offset!");
static_assert(offsetof(BP_ItemUpgradeSystem_C_ExecuteUbergraph_BP_ItemUpgradeSystem, K2Node_DynamicCast_AsBP_Item_Instance_Gear_1) == 0x000168, "Member 'BP_ItemUpgradeSystem_C_ExecuteUbergraph_BP_ItemUpgradeSystem::K2Node_DynamicCast_AsBP_Item_Instance_Gear_1' has a wrong offset!");
static_assert(offsetof(BP_ItemUpgradeSystem_C_ExecuteUbergraph_BP_ItemUpgradeSystem, K2Node_DynamicCast_bSuccess_1) == 0x000170, "Member 'BP_ItemUpgradeSystem_C_ExecuteUbergraph_BP_ItemUpgradeSystem::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_ItemUpgradeSystem_C_ExecuteUbergraph_BP_ItemUpgradeSystem, CallFunc_GetCurrentLevel_ReturnValue_1) == 0x000174, "Member 'BP_ItemUpgradeSystem_C_ExecuteUbergraph_BP_ItemUpgradeSystem::CallFunc_GetCurrentLevel_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ItemUpgradeSystem_C_ExecuteUbergraph_BP_ItemUpgradeSystem, CallFunc_Conv_IntToInt64_ReturnValue_1) == 0x000178, "Member 'BP_ItemUpgradeSystem_C_ExecuteUbergraph_BP_ItemUpgradeSystem::CallFunc_Conv_IntToInt64_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ItemUpgradeSystem_C_ExecuteUbergraph_BP_ItemUpgradeSystem, K2Node_MakeStruct_FormatArgumentData_3) == 0x000180, "Member 'BP_ItemUpgradeSystem_C_ExecuteUbergraph_BP_ItemUpgradeSystem::K2Node_MakeStruct_FormatArgumentData_3' has a wrong offset!");
static_assert(offsetof(BP_ItemUpgradeSystem_C_ExecuteUbergraph_BP_ItemUpgradeSystem, K2Node_MakeArray_Array_1) == 0x0001C8, "Member 'BP_ItemUpgradeSystem_C_ExecuteUbergraph_BP_ItemUpgradeSystem::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BP_ItemUpgradeSystem_C_ExecuteUbergraph_BP_ItemUpgradeSystem, CallFunc_Format_ReturnValue_1) == 0x0001D8, "Member 'BP_ItemUpgradeSystem_C_ExecuteUbergraph_BP_ItemUpgradeSystem::CallFunc_Format_ReturnValue_1' has a wrong offset!");

// Function BP_ItemUpgradeSystem.BP_ItemUpgradeSystem_C.FindItemInstanceByID
// 0x0020 (0x0020 - 0x0000)
struct BP_ItemUpgradeSystem_C_FindItemInstanceByID final
{
public:
	class FName                                   ItemDefinitionID;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_ItemInstance_Base_C*                ItemInstance;                                      // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_ItemInstance_Base_C*                CallFunc_Map_Find_Value;                           // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ItemUpgradeSystem_C_FindItemInstanceByID) == 0x000008, "Wrong alignment on BP_ItemUpgradeSystem_C_FindItemInstanceByID");
static_assert(sizeof(BP_ItemUpgradeSystem_C_FindItemInstanceByID) == 0x000020, "Wrong size on BP_ItemUpgradeSystem_C_FindItemInstanceByID");
static_assert(offsetof(BP_ItemUpgradeSystem_C_FindItemInstanceByID, ItemDefinitionID) == 0x000000, "Member 'BP_ItemUpgradeSystem_C_FindItemInstanceByID::ItemDefinitionID' has a wrong offset!");
static_assert(offsetof(BP_ItemUpgradeSystem_C_FindItemInstanceByID, ItemInstance) == 0x000008, "Member 'BP_ItemUpgradeSystem_C_FindItemInstanceByID::ItemInstance' has a wrong offset!");
static_assert(offsetof(BP_ItemUpgradeSystem_C_FindItemInstanceByID, CallFunc_Map_Find_Value) == 0x000010, "Member 'BP_ItemUpgradeSystem_C_FindItemInstanceByID::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BP_ItemUpgradeSystem_C_FindItemInstanceByID, CallFunc_Map_Find_ReturnValue) == 0x000018, "Member 'BP_ItemUpgradeSystem_C_FindItemInstanceByID::CallFunc_Map_Find_ReturnValue' has a wrong offset!");

// Function BP_ItemUpgradeSystem.BP_ItemUpgradeSystem_C.FindWeaponInstanceByWeaponID
// 0x0120 (0x0120 - 0x0000)
struct BP_ItemUpgradeSystem_C_FindWeaponInstanceByWeaponID final
{
public:
	class FName                                   WeaponDefinitionID;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Found;                                             // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         WeaponIndex;                                       // 0x000C(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_WeaponInstanceData                  WeaponInstanceData;                                // 0x0010(0x0110)(Parm, OutParm, HasGetValueTypeHash)
};
static_assert(alignof(BP_ItemUpgradeSystem_C_FindWeaponInstanceByWeaponID) == 0x000008, "Wrong alignment on BP_ItemUpgradeSystem_C_FindWeaponInstanceByWeaponID");
static_assert(sizeof(BP_ItemUpgradeSystem_C_FindWeaponInstanceByWeaponID) == 0x000120, "Wrong size on BP_ItemUpgradeSystem_C_FindWeaponInstanceByWeaponID");
static_assert(offsetof(BP_ItemUpgradeSystem_C_FindWeaponInstanceByWeaponID, WeaponDefinitionID) == 0x000000, "Member 'BP_ItemUpgradeSystem_C_FindWeaponInstanceByWeaponID::WeaponDefinitionID' has a wrong offset!");
static_assert(offsetof(BP_ItemUpgradeSystem_C_FindWeaponInstanceByWeaponID, Found) == 0x000008, "Member 'BP_ItemUpgradeSystem_C_FindWeaponInstanceByWeaponID::Found' has a wrong offset!");
static_assert(offsetof(BP_ItemUpgradeSystem_C_FindWeaponInstanceByWeaponID, WeaponIndex) == 0x00000C, "Member 'BP_ItemUpgradeSystem_C_FindWeaponInstanceByWeaponID::WeaponIndex' has a wrong offset!");
static_assert(offsetof(BP_ItemUpgradeSystem_C_FindWeaponInstanceByWeaponID, WeaponInstanceData) == 0x000010, "Member 'BP_ItemUpgradeSystem_C_FindWeaponInstanceByWeaponID::WeaponInstanceData' has a wrong offset!");

// Function BP_ItemUpgradeSystem.BP_ItemUpgradeSystem_C.GetAllItemInstances
// 0x0020 (0x0020 - 0x0000)
struct BP_ItemUpgradeSystem_C_GetAllItemInstances final
{
public:
	TArray<class UBP_ItemInstance_Base_C*>        ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm)
	TArray<class UBP_ItemInstance_Base_C*>        CallFunc_Map_Values_Values;                        // 0x0010(0x0010)(ReferenceParm)
};
static_assert(alignof(BP_ItemUpgradeSystem_C_GetAllItemInstances) == 0x000008, "Wrong alignment on BP_ItemUpgradeSystem_C_GetAllItemInstances");
static_assert(sizeof(BP_ItemUpgradeSystem_C_GetAllItemInstances) == 0x000020, "Wrong size on BP_ItemUpgradeSystem_C_GetAllItemInstances");
static_assert(offsetof(BP_ItemUpgradeSystem_C_GetAllItemInstances, ReturnValue) == 0x000000, "Member 'BP_ItemUpgradeSystem_C_GetAllItemInstances::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemUpgradeSystem_C_GetAllItemInstances, CallFunc_Map_Values_Values) == 0x000010, "Member 'BP_ItemUpgradeSystem_C_GetAllItemInstances::CallFunc_Map_Values_Values' has a wrong offset!");

// Function BP_ItemUpgradeSystem.BP_ItemUpgradeSystem_C.GetItemInstanceClassFromData
// 0x0148 (0x0148 - 0x0000)
struct BP_ItemUpgradeSystem_C_GetItemInstanceClassFromData final
{
public:
