#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_InteractiveEnvironmentManagerComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "E_InteractiveEnvironmentType_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "S_ListOfActorsPerInteractionType_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_InteractiveEnvironmentManagerComponent.BP_InteractiveEnvironmentManagerComponent_C
// 0x0140 (0x01E0 - 0x00A0)
class UBP_InteractiveEnvironmentManagerComponent_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          IsEnabled;                                         // 0x00A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UBP_EnvironmentInteractorComponent_C*> EnvironmentInteractorComponent;              // 0x00B0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	struct FVector                                CurrentSnappedWorldLocation;                       // 0x00C0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextureRenderTarget2D*                 GrassRenderTarget_Flip;                            // 0x00D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UTextureRenderTarget2D*                 GrassRenderTarget_Flop;                            // 0x00E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UTextureRenderTarget2D*                 SnowRenderTarget_Flip;                             // 0x00E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UTextureRenderTarget2D*                 SnowRenderTarget_Flop;                             // 0x00F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UTextureRenderTarget2D*                 SandRenderTarget_Flip;                             // 0x00F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UTextureRenderTarget2D*                 SandRenderTarget_Flop;                             // 0x0100(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         GrassMulitplySizeInteractionZone;                  // 0x0108(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SandMultiplySizeInteractionZone;                   // 0x010C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SnowMulitplySizeInteractionZone;                   // 0x0110(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DEBUG_DisplayInteractors;                          // 0x0114(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_115[0x3];                                      // 0x0115(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialParameterCollection*           MPC_Global;                                        // 0x0118(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TMap<E_InteractiveEnvironmentType, struct FVector> PreviousCamPositions;                         // 0x0120(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class ABP_TriggerInteractiveEnvironmentZone_C*> ArrayOfTriggerInteractiveZone;            // 0x0170(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	TArray<class UBP_EnvironmentInteractorComponent_C*> ArrayOfTempInteractorComponents;             // 0x0180(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TMap<E_InteractiveEnvironmentType, struct FS_ListOfActorsPerInteractionType> TypeMapOfStructArray; // 0x0190(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_BP_InteractiveEnvironmentManagerComponent(int32 EntryPoint);
	class FName GetEnvironmentInteractionTypeMPC_ID(E_InteractiveEnvironmentType Enumerator);
	void GetOrCreateActorList(const E_InteractiveEnvironmentType& Key, struct FS_ListOfActorsPerInteractionType* List);
	void ReceiveBeginPlay();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void ReceiveTick(float DeltaSeconds);
	void RegisterGrassInteractor(class AActor* Actor);
	void RegisterGrassInteractorComponent(class UBP_EnvironmentInteractorComponent_C* Component);
	void Retrieve_Actor_List_from_Zones();
	struct FVector SnapWorldLocation(const struct FVector& A, int32 MulitplySizeOfInteraction);
	void StampOnCanvasAndRenderMaterialFull(class UTextureRenderTarget2D* Render_Target_Flip, class UTextureRenderTarget2D* Render_Target_Flop, class UMaterialInterface* Parent_Canvas_Material, bool IsFlip, const E_InteractiveEnvironmentType TypeOfInteraction, double Impact_Size_Multiplicator, class UMaterialInterface* Stamp_Material, int32 MulitplySizeOfInteraction, bool IsStampRotate);
	void UnregisterGrassInteractor(class AActor* Actor);
	void UnregisterGrassInteractorComponent(const class UBP_EnvironmentInteractorComponent_C*& InteractorComponent);
	void UpdateActorListInMap(const E_InteractiveEnvironmentType& Key, const struct FS_ListOfActorsPerInteractionType& Value);
	void UpdateTickEnabled();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_InteractiveEnvironmentManagerComponent_C">();
	}
	static class UBP_InteractiveEnvironmentManagerComponent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_InteractiveEnvironmentManagerComponent_C>();
	}
};
static_assert(alignof(UBP_InteractiveEnvironmentManagerComponent_C) == 0x000008, "Wrong alignment on UBP_InteractiveEnvironmentManagerComponent_C");
static_assert(sizeof(UBP_InteractiveEnvironmentManagerComponent_C) == 0x0001E0, "Wrong size on UBP_InteractiveEnvironmentManagerComponent_C");
static_assert(offsetof(UBP_InteractiveEnvironmentManagerComponent_C, UberGraphFrame) == 0x0000A0, "Member 'UBP_InteractiveEnvironmentManagerComponent_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_InteractiveEnvironmentManagerComponent_C, IsEnabled) == 0x0000A8, "Member 'UBP_InteractiveEnvironmentManagerComponent_C::IsEnabled' has a wrong offset!");
static_assert(offsetof(UBP_InteractiveEnvironmentManagerComponent_C, EnvironmentInteractorComponent) == 0x0000B0, "Member 'UBP_InteractiveEnvironmentManagerComponent_C::EnvironmentInteractorComponent' has a wrong offset!");
static_assert(offsetof(UBP_InteractiveEnvironmentManagerComponent_C, CurrentSnappedWorldLocation) == 0x0000C0, "Member 'UBP_InteractiveEnvironmentManagerComponent_C::CurrentSnappedWorldLocation' has a wrong offset!");
static_assert(offsetof(UBP_InteractiveEnvironmentManagerComponent_C, GrassRenderTarget_Flip) == 0x0000D8, "Member 'UBP_InteractiveEnvironmentManagerComponent_C::GrassRenderTarget_Flip' has a wrong offset!");
static_assert(offsetof(UBP_InteractiveEnvironmentManagerComponent_C, GrassRenderTarget_Flop) == 0x0000E0, "Member 'UBP_InteractiveEnvironmentManagerComponent_C::GrassRenderTarget_Flop' has a wrong offset!");
static_assert(offsetof(UBP_InteractiveEnvironmentManagerComponent_C, SnowRenderTarget_Flip) == 0x0000E8, "Member 'UBP_InteractiveEnvironmentManagerComponent_C::SnowRenderTarget_Flip' has a wrong offset!");
static_assert(offsetof(UBP_InteractiveEnvironmentManagerComponent_C, SnowRenderTarget_Flop) == 0x0000F0, "Member 'UBP_InteractiveEnvironmentManagerComponent_C::SnowRenderTarget_Flop' has a wrong offset!");
static_assert(offsetof(UBP_InteractiveEnvironmentManagerComponent_C, SandRenderTarget_Flip) == 0x0000F8, "Member 'UBP_InteractiveEnvironmentManagerComponent_C::SandRenderTarget_Flip' has a wrong offset!");
static_assert(offsetof(UBP_InteractiveEnvironmentManagerComponent_C, SandRenderTarget_Flop) == 0x000100, "Member 'UBP_InteractiveEnvironmentManagerComponent_C::SandRenderTarget_Flop' has a wrong offset!");
static_assert(offsetof(UBP_InteractiveEnvironmentManagerComponent_C, GrassMulitplySizeInteractionZone) == 0x000108, "Member 'UBP_InteractiveEnvironmentManagerComponent_C::GrassMulitplySizeInteractionZone' has a wrong offset!");
static_assert(offsetof(UBP_InteractiveEnvironmentManagerComponent_C, SandMultiplySizeInteractionZone) == 0x00010C, "Member 'UBP_InteractiveEnvironmentManagerComponent_C::SandMultiplySizeInteractionZone' has a wrong offset!");
static_assert(offsetof(UBP_InteractiveEnvironmentManagerComponent_C, SnowMulitplySizeInteractionZone) == 0x000110, "Member 'UBP_InteractiveEnvironmentManagerComponent_C::SnowMulitplySizeInteractionZone' has a wrong offset!");
static_assert(offsetof(UBP_InteractiveEnvironmentManagerComponent_C, DEBUG_DisplayInteractors) == 0x000114, "Member 'UBP_InteractiveEnvironmentManagerComponent_C::DEBUG_DisplayInteractors' has a wrong offset!");
static_assert(offsetof(UBP_InteractiveEnvironmentManagerComponent_C, MPC_Global) == 0x000118, "Member 'UBP_InteractiveEnvironmentManagerComponent_C::MPC_Global' has a wrong offset!");
static_assert(offsetof(UBP_InteractiveEnvironmentManagerComponent_C, PreviousCamPositions) == 0x000120, "Member 'UBP_InteractiveEnvironmentManagerComponent_C::PreviousCamPositions' has a wrong offset!");
static_assert(offsetof(UBP_InteractiveEnvironmentManagerComponent_C, ArrayOfTriggerInteractiveZone) == 0x000170, "Member 'UBP_InteractiveEnvironmentManagerComponent_C::ArrayOfTriggerInteractiveZone' has a wrong offset!");
static_assert(offsetof(UBP_InteractiveEnvironmentManagerComponent_C, ArrayOfTempInteractorComponents) == 0x000180, "Member 'UBP_InteractiveEnvironmentManagerComponent_C::ArrayOfTempInteractorComponents' has a wrong offset!");
static_assert(offsetof(UBP_InteractiveEnvironmentManagerComponent_C, TypeMapOfStructArray) == 0x000190, "Member 'UBP_InteractiveEnvironmentManagerComponent_C::TypeMapOfStructArray' has a wrong offset!");

}

