#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ItemFilter_Base

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_ItemFilter_Base.BP_ItemFilter_Base_C.GetCompatibleItemSorters
// 0x0020 (0x0020 - 0x0000)
struct BP_ItemFilter_Base_C_GetCompatibleItemSorters final
{
public:
	TArray<class UClass*>                         ItemSorters;                                       // 0x0000(0x0010)(Parm, OutParm)
	TArray<class UClass*>                         K2Node_MakeArray_Array;                            // 0x0010(0x0010)(ReferenceParm)
};
static_assert(alignof(BP_ItemFilter_Base_C_GetCompatibleItemSorters) == 0x000008, "Wrong alignment on BP_ItemFilter_Base_C_GetCompatibleItemSorters");
static_assert(sizeof(BP_ItemFilter_Base_C_GetCompatibleItemSorters) == 0x000020, "Wrong size on BP_ItemFilter_Base_C_GetCompatibleItemSorters");
static_assert(offsetof(BP_ItemFilter_Base_C_GetCompatibleItemSorters, ItemSorters) == 0x000000, "Member 'BP_ItemFilter_Base_C_GetCompatibleItemSorters::ItemSorters' has a wrong offset!");
static_assert(offsetof(BP_ItemFilter_Base_C_GetCompatibleItemSorters, K2Node_MakeArray_Array) == 0x000010, "Member 'BP_ItemFilter_Base_C_GetCompatibleItemSorters::K2Node_MakeArray_Array' has a wrong offset!");

// Function BP_ItemFilter_Base.BP_ItemFilter_Base_C.GetDisplayName
// 0x0010 (0x0010 - 0x0000)
struct BP_ItemFilter_Base_C_GetDisplayName final
{
public:
	class FText                                   DisplayName;                                       // 0x0000(0x0010)(Parm, OutParm)
};
static_assert(alignof(BP_ItemFilter_Base_C_GetDisplayName) == 0x000008, "Wrong alignment on BP_ItemFilter_Base_C_GetDisplayName");
static_assert(sizeof(BP_ItemFilter_Base_C_GetDisplayName) == 0x000010, "Wrong size on BP_ItemFilter_Base_C_GetDisplayName");
static_assert(offsetof(BP_ItemFilter_Base_C_GetDisplayName, DisplayName) == 0x000000, "Member 'BP_ItemFilter_Base_C_GetDisplayName::DisplayName' has a wrong offset!");

// Function BP_ItemFilter_Base.BP_ItemFilter_Base_C.ExecuteFilter
// 0x0020 (0x0020 - 0x0000)
struct BP_ItemFilter_Base_C_ExecuteFilter final
{
public:
	TArray<class UBP_ItemInstance_Base_C*>        ItemInstances;                                     // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<class UBP_ItemInstance_Base_C*>        FilteredItemInstances;                             // 0x0010(0x0010)(Parm, OutParm)
};
static_assert(alignof(BP_ItemFilter_Base_C_ExecuteFilter) == 0x000008, "Wrong alignment on BP_ItemFilter_Base_C_ExecuteFilter");
static_assert(sizeof(BP_ItemFilter_Base_C_ExecuteFilter) == 0x000020, "Wrong size on BP_ItemFilter_Base_C_ExecuteFilter");
static_assert(offsetof(BP_ItemFilter_Base_C_ExecuteFilter, ItemInstances) == 0x000000, "Member 'BP_ItemFilter_Base_C_ExecuteFilter::ItemInstances' has a wrong offset!");
static_assert(offsetof(BP_ItemFilter_Base_C_ExecuteFilter, FilteredItemInstances) == 0x000010, "Member 'BP_ItemFilter_Base_C_ExecuteFilter::FilteredItemInstances' has a wrong offset!");

}

