#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_InteractiveBattleMusicController

#include "Basic.hpp"

#include "SandFall_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_InteractiveBattleMusicController.BP_InteractiveBattleMusicController_C
// 0x0018 (0x0040 - 0x0028)
class UBP_InteractiveBattleMusicController_C final : public UExtendedObject
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0028(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	double                                        AlliesHealthRatio;                                 // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        EnemiesHealthRatio;                                // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BPI_OnAnyCharacterAP_Changed(class UBP_BattleEvent_APChange_C* AP_Change);
	void BPI_OnAnyCharacterDamaged(class UBP_BattleDamages_C* BattleDamage);
	void BPI_OnBattleStart();
	void BPI_OnReserveTeamSent();
	void ComputeHealthRatioForCharacters(const TArray<class ABP_jRPG_Character_Battle_Base_C*>& Characters, double* Ratio);
	void ExecuteUbergraph_BP_InteractiveBattleMusicController(int32 EntryPoint);
	void IsTurnStartInProgress(bool* InProgress);
	void OnBattleStop();
	void OnCharacterDealtDamages(class UAC_jRPG_CharacterBattleStats_C* CharacterStats, double Damages, double* ProcessedDamages);
	void OnCharacterKilled(class UAC_jRPG_CharacterBattleStats_C* CharacterStats);
	void OnCharacterReceivedDamages(class UAC_jRPG_CharacterBattleStats_C* TargetCharacter, class UAC_jRPG_CharacterBattleStats_C* SourceCharacter, double ReceivedDamages, class UBP_BattleDamages_C* BattleDamages);
	void OnCharacterResurrected();
	void OnCharacterTurnStart(class UAC_jRPG_CharacterBattleStats_C* CharacterStats, const class UBP_DependencyRefCounter_C*& TurnStartDependencies);
	void OnSuccessfulDodge();
	void OnSuccessfulParry();
	void ProcessAddBuffAction(const class UAction_AddBuff_C*& BuffAddAction);
	void UpdateHealthAudioTriggers();
	void UpdateHealthRatio();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_InteractiveBattleMusicController_C">();
	}
	static class UBP_InteractiveBattleMusicController_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_InteractiveBattleMusicController_C>();
	}
};
static_assert(alignof(UBP_InteractiveBattleMusicController_C) == 0x000008, "Wrong alignment on UBP_InteractiveBattleMusicController_C");
static_assert(sizeof(UBP_InteractiveBattleMusicController_C) == 0x000040, "Wrong size on UBP_InteractiveBattleMusicController_C");
static_assert(offsetof(UBP_InteractiveBattleMusicController_C, UberGraphFrame) == 0x000028, "Member 'UBP_InteractiveBattleMusicController_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_InteractiveBattleMusicController_C, AlliesHealthRatio) == 0x000030, "Member 'UBP_InteractiveBattleMusicController_C::AlliesHealthRatio' has a wrong offset!");
static_assert(offsetof(UBP_InteractiveBattleMusicController_C, EnemiesHealthRatio) == 0x000038, "Member 'UBP_InteractiveBattleMusicController_C::EnemiesHealthRatio' has a wrong offset!");

}

