#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_InteractionSystem

#include "Basic.hpp"

#include "SandFall_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FPromptID_structs.hpp"
#include "FPromptParams_structs.hpp"


namespace SDK::Params
{

// Function BP_InteractionSystem.BP_InteractionSystem_C.AreInteractionsEnabled
// 0x0018 (0x0018 - 0x0000)
struct BP_InteractionSystem_C_AreInteractionsEnabled final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetReferenceCounterState_ReturnValue;     // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_InteractionSystem_C_AreInteractionsEnabled) == 0x000008, "Wrong alignment on BP_InteractionSystem_C_AreInteractionsEnabled");
static_assert(sizeof(BP_InteractionSystem_C_AreInteractionsEnabled) == 0x000018, "Wrong size on BP_InteractionSystem_C_AreInteractionsEnabled");
static_assert(offsetof(BP_InteractionSystem_C_AreInteractionsEnabled, Result) == 0x000000, "Member 'BP_InteractionSystem_C_AreInteractionsEnabled::Result' has a wrong offset!");
static_assert(offsetof(BP_InteractionSystem_C_AreInteractionsEnabled, CallFunc_GetPlayerPawn_ReturnValue) == 0x000008, "Member 'BP_InteractionSystem_C_AreInteractionsEnabled::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractionSystem_C_AreInteractionsEnabled, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'BP_InteractionSystem_C_AreInteractionsEnabled::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractionSystem_C_AreInteractionsEnabled, CallFunc_GetReferenceCounterState_ReturnValue) == 0x000011, "Member 'BP_InteractionSystem_C_AreInteractionsEnabled::CallFunc_GetReferenceCounterState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractionSystem_C_AreInteractionsEnabled, CallFunc_Not_PreBool_ReturnValue) == 0x000012, "Member 'BP_InteractionSystem_C_AreInteractionsEnabled::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractionSystem_C_AreInteractionsEnabled, CallFunc_BooleanAND_ReturnValue) == 0x000013, "Member 'BP_InteractionSystem_C_AreInteractionsEnabled::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BP_InteractionSystem.BP_InteractionSystem_C.AutoUnregisterDistantActor
// 0x0028 (0x0028 - 0x0000)
struct BP_InteractionSystem_C_AutoUnregisterDistantActor final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                EndPlayReason;                                     // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_Interaction_C>    K2Node_DynamicCast_AsBPI_Interaction;              // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_InteractionSystem_C_AutoUnregisterDistantActor) == 0x000008, "Wrong alignment on BP_InteractionSystem_C_AutoUnregisterDistantActor");
static_assert(sizeof(BP_InteractionSystem_C_AutoUnregisterDistantActor) == 0x000028, "Wrong size on BP_InteractionSystem_C_AutoUnregisterDistantActor");
static_assert(offsetof(BP_InteractionSystem_C_AutoUnregisterDistantActor, Actor) == 0x000000, "Member 'BP_InteractionSystem_C_AutoUnregisterDistantActor::Actor' has a wrong offset!");
static_assert(offsetof(BP_InteractionSystem_C_AutoUnregisterDistantActor, EndPlayReason) == 0x000008, "Member 'BP_InteractionSystem_C_AutoUnregisterDistantActor::EndPlayReason' has a wrong offset!");
static_assert(offsetof(BP_InteractionSystem_C_AutoUnregisterDistantActor, K2Node_DynamicCast_AsBPI_Interaction) == 0x000010, "Member 'BP_InteractionSystem_C_AutoUnregisterDistantActor::K2Node_DynamicCast_AsBPI_Interaction' has a wrong offset!");
static_assert(offsetof(BP_InteractionSystem_C_AutoUnregisterDistantActor, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_InteractionSystem_C_AutoUnregisterDistantActor::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BP_InteractionSystem.BP_InteractionSystem_C.CanPlayerInteract
// 0x0020 (0x0020 - 0x0000)
struct BP_InteractionSystem_C_CanPlayerInteract final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_jRPG_Character_World_C*             K2Node_DynamicCast_AsBP_J_RPG_Character_World;     // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCapabilityAllowed_isAllowed;            // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_InteractionSystem_C_CanPlayerInteract) == 0x000008, "Wrong alignment on BP_InteractionSystem_C_CanPlayerInteract");
static_assert(sizeof(BP_InteractionSystem_C_CanPlayerInteract) == 0x000020, "Wrong size on BP_InteractionSystem_C_CanPlayerInteract");
static_assert(offsetof(BP_InteractionSystem_C_CanPlayerInteract, Result) == 0x000000, "Member 'BP_InteractionSystem_C_CanPlayerInteract::Result' has a wrong offset!");
static_assert(offsetof(BP_InteractionSystem_C_CanPlayerInteract, CallFunc_GetPlayerPawn_ReturnValue) == 0x000008, "Member 'BP_InteractionSystem_C_CanPlayerInteract::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractionSystem_C_CanPlayerInteract, K2Node_DynamicCast_AsBP_J_RPG_Character_World) == 0x000010, "Member 'BP_InteractionSystem_C_CanPlayerInteract::K2Node_DynamicCast_AsBP_J_RPG_Character_World' has a wrong offset!");
static_assert(offsetof(BP_InteractionSystem_C_CanPlayerInteract, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_InteractionSystem_C_CanPlayerInteract::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_InteractionSystem_C_CanPlayerInteract, CallFunc_IsCapabilityAllowed_isAllowed) == 0x000019, "Member 'BP_InteractionSystem_C_CanPlayerInteract::CallFunc_IsCapabilityAllowed_isAllowed' has a wrong offset!");

// Function BP_InteractionSystem.BP_InteractionSystem_C.CanPlayerProcessInteraction
// 0x0004 (0x0004 - 0x0000)
struct BP_InteractionSystem_C_CanPlayerProcessInteraction final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AreInteractionsEnabled_Result;            // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanPlayerInteract_Result;                 // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_InteractionSystem_C_CanPlayerProcessInteraction) == 0x000001, "Wrong alignment on BP_InteractionSystem_C_CanPlayerProcessInteraction");
static_assert(sizeof(BP_InteractionSystem_C_CanPlayerProcessInteraction) == 0x000004, "Wrong size on BP_InteractionSystem_C_CanPlayerProcessInteraction");
static_assert(offsetof(BP_InteractionSystem_C_CanPlayerProcessInteraction, ReturnValue) == 0x000000, "Member 'BP_InteractionSystem_C_CanPlayerProcessInteraction::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractionSystem_C_CanPlayerProcessInteraction, CallFunc_AreInteractionsEnabled_Result) == 0x000001, "Member 'BP_InteractionSystem_C_CanPlayerProcessInteraction::CallFunc_AreInteractionsEnabled_Result' has a wrong offset!");
static_assert(offsetof(BP_InteractionSystem_C_CanPlayerProcessInteraction, CallFunc_CanPlayerInteract_Result) == 0x000002, "Member 'BP_InteractionSystem_C_CanPlayerProcessInteraction::CallFunc_CanPlayerInteract_Result' has a wrong offset!");
static_assert(offsetof(BP_InteractionSystem_C_CanPlayerProcessInteraction, CallFunc_BooleanAND_ReturnValue) == 0x000003, "Member 'BP_InteractionSystem_C_CanPlayerProcessInteraction::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BP_InteractionSystem.BP_InteractionSystem_C.ComputeBestInteraction
// 0x00B0 (0x00B0 - 0x0000)
struct BP_InteractionSystem_C_ComputeBestInteraction final
{
public:
	TScriptInterface<class IBPI_Interaction_C>    BestInteraction;                                   // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        local_DistanceToNearestActor;                      // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_Interaction_C>    local_BestInteraction;                             // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanPlayerProcessInteraction_ReturnValue;  // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36[0x2];                                       // 0x0036(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_InterfaceToObject_ReturnValue;       // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0050(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_Interaction_C>    CallFunc_Array_Get_Item;                           // 0x0070(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInteractionAvailable_Available;         // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_82[0x6];                                       // 0x0082(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetInteractionLocation_Location;          // 0x0088(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Vector_Distance_ReturnValue;              // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_InteractionSystem_C_ComputeBestInteraction) == 0x000008, "Wrong alignment on BP_InteractionSystem_C_ComputeBestInteraction");
static_assert(sizeof(BP_InteractionSystem_C_ComputeBestInteraction) == 0x0000B0, "Wrong size on BP_InteractionSystem_C_ComputeBestInteraction");
static_assert(offsetof(BP_InteractionSystem_C_ComputeBestInteraction, BestInteraction) == 0x000000, "Member 'BP_InteractionSystem_C_ComputeBestInteraction::BestInteraction' has a wrong offset!");
static_assert(offsetof(BP_InteractionSystem_C_ComputeBestInteraction, local_DistanceToNearestActor) == 0x000010, "Member 'BP_InteractionSystem_C_ComputeBestInteraction::local_DistanceToNearestActor' has a wrong offset!");
static_assert(offsetof(BP_InteractionSystem_C_ComputeBestInteraction, local_BestInteraction) == 0x000018, "Member 'BP_InteractionSystem_C_ComputeBestInteraction::local_BestInteraction' has a wrong offset!");
static_assert(offsetof(BP_InteractionSystem_C_ComputeBestInteraction, Temp_int_Array_Index_Variable) == 0x000028, "Member 'BP_InteractionSystem_C_ComputeBestInteraction::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_InteractionSystem_C_ComputeBestInteraction, Temp_int_Loop_Counter_Variable) == 0x00002C, "Member 'BP_InteractionSystem_C_ComputeBestInteraction::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_InteractionSystem_C_ComputeBestInteraction, CallFunc_Add_IntInt_ReturnValue) == 0x000030, "Member 'BP_InteractionSystem_C_ComputeBestInteraction::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractionSystem_C_ComputeBestInteraction, CallFunc_CanPlayerProcessInteraction_ReturnValue) == 0x000034, "Member 'BP_InteractionSystem_C_ComputeBestInteraction::CallFunc_CanPlayerProcessInteraction_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractionSystem_C_ComputeBestInteraction, CallFunc_Array_Contains_ReturnValue) == 0x000035, "Member 'BP_InteractionSystem_C_ComputeBestInteraction::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractionSystem_C_ComputeBestInteraction, CallFunc_Conv_InterfaceToObject_ReturnValue) == 0x000038, "Member 'BP_InteractionSystem_C_ComputeBestInteraction::CallFunc_Conv_InterfaceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractionSystem_C_ComputeBestInteraction, CallFunc_GetPlayerPawn_ReturnValue) == 0x000040, "Member 'BP_InteractionSystem_C_ComputeBestInteraction::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractionSystem_C_ComputeBestInteraction, CallFunc_IsValid_ReturnValue) == 0x000048, "Member 'BP_InteractionSystem_C_ComputeBestInteraction::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractionSystem_C_ComputeBestInteraction, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000050, "Member 'BP_InteractionSystem_C_ComputeBestInteraction::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractionSystem_C_ComputeBestInteraction, CallFunc_BooleanAND_ReturnValue) == 0x000068, "Member 'BP_InteractionSystem_C_ComputeBestInteraction::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractionSystem_C_ComputeBestInteraction, CallFunc_Array_Length_ReturnValue) == 0x00006C, "Member 'BP_InteractionSystem_C_ComputeBestInteraction::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractionSystem_C_ComputeBestInteraction, CallFunc_Array_Get_Item) == 0x000070, "Member 'BP_InteractionSystem_C_ComputeBestInteraction::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_InteractionSystem_C_ComputeBestInteraction, CallFunc_Less_IntInt_ReturnValue) == 0x000080, "Member 'BP_InteractionSystem_C_ComputeBestInteraction::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractionSystem_C_ComputeBestInteraction, CallFunc_IsInteractionAvailable_Available) == 0x000081, "Member 'BP_InteractionSystem_C_ComputeBestInteraction::CallFunc_IsInteractionAvailable_Available' has a wrong offset!");
static_assert(offsetof(BP_InteractionSystem_C_ComputeBestInteraction, CallFunc_GetInteractionLocation_Location) == 0x000088, "Member 'BP_InteractionSystem_C_ComputeBestInteraction::CallFunc_GetInteractionLocation_Location' has a wrong offset!");
static_assert(offsetof(BP_InteractionSystem_C_ComputeBestInteraction, CallFunc_Vector_Distance_ReturnValue) == 0x0000A0, "Member 'BP_InteractionSystem_C_ComputeBestInteraction::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractionSystem_C_ComputeBestInteraction, CallFunc_Less_DoubleDouble_ReturnValue) == 0x0000A8, "Member 'BP_InteractionSystem_C_ComputeBestInteraction::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractionSystem_C_ComputeBestInteraction, CallFunc_BooleanAND_ReturnValue_1) == 0x0000A9, "Member 'BP_InteractionSystem_C_ComputeBestInteraction::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");

// Function BP_InteractionSystem.BP_InteractionSystem_C.CreateDistantPromptWidget
// 0x0040 (0x0040 - 0x0000)
struct BP_InteractionSystem_C_CreateDistantPromptWidget final
{
public:
	TScriptInterface<class IBPI_Interaction_C>    InputPin;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetInteractionFeedbackLocation_Location;  // 0x0010(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_ExplorationPromptHint_C*           CallFunc_AddDistantPromptToWorldPosition_ReturnValue; // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	struct FFPromptID                             CallFunc_AddDistantPromptToWorldPosition_PromptID; // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_InteractionSystem_C_CreateDistantPromptWidget) == 0x000008, "Wrong alignment on BP_InteractionSystem_C_CreateDistantPromptWidget");
static_assert(sizeof(BP_InteractionSystem_C_CreateDistantPromptWidget) == 0x000040, "Wrong size on BP_InteractionSystem_C_CreateDistantPromptWidget");
static_assert(offsetof(BP_InteractionSystem_C_CreateDistantPromptWidget, InputPin) == 0x000000, "Member 'BP_InteractionSystem_C_CreateDistantPromptWidget::InputPin' has a wrong offset!");
static_assert(offsetof(BP_InteractionSystem_C_CreateDistantPromptWidget, CallFunc_GetInteractionFeedbackLocation_Location) == 0x000010, "Member 'BP_InteractionSystem_C_CreateDistantPromptWidget::CallFunc_GetInteractionFeedbackLocation_Location' has a wrong offset!");
static_assert(offsetof(BP_InteractionSystem_C_CreateDistantPromptWidget, CallFunc_AddDistantPromptToWorldPosition_ReturnValue) == 0x000028, "Member 'BP_InteractionSystem_C_CreateDistantPromptWidget::CallFunc_AddDistantPromptToWorldPosition_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractionSystem_C_CreateDistantPromptWidget, CallFunc_AddDistantPromptToWorldPosition_PromptID) == 0x000030, "Member 'BP_InteractionSystem_C_CreateDistantPromptWidget::CallFunc_AddDistantPromptToWorldPosition_PromptID' has a wrong offset!");

// Function BP_InteractionSystem.BP_InteractionSystem_C.DisableInteractionPrompt
// 0x0028 (0x0028 - 0x0000)
struct BP_InteractionSystem_C_DisableInteractionPrompt final
{
public:
	TScriptInterface<class IBPI_Interaction_C>    Interaction;                                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInteraction3D_ReturnValue;              // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_InteractionSystem_C_DisableInteractionPrompt) == 0x000008, "Wrong alignment on BP_InteractionSystem_C_DisableInteractionPrompt");
static_assert(sizeof(BP_InteractionSystem_C_DisableInteractionPrompt) == 0x000028, "Wrong size on BP_InteractionSystem_C_DisableInteractionPrompt");
static_assert(offsetof(BP_InteractionSystem_C_DisableInteractionPrompt, Interaction) == 0x000000, "Member 'BP_InteractionSystem_C_DisableInteractionPrompt::Interaction' has a wrong offset!");
static_assert(offsetof(BP_InteractionSystem_C_DisableInteractionPrompt, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'BP_InteractionSystem_C_DisableInteractionPrompt::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_InteractionSystem_C_DisableInteractionPrompt, CallFunc_IsInteraction3D_ReturnValue) == 0x000020, "Member 'BP_InteractionSystem_C_DisableInteractionPrompt::CallFunc_IsInteraction3D_ReturnValue' has a wrong offset!");

// Function BP_InteractionSystem.BP_InteractionSystem_C.EnableInteractionPrompt
// 0x0130 (0x0130 - 0x0000)
struct BP_InteractionSystem_C_EnableInteractionPrompt final
{
public:
	TScriptInterface<class IBPI_Interaction_C>    Interaction;                                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TDelegate<void()>                             Event;                                             // 0x0010(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	struct FFPromptParams                         NewLocalVar_0;                                     // 0x0020(0x0018)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FFPromptParams                         local_PromptParams;                                // 0x0038(0x0018)(Edit, BlueprintVisible, HasGetValueTypeHash)
	bool                                          CallFunc_IsPackagedForDistribution_ReturnValue;    // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52[0x6];                                       // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetInteractionFeedbackLocation_Location;  // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqualExactly_VectorVector_ReturnValue; // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_InterfaceToObject_ReturnValue;       // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_ObjectToText_ReturnValue;            // 0x0080(0x0010)()
	bool                                          CallFunc_IsInteraction3D_ReturnValue;              // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0098(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00E0(0x0010)(ReferenceParm)
	struct FFPromptParams                         CallFunc_GetInteractionPromptParams_PromptParams;  // 0x00F0(0x0018)(HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0108(0x0010)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0118(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_Guid_ReturnValue;                 // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_InteractionSystem_C_EnableInteractionPrompt) == 0x000008, "Wrong alignment on BP_InteractionSystem_C_EnableInteractionPrompt");
static_assert(sizeof(BP_InteractionSystem_C_EnableInteractionPrompt) == 0x000130, "Wrong size on BP_InteractionSystem_C_EnableInteractionPrompt");
static_assert(offsetof(BP_InteractionSystem_C_EnableInteractionPrompt, Interaction) == 0x000000, "Member 'BP_InteractionSystem_C_EnableInteractionPrompt::Interaction' has a wrong offset!");
static_assert(offsetof(BP_InteractionSystem_C_EnableInteractionPrompt, Event) == 0x000010, "Member 'BP_InteractionSystem_C_EnableInteractionPrompt::Event' has a wrong offset!");
static_assert(offsetof(BP_InteractionSystem_C_EnableInteractionPrompt, NewLocalVar_0) == 0x000020, "Member 'BP_InteractionSystem_C_EnableInteractionPrompt::NewLocalVar_0' has a wrong offset!");
static_assert(offsetof(BP_InteractionSystem_C_EnableInteractionPrompt, local_PromptParams) == 0x000038, "Member 'BP_InteractionSystem_C_EnableInteractionPrompt::local_PromptParams' has a wrong offset!");
static_assert(offsetof(BP_InteractionSystem_C_EnableInteractionPrompt, CallFunc_IsPackagedForDistribution_ReturnValue) == 0x000050, "Member 'BP_InteractionSystem_C_EnableInteractionPrompt::CallFunc_IsPackagedForDistribution_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractionSystem_C_EnableInteractionPrompt, CallFunc_Not_PreBool_ReturnValue) == 0x000051, "Member 'BP_InteractionSystem_C_EnableInteractionPrompt::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractionSystem_C_EnableInteractionPrompt, CallFunc_GetInteractionFeedbackLocation_Location) == 0x000058, "Member 'BP_InteractionSystem_C_EnableInteractionPrompt::CallFunc_GetInteractionFeedbackLocation_Location' has a wrong offset!");
static_assert(offsetof(BP_InteractionSystem_C_EnableInteractionPrompt, CallFunc_NotEqualExactly_VectorVector_ReturnValue) == 0x000070, "Member 'BP_InteractionSystem_C_EnableInteractionPrompt::CallFunc_NotEqualExactly_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractionSystem_C_EnableInteractionPrompt, CallFunc_Conv_InterfaceToObject_ReturnValue) == 0x000078, "Member 'BP_InteractionSystem_C_EnableInteractionPrompt::CallFunc_Conv_InterfaceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractionSystem_C_EnableInteractionPrompt, CallFunc_Conv_ObjectToText_ReturnValue) == 0x000080, "Member 'BP_InteractionSystem_C_EnableInteractionPrompt::CallFunc_Conv_ObjectToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractionSystem_C_EnableInteractionPrompt, CallFunc_IsInteraction3D_ReturnValue) == 0x000090, "Member 'BP_InteractionSystem_C_EnableInteractionPrompt::CallFunc_IsInteraction3D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractionSystem_C_EnableInteractionPrompt, K2Node_MakeStruct_FormatArgumentData) == 0x000098, "Member 'BP_InteractionSystem_C_EnableInteractionPrompt::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_InteractionSystem_C_EnableInteractionPrompt, K2Node_MakeArray_Array) == 0x0000E0, "Member 'BP_InteractionSystem_C_EnableInteractionPrompt::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_InteractionSystem_C_EnableInteractionPrompt, CallFunc_GetInteractionPromptParams_PromptParams) == 0x0000F0, "Member 'BP_InteractionSystem_C_EnableInteractionPrompt::CallFunc_GetInteractionPromptParams_PromptParams' has a wrong offset!");
static_assert(offsetof(BP_InteractionSystem_C_EnableInteractionPrompt, CallFunc_Format_ReturnValue) == 0x000108, "Member 'BP_InteractionSystem_C_EnableInteractionPrompt::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractionSystem_C_EnableInteractionPrompt, K2Node_CreateDelegate_OutputDelegate) == 0x000118, "Member 'BP_InteractionSystem_C_EnableInteractionPrompt::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_InteractionSystem_C_EnableInteractionPrompt, CallFunc_IsValid_Guid_ReturnValue) == 0x000128, "Member 'BP_InteractionSystem_C_EnableInteractionPrompt::CallFunc_IsValid_Guid_ReturnValue' has a wrong offset!");

// Function BP_InteractionSystem.BP_InteractionSystem_C.ExecuteUbergraph_BP_InteractionSystem
// 0x0028 (0x0028 - 0x0000)
struct BP_InteractionSystem_C_ExecuteUbergraph_BP_InteractionSystem final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_jRPG_Controller_World_C*            K2Node_DynamicCast_AsBP_J_RPG_Controller_World;    // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_InteractionSystem_C_ExecuteUbergraph_BP_InteractionSystem) == 0x000008, "Wrong alignment on BP_InteractionSystem_C_ExecuteUbergraph_BP_InteractionSystem");
static_assert(sizeof(BP_InteractionSystem_C_ExecuteUbergraph_BP_InteractionSystem) == 0x000028, "Wrong size on BP_InteractionSystem_C_ExecuteUbergraph_BP_InteractionSystem");
static_assert(offsetof(BP_InteractionSystem_C_ExecuteUbergraph_BP_InteractionSystem, EntryPoint) == 0x000000, "Member 'BP_InteractionSystem_C_ExecuteUbergraph_BP_InteractionSystem::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_InteractionSystem_C_ExecuteUbergraph_BP_InteractionSystem, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'BP_InteractionSystem_C_ExecuteUbergraph_BP_InteractionSystem::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractionSystem_C_ExecuteUbergraph_BP_InteractionSystem, K2Node_DynamicCast_AsBP_J_RPG_Controller_World) == 0x000010, "Member 'BP_InteractionSystem_C_ExecuteUbergraph_BP_InteractionSystem::K2Node_DynamicCast_AsBP_J_RPG_Controller_World' has a wrong offset!");
static_assert(offsetof(BP_InteractionSystem_C_ExecuteUbergraph_BP_InteractionSystem, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_InteractionSystem_C_ExecuteUbergraph_BP_InteractionSystem::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_InteractionSystem_C_ExecuteUbergraph_BP_InteractionSystem, K2Node_Event_DeltaSeconds) == 0x00001C, "Member 'BP_InteractionSystem_C_ExecuteUbergraph_BP_InteractionSystem::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_InteractionSystem_C_ExecuteUbergraph_BP_InteractionSystem, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'BP_InteractionSystem_C_ExecuteUbergraph_BP_InteractionSystem::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_InteractionSystem.BP_InteractionSystem_C.GetInteractionIndexToProcess
// 0x0014 (0x0014 - 0x0000)
struct BP_InteractionSystem_C_GetInteractionIndexToProcess final
{
public:
	int32                                         LoopIndex;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NextIndex;                                         // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_InteractionSystem_C_GetInteractionIndexToProcess) == 0x000004, "Wrong alignment on BP_InteractionSystem_C_GetInteractionIndexToProcess");
static_assert(sizeof(BP_InteractionSystem_C_GetInteractionIndexToProcess) == 0x000014, "Wrong size on BP_InteractionSystem_C_GetInteractionIndexToProcess");
static_assert(offsetof(BP_InteractionSystem_C_GetInteractionIndexToProcess, LoopIndex) == 0x000000, "Member 'BP_InteractionSystem_C_GetInteractionIndexToProcess::LoopIndex' has a wrong offset!");
static_assert(offsetof(BP_InteractionSystem_C_GetInteractionIndexToProcess, NextIndex) == 0x000004, "Member 'BP_InteractionSystem_C_GetInteractionIndexToProcess::NextIndex' has a wrong offset!");
static_assert(offsetof(BP_InteractionSystem_C_GetInteractionIndexToProcess, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_InteractionSystem_C_GetInteractionIndexToProcess::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractionSystem_C_GetInteractionIndexToProcess, CallFunc_Array_Length_ReturnValue) == 0x00000C, "Member 'BP_InteractionSystem_C_GetInteractionIndexToProcess::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractionSystem_C_GetInteractionIndexToProcess, CallFunc_Percent_IntInt_ReturnValue) == 0x000010, "Member 'BP_InteractionSystem_C_GetInteractionIndexToProcess::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");

// Function BP_InteractionSystem.BP_InteractionSystem_C.IsInteraction3D
// 0x0030 (0x0030 - 0x0000)
struct BP_InteractionSystem_C_IsInteraction3D final
{
public:
	TScriptInterface<class IBPI_Interaction_C>    Interaction;                                       // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_InterfaceToObject_ReturnValue;       // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_Conv_InterfaceToObject_ReturnValue_1;     // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_InteractionSystem_C_IsInteraction3D) == 0x000008, "Wrong alignment on BP_InteractionSystem_C_IsInteraction3D");
static_assert(sizeof(BP_InteractionSystem_C_IsInteraction3D) == 0x000030, "Wrong size on BP_InteractionSystem_C_IsInteraction3D");
static_assert(offsetof(BP_InteractionSystem_C_IsInteraction3D, Interaction) == 0x000000, "Member 'BP_InteractionSystem_C_IsInteraction3D::Interaction' has a wrong offset!");
static_assert(offsetof(BP_InteractionSystem_C_IsInteraction3D, ReturnValue) == 0x000010, "Member 'BP_InteractionSystem_C_IsInteraction3D::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractionSystem_C_IsInteraction3D, CallFunc_Conv_InterfaceToObject_ReturnValue) == 0x000018, "Member 'BP_InteractionSystem_C_IsInteraction3D::CallFunc_Conv_InterfaceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractionSystem_C_IsInteraction3D, CallFunc_Conv_InterfaceToObject_ReturnValue_1) == 0x000020, "Member 'BP_InteractionSystem_C_IsInteraction3D::CallFunc_Conv_InterfaceToObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_InteractionSystem_C_IsInteraction3D, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000028, "Member 'BP_InteractionSystem_C_IsInteraction3D::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");

// Function BP_InteractionSystem.BP_InteractionSystem_C.OnInteract
// 0x00B8 (0x00B8 - 0x0000)
struct BP_InteractionSystem_C_OnInteract final
{
public:
	bool                                          CallFunc_HasWorldMapCapacity_Result;               // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanPlayerProcessInteraction_ReturnValue;  // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanInteractWithMount_CanInteract;         // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_InterfaceToObject_ReturnValue;       // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13[0x5];                                       // 0x0013(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0030(0x0010)()
	class ABP_jRPG_Character_World_C*             K2Node_DynamicCast_AsBP_J_RPG_Character_World;     // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0050(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0098(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Format_ReturnValue;                       // 0x00A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_InteractionSystem_C_OnInteract) == 0x000008, "Wrong alignment on BP_InteractionSystem_C_OnInteract");
static_assert(sizeof(BP_InteractionSystem_C_OnInteract) == 0x0000B8, "Wrong size on BP_InteractionSystem_C_OnInteract");
static_assert(offsetof(BP_InteractionSystem_C_OnInteract, CallFunc_HasWorldMapCapacity_Result) == 0x000000, "Member 'BP_InteractionSystem_C_OnInteract::CallFunc_HasWorldMapCapacity_Result' has a wrong offset!");
static_assert(offsetof(BP_InteractionSystem_C_OnInteract, CallFunc_CanPlayerProcessInteraction_ReturnValue) == 0x000001, "Member 'BP_InteractionSystem_C_OnInteract::CallFunc_CanPlayerProcessInteraction_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractionSystem_C_OnInteract, CallFunc_CanInteractWithMount_CanInteract) == 0x000002, "Member 'BP_InteractionSystem_C_OnInteract::CallFunc_CanInteractWithMount_CanInteract' has a wrong offset!");
static_assert(offsetof(BP_InteractionSystem_C_OnInteract, CallFunc_Conv_InterfaceToObject_ReturnValue) == 0x000008, "Member 'BP_InteractionSystem_C_OnInteract::CallFunc_Conv_InterfaceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractionSystem_C_OnInteract, CallFunc_Not_PreBool_ReturnValue) == 0x000010, "Member 'BP_InteractionSystem_C_OnInteract::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractionSystem_C_OnInteract, CallFunc_IsValid_ReturnValue) == 0x000011, "Member 'BP_InteractionSystem_C_OnInteract::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractionSystem_C_OnInteract, CallFunc_BooleanAND_ReturnValue) == 0x000012, "Member 'BP_InteractionSystem_C_OnInteract::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractionSystem_C_OnInteract, CallFunc_GetDisplayName_ReturnValue) == 0x000018, "Member 'BP_InteractionSystem_C_OnInteract::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractionSystem_C_OnInteract, CallFunc_GetPlayerPawn_ReturnValue) == 0x000028, "Member 'BP_InteractionSystem_C_OnInteract::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractionSystem_C_OnInteract, CallFunc_Conv_StringToText_ReturnValue) == 0x000030, "Member 'BP_InteractionSystem_C_OnInteract::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractionSystem_C_OnInteract, K2Node_DynamicCast_AsBP_J_RPG_Character_World) == 0x000040, "Member 'BP_InteractionSystem_C_OnInteract::K2Node_DynamicCast_AsBP_J_RPG_Character_World' has a wrong offset!");
static_assert(offsetof(BP_InteractionSystem_C_OnInteract, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'BP_InteractionSystem_C_OnInteract::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_InteractionSystem_C_OnInteract, K2Node_MakeStruct_FormatArgumentData) == 0x000050, "Member 'BP_InteractionSystem_C_OnInteract::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_InteractionSystem_C_OnInteract, K2Node_MakeArray_Array) == 0x000098, "Member 'BP_InteractionSystem_C_OnInteract::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_InteractionSystem_C_OnInteract, CallFunc_Format_ReturnValue) == 0x0000A8, "Member 'BP_InteractionSystem_C_OnInteract::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function BP_InteractionSystem.BP_InteractionSystem_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_InteractionSystem_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_InteractionSystem_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_InteractionSystem_C_ReceiveTick");
static_assert(sizeof(BP_InteractionSystem_C_ReceiveTick) == 0x000004, "Wrong size on BP_InteractionSystem_C_ReceiveTick");
static_assert(offsetof(BP_InteractionSystem_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_InteractionSystem_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_InteractionSystem.BP_InteractionSystem_C.RegisterDistantInteractiveObject
// 0x0038 (0x0038 - 0x0000)
struct BP_InteractionSystem_C_RegisterDistantInteractiveObject final
{
public:
	TScriptInterface<class IBPI_Interaction_C>    InteractiveObject;                                 // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* Actor, EEndPlayReason EndPlayReason)> K2Node_CreateDelegate_OutputDelegate; // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_Conv_InterfaceToObject_ReturnValue;       // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_DynamicCast_AsActor;                        // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_InteractionSystem_C_RegisterDistantInteractiveObject) == 0x000008, "Wrong alignment on BP_InteractionSystem_C_RegisterDistantInteractiveObject");
static_assert(sizeof(BP_InteractionSystem_C_RegisterDistantInteractiveObject) == 0x000038, "Wrong size on BP_InteractionSystem_C_RegisterDistantInteractiveObject");
static_assert(offsetof(BP_InteractionSystem_C_RegisterDistantInteractiveObject, InteractiveObject) == 0x000000, "Member 'BP_InteractionSystem_C_RegisterDistantInteractiveObject::InteractiveObject' has a wrong offset!");
static_assert(offsetof(BP_InteractionSystem_C_RegisterDistantInteractiveObject, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'BP_InteractionSystem_C_RegisterDistantInteractiveObject::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_InteractionSystem_C_RegisterDistantInteractiveObject, CallFunc_Conv_InterfaceToObject_ReturnValue) == 0x000020, "Member 'BP_InteractionSystem_C_RegisterDistantInteractiveObject::CallFunc_Conv_InterfaceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractionSystem_C_RegisterDistantInteractiveObject, K2Node_DynamicCast_AsActor) == 0x000028, "Member 'BP_InteractionSystem_C_RegisterDistantInteractiveObject::K2Node_DynamicCast_AsActor' has a wrong offset!");
static_assert(offsetof(BP_InteractionSystem_C_RegisterDistantInteractiveObject, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'BP_InteractionSystem_C_RegisterDistantInteractiveObject::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_InteractionSystem_C_RegisterDistantInteractiveObject, CallFunc_Array_AddUnique_ReturnValue) == 0x000034, "Member 'BP_InteractionSystem_C_RegisterDistantInteractiveObject::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");

// Function BP_InteractionSystem.BP_InteractionSystem_C.RegisterInteractiveObject
// 0x0098 (0x0098 - 0x0000)
struct BP_InteractionSystem_C_RegisterInteractiveObject final
{
public:
	TScriptInterface<class IBPI_Interaction_C>    InteractiveObject;                                 // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_Conv_InterfaceToObject_ReturnValue;       // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_ObjectToText_ReturnValue;            // 0x0020(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0030(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0078(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0088(0x0010)()
};
static_assert(alignof(BP_InteractionSystem_C_RegisterInteractiveObject) == 0x000008, "Wrong alignment on BP_InteractionSystem_C_RegisterInteractiveObject");
static_assert(sizeof(BP_InteractionSystem_C_RegisterInteractiveObject) == 0x000098, "Wrong size on BP_InteractionSystem_C_RegisterInteractiveObject");
static_assert(offsetof(BP_InteractionSystem_C_RegisterInteractiveObject, InteractiveObject) == 0x000000, "Member 'BP_InteractionSystem_C_RegisterInteractiveObject::InteractiveObject' has a wrong offset!");
static_assert(offsetof(BP_InteractionSystem_C_RegisterInteractiveObject, CallFunc_Conv_InterfaceToObject_ReturnValue) == 0x000010, "Member 'BP_InteractionSystem_C_RegisterInteractiveObject::CallFunc_Conv_InterfaceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractionSystem_C_RegisterInteractiveObject, CallFunc_Array_AddUnique_ReturnValue) == 0x000018, "Member 'BP_InteractionSystem_C_RegisterInteractiveObject::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractionSystem_C_RegisterInteractiveObject, CallFunc_Conv_ObjectToText_ReturnValue) == 0x000020, "Member 'BP_InteractionSystem_C_RegisterInteractiveObject::CallFunc_Conv_ObjectToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractionSystem_C_RegisterInteractiveObject, K2Node_MakeStruct_FormatArgumentData) == 0x000030, "Member 'BP_InteractionSystem_C_RegisterInteractiveObject::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_InteractionSystem_C_RegisterInteractiveObject, K2Node_MakeArray_Array) == 0x000078, "Member 'BP_InteractionSystem_C_RegisterInteractiveObject::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_InteractionSystem_C_RegisterInteractiveObject, CallFunc_Format_ReturnValue) == 0x000088, "Member 'BP_InteractionSystem_C_RegisterInteractiveObject::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function BP_InteractionSystem.BP_InteractionSystem_C.RegisterInteractiveObject2D
// 0x0198 (0x0198 - 0x0000)
struct BP_InteractionSystem_C_RegisterInteractiveObject2D final
{
public:
	TScriptInterface<class IBPI_Interaction_C>    InteractiveObject;                                 // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_Conv_InterfaceToObject_ReturnValue;       // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0028(0x0010)()
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0040(0x0048)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0088(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0098(0x0048)(HasGetValueTypeHash)
	class UObject*                                CallFunc_Conv_InterfaceToObject_ReturnValue_1;     // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00E8(0x0010)(ReferenceParm)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0100(0x0010)()
	class FString                                 CallFunc_GetDisplayName_ReturnValue_1;             // 0x0110(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_2;          // 0x0120(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0130(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0178(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0188(0x0010)()
};
static_assert(alignof(BP_InteractionSystem_C_RegisterInteractiveObject2D) == 0x000008, "Wrong alignment on BP_InteractionSystem_C_RegisterInteractiveObject2D");
static_assert(sizeof(BP_InteractionSystem_C_RegisterInteractiveObject2D) == 0x000198, "Wrong size on BP_InteractionSystem_C_RegisterInteractiveObject2D");
static_assert(offsetof(BP_InteractionSystem_C_RegisterInteractiveObject2D, InteractiveObject) == 0x000000, "Member 'BP_InteractionSystem_C_RegisterInteractiveObject2D::InteractiveObject' has a wrong offset!");
static_assert(offsetof(BP_InteractionSystem_C_RegisterInteractiveObject2D, CallFunc_Conv_InterfaceToObject_ReturnValue) == 0x000010, "Member 'BP_InteractionSystem_C_RegisterInteractiveObject2D::CallFunc_Conv_InterfaceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractionSystem_C_RegisterInteractiveObject2D, CallFunc_GetDisplayName_ReturnValue) == 0x000018, "Member 'BP_InteractionSystem_C_RegisterInteractiveObject2D::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractionSystem_C_RegisterInteractiveObject2D, CallFunc_Conv_StringToText_ReturnValue) == 0x000028, "Member 'BP_InteractionSystem_C_RegisterInteractiveObject2D::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractionSystem_C_RegisterInteractiveObject2D, CallFunc_Array_Add_ReturnValue) == 0x000038, "Member 'BP_InteractionSystem_C_RegisterInteractiveObject2D::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractionSystem_C_RegisterInteractiveObject2D, K2Node_MakeStruct_FormatArgumentData) == 0x000040, "Member 'BP_InteractionSystem_C_RegisterInteractiveObject2D::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
