#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_InputContextComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "S_InputContextParameters_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_InputContextComponent.BP_InputContextComponent_C
// 0x0048 (0x00E8 - 0x00A0)
class UBP_InputContextComponent_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TArray<class UInputMappingContext*>           PushedInputMappings;                               // 0x00A8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UInputMappingContext*                   DefaultMovementInputMapping;                       // 0x00B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UInputMappingContext*                   DefaultCameraInputMapping;                         // 0x00C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UInputMappingContext*                   DefaultUIInputMapping;                             // 0x00C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UInputMappingContext*                   DefaultDebugMapping;                               // 0x00D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FS_InputContextParameters              CurrentParameters;                                 // 0x00D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ApplyDefaultInputContext();
	void ExecuteUbergraph_BP_InputContextComponent(int32 EntryPoint);
	void GetCurrentInputMappingNames(class FString* MovementInputMapping, class FString* CameraInputMapping);
	void ReceiveBeginPlay();
	void RefreshCurrentInputContexts();
	void RemovePushedInputContexts();
	void SetInputContext(const struct FS_InputContextParameters& Parameters);
	void UpdateInputContexts(const struct FS_InputContextParameters& Parameters);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_InputContextComponent_C">();
	}
	static class UBP_InputContextComponent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_InputContextComponent_C>();
	}
};
static_assert(alignof(UBP_InputContextComponent_C) == 0x000008, "Wrong alignment on UBP_InputContextComponent_C");
static_assert(sizeof(UBP_InputContextComponent_C) == 0x0000E8, "Wrong size on UBP_InputContextComponent_C");
static_assert(offsetof(UBP_InputContextComponent_C, UberGraphFrame) == 0x0000A0, "Member 'UBP_InputContextComponent_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_InputContextComponent_C, PushedInputMappings) == 0x0000A8, "Member 'UBP_InputContextComponent_C::PushedInputMappings' has a wrong offset!");
static_assert(offsetof(UBP_InputContextComponent_C, DefaultMovementInputMapping) == 0x0000B8, "Member 'UBP_InputContextComponent_C::DefaultMovementInputMapping' has a wrong offset!");
static_assert(offsetof(UBP_InputContextComponent_C, DefaultCameraInputMapping) == 0x0000C0, "Member 'UBP_InputContextComponent_C::DefaultCameraInputMapping' has a wrong offset!");
static_assert(offsetof(UBP_InputContextComponent_C, DefaultUIInputMapping) == 0x0000C8, "Member 'UBP_InputContextComponent_C::DefaultUIInputMapping' has a wrong offset!");
static_assert(offsetof(UBP_InputContextComponent_C, DefaultDebugMapping) == 0x0000D0, "Member 'UBP_InputContextComponent_C::DefaultDebugMapping' has a wrong offset!");
static_assert(offsetof(UBP_InputContextComponent_C, CurrentParameters) == 0x0000D8, "Member 'UBP_InputContextComponent_C::CurrentParameters' has a wrong offset!");

}

