#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_InteractiveEnvironmentManagerComponent

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "S_ListOfActorsPerInteractionType_structs.hpp"
#include "E_InteractiveEnvironmentType_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_InteractiveEnvironmentManagerComponent.BP_InteractiveEnvironmentManagerComponent_C.ExecuteUbergraph_BP_InteractiveEnvironmentManagerComponent
// 0x0190 (0x0190 - 0x0000)
struct BP_InteractiveEnvironmentManagerComponent_C_ExecuteUbergraph_BP_InteractiveEnvironmentManagerComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable;                                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue_1;             // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetEnumeratorValueFromIndex_ReturnValue;  // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetEnvironmentInteractionTypeMPC_ID_ReturnValue; // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_NameToText_ReturnValue;              // 0x0030(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0040(0x0048)(HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue;               // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPackagedForDistribution_ReturnValue;    // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x008D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x008E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8F[0x1];                                       // 0x008F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0095(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_96[0x2];                                       // 0x0096(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_real_Variable_1;                              // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_1;           // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AA[0x6];                                       // 0x00AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_ObjectToText_ReturnValue;            // 0x00B0(0x0010)()
	float                                         K2Node_Select_Default;                             // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00C8(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0110(0x0010)(ReferenceParm)
	TArray<class FName>                           CallFunc_GetVectorParameterNames_ReturnValue;      // 0x0120(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Format_ReturnValue;                       // 0x0130(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0141(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_142[0x6];                                      // 0x0142(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_2;           // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_3;           // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_4;           // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_TriggerInteractiveEnvironmentZone_C*> CallFunc_GetAllActorsOfClass_OutActors;   // 0x0160(0x0010)(ReferenceParm)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_5;           // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast; // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast_1; // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast_2; // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast_3; // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast_4; // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast_5; // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_InteractiveEnvironmentManagerComponent_C_ExecuteUbergraph_BP_InteractiveEnvironmentManagerComponent) == 0x000008, "Wrong alignment on BP_InteractiveEnvironmentManagerComponent_C_ExecuteUbergraph_BP_InteractiveEnvironmentManagerComponent");
static_assert(sizeof(BP_InteractiveEnvironmentManagerComponent_C_ExecuteUbergraph_BP_InteractiveEnvironmentManagerComponent) == 0x000190, "Wrong size on BP_InteractiveEnvironmentManagerComponent_C_ExecuteUbergraph_BP_InteractiveEnvironmentManagerComponent");
static_assert(offsetof(BP_InteractiveEnvironmentManagerComponent_C_ExecuteUbergraph_BP_InteractiveEnvironmentManagerComponent, EntryPoint) == 0x000000, "Member 'BP_InteractiveEnvironmentManagerComponent_C_ExecuteUbergraph_BP_InteractiveEnvironmentManagerComponent::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_InteractiveEnvironmentManagerComponent_C_ExecuteUbergraph_BP_InteractiveEnvironmentManagerComponent, Temp_real_Variable) == 0x000004, "Member 'BP_InteractiveEnvironmentManagerComponent_C_ExecuteUbergraph_BP_InteractiveEnvironmentManagerComponent::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(BP_InteractiveEnvironmentManagerComponent_C_ExecuteUbergraph_BP_InteractiveEnvironmentManagerComponent, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000008, "Member 'BP_InteractiveEnvironmentManagerComponent_C_ExecuteUbergraph_BP_InteractiveEnvironmentManagerComponent::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractiveEnvironmentManagerComponent_C_ExecuteUbergraph_BP_InteractiveEnvironmentManagerComponent, Temp_int_Variable) == 0x000010, "Member 'BP_InteractiveEnvironmentManagerComponent_C_ExecuteUbergraph_BP_InteractiveEnvironmentManagerComponent::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_InteractiveEnvironmentManagerComponent_C_ExecuteUbergraph_BP_InteractiveEnvironmentManagerComponent, Temp_int_Variable_1) == 0x000014, "Member 'BP_InteractiveEnvironmentManagerComponent_C_ExecuteUbergraph_BP_InteractiveEnvironmentManagerComponent::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_InteractiveEnvironmentManagerComponent_C_ExecuteUbergraph_BP_InteractiveEnvironmentManagerComponent, CallFunc_Conv_IntToByte_ReturnValue) == 0x000018, "Member 'BP_InteractiveEnvironmentManagerComponent_C_ExecuteUbergraph_BP_InteractiveEnvironmentManagerComponent::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractiveEnvironmentManagerComponent_C_ExecuteUbergraph_BP_InteractiveEnvironmentManagerComponent, CallFunc_Add_IntInt_ReturnValue) == 0x00001C, "Member 'BP_InteractiveEnvironmentManagerComponent_C_ExecuteUbergraph_BP_InteractiveEnvironmentManagerComponent::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractiveEnvironmentManagerComponent_C_ExecuteUbergraph_BP_InteractiveEnvironmentManagerComponent, CallFunc_GetValidValue_ReturnValue) == 0x000020, "Member 'BP_InteractiveEnvironmentManagerComponent_C_ExecuteUbergraph_BP_InteractiveEnvironmentManagerComponent::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractiveEnvironmentManagerComponent_C_ExecuteUbergraph_BP_InteractiveEnvironmentManagerComponent, CallFunc_Conv_IntToByte_ReturnValue_1) == 0x000021, "Member 'BP_InteractiveEnvironmentManagerComponent_C_ExecuteUbergraph_BP_InteractiveEnvironmentManagerComponent::CallFunc_Conv_IntToByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_InteractiveEnvironmentManagerComponent_C_ExecuteUbergraph_BP_InteractiveEnvironmentManagerComponent, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000022, "Member 'BP_InteractiveEnvironmentManagerComponent_C_ExecuteUbergraph_BP_InteractiveEnvironmentManagerComponent::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractiveEnvironmentManagerComponent_C_ExecuteUbergraph_BP_InteractiveEnvironmentManagerComponent, CallFunc_GetEnumeratorValueFromIndex_ReturnValue) == 0x000023, "Member 'BP_InteractiveEnvironmentManagerComponent_C_ExecuteUbergraph_BP_InteractiveEnvironmentManagerComponent::CallFunc_GetEnumeratorValueFromIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractiveEnvironmentManagerComponent_C_ExecuteUbergraph_BP_InteractiveEnvironmentManagerComponent, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000024, "Member 'BP_InteractiveEnvironmentManagerComponent_C_ExecuteUbergraph_BP_InteractiveEnvironmentManagerComponent::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractiveEnvironmentManagerComponent_C_ExecuteUbergraph_BP_InteractiveEnvironmentManagerComponent, CallFunc_GetEnvironmentInteractionTypeMPC_ID_ReturnValue) == 0x000028, "Member 'BP_InteractiveEnvironmentManagerComponent_C_ExecuteUbergraph_BP_InteractiveEnvironmentManagerComponent::CallFunc_GetEnvironmentInteractionTypeMPC_ID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractiveEnvironmentManagerComponent_C_ExecuteUbergraph_BP_InteractiveEnvironmentManagerComponent, CallFunc_Conv_NameToText_ReturnValue) == 0x000030, "Member 'BP_InteractiveEnvironmentManagerComponent_C_ExecuteUbergraph_BP_InteractiveEnvironmentManagerComponent::CallFunc_Conv_NameToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractiveEnvironmentManagerComponent_C_ExecuteUbergraph_BP_InteractiveEnvironmentManagerComponent, K2Node_MakeStruct_FormatArgumentData) == 0x000040, "Member 'BP_InteractiveEnvironmentManagerComponent_C_ExecuteUbergraph_BP_InteractiveEnvironmentManagerComponent::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_InteractiveEnvironmentManagerComponent_C_ExecuteUbergraph_BP_InteractiveEnvironmentManagerComponent, CallFunc_MakeLiteralInt_ReturnValue) == 0x000088, "Member 'BP_InteractiveEnvironmentManagerComponent_C_ExecuteUbergraph_BP_InteractiveEnvironmentManagerComponent::CallFunc_MakeLiteralInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractiveEnvironmentManagerComponent_C_ExecuteUbergraph_BP_InteractiveEnvironmentManagerComponent, CallFunc_IsPackagedForDistribution_ReturnValue) == 0x00008C, "Member 'BP_InteractiveEnvironmentManagerComponent_C_ExecuteUbergraph_BP_InteractiveEnvironmentManagerComponent::CallFunc_IsPackagedForDistribution_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractiveEnvironmentManagerComponent_C_ExecuteUbergraph_BP_InteractiveEnvironmentManagerComponent, CallFunc_Less_IntInt_ReturnValue) == 0x00008D, "Member 'BP_InteractiveEnvironmentManagerComponent_C_ExecuteUbergraph_BP_InteractiveEnvironmentManagerComponent::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractiveEnvironmentManagerComponent_C_ExecuteUbergraph_BP_InteractiveEnvironmentManagerComponent, CallFunc_Not_PreBool_ReturnValue) == 0x00008E, "Member 'BP_InteractiveEnvironmentManagerComponent_C_ExecuteUbergraph_BP_InteractiveEnvironmentManagerComponent::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractiveEnvironmentManagerComponent_C_ExecuteUbergraph_BP_InteractiveEnvironmentManagerComponent, K2Node_Event_DeltaSeconds) == 0x000090, "Member 'BP_InteractiveEnvironmentManagerComponent_C_ExecuteUbergraph_BP_InteractiveEnvironmentManagerComponent::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_InteractiveEnvironmentManagerComponent_C_ExecuteUbergraph_BP_InteractiveEnvironmentManagerComponent, Temp_bool_Variable) == 0x000094, "Member 'BP_InteractiveEnvironmentManagerComponent_C_ExecuteUbergraph_BP_InteractiveEnvironmentManagerComponent::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_InteractiveEnvironmentManagerComponent_C_ExecuteUbergraph_BP_InteractiveEnvironmentManagerComponent, CallFunc_Not_PreBool_ReturnValue_1) == 0x000095, "Member 'BP_InteractiveEnvironmentManagerComponent_C_ExecuteUbergraph_BP_InteractiveEnvironmentManagerComponent::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_InteractiveEnvironmentManagerComponent_C_ExecuteUbergraph_BP_InteractiveEnvironmentManagerComponent, Temp_real_Variable_1) == 0x000098, "Member 'BP_InteractiveEnvironmentManagerComponent_C_ExecuteUbergraph_BP_InteractiveEnvironmentManagerComponent::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_InteractiveEnvironmentManagerComponent_C_ExecuteUbergraph_BP_InteractiveEnvironmentManagerComponent, CallFunc_Conv_IntToDouble_ReturnValue_1) == 0x0000A0, "Member 'BP_InteractiveEnvironmentManagerComponent_C_ExecuteUbergraph_BP_InteractiveEnvironmentManagerComponent::CallFunc_Conv_IntToDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_InteractiveEnvironmentManagerComponent_C_ExecuteUbergraph_BP_InteractiveEnvironmentManagerComponent, K2Node_Event_EndPlayReason) == 0x0000A8, "Member 'BP_InteractiveEnvironmentManagerComponent_C_ExecuteUbergraph_BP_InteractiveEnvironmentManagerComponent::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BP_InteractiveEnvironmentManagerComponent_C_ExecuteUbergraph_BP_InteractiveEnvironmentManagerComponent, Temp_bool_Variable_1) == 0x0000A9, "Member 'BP_InteractiveEnvironmentManagerComponent_C_ExecuteUbergraph_BP_InteractiveEnvironmentManagerComponent::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_InteractiveEnvironmentManagerComponent_C_ExecuteUbergraph_BP_InteractiveEnvironmentManagerComponent, CallFunc_Conv_ObjectToText_ReturnValue) == 0x0000B0, "Member 'BP_InteractiveEnvironmentManagerComponent_C_ExecuteUbergraph_BP_InteractiveEnvironmentManagerComponent::CallFunc_Conv_ObjectToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractiveEnvironmentManagerComponent_C_ExecuteUbergraph_BP_InteractiveEnvironmentManagerComponent, K2Node_Select_Default) == 0x0000C0, "Member 'BP_InteractiveEnvironmentManagerComponent_C_ExecuteUbergraph_BP_InteractiveEnvironmentManagerComponent::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_InteractiveEnvironmentManagerComponent_C_ExecuteUbergraph_BP_InteractiveEnvironmentManagerComponent, K2Node_MakeStruct_FormatArgumentData_1) == 0x0000C8, "Member 'BP_InteractiveEnvironmentManagerComponent_C_ExecuteUbergraph_BP_InteractiveEnvironmentManagerComponent::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BP_InteractiveEnvironmentManagerComponent_C_ExecuteUbergraph_BP_InteractiveEnvironmentManagerComponent, K2Node_MakeArray_Array) == 0x000110, "Member 'BP_InteractiveEnvironmentManagerComponent_C_ExecuteUbergraph_BP_InteractiveEnvironmentManagerComponent::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_InteractiveEnvironmentManagerComponent_C_ExecuteUbergraph_BP_InteractiveEnvironmentManagerComponent, CallFunc_GetVectorParameterNames_ReturnValue) == 0x000120, "Member 'BP_InteractiveEnvironmentManagerComponent_C_ExecuteUbergraph_BP_InteractiveEnvironmentManagerComponent::CallFunc_GetVectorParameterNames_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractiveEnvironmentManagerComponent_C_ExecuteUbergraph_BP_InteractiveEnvironmentManagerComponent, CallFunc_Format_ReturnValue) == 0x000130, "Member 'BP_InteractiveEnvironmentManagerComponent_C_ExecuteUbergraph_BP_InteractiveEnvironmentManagerComponent::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractiveEnvironmentManagerComponent_C_ExecuteUbergraph_BP_InteractiveEnvironmentManagerComponent, CallFunc_Array_Contains_ReturnValue) == 0x000140, "Member 'BP_InteractiveEnvironmentManagerComponent_C_ExecuteUbergraph_BP_InteractiveEnvironmentManagerComponent::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractiveEnvironmentManagerComponent_C_ExecuteUbergraph_BP_InteractiveEnvironmentManagerComponent, CallFunc_Not_PreBool_ReturnValue_2) == 0x000141, "Member 'BP_InteractiveEnvironmentManagerComponent_C_ExecuteUbergraph_BP_InteractiveEnvironmentManagerComponent::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_InteractiveEnvironmentManagerComponent_C_ExecuteUbergraph_BP_InteractiveEnvironmentManagerComponent, CallFunc_Conv_IntToDouble_ReturnValue_2) == 0x000148, "Member 'BP_InteractiveEnvironmentManagerComponent_C_ExecuteUbergraph_BP_InteractiveEnvironmentManagerComponent::CallFunc_Conv_IntToDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_InteractiveEnvironmentManagerComponent_C_ExecuteUbergraph_BP_InteractiveEnvironmentManagerComponent, CallFunc_Conv_IntToDouble_ReturnValue_3) == 0x000150, "Member 'BP_InteractiveEnvironmentManagerComponent_C_ExecuteUbergraph_BP_InteractiveEnvironmentManagerComponent::CallFunc_Conv_IntToDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_InteractiveEnvironmentManagerComponent_C_ExecuteUbergraph_BP_InteractiveEnvironmentManagerComponent, CallFunc_Conv_IntToDouble_ReturnValue_4) == 0x000158, "Member 'BP_InteractiveEnvironmentManagerComponent_C_ExecuteUbergraph_BP_InteractiveEnvironmentManagerComponent::CallFunc_Conv_IntToDouble_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_InteractiveEnvironmentManagerComponent_C_ExecuteUbergraph_BP_InteractiveEnvironmentManagerComponent, CallFunc_GetAllActorsOfClass_OutActors) == 0x000160, "Member 'BP_InteractiveEnvironmentManagerComponent_C_ExecuteUbergraph_BP_InteractiveEnvironmentManagerComponent::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(BP_InteractiveEnvironmentManagerComponent_C_ExecuteUbergraph_BP_InteractiveEnvironmentManagerComponent, CallFunc_Conv_IntToDouble_ReturnValue_5) == 0x000170, "Member 'BP_InteractiveEnvironmentManagerComponent_C_ExecuteUbergraph_BP_InteractiveEnvironmentManagerComponent::CallFunc_Conv_IntToDouble_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_InteractiveEnvironmentManagerComponent_C_ExecuteUbergraph_BP_InteractiveEnvironmentManagerComponent, CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast) == 0x000178, "Member 'BP_InteractiveEnvironmentManagerComponent_C_ExecuteUbergraph_BP_InteractiveEnvironmentManagerComponent::CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_InteractiveEnvironmentManagerComponent_C_ExecuteUbergraph_BP_InteractiveEnvironmentManagerComponent, CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast_1) == 0x00017C, "Member 'BP_InteractiveEnvironmentManagerComponent_C_ExecuteUbergraph_BP_InteractiveEnvironmentManagerComponent::CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_InteractiveEnvironmentManagerComponent_C_ExecuteUbergraph_BP_InteractiveEnvironmentManagerComponent, CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast_2) == 0x000180, "Member 'BP_InteractiveEnvironmentManagerComponent_C_ExecuteUbergraph_BP_InteractiveEnvironmentManagerComponent::CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(BP_InteractiveEnvironmentManagerComponent_C_ExecuteUbergraph_BP_InteractiveEnvironmentManagerComponent, CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast_3) == 0x000184, "Member 'BP_InteractiveEnvironmentManagerComponent_C_ExecuteUbergraph_BP_InteractiveEnvironmentManagerComponent::CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast_3' has a wrong offset!");
static_assert(offsetof(BP_InteractiveEnvironmentManagerComponent_C_ExecuteUbergraph_BP_InteractiveEnvironmentManagerComponent, CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast_4) == 0x000188, "Member 'BP_InteractiveEnvironmentManagerComponent_C_ExecuteUbergraph_BP_InteractiveEnvironmentManagerComponent::CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast_4' has a wrong offset!");
static_assert(offsetof(BP_InteractiveEnvironmentManagerComponent_C_ExecuteUbergraph_BP_InteractiveEnvironmentManagerComponent, CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast_5) == 0x00018C, "Member 'BP_InteractiveEnvironmentManagerComponent_C_ExecuteUbergraph_BP_InteractiveEnvironmentManagerComponent::CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast_5' has a wrong offset!");

// Function BP_InteractiveEnvironmentManagerComponent.BP_InteractiveEnvironmentManagerComponent_C.GetEnvironmentInteractionTypeMPC_ID
// 0x0038 (0x0038 - 0x0000)
struct BP_InteractiveEnvironmentManagerComponent_C_GetEnvironmentInteractionTypeMPC_ID final
{
public:
	E_InteractiveEnvironmentType                  Enumerator;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ReturnValue;                                       // 0x0004(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_InteractiveEnvironmentManagerComponent_C_GetEnvironmentInteractionTypeMPC_ID) == 0x000008, "Wrong alignment on BP_InteractiveEnvironmentManagerComponent_C_GetEnvironmentInteractionTypeMPC_ID");
static_assert(sizeof(BP_InteractiveEnvironmentManagerComponent_C_GetEnvironmentInteractionTypeMPC_ID) == 0x000038, "Wrong size on BP_InteractiveEnvironmentManagerComponent_C_GetEnvironmentInteractionTypeMPC_ID");
static_assert(offsetof(BP_InteractiveEnvironmentManagerComponent_C_GetEnvironmentInteractionTypeMPC_ID, Enumerator) == 0x000000, "Member 'BP_InteractiveEnvironmentManagerComponent_C_GetEnvironmentInteractionTypeMPC_ID::Enumerator' has a wrong offset!");
static_assert(offsetof(BP_InteractiveEnvironmentManagerComponent_C_GetEnvironmentInteractionTypeMPC_ID, ReturnValue) == 0x000004, "Member 'BP_InteractiveEnvironmentManagerComponent_C_GetEnvironmentInteractionTypeMPC_ID::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractiveEnvironmentManagerComponent_C_GetEnvironmentInteractionTypeMPC_ID, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x000010, "Member 'BP_InteractiveEnvironmentManagerComponent_C_GetEnvironmentInteractionTypeMPC_ID::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractiveEnvironmentManagerComponent_C_GetEnvironmentInteractionTypeMPC_ID, CallFunc_Concat_StrStr_ReturnValue) == 0x000020, "Member 'BP_InteractiveEnvironmentManagerComponent_C_GetEnvironmentInteractionTypeMPC_ID::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractiveEnvironmentManagerComponent_C_GetEnvironmentInteractionTypeMPC_ID, CallFunc_Conv_StringToName_ReturnValue) == 0x000030, "Member 'BP_InteractiveEnvironmentManagerComponent_C_GetEnvironmentInteractionTypeMPC_ID::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");

// Function BP_InteractiveEnvironmentManagerComponent.BP_InteractiveEnvironmentManagerComponent_C.GetOrCreateActorList
// 0x0050 (0x0050 - 0x0000)
struct BP_InteractiveEnvironmentManagerComponent_C_GetOrCreateActorList final
{
public:
	E_InteractiveEnvironmentType                  Key;                                               // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_ListOfActorsPerInteractionType      List;                                              // 0x0008(0x0010)(Parm, OutParm, HasGetValueTypeHash)
	TArray<class AActor*>                         Empty;                                             // 0x0018(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	struct FS_ListOfActorsPerInteractionType      K2Node_MakeStruct_S_ListOfActorsPerInteractionType; // 0x0028(0x0010)(HasGetValueTypeHash)
	struct FS_ListOfActorsPerInteractionType      CallFunc_Map_Find_Value;                           // 0x0038(0x0010)(HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Contains_ReturnValue;                 // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_InteractiveEnvironmentManagerComponent_C_GetOrCreateActorList) == 0x000008, "Wrong alignment on BP_InteractiveEnvironmentManagerComponent_C_GetOrCreateActorList");
static_assert(sizeof(BP_InteractiveEnvironmentManagerComponent_C_GetOrCreateActorList) == 0x000050, "Wrong size on BP_InteractiveEnvironmentManagerComponent_C_GetOrCreateActorList");
static_assert(offsetof(BP_InteractiveEnvironmentManagerComponent_C_GetOrCreateActorList, Key) == 0x000000, "Member 'BP_InteractiveEnvironmentManagerComponent_C_GetOrCreateActorList::Key' has a wrong offset!");
static_assert(offsetof(BP_InteractiveEnvironmentManagerComponent_C_GetOrCreateActorList, List) == 0x000008, "Member 'BP_InteractiveEnvironmentManagerComponent_C_GetOrCreateActorList::List' has a wrong offset!");
static_assert(offsetof(BP_InteractiveEnvironmentManagerComponent_C_GetOrCreateActorList, Empty) == 0x000018, "Member 'BP_InteractiveEnvironmentManagerComponent_C_GetOrCreateActorList::Empty' has a wrong offset!");
static_assert(offsetof(BP_InteractiveEnvironmentManagerComponent_C_GetOrCreateActorList, K2Node_MakeStruct_S_ListOfActorsPerInteractionType) == 0x000028, "Member 'BP_InteractiveEnvironmentManagerComponent_C_GetOrCreateActorList::K2Node_MakeStruct_S_ListOfActorsPerInteractionType' has a wrong offset!");
static_assert(offsetof(BP_InteractiveEnvironmentManagerComponent_C_GetOrCreateActorList, CallFunc_Map_Find_Value) == 0x000038, "Member 'BP_InteractiveEnvironmentManagerComponent_C_GetOrCreateActorList::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BP_InteractiveEnvironmentManagerComponent_C_GetOrCreateActorList, CallFunc_Map_Find_ReturnValue) == 0x000048, "Member 'BP_InteractiveEnvironmentManagerComponent_C_GetOrCreateActorList::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractiveEnvironmentManagerComponent_C_GetOrCreateActorList, CallFunc_Map_Contains_ReturnValue) == 0x000049, "Member 'BP_InteractiveEnvironmentManagerComponent_C_GetOrCreateActorList::CallFunc_Map_Contains_ReturnValue' has a wrong offset!");

// Function BP_InteractiveEnvironmentManagerComponent.BP_InteractiveEnvironmentManagerComponent_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_InteractiveEnvironmentManagerComponent_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_InteractiveEnvironmentManagerComponent_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_InteractiveEnvironmentManagerComponent_C_ReceiveEndPlay");
static_assert(sizeof(BP_InteractiveEnvironmentManagerComponent_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_InteractiveEnvironmentManagerComponent_C_ReceiveEndPlay");
static_assert(offsetof(BP_InteractiveEnvironmentManagerComponent_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_InteractiveEnvironmentManagerComponent_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function BP_InteractiveEnvironmentManagerComponent.BP_InteractiveEnvironmentManagerComponent_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_InteractiveEnvironmentManagerComponent_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_InteractiveEnvironmentManagerComponent_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_InteractiveEnvironmentManagerComponent_C_ReceiveTick");
static_assert(sizeof(BP_InteractiveEnvironmentManagerComponent_C_ReceiveTick) == 0x000004, "Wrong size on BP_InteractiveEnvironmentManagerComponent_C_ReceiveTick");
static_assert(offsetof(BP_InteractiveEnvironmentManagerComponent_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_InteractiveEnvironmentManagerComponent_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_InteractiveEnvironmentManagerComponent.BP_InteractiveEnvironmentManagerComponent_C.RegisterGrassInteractor
// 0x0018 (0x0018 - 0x0000)
struct BP_InteractiveEnvironmentManagerComponent_C_RegisterGrassInteractor final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_EnvironmentInteractorComponent_C*   CallFunc_GetComponentByClass_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_InteractiveEnvironmentManagerComponent_C_RegisterGrassInteractor) == 0x000008, "Wrong alignment on BP_InteractiveEnvironmentManagerComponent_C_RegisterGrassInteractor");
static_assert(sizeof(BP_InteractiveEnvironmentManagerComponent_C_RegisterGrassInteractor) == 0x000018, "Wrong size on BP_InteractiveEnvironmentManagerComponent_C_RegisterGrassInteractor");
static_assert(offsetof(BP_InteractiveEnvironmentManagerComponent_C_RegisterGrassInteractor, Actor) == 0x000000, "Member 'BP_InteractiveEnvironmentManagerComponent_C_RegisterGrassInteractor::Actor' has a wrong offset!");
static_assert(offsetof(BP_InteractiveEnvironmentManagerComponent_C_RegisterGrassInteractor, CallFunc_GetComponentByClass_ReturnValue) == 0x000008, "Member 'BP_InteractiveEnvironmentManagerComponent_C_RegisterGrassInteractor::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractiveEnvironmentManagerComponent_C_RegisterGrassInteractor, CallFunc_Array_Add_ReturnValue) == 0x000010, "Member 'BP_InteractiveEnvironmentManagerComponent_C_RegisterGrassInteractor::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function BP_InteractiveEnvironmentManagerComponent.BP_InteractiveEnvironmentManagerComponent_C.RegisterGrassInteractorComponent
// 0x0010 (0x0010 - 0x0000)
struct BP_InteractiveEnvironmentManagerComponent_C_RegisterGrassInteractorComponent final
{
public:
	class UBP_EnvironmentInteractorComponent_C*   Component;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_InteractiveEnvironmentManagerComponent_C_RegisterGrassInteractorComponent) == 0x000008, "Wrong alignment on BP_InteractiveEnvironmentManagerComponent_C_RegisterGrassInteractorComponent");
static_assert(sizeof(BP_InteractiveEnvironmentManagerComponent_C_RegisterGrassInteractorComponent) == 0x000010, "Wrong size on BP_InteractiveEnvironmentManagerComponent_C_RegisterGrassInteractorComponent");
static_assert(offsetof(BP_InteractiveEnvironmentManagerComponent_C_RegisterGrassInteractorComponent, Component) == 0x000000, "Member 'BP_InteractiveEnvironmentManagerComponent_C_RegisterGrassInteractorComponent::Component' has a wrong offset!");
static_assert(offsetof(BP_InteractiveEnvironmentManagerComponent_C_RegisterGrassInteractorComponent, CallFunc_Array_Add_ReturnValue) == 0x000008, "Member 'BP_InteractiveEnvironmentManagerComponent_C_RegisterGrassInteractorComponent::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function BP_InteractiveEnvironmentManagerComponent.BP_InteractiveEnvironmentManagerComponent_C.Retrieve Actor List from Zones
// 0x00C0 (0x00C0 - 0x0000)
struct BP_InteractiveEnvironmentManagerComponent_C_Retrieve_Actor_List_from_Zones final
{
public:
	TArray<class AActor*>                         local_actors;                                      // 0x0000(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetCameraLocation_ReturnValue;            // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_ListOfActorsPerInteractionType      K2Node_MakeStruct_S_ListOfActorsPerInteractionType; // 0x0048(0x0010)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_TriggerInteractiveEnvironmentZone_C* CallFunc_Array_Get_Item;                          // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item_1;                         // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0088(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Vector_Distance_ReturnValue;              // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AA[0x6];                                       // 0x00AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_ListOfActorsPerInteractionType      CallFunc_GetOrCreateActorList_List;                // 0x00B0(0x0010)(HasGetValueTypeHash)
};
static_assert(alignof(BP_InteractiveEnvironmentManagerComponent_C_Retrieve_Actor_List_from_Zones) == 0x000008, "Wrong alignment on BP_InteractiveEnvironmentManagerComponent_C_Retrieve_Actor_List_from_Zones");
static_assert(sizeof(BP_InteractiveEnvironmentManagerComponent_C_Retrieve_Actor_List_from_Zones) == 0x0000C0, "Wrong size on BP_InteractiveEnvironmentManagerComponent_C_Retrieve_Actor_List_from_Zones");
static_assert(offsetof(BP_InteractiveEnvironmentManagerComponent_C_Retrieve_Actor_List_from_Zones, local_actors) == 0x000000, "Member 'BP_InteractiveEnvironmentManagerComponent_C_Retrieve_Actor_List_from_Zones::local_actors' has a wrong offset!");
static_assert(offsetof(BP_InteractiveEnvironmentManagerComponent_C_Retrieve_Actor_List_from_Zones, Temp_int_Loop_Counter_Variable) == 0x000010, "Member 'BP_InteractiveEnvironmentManagerComponent_C_Retrieve_Actor_List_from_Zones::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_InteractiveEnvironmentManagerComponent_C_Retrieve_Actor_List_from_Zones, Temp_int_Loop_Counter_Variable_1) == 0x000014, "Member 'BP_InteractiveEnvironmentManagerComponent_C_Retrieve_Actor_List_from_Zones::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_InteractiveEnvironmentManagerComponent_C_Retrieve_Actor_List_from_Zones, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'BP_InteractiveEnvironmentManagerComponent_C_Retrieve_Actor_List_from_Zones::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractiveEnvironmentManagerComponent_C_Retrieve_Actor_List_from_Zones, CallFunc_Add_IntInt_ReturnValue_1) == 0x00001C, "Member 'BP_InteractiveEnvironmentManagerComponent_C_Retrieve_Actor_List_from_Zones::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_InteractiveEnvironmentManagerComponent_C_Retrieve_Actor_List_from_Zones, Temp_int_Array_Index_Variable) == 0x000020, "Member 'BP_InteractiveEnvironmentManagerComponent_C_Retrieve_Actor_List_from_Zones::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_InteractiveEnvironmentManagerComponent_C_Retrieve_Actor_List_from_Zones, Temp_int_Array_Index_Variable_1) == 0x000024, "Member 'BP_InteractiveEnvironmentManagerComponent_C_Retrieve_Actor_List_from_Zones::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_InteractiveEnvironmentManagerComponent_C_Retrieve_Actor_List_from_Zones, CallFunc_GetPlayerCameraManager_ReturnValue) == 0x000028, "Member 'BP_InteractiveEnvironmentManagerComponent_C_Retrieve_Actor_List_from_Zones::CallFunc_GetPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractiveEnvironmentManagerComponent_C_Retrieve_Actor_List_from_Zones, CallFunc_GetCameraLocation_ReturnValue) == 0x000030, "Member 'BP_InteractiveEnvironmentManagerComponent_C_Retrieve_Actor_List_from_Zones::CallFunc_GetCameraLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractiveEnvironmentManagerComponent_C_Retrieve_Actor_List_from_Zones, K2Node_MakeStruct_S_ListOfActorsPerInteractionType) == 0x000048, "Member 'BP_InteractiveEnvironmentManagerComponent_C_Retrieve_Actor_List_from_Zones::K2Node_MakeStruct_S_ListOfActorsPerInteractionType' has a wrong offset!");
static_assert(offsetof(BP_InteractiveEnvironmentManagerComponent_C_Retrieve_Actor_List_from_Zones, CallFunc_Array_Length_ReturnValue) == 0x000058, "Member 'BP_InteractiveEnvironmentManagerComponent_C_Retrieve_Actor_List_from_Zones::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractiveEnvironmentManagerComponent_C_Retrieve_Actor_List_from_Zones, CallFunc_Array_Get_Item) == 0x000060, "Member 'BP_InteractiveEnvironmentManagerComponent_C_Retrieve_Actor_List_from_Zones::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_InteractiveEnvironmentManagerComponent_C_Retrieve_Actor_List_from_Zones, CallFunc_Less_IntInt_ReturnValue) == 0x000068, "Member 'BP_InteractiveEnvironmentManagerComponent_C_Retrieve_Actor_List_from_Zones::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractiveEnvironmentManagerComponent_C_Retrieve_Actor_List_from_Zones, CallFunc_Array_Get_Item_1) == 0x000070, "Member 'BP_InteractiveEnvironmentManagerComponent_C_Retrieve_Actor_List_from_Zones::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_InteractiveEnvironmentManagerComponent_C_Retrieve_Actor_List_from_Zones, CallFunc_Array_Length_ReturnValue_1) == 0x000078, "Member 'BP_InteractiveEnvironmentManagerComponent_C_Retrieve_Actor_List_from_Zones::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_InteractiveEnvironmentManagerComponent_C_Retrieve_Actor_List_from_Zones, CallFunc_Array_AddUnique_ReturnValue) == 0x00007C, "Member 'BP_InteractiveEnvironmentManagerComponent_C_Retrieve_Actor_List_from_Zones::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractiveEnvironmentManagerComponent_C_Retrieve_Actor_List_from_Zones, CallFunc_Less_IntInt_ReturnValue_1) == 0x000080, "Member 'BP_InteractiveEnvironmentManagerComponent_C_Retrieve_Actor_List_from_Zones::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_InteractiveEnvironmentManagerComponent_C_Retrieve_Actor_List_from_Zones, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000088, "Member 'BP_InteractiveEnvironmentManagerComponent_C_Retrieve_Actor_List_from_Zones::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractiveEnvironmentManagerComponent_C_Retrieve_Actor_List_from_Zones, CallFunc_Vector_Distance_ReturnValue) == 0x0000A0, "Member 'BP_InteractiveEnvironmentManagerComponent_C_Retrieve_Actor_List_from_Zones::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractiveEnvironmentManagerComponent_C_Retrieve_Actor_List_from_Zones, CallFunc_IsValid_ReturnValue) == 0x0000A8, "Member 'BP_InteractiveEnvironmentManagerComponent_C_Retrieve_Actor_List_from_Zones::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractiveEnvironmentManagerComponent_C_Retrieve_Actor_List_from_Zones, CallFunc_Less_DoubleDouble_ReturnValue) == 0x0000A9, "Member 'BP_InteractiveEnvironmentManagerComponent_C_Retrieve_Actor_List_from_Zones::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractiveEnvironmentManagerComponent_C_Retrieve_Actor_List_from_Zones, CallFunc_GetOrCreateActorList_List) == 0x0000B0, "Member 'BP_InteractiveEnvironmentManagerComponent_C_Retrieve_Actor_List_from_Zones::CallFunc_GetOrCreateActorList_List' has a wrong offset!");

// Function BP_InteractiveEnvironmentManagerComponent.BP_InteractiveEnvironmentManagerComponent_C.SnapWorldLocation
// 0x00C0 (0x00C0 - 0x0000)
struct BP_InteractiveEnvironmentManagerComponent_C_SnapWorldLocation final
{
public:
	struct FVector                                A;                                                 // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MulitplySizeOfInteraction;                         // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                ReturnValue;                                       // 0x0020(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_IntToVector_ReturnValue;             // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Divide_VectorVector_ReturnValue;          // 0x0050(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue;                        // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue_1;                      // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_1;           // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue_2;                      // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_2;           // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x00A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_InteractiveEnvironmentManagerComponent_C_SnapWorldLocation) == 0x000008, "Wrong alignment on BP_InteractiveEnvironmentManagerComponent_C_SnapWorldLocation");
static_assert(sizeof(BP_InteractiveEnvironmentManagerComponent_C_SnapWorldLocation) == 0x0000C0, "Wrong size on BP_InteractiveEnvironmentManagerComponent_C_SnapWorldLocation");
static_assert(offsetof(BP_InteractiveEnvironmentManagerComponent_C_SnapWorldLocation, A) == 0x000000, "Member 'BP_InteractiveEnvironmentManagerComponent_C_SnapWorldLocation::A' has a wrong offset!");
static_assert(offsetof(BP_InteractiveEnvironmentManagerComponent_C_SnapWorldLocation, MulitplySizeOfInteraction) == 0x000018, "Member 'BP_InteractiveEnvironmentManagerComponent_C_SnapWorldLocation::MulitplySizeOfInteraction' has a wrong offset!");
static_assert(offsetof(BP_InteractiveEnvironmentManagerComponent_C_SnapWorldLocation, ReturnValue) == 0x000020, "Member 'BP_InteractiveEnvironmentManagerComponent_C_SnapWorldLocation::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractiveEnvironmentManagerComponent_C_SnapWorldLocation, CallFunc_Conv_IntToVector_ReturnValue) == 0x000038, "Member 'BP_InteractiveEnvironmentManagerComponent_C_SnapWorldLocation::CallFunc_Conv_IntToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractiveEnvironmentManagerComponent_C_SnapWorldLocation, CallFunc_Divide_VectorVector_ReturnValue) == 0x000050, "Member 'BP_InteractiveEnvironmentManagerComponent_C_SnapWorldLocation::CallFunc_Divide_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractiveEnvironmentManagerComponent_C_SnapWorldLocation, CallFunc_BreakVector_X) == 0x000068, "Member 'BP_InteractiveEnvironmentManagerComponent_C_SnapWorldLocation::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_InteractiveEnvironmentManagerComponent_C_SnapWorldLocation, CallFunc_BreakVector_Y) == 0x000070, "Member 'BP_InteractiveEnvironmentManagerComponent_C_SnapWorldLocation::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_InteractiveEnvironmentManagerComponent_C_SnapWorldLocation, CallFunc_BreakVector_Z) == 0x000078, "Member 'BP_InteractiveEnvironmentManagerComponent_C_SnapWorldLocation::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_InteractiveEnvironmentManagerComponent_C_SnapWorldLocation, CallFunc_Round_ReturnValue) == 0x000080, "Member 'BP_InteractiveEnvironmentManagerComponent_C_SnapWorldLocation::CallFunc_Round_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractiveEnvironmentManagerComponent_C_SnapWorldLocation, CallFunc_Round_ReturnValue_1) == 0x000084, "Member 'BP_InteractiveEnvironmentManagerComponent_C_SnapWorldLocation::CallFunc_Round_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_InteractiveEnvironmentManagerComponent_C_SnapWorldLocation, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000088, "Member 'BP_InteractiveEnvironmentManagerComponent_C_SnapWorldLocation::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractiveEnvironmentManagerComponent_C_SnapWorldLocation, CallFunc_Conv_IntToDouble_ReturnValue_1) == 0x000090, "Member 'BP_InteractiveEnvironmentManagerComponent_C_SnapWorldLocation::CallFunc_Conv_IntToDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_InteractiveEnvironmentManagerComponent_C_SnapWorldLocation, CallFunc_Round_ReturnValue_2) == 0x000098, "Member 'BP_InteractiveEnvironmentManagerComponent_C_SnapWorldLocation::CallFunc_Round_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_InteractiveEnvironmentManagerComponent_C_SnapWorldLocation, CallFunc_Conv_IntToDouble_ReturnValue_2) == 0x0000A0, "Member 'BP_InteractiveEnvironmentManagerComponent_C_SnapWorldLocation::CallFunc_Conv_IntToDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_InteractiveEnvironmentManagerComponent_C_SnapWorldLocation, CallFunc_MakeVector_ReturnValue) == 0x0000A8, "Member 'BP_InteractiveEnvironmentManagerComponent_C_SnapWorldLocation::CallFunc_MakeVector_ReturnValue' has a wrong offset!");

// Function BP_InteractiveEnvironmentManagerComponent.BP_InteractiveEnvironmentManagerComponent_C.StampOnCanvasAndRenderMaterialFull
// 0x0590 (0x0590 - 0x0000)
struct BP_InteractiveEnvironmentManagerComponent_C_StampOnCanvasAndRenderMaterialFull final
{
public:
	class UTextureRenderTarget2D*                 Render_Target_Flip;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTextureRenderTarget2D*                 Render_Target_Flop;                                // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Parent_Canvas_Material;                            // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          IsFlip;                                            // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_InteractiveEnvironmentType                  TypeOfInteraction;                                 // 0x0019(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Impact_Size_Multiplicator;                         // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
