#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_InputContextComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EnhancedInput_structs.hpp"
#include "S_InputContextParameters_structs.hpp"


namespace SDK::Params
{

// Function BP_InputContextComponent.BP_InputContextComponent_C.ApplyDefaultInputContext
// 0x0010 (0x0010 - 0x0000)
struct BP_InputContextComponent_C_ApplyDefaultInputContext final
{
public:
	struct FS_InputContextParameters              K2Node_MakeStruct_S_InputContextParameters;        // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_InputContextComponent_C_ApplyDefaultInputContext) == 0x000008, "Wrong alignment on BP_InputContextComponent_C_ApplyDefaultInputContext");
static_assert(sizeof(BP_InputContextComponent_C_ApplyDefaultInputContext) == 0x000010, "Wrong size on BP_InputContextComponent_C_ApplyDefaultInputContext");
static_assert(offsetof(BP_InputContextComponent_C_ApplyDefaultInputContext, K2Node_MakeStruct_S_InputContextParameters) == 0x000000, "Member 'BP_InputContextComponent_C_ApplyDefaultInputContext::K2Node_MakeStruct_S_InputContextParameters' has a wrong offset!");

// Function BP_InputContextComponent.BP_InputContextComponent_C.ExecuteUbergraph_BP_InputContextComponent
// 0x0020 (0x0020 - 0x0000)
struct BP_InputContextComponent_C_ExecuteUbergraph_BP_InputContextComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_InputLockComponent_C*               CallFunc_GetInputLockSystem_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_InputContextComponent_C_ExecuteUbergraph_BP_InputContextComponent) == 0x000008, "Wrong alignment on BP_InputContextComponent_C_ExecuteUbergraph_BP_InputContextComponent");
static_assert(sizeof(BP_InputContextComponent_C_ExecuteUbergraph_BP_InputContextComponent) == 0x000020, "Wrong size on BP_InputContextComponent_C_ExecuteUbergraph_BP_InputContextComponent");
static_assert(offsetof(BP_InputContextComponent_C_ExecuteUbergraph_BP_InputContextComponent, EntryPoint) == 0x000000, "Member 'BP_InputContextComponent_C_ExecuteUbergraph_BP_InputContextComponent::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_InputContextComponent_C_ExecuteUbergraph_BP_InputContextComponent, CallFunc_GetInputLockSystem_ReturnValue) == 0x000008, "Member 'BP_InputContextComponent_C_ExecuteUbergraph_BP_InputContextComponent::CallFunc_GetInputLockSystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InputContextComponent_C_ExecuteUbergraph_BP_InputContextComponent, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'BP_InputContextComponent_C_ExecuteUbergraph_BP_InputContextComponent::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function BP_InputContextComponent.BP_InputContextComponent_C.GetCurrentInputMappingNames
// 0x0078 (0x0078 - 0x0000)
struct BP_InputContextComponent_C_GetCurrentInputMappingNames final
{
public:
	class FString                                 MovementInputMapping;                              // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CameraInputMapping;                                // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          local_wasEmpty;                                    // 0x0020(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue_1;             // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_SelectString_ReturnValue;                 // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_SelectString_ReturnValue_1;               // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_InputContextComponent_C_GetCurrentInputMappingNames) == 0x000008, "Wrong alignment on BP_InputContextComponent_C_GetCurrentInputMappingNames");
static_assert(sizeof(BP_InputContextComponent_C_GetCurrentInputMappingNames) == 0x000078, "Wrong size on BP_InputContextComponent_C_GetCurrentInputMappingNames");
static_assert(offsetof(BP_InputContextComponent_C_GetCurrentInputMappingNames, MovementInputMapping) == 0x000000, "Member 'BP_InputContextComponent_C_GetCurrentInputMappingNames::MovementInputMapping' has a wrong offset!");
static_assert(offsetof(BP_InputContextComponent_C_GetCurrentInputMappingNames, CameraInputMapping) == 0x000010, "Member 'BP_InputContextComponent_C_GetCurrentInputMappingNames::CameraInputMapping' has a wrong offset!");
static_assert(offsetof(BP_InputContextComponent_C_GetCurrentInputMappingNames, local_wasEmpty) == 0x000020, "Member 'BP_InputContextComponent_C_GetCurrentInputMappingNames::local_wasEmpty' has a wrong offset!");
static_assert(offsetof(BP_InputContextComponent_C_GetCurrentInputMappingNames, CallFunc_GetDisplayName_ReturnValue) == 0x000028, "Member 'BP_InputContextComponent_C_GetCurrentInputMappingNames::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InputContextComponent_C_GetCurrentInputMappingNames, CallFunc_IsValid_ReturnValue) == 0x000038, "Member 'BP_InputContextComponent_C_GetCurrentInputMappingNames::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InputContextComponent_C_GetCurrentInputMappingNames, CallFunc_GetDisplayName_ReturnValue_1) == 0x000040, "Member 'BP_InputContextComponent_C_GetCurrentInputMappingNames::CallFunc_GetDisplayName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_InputContextComponent_C_GetCurrentInputMappingNames, CallFunc_IsValid_ReturnValue_1) == 0x000050, "Member 'BP_InputContextComponent_C_GetCurrentInputMappingNames::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_InputContextComponent_C_GetCurrentInputMappingNames, CallFunc_SelectString_ReturnValue) == 0x000058, "Member 'BP_InputContextComponent_C_GetCurrentInputMappingNames::CallFunc_SelectString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InputContextComponent_C_GetCurrentInputMappingNames, CallFunc_SelectString_ReturnValue_1) == 0x000068, "Member 'BP_InputContextComponent_C_GetCurrentInputMappingNames::CallFunc_SelectString_ReturnValue_1' has a wrong offset!");

// Function BP_InputContextComponent.BP_InputContextComponent_C.RemovePushedInputContexts
// 0x0048 (0x0048 - 0x0000)
struct BP_InputContextComponent_C_RemovePushedInputContexts final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UEnhancedInputLocalPlayerSubsystem*     CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue; // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FModifyContextOptions                  K2Node_MakeStruct_ModifyContextOptions;            // 0x0020(0x0001)(NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInputMappingContext*                   CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IEnhancedInputSubsystemInterface> CallFunc_RemoveMappingContext_self_CastInput; // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_InputContextComponent_C_RemovePushedInputContexts) == 0x000008, "Wrong alignment on BP_InputContextComponent_C_RemovePushedInputContexts");
static_assert(sizeof(BP_InputContextComponent_C_RemovePushedInputContexts) == 0x000048, "Wrong size on BP_InputContextComponent_C_RemovePushedInputContexts");
static_assert(offsetof(BP_InputContextComponent_C_RemovePushedInputContexts, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BP_InputContextComponent_C_RemovePushedInputContexts::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_InputContextComponent_C_RemovePushedInputContexts, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_InputContextComponent_C_RemovePushedInputContexts::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_InputContextComponent_C_RemovePushedInputContexts, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_InputContextComponent_C_RemovePushedInputContexts::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InputContextComponent_C_RemovePushedInputContexts, CallFunc_GetPlayerController_ReturnValue) == 0x000010, "Member 'BP_InputContextComponent_C_RemovePushedInputContexts::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InputContextComponent_C_RemovePushedInputContexts, CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue) == 0x000018, "Member 'BP_InputContextComponent_C_RemovePushedInputContexts::CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InputContextComponent_C_RemovePushedInputContexts, K2Node_MakeStruct_ModifyContextOptions) == 0x000020, "Member 'BP_InputContextComponent_C_RemovePushedInputContexts::K2Node_MakeStruct_ModifyContextOptions' has a wrong offset!");
static_assert(offsetof(BP_InputContextComponent_C_RemovePushedInputContexts, CallFunc_Array_Length_ReturnValue) == 0x000024, "Member 'BP_InputContextComponent_C_RemovePushedInputContexts::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InputContextComponent_C_RemovePushedInputContexts, CallFunc_Array_Get_Item) == 0x000028, "Member 'BP_InputContextComponent_C_RemovePushedInputContexts::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_InputContextComponent_C_RemovePushedInputContexts, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'BP_InputContextComponent_C_RemovePushedInputContexts::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InputContextComponent_C_RemovePushedInputContexts, CallFunc_RemoveMappingContext_self_CastInput) == 0x000038, "Member 'BP_InputContextComponent_C_RemovePushedInputContexts::CallFunc_RemoveMappingContext_self_CastInput' has a wrong offset!");

// Function BP_InputContextComponent.BP_InputContextComponent_C.SetInputContext
// 0x0130 (0x0130 - 0x0000)
struct BP_InputContextComponent_C_SetInputContext final
{
public:
	struct FS_InputContextParameters              Parameters;                                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_SelectString_ReturnValue;                 // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue_1;             // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0050(0x0010)()
	class FString                                 CallFunc_SelectString_ReturnValue_1;               // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0070(0x0048)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x00B8(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00C8(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0110(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Format_ReturnValue;                       // 0x0120(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_InputContextComponent_C_SetInputContext) == 0x000008, "Wrong alignment on BP_InputContextComponent_C_SetInputContext");
static_assert(sizeof(BP_InputContextComponent_C_SetInputContext) == 0x000130, "Wrong size on BP_InputContextComponent_C_SetInputContext");
static_assert(offsetof(BP_InputContextComponent_C_SetInputContext, Parameters) == 0x000000, "Member 'BP_InputContextComponent_C_SetInputContext::Parameters' has a wrong offset!");
static_assert(offsetof(BP_InputContextComponent_C_SetInputContext, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'BP_InputContextComponent_C_SetInputContext::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InputContextComponent_C_SetInputContext, CallFunc_GetDisplayName_ReturnValue) == 0x000018, "Member 'BP_InputContextComponent_C_SetInputContext::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InputContextComponent_C_SetInputContext, CallFunc_IsValid_ReturnValue_1) == 0x000028, "Member 'BP_InputContextComponent_C_SetInputContext::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_InputContextComponent_C_SetInputContext, CallFunc_SelectString_ReturnValue) == 0x000030, "Member 'BP_InputContextComponent_C_SetInputContext::CallFunc_SelectString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InputContextComponent_C_SetInputContext, CallFunc_GetDisplayName_ReturnValue_1) == 0x000040, "Member 'BP_InputContextComponent_C_SetInputContext::CallFunc_GetDisplayName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_InputContextComponent_C_SetInputContext, CallFunc_Conv_StringToText_ReturnValue) == 0x000050, "Member 'BP_InputContextComponent_C_SetInputContext::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InputContextComponent_C_SetInputContext, CallFunc_SelectString_ReturnValue_1) == 0x000060, "Member 'BP_InputContextComponent_C_SetInputContext::CallFunc_SelectString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_InputContextComponent_C_SetInputContext, K2Node_MakeStruct_FormatArgumentData) == 0x000070, "Member 'BP_InputContextComponent_C_SetInputContext::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_InputContextComponent_C_SetInputContext, CallFunc_Conv_StringToText_ReturnValue_1) == 0x0000B8, "Member 'BP_InputContextComponent_C_SetInputContext::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_InputContextComponent_C_SetInputContext, K2Node_MakeStruct_FormatArgumentData_1) == 0x0000C8, "Member 'BP_InputContextComponent_C_SetInputContext::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BP_InputContextComponent_C_SetInputContext, K2Node_MakeArray_Array) == 0x000110, "Member 'BP_InputContextComponent_C_SetInputContext::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_InputContextComponent_C_SetInputContext, CallFunc_Format_ReturnValue) == 0x000120, "Member 'BP_InputContextComponent_C_SetInputContext::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function BP_InputContextComponent.BP_InputContextComponent_C.UpdateInputContexts
// 0x00D8 (0x00D8 - 0x0000)
struct BP_InputContextComponent_C_UpdateInputContexts final
{
public:
	struct FS_InputContextParameters              Parameters;                                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_InputLockComponent_C*               CallFunc_GetInputLockSystem_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMovementInputLocked_ReturnValue;        // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_InputLockComponent_C*               CallFunc_GetInputLockSystem_ReturnValue_1;         // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCameraInputLocked_ReturnValue;          // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B[0x5];                                       // 0x002B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_InputLockComponent_C*               CallFunc_GetInputLockSystem_ReturnValue_2;         // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMovementInputLocked_ReturnValue_1;      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UEnhancedInputLocalPlayerSubsystem*     CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue; // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FModifyContextOptions                  K2Node_MakeStruct_ModifyContextOptions;            // 0x0058(0x0001)(NoDestructor)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IEnhancedInputSubsystemInterface> CallFunc_AddMappingContext_self_CastInput; // 0x0068(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue_2;                  // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FModifyContextOptions                  K2Node_MakeStruct_ModifyContextOptions_1;          // 0x0081(0x0001)(NoDestructor)
	uint8                                         Pad_82[0x6];                                       // 0x0082(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IEnhancedInputSubsystemInterface> CallFunc_AddMappingContext_self_CastInput_1; // 0x0088(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FModifyContextOptions                  K2Node_MakeStruct_ModifyContextOptions_2;          // 0x0098(0x0001)(NoDestructor)
	struct FModifyContextOptions                  K2Node_MakeStruct_ModifyContextOptions_3;          // 0x0099(0x0001)(NoDestructor)
	uint8                                         Pad_9A[0x6];                                       // 0x009A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IEnhancedInputSubsystemInterface> CallFunc_AddMappingContext_self_CastInput_2; // 0x00A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IEnhancedInputSubsystemInterface> CallFunc_AddMappingContext_self_CastInput_3; // 0x00B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPackagedForDistribution_ReturnValue;    // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C2[0x6];                                       // 0x00C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	const class UInputMappingContext*             Temp_object_Variable;                              // 0x00C8(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_3;                  // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_InputContextComponent_C_UpdateInputContexts) == 0x000008, "Wrong alignment on BP_InputContextComponent_C_UpdateInputContexts");
static_assert(sizeof(BP_InputContextComponent_C_UpdateInputContexts) == 0x0000D8, "Wrong size on BP_InputContextComponent_C_UpdateInputContexts");
static_assert(offsetof(BP_InputContextComponent_C_UpdateInputContexts, Parameters) == 0x000000, "Member 'BP_InputContextComponent_C_UpdateInputContexts::Parameters' has a wrong offset!");
static_assert(offsetof(BP_InputContextComponent_C_UpdateInputContexts, CallFunc_GetInputLockSystem_ReturnValue) == 0x000010, "Member 'BP_InputContextComponent_C_UpdateInputContexts::CallFunc_GetInputLockSystem_ReturnValue' has a wrong offset!");
