#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ItemSorter_ByAcquisitionDate

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_ItemSorter_ByAcquisitionDate.BP_ItemSorter_ByAcquisitionDate_C.GetDisplayName
// 0x0010 (0x0010 - 0x0000)
struct BP_ItemSorter_ByAcquisitionDate_C_GetDisplayName final
{
public:
	class FText                                   DisplayName;                                       // 0x0000(0x0010)(Parm, OutParm)
};
static_assert(alignof(BP_ItemSorter_ByAcquisitionDate_C_GetDisplayName) == 0x000008, "Wrong alignment on BP_ItemSorter_ByAcquisitionDate_C_GetDisplayName");
static_assert(sizeof(BP_ItemSorter_ByAcquisitionDate_C_GetDisplayName) == 0x000010, "Wrong size on BP_ItemSorter_ByAcquisitionDate_C_GetDisplayName");
static_assert(offsetof(BP_ItemSorter_ByAcquisitionDate_C_GetDisplayName, DisplayName) == 0x000000, "Member 'BP_ItemSorter_ByAcquisitionDate_C_GetDisplayName::DisplayName' has a wrong offset!");

// Function BP_ItemSorter_ByAcquisitionDate.BP_ItemSorter_ByAcquisitionDate_C.SortItemInstances
// 0x0030 (0x0030 - 0x0000)
struct BP_ItemSorter_ByAcquisitionDate_C_SortItemInstances final
{
public:
	class UBP_ItemInstance_Base_C*                A;                                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_ItemInstance_Base_C*                B;                                                 // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UOrderingResult*                        Result;                                            // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetAcquiredPlayTime_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetAcquiredPlayTime_ReturnValue_1;        // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ItemSorter_ByAcquisitionDate_C_SortItemInstances) == 0x000008, "Wrong alignment on BP_ItemSorter_ByAcquisitionDate_C_SortItemInstances");
static_assert(sizeof(BP_ItemSorter_ByAcquisitionDate_C_SortItemInstances) == 0x000030, "Wrong size on BP_ItemSorter_ByAcquisitionDate_C_SortItemInstances");
static_assert(offsetof(BP_ItemSorter_ByAcquisitionDate_C_SortItemInstances, A) == 0x000000, "Member 'BP_ItemSorter_ByAcquisitionDate_C_SortItemInstances::A' has a wrong offset!");
static_assert(offsetof(BP_ItemSorter_ByAcquisitionDate_C_SortItemInstances, B) == 0x000008, "Member 'BP_ItemSorter_ByAcquisitionDate_C_SortItemInstances::B' has a wrong offset!");
static_assert(offsetof(BP_ItemSorter_ByAcquisitionDate_C_SortItemInstances, Result) == 0x000010, "Member 'BP_ItemSorter_ByAcquisitionDate_C_SortItemInstances::Result' has a wrong offset!");
static_assert(offsetof(BP_ItemSorter_ByAcquisitionDate_C_SortItemInstances, CallFunc_GetAcquiredPlayTime_ReturnValue) == 0x000018, "Member 'BP_ItemSorter_ByAcquisitionDate_C_SortItemInstances::CallFunc_GetAcquiredPlayTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemSorter_ByAcquisitionDate_C_SortItemInstances, CallFunc_GetAcquiredPlayTime_ReturnValue_1) == 0x000020, "Member 'BP_ItemSorter_ByAcquisitionDate_C_SortItemInstances::CallFunc_GetAcquiredPlayTime_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ItemSorter_ByAcquisitionDate_C_SortItemInstances, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000028, "Member 'BP_ItemSorter_ByAcquisitionDate_C_SortItemInstances::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemSorter_ByAcquisitionDate_C_SortItemInstances, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000029, "Member 'BP_ItemSorter_ByAcquisitionDate_C_SortItemInstances::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");

}

