#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_InputKeyState

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_InputKeyState.BP_InputKeyState_C.BindAxis
// 0x0220 (0x0220 - 0x0000)
struct BP_InputKeyState_C_BindAxis final
{
public:
	TDelegate<void(double Value)>                 Event;                                             // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Pressed_BoundObject_0;                             // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_ObjectToText_ReturnValue;            // 0x0018(0x0010)()
	class FText                                   CallFunc_Conv_NameToText_ReturnValue;              // 0x0028(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0038(0x0048)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0080(0x0048)(HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_NameToText_ReturnValue_1;            // 0x00D8(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x00E8(0x0048)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x0130(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0178(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Conv_ObjectToText_ReturnValue_1;          // 0x0188(0x0010)()
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0198(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_4;            // 0x01A8(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x01F0(0x0010)(ReferenceParm)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_201[0x7];                                      // 0x0201(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0208(0x0010)()
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_InputKeyState_C_BindAxis) == 0x000008, "Wrong alignment on BP_InputKeyState_C_BindAxis");
static_assert(sizeof(BP_InputKeyState_C_BindAxis) == 0x000220, "Wrong size on BP_InputKeyState_C_BindAxis");
static_assert(offsetof(BP_InputKeyState_C_BindAxis, Event) == 0x000000, "Member 'BP_InputKeyState_C_BindAxis::Event' has a wrong offset!");
static_assert(offsetof(BP_InputKeyState_C_BindAxis, Pressed_BoundObject_0) == 0x000010, "Member 'BP_InputKeyState_C_BindAxis::Pressed_BoundObject_0' has a wrong offset!");
static_assert(offsetof(BP_InputKeyState_C_BindAxis, CallFunc_Conv_ObjectToText_ReturnValue) == 0x000018, "Member 'BP_InputKeyState_C_BindAxis::CallFunc_Conv_ObjectToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InputKeyState_C_BindAxis, CallFunc_Conv_NameToText_ReturnValue) == 0x000028, "Member 'BP_InputKeyState_C_BindAxis::CallFunc_Conv_NameToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InputKeyState_C_BindAxis, K2Node_MakeStruct_FormatArgumentData) == 0x000038, "Member 'BP_InputKeyState_C_BindAxis::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_InputKeyState_C_BindAxis, K2Node_MakeStruct_FormatArgumentData_1) == 0x000080, "Member 'BP_InputKeyState_C_BindAxis::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BP_InputKeyState_C_BindAxis, CallFunc_IsValid_ReturnValue) == 0x0000C8, "Member 'BP_InputKeyState_C_BindAxis::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InputKeyState_C_BindAxis, CallFunc_Conv_IntToInt64_ReturnValue) == 0x0000D0, "Member 'BP_InputKeyState_C_BindAxis::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InputKeyState_C_BindAxis, CallFunc_Conv_NameToText_ReturnValue_1) == 0x0000D8, "Member 'BP_InputKeyState_C_BindAxis::CallFunc_Conv_NameToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_InputKeyState_C_BindAxis, K2Node_MakeStruct_FormatArgumentData_2) == 0x0000E8, "Member 'BP_InputKeyState_C_BindAxis::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(BP_InputKeyState_C_BindAxis, K2Node_MakeStruct_FormatArgumentData_3) == 0x000130, "Member 'BP_InputKeyState_C_BindAxis::K2Node_MakeStruct_FormatArgumentData_3' has a wrong offset!");
static_assert(offsetof(BP_InputKeyState_C_BindAxis, K2Node_MakeArray_Array) == 0x000178, "Member 'BP_InputKeyState_C_BindAxis::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_InputKeyState_C_BindAxis, CallFunc_Conv_ObjectToText_ReturnValue_1) == 0x000188, "Member 'BP_InputKeyState_C_BindAxis::CallFunc_Conv_ObjectToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_InputKeyState_C_BindAxis, CallFunc_Format_ReturnValue) == 0x000198, "Member 'BP_InputKeyState_C_BindAxis::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InputKeyState_C_BindAxis, K2Node_MakeStruct_FormatArgumentData_4) == 0x0001A8, "Member 'BP_InputKeyState_C_BindAxis::K2Node_MakeStruct_FormatArgumentData_4' has a wrong offset!");
static_assert(offsetof(BP_InputKeyState_C_BindAxis, K2Node_MakeArray_Array_1) == 0x0001F0, "Member 'BP_InputKeyState_C_BindAxis::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BP_InputKeyState_C_BindAxis, CallFunc_IsValid_ReturnValue_1) == 0x000200, "Member 'BP_InputKeyState_C_BindAxis::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_InputKeyState_C_BindAxis, CallFunc_Format_ReturnValue_1) == 0x000208, "Member 'BP_InputKeyState_C_BindAxis::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_InputKeyState_C_BindAxis, CallFunc_Not_PreBool_ReturnValue) == 0x000218, "Member 'BP_InputKeyState_C_BindAxis::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function BP_InputKeyState.BP_InputKeyState_C.BindPressed
// 0x0218 (0x0218 - 0x0000)
struct BP_InputKeyState_C_BindPressed final
{
public:
	TDelegate<void()>                             Event;                                             // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Pressed_BoundObject_0;                             // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_ObjectToText_ReturnValue;            // 0x0018(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0028(0x0048)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_ObjectToText_ReturnValue_1;          // 0x0070(0x0010)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0088(0x0048)(HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D2[0x6];                                       // 0x00D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_NameToText_ReturnValue;              // 0x00D8(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x00E8(0x0048)(HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0138(0x0010)(ReferenceParm)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x0148(0x0048)(HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0190(0x0010)()
	class FText                                   CallFunc_Conv_NameToText_ReturnValue_1;            // 0x01A0(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_4;            // 0x01B0(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x01F8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0208(0x0010)()
};
static_assert(alignof(BP_InputKeyState_C_BindPressed) == 0x000008, "Wrong alignment on BP_InputKeyState_C_BindPressed");
static_assert(sizeof(BP_InputKeyState_C_BindPressed) == 0x000218, "Wrong size on BP_InputKeyState_C_BindPressed");
static_assert(offsetof(BP_InputKeyState_C_BindPressed, Event) == 0x000000, "Member 'BP_InputKeyState_C_BindPressed::Event' has a wrong offset!");
static_assert(offsetof(BP_InputKeyState_C_BindPressed, Pressed_BoundObject_0) == 0x000010, "Member 'BP_InputKeyState_C_BindPressed::Pressed_BoundObject_0' has a wrong offset!");
static_assert(offsetof(BP_InputKeyState_C_BindPressed, CallFunc_Conv_ObjectToText_ReturnValue) == 0x000018, "Member 'BP_InputKeyState_C_BindPressed::CallFunc_Conv_ObjectToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InputKeyState_C_BindPressed, K2Node_MakeStruct_FormatArgumentData) == 0x000028, "Member 'BP_InputKeyState_C_BindPressed::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_InputKeyState_C_BindPressed, CallFunc_Conv_ObjectToText_ReturnValue_1) == 0x000070, "Member 'BP_InputKeyState_C_BindPressed::CallFunc_Conv_ObjectToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_InputKeyState_C_BindPressed, CallFunc_IsValid_ReturnValue) == 0x000080, "Member 'BP_InputKeyState_C_BindPressed::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InputKeyState_C_BindPressed, K2Node_MakeStruct_FormatArgumentData_1) == 0x000088, "Member 'BP_InputKeyState_C_BindPressed::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BP_InputKeyState_C_BindPressed, CallFunc_Not_PreBool_ReturnValue) == 0x0000D0, "Member 'BP_InputKeyState_C_BindPressed::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InputKeyState_C_BindPressed, CallFunc_IsValid_ReturnValue_1) == 0x0000D1, "Member 'BP_InputKeyState_C_BindPressed::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_InputKeyState_C_BindPressed, CallFunc_Conv_NameToText_ReturnValue) == 0x0000D8, "Member 'BP_InputKeyState_C_BindPressed::CallFunc_Conv_NameToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InputKeyState_C_BindPressed, K2Node_MakeStruct_FormatArgumentData_2) == 0x0000E8, "Member 'BP_InputKeyState_C_BindPressed::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(BP_InputKeyState_C_BindPressed, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000130, "Member 'BP_InputKeyState_C_BindPressed::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InputKeyState_C_BindPressed, K2Node_MakeArray_Array) == 0x000138, "Member 'BP_InputKeyState_C_BindPressed::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_InputKeyState_C_BindPressed, K2Node_MakeStruct_FormatArgumentData_3) == 0x000148, "Member 'BP_InputKeyState_C_BindPressed::K2Node_MakeStruct_FormatArgumentData_3' has a wrong offset!");
static_assert(offsetof(BP_InputKeyState_C_BindPressed, CallFunc_Format_ReturnValue) == 0x000190, "Member 'BP_InputKeyState_C_BindPressed::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InputKeyState_C_BindPressed, CallFunc_Conv_NameToText_ReturnValue_1) == 0x0001A0, "Member 'BP_InputKeyState_C_BindPressed::CallFunc_Conv_NameToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_InputKeyState_C_BindPressed, K2Node_MakeStruct_FormatArgumentData_4) == 0x0001B0, "Member 'BP_InputKeyState_C_BindPressed::K2Node_MakeStruct_FormatArgumentData_4' has a wrong offset!");
static_assert(offsetof(BP_InputKeyState_C_BindPressed, K2Node_MakeArray_Array_1) == 0x0001F8, "Member 'BP_InputKeyState_C_BindPressed::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BP_InputKeyState_C_BindPressed, CallFunc_Format_ReturnValue_1) == 0x000208, "Member 'BP_InputKeyState_C_BindPressed::CallFunc_Format_ReturnValue_1' has a wrong offset!");

// Function BP_InputKeyState.BP_InputKeyState_C.BindPressedKey
// 0x0220 (0x0220 - 0x0000)
struct BP_InputKeyState_C_BindPressedKey final
{
public:
	TDelegate<void(class UBP_InputKeyState_C* KeyState)> Event;                                      // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Pressed_BoundObject_0;                             // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_ObjectToText_ReturnValue;            // 0x0018(0x0010)()
	class FText                                   CallFunc_Conv_NameToText_ReturnValue;              // 0x0028(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0038(0x0048)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0080(0x0048)(HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_NameToText_ReturnValue_1;            // 0x00D8(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x00E8(0x0048)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x0130(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0178(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Conv_ObjectToText_ReturnValue_1;          // 0x0188(0x0010)()
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0198(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_4;            // 0x01A8(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x01F0(0x0010)(ReferenceParm)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_201[0x7];                                      // 0x0201(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0208(0x0010)()
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_InputKeyState_C_BindPressedKey) == 0x000008, "Wrong alignment on BP_InputKeyState_C_BindPressedKey");
static_assert(sizeof(BP_InputKeyState_C_BindPressedKey) == 0x000220, "Wrong size on BP_InputKeyState_C_BindPressedKey");
static_assert(offsetof(BP_InputKeyState_C_BindPressedKey, Event) == 0x000000, "Member 'BP_InputKeyState_C_BindPressedKey::Event' has a wrong offset!");
static_assert(offsetof(BP_InputKeyState_C_BindPressedKey, Pressed_BoundObject_0) == 0x000010, "Member 'BP_InputKeyState_C_BindPressedKey::Pressed_BoundObject_0' has a wrong offset!");
static_assert(offsetof(BP_InputKeyState_C_BindPressedKey, CallFunc_Conv_ObjectToText_ReturnValue) == 0x000018, "Member 'BP_InputKeyState_C_BindPressedKey::CallFunc_Conv_ObjectToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InputKeyState_C_BindPressedKey, CallFunc_Conv_NameToText_ReturnValue) == 0x000028, "Member 'BP_InputKeyState_C_BindPressedKey::CallFunc_Conv_NameToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InputKeyState_C_BindPressedKey, K2Node_MakeStruct_FormatArgumentData) == 0x000038, "Member 'BP_InputKeyState_C_BindPressedKey::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_InputKeyState_C_BindPressedKey, K2Node_MakeStruct_FormatArgumentData_1) == 0x000080, "Member 'BP_InputKeyState_C_BindPressedKey::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BP_InputKeyState_C_BindPressedKey, CallFunc_IsValid_ReturnValue) == 0x0000C8, "Member 'BP_InputKeyState_C_BindPressedKey::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InputKeyState_C_BindPressedKey, CallFunc_Conv_IntToInt64_ReturnValue) == 0x0000D0, "Member 'BP_InputKeyState_C_BindPressedKey::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InputKeyState_C_BindPressedKey, CallFunc_Conv_NameToText_ReturnValue_1) == 0x0000D8, "Member 'BP_InputKeyState_C_BindPressedKey::CallFunc_Conv_NameToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_InputKeyState_C_BindPressedKey, K2Node_MakeStruct_FormatArgumentData_2) == 0x0000E8, "Member 'BP_InputKeyState_C_BindPressedKey::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(BP_InputKeyState_C_BindPressedKey, K2Node_MakeStruct_FormatArgumentData_3) == 0x000130, "Member 'BP_InputKeyState_C_BindPressedKey::K2Node_MakeStruct_FormatArgumentData_3' has a wrong offset!");
static_assert(offsetof(BP_InputKeyState_C_BindPressedKey, K2Node_MakeArray_Array) == 0x000178, "Member 'BP_InputKeyState_C_BindPressedKey::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_InputKeyState_C_BindPressedKey, CallFunc_Conv_ObjectToText_ReturnValue_1) == 0x000188, "Member 'BP_InputKeyState_C_BindPressedKey::CallFunc_Conv_ObjectToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_InputKeyState_C_BindPressedKey, CallFunc_Format_ReturnValue) == 0x000198, "Member 'BP_InputKeyState_C_BindPressedKey::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InputKeyState_C_BindPressedKey, K2Node_MakeStruct_FormatArgumentData_4) == 0x0001A8, "Member 'BP_InputKeyState_C_BindPressedKey::K2Node_MakeStruct_FormatArgumentData_4' has a wrong offset!");
static_assert(offsetof(BP_InputKeyState_C_BindPressedKey, K2Node_MakeArray_Array_1) == 0x0001F0, "Member 'BP_InputKeyState_C_BindPressedKey::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BP_InputKeyState_C_BindPressedKey, CallFunc_IsValid_ReturnValue_1) == 0x000200, "Member 'BP_InputKeyState_C_BindPressedKey::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_InputKeyState_C_BindPressedKey, CallFunc_Format_ReturnValue_1) == 0x000208, "Member 'BP_InputKeyState_C_BindPressedKey::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_InputKeyState_C_BindPressedKey, CallFunc_Not_PreBool_ReturnValue) == 0x000218, "Member 'BP_InputKeyState_C_BindPressedKey::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function BP_InputKeyState.BP_InputKeyState_C.BindReleased
// 0x0018 (0x0018 - 0x0000)
struct BP_InputKeyState_C_BindReleased final
{
public:
	TDelegate<void()>                             Event;                                             // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	class UObject*                                BoundObject;                                       // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_InputKeyState_C_BindReleased) == 0x000008, "Wrong alignment on BP_InputKeyState_C_BindReleased");
static_assert(sizeof(BP_InputKeyState_C_BindReleased) == 0x000018, "Wrong size on BP_InputKeyState_C_BindReleased");
static_assert(offsetof(BP_InputKeyState_C_BindReleased, Event) == 0x000000, "Member 'BP_InputKeyState_C_BindReleased::Event' has a wrong offset!");
static_assert(offsetof(BP_InputKeyState_C_BindReleased, BoundObject) == 0x000010, "Member 'BP_InputKeyState_C_BindReleased::BoundObject' has a wrong offset!");

// Function BP_InputKeyState.BP_InputKeyState_C.Init
// 0x0010 (0x0010 - 0x0000)
struct BP_InputKeyState_C_Init final
{
public:
	class FName                                   KeyName_0;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LayerIndex_0;                                      // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsPressed_0;                                       // 0x000C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_InputKeyState_C_Init) == 0x000004, "Wrong alignment on BP_InputKeyState_C_Init");
static_assert(sizeof(BP_InputKeyState_C_Init) == 0x000010, "Wrong size on BP_InputKeyState_C_Init");
static_assert(offsetof(BP_InputKeyState_C_Init, KeyName_0) == 0x000000, "Member 'BP_InputKeyState_C_Init::KeyName_0' has a wrong offset!");
static_assert(offsetof(BP_InputKeyState_C_Init, LayerIndex_0) == 0x000008, "Member 'BP_InputKeyState_C_Init::LayerIndex_0' has a wrong offset!");
static_assert(offsetof(BP_InputKeyState_C_Init, IsPressed_0) == 0x00000C, "Member 'BP_InputKeyState_C_Init::IsPressed_0' has a wrong offset!");

// Function BP_InputKeyState.BP_InputKeyState_C.UnbindPressedByEvent
// 0x0010 (0x0010 - 0x0000)
struct BP_InputKeyState_C_UnbindPressedByEvent final
{
public:
	TDelegate<void()>                             Event;                                             // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_InputKeyState_C_UnbindPressedByEvent) == 0x000004, "Wrong alignment on BP_InputKeyState_C_UnbindPressedByEvent");
static_assert(sizeof(BP_InputKeyState_C_UnbindPressedByEvent) == 0x000010, "Wrong size on BP_InputKeyState_C_UnbindPressedByEvent");
static_assert(offsetof(BP_InputKeyState_C_UnbindPressedByEvent, Event) == 0x000000, "Member 'BP_InputKeyState_C_UnbindPressedByEvent::Event' has a wrong offset!");

// Function BP_InputKeyState.BP_InputKeyState_C.UnbindPressedByObject
// 0x0148 (0x0148 - 0x0000)
struct BP_InputKeyState_C_UnbindPressedByObject final
{
public:
	class UObject*                                Object;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_ObjectToText_ReturnValue;            // 0x0008(0x0010)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0020(0x0048)(HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_NameToText_ReturnValue;              // 0x0070(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0080(0x0048)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x00C8(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0110(0x0010)(ReferenceParm)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0120(0x0010)()
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0130(0x0010)()
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_InputKeyState_C_UnbindPressedByObject) == 0x000008, "Wrong alignment on BP_InputKeyState_C_UnbindPressedByObject");
static_assert(sizeof(BP_InputKeyState_C_UnbindPressedByObject) == 0x000148, "Wrong size on BP_InputKeyState_C_UnbindPressedByObject");
static_assert(offsetof(BP_InputKeyState_C_UnbindPressedByObject, Object) == 0x000000, "Member 'BP_InputKeyState_C_UnbindPressedByObject::Object' has a wrong offset!");
static_assert(offsetof(BP_InputKeyState_C_UnbindPressedByObject, CallFunc_Conv_ObjectToText_ReturnValue) == 0x000008, "Member 'BP_InputKeyState_C_UnbindPressedByObject::CallFunc_Conv_ObjectToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InputKeyState_C_UnbindPressedByObject, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'BP_InputKeyState_C_UnbindPressedByObject::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InputKeyState_C_UnbindPressedByObject, K2Node_MakeStruct_FormatArgumentData) == 0x000020, "Member 'BP_InputKeyState_C_UnbindPressedByObject::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_InputKeyState_C_UnbindPressedByObject, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000068, "Member 'BP_InputKeyState_C_UnbindPressedByObject::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InputKeyState_C_UnbindPressedByObject, CallFunc_Conv_NameToText_ReturnValue) == 0x000070, "Member 'BP_InputKeyState_C_UnbindPressedByObject::CallFunc_Conv_NameToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InputKeyState_C_UnbindPressedByObject, K2Node_MakeStruct_FormatArgumentData_1) == 0x000080, "Member 'BP_InputKeyState_C_UnbindPressedByObject::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BP_InputKeyState_C_UnbindPressedByObject, K2Node_MakeStruct_FormatArgumentData_2) == 0x0000C8, "Member 'BP_InputKeyState_C_UnbindPressedByObject::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(BP_InputKeyState_C_UnbindPressedByObject, K2Node_MakeArray_Array) == 0x000110, "Member 'BP_InputKeyState_C_UnbindPressedByObject::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_InputKeyState_C_UnbindPressedByObject, CallFunc_MakeLiteralText_ReturnValue) == 0x000120, "Member 'BP_InputKeyState_C_UnbindPressedByObject::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InputKeyState_C_UnbindPressedByObject, CallFunc_Format_ReturnValue) == 0x000130, "Member 'BP_InputKeyState_C_UnbindPressedByObject::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InputKeyState_C_UnbindPressedByObject, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000140, "Member 'BP_InputKeyState_C_UnbindPressedByObject::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");

// Function BP_InputKeyState.BP_InputKeyState_C.UnbindReleasedByObject
// 0x0028 (0x0028 - 0x0000)
struct BP_InputKeyState_C_UnbindReleasedByObject final
{
public:
	class UObject*                                Object;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0010(0x0010)()
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_InputKeyState_C_UnbindReleasedByObject) == 0x000008, "Wrong alignment on BP_InputKeyState_C_UnbindReleasedByObject");
static_assert(sizeof(BP_InputKeyState_C_UnbindReleasedByObject) == 0x000028, "Wrong size on BP_InputKeyState_C_UnbindReleasedByObject");
static_assert(offsetof(BP_InputKeyState_C_UnbindReleasedByObject, Object) == 0x000000, "Member 'BP_InputKeyState_C_UnbindReleasedByObject::Object' has a wrong offset!");
static_assert(offsetof(BP_InputKeyState_C_UnbindReleasedByObject, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'BP_InputKeyState_C_UnbindReleasedByObject::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InputKeyState_C_UnbindReleasedByObject, CallFunc_MakeLiteralText_ReturnValue) == 0x000010, "Member 'BP_InputKeyState_C_UnbindReleasedByObject::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InputKeyState_C_UnbindReleasedByObject, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000020, "Member 'BP_InputKeyState_C_UnbindReleasedByObject::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");

// Function BP_InputKeyState.BP_InputKeyState_C.UpdateState
// 0x0218 (0x0218 - 0x0000)
struct BP_InputKeyState_C_UpdateState final
{
public:
	bool                                          IsKeyDown;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DisableEvents;                                     // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        AxisValue_0;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          WasConsumed;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          local_isConsumed;                                  // 0x0011(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_DoubleDouble_ReturnValue;        // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_BoolToText_ReturnValue;              // 0x0018(0x0010)()
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0030(0x0048)(HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_SelectString_ReturnValue;                 // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0090(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00A0(0x0048)(HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_DoubleDouble_ReturnValue_1;      // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x00EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EB[0x5];                                       // 0x00EB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_ObjectToText_ReturnValue;            // 0x00F0(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0100(0x0048)(HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x0150(0x0048)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_NameToText_ReturnValue;              // 0x0198(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_4;            // 0x01A8(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x01F0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0200(0x0010)()
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_InputKeyState_C_UpdateState) == 0x000008, "Wrong alignment on BP_InputKeyState_C_UpdateState");
static_assert(sizeof(BP_InputKeyState_C_UpdateState) == 0x000218, "Wrong size on BP_InputKeyState_C_UpdateState");
static_assert(offsetof(BP_InputKeyState_C_UpdateState, IsKeyDown) == 0x000000, "Member 'BP_InputKeyState_C_UpdateState::IsKeyDown' has a wrong offset!");
static_assert(offsetof(BP_InputKeyState_C_UpdateState, DisableEvents) == 0x000001, "Member 'BP_InputKeyState_C_UpdateState::DisableEvents' has a wrong offset!");
static_assert(offsetof(BP_InputKeyState_C_UpdateState, AxisValue_0) == 0x000008, "Member 'BP_InputKeyState_C_UpdateState::AxisValue_0' has a wrong offset!");
static_assert(offsetof(BP_InputKeyState_C_UpdateState, WasConsumed) == 0x000010, "Member 'BP_InputKeyState_C_UpdateState::WasConsumed' has a wrong offset!");
