#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ItemSorter_ByLevel

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_ItemSorter_ByLevel.BP_ItemSorter_ByLevel_C.GetDisplayName
// 0x0010 (0x0010 - 0x0000)
struct BP_ItemSorter_ByLevel_C_GetDisplayName final
{
public:
	class FText                                   DisplayName;                                       // 0x0000(0x0010)(Parm, OutParm)
};
static_assert(alignof(BP_ItemSorter_ByLevel_C_GetDisplayName) == 0x000008, "Wrong alignment on BP_ItemSorter_ByLevel_C_GetDisplayName");
static_assert(sizeof(BP_ItemSorter_ByLevel_C_GetDisplayName) == 0x000010, "Wrong size on BP_ItemSorter_ByLevel_C_GetDisplayName");
static_assert(offsetof(BP_ItemSorter_ByLevel_C_GetDisplayName, DisplayName) == 0x000000, "Member 'BP_ItemSorter_ByLevel_C_GetDisplayName::DisplayName' has a wrong offset!");

// Function BP_ItemSorter_ByLevel.BP_ItemSorter_ByLevel_C.SortItemInstances
// 0x0040 (0x0040 - 0x0000)
struct BP_ItemSorter_ByLevel_C_SortItemInstances final
{
public:
	class UBP_ItemInstance_Base_C*                A;                                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_ItemInstance_Base_C*                B;                                                 // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UOrderingResult*                        Result;                                            // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_ItemInstance_Gear_C*                K2Node_DynamicCast_AsBP_Item_Instance_Gear;        // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_ItemInstance_Gear_C*                K2Node_DynamicCast_AsBP_Item_Instance_Gear_1;      // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetCurrentLevel_ReturnValue;              // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCurrentLevel_ReturnValue_1;            // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ItemSorter_ByLevel_C_SortItemInstances) == 0x000008, "Wrong alignment on BP_ItemSorter_ByLevel_C_SortItemInstances");
static_assert(sizeof(BP_ItemSorter_ByLevel_C_SortItemInstances) == 0x000040, "Wrong size on BP_ItemSorter_ByLevel_C_SortItemInstances");
static_assert(offsetof(BP_ItemSorter_ByLevel_C_SortItemInstances, A) == 0x000000, "Member 'BP_ItemSorter_ByLevel_C_SortItemInstances::A' has a wrong offset!");
static_assert(offsetof(BP_ItemSorter_ByLevel_C_SortItemInstances, B) == 0x000008, "Member 'BP_ItemSorter_ByLevel_C_SortItemInstances::B' has a wrong offset!");
static_assert(offsetof(BP_ItemSorter_ByLevel_C_SortItemInstances, Result) == 0x000010, "Member 'BP_ItemSorter_ByLevel_C_SortItemInstances::Result' has a wrong offset!");
static_assert(offsetof(BP_ItemSorter_ByLevel_C_SortItemInstances, K2Node_DynamicCast_AsBP_Item_Instance_Gear) == 0x000018, "Member 'BP_ItemSorter_ByLevel_C_SortItemInstances::K2Node_DynamicCast_AsBP_Item_Instance_Gear' has a wrong offset!");
static_assert(offsetof(BP_ItemSorter_ByLevel_C_SortItemInstances, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_ItemSorter_ByLevel_C_SortItemInstances::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ItemSorter_ByLevel_C_SortItemInstances, K2Node_DynamicCast_AsBP_Item_Instance_Gear_1) == 0x000028, "Member 'BP_ItemSorter_ByLevel_C_SortItemInstances::K2Node_DynamicCast_AsBP_Item_Instance_Gear_1' has a wrong offset!");
static_assert(offsetof(BP_ItemSorter_ByLevel_C_SortItemInstances, K2Node_DynamicCast_bSuccess_1) == 0x000030, "Member 'BP_ItemSorter_ByLevel_C_SortItemInstances::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_ItemSorter_ByLevel_C_SortItemInstances, CallFunc_GetCurrentLevel_ReturnValue) == 0x000034, "Member 'BP_ItemSorter_ByLevel_C_SortItemInstances::CallFunc_GetCurrentLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemSorter_ByLevel_C_SortItemInstances, CallFunc_GetCurrentLevel_ReturnValue_1) == 0x000038, "Member 'BP_ItemSorter_ByLevel_C_SortItemInstances::CallFunc_GetCurrentLevel_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ItemSorter_ByLevel_C_SortItemInstances, CallFunc_Subtract_IntInt_ReturnValue) == 0x00003C, "Member 'BP_ItemSorter_ByLevel_C_SortItemInstances::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");

}

