#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_InputLockComponent

#include "Basic.hpp"

#include "SandFall_structs.hpp"
#include "Engine_structs.hpp"
#include "S_InputLockParameters_structs.hpp"


namespace SDK::Params
{

// Function BP_InputLockComponent.BP_InputLockComponent_C.AddInputLock
// 0x02C8 (0x02C8 - 0x0000)
struct BP_InputLockComponent_C_AddInputLock final
{
public:
	struct FS_InputLockParameters                 Parameters;                                        // 0x0000(0x0002)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSF_ReferenceCounterHandle             InputLockBlocker;                                  // 0x0008(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FString                                 DebugName;                                         // 0x0028(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0038(0x0010)()
	bool                                          CallFunc_GetReferenceCounterState_ReturnValue;     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0050(0x0048)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_BoolToText_ReturnValue;              // 0x0098(0x0010)()
	bool                                          CallFunc_AddReference_ReturnValue;                 // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00B0(0x0048)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x00F8(0x0010)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_2;          // 0x0108(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0118(0x0048)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x0160(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x01A8(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Format_ReturnValue;                       // 0x01B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetReferenceCounterState_ReturnValue_1;   // 0x01C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetReferenceCounterState_ReturnValue_2;   // 0x01CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1CB[0x5];                                      // 0x01CB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_BoolToText_ReturnValue_1;            // 0x01D0(0x0010)()
	class FText                                   CallFunc_Conv_BoolToText_ReturnValue_2;            // 0x01E0(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_4;            // 0x01F0(0x0048)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_5;            // 0x0238(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0280(0x0010)(ReferenceParm)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_2;                          // 0x0290(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Format_ReturnValue_1;                     // 0x02A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Format_ReturnValue_2;                     // 0x02B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_AddReference_ReturnValue_1;               // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AddReference_ReturnValue_2;               // 0x02C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_InputLockComponent_C_AddInputLock) == 0x000008, "Wrong alignment on BP_InputLockComponent_C_AddInputLock");
static_assert(sizeof(BP_InputLockComponent_C_AddInputLock) == 0x0002C8, "Wrong size on BP_InputLockComponent_C_AddInputLock");
static_assert(offsetof(BP_InputLockComponent_C_AddInputLock, Parameters) == 0x000000, "Member 'BP_InputLockComponent_C_AddInputLock::Parameters' has a wrong offset!");
static_assert(offsetof(BP_InputLockComponent_C_AddInputLock, InputLockBlocker) == 0x000008, "Member 'BP_InputLockComponent_C_AddInputLock::InputLockBlocker' has a wrong offset!");
static_assert(offsetof(BP_InputLockComponent_C_AddInputLock, DebugName) == 0x000028, "Member 'BP_InputLockComponent_C_AddInputLock::DebugName' has a wrong offset!");
static_assert(offsetof(BP_InputLockComponent_C_AddInputLock, CallFunc_Conv_StringToText_ReturnValue) == 0x000038, "Member 'BP_InputLockComponent_C_AddInputLock::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InputLockComponent_C_AddInputLock, CallFunc_GetReferenceCounterState_ReturnValue) == 0x000048, "Member 'BP_InputLockComponent_C_AddInputLock::CallFunc_GetReferenceCounterState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InputLockComponent_C_AddInputLock, K2Node_MakeStruct_FormatArgumentData) == 0x000050, "Member 'BP_InputLockComponent_C_AddInputLock::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_InputLockComponent_C_AddInputLock, CallFunc_Conv_BoolToText_ReturnValue) == 0x000098, "Member 'BP_InputLockComponent_C_AddInputLock::CallFunc_Conv_BoolToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InputLockComponent_C_AddInputLock, CallFunc_AddReference_ReturnValue) == 0x0000A8, "Member 'BP_InputLockComponent_C_AddInputLock::CallFunc_AddReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InputLockComponent_C_AddInputLock, K2Node_MakeStruct_FormatArgumentData_1) == 0x0000B0, "Member 'BP_InputLockComponent_C_AddInputLock::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BP_InputLockComponent_C_AddInputLock, CallFunc_Conv_StringToText_ReturnValue_1) == 0x0000F8, "Member 'BP_InputLockComponent_C_AddInputLock::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_InputLockComponent_C_AddInputLock, CallFunc_Conv_StringToText_ReturnValue_2) == 0x000108, "Member 'BP_InputLockComponent_C_AddInputLock::CallFunc_Conv_StringToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_InputLockComponent_C_AddInputLock, K2Node_MakeStruct_FormatArgumentData_2) == 0x000118, "Member 'BP_InputLockComponent_C_AddInputLock::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(BP_InputLockComponent_C_AddInputLock, K2Node_MakeStruct_FormatArgumentData_3) == 0x000160, "Member 'BP_InputLockComponent_C_AddInputLock::K2Node_MakeStruct_FormatArgumentData_3' has a wrong offset!");
static_assert(offsetof(BP_InputLockComponent_C_AddInputLock, K2Node_MakeArray_Array) == 0x0001A8, "Member 'BP_InputLockComponent_C_AddInputLock::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_InputLockComponent_C_AddInputLock, CallFunc_Format_ReturnValue) == 0x0001B8, "Member 'BP_InputLockComponent_C_AddInputLock::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InputLockComponent_C_AddInputLock, CallFunc_BooleanAND_ReturnValue) == 0x0001C8, "Member 'BP_InputLockComponent_C_AddInputLock::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InputLockComponent_C_AddInputLock, CallFunc_GetReferenceCounterState_ReturnValue_1) == 0x0001C9, "Member 'BP_InputLockComponent_C_AddInputLock::CallFunc_GetReferenceCounterState_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_InputLockComponent_C_AddInputLock, CallFunc_GetReferenceCounterState_ReturnValue_2) == 0x0001CA, "Member 'BP_InputLockComponent_C_AddInputLock::CallFunc_GetReferenceCounterState_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_InputLockComponent_C_AddInputLock, CallFunc_Conv_BoolToText_ReturnValue_1) == 0x0001D0, "Member 'BP_InputLockComponent_C_AddInputLock::CallFunc_Conv_BoolToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_InputLockComponent_C_AddInputLock, CallFunc_Conv_BoolToText_ReturnValue_2) == 0x0001E0, "Member 'BP_InputLockComponent_C_AddInputLock::CallFunc_Conv_BoolToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_InputLockComponent_C_AddInputLock, K2Node_MakeStruct_FormatArgumentData_4) == 0x0001F0, "Member 'BP_InputLockComponent_C_AddInputLock::K2Node_MakeStruct_FormatArgumentData_4' has a wrong offset!");
static_assert(offsetof(BP_InputLockComponent_C_AddInputLock, K2Node_MakeStruct_FormatArgumentData_5) == 0x000238, "Member 'BP_InputLockComponent_C_AddInputLock::K2Node_MakeStruct_FormatArgumentData_5' has a wrong offset!");
static_assert(offsetof(BP_InputLockComponent_C_AddInputLock, K2Node_MakeArray_Array_1) == 0x000280, "Member 'BP_InputLockComponent_C_AddInputLock::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BP_InputLockComponent_C_AddInputLock, K2Node_MakeArray_Array_2) == 0x000290, "Member 'BP_InputLockComponent_C_AddInputLock::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(BP_InputLockComponent_C_AddInputLock, CallFunc_Format_ReturnValue_1) == 0x0002A0, "Member 'BP_InputLockComponent_C_AddInputLock::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_InputLockComponent_C_AddInputLock, CallFunc_Format_ReturnValue_2) == 0x0002B0, "Member 'BP_InputLockComponent_C_AddInputLock::CallFunc_Format_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_InputLockComponent_C_AddInputLock, CallFunc_AddReference_ReturnValue_1) == 0x0002C0, "Member 'BP_InputLockComponent_C_AddInputLock::CallFunc_AddReference_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_InputLockComponent_C_AddInputLock, CallFunc_AddReference_ReturnValue_2) == 0x0002C1, "Member 'BP_InputLockComponent_C_AddInputLock::CallFunc_AddReference_ReturnValue_2' has a wrong offset!");

// Function BP_InputLockComponent.BP_InputLockComponent_C.ClearInputLocks
// 0x0020 (0x0020 - 0x0000)
struct BP_InputLockComponent_C_ClearInputLocks final
{
public:
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0000(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Format_ReturnValue;                       // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_InputLockComponent_C_ClearInputLocks) == 0x000008, "Wrong alignment on BP_InputLockComponent_C_ClearInputLocks");
static_assert(sizeof(BP_InputLockComponent_C_ClearInputLocks) == 0x000020, "Wrong size on BP_InputLockComponent_C_ClearInputLocks");
static_assert(offsetof(BP_InputLockComponent_C_ClearInputLocks, K2Node_MakeArray_Array) == 0x000000, "Member 'BP_InputLockComponent_C_ClearInputLocks::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_InputLockComponent_C_ClearInputLocks, CallFunc_Format_ReturnValue) == 0x000010, "Member 'BP_InputLockComponent_C_ClearInputLocks::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function BP_InputLockComponent.BP_InputLockComponent_C.ExecuteUbergraph_BP_InputLockComponent
// 0x0038 (0x0038 - 0x0000)
struct BP_InputLockComponent_C_ExecuteUbergraph_BP_InputLockComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool _isActive)>               K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool _isActive)>               K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool _isActive)>               K2Node_CreateDelegate_OutputDelegate_2;            // 0x0024(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_InputLockComponent_C_ExecuteUbergraph_BP_InputLockComponent) == 0x000004, "Wrong alignment on BP_InputLockComponent_C_ExecuteUbergraph_BP_InputLockComponent");
static_assert(sizeof(BP_InputLockComponent_C_ExecuteUbergraph_BP_InputLockComponent) == 0x000038, "Wrong size on BP_InputLockComponent_C_ExecuteUbergraph_BP_InputLockComponent");
static_assert(offsetof(BP_InputLockComponent_C_ExecuteUbergraph_BP_InputLockComponent, EntryPoint) == 0x000000, "Member 'BP_InputLockComponent_C_ExecuteUbergraph_BP_InputLockComponent::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_InputLockComponent_C_ExecuteUbergraph_BP_InputLockComponent, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BP_InputLockComponent_C_ExecuteUbergraph_BP_InputLockComponent::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_InputLockComponent_C_ExecuteUbergraph_BP_InputLockComponent, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'BP_InputLockComponent_C_ExecuteUbergraph_BP_InputLockComponent::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_InputLockComponent_C_ExecuteUbergraph_BP_InputLockComponent, K2Node_CreateDelegate_OutputDelegate_2) == 0x000024, "Member 'BP_InputLockComponent_C_ExecuteUbergraph_BP_InputLockComponent::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_InputLockComponent_C_ExecuteUbergraph_BP_InputLockComponent, K2Node_Event_EndPlayReason) == 0x000034, "Member 'BP_InputLockComponent_C_ExecuteUbergraph_BP_InputLockComponent::K2Node_Event_EndPlayReason' has a wrong offset!");

// Function BP_InputLockComponent.BP_InputLockComponent_C.IsCameraInputLocked
// 0x0004 (0x0004 - 0x0000)
struct BP_InputLockComponent_C_IsCameraInputLocked final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetReferenceCounterState_ReturnValue;     // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetReferenceCounterState_ReturnValue_1;   // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_InputLockComponent_C_IsCameraInputLocked) == 0x000001, "Wrong alignment on BP_InputLockComponent_C_IsCameraInputLocked");
static_assert(sizeof(BP_InputLockComponent_C_IsCameraInputLocked) == 0x000004, "Wrong size on BP_InputLockComponent_C_IsCameraInputLocked");
static_assert(offsetof(BP_InputLockComponent_C_IsCameraInputLocked, ReturnValue) == 0x000000, "Member 'BP_InputLockComponent_C_IsCameraInputLocked::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InputLockComponent_C_IsCameraInputLocked, CallFunc_GetReferenceCounterState_ReturnValue) == 0x000001, "Member 'BP_InputLockComponent_C_IsCameraInputLocked::CallFunc_GetReferenceCounterState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InputLockComponent_C_IsCameraInputLocked, CallFunc_GetReferenceCounterState_ReturnValue_1) == 0x000002, "Member 'BP_InputLockComponent_C_IsCameraInputLocked::CallFunc_GetReferenceCounterState_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_InputLockComponent_C_IsCameraInputLocked, CallFunc_BooleanOR_ReturnValue) == 0x000003, "Member 'BP_InputLockComponent_C_IsCameraInputLocked::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function BP_InputLockComponent.BP_InputLockComponent_C.IsMovementInputLocked
// 0x0004 (0x0004 - 0x0000)
struct BP_InputLockComponent_C_IsMovementInputLocked final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetReferenceCounterState_ReturnValue;     // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetReferenceCounterState_ReturnValue_1;   // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_InputLockComponent_C_IsMovementInputLocked) == 0x000001, "Wrong alignment on BP_InputLockComponent_C_IsMovementInputLocked");
static_assert(sizeof(BP_InputLockComponent_C_IsMovementInputLocked) == 0x000004, "Wrong size on BP_InputLockComponent_C_IsMovementInputLocked");
static_assert(offsetof(BP_InputLockComponent_C_IsMovementInputLocked, ReturnValue) == 0x000000, "Member 'BP_InputLockComponent_C_IsMovementInputLocked::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InputLockComponent_C_IsMovementInputLocked, CallFunc_GetReferenceCounterState_ReturnValue) == 0x000001, "Member 'BP_InputLockComponent_C_IsMovementInputLocked::CallFunc_GetReferenceCounterState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InputLockComponent_C_IsMovementInputLocked, CallFunc_GetReferenceCounterState_ReturnValue_1) == 0x000002, "Member 'BP_InputLockComponent_C_IsMovementInputLocked::CallFunc_GetReferenceCounterState_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_InputLockComponent_C_IsMovementInputLocked, CallFunc_BooleanOR_ReturnValue) == 0x000003, "Member 'BP_InputLockComponent_C_IsMovementInputLocked::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function BP_InputLockComponent.BP_InputLockComponent_C.OnAnyInputLockChanged
// 0x0001 (0x0001 - 0x0000)
struct BP_InputLockComponent_C_OnAnyInputLockChanged final
{
public:
	bool                                          _isActive;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_InputLockComponent_C_OnAnyInputLockChanged) == 0x000001, "Wrong alignment on BP_InputLockComponent_C_OnAnyInputLockChanged");
static_assert(sizeof(BP_InputLockComponent_C_OnAnyInputLockChanged) == 0x000001, "Wrong size on BP_InputLockComponent_C_OnAnyInputLockChanged");
static_assert(offsetof(BP_InputLockComponent_C_OnAnyInputLockChanged, _isActive) == 0x000000, "Member 'BP_InputLockComponent_C_OnAnyInputLockChanged::_isActive' has a wrong offset!");

// Function BP_InputLockComponent.BP_InputLockComponent_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_InputLockComponent_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_InputLockComponent_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_InputLockComponent_C_ReceiveEndPlay");
static_assert(sizeof(BP_InputLockComponent_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_InputLockComponent_C_ReceiveEndPlay");
static_assert(offsetof(BP_InputLockComponent_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_InputLockComponent_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function BP_InputLockComponent.BP_InputLockComponent_C.RemoveInputLock
// 0x01B0 (0x01B0 - 0x0000)
struct BP_InputLockComponent_C_RemoveInputLock final
{
public:
	struct FS_InputLockParameters                 Parameters;                                        // 0x0000(0x0002)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSF_ReferenceCounterHandle             InputLockBlocker;                                  // 0x0008(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          CallFunc_GetReferenceCounterState_ReturnValue;     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_BoolToText_ReturnValue;              // 0x0030(0x0010)()
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0048(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0090(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Format_ReturnValue;                       // 0x00A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveReference_ReturnValue;              // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetReferenceCounterState_ReturnValue_1;   // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetReferenceCounterState_ReturnValue_2;   // 0x00B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B3[0x5];                                       // 0x00B3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_BoolToText_ReturnValue_1;            // 0x00B8(0x0010)()
	class FText                                   CallFunc_Conv_BoolToText_ReturnValue_2;            // 0x00C8(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00D8(0x0048)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0120(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0168(0x0010)(ReferenceParm)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_2;                          // 0x0178(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Format_ReturnValue_1;                     // 0x0188(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Format_ReturnValue_2;                     // 0x0198(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveReference_ReturnValue_1;            // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveReference_ReturnValue_2;            // 0x01A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_InputLockComponent_C_RemoveInputLock) == 0x000008, "Wrong alignment on BP_InputLockComponent_C_RemoveInputLock");
static_assert(sizeof(BP_InputLockComponent_C_RemoveInputLock) == 0x0001B0, "Wrong size on BP_InputLockComponent_C_RemoveInputLock");
static_assert(offsetof(BP_InputLockComponent_C_RemoveInputLock, Parameters) == 0x000000, "Member 'BP_InputLockComponent_C_RemoveInputLock::Parameters' has a wrong offset!");
static_assert(offsetof(BP_InputLockComponent_C_RemoveInputLock, InputLockBlocker) == 0x000008, "Member 'BP_InputLockComponent_C_RemoveInputLock::InputLockBlocker' has a wrong offset!");
static_assert(offsetof(BP_InputLockComponent_C_RemoveInputLock, CallFunc_GetReferenceCounterState_ReturnValue) == 0x000028, "Member 'BP_InputLockComponent_C_RemoveInputLock::CallFunc_GetReferenceCounterState_ReturnValue' has a wrong offset!");
