#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ItemInstance_Inventory

#include "Basic.hpp"

#include "S_jRPG_Item_StaticData_structs.hpp"
#include "S_LootContext_structs.hpp"


namespace SDK::Params
{

// Function BP_ItemInstance_Inventory.BP_ItemInstance_Inventory_C.GenerateItem
// 0x0150 (0x0150 - 0x0000)
struct BP_ItemInstance_Inventory_C_GenerateItem final
{
public:
	struct FS_jRPG_Item_StaticData                ItemStaticItem;                                    // 0x0000(0x0130)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	struct FS_LootContext                         LootContext;                                       // 0x0130(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_134[0x4];                                      // 0x0134(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_GeneratedItemInfo_Base_C*           GeneratedItemInfo;                                 // 0x0138(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_GeneratedItemInfo_Item_C*           CallFunc_SpawnObject_ReturnValue;                  // 0x0140(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetQuantity_ReturnValue;                  // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ItemInstance_Inventory_C_GenerateItem) == 0x000008, "Wrong alignment on BP_ItemInstance_Inventory_C_GenerateItem");
static_assert(sizeof(BP_ItemInstance_Inventory_C_GenerateItem) == 0x000150, "Wrong size on BP_ItemInstance_Inventory_C_GenerateItem");
static_assert(offsetof(BP_ItemInstance_Inventory_C_GenerateItem, ItemStaticItem) == 0x000000, "Member 'BP_ItemInstance_Inventory_C_GenerateItem::ItemStaticItem' has a wrong offset!");
static_assert(offsetof(BP_ItemInstance_Inventory_C_GenerateItem, LootContext) == 0x000130, "Member 'BP_ItemInstance_Inventory_C_GenerateItem::LootContext' has a wrong offset!");
static_assert(offsetof(BP_ItemInstance_Inventory_C_GenerateItem, GeneratedItemInfo) == 0x000138, "Member 'BP_ItemInstance_Inventory_C_GenerateItem::GeneratedItemInfo' has a wrong offset!");
static_assert(offsetof(BP_ItemInstance_Inventory_C_GenerateItem, CallFunc_SpawnObject_ReturnValue) == 0x000140, "Member 'BP_ItemInstance_Inventory_C_GenerateItem::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemInstance_Inventory_C_GenerateItem, CallFunc_GetQuantity_ReturnValue) == 0x000148, "Member 'BP_ItemInstance_Inventory_C_GenerateItem::CallFunc_GetQuantity_ReturnValue' has a wrong offset!");

}

