#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_InteractiveMusicSystem

#include "Basic.hpp"

#include "E_InteractiveMusicContext_structs.hpp"
#include "S_InteractiveMusicParameters_structs.hpp"
#include "S_InteractiveMusic_structs.hpp"
#include "S_InteractiveMusicContextSwitch_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_InteractiveMusicSystem.BP_InteractiveMusicSystem_C.AdjustVolumeByContext
// 0x000C (0x000C - 0x0000)
struct BP_InteractiveMusicSystem_C_AdjustVolumeByContext final
{
public:
	float                                         AdjustVolumeDuration;                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AdjustVolumeLevel;                                 // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_InteractiveMusicContext                     Context;                                           // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_InteractiveMusicSystem_C_AdjustVolumeByContext) == 0x000004, "Wrong alignment on BP_InteractiveMusicSystem_C_AdjustVolumeByContext");
static_assert(sizeof(BP_InteractiveMusicSystem_C_AdjustVolumeByContext) == 0x00000C, "Wrong size on BP_InteractiveMusicSystem_C_AdjustVolumeByContext");
static_assert(offsetof(BP_InteractiveMusicSystem_C_AdjustVolumeByContext, AdjustVolumeDuration) == 0x000000, "Member 'BP_InteractiveMusicSystem_C_AdjustVolumeByContext::AdjustVolumeDuration' has a wrong offset!");
static_assert(offsetof(BP_InteractiveMusicSystem_C_AdjustVolumeByContext, AdjustVolumeLevel) == 0x000004, "Member 'BP_InteractiveMusicSystem_C_AdjustVolumeByContext::AdjustVolumeLevel' has a wrong offset!");
static_assert(offsetof(BP_InteractiveMusicSystem_C_AdjustVolumeByContext, Context) == 0x000008, "Member 'BP_InteractiveMusicSystem_C_AdjustVolumeByContext::Context' has a wrong offset!");
static_assert(offsetof(BP_InteractiveMusicSystem_C_AdjustVolumeByContext, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000009, "Member 'BP_InteractiveMusicSystem_C_AdjustVolumeByContext::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function BP_InteractiveMusicSystem.BP_InteractiveMusicSystem_C.AdjustVolumeCurrentContext
// 0x0028 (0x0028 - 0x0000)
struct BP_InteractiveMusicSystem_C_AdjustVolumeCurrentContext final
{
public:
	float                                         AdjustVolumeDuration;                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AdjustVolumeLevel;                                 // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_InteractiveMusic                    CallFunc_GetCurrentInteractiveMusic_InteractiveMusic; // 0x0008(0x0018)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_InteractiveMusicSystem_C_AdjustVolumeCurrentContext) == 0x000008, "Wrong alignment on BP_InteractiveMusicSystem_C_AdjustVolumeCurrentContext");
static_assert(sizeof(BP_InteractiveMusicSystem_C_AdjustVolumeCurrentContext) == 0x000028, "Wrong size on BP_InteractiveMusicSystem_C_AdjustVolumeCurrentContext");
static_assert(offsetof(BP_InteractiveMusicSystem_C_AdjustVolumeCurrentContext, AdjustVolumeDuration) == 0x000000, "Member 'BP_InteractiveMusicSystem_C_AdjustVolumeCurrentContext::AdjustVolumeDuration' has a wrong offset!");
static_assert(offsetof(BP_InteractiveMusicSystem_C_AdjustVolumeCurrentContext, AdjustVolumeLevel) == 0x000004, "Member 'BP_InteractiveMusicSystem_C_AdjustVolumeCurrentContext::AdjustVolumeLevel' has a wrong offset!");
static_assert(offsetof(BP_InteractiveMusicSystem_C_AdjustVolumeCurrentContext, CallFunc_GetCurrentInteractiveMusic_InteractiveMusic) == 0x000008, "Member 'BP_InteractiveMusicSystem_C_AdjustVolumeCurrentContext::CallFunc_GetCurrentInteractiveMusic_InteractiveMusic' has a wrong offset!");
static_assert(offsetof(BP_InteractiveMusicSystem_C_AdjustVolumeCurrentContext, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000020, "Member 'BP_InteractiveMusicSystem_C_AdjustVolumeCurrentContext::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function BP_InteractiveMusicSystem.BP_InteractiveMusicSystem_C.AdjustVolumeInteractiveMusicByContext
// 0x00C0 (0x00C0 - 0x0000)
struct BP_InteractiveMusicSystem_C_AdjustVolumeInteractiveMusicByContext final
{
public:
	E_InteractiveMusicContext                     Context;                                           // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         AdjustVolumeDuration;                              // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AdjustVolumeLevel;                                 // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0028(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0038(0x0048)(HasGetValueTypeHash)
	struct FS_InteractiveMusic                    CallFunc_GetInteractiveMusicByContext_InteractiveMusic; // 0x0080(0x0018)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0098(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Format_ReturnValue;                       // 0x00A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlaying_ReturnValue;                    // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_InteractiveMusicSystem_C_AdjustVolumeInteractiveMusicByContext) == 0x000008, "Wrong alignment on BP_InteractiveMusicSystem_C_AdjustVolumeInteractiveMusicByContext");
static_assert(sizeof(BP_InteractiveMusicSystem_C_AdjustVolumeInteractiveMusicByContext) == 0x0000C0, "Wrong size on BP_InteractiveMusicSystem_C_AdjustVolumeInteractiveMusicByContext");
static_assert(offsetof(BP_InteractiveMusicSystem_C_AdjustVolumeInteractiveMusicByContext, Context) == 0x000000, "Member 'BP_InteractiveMusicSystem_C_AdjustVolumeInteractiveMusicByContext::Context' has a wrong offset!");
static_assert(offsetof(BP_InteractiveMusicSystem_C_AdjustVolumeInteractiveMusicByContext, AdjustVolumeDuration) == 0x000004, "Member 'BP_InteractiveMusicSystem_C_AdjustVolumeInteractiveMusicByContext::AdjustVolumeDuration' has a wrong offset!");
static_assert(offsetof(BP_InteractiveMusicSystem_C_AdjustVolumeInteractiveMusicByContext, AdjustVolumeLevel) == 0x000008, "Member 'BP_InteractiveMusicSystem_C_AdjustVolumeInteractiveMusicByContext::AdjustVolumeLevel' has a wrong offset!");
static_assert(offsetof(BP_InteractiveMusicSystem_C_AdjustVolumeInteractiveMusicByContext, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x000010, "Member 'BP_InteractiveMusicSystem_C_AdjustVolumeInteractiveMusicByContext::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractiveMusicSystem_C_AdjustVolumeInteractiveMusicByContext, CallFunc_Not_PreBool_ReturnValue) == 0x000020, "Member 'BP_InteractiveMusicSystem_C_AdjustVolumeInteractiveMusicByContext::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractiveMusicSystem_C_AdjustVolumeInteractiveMusicByContext, CallFunc_Conv_StringToText_ReturnValue) == 0x000028, "Member 'BP_InteractiveMusicSystem_C_AdjustVolumeInteractiveMusicByContext::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractiveMusicSystem_C_AdjustVolumeInteractiveMusicByContext, K2Node_MakeStruct_FormatArgumentData) == 0x000038, "Member 'BP_InteractiveMusicSystem_C_AdjustVolumeInteractiveMusicByContext::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_InteractiveMusicSystem_C_AdjustVolumeInteractiveMusicByContext, CallFunc_GetInteractiveMusicByContext_InteractiveMusic) == 0x000080, "Member 'BP_InteractiveMusicSystem_C_AdjustVolumeInteractiveMusicByContext::CallFunc_GetInteractiveMusicByContext_InteractiveMusic' has a wrong offset!");
static_assert(offsetof(BP_InteractiveMusicSystem_C_AdjustVolumeInteractiveMusicByContext, K2Node_MakeArray_Array) == 0x000098, "Member 'BP_InteractiveMusicSystem_C_AdjustVolumeInteractiveMusicByContext::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_InteractiveMusicSystem_C_AdjustVolumeInteractiveMusicByContext, CallFunc_Format_ReturnValue) == 0x0000A8, "Member 'BP_InteractiveMusicSystem_C_AdjustVolumeInteractiveMusicByContext::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractiveMusicSystem_C_AdjustVolumeInteractiveMusicByContext, CallFunc_IsPlaying_ReturnValue) == 0x0000B8, "Member 'BP_InteractiveMusicSystem_C_AdjustVolumeInteractiveMusicByContext::CallFunc_IsPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractiveMusicSystem_C_AdjustVolumeInteractiveMusicByContext, CallFunc_Not_PreBool_ReturnValue_1) == 0x0000B9, "Member 'BP_InteractiveMusicSystem_C_AdjustVolumeInteractiveMusicByContext::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_InteractiveMusicSystem_C_AdjustVolumeInteractiveMusicByContext, CallFunc_IsValid_ReturnValue) == 0x0000BA, "Member 'BP_InteractiveMusicSystem_C_AdjustVolumeInteractiveMusicByContext::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_InteractiveMusicSystem.BP_InteractiveMusicSystem_C.ApplyInteractiveMusicParameters
// 0x0030 (0x0030 - 0x0000)
struct BP_InteractiveMusicSystem_C_ApplyInteractiveMusicParameters final
{
public:
	struct FS_InteractiveMusicParameters          Parameters;                                        // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FS_InteractiveMusic                    CallFunc_CreateInteractiveMusicWithContextIfNeeded_InteractiveMusic; // 0x0018(0x0018)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};
static_assert(alignof(BP_InteractiveMusicSystem_C_ApplyInteractiveMusicParameters) == 0x000008, "Wrong alignment on BP_InteractiveMusicSystem_C_ApplyInteractiveMusicParameters");
static_assert(sizeof(BP_InteractiveMusicSystem_C_ApplyInteractiveMusicParameters) == 0x000030, "Wrong size on BP_InteractiveMusicSystem_C_ApplyInteractiveMusicParameters");
static_assert(offsetof(BP_InteractiveMusicSystem_C_ApplyInteractiveMusicParameters, Parameters) == 0x000000, "Member 'BP_InteractiveMusicSystem_C_ApplyInteractiveMusicParameters::Parameters' has a wrong offset!");
static_assert(offsetof(BP_InteractiveMusicSystem_C_ApplyInteractiveMusicParameters, CallFunc_CreateInteractiveMusicWithContextIfNeeded_InteractiveMusic) == 0x000018, "Member 'BP_InteractiveMusicSystem_C_ApplyInteractiveMusicParameters::CallFunc_CreateInteractiveMusicWithContextIfNeeded_InteractiveMusic' has a wrong offset!");

// Function BP_InteractiveMusicSystem.BP_InteractiveMusicSystem_C.ComputeCurrentInteractiveMusicParameters
// 0x0050 (0x0050 - 0x0000)
struct BP_InteractiveMusicSystem_C_ComputeCurrentInteractiveMusicParameters final
{
public:
	struct FS_InteractiveMusicParameters          InteractiveMusicParameters;                        // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FS_InteractiveMusic                    CallFunc_GetCurrentInteractiveMusic_InteractiveMusic; // 0x0018(0x0018)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	E_InteractiveMusicContext                     CallFunc_GetCurrentContext_Context;                // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33[0x5];                                       // 0x0033(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_InteractiveMusicParameters          K2Node_MakeStruct_S_InteractiveMusicParameters;    // 0x0038(0x0018)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_InteractiveMusicSystem_C_ComputeCurrentInteractiveMusicParameters) == 0x000008, "Wrong alignment on BP_InteractiveMusicSystem_C_ComputeCurrentInteractiveMusicParameters");
static_assert(sizeof(BP_InteractiveMusicSystem_C_ComputeCurrentInteractiveMusicParameters) == 0x000050, "Wrong size on BP_InteractiveMusicSystem_C_ComputeCurrentInteractiveMusicParameters");
static_assert(offsetof(BP_InteractiveMusicSystem_C_ComputeCurrentInteractiveMusicParameters, InteractiveMusicParameters) == 0x000000, "Member 'BP_InteractiveMusicSystem_C_ComputeCurrentInteractiveMusicParameters::InteractiveMusicParameters' has a wrong offset!");
static_assert(offsetof(BP_InteractiveMusicSystem_C_ComputeCurrentInteractiveMusicParameters, CallFunc_GetCurrentInteractiveMusic_InteractiveMusic) == 0x000018, "Member 'BP_InteractiveMusicSystem_C_ComputeCurrentInteractiveMusicParameters::CallFunc_GetCurrentInteractiveMusic_InteractiveMusic' has a wrong offset!");
static_assert(offsetof(BP_InteractiveMusicSystem_C_ComputeCurrentInteractiveMusicParameters, CallFunc_GetCurrentContext_Context) == 0x000030, "Member 'BP_InteractiveMusicSystem_C_ComputeCurrentInteractiveMusicParameters::CallFunc_GetCurrentContext_Context' has a wrong offset!");
static_assert(offsetof(BP_InteractiveMusicSystem_C_ComputeCurrentInteractiveMusicParameters, CallFunc_IsValid_ReturnValue) == 0x000031, "Member 'BP_InteractiveMusicSystem_C_ComputeCurrentInteractiveMusicParameters::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractiveMusicSystem_C_ComputeCurrentInteractiveMusicParameters, CallFunc_IsValid_ReturnValue_1) == 0x000032, "Member 'BP_InteractiveMusicSystem_C_ComputeCurrentInteractiveMusicParameters::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_InteractiveMusicSystem_C_ComputeCurrentInteractiveMusicParameters, K2Node_MakeStruct_S_InteractiveMusicParameters) == 0x000038, "Member 'BP_InteractiveMusicSystem_C_ComputeCurrentInteractiveMusicParameters::K2Node_MakeStruct_S_InteractiveMusicParameters' has a wrong offset!");

// Function BP_InteractiveMusicSystem.BP_InteractiveMusicSystem_C.Create New Audio Component
// 0x0028 (0x0028 - 0x0000)
struct BP_InteractiveMusicSystem_C_Create_New_Audio_Component final
{
public:
	class USoundBase*                             Sound;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        SpawnedComponent;                                  // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAudioComponentPlayState PlayState)> K2Node_CreateDelegate_OutputDelegate;        // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSound2D_ReturnValue;                 // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_InteractiveMusicSystem_C_Create_New_Audio_Component) == 0x000008, "Wrong alignment on BP_InteractiveMusicSystem_C_Create_New_Audio_Component");
static_assert(sizeof(BP_InteractiveMusicSystem_C_Create_New_Audio_Component) == 0x000028, "Wrong size on BP_InteractiveMusicSystem_C_Create_New_Audio_Component");
static_assert(offsetof(BP_InteractiveMusicSystem_C_Create_New_Audio_Component, Sound) == 0x000000, "Member 'BP_InteractiveMusicSystem_C_Create_New_Audio_Component::Sound' has a wrong offset!");
static_assert(offsetof(BP_InteractiveMusicSystem_C_Create_New_Audio_Component, SpawnedComponent) == 0x000008, "Member 'BP_InteractiveMusicSystem_C_Create_New_Audio_Component::SpawnedComponent' has a wrong offset!");
static_assert(offsetof(BP_InteractiveMusicSystem_C_Create_New_Audio_Component, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'BP_InteractiveMusicSystem_C_Create_New_Audio_Component::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_InteractiveMusicSystem_C_Create_New_Audio_Component, CallFunc_SpawnSound2D_ReturnValue) == 0x000020, "Member 'BP_InteractiveMusicSystem_C_Create_New_Audio_Component::CallFunc_SpawnSound2D_ReturnValue' has a wrong offset!");

// Function BP_InteractiveMusicSystem.BP_InteractiveMusicSystem_C.CreateInteractiveMusicWithContextIfNeeded
// 0x0088 (0x0088 - 0x0000)
struct BP_InteractiveMusicSystem_C_CreateInteractiveMusicWithContextIfNeeded final
{
public:
	E_InteractiveMusicContext                     Context;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             Sound;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FS_InteractiveMusic                    InteractiveMusic;                                  // 0x0010(0x0018)(Parm, OutParm, ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_Create_New_Audio_Component_SpawnedComponent; // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_InteractiveMusic                    K2Node_MakeStruct_S_InteractiveMusic;              // 0x0038(0x0018)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52[0x6];                                       // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_InteractiveMusic                    CallFunc_GetInteractiveMusicByContext_InteractiveMusic; // 0x0058(0x0018)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class USoundBase*                             CallFunc_GetSoundByContext_Sound;                  // 0x0070(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   CallFunc_GetSoundByContext_LastAudioTrigger;       // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_InteractiveMusicSystem_C_CreateInteractiveMusicWithContextIfNeeded) == 0x000008, "Wrong alignment on BP_InteractiveMusicSystem_C_CreateInteractiveMusicWithContextIfNeeded");
static_assert(sizeof(BP_InteractiveMusicSystem_C_CreateInteractiveMusicWithContextIfNeeded) == 0x000088, "Wrong size on BP_InteractiveMusicSystem_C_CreateInteractiveMusicWithContextIfNeeded");
static_assert(offsetof(BP_InteractiveMusicSystem_C_CreateInteractiveMusicWithContextIfNeeded, Context) == 0x000000, "Member 'BP_InteractiveMusicSystem_C_CreateInteractiveMusicWithContextIfNeeded::Context' has a wrong offset!");
static_assert(offsetof(BP_InteractiveMusicSystem_C_CreateInteractiveMusicWithContextIfNeeded, Sound) == 0x000008, "Member 'BP_InteractiveMusicSystem_C_CreateInteractiveMusicWithContextIfNeeded::Sound' has a wrong offset!");
static_assert(offsetof(BP_InteractiveMusicSystem_C_CreateInteractiveMusicWithContextIfNeeded, InteractiveMusic) == 0x000010, "Member 'BP_InteractiveMusicSystem_C_CreateInteractiveMusicWithContextIfNeeded::InteractiveMusic' has a wrong offset!");
static_assert(offsetof(BP_InteractiveMusicSystem_C_CreateInteractiveMusicWithContextIfNeeded, CallFunc_Create_New_Audio_Component_SpawnedComponent) == 0x000028, "Member 'BP_InteractiveMusicSystem_C_CreateInteractiveMusicWithContextIfNeeded::CallFunc_Create_New_Audio_Component_SpawnedComponent' has a wrong offset!");
static_assert(offsetof(BP_InteractiveMusicSystem_C_CreateInteractiveMusicWithContextIfNeeded, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'BP_InteractiveMusicSystem_C_CreateInteractiveMusicWithContextIfNeeded::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractiveMusicSystem_C_CreateInteractiveMusicWithContextIfNeeded, K2Node_MakeStruct_S_InteractiveMusic) == 0x000038, "Member 'BP_InteractiveMusicSystem_C_CreateInteractiveMusicWithContextIfNeeded::K2Node_MakeStruct_S_InteractiveMusic' has a wrong offset!");
static_assert(offsetof(BP_InteractiveMusicSystem_C_CreateInteractiveMusicWithContextIfNeeded, CallFunc_Not_PreBool_ReturnValue) == 0x000050, "Member 'BP_InteractiveMusicSystem_C_CreateInteractiveMusicWithContextIfNeeded::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractiveMusicSystem_C_CreateInteractiveMusicWithContextIfNeeded, CallFunc_IsValid_ReturnValue_1) == 0x000051, "Member 'BP_InteractiveMusicSystem_C_CreateInteractiveMusicWithContextIfNeeded::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_InteractiveMusicSystem_C_CreateInteractiveMusicWithContextIfNeeded, CallFunc_GetInteractiveMusicByContext_InteractiveMusic) == 0x000058, "Member 'BP_InteractiveMusicSystem_C_CreateInteractiveMusicWithContextIfNeeded::CallFunc_GetInteractiveMusicByContext_InteractiveMusic' has a wrong offset!");
static_assert(offsetof(BP_InteractiveMusicSystem_C_CreateInteractiveMusicWithContextIfNeeded, CallFunc_GetSoundByContext_Sound) == 0x000070, "Member 'BP_InteractiveMusicSystem_C_CreateInteractiveMusicWithContextIfNeeded::CallFunc_GetSoundByContext_Sound' has a wrong offset!");
static_assert(offsetof(BP_InteractiveMusicSystem_C_CreateInteractiveMusicWithContextIfNeeded, CallFunc_GetSoundByContext_LastAudioTrigger) == 0x000078, "Member 'BP_InteractiveMusicSystem_C_CreateInteractiveMusicWithContextIfNeeded::CallFunc_GetSoundByContext_LastAudioTrigger' has a wrong offset!");
static_assert(offsetof(BP_InteractiveMusicSystem_C_CreateInteractiveMusicWithContextIfNeeded, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000080, "Member 'BP_InteractiveMusicSystem_C_CreateInteractiveMusicWithContextIfNeeded::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractiveMusicSystem_C_CreateInteractiveMusicWithContextIfNeeded, CallFunc_BooleanOR_ReturnValue) == 0x000081, "Member 'BP_InteractiveMusicSystem_C_CreateInteractiveMusicWithContextIfNeeded::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function BP_InteractiveMusicSystem.BP_InteractiveMusicSystem_C.DestroyAllInteractiveMusicContexts
// 0x0048 (0x0048 - 0x0000)
struct BP_InteractiveMusicSystem_C_DestroyAllInteractiveMusicContexts final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FS_InteractiveMusic>            CallFunc_Map_Values_Values;                        // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_InteractiveMusic                    CallFunc_Array_Get_Item;                           // 0x0028(0x0018)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_InteractiveMusicSystem_C_DestroyAllInteractiveMusicContexts) == 0x000008, "Wrong alignment on BP_InteractiveMusicSystem_C_DestroyAllInteractiveMusicContexts");
static_assert(sizeof(BP_InteractiveMusicSystem_C_DestroyAllInteractiveMusicContexts) == 0x000048, "Wrong size on BP_InteractiveMusicSystem_C_DestroyAllInteractiveMusicContexts");
static_assert(offsetof(BP_InteractiveMusicSystem_C_DestroyAllInteractiveMusicContexts, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BP_InteractiveMusicSystem_C_DestroyAllInteractiveMusicContexts::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_InteractiveMusicSystem_C_DestroyAllInteractiveMusicContexts, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_InteractiveMusicSystem_C_DestroyAllInteractiveMusicContexts::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_InteractiveMusicSystem_C_DestroyAllInteractiveMusicContexts, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_InteractiveMusicSystem_C_DestroyAllInteractiveMusicContexts::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractiveMusicSystem_C_DestroyAllInteractiveMusicContexts, CallFunc_Map_Values_Values) == 0x000010, "Member 'BP_InteractiveMusicSystem_C_DestroyAllInteractiveMusicContexts::CallFunc_Map_Values_Values' has a wrong offset!");
static_assert(offsetof(BP_InteractiveMusicSystem_C_DestroyAllInteractiveMusicContexts, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'BP_InteractiveMusicSystem_C_DestroyAllInteractiveMusicContexts::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractiveMusicSystem_C_DestroyAllInteractiveMusicContexts, CallFunc_Array_Get_Item) == 0x000028, "Member 'BP_InteractiveMusicSystem_C_DestroyAllInteractiveMusicContexts::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_InteractiveMusicSystem_C_DestroyAllInteractiveMusicContexts, CallFunc_Less_IntInt_ReturnValue) == 0x000040, "Member 'BP_InteractiveMusicSystem_C_DestroyAllInteractiveMusicContexts::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractiveMusicSystem_C_DestroyAllInteractiveMusicContexts, CallFunc_IsValid_ReturnValue) == 0x000041, "Member 'BP_InteractiveMusicSystem_C_DestroyAllInteractiveMusicContexts::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_InteractiveMusicSystem.BP_InteractiveMusicSystem_C.ExecuteAudioTriggerByContext
// 0x00F0 (0x00F0 - 0x0000)
struct BP_InteractiveMusicSystem_C_ExecuteAudioTriggerByContext final
{
public:
	E_InteractiveMusicContext                     Context;                                           // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   AudioTrigger;                                      // 0x0004(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsInterruption;                                    // 0x000C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_InteractiveMusic                    local_Music;                                       // 0x0010(0x0018)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TScriptInterface<class IAudioParameterControllerInterface> CallFunc_SetTriggerParameter_self_CastInput; // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsNameValid_ReturnValue;                  // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0050(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0060(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00A8(0x0010)(ReferenceParm)
	struct FS_InteractiveMusic                    CallFunc_Map_Find_Value;                           // 0x00B8(0x0018)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Format_ReturnValue;                       // 0x00D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_InteractiveMusicSystem_C_ExecuteAudioTriggerByContext) == 0x000008, "Wrong alignment on BP_InteractiveMusicSystem_C_ExecuteAudioTriggerByContext");
static_assert(sizeof(BP_InteractiveMusicSystem_C_ExecuteAudioTriggerByContext) == 0x0000F0, "Wrong size on BP_InteractiveMusicSystem_C_ExecuteAudioTriggerByContext");
static_assert(offsetof(BP_InteractiveMusicSystem_C_ExecuteAudioTriggerByContext, Context) == 0x000000, "Member 'BP_InteractiveMusicSystem_C_ExecuteAudioTriggerByContext::Context' has a wrong offset!");
static_assert(offsetof(BP_InteractiveMusicSystem_C_ExecuteAudioTriggerByContext, AudioTrigger) == 0x000004, "Member 'BP_InteractiveMusicSystem_C_ExecuteAudioTriggerByContext::AudioTrigger' has a wrong offset!");
static_assert(offsetof(BP_InteractiveMusicSystem_C_ExecuteAudioTriggerByContext, IsInterruption) == 0x00000C, "Member 'BP_InteractiveMusicSystem_C_ExecuteAudioTriggerByContext::IsInterruption' has a wrong offset!");
static_assert(offsetof(BP_InteractiveMusicSystem_C_ExecuteAudioTriggerByContext, local_Music) == 0x000010, "Member 'BP_InteractiveMusicSystem_C_ExecuteAudioTriggerByContext::local_Music' has a wrong offset!");
static_assert(offsetof(BP_InteractiveMusicSystem_C_ExecuteAudioTriggerByContext, CallFunc_SetTriggerParameter_self_CastInput) == 0x000028, "Member 'BP_InteractiveMusicSystem_C_ExecuteAudioTriggerByContext::CallFunc_SetTriggerParameter_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_InteractiveMusicSystem_C_ExecuteAudioTriggerByContext, CallFunc_IsValid_ReturnValue) == 0x000038, "Member 'BP_InteractiveMusicSystem_C_ExecuteAudioTriggerByContext::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractiveMusicSystem_C_ExecuteAudioTriggerByContext, CallFunc_IsNameValid_ReturnValue) == 0x000039, "Member 'BP_InteractiveMusicSystem_C_ExecuteAudioTriggerByContext::CallFunc_IsNameValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractiveMusicSystem_C_ExecuteAudioTriggerByContext, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x000040, "Member 'BP_InteractiveMusicSystem_C_ExecuteAudioTriggerByContext::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractiveMusicSystem_C_ExecuteAudioTriggerByContext, CallFunc_Conv_StringToText_ReturnValue) == 0x000050, "Member 'BP_InteractiveMusicSystem_C_ExecuteAudioTriggerByContext::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractiveMusicSystem_C_ExecuteAudioTriggerByContext, K2Node_MakeStruct_FormatArgumentData) == 0x000060, "Member 'BP_InteractiveMusicSystem_C_ExecuteAudioTriggerByContext::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_InteractiveMusicSystem_C_ExecuteAudioTriggerByContext, K2Node_MakeArray_Array) == 0x0000A8, "Member 'BP_InteractiveMusicSystem_C_ExecuteAudioTriggerByContext::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_InteractiveMusicSystem_C_ExecuteAudioTriggerByContext, CallFunc_Map_Find_Value) == 0x0000B8, "Member 'BP_InteractiveMusicSystem_C_ExecuteAudioTriggerByContext::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BP_InteractiveMusicSystem_C_ExecuteAudioTriggerByContext, CallFunc_Map_Find_ReturnValue) == 0x0000D0, "Member 'BP_InteractiveMusicSystem_C_ExecuteAudioTriggerByContext::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractiveMusicSystem_C_ExecuteAudioTriggerByContext, CallFunc_Format_ReturnValue) == 0x0000D8, "Member 'BP_InteractiveMusicSystem_C_ExecuteAudioTriggerByContext::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractiveMusicSystem_C_ExecuteAudioTriggerByContext, CallFunc_BooleanAND_ReturnValue) == 0x0000E8, "Member 'BP_InteractiveMusicSystem_C_ExecuteAudioTriggerByContext::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BP_InteractiveMusicSystem.BP_InteractiveMusicSystem_C.ExecuteUbergraph_BP_InteractiveMusicSystem
// 0x0018 (0x0018 - 0x0000)
struct BP_InteractiveMusicSystem_C_ExecuteUbergraph_BP_InteractiveMusicSystem final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Enable;                         // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable; // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDebugString_String;                    // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_InteractiveMusicSystem_C_ExecuteUbergraph_BP_InteractiveMusicSystem) == 0x000008, "Wrong alignment on BP_InteractiveMusicSystem_C_ExecuteUbergraph_BP_InteractiveMusicSystem");
static_assert(sizeof(BP_InteractiveMusicSystem_C_ExecuteUbergraph_BP_InteractiveMusicSystem) == 0x000018, "Wrong size on BP_InteractiveMusicSystem_C_ExecuteUbergraph_BP_InteractiveMusicSystem");
static_assert(offsetof(BP_InteractiveMusicSystem_C_ExecuteUbergraph_BP_InteractiveMusicSystem, EntryPoint) == 0x000000, "Member 'BP_InteractiveMusicSystem_C_ExecuteUbergraph_BP_InteractiveMusicSystem::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_InteractiveMusicSystem_C_ExecuteUbergraph_BP_InteractiveMusicSystem, Temp_bool_Has_Been_Initd_Variable) == 0x000004, "Member 'BP_InteractiveMusicSystem_C_ExecuteUbergraph_BP_InteractiveMusicSystem::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_InteractiveMusicSystem_C_ExecuteUbergraph_BP_InteractiveMusicSystem, Temp_bool_IsClosed_Variable) == 0x000005, "Member 'BP_InteractiveMusicSystem_C_ExecuteUbergraph_BP_InteractiveMusicSystem::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_InteractiveMusicSystem_C_ExecuteUbergraph_BP_InteractiveMusicSystem, K2Node_CustomEvent_Enable) == 0x000006, "Member 'BP_InteractiveMusicSystem_C_ExecuteUbergraph_BP_InteractiveMusicSystem::K2Node_CustomEvent_Enable' has a wrong offset!");
static_assert(offsetof(BP_InteractiveMusicSystem_C_ExecuteUbergraph_BP_InteractiveMusicSystem, Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable) == 0x000007, "Member 'BP_InteractiveMusicSystem_C_ExecuteUbergraph_BP_InteractiveMusicSystem::Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable' has a wrong offset!");
static_assert(offsetof(BP_InteractiveMusicSystem_C_ExecuteUbergraph_BP_InteractiveMusicSystem, CallFunc_GetDebugString_String) == 0x000008, "Member 'BP_InteractiveMusicSystem_C_ExecuteUbergraph_BP_InteractiveMusicSystem::CallFunc_GetDebugString_String' has a wrong offset!");

// Function BP_InteractiveMusicSystem.BP_InteractiveMusicSystem_C.FadeOutInteractiveMusicByContext
// 0x0028 (0x0028 - 0x0000)
struct BP_InteractiveMusicSystem_C_FadeOutInteractiveMusicByContext final
{
public:
	E_InteractiveMusicContext                     Context;                                           // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         AdjustVolumeDuration;                              // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_InteractiveMusic                    CallFunc_GetInteractiveMusicByContext_InteractiveMusic; // 0x0008(0x0018)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_InteractiveMusicSystem_C_FadeOutInteractiveMusicByContext) == 0x000008, "Wrong alignment on BP_InteractiveMusicSystem_C_FadeOutInteractiveMusicByContext");
static_assert(sizeof(BP_InteractiveMusicSystem_C_FadeOutInteractiveMusicByContext) == 0x000028, "Wrong size on BP_InteractiveMusicSystem_C_FadeOutInteractiveMusicByContext");
static_assert(offsetof(BP_InteractiveMusicSystem_C_FadeOutInteractiveMusicByContext, Context) == 0x000000, "Member 'BP_InteractiveMusicSystem_C_FadeOutInteractiveMusicByContext::Context' has a wrong offset!");
static_assert(offsetof(BP_InteractiveMusicSystem_C_FadeOutInteractiveMusicByContext, AdjustVolumeDuration) == 0x000004, "Member 'BP_InteractiveMusicSystem_C_FadeOutInteractiveMusicByContext::AdjustVolumeDuration' has a wrong offset!");
static_assert(offsetof(BP_InteractiveMusicSystem_C_FadeOutInteractiveMusicByContext, CallFunc_GetInteractiveMusicByContext_InteractiveMusic) == 0x000008, "Member 'BP_InteractiveMusicSystem_C_FadeOutInteractiveMusicByContext::CallFunc_GetInteractiveMusicByContext_InteractiveMusic' has a wrong offset!");
static_assert(offsetof(BP_InteractiveMusicSystem_C_FadeOutInteractiveMusicByContext, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'BP_InteractiveMusicSystem_C_FadeOutInteractiveMusicByContext::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_InteractiveMusicSystem.BP_InteractiveMusicSystem_C.GetAudioComponentDebugString
// 0x00A8 (0x00A8 - 0x0000)
struct BP_InteractiveMusicSystem_C_GetAudioComponentDebugString final
{
public:
	class UAudioComponent*                        AudioComponent;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FString                                 ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0030(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0040(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0088(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Format_ReturnValue;                       // 0x0098(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_InteractiveMusicSystem_C_GetAudioComponentDebugString) == 0x000008, "Wrong alignment on BP_InteractiveMusicSystem_C_GetAudioComponentDebugString");
static_assert(sizeof(BP_InteractiveMusicSystem_C_GetAudioComponentDebugString) == 0x0000A8, "Wrong size on BP_InteractiveMusicSystem_C_GetAudioComponentDebugString");
static_assert(offsetof(BP_InteractiveMusicSystem_C_GetAudioComponentDebugString, AudioComponent) == 0x000000, "Member 'BP_InteractiveMusicSystem_C_GetAudioComponentDebugString::AudioComponent' has a wrong offset!");
static_assert(offsetof(BP_InteractiveMusicSystem_C_GetAudioComponentDebugString, ReturnValue) == 0x000008, "Member 'BP_InteractiveMusicSystem_C_GetAudioComponentDebugString::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractiveMusicSystem_C_GetAudioComponentDebugString, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'BP_InteractiveMusicSystem_C_GetAudioComponentDebugString::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractiveMusicSystem_C_GetAudioComponentDebugString, CallFunc_IsValid_ReturnValue_1) == 0x000019, "Member 'BP_InteractiveMusicSystem_C_GetAudioComponentDebugString::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_InteractiveMusicSystem_C_GetAudioComponentDebugString, CallFunc_GetDisplayName_ReturnValue) == 0x000020, "Member 'BP_InteractiveMusicSystem_C_GetAudioComponentDebugString::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractiveMusicSystem_C_GetAudioComponentDebugString, CallFunc_Conv_StringToText_ReturnValue) == 0x000030, "Member 'BP_InteractiveMusicSystem_C_GetAudioComponentDebugString::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractiveMusicSystem_C_GetAudioComponentDebugString, K2Node_MakeStruct_FormatArgumentData) == 0x000040, "Member 'BP_InteractiveMusicSystem_C_GetAudioComponentDebugString::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_InteractiveMusicSystem_C_GetAudioComponentDebugString, K2Node_MakeArray_Array) == 0x000088, "Member 'BP_InteractiveMusicSystem_C_GetAudioComponentDebugString::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_InteractiveMusicSystem_C_GetAudioComponentDebugString, CallFunc_Format_ReturnValue) == 0x000098, "Member 'BP_InteractiveMusicSystem_C_GetAudioComponentDebugString::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function BP_InteractiveMusicSystem.BP_InteractiveMusicSystem_C.GetAudioTriggerNameForContextAndTable
// 0x0130 (0x0130 - 0x0000)
struct BP_InteractiveMusicSystem_C_GetAudioTriggerNameForContextAndTable final
{
public:
	class UDataTable*                             DataTable;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	E_InteractiveMusicContext                     Context;                                           // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   AudioTriggerName;                                  // 0x000C(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0038(0x0010)()
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0050(0x0048)(HasGetValueTypeHash)
	struct FS_InteractiveMusicContextSwitch       CallFunc_GetDataTableRowFromName_OutRow;           // 0x0098(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A5[0x3];                                       // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_1; // 0x00A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x00B8(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00C8(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0110(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Format_ReturnValue;                       // 0x0120(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_InteractiveMusicSystem_C_GetAudioTriggerNameForContextAndTable) == 0x000008, "Wrong alignment on BP_InteractiveMusicSystem_C_GetAudioTriggerNameForContextAndTable");
static_assert(sizeof(BP_InteractiveMusicSystem_C_GetAudioTriggerNameForContextAndTable) == 0x000130, "Wrong size on BP_InteractiveMusicSystem_C_GetAudioTriggerNameForContextAndTable");
static_assert(offsetof(BP_InteractiveMusicSystem_C_GetAudioTriggerNameForContextAndTable, DataTable) == 0x000000, "Member 'BP_InteractiveMusicSystem_C_GetAudioTriggerNameForContextAndTable::DataTable' has a wrong offset!");
static_assert(offsetof(BP_InteractiveMusicSystem_C_GetAudioTriggerNameForContextAndTable, Context) == 0x000008, "Member 'BP_InteractiveMusicSystem_C_GetAudioTriggerNameForContextAndTable::Context' has a wrong offset!");
static_assert(offsetof(BP_InteractiveMusicSystem_C_GetAudioTriggerNameForContextAndTable, AudioTriggerName) == 0x00000C, "Member 'BP_InteractiveMusicSystem_C_GetAudioTriggerNameForContextAndTable::AudioTriggerName' has a wrong offset!");
static_assert(offsetof(BP_InteractiveMusicSystem_C_GetAudioTriggerNameForContextAndTable, CallFunc_GetDisplayName_ReturnValue) == 0x000018, "Member 'BP_InteractiveMusicSystem_C_GetAudioTriggerNameForContextAndTable::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractiveMusicSystem_C_GetAudioTriggerNameForContextAndTable, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x000028, "Member 'BP_InteractiveMusicSystem_C_GetAudioTriggerNameForContextAndTable::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractiveMusicSystem_C_GetAudioTriggerNameForContextAndTable, CallFunc_Conv_StringToText_ReturnValue) == 0x000038, "Member 'BP_InteractiveMusicSystem_C_GetAudioTriggerNameForContextAndTable::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractiveMusicSystem_C_GetAudioTriggerNameForContextAndTable, CallFunc_Conv_StringToName_ReturnValue) == 0x000048, "Member 'BP_InteractiveMusicSystem_C_GetAudioTriggerNameForContextAndTable::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractiveMusicSystem_C_GetAudioTriggerNameForContextAndTable, K2Node_MakeStruct_FormatArgumentData) == 0x000050, "Member 'BP_InteractiveMusicSystem_C_GetAudioTriggerNameForContextAndTable::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_InteractiveMusicSystem_C_GetAudioTriggerNameForContextAndTable, CallFunc_GetDataTableRowFromName_OutRow) == 0x000098, "Member 'BP_InteractiveMusicSystem_C_GetAudioTriggerNameForContextAndTable::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BP_InteractiveMusicSystem_C_GetAudioTriggerNameForContextAndTable, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x0000A4, "Member 'BP_InteractiveMusicSystem_C_GetAudioTriggerNameForContextAndTable::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractiveMusicSystem_C_GetAudioTriggerNameForContextAndTable, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_1) == 0x0000A8, "Member 'BP_InteractiveMusicSystem_C_GetAudioTriggerNameForContextAndTable::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_InteractiveMusicSystem_C_GetAudioTriggerNameForContextAndTable, CallFunc_Conv_StringToText_ReturnValue_1) == 0x0000B8, "Member 'BP_InteractiveMusicSystem_C_GetAudioTriggerNameForContextAndTable::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_InteractiveMusicSystem_C_GetAudioTriggerNameForContextAndTable, K2Node_MakeStruct_FormatArgumentData_1) == 0x0000C8, "Member 'BP_InteractiveMusicSystem_C_GetAudioTriggerNameForContextAndTable::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BP_InteractiveMusicSystem_C_GetAudioTriggerNameForContextAndTable, K2Node_MakeArray_Array) == 0x000110, "Member 'BP_InteractiveMusicSystem_C_GetAudioTriggerNameForContextAndTable::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_InteractiveMusicSystem_C_GetAudioTriggerNameForContextAndTable, CallFunc_Format_ReturnValue) == 0x000120, "Member 'BP_InteractiveMusicSystem_C_GetAudioTriggerNameForContextAndTable::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function BP_InteractiveMusicSystem.BP_InteractiveMusicSystem_C.GetAudioTriggerNameWhenInterrupted
// 0x0014 (0x0014 - 0x0000)
struct BP_InteractiveMusicSystem_C_GetAudioTriggerNameWhenInterrupted final
{
public:
	E_InteractiveMusicContext                     NewContext;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   AudioTriggerName;                                  // 0x0004(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetAudioTriggerNameForContextAndTable_AudioTriggerName; // 0x000C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_InteractiveMusicSystem_C_GetAudioTriggerNameWhenInterrupted) == 0x000004, "Wrong alignment on BP_InteractiveMusicSystem_C_GetAudioTriggerNameWhenInterrupted");
static_assert(sizeof(BP_InteractiveMusicSystem_C_GetAudioTriggerNameWhenInterrupted) == 0x000014, "Wrong size on BP_InteractiveMusicSystem_C_GetAudioTriggerNameWhenInterrupted");
static_assert(offsetof(BP_InteractiveMusicSystem_C_GetAudioTriggerNameWhenInterrupted, NewContext) == 0x000000, "Member 'BP_InteractiveMusicSystem_C_GetAudioTriggerNameWhenInterrupted::NewContext' has a wrong offset!");
static_assert(offsetof(BP_InteractiveMusicSystem_C_GetAudioTriggerNameWhenInterrupted, AudioTriggerName) == 0x000004, "Member 'BP_InteractiveMusicSystem_C_GetAudioTriggerNameWhenInterrupted::AudioTriggerName' has a wrong offset!");
static_assert(offsetof(BP_InteractiveMusicSystem_C_GetAudioTriggerNameWhenInterrupted, CallFunc_GetAudioTriggerNameForContextAndTable_AudioTriggerName) == 0x00000C, "Member 'BP_InteractiveMusicSystem_C_GetAudioTriggerNameWhenInterrupted::CallFunc_GetAudioTriggerNameForContextAndTable_AudioTriggerName' has a wrong offset!");

// Function BP_InteractiveMusicSystem.BP_InteractiveMusicSystem_C.GetAudioTriggerNameWhenInterrupting
// 0x0014 (0x0014 - 0x0000)
struct BP_InteractiveMusicSystem_C_GetAudioTriggerNameWhenInterrupting final
{
public:
	E_InteractiveMusicContext                     CurrentContext_0;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   AudioTriggerName;                                  // 0x0004(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetAudioTriggerNameForContextAndTable_AudioTriggerName; // 0x000C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_InteractiveMusicSystem_C_GetAudioTriggerNameWhenInterrupting) == 0x000004, "Wrong alignment on BP_InteractiveMusicSystem_C_GetAudioTriggerNameWhenInterrupting");
