#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_jRPG_EnemyBattleSpot

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_jRPG_EnemyBattleSpot.BP_jRPG_EnemyBattleSpot_C.DEBUG_CVarChange_ShowBattleDebug
// 0x0001 (0x0001 - 0x0000)
struct BP_jRPG_EnemyBattleSpot_C_DEBUG_CVarChange_ShowBattleDebug final
{
public:
	bool                                          NewValue;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_jRPG_EnemyBattleSpot_C_DEBUG_CVarChange_ShowBattleDebug) == 0x000001, "Wrong alignment on BP_jRPG_EnemyBattleSpot_C_DEBUG_CVarChange_ShowBattleDebug");
static_assert(sizeof(BP_jRPG_EnemyBattleSpot_C_DEBUG_CVarChange_ShowBattleDebug) == 0x000001, "Wrong size on BP_jRPG_EnemyBattleSpot_C_DEBUG_CVarChange_ShowBattleDebug");
static_assert(offsetof(BP_jRPG_EnemyBattleSpot_C_DEBUG_CVarChange_ShowBattleDebug, NewValue) == 0x000000, "Member 'BP_jRPG_EnemyBattleSpot_C_DEBUG_CVarChange_ShowBattleDebug::NewValue' has a wrong offset!");

// Function BP_jRPG_EnemyBattleSpot.BP_jRPG_EnemyBattleSpot_C.ExecuteUbergraph_BP_jRPG_EnemyBattleSpot
// 0x00F8 (0x00F8 - 0x0000)
struct BP_jRPG_EnemyBattleSpot_C_ExecuteUbergraph_BP_jRPG_EnemyBattleSpot final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool NewValue)>                K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0028(0x0048)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0070(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0080(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00C8(0x0010)(ReferenceParm)
	bool                                          K2Node_CustomEvent_NewValue;                       // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00E0(0x0010)()
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_jRPG_EnemyBattleSpot_C_ExecuteUbergraph_BP_jRPG_EnemyBattleSpot) == 0x000008, "Wrong alignment on BP_jRPG_EnemyBattleSpot_C_ExecuteUbergraph_BP_jRPG_EnemyBattleSpot");
static_assert(sizeof(BP_jRPG_EnemyBattleSpot_C_ExecuteUbergraph_BP_jRPG_EnemyBattleSpot) == 0x0000F8, "Wrong size on BP_jRPG_EnemyBattleSpot_C_ExecuteUbergraph_BP_jRPG_EnemyBattleSpot");
static_assert(offsetof(BP_jRPG_EnemyBattleSpot_C_ExecuteUbergraph_BP_jRPG_EnemyBattleSpot, EntryPoint) == 0x000000, "Member 'BP_jRPG_EnemyBattleSpot_C_ExecuteUbergraph_BP_jRPG_EnemyBattleSpot::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_jRPG_EnemyBattleSpot_C_ExecuteUbergraph_BP_jRPG_EnemyBattleSpot, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BP_jRPG_EnemyBattleSpot_C_ExecuteUbergraph_BP_jRPG_EnemyBattleSpot::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_jRPG_EnemyBattleSpot_C_ExecuteUbergraph_BP_jRPG_EnemyBattleSpot, CallFunc_GetDisplayName_ReturnValue) == 0x000018, "Member 'BP_jRPG_EnemyBattleSpot_C_ExecuteUbergraph_BP_jRPG_EnemyBattleSpot::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_EnemyBattleSpot_C_ExecuteUbergraph_BP_jRPG_EnemyBattleSpot, K2Node_MakeStruct_FormatArgumentData) == 0x000028, "Member 'BP_jRPG_EnemyBattleSpot_C_ExecuteUbergraph_BP_jRPG_EnemyBattleSpot::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_jRPG_EnemyBattleSpot_C_ExecuteUbergraph_BP_jRPG_EnemyBattleSpot, CallFunc_Conv_StringToText_ReturnValue) == 0x000070, "Member 'BP_jRPG_EnemyBattleSpot_C_ExecuteUbergraph_BP_jRPG_EnemyBattleSpot::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_EnemyBattleSpot_C_ExecuteUbergraph_BP_jRPG_EnemyBattleSpot, K2Node_MakeStruct_FormatArgumentData_1) == 0x000080, "Member 'BP_jRPG_EnemyBattleSpot_C_ExecuteUbergraph_BP_jRPG_EnemyBattleSpot::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BP_jRPG_EnemyBattleSpot_C_ExecuteUbergraph_BP_jRPG_EnemyBattleSpot, K2Node_MakeArray_Array) == 0x0000C8, "Member 'BP_jRPG_EnemyBattleSpot_C_ExecuteUbergraph_BP_jRPG_EnemyBattleSpot::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_jRPG_EnemyBattleSpot_C_ExecuteUbergraph_BP_jRPG_EnemyBattleSpot, K2Node_CustomEvent_NewValue) == 0x0000D8, "Member 'BP_jRPG_EnemyBattleSpot_C_ExecuteUbergraph_BP_jRPG_EnemyBattleSpot::K2Node_CustomEvent_NewValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_EnemyBattleSpot_C_ExecuteUbergraph_BP_jRPG_EnemyBattleSpot, CallFunc_Format_ReturnValue) == 0x0000E0, "Member 'BP_jRPG_EnemyBattleSpot_C_ExecuteUbergraph_BP_jRPG_EnemyBattleSpot::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_EnemyBattleSpot_C_ExecuteUbergraph_BP_jRPG_EnemyBattleSpot, CallFunc_Not_PreBool_ReturnValue) == 0x0000F0, "Member 'BP_jRPG_EnemyBattleSpot_C_ExecuteUbergraph_BP_jRPG_EnemyBattleSpot::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function BP_jRPG_EnemyBattleSpot.BP_jRPG_EnemyBattleSpot_C.UserConstructionScript
// 0x00E8 (0x00E8 - 0x0000)
struct BP_jRPG_EnemyBattleSpot_C_UserConstructionScript final
{
public:
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue_1;            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0010(0x0048)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0058(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00A0(0x0010)(ReferenceParm)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x00B0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00C0(0x0010)()
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x00D0(0x0010)()
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_jRPG_EnemyBattleSpot_C_UserConstructionScript) == 0x000008, "Wrong alignment on BP_jRPG_EnemyBattleSpot_C_UserConstructionScript");
static_assert(sizeof(BP_jRPG_EnemyBattleSpot_C_UserConstructionScript) == 0x0000E8, "Wrong size on BP_jRPG_EnemyBattleSpot_C_UserConstructionScript");
static_assert(offsetof(BP_jRPG_EnemyBattleSpot_C_UserConstructionScript, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000000, "Member 'BP_jRPG_EnemyBattleSpot_C_UserConstructionScript::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_EnemyBattleSpot_C_UserConstructionScript, CallFunc_Conv_IntToInt64_ReturnValue_1) == 0x000008, "Member 'BP_jRPG_EnemyBattleSpot_C_UserConstructionScript::CallFunc_Conv_IntToInt64_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_jRPG_EnemyBattleSpot_C_UserConstructionScript, K2Node_MakeStruct_FormatArgumentData) == 0x000010, "Member 'BP_jRPG_EnemyBattleSpot_C_UserConstructionScript::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_jRPG_EnemyBattleSpot_C_UserConstructionScript, K2Node_MakeStruct_FormatArgumentData_1) == 0x000058, "Member 'BP_jRPG_EnemyBattleSpot_C_UserConstructionScript::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BP_jRPG_EnemyBattleSpot_C_UserConstructionScript, K2Node_MakeArray_Array) == 0x0000A0, "Member 'BP_jRPG_EnemyBattleSpot_C_UserConstructionScript::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_jRPG_EnemyBattleSpot_C_UserConstructionScript, K2Node_MakeArray_Array_1) == 0x0000B0, "Member 'BP_jRPG_EnemyBattleSpot_C_UserConstructionScript::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BP_jRPG_EnemyBattleSpot_C_UserConstructionScript, CallFunc_Format_ReturnValue) == 0x0000C0, "Member 'BP_jRPG_EnemyBattleSpot_C_UserConstructionScript::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_EnemyBattleSpot_C_UserConstructionScript, CallFunc_Format_ReturnValue_1) == 0x0000D0, "Member 'BP_jRPG_EnemyBattleSpot_C_UserConstructionScript::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_jRPG_EnemyBattleSpot_C_UserConstructionScript, K2Node_SwitchEnum_CmpSuccess) == 0x0000E0, "Member 'BP_jRPG_EnemyBattleSpot_C_UserConstructionScript::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

}

