#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_jRPG_Controller_World

#include "Basic.hpp"

#include "ALS_Player_Controller_classes.hpp"
#include "S_CameraOverrideParameters_structs.hpp"
#include "SandFall_structs.hpp"
#include "Engine_structs.hpp"
#include "E_BattleFlowState_structs.hpp"
#include "E_QuestStatus_structs.hpp"
#include "CommonInput_structs.hpp"
#include "EBattleEndResult_structs.hpp"
#include "E_Characters_structs.hpp"
#include "EInputAction_structs.hpp"
#include "EExplorationHealthDamageType_structs.hpp"
#include "E_WorldMapExplorationCapacity_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_jRPG_Controller_World.BP_jRPG_Controller_World_C
// 0x0580 (0x0DF8 - 0x0878)
class ABP_jRPG_Controller_World_C final : public AALS_Player_Controller_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0878(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBP_InputContextComponent_C*            BP_InputContextComponent;                          // 0x0880(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_InputLockComponent_C*               BP_InputLockComponent;                             // 0x0888(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_AchievementManager_C*               BP_AchievementManager;                             // 0x0890(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_LevelAmbienceAreaManager_C*         BP_LevelAmbienceAreaManager;                       // 0x0898(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_InteractiveEnvironmentManagerComponent_C* BP_InteractiveEnvironmentManagerComponent;   // 0x08A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_CinematicSystem_C*                  BP_CinematicSystem;                                // 0x08A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_LootSystemComponent_C*              BP_LootSystemComponent;                            // 0x08B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_GameActionExecutorComponent_C*      BP_GameActionExecutorComponent;                    // 0x08B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_LoadingSystemComponent_C*           BP_LoadingSystemComponent_Battle;                  // 0x08C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_World_Audio_Component_C*            BP_World_Audio_Component;                          // 0x08C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_UINavigationComponent_C*            BP_UINavigationComponent;                          // 0x08D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_CharacterReactionSystem_C*          BP_CharacterReactionSystem;                        // 0x08D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_InteractionSystem_C*                BP_InteractionSystem;                              // 0x08E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_TutorialSystemComponent_C*          BP_TutorialSystemComponent;                        // 0x08E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_InputManager_C*                     BP_InputManager;                                   // 0x08F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_DialogueSystemComponent_C*          BP_DialogueSystemComponent;                        // 0x08F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_GameDirectorComponent_C*            BP_GameDirectorComponent;                          // 0x0900(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAC_jRPG_TargetingManager_C*            AC_jRPG_TargetingManager;                          // 0x0908(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_QTEManager_C*                       AC_jRPG_QTEManager;                                // 0x0910(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAC_jRPG_ActionsManager_C*              AC_jRPG_ActionsManager;                            // 0x0918(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAC_jRPG_BattleManager_C*               AC_jRPG_BattleManager;                             // 0x0920(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAC_jRPG_CharactersManager_C*           AC_jRPG_CharactersManager;                         // 0x0928(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAC_jRPG_InventoryManager_C*            AC_jRPG_InventoryManager;                          // 0x0930(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ABP_jRPG_Character_World_C*             LastControlledCharacterReference;                  // 0x0938(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UWBP_jRPG_InteractionPopUp_C*           InteractionPopUp;                                  // 0x0940(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UTimelineComponent*                     Timeline_0;                                        // 0x0948(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAC_jRPG_DynamicCameraManager_C*        DynamicCameraManagerReference;                     // 0x0950(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Debug_ShowControlRotation;                         // 0x0958(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Debug_LogMouseRaycast;                             // 0x0959(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_95A[0x6];                                      // 0x095A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              TriggerLeftPressed;                                // 0x0960(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              VendorWindowClosed;                                // 0x0970(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UWBP_Exploration_HUD_C*                 ExplorationHUDWidget;                              // 0x0980(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              PlaceholderTutorialInput;                          // 0x0988(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          IsGameMenuVisible;                                 // 0x0998(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_999[0x7];                                      // 0x0999(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 GameActionActorLocation;                           // 0x09A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UBP_GameAction_TriggerBattle_C*         CurrentTriggerBattleGameAction;                    // 0x09A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	E_BattleFlowState                             BattleFlowState;                                   // 0x09B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsDefenseInputBound;                               // 0x09B1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9B2[0x6];                                      // 0x09B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         DEBUG_PreviouslyHiddenBlockoutActors;              // 0x09B8(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	struct FSF_ReferenceCounterHandle             InteractionSystemPayload;                          // 0x09C8(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	class ABP_GameMenuScene_C*                    GameMenuSceneActor;                                // 0x09E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FSF_ReferenceCounter                   GameplayIsPausedReferenceCounter;                  // 0x09F0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class AActor*>                         PausedActors;                                      // 0x0A10(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	TArray<class ABP_jRPG_Enemy_World_Base_Seamless_C*> WorldEnemiesAutomaticallyHiddenForBattle;    // 0x0A20(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	struct FSF_ReferenceCounterHandle             InteractBlocker_GameMenu;                          // 0x0A30(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UActorComponent*>                PausedComponents;                                  // 0x0A50(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class UWorldPartitionStreamingSourceComponent* GameMenuTemporaryStreamingSourceCharacter;        // 0x0A60(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<TScriptInterface<class IBPI_GameplayPausable_C>> PausedInterfaces;                        // 0x0A68(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class AActor*>                         ActorsHiddenByMenu;                                // 0x0A78(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	class UDataTable*                             Data_Table;                                        // 0x0A88(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CameraOverrideActor;                               // 0x0A90(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnMainMenuClosed;                                  // 0x0A98(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FSF_ReferenceCounterHandle             PauseBlocker_GameMenu;                             // 0x0AA8(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSF_ReferenceCounterHandle             PauseBlocker_Debug;                                // 0x0AC8(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMulticastInlineDelegate<void()>              OnMainMenuOpened;                                  // 0x0AE8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TArray<struct FS_CameraOverrideParameters>    CameraOverrideParametersStack;                     // 0x0AF8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMulticastInlineDelegate<void()>              OnPauseMenuOpened;                                 // 0x0B08(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnPauseMenuClosed;                                 // 0x0B18(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(class AActor* PreviousViewTarget, class AActor* CurrentViewTarget)> OnTargetViewAboutToChanged; // 0x0B28(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(const struct FS_CameraOverrideParameters& A, const struct FS_CameraOverrideParameters& B, class UOrderingResult* OrderingResult)> Dummy_SortCameraOverrideParameters; // 0x0B38(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnSavePointMenuOpened;                             // 0x0B48(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnSavePointMenuClosed;                             // 0x0B58(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnDocumentActorOpened;                             // 0x0B68(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnDocumentActorClosed;                             // 0x0B78(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FSF_ReferenceCounterHandle             InteractBlocker_PauseMenu;                         // 0x0B88(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSF_ReferenceCounterHandle             PauseBlocker_PauseMenu;                            // 0x0BA8(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          IsPauseMenuVisible;                                // 0x0BC8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC9[0x7];                                      // 0x0BC9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_PauseMenu_C*                       PauseMenuWidget;                                   // 0x0BD0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AExponentialHeightFog*                  SpawnedFogForGameMenu;                             // 0x0BD8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          IsSavePointMenuVisible;                            // 0x0BE0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BE1[0x7];                                      // 0x0BE1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSF_ReferenceCounter                   ForceFeedbackEnabledReferenceCounter;              // 0x0BE8(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSF_ReferenceCounterHandle             ForceFeedbackBlocker_PauseMenu;                    // 0x0C08(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSF_ReferenceCounterHandle             ForceFeedbackBlocker_GameMenu;                     // 0x0C28(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSF_ReferenceCounterHandle             SaveBlocker_Debug;                                 // 0x0C48(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSF_ReferenceCounterHandle             InteractBlocker_SavePoint;                         // 0x0C68(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSF_ReferenceCounterHandle             ForceFeedbackBlocker_SavePoint;                    // 0x0C88(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSF_ReferenceCounterHandle             PauseBlock_SavePoint;                              // 0x0CA8(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSF_ReferenceCounterHandle             UIInputLockBlockerReference;                       // 0x0CC8(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSF_ReferenceCounterHandle             BattleInputLockBlockerReference;                   // 0x0CE8(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSF_ReferenceCounterHandle             TransitionInputLockBlockerReference;               // 0x0D08(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSF_ReferenceCounterHandle             SavePointInputLockBlockerReference;                // 0x0D28(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSF_ReferenceCounterHandle             ChangingMapInputLockBlockerReference;              // 0x0D48(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSF_ReferenceCounter                   EnabledStreamingSourcesReferenceCounte;            // 0x0D68(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSF_ReferenceCounterHandle             PauseBlocker_FullscreenNotification;               // 0x0D88(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSF_ReferenceCounterHandle             ForceFeedbackBlocker_FullscreenNotification;       // 0x0DA8(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSF_ReferenceCounterHandle             InteractBlocker_FullscreenNotification;            // 0x0DC8(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          IsChangingArea;                                    // 0x0DE8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DE9[0x7];                                      // 0x0DE9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_PlatformPauseModal_C*              PlatformPauseWidget;                               // 0x0DF0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void AddCameraOverrideRequest(const struct FS_CameraOverrideParameters& CameraOverrideParameters);
	void ApplyUserSettings();
	void AxisInputThreshold(double AxisValue, int32* Value);
	void BackToTitleMenu();
	void BndEvt__BP_jRPG_Controller_World_BP_DialogueSystemComponent_K2Node_ComponentBoundEvent_0_OnDialogueFinished__DelegateSignature(class ABP_Dialogue_C* Dialogue);
	bool CanOpenGameMenu();
	bool CanOpenPauseMenu();
	bool CanOpenTeamOverlay();
	bool CanReceiveExplorationDamage();
	bool CanStartBattle();
	void CleanAndQuit();
	void CleanBattleManagers();
	void CloseDocumentActor();
	void CloseSavePointMenu(bool IsFromGameplay);
	void CompareCameraOverrideParametersByPriority(const struct FS_CameraOverrideParameters& A, const struct FS_CameraOverrideParameters& B, class UOrderingResult* OrderingResult);
