#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_jRPG_GM_World

#include "Basic.hpp"

#include "SandFall_classes.hpp"
#include "Engine_structs.hpp"
#include "S_AreaAudioParameters_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_jRPG_GM_World.BP_jRPG_GM_World_C
// 0x00E8 (0x0410 - 0x0328)
class ABP_jRPG_GM_World_C final : public ASandfallGameMode
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0328(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldInfoComponent_C*               BP_WorldInfoComponent;                             // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_GameFlowTransitionSystem_C*         BP_GameFlowTransitionSystem;                       // 0x0340(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot2;                                 // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class ABP_LightingScenarioReference_C> StartLevelLightingScenario;                // 0x0350(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct FS_AreaAudioParameters                 StartLevelAudioParam;                              // 0x0378(0x0038)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             SpawnTransform;                                    // 0x03B0(0x0060)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void ReceiveBeginPlay();
	void OnPreStartPlay();
	void OnGraphicSettingsApplied(class UConfigurableGameUserSettings* Settings);
	void K2_OnRestartPlayer(class AController* NewPlayer);
	void HandleStartingNewPlayer(class APlayerController* NewPlayer);
	void GetSpawnTransform(struct FTransform* SpawnTransform_0);
	void ExecuteUbergraph_BP_jRPG_GM_World(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_jRPG_GM_World_C">();
	}
	static class ABP_jRPG_GM_World_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_jRPG_GM_World_C>();
	}
};
static_assert(alignof(ABP_jRPG_GM_World_C) == 0x000010, "Wrong alignment on ABP_jRPG_GM_World_C");
static_assert(sizeof(ABP_jRPG_GM_World_C) == 0x000410, "Wrong size on ABP_jRPG_GM_World_C");
static_assert(offsetof(ABP_jRPG_GM_World_C, UberGraphFrame) == 0x000328, "Member 'ABP_jRPG_GM_World_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_jRPG_GM_World_C, DefaultSceneRoot) == 0x000330, "Member 'ABP_jRPG_GM_World_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_jRPG_GM_World_C, BP_WorldInfoComponent) == 0x000338, "Member 'ABP_jRPG_GM_World_C::BP_WorldInfoComponent' has a wrong offset!");
static_assert(offsetof(ABP_jRPG_GM_World_C, BP_GameFlowTransitionSystem) == 0x000340, "Member 'ABP_jRPG_GM_World_C::BP_GameFlowTransitionSystem' has a wrong offset!");
static_assert(offsetof(ABP_jRPG_GM_World_C, DefaultSceneRoot2) == 0x000348, "Member 'ABP_jRPG_GM_World_C::DefaultSceneRoot2' has a wrong offset!");
static_assert(offsetof(ABP_jRPG_GM_World_C, StartLevelLightingScenario) == 0x000350, "Member 'ABP_jRPG_GM_World_C::StartLevelLightingScenario' has a wrong offset!");
static_assert(offsetof(ABP_jRPG_GM_World_C, StartLevelAudioParam) == 0x000378, "Member 'ABP_jRPG_GM_World_C::StartLevelAudioParam' has a wrong offset!");
static_assert(offsetof(ABP_jRPG_GM_World_C, SpawnTransform) == 0x0003B0, "Member 'ABP_jRPG_GM_World_C::SpawnTransform' has a wrong offset!");

}

