#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_jRPG_Character_World

#include "Basic.hpp"

#include "EDialogueCameraType_structs.hpp"
#include "E_jRPG_CharacterWorldCapability_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "S_jRPG_WorldCharacters_structs.hpp"
#include "EInputDevices_structs.hpp"
#include "Engine_structs.hpp"
#include "EnhancedInput_structs.hpp"
#include "E_NPC_SpolightTypes_structs.hpp"
#include "EInWorldAudioContainerComponents_structs.hpp"
#include "ALSV4_CPP_structs.hpp"
#include "S_InputLockParameters_structs.hpp"
#include "S_jRPG_Character_World_Capabilities_structs.hpp"
#include "S_jRPG_Character_World_Movement_Data_structs.hpp"
#include "EFreeAimFeedbackType_structs.hpp"
#include "FLevelDataEntry_structs.hpp"
#include "S_CharacterCustomization_structs.hpp"
#include "InputCore_structs.hpp"
#include "S_AreaAudioParameters_structs.hpp"
#include "S_ChangeLevelParameters_structs.hpp"
#include "CinematicCamera_structs.hpp"
#include "SandFall_structs.hpp"
#include "S_CameraRecenterRequest_structs.hpp"
#include "S_jRPG_CharacterDefinition_structs.hpp"
#include "S_InputContextParameters_structs.hpp"


namespace SDK::Params
{

// Function BP_jRPG_Character_World.BP_jRPG_Character_World_C.AddCharacterMovementData
// 0x0018 (0x0018 - 0x0000)
struct BP_jRPG_Character_World_C_AddCharacterMovementData final
{
public:
	struct FS_jRPG_Character_World_Movement_Data  Movement_Data;                                     // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsHighPriority;                                    // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_jRPG_Character_World_C_AddCharacterMovementData) == 0x000008, "Wrong alignment on BP_jRPG_Character_World_C_AddCharacterMovementData");
static_assert(sizeof(BP_jRPG_Character_World_C_AddCharacterMovementData) == 0x000018, "Wrong size on BP_jRPG_Character_World_C_AddCharacterMovementData");
static_assert(offsetof(BP_jRPG_Character_World_C_AddCharacterMovementData, Movement_Data) == 0x000000, "Member 'BP_jRPG_Character_World_C_AddCharacterMovementData::Movement_Data' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Character_World_C_AddCharacterMovementData, IsHighPriority) == 0x000010, "Member 'BP_jRPG_Character_World_C_AddCharacterMovementData::IsHighPriority' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Character_World_C_AddCharacterMovementData, CallFunc_Array_Add_ReturnValue) == 0x000014, "Member 'BP_jRPG_Character_World_C_AddCharacterMovementData::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function BP_jRPG_Character_World.BP_jRPG_Character_World_C.AddInteractable
// 0x0008 (0x0008 - 0x0000)
struct BP_jRPG_Character_World_C_AddInteractable final
{
public:
	class AActor*                                 Interactable;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_jRPG_Character_World_C_AddInteractable) == 0x000008, "Wrong alignment on BP_jRPG_Character_World_C_AddInteractable");
static_assert(sizeof(BP_jRPG_Character_World_C_AddInteractable) == 0x000008, "Wrong size on BP_jRPG_Character_World_C_AddInteractable");
static_assert(offsetof(BP_jRPG_Character_World_C_AddInteractable, Interactable) == 0x000000, "Member 'BP_jRPG_Character_World_C_AddInteractable::Interactable' has a wrong offset!");

// Function BP_jRPG_Character_World.BP_jRPG_Character_World_C.AdjustCharacterSpringArm
// 0x0138 (0x0138 - 0x0000)
struct BP_jRPG_Character_World_C_AdjustCharacterSpringArm final
{
public:
	bool                                          IsCrouching;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        ScaledHalfHeightAdjust;                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_AddRelativeLocation_SweepHitResult;    // 0x0040(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_jRPG_Character_World_C_AdjustCharacterSpringArm) == 0x000008, "Wrong alignment on BP_jRPG_Character_World_C_AdjustCharacterSpringArm");
static_assert(sizeof(BP_jRPG_Character_World_C_AdjustCharacterSpringArm) == 0x000138, "Wrong size on BP_jRPG_Character_World_C_AdjustCharacterSpringArm");
static_assert(offsetof(BP_jRPG_Character_World_C_AdjustCharacterSpringArm, IsCrouching) == 0x000000, "Member 'BP_jRPG_Character_World_C_AdjustCharacterSpringArm::IsCrouching' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Character_World_C_AdjustCharacterSpringArm, ScaledHalfHeightAdjust) == 0x000008, "Member 'BP_jRPG_Character_World_C_AdjustCharacterSpringArm::ScaledHalfHeightAdjust' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Character_World_C_AdjustCharacterSpringArm, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000010, "Member 'BP_jRPG_Character_World_C_AdjustCharacterSpringArm::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Character_World_C_AdjustCharacterSpringArm, CallFunc_SelectFloat_ReturnValue) == 0x000018, "Member 'BP_jRPG_Character_World_C_AdjustCharacterSpringArm::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Character_World_C_AdjustCharacterSpringArm, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000020, "Member 'BP_jRPG_Character_World_C_AdjustCharacterSpringArm::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Character_World_C_AdjustCharacterSpringArm, CallFunc_MakeVector_ReturnValue) == 0x000028, "Member 'BP_jRPG_Character_World_C_AdjustCharacterSpringArm::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Character_World_C_AdjustCharacterSpringArm, CallFunc_K2_AddRelativeLocation_SweepHitResult) == 0x000040, "Member 'BP_jRPG_Character_World_C_AdjustCharacterSpringArm::CallFunc_K2_AddRelativeLocation_SweepHitResult' has a wrong offset!");

// Function BP_jRPG_Character_World.BP_jRPG_Character_World_C.AimAction
// 0x0001 (0x0001 - 0x0000)
struct BP_jRPG_Character_World_C_AimAction final
{
public:
	bool                                          bValue;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_jRPG_Character_World_C_AimAction) == 0x000001, "Wrong alignment on BP_jRPG_Character_World_C_AimAction");
static_assert(sizeof(BP_jRPG_Character_World_C_AimAction) == 0x000001, "Wrong size on BP_jRPG_Character_World_C_AimAction");
static_assert(offsetof(BP_jRPG_Character_World_C_AimAction, bValue) == 0x000000, "Member 'BP_jRPG_Character_World_C_AimAction::bValue' has a wrong offset!");

// Function BP_jRPG_Character_World.BP_jRPG_Character_World_C.ApplyDefaultInputContext
// 0x0001 (0x0001 - 0x0000)
struct BP_jRPG_Character_World_C_ApplyDefaultInputContext final
{
public:
	bool                                          SetDefaultRunningGait;                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_jRPG_Character_World_C_ApplyDefaultInputContext) == 0x000001, "Wrong alignment on BP_jRPG_Character_World_C_ApplyDefaultInputContext");
static_assert(sizeof(BP_jRPG_Character_World_C_ApplyDefaultInputContext) == 0x000001, "Wrong size on BP_jRPG_Character_World_C_ApplyDefaultInputContext");
static_assert(offsetof(BP_jRPG_Character_World_C_ApplyDefaultInputContext, SetDefaultRunningGait) == 0x000000, "Member 'BP_jRPG_Character_World_C_ApplyDefaultInputContext::SetDefaultRunningGait' has a wrong offset!");

// Function BP_jRPG_Character_World.BP_jRPG_Character_World_C.AreDependenciesLoaded
// 0x0001 (0x0001 - 0x0000)
struct BP_jRPG_Character_World_C_AreDependenciesLoaded final
{
public:
	bool                                          AreLoaded;                                         // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_jRPG_Character_World_C_AreDependenciesLoaded) == 0x000001, "Wrong alignment on BP_jRPG_Character_World_C_AreDependenciesLoaded");
static_assert(sizeof(BP_jRPG_Character_World_C_AreDependenciesLoaded) == 0x000001, "Wrong size on BP_jRPG_Character_World_C_AreDependenciesLoaded");
static_assert(offsetof(BP_jRPG_Character_World_C_AreDependenciesLoaded, AreLoaded) == 0x000000, "Member 'BP_jRPG_Character_World_C_AreDependenciesLoaded::AreLoaded' has a wrong offset!");

// Function BP_jRPG_Character_World.BP_jRPG_Character_World_C.ArmRingChangeFeedbackType
// 0x0028 (0x0028 - 0x0000)
struct BP_jRPG_Character_World_C_ArmRingChangeFeedbackType final
{
public:
	EFreeAimFeedbackType                          NewFeedbackType;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_ArmRingEnableFeedbackType_CurrentColor;   // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_ArmRingEnableFeedbackType_RotationRate;   // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_ArmRingEnableFeedbackType_Glow;           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_jRPG_Character_World_C_ArmRingChangeFeedbackType) == 0x000008, "Wrong alignment on BP_jRPG_Character_World_C_ArmRingChangeFeedbackType");
static_assert(sizeof(BP_jRPG_Character_World_C_ArmRingChangeFeedbackType) == 0x000028, "Wrong size on BP_jRPG_Character_World_C_ArmRingChangeFeedbackType");
static_assert(offsetof(BP_jRPG_Character_World_C_ArmRingChangeFeedbackType, NewFeedbackType) == 0x000000, "Member 'BP_jRPG_Character_World_C_ArmRingChangeFeedbackType::NewFeedbackType' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Character_World_C_ArmRingChangeFeedbackType, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000001, "Member 'BP_jRPG_Character_World_C_ArmRingChangeFeedbackType::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Character_World_C_ArmRingChangeFeedbackType, CallFunc_ArmRingEnableFeedbackType_CurrentColor) == 0x000004, "Member 'BP_jRPG_Character_World_C_ArmRingChangeFeedbackType::CallFunc_ArmRingEnableFeedbackType_CurrentColor' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Character_World_C_ArmRingChangeFeedbackType, CallFunc_ArmRingEnableFeedbackType_RotationRate) == 0x000018, "Member 'BP_jRPG_Character_World_C_ArmRingChangeFeedbackType::CallFunc_ArmRingEnableFeedbackType_RotationRate' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Character_World_C_ArmRingChangeFeedbackType, CallFunc_ArmRingEnableFeedbackType_Glow) == 0x000020, "Member 'BP_jRPG_Character_World_C_ArmRingChangeFeedbackType::CallFunc_ArmRingEnableFeedbackType_Glow' has a wrong offset!");

// Function BP_jRPG_Character_World.BP_jRPG_Character_World_C.ArmRingDisableFeedbackType
// 0x0018 (0x0018 - 0x0000)
struct BP_jRPG_Character_World_C_ArmRingDisableFeedbackType final
{
public:
	EFreeAimFeedbackType                          CurrentFeedbackType;                               // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_FreeAimCamera_C*                    K2Node_DynamicCast_AsBP_Free_Aim_Camera;           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_jRPG_Character_World_C_ArmRingDisableFeedbackType) == 0x000008, "Wrong alignment on BP_jRPG_Character_World_C_ArmRingDisableFeedbackType");
static_assert(sizeof(BP_jRPG_Character_World_C_ArmRingDisableFeedbackType) == 0x000018, "Wrong size on BP_jRPG_Character_World_C_ArmRingDisableFeedbackType");
static_assert(offsetof(BP_jRPG_Character_World_C_ArmRingDisableFeedbackType, CurrentFeedbackType) == 0x000000, "Member 'BP_jRPG_Character_World_C_ArmRingDisableFeedbackType::CurrentFeedbackType' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Character_World_C_ArmRingDisableFeedbackType, K2Node_SwitchEnum_CmpSuccess) == 0x000001, "Member 'BP_jRPG_Character_World_C_ArmRingDisableFeedbackType::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Character_World_C_ArmRingDisableFeedbackType, K2Node_DynamicCast_AsBP_Free_Aim_Camera) == 0x000008, "Member 'BP_jRPG_Character_World_C_ArmRingDisableFeedbackType::K2Node_DynamicCast_AsBP_Free_Aim_Camera' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Character_World_C_ArmRingDisableFeedbackType, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'BP_jRPG_Character_World_C_ArmRingDisableFeedbackType::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BP_jRPG_Character_World.BP_jRPG_Character_World_C.ArmRingEnableFeedbackType
// 0x00F8 (0x00F8 - 0x0000)
struct BP_jRPG_Character_World_C_ArmRingEnableFeedbackType final
{
public:
	EFreeAimFeedbackType                          CurrentFeedbackType;                               // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CurrentColor;                                      // 0x0004(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        RotationRate;                                      // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Glow;                                              // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable;                                // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_1;                              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_2;                              // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFreeAimFeedbackType                          Temp_byte_Variable;                                // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_3;                              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_4;                              // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_5;                              // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_6;                              // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFreeAimFeedbackType                          Temp_byte_Variable_1;                              // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_Select_Default;                             // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0080(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x0090(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_2;                            // 0x00A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_3;                            // 0x00B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_7;                              // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default_1;                           // 0x00C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFreeAimFeedbackType                          Temp_byte_Variable_2;                              // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_Select_Default_2;                           // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_FreeAimCamera_C*                    K2Node_DynamicCast_AsBP_Free_Aim_Camera;           // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_jRPG_Character_World_C_ArmRingEnableFeedbackType) == 0x000008, "Wrong alignment on BP_jRPG_Character_World_C_ArmRingEnableFeedbackType");
static_assert(sizeof(BP_jRPG_Character_World_C_ArmRingEnableFeedbackType) == 0x0000F8, "Wrong size on BP_jRPG_Character_World_C_ArmRingEnableFeedbackType");
static_assert(offsetof(BP_jRPG_Character_World_C_ArmRingEnableFeedbackType, CurrentFeedbackType) == 0x000000, "Member 'BP_jRPG_Character_World_C_ArmRingEnableFeedbackType::CurrentFeedbackType' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Character_World_C_ArmRingEnableFeedbackType, CurrentColor) == 0x000004, "Member 'BP_jRPG_Character_World_C_ArmRingEnableFeedbackType::CurrentColor' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Character_World_C_ArmRingEnableFeedbackType, RotationRate) == 0x000018, "Member 'BP_jRPG_Character_World_C_ArmRingEnableFeedbackType::RotationRate' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Character_World_C_ArmRingEnableFeedbackType, Glow) == 0x000020, "Member 'BP_jRPG_Character_World_C_ArmRingEnableFeedbackType::Glow' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Character_World_C_ArmRingEnableFeedbackType, Temp_real_Variable) == 0x000028, "Member 'BP_jRPG_Character_World_C_ArmRingEnableFeedbackType::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Character_World_C_ArmRingEnableFeedbackType, K2Node_SwitchEnum_CmpSuccess) == 0x000030, "Member 'BP_jRPG_Character_World_C_ArmRingEnableFeedbackType::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Character_World_C_ArmRingEnableFeedbackType, Temp_real_Variable_1) == 0x000038, "Member 'BP_jRPG_Character_World_C_ArmRingEnableFeedbackType::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Character_World_C_ArmRingEnableFeedbackType, Temp_real_Variable_2) == 0x000040, "Member 'BP_jRPG_Character_World_C_ArmRingEnableFeedbackType::Temp_real_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Character_World_C_ArmRingEnableFeedbackType, Temp_byte_Variable) == 0x000048, "Member 'BP_jRPG_Character_World_C_ArmRingEnableFeedbackType::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Character_World_C_ArmRingEnableFeedbackType, Temp_real_Variable_3) == 0x000050, "Member 'BP_jRPG_Character_World_C_ArmRingEnableFeedbackType::Temp_real_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Character_World_C_ArmRingEnableFeedbackType, Temp_real_Variable_4) == 0x000058, "Member 'BP_jRPG_Character_World_C_ArmRingEnableFeedbackType::Temp_real_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Character_World_C_ArmRingEnableFeedbackType, Temp_real_Variable_5) == 0x000060, "Member 'BP_jRPG_Character_World_C_ArmRingEnableFeedbackType::Temp_real_Variable_5' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Character_World_C_ArmRingEnableFeedbackType, Temp_real_Variable_6) == 0x000068, "Member 'BP_jRPG_Character_World_C_ArmRingEnableFeedbackType::Temp_real_Variable_6' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Character_World_C_ArmRingEnableFeedbackType, Temp_byte_Variable_1) == 0x000070, "Member 'BP_jRPG_Character_World_C_ArmRingEnableFeedbackType::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Character_World_C_ArmRingEnableFeedbackType, K2Node_Select_Default) == 0x000078, "Member 'BP_jRPG_Character_World_C_ArmRingEnableFeedbackType::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Character_World_C_ArmRingEnableFeedbackType, Temp_struct_Variable) == 0x000080, "Member 'BP_jRPG_Character_World_C_ArmRingEnableFeedbackType::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Character_World_C_ArmRingEnableFeedbackType, Temp_struct_Variable_1) == 0x000090, "Member 'BP_jRPG_Character_World_C_ArmRingEnableFeedbackType::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Character_World_C_ArmRingEnableFeedbackType, Temp_struct_Variable_2) == 0x0000A0, "Member 'BP_jRPG_Character_World_C_ArmRingEnableFeedbackType::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Character_World_C_ArmRingEnableFeedbackType, Temp_struct_Variable_3) == 0x0000B0, "Member 'BP_jRPG_Character_World_C_ArmRingEnableFeedbackType::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Character_World_C_ArmRingEnableFeedbackType, Temp_real_Variable_7) == 0x0000C0, "Member 'BP_jRPG_Character_World_C_ArmRingEnableFeedbackType::Temp_real_Variable_7' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Character_World_C_ArmRingEnableFeedbackType, K2Node_Select_Default_1) == 0x0000C8, "Member 'BP_jRPG_Character_World_C_ArmRingEnableFeedbackType::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Character_World_C_ArmRingEnableFeedbackType, Temp_byte_Variable_2) == 0x0000D8, "Member 'BP_jRPG_Character_World_C_ArmRingEnableFeedbackType::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Character_World_C_ArmRingEnableFeedbackType, K2Node_Select_Default_2) == 0x0000E0, "Member 'BP_jRPG_Character_World_C_ArmRingEnableFeedbackType::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Character_World_C_ArmRingEnableFeedbackType, K2Node_DynamicCast_AsBP_Free_Aim_Camera) == 0x0000E8, "Member 'BP_jRPG_Character_World_C_ArmRingEnableFeedbackType::K2Node_DynamicCast_AsBP_Free_Aim_Camera' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Character_World_C_ArmRingEnableFeedbackType, K2Node_DynamicCast_bSuccess) == 0x0000F0, "Member 'BP_jRPG_Character_World_C_ArmRingEnableFeedbackType::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BP_jRPG_Character_World.BP_jRPG_Character_World_C.BindEventsToController
// 0x0030 (0x0030 - 0x0000)
struct BP_jRPG_Character_World_C_BindEventsToController final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* PreviousViewTarget, class AActor* CurrentViewTarget)> K2Node_CreateDelegate_OutputDelegate_2; // 0x0020(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_jRPG_Character_World_C_BindEventsToController) == 0x000004, "Wrong alignment on BP_jRPG_Character_World_C_BindEventsToController");
static_assert(sizeof(BP_jRPG_Character_World_C_BindEventsToController) == 0x000030, "Wrong size on BP_jRPG_Character_World_C_BindEventsToController");
static_assert(offsetof(BP_jRPG_Character_World_C_BindEventsToController, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'BP_jRPG_Character_World_C_BindEventsToController::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Character_World_C_BindEventsToController, K2Node_CreateDelegate_OutputDelegate_1) == 0x000010, "Member 'BP_jRPG_Character_World_C_BindEventsToController::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Character_World_C_BindEventsToController, K2Node_CreateDelegate_OutputDelegate_2) == 0x000020, "Member 'BP_jRPG_Character_World_C_BindEventsToController::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");

// Function BP_jRPG_Character_World.BP_jRPG_Character_World_C.BndEvt__BP_jRPG_Character_World_BP_CharacterSkinComponent_K2Node_ComponentBoundEvent_4_OnCharacterSkinChanged__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_jRPG_Character_World_C_BndEvt__BP_jRPG_Character_World_BP_CharacterSkinComponent_K2Node_ComponentBoundEvent_4_OnCharacterSkinChanged__DelegateSignature final
{
public:
	class UBP_CharacterSkinComponent_C*           SkinComponent;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_jRPG_Character_World_C_BndEvt__BP_jRPG_Character_World_BP_CharacterSkinComponent_K2Node_ComponentBoundEvent_4_OnCharacterSkinChanged__DelegateSignature) == 0x000008, "Wrong alignment on BP_jRPG_Character_World_C_BndEvt__BP_jRPG_Character_World_BP_CharacterSkinComponent_K2Node_ComponentBoundEvent_4_OnCharacterSkinChanged__DelegateSignature");
static_assert(sizeof(BP_jRPG_Character_World_C_BndEvt__BP_jRPG_Character_World_BP_CharacterSkinComponent_K2Node_ComponentBoundEvent_4_OnCharacterSkinChanged__DelegateSignature) == 0x000008, "Wrong size on BP_jRPG_Character_World_C_BndEvt__BP_jRPG_Character_World_BP_CharacterSkinComponent_K2Node_ComponentBoundEvent_4_OnCharacterSkinChanged__DelegateSignature");
static_assert(offsetof(BP_jRPG_Character_World_C_BndEvt__BP_jRPG_Character_World_BP_CharacterSkinComponent_K2Node_ComponentBoundEvent_4_OnCharacterSkinChanged__DelegateSignature, SkinComponent) == 0x000000, "Member 'BP_jRPG_Character_World_C_BndEvt__BP_jRPG_Character_World_BP_CharacterSkinComponent_K2Node_ComponentBoundEvent_4_OnCharacterSkinChanged__DelegateSignature::SkinComponent' has a wrong offset!");

// Function BP_jRPG_Character_World.BP_jRPG_Character_World_C.BndEvt__BP_jRPG_Character_World_MantleComponent_K2Node_ComponentBoundEvent_1_MantleStateChangedSignature__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct BP_jRPG_Character_World_C_BndEvt__BP_jRPG_Character_World_MantleComponent_K2Node_ComponentBoundEvent_1_MantleStateChangedSignature__DelegateSignature final
{
public:
	bool                                          State;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_jRPG_Character_World_C_BndEvt__BP_jRPG_Character_World_MantleComponent_K2Node_ComponentBoundEvent_1_MantleStateChangedSignature__DelegateSignature) == 0x000001, "Wrong alignment on BP_jRPG_Character_World_C_BndEvt__BP_jRPG_Character_World_MantleComponent_K2Node_ComponentBoundEvent_1_MantleStateChangedSignature__DelegateSignature");
static_assert(sizeof(BP_jRPG_Character_World_C_BndEvt__BP_jRPG_Character_World_MantleComponent_K2Node_ComponentBoundEvent_1_MantleStateChangedSignature__DelegateSignature) == 0x000001, "Wrong size on BP_jRPG_Character_World_C_BndEvt__BP_jRPG_Character_World_MantleComponent_K2Node_ComponentBoundEvent_1_MantleStateChangedSignature__DelegateSignature");
static_assert(offsetof(BP_jRPG_Character_World_C_BndEvt__BP_jRPG_Character_World_MantleComponent_K2Node_ComponentBoundEvent_1_MantleStateChangedSignature__DelegateSignature, State) == 0x000000, "Member 'BP_jRPG_Character_World_C_BndEvt__BP_jRPG_Character_World_MantleComponent_K2Node_ComponentBoundEvent_1_MantleStateChangedSignature__DelegateSignature::State' has a wrong offset!");

// Function BP_jRPG_Character_World.BP_jRPG_Character_World_C.BPI_GetAllDialogueCameras
// 0x0020 (0x0020 - 0x0000)
struct BP_jRPG_Character_World_C_BPI_GetAllDialogueCameras final
{
public:
	TArray<class UCineCameraComponent*>           CineCameraComponents;                              // 0x0000(0x0010)(Parm, OutParm, ContainsInstancedReference)
	TArray<class UCineCameraComponent*>           CallFunc_GetAllDialogueCameras_AllCameras;         // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(BP_jRPG_Character_World_C_BPI_GetAllDialogueCameras) == 0x000008, "Wrong alignment on BP_jRPG_Character_World_C_BPI_GetAllDialogueCameras");
static_assert(sizeof(BP_jRPG_Character_World_C_BPI_GetAllDialogueCameras) == 0x000020, "Wrong size on BP_jRPG_Character_World_C_BPI_GetAllDialogueCameras");
static_assert(offsetof(BP_jRPG_Character_World_C_BPI_GetAllDialogueCameras, CineCameraComponents) == 0x000000, "Member 'BP_jRPG_Character_World_C_BPI_GetAllDialogueCameras::CineCameraComponents' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Character_World_C_BPI_GetAllDialogueCameras, CallFunc_GetAllDialogueCameras_AllCameras) == 0x000010, "Member 'BP_jRPG_Character_World_C_BPI_GetAllDialogueCameras::CallFunc_GetAllDialogueCameras_AllCameras' has a wrong offset!");

// Function BP_jRPG_Character_World.BP_jRPG_Character_World_C.BPI_GetDialogueAudioComponent
// 0x0008 (0x0008 - 0x0000)
struct BP_jRPG_Character_World_C_BPI_GetDialogueAudioComponent final
{
public:
	class UAudioComponent*                        AudioComponent;                                    // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_jRPG_Character_World_C_BPI_GetDialogueAudioComponent) == 0x000008, "Wrong alignment on BP_jRPG_Character_World_C_BPI_GetDialogueAudioComponent");
static_assert(sizeof(BP_jRPG_Character_World_C_BPI_GetDialogueAudioComponent) == 0x000008, "Wrong size on BP_jRPG_Character_World_C_BPI_GetDialogueAudioComponent");
static_assert(offsetof(BP_jRPG_Character_World_C_BPI_GetDialogueAudioComponent, AudioComponent) == 0x000000, "Member 'BP_jRPG_Character_World_C_BPI_GetDialogueAudioComponent::AudioComponent' has a wrong offset!");

// Function BP_jRPG_Character_World.BP_jRPG_Character_World_C.BPI_GetDialogueCameraByType
// 0x0040 (0x0040 - 0x0000)
struct BP_jRPG_Character_World_C_BPI_GetDialogueCameraByType final
{
public:
	EDialogueCameraType                           CameraType;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCameraComponent*                       CameraComponent;                                   // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EDialogueCameraType                           Temp_byte_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCameraComponent*                       Temp_object_Variable;                              // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCameraComponent*                       Temp_object_Variable_1;                            // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCameraComponent*                       Temp_object_Variable_2;                            // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCameraComponent*                       Temp_object_Variable_3;                            // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCameraComponent*                       K2Node_Select_Default;                             // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_jRPG_Character_World_C_BPI_GetDialogueCameraByType) == 0x000008, "Wrong alignment on BP_jRPG_Character_World_C_BPI_GetDialogueCameraByType");
static_assert(sizeof(BP_jRPG_Character_World_C_BPI_GetDialogueCameraByType) == 0x000040, "Wrong size on BP_jRPG_Character_World_C_BPI_GetDialogueCameraByType");
static_assert(offsetof(BP_jRPG_Character_World_C_BPI_GetDialogueCameraByType, CameraType) == 0x000000, "Member 'BP_jRPG_Character_World_C_BPI_GetDialogueCameraByType::CameraType' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Character_World_C_BPI_GetDialogueCameraByType, CameraComponent) == 0x000008, "Member 'BP_jRPG_Character_World_C_BPI_GetDialogueCameraByType::CameraComponent' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Character_World_C_BPI_GetDialogueCameraByType, Temp_byte_Variable) == 0x000010, "Member 'BP_jRPG_Character_World_C_BPI_GetDialogueCameraByType::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Character_World_C_BPI_GetDialogueCameraByType, Temp_object_Variable) == 0x000018, "Member 'BP_jRPG_Character_World_C_BPI_GetDialogueCameraByType::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Character_World_C_BPI_GetDialogueCameraByType, Temp_object_Variable_1) == 0x000020, "Member 'BP_jRPG_Character_World_C_BPI_GetDialogueCameraByType::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Character_World_C_BPI_GetDialogueCameraByType, Temp_object_Variable_2) == 0x000028, "Member 'BP_jRPG_Character_World_C_BPI_GetDialogueCameraByType::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Character_World_C_BPI_GetDialogueCameraByType, Temp_object_Variable_3) == 0x000030, "Member 'BP_jRPG_Character_World_C_BPI_GetDialogueCameraByType::Temp_object_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Character_World_C_BPI_GetDialogueCameraByType, K2Node_Select_Default) == 0x000038, "Member 'BP_jRPG_Character_World_C_BPI_GetDialogueCameraByType::K2Node_Select_Default' has a wrong offset!");

// Function BP_jRPG_Character_World.BP_jRPG_Character_World_C.BPI_GetDialogueCameraOffset
// 0x0050 (0x0050 - 0x0000)
struct BP_jRPG_Character_World_C_BPI_GetDialogueCameraOffset final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetCurrentWorldCharacter_Found;           // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_jRPG_WorldCharacters                CallFunc_GetCurrentWorldCharacter_WorldCharacter;  // 0x0020(0x0030)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};
static_assert(alignof(BP_jRPG_Character_World_C_BPI_GetDialogueCameraOffset) == 0x000008, "Wrong alignment on BP_jRPG_Character_World_C_BPI_GetDialogueCameraOffset");
static_assert(sizeof(BP_jRPG_Character_World_C_BPI_GetDialogueCameraOffset) == 0x000050, "Wrong size on BP_jRPG_Character_World_C_BPI_GetDialogueCameraOffset");
static_assert(offsetof(BP_jRPG_Character_World_C_BPI_GetDialogueCameraOffset, ReturnValue) == 0x000000, "Member 'BP_jRPG_Character_World_C_BPI_GetDialogueCameraOffset::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Character_World_C_BPI_GetDialogueCameraOffset, CallFunc_GetCurrentWorldCharacter_Found) == 0x000018, "Member 'BP_jRPG_Character_World_C_BPI_GetDialogueCameraOffset::CallFunc_GetCurrentWorldCharacter_Found' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Character_World_C_BPI_GetDialogueCameraOffset, CallFunc_GetCurrentWorldCharacter_WorldCharacter) == 0x000020, "Member 'BP_jRPG_Character_World_C_BPI_GetDialogueCameraOffset::CallFunc_GetCurrentWorldCharacter_WorldCharacter' has a wrong offset!");

// Function BP_jRPG_Character_World.BP_jRPG_Character_World_C.BPI_GetDialogueFocusPoint
// 0x0008 (0x0008 - 0x0000)
struct BP_jRPG_Character_World_C_BPI_GetDialogueFocusPoint final
{
public:
	class USceneComponent*                        SceneComponent;                                    // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_jRPG_Character_World_C_BPI_GetDialogueFocusPoint) == 0x000008, "Wrong alignment on BP_jRPG_Character_World_C_BPI_GetDialogueFocusPoint");
static_assert(sizeof(BP_jRPG_Character_World_C_BPI_GetDialogueFocusPoint) == 0x000008, "Wrong size on BP_jRPG_Character_World_C_BPI_GetDialogueFocusPoint");
static_assert(offsetof(BP_jRPG_Character_World_C_BPI_GetDialogueFocusPoint, SceneComponent) == 0x000000, "Member 'BP_jRPG_Character_World_C_BPI_GetDialogueFocusPoint::SceneComponent' has a wrong offset!");

// Function BP_jRPG_Character_World.BP_jRPG_Character_World_C.BPI_GetInteractingCharacter
// 0x0010 (0x0010 - 0x0000)
struct BP_jRPG_Character_World_C_BPI_GetInteractingCharacter final
{
public:
	TScriptInterface<class IBPI_DialogueCharacter_C> ReturnValue;                                    // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_jRPG_Character_World_C_BPI_GetInteractingCharacter) == 0x000008, "Wrong alignment on BP_jRPG_Character_World_C_BPI_GetInteractingCharacter");
static_assert(sizeof(BP_jRPG_Character_World_C_BPI_GetInteractingCharacter) == 0x000010, "Wrong size on BP_jRPG_Character_World_C_BPI_GetInteractingCharacter");
static_assert(offsetof(BP_jRPG_Character_World_C_BPI_GetInteractingCharacter, ReturnValue) == 0x000000, "Member 'BP_jRPG_Character_World_C_BPI_GetInteractingCharacter::ReturnValue' has a wrong offset!");

// Function BP_jRPG_Character_World.BP_jRPG_Character_World_C.BPI_GetLightDirection
// 0x0001 (0x0001 - 0x0000)
struct BP_jRPG_Character_World_C_BPI_GetLightDirection final
{
public:
	E_NPC_SpolightTypes                           ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_jRPG_Character_World_C_BPI_GetLightDirection) == 0x000001, "Wrong alignment on BP_jRPG_Character_World_C_BPI_GetLightDirection");
static_assert(sizeof(BP_jRPG_Character_World_C_BPI_GetLightDirection) == 0x000001, "Wrong size on BP_jRPG_Character_World_C_BPI_GetLightDirection");
static_assert(offsetof(BP_jRPG_Character_World_C_BPI_GetLightDirection, ReturnValue) == 0x000000, "Member 'BP_jRPG_Character_World_C_BPI_GetLightDirection::ReturnValue' has a wrong offset!");

// Function BP_jRPG_Character_World.BP_jRPG_Character_World_C.BPI_GetLightingSet
// 0x0048 (0x0048 - 0x0000)
struct BP_jRPG_Character_World_C_BPI_GetLightingSet final
{
public:
	E_NPC_SpolightTypes                           LightDirection;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULightComponent*                        FrontLight;                                        // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ULightComponent*                        RimLight;                                          // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	E_NPC_SpolightTypes                           Temp_byte_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULightComponent*                        Temp_object_Variable;                              // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	E_NPC_SpolightTypes                           Temp_byte_Variable_1;                              // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULightComponent*                        Temp_object_Variable_1;                            // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ULightComponent*                        K2Node_Select_Default;                             // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ULightComponent*                        K2Node_Select_Default_1;                           // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_jRPG_Character_World_C_BPI_GetLightingSet) == 0x000008, "Wrong alignment on BP_jRPG_Character_World_C_BPI_GetLightingSet");
static_assert(sizeof(BP_jRPG_Character_World_C_BPI_GetLightingSet) == 0x000048, "Wrong size on BP_jRPG_Character_World_C_BPI_GetLightingSet");
static_assert(offsetof(BP_jRPG_Character_World_C_BPI_GetLightingSet, LightDirection) == 0x000000, "Member 'BP_jRPG_Character_World_C_BPI_GetLightingSet::LightDirection' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Character_World_C_BPI_GetLightingSet, FrontLight) == 0x000008, "Member 'BP_jRPG_Character_World_C_BPI_GetLightingSet::FrontLight' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Character_World_C_BPI_GetLightingSet, RimLight) == 0x000010, "Member 'BP_jRPG_Character_World_C_BPI_GetLightingSet::RimLight' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Character_World_C_BPI_GetLightingSet, Temp_byte_Variable) == 0x000018, "Member 'BP_jRPG_Character_World_C_BPI_GetLightingSet::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Character_World_C_BPI_GetLightingSet, Temp_object_Variable) == 0x000020, "Member 'BP_jRPG_Character_World_C_BPI_GetLightingSet::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Character_World_C_BPI_GetLightingSet, Temp_byte_Variable_1) == 0x000028, "Member 'BP_jRPG_Character_World_C_BPI_GetLightingSet::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Character_World_C_BPI_GetLightingSet, Temp_object_Variable_1) == 0x000030, "Member 'BP_jRPG_Character_World_C_BPI_GetLightingSet::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Character_World_C_BPI_GetLightingSet, K2Node_Select_Default) == 0x000038, "Member 'BP_jRPG_Character_World_C_BPI_GetLightingSet::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Character_World_C_BPI_GetLightingSet, K2Node_Select_Default_1) == 0x000040, "Member 'BP_jRPG_Character_World_C_BPI_GetLightingSet::K2Node_Select_Default_1' has a wrong offset!");

// Function BP_jRPG_Character_World.BP_jRPG_Character_World_C.BPI_GetReverseSpotlightReceiver
// 0x0010 (0x0010 - 0x0000)
struct BP_jRPG_Character_World_C_BPI_GetReverseSpotlightReceiver final
{
public:
	TScriptInterface<class IBPI_DialogueCharacter_C> ReturnValue;                                    // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_jRPG_Character_World_C_BPI_GetReverseSpotlightReceiver) == 0x000008, "Wrong alignment on BP_jRPG_Character_World_C_BPI_GetReverseSpotlightReceiver");
static_assert(sizeof(BP_jRPG_Character_World_C_BPI_GetReverseSpotlightReceiver) == 0x000010, "Wrong size on BP_jRPG_Character_World_C_BPI_GetReverseSpotlightReceiver");
static_assert(offsetof(BP_jRPG_Character_World_C_BPI_GetReverseSpotlightReceiver, ReturnValue) == 0x000000, "Member 'BP_jRPG_Character_World_C_BPI_GetReverseSpotlightReceiver::ReturnValue' has a wrong offset!");

// Function BP_jRPG_Character_World.BP_jRPG_Character_World_C.BPI_GetSpotlightsToActivateDuringDialogue
// 0x0010 (0x0010 - 0x0000)
struct BP_jRPG_Character_World_C_BPI_GetSpotlightsToActivateDuringDialogue final
{
public:
	TArray<TSoftObjectPtr<class ASpotLight>>      SpotLightActors;                                   // 0x0000(0x0010)(Parm, OutParm)
};
static_assert(alignof(BP_jRPG_Character_World_C_BPI_GetSpotlightsToActivateDuringDialogue) == 0x000008, "Wrong alignment on BP_jRPG_Character_World_C_BPI_GetSpotlightsToActivateDuringDialogue");
static_assert(sizeof(BP_jRPG_Character_World_C_BPI_GetSpotlightsToActivateDuringDialogue) == 0x000010, "Wrong size on BP_jRPG_Character_World_C_BPI_GetSpotlightsToActivateDuringDialogue");
static_assert(offsetof(BP_jRPG_Character_World_C_BPI_GetSpotlightsToActivateDuringDialogue, SpotLightActors) == 0x000000, "Member 'BP_jRPG_Character_World_C_BPI_GetSpotlightsToActivateDuringDialogue::SpotLightActors' has a wrong offset!");

// Function BP_jRPG_Character_World.BP_jRPG_Character_World_C.BPI_HasLightingAuthority
// 0x0001 (0x0001 - 0x0000)
struct BP_jRPG_Character_World_C_BPI_HasLightingAuthority final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_jRPG_Character_World_C_BPI_HasLightingAuthority) == 0x000001, "Wrong alignment on BP_jRPG_Character_World_C_BPI_HasLightingAuthority");
static_assert(sizeof(BP_jRPG_Character_World_C_BPI_HasLightingAuthority) == 0x000001, "Wrong size on BP_jRPG_Character_World_C_BPI_HasLightingAuthority");
static_assert(offsetof(BP_jRPG_Character_World_C_BPI_HasLightingAuthority, ReturnValue) == 0x000000, "Member 'BP_jRPG_Character_World_C_BPI_HasLightingAuthority::ReturnValue' has a wrong offset!");

// Function BP_jRPG_Character_World.BP_jRPG_Character_World_C.BPI_ShouldMoveCameraPresetsToOtherSide
// 0x0001 (0x0001 - 0x0000)
struct BP_jRPG_Character_World_C_BPI_ShouldMoveCameraPresetsToOtherSide final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_jRPG_Character_World_C_BPI_ShouldMoveCameraPresetsToOtherSide) == 0x000001, "Wrong alignment on BP_jRPG_Character_World_C_BPI_ShouldMoveCameraPresetsToOtherSide");
static_assert(sizeof(BP_jRPG_Character_World_C_BPI_ShouldMoveCameraPresetsToOtherSide) == 0x000001, "Wrong size on BP_jRPG_Character_World_C_BPI_ShouldMoveCameraPresetsToOtherSide");
static_assert(offsetof(BP_jRPG_Character_World_C_BPI_ShouldMoveCameraPresetsToOtherSide, ReturnValue) == 0x000000, "Member 'BP_jRPG_Character_World_C_BPI_ShouldMoveCameraPresetsToOtherSide::ReturnValue' has a wrong offset!");

// Function BP_jRPG_Character_World.BP_jRPG_Character_World_C.CameraToBasePosition
// 0x0004 (0x0004 - 0x0000)
struct BP_jRPG_Character_World_C_CameraToBasePosition final
{
public:
	float                                         OverTime;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_jRPG_Character_World_C_CameraToBasePosition) == 0x000004, "Wrong alignment on BP_jRPG_Character_World_C_CameraToBasePosition");
static_assert(sizeof(BP_jRPG_Character_World_C_CameraToBasePosition) == 0x000004, "Wrong size on BP_jRPG_Character_World_C_CameraToBasePosition");
static_assert(offsetof(BP_jRPG_Character_World_C_CameraToBasePosition, OverTime) == 0x000000, "Member 'BP_jRPG_Character_World_C_CameraToBasePosition::OverTime' has a wrong offset!");

// Function BP_jRPG_Character_World.BP_jRPG_Character_World_C.CameraToPosition
// 0x0020 (0x0020 - 0x0000)
struct BP_jRPG_Character_World_C_CameraToPosition final
{
public:
	struct FVector                                TargetRelativeLocation;                            // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OverTime;                                          // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_jRPG_Character_World_C_CameraToPosition) == 0x000008, "Wrong alignment on BP_jRPG_Character_World_C_CameraToPosition");
static_assert(sizeof(BP_jRPG_Character_World_C_CameraToPosition) == 0x000020, "Wrong size on BP_jRPG_Character_World_C_CameraToPosition");
static_assert(offsetof(BP_jRPG_Character_World_C_CameraToPosition, TargetRelativeLocation) == 0x000000, "Member 'BP_jRPG_Character_World_C_CameraToPosition::TargetRelativeLocation' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Character_World_C_CameraToPosition, OverTime) == 0x000018, "Member 'BP_jRPG_Character_World_C_CameraToPosition::OverTime' has a wrong offset!");

// Function BP_jRPG_Character_World.BP_jRPG_Character_World_C.CanAddMovementInput
// 0x0018 (0x0018 - 0x0000)
struct BP_jRPG_Character_World_C_CanAddMovementInput final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_InputLockComponent_C*               CallFunc_GetInputLockSystem_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMovementInputLocked_ReturnValue;        // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_jRPG_Character_World_C_CanAddMovementInput) == 0x000008, "Wrong alignment on BP_jRPG_Character_World_C_CanAddMovementInput");
static_assert(sizeof(BP_jRPG_Character_World_C_CanAddMovementInput) == 0x000018, "Wrong size on BP_jRPG_Character_World_C_CanAddMovementInput");
static_assert(offsetof(BP_jRPG_Character_World_C_CanAddMovementInput, ReturnValue) == 0x000000, "Member 'BP_jRPG_Character_World_C_CanAddMovementInput::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Character_World_C_CanAddMovementInput, CallFunc_GetInputLockSystem_ReturnValue) == 0x000008, "Member 'BP_jRPG_Character_World_C_CanAddMovementInput::CallFunc_GetInputLockSystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Character_World_C_CanAddMovementInput, CallFunc_IsMovementInputLocked_ReturnValue) == 0x000010, "Member 'BP_jRPG_Character_World_C_CanAddMovementInput::CallFunc_IsMovementInputLocked_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Character_World_C_CanAddMovementInput, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000011, "Member 'BP_jRPG_Character_World_C_CanAddMovementInput::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Character_World_C_CanAddMovementInput, CallFunc_Not_PreBool_ReturnValue) == 0x000012, "Member 'BP_jRPG_Character_World_C_CanAddMovementInput::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Character_World_C_CanAddMovementInput, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000013, "Member 'BP_jRPG_Character_World_C_CanAddMovementInput::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Character_World_C_CanAddMovementInput, CallFunc_BooleanOR_ReturnValue) == 0x000014, "Member 'BP_jRPG_Character_World_C_CanAddMovementInput::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Character_World_C_CanAddMovementInput, CallFunc_BooleanAND_ReturnValue) == 0x000015, "Member 'BP_jRPG_Character_World_C_CanAddMovementInput::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BP_jRPG_Character_World.BP_jRPG_Character_World_C.CanBeDetectedByEnemies
// 0x0018 (0x0018 - 0x0000)
struct BP_jRPG_Character_World_C_CanBeDetectedByEnemies final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_CinematicSystem_C*                  CallFunc_GetCinematicsSystem_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_jRPG_Character_World_C_CanBeDetectedByEnemies) == 0x000008, "Wrong alignment on BP_jRPG_Character_World_C_CanBeDetectedByEnemies");
