#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_jRPG_SavePointDialog

#include "Basic.hpp"

#include "SandFall_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_jRPG_SavePointDialog.BP_jRPG_SavePointDialog_C
// 0x00A0 (0x0330 - 0x0290)
class ABP_jRPG_SavePointDialog_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USphereComponent*                       InteractionRange;                                  // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCustomNavModifierComponent*            CustomNavModifier;                                 // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Icelandic_Lava_Spire_LOD0_sjbrG;                   // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Icelandic_Lava_Spire_LOD0_sjbrG1;                  // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Flag_Pole;                                         // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Scene;                                             // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      FX_SavePoint1;                                     // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        AC_Flag;                                           // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        AC_Pole;                                           // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCineCameraComponent*                   CineCamera_Resting;                                // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Flag_Flag;                                         // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           SpawnPointTag;                                     // 0x02F0(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	bool                                          Activated;                                         // 0x02F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F9[0x7];                                      // 0x02F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Brightness;                                        // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSF_ReferenceCounterHandle             SaveBlocker_SavePoint;                             // 0x0308(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         Number;                                            // 0x0328(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__BP_jRPG_SavePointDialog_InteractionRange_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void BndEvt__BP_jRPG_SavePointDialog_InteractionRange_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void CanInteractWithMount(bool* CanInteract);
	bool CheckForErrors(TArray<class FText>& ErrorMessages);
	void ExecuteUbergraph_BP_jRPG_SavePointDialog(int32 EntryPoint);
	bool FindDuplicateID();
	void GetInteractionPromptParams(struct FFPromptParams* PromptParams);
	void IsInteractionAvailable(bool* Available);
	void IsInteractionDone(bool* Done);
	void OnEnemyBattleStateLoaded(bool BattleState);
	void OnInteractionDisabled();
	void OnInteractionEnabled();
	void OnInteractionRequested(class ABP_jRPG_Character_World_C* InteractingWorldCharacter, bool Instant);
	void OnObjectInteractionStateLoaded(bool InteractionState);
	void OnSavePointFadeOutFinished();
	void OnSavePointMenuClosed(class UWBP_SavePointMenu_C* SavePointMenu);
	void ReceiveBeginPlay();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	bool ShouldHideDistantInteraction();
	void ShowFlagIfActivated();
	void UserConstructionScript();

	bool Editor_DrawDebugShapes() const;
	bool Editor_GetDebugShapes(TArray<struct FEditorDebugShape_Arrow>& Arrows, TArray<struct FEditorDebugShape_Arrow>& Lines) const;
	void GetInteractionFeedbackLocation(struct FVector* Location) const;
	void GetInteractionLocation(struct FVector* Location) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_jRPG_SavePointDialog_C">();
	}
	static class ABP_jRPG_SavePointDialog_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_jRPG_SavePointDialog_C>();
	}
};
static_assert(alignof(ABP_jRPG_SavePointDialog_C) == 0x000008, "Wrong alignment on ABP_jRPG_SavePointDialog_C");
static_assert(sizeof(ABP_jRPG_SavePointDialog_C) == 0x000330, "Wrong size on ABP_jRPG_SavePointDialog_C");
static_assert(offsetof(ABP_jRPG_SavePointDialog_C, UberGraphFrame) == 0x000290, "Member 'ABP_jRPG_SavePointDialog_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_jRPG_SavePointDialog_C, InteractionRange) == 0x000298, "Member 'ABP_jRPG_SavePointDialog_C::InteractionRange' has a wrong offset!");
static_assert(offsetof(ABP_jRPG_SavePointDialog_C, CustomNavModifier) == 0x0002A0, "Member 'ABP_jRPG_SavePointDialog_C::CustomNavModifier' has a wrong offset!");
static_assert(offsetof(ABP_jRPG_SavePointDialog_C, Icelandic_Lava_Spire_LOD0_sjbrG) == 0x0002A8, "Member 'ABP_jRPG_SavePointDialog_C::Icelandic_Lava_Spire_LOD0_sjbrG' has a wrong offset!");
static_assert(offsetof(ABP_jRPG_SavePointDialog_C, Icelandic_Lava_Spire_LOD0_sjbrG1) == 0x0002B0, "Member 'ABP_jRPG_SavePointDialog_C::Icelandic_Lava_Spire_LOD0_sjbrG1' has a wrong offset!");
static_assert(offsetof(ABP_jRPG_SavePointDialog_C, Flag_Pole) == 0x0002B8, "Member 'ABP_jRPG_SavePointDialog_C::Flag_Pole' has a wrong offset!");
static_assert(offsetof(ABP_jRPG_SavePointDialog_C, Scene) == 0x0002C0, "Member 'ABP_jRPG_SavePointDialog_C::Scene' has a wrong offset!");
static_assert(offsetof(ABP_jRPG_SavePointDialog_C, FX_SavePoint1) == 0x0002C8, "Member 'ABP_jRPG_SavePointDialog_C::FX_SavePoint1' has a wrong offset!");
static_assert(offsetof(ABP_jRPG_SavePointDialog_C, AC_Flag) == 0x0002D0, "Member 'ABP_jRPG_SavePointDialog_C::AC_Flag' has a wrong offset!");
static_assert(offsetof(ABP_jRPG_SavePointDialog_C, AC_Pole) == 0x0002D8, "Member 'ABP_jRPG_SavePointDialog_C::AC_Pole' has a wrong offset!");
static_assert(offsetof(ABP_jRPG_SavePointDialog_C, CineCamera_Resting) == 0x0002E0, "Member 'ABP_jRPG_SavePointDialog_C::CineCamera_Resting' has a wrong offset!");
static_assert(offsetof(ABP_jRPG_SavePointDialog_C, Flag_Flag) == 0x0002E8, "Member 'ABP_jRPG_SavePointDialog_C::Flag_Flag' has a wrong offset!");
static_assert(offsetof(ABP_jRPG_SavePointDialog_C, SpawnPointTag) == 0x0002F0, "Member 'ABP_jRPG_SavePointDialog_C::SpawnPointTag' has a wrong offset!");
static_assert(offsetof(ABP_jRPG_SavePointDialog_C, Activated) == 0x0002F8, "Member 'ABP_jRPG_SavePointDialog_C::Activated' has a wrong offset!");
static_assert(offsetof(ABP_jRPG_SavePointDialog_C, Brightness) == 0x000300, "Member 'ABP_jRPG_SavePointDialog_C::Brightness' has a wrong offset!");
static_assert(offsetof(ABP_jRPG_SavePointDialog_C, SaveBlocker_SavePoint) == 0x000308, "Member 'ABP_jRPG_SavePointDialog_C::SaveBlocker_SavePoint' has a wrong offset!");
static_assert(offsetof(ABP_jRPG_SavePointDialog_C, Number) == 0x000328, "Member 'ABP_jRPG_SavePointDialog_C::Number' has a wrong offset!");

}

