#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_jRPG_SavePointDialog

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "FPromptParams_structs.hpp"
#include "Engine_structs.hpp"
#include "SandFall_structs.hpp"
#include "FLevelDataEntry_structs.hpp"


namespace SDK::Params
{

// Function BP_jRPG_SavePointDialog.BP_jRPG_SavePointDialog_C.BndEvt__BP_jRPG_SavePointDialog_InteractionRange_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
// 0x0118 (0x0118 - 0x0000)
struct BP_jRPG_SavePointDialog_C_BndEvt__BP_jRPG_SavePointDialog_InteractionRange_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x00F8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_jRPG_SavePointDialog_C_BndEvt__BP_jRPG_SavePointDialog_InteractionRange_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_jRPG_SavePointDialog_C_BndEvt__BP_jRPG_SavePointDialog_InteractionRange_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_jRPG_SavePointDialog_C_BndEvt__BP_jRPG_SavePointDialog_InteractionRange_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000118, "Wrong size on BP_jRPG_SavePointDialog_C_BndEvt__BP_jRPG_SavePointDialog_InteractionRange_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_jRPG_SavePointDialog_C_BndEvt__BP_jRPG_SavePointDialog_InteractionRange_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_jRPG_SavePointDialog_C_BndEvt__BP_jRPG_SavePointDialog_InteractionRange_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_jRPG_SavePointDialog_C_BndEvt__BP_jRPG_SavePointDialog_InteractionRange_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_jRPG_SavePointDialog_C_BndEvt__BP_jRPG_SavePointDialog_InteractionRange_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_jRPG_SavePointDialog_C_BndEvt__BP_jRPG_SavePointDialog_InteractionRange_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_jRPG_SavePointDialog_C_BndEvt__BP_jRPG_SavePointDialog_InteractionRange_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_jRPG_SavePointDialog_C_BndEvt__BP_jRPG_SavePointDialog_InteractionRange_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_jRPG_SavePointDialog_C_BndEvt__BP_jRPG_SavePointDialog_InteractionRange_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_jRPG_SavePointDialog_C_BndEvt__BP_jRPG_SavePointDialog_InteractionRange_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'BP_jRPG_SavePointDialog_C_BndEvt__BP_jRPG_SavePointDialog_InteractionRange_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_jRPG_SavePointDialog_C_BndEvt__BP_jRPG_SavePointDialog_InteractionRange_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'BP_jRPG_SavePointDialog_C_BndEvt__BP_jRPG_SavePointDialog_InteractionRange_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function BP_jRPG_SavePointDialog.BP_jRPG_SavePointDialog_C.BndEvt__BP_jRPG_SavePointDialog_InteractionRange_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct BP_jRPG_SavePointDialog_C_BndEvt__BP_jRPG_SavePointDialog_InteractionRange_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_jRPG_SavePointDialog_C_BndEvt__BP_jRPG_SavePointDialog_InteractionRange_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_jRPG_SavePointDialog_C_BndEvt__BP_jRPG_SavePointDialog_InteractionRange_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_jRPG_SavePointDialog_C_BndEvt__BP_jRPG_SavePointDialog_InteractionRange_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature) == 0x000020, "Wrong size on BP_jRPG_SavePointDialog_C_BndEvt__BP_jRPG_SavePointDialog_InteractionRange_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_jRPG_SavePointDialog_C_BndEvt__BP_jRPG_SavePointDialog_InteractionRange_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_jRPG_SavePointDialog_C_BndEvt__BP_jRPG_SavePointDialog_InteractionRange_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_jRPG_SavePointDialog_C_BndEvt__BP_jRPG_SavePointDialog_InteractionRange_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_jRPG_SavePointDialog_C_BndEvt__BP_jRPG_SavePointDialog_InteractionRange_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_jRPG_SavePointDialog_C_BndEvt__BP_jRPG_SavePointDialog_InteractionRange_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_jRPG_SavePointDialog_C_BndEvt__BP_jRPG_SavePointDialog_InteractionRange_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_jRPG_SavePointDialog_C_BndEvt__BP_jRPG_SavePointDialog_InteractionRange_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_jRPG_SavePointDialog_C_BndEvt__BP_jRPG_SavePointDialog_InteractionRange_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");

// Function BP_jRPG_SavePointDialog.BP_jRPG_SavePointDialog_C.CanInteractWithMount
// 0x0001 (0x0001 - 0x0000)
struct BP_jRPG_SavePointDialog_C_CanInteractWithMount final
{
public:
	bool                                          CanInteract;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_jRPG_SavePointDialog_C_CanInteractWithMount) == 0x000001, "Wrong alignment on BP_jRPG_SavePointDialog_C_CanInteractWithMount");
static_assert(sizeof(BP_jRPG_SavePointDialog_C_CanInteractWithMount) == 0x000001, "Wrong size on BP_jRPG_SavePointDialog_C_CanInteractWithMount");
static_assert(offsetof(BP_jRPG_SavePointDialog_C_CanInteractWithMount, CanInteract) == 0x000000, "Member 'BP_jRPG_SavePointDialog_C_CanInteractWithMount::CanInteract' has a wrong offset!");

// Function BP_jRPG_SavePointDialog.BP_jRPG_SavePointDialog_C.CheckForErrors
// 0x06D8 (0x06D8 - 0x0000)
struct BP_jRPG_SavePointDialog_C_CheckForErrors final
{
public:
	TArray<class FText>                           ErrorMessages;                                     // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0018(0x0048)(HasGetValueTypeHash)
	class FText                                   Temp_text_Variable;                                // 0x0060(0x0010)(ConstParm)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0070(0x0048)(HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_1;                              // 0x00C0(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x00D0(0x0048)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x0118(0x0048)(HasGetValueTypeHash)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0160(0x0010)()
	class FText                                   Temp_text_Variable_2;                              // 0x0170(0x0010)()
	class FString                                 CallFunc_GetDebugStringFromGameplayTag_ReturnValue; // 0x0180(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class ABP_jRPG_MapSpawnPoint_C*               CallFunc_FindMapSpawnPointWithTag_SpawnPoint;      // 0x0190(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0198(0x0010)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A9[0x7];                                      // 0x01A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_4;            // 0x01B0(0x0048)(HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F9[0x7];                                      // 0x01F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0200(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0210(0x0010)()
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGameplayTagValid_ReturnValue;           // 0x0224(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0225(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_226[0x2];                                      // 0x0226(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0228(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22C[0x4];                                      // 0x022C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_3;                              // 0x0230(0x0010)()
	class FString                                 CallFunc_GetDebugStringFromGameplayTag_ReturnValue_1; // 0x0240(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0250(0x0010)()
	bool                                          Temp_bool_Variable;                                // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_261[0x7];                                      // 0x0261(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_5;            // 0x0268(0x0048)(HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue_1;            // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_1;        // 0x02C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x02C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C3[0x1];                                      // 0x02C3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x02C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x02C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2CA[0x6];                                      // 0x02CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x02D0(0x0010)()
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x02E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E4[0x4];                                      // 0x02E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_6;            // 0x02E8(0x0048)(HasGetValueTypeHash)
	TArray<class ABP_jRPG_MapSpawnPoint_C*>       CallFunc_GetAllActorsOfClass_OutActors;            // 0x0330(0x0010)(ReferenceParm)
	class FString                                 CallFunc_GetCurrentLevelName_ReturnValue;          // 0x0340(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class ABP_jRPG_MapSpawnPoint_C*               CallFunc_Array_Get_Item;                           // 0x0350(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetBaseFilename_ReturnValue;              // 0x0358(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDebugString_ReturnValue;               // 0x0368(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_2;          // 0x0378(0x0010)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_3;          // 0x0388(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_7;            // 0x0398(0x0048)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_8;            // 0x03E0(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0428(0x0010)(ReferenceParm)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_2;                          // 0x0438(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0448(0x0010)()
	class FText                                   CallFunc_Format_ReturnValue_2;                     // 0x0458(0x0010)()
	int32                                         CallFunc_Array_Add_ReturnValue_2;                  // 0x0468(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_46C[0x4];                                      // 0x046C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_4;          // 0x0470(0x0010)()
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0480(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_9;            // 0x0488(0x0048)(HasGetValueTypeHash)
	bool                                          CallFunc_GetLevelData_Found;                       // 0x04D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D1[0x7];                                      // 0x04D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFLevelDataEntry                       CallFunc_GetLevelData_LevelData;                   // 0x04D8(0x01B0)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_3;                          // 0x0688(0x0010)(ReferenceParm)
	class FText                                   CallFunc_FindSubAreaName_Name;                     // 0x0698(0x0010)()
	bool                                          CallFunc_FindSubAreaName_Found;                    // 0x06A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A9[0x7];                                      // 0x06A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue_3;                     // 0x06B0(0x0010)()
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x06C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C1[0x3];                                      // 0x06C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue_3;                  // 0x06C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x06C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C9[0x3];                                      // 0x06C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x06CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x06D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_jRPG_SavePointDialog_C_CheckForErrors) == 0x000008, "Wrong alignment on BP_jRPG_SavePointDialog_C_CheckForErrors");
static_assert(sizeof(BP_jRPG_SavePointDialog_C_CheckForErrors) == 0x0006D8, "Wrong size on BP_jRPG_SavePointDialog_C_CheckForErrors");
static_assert(offsetof(BP_jRPG_SavePointDialog_C_CheckForErrors, ErrorMessages) == 0x000000, "Member 'BP_jRPG_SavePointDialog_C_CheckForErrors::ErrorMessages' has a wrong offset!");
static_assert(offsetof(BP_jRPG_SavePointDialog_C_CheckForErrors, ReturnValue) == 0x000010, "Member 'BP_jRPG_SavePointDialog_C_CheckForErrors::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_SavePointDialog_C_CheckForErrors, K2Node_MakeStruct_FormatArgumentData) == 0x000018, "Member 'BP_jRPG_SavePointDialog_C_CheckForErrors::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_jRPG_SavePointDialog_C_CheckForErrors, Temp_text_Variable) == 0x000060, "Member 'BP_jRPG_SavePointDialog_C_CheckForErrors::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(BP_jRPG_SavePointDialog_C_CheckForErrors, K2Node_MakeStruct_FormatArgumentData_1) == 0x000070, "Member 'BP_jRPG_SavePointDialog_C_CheckForErrors::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BP_jRPG_SavePointDialog_C_CheckForErrors, Temp_int_Array_Index_Variable) == 0x0000B8, "Member 'BP_jRPG_SavePointDialog_C_CheckForErrors::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_jRPG_SavePointDialog_C_CheckForErrors, Temp_text_Variable_1) == 0x0000C0, "Member 'BP_jRPG_SavePointDialog_C_CheckForErrors::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_jRPG_SavePointDialog_C_CheckForErrors, K2Node_MakeStruct_FormatArgumentData_2) == 0x0000D0, "Member 'BP_jRPG_SavePointDialog_C_CheckForErrors::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(BP_jRPG_SavePointDialog_C_CheckForErrors, K2Node_MakeStruct_FormatArgumentData_3) == 0x000118, "Member 'BP_jRPG_SavePointDialog_C_CheckForErrors::K2Node_MakeStruct_FormatArgumentData_3' has a wrong offset!");
static_assert(offsetof(BP_jRPG_SavePointDialog_C_CheckForErrors, CallFunc_MakeLiteralText_ReturnValue) == 0x000160, "Member 'BP_jRPG_SavePointDialog_C_CheckForErrors::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_SavePointDialog_C_CheckForErrors, Temp_text_Variable_2) == 0x000170, "Member 'BP_jRPG_SavePointDialog_C_CheckForErrors::Temp_text_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_jRPG_SavePointDialog_C_CheckForErrors, CallFunc_GetDebugStringFromGameplayTag_ReturnValue) == 0x000180, "Member 'BP_jRPG_SavePointDialog_C_CheckForErrors::CallFunc_GetDebugStringFromGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_SavePointDialog_C_CheckForErrors, CallFunc_FindMapSpawnPointWithTag_SpawnPoint) == 0x000190, "Member 'BP_jRPG_SavePointDialog_C_CheckForErrors::CallFunc_FindMapSpawnPointWithTag_SpawnPoint' has a wrong offset!");
static_assert(offsetof(BP_jRPG_SavePointDialog_C_CheckForErrors, CallFunc_Conv_StringToText_ReturnValue) == 0x000198, "Member 'BP_jRPG_SavePointDialog_C_CheckForErrors::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_SavePointDialog_C_CheckForErrors, CallFunc_IsValid_ReturnValue) == 0x0001A8, "Member 'BP_jRPG_SavePointDialog_C_CheckForErrors::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_SavePointDialog_C_CheckForErrors, K2Node_MakeStruct_FormatArgumentData_4) == 0x0001B0, "Member 'BP_jRPG_SavePointDialog_C_CheckForErrors::K2Node_MakeStruct_FormatArgumentData_4' has a wrong offset!");
static_assert(offsetof(BP_jRPG_SavePointDialog_C_CheckForErrors, CallFunc_Not_PreBool_ReturnValue) == 0x0001F8, "Member 'BP_jRPG_SavePointDialog_C_CheckForErrors::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_SavePointDialog_C_CheckForErrors, K2Node_MakeArray_Array) == 0x000200, "Member 'BP_jRPG_SavePointDialog_C_CheckForErrors::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_jRPG_SavePointDialog_C_CheckForErrors, CallFunc_Format_ReturnValue) == 0x000210, "Member 'BP_jRPG_SavePointDialog_C_CheckForErrors::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_SavePointDialog_C_CheckForErrors, CallFunc_Array_Add_ReturnValue) == 0x000220, "Member 'BP_jRPG_SavePointDialog_C_CheckForErrors::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_SavePointDialog_C_CheckForErrors, CallFunc_IsGameplayTagValid_ReturnValue) == 0x000224, "Member 'BP_jRPG_SavePointDialog_C_CheckForErrors::CallFunc_IsGameplayTagValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_SavePointDialog_C_CheckForErrors, CallFunc_Not_PreBool_ReturnValue_1) == 0x000225, "Member 'BP_jRPG_SavePointDialog_C_CheckForErrors::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_jRPG_SavePointDialog_C_CheckForErrors, CallFunc_Array_Add_ReturnValue_1) == 0x000228, "Member 'BP_jRPG_SavePointDialog_C_CheckForErrors::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_jRPG_SavePointDialog_C_CheckForErrors, Temp_text_Variable_3) == 0x000230, "Member 'BP_jRPG_SavePointDialog_C_CheckForErrors::Temp_text_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_jRPG_SavePointDialog_C_CheckForErrors, CallFunc_GetDebugStringFromGameplayTag_ReturnValue_1) == 0x000240, "Member 'BP_jRPG_SavePointDialog_C_CheckForErrors::CallFunc_GetDebugStringFromGameplayTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_jRPG_SavePointDialog_C_CheckForErrors, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000250, "Member 'BP_jRPG_SavePointDialog_C_CheckForErrors::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_jRPG_SavePointDialog_C_CheckForErrors, Temp_bool_Variable) == 0x000260, "Member 'BP_jRPG_SavePointDialog_C_CheckForErrors::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_jRPG_SavePointDialog_C_CheckForErrors, K2Node_MakeStruct_FormatArgumentData_5) == 0x000268, "Member 'BP_jRPG_SavePointDialog_C_CheckForErrors::K2Node_MakeStruct_FormatArgumentData_5' has a wrong offset!");
static_assert(offsetof(BP_jRPG_SavePointDialog_C_CheckForErrors, CallFunc_MakeLiteralName_ReturnValue) == 0x0002B0, "Member 'BP_jRPG_SavePointDialog_C_CheckForErrors::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_SavePointDialog_C_CheckForErrors, CallFunc_MakeLiteralName_ReturnValue_1) == 0x0002B8, "Member 'BP_jRPG_SavePointDialog_C_CheckForErrors::CallFunc_MakeLiteralName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_jRPG_SavePointDialog_C_CheckForErrors, CallFunc_EqualEqual_NameName_ReturnValue) == 0x0002C0, "Member 'BP_jRPG_SavePointDialog_C_CheckForErrors::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_SavePointDialog_C_CheckForErrors, CallFunc_EqualEqual_NameName_ReturnValue_1) == 0x0002C1, "Member 'BP_jRPG_SavePointDialog_C_CheckForErrors::CallFunc_EqualEqual_NameName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_jRPG_SavePointDialog_C_CheckForErrors, CallFunc_BooleanOR_ReturnValue) == 0x0002C2, "Member 'BP_jRPG_SavePointDialog_C_CheckForErrors::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_SavePointDialog_C_CheckForErrors, Temp_int_Loop_Counter_Variable) == 0x0002C4, "Member 'BP_jRPG_SavePointDialog_C_CheckForErrors::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_jRPG_SavePointDialog_C_CheckForErrors, CallFunc_BooleanAND_ReturnValue) == 0x0002C8, "Member 'BP_jRPG_SavePointDialog_C_CheckForErrors::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_SavePointDialog_C_CheckForErrors, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0002C9, "Member 'BP_jRPG_SavePointDialog_C_CheckForErrors::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_SavePointDialog_C_CheckForErrors, K2Node_Select_Default) == 0x0002D0, "Member 'BP_jRPG_SavePointDialog_C_CheckForErrors::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_jRPG_SavePointDialog_C_CheckForErrors, CallFunc_Add_IntInt_ReturnValue) == 0x0002E0, "Member 'BP_jRPG_SavePointDialog_C_CheckForErrors::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_SavePointDialog_C_CheckForErrors, K2Node_MakeStruct_FormatArgumentData_6) == 0x0002E8, "Member 'BP_jRPG_SavePointDialog_C_CheckForErrors::K2Node_MakeStruct_FormatArgumentData_6' has a wrong offset!");
static_assert(offsetof(BP_jRPG_SavePointDialog_C_CheckForErrors, CallFunc_GetAllActorsOfClass_OutActors) == 0x000330, "Member 'BP_jRPG_SavePointDialog_C_CheckForErrors::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(BP_jRPG_SavePointDialog_C_CheckForErrors, CallFunc_GetCurrentLevelName_ReturnValue) == 0x000340, "Member 'BP_jRPG_SavePointDialog_C_CheckForErrors::CallFunc_GetCurrentLevelName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_SavePointDialog_C_CheckForErrors, CallFunc_Array_Get_Item) == 0x000350, "Member 'BP_jRPG_SavePointDialog_C_CheckForErrors::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_jRPG_SavePointDialog_C_CheckForErrors, CallFunc_GetBaseFilename_ReturnValue) == 0x000358, "Member 'BP_jRPG_SavePointDialog_C_CheckForErrors::CallFunc_GetBaseFilename_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_SavePointDialog_C_CheckForErrors, CallFunc_GetDebugString_ReturnValue) == 0x000368, "Member 'BP_jRPG_SavePointDialog_C_CheckForErrors::CallFunc_GetDebugString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_SavePointDialog_C_CheckForErrors, CallFunc_Conv_StringToText_ReturnValue_2) == 0x000378, "Member 'BP_jRPG_SavePointDialog_C_CheckForErrors::CallFunc_Conv_StringToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_jRPG_SavePointDialog_C_CheckForErrors, CallFunc_Conv_StringToText_ReturnValue_3) == 0x000388, "Member 'BP_jRPG_SavePointDialog_C_CheckForErrors::CallFunc_Conv_StringToText_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_jRPG_SavePointDialog_C_CheckForErrors, K2Node_MakeStruct_FormatArgumentData_7) == 0x000398, "Member 'BP_jRPG_SavePointDialog_C_CheckForErrors::K2Node_MakeStruct_FormatArgumentData_7' has a wrong offset!");
static_assert(offsetof(BP_jRPG_SavePointDialog_C_CheckForErrors, K2Node_MakeStruct_FormatArgumentData_8) == 0x0003E0, "Member 'BP_jRPG_SavePointDialog_C_CheckForErrors::K2Node_MakeStruct_FormatArgumentData_8' has a wrong offset!");
static_assert(offsetof(BP_jRPG_SavePointDialog_C_CheckForErrors, K2Node_MakeArray_Array_1) == 0x000428, "Member 'BP_jRPG_SavePointDialog_C_CheckForErrors::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BP_jRPG_SavePointDialog_C_CheckForErrors, K2Node_MakeArray_Array_2) == 0x000438, "Member 'BP_jRPG_SavePointDialog_C_CheckForErrors::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(BP_jRPG_SavePointDialog_C_CheckForErrors, CallFunc_Format_ReturnValue_1) == 0x000448, "Member 'BP_jRPG_SavePointDialog_C_CheckForErrors::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_jRPG_SavePointDialog_C_CheckForErrors, CallFunc_Format_ReturnValue_2) == 0x000458, "Member 'BP_jRPG_SavePointDialog_C_CheckForErrors::CallFunc_Format_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_jRPG_SavePointDialog_C_CheckForErrors, CallFunc_Array_Add_ReturnValue_2) == 0x000468, "Member 'BP_jRPG_SavePointDialog_C_CheckForErrors::CallFunc_Array_Add_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_jRPG_SavePointDialog_C_CheckForErrors, CallFunc_Conv_StringToText_ReturnValue_4) == 0x000470, "Member 'BP_jRPG_SavePointDialog_C_CheckForErrors::CallFunc_Conv_StringToText_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_jRPG_SavePointDialog_C_CheckForErrors, CallFunc_Conv_StringToName_ReturnValue) == 0x000480, "Member 'BP_jRPG_SavePointDialog_C_CheckForErrors::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_SavePointDialog_C_CheckForErrors, K2Node_MakeStruct_FormatArgumentData_9) == 0x000488, "Member 'BP_jRPG_SavePointDialog_C_CheckForErrors::K2Node_MakeStruct_FormatArgumentData_9' has a wrong offset!");
static_assert(offsetof(BP_jRPG_SavePointDialog_C_CheckForErrors, CallFunc_GetLevelData_Found) == 0x0004D0, "Member 'BP_jRPG_SavePointDialog_C_CheckForErrors::CallFunc_GetLevelData_Found' has a wrong offset!");
static_assert(offsetof(BP_jRPG_SavePointDialog_C_CheckForErrors, CallFunc_GetLevelData_LevelData) == 0x0004D8, "Member 'BP_jRPG_SavePointDialog_C_CheckForErrors::CallFunc_GetLevelData_LevelData' has a wrong offset!");
static_assert(offsetof(BP_jRPG_SavePointDialog_C_CheckForErrors, K2Node_MakeArray_Array_3) == 0x000688, "Member 'BP_jRPG_SavePointDialog_C_CheckForErrors::K2Node_MakeArray_Array_3' has a wrong offset!");
static_assert(offsetof(BP_jRPG_SavePointDialog_C_CheckForErrors, CallFunc_FindSubAreaName_Name) == 0x000698, "Member 'BP_jRPG_SavePointDialog_C_CheckForErrors::CallFunc_FindSubAreaName_Name' has a wrong offset!");
static_assert(offsetof(BP_jRPG_SavePointDialog_C_CheckForErrors, CallFunc_FindSubAreaName_Found) == 0x0006A8, "Member 'BP_jRPG_SavePointDialog_C_CheckForErrors::CallFunc_FindSubAreaName_Found' has a wrong offset!");
static_assert(offsetof(BP_jRPG_SavePointDialog_C_CheckForErrors, CallFunc_Format_ReturnValue_3) == 0x0006B0, "Member 'BP_jRPG_SavePointDialog_C_CheckForErrors::CallFunc_Format_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_jRPG_SavePointDialog_C_CheckForErrors, CallFunc_Not_PreBool_ReturnValue_2) == 0x0006C0, "Member 'BP_jRPG_SavePointDialog_C_CheckForErrors::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_jRPG_SavePointDialog_C_CheckForErrors, CallFunc_Array_Add_ReturnValue_3) == 0x0006C4, "Member 'BP_jRPG_SavePointDialog_C_CheckForErrors::CallFunc_Array_Add_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_jRPG_SavePointDialog_C_CheckForErrors, CallFunc_Not_PreBool_ReturnValue_3) == 0x0006C8, "Member 'BP_jRPG_SavePointDialog_C_CheckForErrors::CallFunc_Not_PreBool_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_jRPG_SavePointDialog_C_CheckForErrors, CallFunc_Array_Length_ReturnValue) == 0x0006CC, "Member 'BP_jRPG_SavePointDialog_C_CheckForErrors::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_SavePointDialog_C_CheckForErrors, CallFunc_Less_IntInt_ReturnValue) == 0x0006D0, "Member 'BP_jRPG_SavePointDialog_C_CheckForErrors::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function BP_jRPG_SavePointDialog.BP_jRPG_SavePointDialog_C.ExecuteUbergraph_BP_jRPG_SavePointDialog
// 0x0220 (0x0220 - 0x0000)
struct BP_jRPG_SavePointDialog_C_ExecuteUbergraph_BP_jRPG_SavePointDialog final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_InteractionState;                     // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_BattleState;                          // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_jRPG_Controller_World_C*            K2Node_DynamicCast_AsBP_J_RPG_Controller_World;    // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UWBP_SavePointMenu_C* SavePointMenu)> K2Node_CreateDelegate_OutputDelegate_1; // 0x0038(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_SaveManager_C*                      CallFunc_GetSaveManager_SaveManager;               // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_jRPG_Character_World_C*             K2Node_Event_InteractingWorldCharacter;            // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_Instant;                              // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent_1;  // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor_1;           // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp_1;            // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex_1;       // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7D[0x3];                                       // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x0080(0x00F8)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x0178(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0180(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0188(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0194(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_195[0x3];                                      // 0x0195(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_InteractionSystem_C*                CallFunc_GetInteractionSystem_ReturnValue;         // 0x0198(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x01A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x01A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A3[0x5];                                      // 0x01A3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_Interaction_C>    CallFunc_UnregisterDistantInteractiveObject_InteractiveObject_CastInput; // 0x01A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_Interaction_C>    CallFunc_RegisterDistantInteractiveObject_InteractiveObject_CastInput; // 0x01B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x01C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_SavePointMenu_C*                   CallFunc_Create_ReturnValue;                       // 0x01D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D9[0x7];                                      // 0x01D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue_1;              // 0x01E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_InteractionSystem_C*                CallFunc_GetInteractionSystem_ReturnValue_1;       // 0x01E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_1;    // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F1[0x7];                                      // 0x01F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_Interaction_C>    CallFunc_UnregisterInteractiveObject_InteractiveObject_CastInput; // 0x01F8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_Interaction_C>    CallFunc_RegisterInteractiveObject_InteractiveObject_CastInput; // 0x0208(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_jRPG_GI_Custom_C*                   CallFunc_GetCustomGI_ReturnValue;                  // 0x0218(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_jRPG_SavePointDialog_C_ExecuteUbergraph_BP_jRPG_SavePointDialog) == 0x000008, "Wrong alignment on BP_jRPG_SavePointDialog_C_ExecuteUbergraph_BP_jRPG_SavePointDialog");
static_assert(sizeof(BP_jRPG_SavePointDialog_C_ExecuteUbergraph_BP_jRPG_SavePointDialog) == 0x000220, "Wrong size on BP_jRPG_SavePointDialog_C_ExecuteUbergraph_BP_jRPG_SavePointDialog");
static_assert(offsetof(BP_jRPG_SavePointDialog_C_ExecuteUbergraph_BP_jRPG_SavePointDialog, EntryPoint) == 0x000000, "Member 'BP_jRPG_SavePointDialog_C_ExecuteUbergraph_BP_jRPG_SavePointDialog::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_jRPG_SavePointDialog_C_ExecuteUbergraph_BP_jRPG_SavePointDialog, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BP_jRPG_SavePointDialog_C_ExecuteUbergraph_BP_jRPG_SavePointDialog::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_jRPG_SavePointDialog_C_ExecuteUbergraph_BP_jRPG_SavePointDialog, K2Node_Event_InteractionState) == 0x000014, "Member 'BP_jRPG_SavePointDialog_C_ExecuteUbergraph_BP_jRPG_SavePointDialog::K2Node_Event_InteractionState' has a wrong offset!");
static_assert(offsetof(BP_jRPG_SavePointDialog_C_ExecuteUbergraph_BP_jRPG_SavePointDialog, K2Node_Event_BattleState) == 0x000015, "Member 'BP_jRPG_SavePointDialog_C_ExecuteUbergraph_BP_jRPG_SavePointDialog::K2Node_Event_BattleState' has a wrong offset!");
static_assert(offsetof(BP_jRPG_SavePointDialog_C_ExecuteUbergraph_BP_jRPG_SavePointDialog, CallFunc_GetPlayerController_ReturnValue) == 0x000018, "Member 'BP_jRPG_SavePointDialog_C_ExecuteUbergraph_BP_jRPG_SavePointDialog::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_SavePointDialog_C_ExecuteUbergraph_BP_jRPG_SavePointDialog, K2Node_DynamicCast_AsBP_J_RPG_Controller_World) == 0x000020, "Member 'BP_jRPG_SavePointDialog_C_ExecuteUbergraph_BP_jRPG_SavePointDialog::K2Node_DynamicCast_AsBP_J_RPG_Controller_World' has a wrong offset!");
static_assert(offsetof(BP_jRPG_SavePointDialog_C_ExecuteUbergraph_BP_jRPG_SavePointDialog, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BP_jRPG_SavePointDialog_C_ExecuteUbergraph_BP_jRPG_SavePointDialog::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_jRPG_SavePointDialog_C_ExecuteUbergraph_BP_jRPG_SavePointDialog, CallFunc_GetPlayerController_ReturnValue_1) == 0x000030, "Member 'BP_jRPG_SavePointDialog_C_ExecuteUbergraph_BP_jRPG_SavePointDialog::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_jRPG_SavePointDialog_C_ExecuteUbergraph_BP_jRPG_SavePointDialog, K2Node_CreateDelegate_OutputDelegate_1) == 0x000038, "Member 'BP_jRPG_SavePointDialog_C_ExecuteUbergraph_BP_jRPG_SavePointDialog::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_jRPG_SavePointDialog_C_ExecuteUbergraph_BP_jRPG_SavePointDialog, CallFunc_GetSaveManager_SaveManager) == 0x000048, "Member 'BP_jRPG_SavePointDialog_C_ExecuteUbergraph_BP_jRPG_SavePointDialog::CallFunc_GetSaveManager_SaveManager' has a wrong offset!");
static_assert(offsetof(BP_jRPG_SavePointDialog_C_ExecuteUbergraph_BP_jRPG_SavePointDialog, K2Node_Event_InteractingWorldCharacter) == 0x000050, "Member 'BP_jRPG_SavePointDialog_C_ExecuteUbergraph_BP_jRPG_SavePointDialog::K2Node_Event_InteractingWorldCharacter' has a wrong offset!");
static_assert(offsetof(BP_jRPG_SavePointDialog_C_ExecuteUbergraph_BP_jRPG_SavePointDialog, K2Node_Event_Instant) == 0x000058, "Member 'BP_jRPG_SavePointDialog_C_ExecuteUbergraph_BP_jRPG_SavePointDialog::K2Node_Event_Instant' has a wrong offset!");
static_assert(offsetof(BP_jRPG_SavePointDialog_C_ExecuteUbergraph_BP_jRPG_SavePointDialog, K2Node_ComponentBoundEvent_OverlappedComponent_1) == 0x000060, "Member 'BP_jRPG_SavePointDialog_C_ExecuteUbergraph_BP_jRPG_SavePointDialog::K2Node_ComponentBoundEvent_OverlappedComponent_1' has a wrong offset!");
static_assert(offsetof(BP_jRPG_SavePointDialog_C_ExecuteUbergraph_BP_jRPG_SavePointDialog, K2Node_ComponentBoundEvent_OtherActor_1) == 0x000068, "Member 'BP_jRPG_SavePointDialog_C_ExecuteUbergraph_BP_jRPG_SavePointDialog::K2Node_ComponentBoundEvent_OtherActor_1' has a wrong offset!");
static_assert(offsetof(BP_jRPG_SavePointDialog_C_ExecuteUbergraph_BP_jRPG_SavePointDialog, K2Node_ComponentBoundEvent_OtherComp_1) == 0x000070, "Member 'BP_jRPG_SavePointDialog_C_ExecuteUbergraph_BP_jRPG_SavePointDialog::K2Node_ComponentBoundEvent_OtherComp_1' has a wrong offset!");
static_assert(offsetof(BP_jRPG_SavePointDialog_C_ExecuteUbergraph_BP_jRPG_SavePointDialog, K2Node_ComponentBoundEvent_OtherBodyIndex_1) == 0x000078, "Member 'BP_jRPG_SavePointDialog_C_ExecuteUbergraph_BP_jRPG_SavePointDialog::K2Node_ComponentBoundEvent_OtherBodyIndex_1' has a wrong offset!");
static_assert(offsetof(BP_jRPG_SavePointDialog_C_ExecuteUbergraph_BP_jRPG_SavePointDialog, K2Node_ComponentBoundEvent_bFromSweep) == 0x00007C, "Member 'BP_jRPG_SavePointDialog_C_ExecuteUbergraph_BP_jRPG_SavePointDialog::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_jRPG_SavePointDialog_C_ExecuteUbergraph_BP_jRPG_SavePointDialog, K2Node_ComponentBoundEvent_SweepResult) == 0x000080, "Member 'BP_jRPG_SavePointDialog_C_ExecuteUbergraph_BP_jRPG_SavePointDialog::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(BP_jRPG_SavePointDialog_C_ExecuteUbergraph_BP_jRPG_SavePointDialog, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x000178, "Member 'BP_jRPG_SavePointDialog_C_ExecuteUbergraph_BP_jRPG_SavePointDialog::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_jRPG_SavePointDialog_C_ExecuteUbergraph_BP_jRPG_SavePointDialog, K2Node_ComponentBoundEvent_OtherActor) == 0x000180, "Member 'BP_jRPG_SavePointDialog_C_ExecuteUbergraph_BP_jRPG_SavePointDialog::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(BP_jRPG_SavePointDialog_C_ExecuteUbergraph_BP_jRPG_SavePointDialog, K2Node_ComponentBoundEvent_OtherComp) == 0x000188, "Member 'BP_jRPG_SavePointDialog_C_ExecuteUbergraph_BP_jRPG_SavePointDialog::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(BP_jRPG_SavePointDialog_C_ExecuteUbergraph_BP_jRPG_SavePointDialog, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x000190, "Member 'BP_jRPG_SavePointDialog_C_ExecuteUbergraph_BP_jRPG_SavePointDialog::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_jRPG_SavePointDialog_C_ExecuteUbergraph_BP_jRPG_SavePointDialog, K2Node_Event_EndPlayReason) == 0x000194, "Member 'BP_jRPG_SavePointDialog_C_ExecuteUbergraph_BP_jRPG_SavePointDialog::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BP_jRPG_SavePointDialog_C_ExecuteUbergraph_BP_jRPG_SavePointDialog, CallFunc_GetInteractionSystem_ReturnValue) == 0x000198, "Member 'BP_jRPG_SavePointDialog_C_ExecuteUbergraph_BP_jRPG_SavePointDialog::CallFunc_GetInteractionSystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_SavePointDialog_C_ExecuteUbergraph_BP_jRPG_SavePointDialog, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0001A0, "Member 'BP_jRPG_SavePointDialog_C_ExecuteUbergraph_BP_jRPG_SavePointDialog::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_SavePointDialog_C_ExecuteUbergraph_BP_jRPG_SavePointDialog, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x0001A1, "Member 'BP_jRPG_SavePointDialog_C_ExecuteUbergraph_BP_jRPG_SavePointDialog::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_jRPG_SavePointDialog_C_ExecuteUbergraph_BP_jRPG_SavePointDialog, CallFunc_BooleanOR_ReturnValue) == 0x0001A2, "Member 'BP_jRPG_SavePointDialog_C_ExecuteUbergraph_BP_jRPG_SavePointDialog::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_SavePointDialog_C_ExecuteUbergraph_BP_jRPG_SavePointDialog, CallFunc_UnregisterDistantInteractiveObject_InteractiveObject_CastInput) == 0x0001A8, "Member 'BP_jRPG_SavePointDialog_C_ExecuteUbergraph_BP_jRPG_SavePointDialog::CallFunc_UnregisterDistantInteractiveObject_InteractiveObject_CastInput' has a wrong offset!");
static_assert(offsetof(BP_jRPG_SavePointDialog_C_ExecuteUbergraph_BP_jRPG_SavePointDialog, CallFunc_RegisterDistantInteractiveObject_InteractiveObject_CastInput) == 0x0001B8, "Member 'BP_jRPG_SavePointDialog_C_ExecuteUbergraph_BP_jRPG_SavePointDialog::CallFunc_RegisterDistantInteractiveObject_InteractiveObject_CastInput' has a wrong offset!");
static_assert(offsetof(BP_jRPG_SavePointDialog_C_ExecuteUbergraph_BP_jRPG_SavePointDialog, CallFunc_GetPlayerPawn_ReturnValue) == 0x0001C8, "Member 'BP_jRPG_SavePointDialog_C_ExecuteUbergraph_BP_jRPG_SavePointDialog::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_SavePointDialog_C_ExecuteUbergraph_BP_jRPG_SavePointDialog, CallFunc_Create_ReturnValue) == 0x0001D0, "Member 'BP_jRPG_SavePointDialog_C_ExecuteUbergraph_BP_jRPG_SavePointDialog::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_SavePointDialog_C_ExecuteUbergraph_BP_jRPG_SavePointDialog, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0001D8, "Member 'BP_jRPG_SavePointDialog_C_ExecuteUbergraph_BP_jRPG_SavePointDialog::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_SavePointDialog_C_ExecuteUbergraph_BP_jRPG_SavePointDialog, CallFunc_GetPlayerPawn_ReturnValue_1) == 0x0001E0, "Member 'BP_jRPG_SavePointDialog_C_ExecuteUbergraph_BP_jRPG_SavePointDialog::CallFunc_GetPlayerPawn_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_jRPG_SavePointDialog_C_ExecuteUbergraph_BP_jRPG_SavePointDialog, CallFunc_GetInteractionSystem_ReturnValue_1) == 0x0001E8, "Member 'BP_jRPG_SavePointDialog_C_ExecuteUbergraph_BP_jRPG_SavePointDialog::CallFunc_GetInteractionSystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_jRPG_SavePointDialog_C_ExecuteUbergraph_BP_jRPG_SavePointDialog, CallFunc_EqualEqual_ObjectObject_ReturnValue_1) == 0x0001F0, "Member 'BP_jRPG_SavePointDialog_C_ExecuteUbergraph_BP_jRPG_SavePointDialog::CallFunc_EqualEqual_ObjectObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_jRPG_SavePointDialog_C_ExecuteUbergraph_BP_jRPG_SavePointDialog, CallFunc_UnregisterInteractiveObject_InteractiveObject_CastInput) == 0x0001F8, "Member 'BP_jRPG_SavePointDialog_C_ExecuteUbergraph_BP_jRPG_SavePointDialog::CallFunc_UnregisterInteractiveObject_InteractiveObject_CastInput' has a wrong offset!");
static_assert(offsetof(BP_jRPG_SavePointDialog_C_ExecuteUbergraph_BP_jRPG_SavePointDialog, CallFunc_RegisterInteractiveObject_InteractiveObject_CastInput) == 0x000208, "Member 'BP_jRPG_SavePointDialog_C_ExecuteUbergraph_BP_jRPG_SavePointDialog::CallFunc_RegisterInteractiveObject_InteractiveObject_CastInput' has a wrong offset!");
static_assert(offsetof(BP_jRPG_SavePointDialog_C_ExecuteUbergraph_BP_jRPG_SavePointDialog, CallFunc_GetCustomGI_ReturnValue) == 0x000218, "Member 'BP_jRPG_SavePointDialog_C_ExecuteUbergraph_BP_jRPG_SavePointDialog::CallFunc_GetCustomGI_ReturnValue' has a wrong offset!");

// Function BP_jRPG_SavePointDialog.BP_jRPG_SavePointDialog_C.FindDuplicateID
// 0x0001 (0x0001 - 0x0000)
struct BP_jRPG_SavePointDialog_C_FindDuplicateID final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_jRPG_SavePointDialog_C_FindDuplicateID) == 0x000001, "Wrong alignment on BP_jRPG_SavePointDialog_C_FindDuplicateID");
static_assert(sizeof(BP_jRPG_SavePointDialog_C_FindDuplicateID) == 0x000001, "Wrong size on BP_jRPG_SavePointDialog_C_FindDuplicateID");
static_assert(offsetof(BP_jRPG_SavePointDialog_C_FindDuplicateID, ReturnValue) == 0x000000, "Member 'BP_jRPG_SavePointDialog_C_FindDuplicateID::ReturnValue' has a wrong offset!");

// Function BP_jRPG_SavePointDialog.BP_jRPG_SavePointDialog_C.GetInteractionPromptParams
// 0x0018 (0x0018 - 0x0000)
struct BP_jRPG_SavePointDialog_C_GetInteractionPromptParams final
{
public:
	struct FFPromptParams                         PromptParams;                                      // 0x0000(0x0018)(Parm, OutParm, HasGetValueTypeHash)
};
static_assert(alignof(BP_jRPG_SavePointDialog_C_GetInteractionPromptParams) == 0x000008, "Wrong alignment on BP_jRPG_SavePointDialog_C_GetInteractionPromptParams");
static_assert(sizeof(BP_jRPG_SavePointDialog_C_GetInteractionPromptParams) == 0x000018, "Wrong size on BP_jRPG_SavePointDialog_C_GetInteractionPromptParams");
static_assert(offsetof(BP_jRPG_SavePointDialog_C_GetInteractionPromptParams, PromptParams) == 0x000000, "Member 'BP_jRPG_SavePointDialog_C_GetInteractionPromptParams::PromptParams' has a wrong offset!");

// Function BP_jRPG_SavePointDialog.BP_jRPG_SavePointDialog_C.IsInteractionAvailable
// 0x0001 (0x0001 - 0x0000)
struct BP_jRPG_SavePointDialog_C_IsInteractionAvailable final
{
public:
	bool                                          Available;                                         // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_jRPG_SavePointDialog_C_IsInteractionAvailable) == 0x000001, "Wrong alignment on BP_jRPG_SavePointDialog_C_IsInteractionAvailable");
