#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_jRPG_Character_Battle_Base

#include "Basic.hpp"

#include "FEnemyDataRow_structs.hpp"
#include "EFreeAimType_structs.hpp"
#include "E_StatusEffects_structs.hpp"
#include "ECharacterTeamSelector_structs.hpp"
#include "SandFall_structs.hpp"
#include "S_CharacterCustomization_structs.hpp"
#include "S_jRPG_Enemy_structs.hpp"
#include "EBattleTurnState_structs.hpp"
#include "E_GameDifficulty_structs.hpp"
#include "E_jRPG_CombatStyle_structs.hpp"
#include "EElementalAffinity_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "S_BalancingTableFloatEntry_structs.hpp"
#include "EHealReason_structs.hpp"
#include "E_QuestStatus_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "E_JRPG_VFXSpawnSpots_structs.hpp"
#include "SlateCore_structs.hpp"
#include "ECounterType_structs.hpp"
#include "CinematicCamera_structs.hpp"
#include "FRoutedEventHandle_structs.hpp"
#include "EBuffApplicationProbability_structs.hpp"
#include "EAttackType_structs.hpp"
#include "FEquipmentSlot_structs.hpp"
#include "E_jRPG_CharacterAttachmentSlot_structs.hpp"
#include "S_jRPG_Item_StaticData_structs.hpp"
#include "E_EnemyIdleState_structs.hpp"
#include "S_jRPG_Encounter_structs.hpp"
#include "EBattleForbiddenActionReason_structs.hpp"
#include "FElementalAffinityList_structs.hpp"
#include "EAPChangeReason_structs.hpp"
#include "E_FreezeFrame_structs.hpp"
#include "FBattleTurnSequence_CharacterData_structs.hpp"
#include "E_jRPG_StatType_structs.hpp"
#include "FSoundEvent_structs.hpp"
#include "EnhancedInput_structs.hpp"
#include "E_jRPG_ActionType_structs.hpp"
#include "EDamageReason_structs.hpp"
#include "EFreeAimBodyPartType_structs.hpp"
#include "EPermeateIntensity_structs.hpp"


namespace SDK::Params
{

// Function BP_jRPG_Character_Battle_Base.BP_jRPG_Character_Battle_Base_C.OnInstigatedActorSpawned
// 0x0050 (0x0050 - 0x0000)
struct BP_jRPG_Character_Battle_Base_C_OnInstigatedActorSpawned final
{
public:
	class AActor*                                 SpawnedActor;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class AActor>                  CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue; // 0x0010(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	class AController*                            K2Node_DynamicCast_AsController;                   // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_jRPG_Character_Battle_Base_C_OnInstigatedActorSpawned) == 0x000008, "Wrong alignment on BP_jRPG_Character_Battle_Base_C_OnInstigatedActorSpawned");
static_assert(sizeof(BP_jRPG_Character_Battle_Base_C_OnInstigatedActorSpawned) == 0x000050, "Wrong size on BP_jRPG_Character_Battle_Base_C_OnInstigatedActorSpawned");
static_assert(offsetof(BP_jRPG_Character_Battle_Base_C_OnInstigatedActorSpawned, SpawnedActor) == 0x000000, "Member 'BP_jRPG_Character_Battle_Base_C_OnInstigatedActorSpawned::SpawnedActor' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Character_Battle_Base_C_OnInstigatedActorSpawned, ReturnValue) == 0x000008, "Member 'BP_jRPG_Character_Battle_Base_C_OnInstigatedActorSpawned::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Character_Battle_Base_C_OnInstigatedActorSpawned, CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue) == 0x000010, "Member 'BP_jRPG_Character_Battle_Base_C_OnInstigatedActorSpawned::CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Character_Battle_Base_C_OnInstigatedActorSpawned, K2Node_DynamicCast_AsController) == 0x000038, "Member 'BP_jRPG_Character_Battle_Base_C_OnInstigatedActorSpawned::K2Node_DynamicCast_AsController' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Character_Battle_Base_C_OnInstigatedActorSpawned, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'BP_jRPG_Character_Battle_Base_C_OnInstigatedActorSpawned::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Character_Battle_Base_C_OnInstigatedActorSpawned, CallFunc_Array_AddUnique_ReturnValue) == 0x000044, "Member 'BP_jRPG_Character_Battle_Base_C_OnInstigatedActorSpawned::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Character_Battle_Base_C_OnInstigatedActorSpawned, CallFunc_Not_PreBool_ReturnValue) == 0x000048, "Member 'BP_jRPG_Character_Battle_Base_C_OnInstigatedActorSpawned::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function BP_jRPG_Character_Battle_Base.BP_jRPG_Character_Battle_Base_C.BPI_GetDependencies
// 0x02C8 (0x02C8 - 0x0000)
struct BP_jRPG_Character_Battle_Base_C_BPI_GetDependencies final
{
public:
	TArray<TSoftClassPtr<class UClass>>           Classes;                                           // 0x0000(0x0010)(Parm, OutParm)
	TArray<TSoftObjectPtr<class UObject>>         Assets;                                            // 0x0010(0x0010)(Parm, OutParm)
	TArray<TScriptInterface<class IBPI_LoadingDependenciesSource_C>> ExternalDependencies;           // 0x0020(0x0010)(Parm, OutParm)
	TArray<TSoftClassPtr<class UClass>>           local_classes;                                     // 0x0030(0x0010)(Edit, BlueprintVisible)
	TArray<TSoftClassPtr<class UClass>>           Temp_wildcard_We_need_a_second_array_to_store_the_result_and_be_able_to_wipe_the_first__buffer__array_Variable; // 0x0040(0x0010)(ConstParm, ReferenceParm)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TSoftClassPtr<class UClass>>           Temp_wildcard_Temp_buffer_array_Variable;          // 0x0060(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftClassPtr<class UClass>                   CallFunc_GetCharacterBattleLinesClass_CharacterBattleLineClass; // 0x0078(0x0028)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftClassReference_ReturnValue;    // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A5[0x3];                                       // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFEnemyDataRow                         CallFunc_Array_Get_Item;                           // 0x00A8(0x0010)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BD[0x3];                                       // 0x00BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_jRPG_Enemy                          CallFunc_GetDataTableRowFromName_OutRow;           // 0x00C0(0x0200)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C1[0x3];                                      // 0x02C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x02C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_jRPG_Character_Battle_Base_C_BPI_GetDependencies) == 0x000008, "Wrong alignment on BP_jRPG_Character_Battle_Base_C_BPI_GetDependencies");
static_assert(sizeof(BP_jRPG_Character_Battle_Base_C_BPI_GetDependencies) == 0x0002C8, "Wrong size on BP_jRPG_Character_Battle_Base_C_BPI_GetDependencies");
static_assert(offsetof(BP_jRPG_Character_Battle_Base_C_BPI_GetDependencies, Classes) == 0x000000, "Member 'BP_jRPG_Character_Battle_Base_C_BPI_GetDependencies::Classes' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Character_Battle_Base_C_BPI_GetDependencies, Assets) == 0x000010, "Member 'BP_jRPG_Character_Battle_Base_C_BPI_GetDependencies::Assets' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Character_Battle_Base_C_BPI_GetDependencies, ExternalDependencies) == 0x000020, "Member 'BP_jRPG_Character_Battle_Base_C_BPI_GetDependencies::ExternalDependencies' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Character_Battle_Base_C_BPI_GetDependencies, local_classes) == 0x000030, "Member 'BP_jRPG_Character_Battle_Base_C_BPI_GetDependencies::local_classes' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Character_Battle_Base_C_BPI_GetDependencies, Temp_wildcard_We_need_a_second_array_to_store_the_result_and_be_able_to_wipe_the_first__buffer__array_Variable) == 0x000040, "Member 'BP_jRPG_Character_Battle_Base_C_BPI_GetDependencies::Temp_wildcard_We_need_a_second_array_to_store_the_result_and_be_able_to_wipe_the_first__buffer__array_Variable' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Character_Battle_Base_C_BPI_GetDependencies, Temp_int_Loop_Counter_Variable) == 0x000050, "Member 'BP_jRPG_Character_Battle_Base_C_BPI_GetDependencies::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Character_Battle_Base_C_BPI_GetDependencies, CallFunc_Add_IntInt_ReturnValue) == 0x000054, "Member 'BP_jRPG_Character_Battle_Base_C_BPI_GetDependencies::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Character_Battle_Base_C_BPI_GetDependencies, Temp_int_Array_Index_Variable) == 0x000058, "Member 'BP_jRPG_Character_Battle_Base_C_BPI_GetDependencies::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Character_Battle_Base_C_BPI_GetDependencies, Temp_wildcard_Temp_buffer_array_Variable) == 0x000060, "Member 'BP_jRPG_Character_Battle_Base_C_BPI_GetDependencies::Temp_wildcard_Temp_buffer_array_Variable' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Character_Battle_Base_C_BPI_GetDependencies, CallFunc_IsValid_ReturnValue) == 0x000070, "Member 'BP_jRPG_Character_Battle_Base_C_BPI_GetDependencies::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Character_Battle_Base_C_BPI_GetDependencies, CallFunc_GetCharacterBattleLinesClass_CharacterBattleLineClass) == 0x000078, "Member 'BP_jRPG_Character_Battle_Base_C_BPI_GetDependencies::CallFunc_GetCharacterBattleLinesClass_CharacterBattleLineClass' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Character_Battle_Base_C_BPI_GetDependencies, CallFunc_Array_Add_ReturnValue) == 0x0000A0, "Member 'BP_jRPG_Character_Battle_Base_C_BPI_GetDependencies::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Character_Battle_Base_C_BPI_GetDependencies, CallFunc_IsValidSoftClassReference_ReturnValue) == 0x0000A4, "Member 'BP_jRPG_Character_Battle_Base_C_BPI_GetDependencies::CallFunc_IsValidSoftClassReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Character_Battle_Base_C_BPI_GetDependencies, CallFunc_Array_Get_Item) == 0x0000A8, "Member 'BP_jRPG_Character_Battle_Base_C_BPI_GetDependencies::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Character_Battle_Base_C_BPI_GetDependencies, CallFunc_Array_Length_ReturnValue) == 0x0000B8, "Member 'BP_jRPG_Character_Battle_Base_C_BPI_GetDependencies::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Character_Battle_Base_C_BPI_GetDependencies, CallFunc_Less_IntInt_ReturnValue) == 0x0000BC, "Member 'BP_jRPG_Character_Battle_Base_C_BPI_GetDependencies::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Character_Battle_Base_C_BPI_GetDependencies, CallFunc_GetDataTableRowFromName_OutRow) == 0x0000C0, "Member 'BP_jRPG_Character_Battle_Base_C_BPI_GetDependencies::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Character_Battle_Base_C_BPI_GetDependencies, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x0002C0, "Member 'BP_jRPG_Character_Battle_Base_C_BPI_GetDependencies::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Character_Battle_Base_C_BPI_GetDependencies, CallFunc_Array_Add_ReturnValue_1) == 0x0002C4, "Member 'BP_jRPG_Character_Battle_Base_C_BPI_GetDependencies::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");

// Function BP_jRPG_Character_Battle_Base.BP_jRPG_Character_Battle_Base_C.GetBattleAudioProfile
// 0x0008 (0x0008 - 0x0000)
struct BP_jRPG_Character_Battle_Base_C_GetBattleAudioProfile final
{
public:
	class UBP_DataAsset_CharacterBattleAudioProfile_C* AudioProfile;                                 // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_jRPG_Character_Battle_Base_C_GetBattleAudioProfile) == 0x000008, "Wrong alignment on BP_jRPG_Character_Battle_Base_C_GetBattleAudioProfile");
static_assert(sizeof(BP_jRPG_Character_Battle_Base_C_GetBattleAudioProfile) == 0x000008, "Wrong size on BP_jRPG_Character_Battle_Base_C_GetBattleAudioProfile");
static_assert(offsetof(BP_jRPG_Character_Battle_Base_C_GetBattleAudioProfile, AudioProfile) == 0x000000, "Member 'BP_jRPG_Character_Battle_Base_C_GetBattleAudioProfile::AudioProfile' has a wrong offset!");

// Function BP_jRPG_Character_Battle_Base.BP_jRPG_Character_Battle_Base_C.GetBattleAudioContainerComponents
// 0x0040 (0x0040 - 0x0000)
struct BP_jRPG_Character_Battle_Base_C_GetBattleAudioContainerComponents final
{
public:
	class USceneComponent*                        SFX;                                               // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        weapon_l;                                          // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        weapon_r;                                          // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Foley;                                             // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Vocal;                                             // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        foot_l;                                            // 0x0028(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Foot_R;                                            // 0x0030(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        HitBy;                                             // 0x0038(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_jRPG_Character_Battle_Base_C_GetBattleAudioContainerComponents) == 0x000008, "Wrong alignment on BP_jRPG_Character_Battle_Base_C_GetBattleAudioContainerComponents");
static_assert(sizeof(BP_jRPG_Character_Battle_Base_C_GetBattleAudioContainerComponents) == 0x000040, "Wrong size on BP_jRPG_Character_Battle_Base_C_GetBattleAudioContainerComponents");
static_assert(offsetof(BP_jRPG_Character_Battle_Base_C_GetBattleAudioContainerComponents, SFX) == 0x000000, "Member 'BP_jRPG_Character_Battle_Base_C_GetBattleAudioContainerComponents::SFX' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Character_Battle_Base_C_GetBattleAudioContainerComponents, weapon_l) == 0x000008, "Member 'BP_jRPG_Character_Battle_Base_C_GetBattleAudioContainerComponents::weapon_l' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Character_Battle_Base_C_GetBattleAudioContainerComponents, weapon_r) == 0x000010, "Member 'BP_jRPG_Character_Battle_Base_C_GetBattleAudioContainerComponents::weapon_r' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Character_Battle_Base_C_GetBattleAudioContainerComponents, Foley) == 0x000018, "Member 'BP_jRPG_Character_Battle_Base_C_GetBattleAudioContainerComponents::Foley' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Character_Battle_Base_C_GetBattleAudioContainerComponents, Vocal) == 0x000020, "Member 'BP_jRPG_Character_Battle_Base_C_GetBattleAudioContainerComponents::Vocal' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Character_Battle_Base_C_GetBattleAudioContainerComponents, foot_l) == 0x000028, "Member 'BP_jRPG_Character_Battle_Base_C_GetBattleAudioContainerComponents::foot_l' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Character_Battle_Base_C_GetBattleAudioContainerComponents, Foot_R) == 0x000030, "Member 'BP_jRPG_Character_Battle_Base_C_GetBattleAudioContainerComponents::Foot_R' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Character_Battle_Base_C_GetBattleAudioContainerComponents, HitBy) == 0x000038, "Member 'BP_jRPG_Character_Battle_Base_C_GetBattleAudioContainerComponents::HitBy' has a wrong offset!");

// Function BP_jRPG_Character_Battle_Base.BP_jRPG_Character_Battle_Base_C.GetBattleAudioCharacterManager
// 0x0008 (0x0008 - 0x0000)
struct BP_jRPG_Character_Battle_Base_C_GetBattleAudioCharacterManager final
{
public:
	class UBP_AudioCharacter_BattleManager_C*     AudioCharacterBattleManager;                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_jRPG_Character_Battle_Base_C_GetBattleAudioCharacterManager) == 0x000008, "Wrong alignment on BP_jRPG_Character_Battle_Base_C_GetBattleAudioCharacterManager");
static_assert(sizeof(BP_jRPG_Character_Battle_Base_C_GetBattleAudioCharacterManager) == 0x000008, "Wrong size on BP_jRPG_Character_Battle_Base_C_GetBattleAudioCharacterManager");
static_assert(offsetof(BP_jRPG_Character_Battle_Base_C_GetBattleAudioCharacterManager, AudioCharacterBattleManager) == 0x000000, "Member 'BP_jRPG_Character_Battle_Base_C_GetBattleAudioCharacterManager::AudioCharacterBattleManager' has a wrong offset!");

// Function BP_jRPG_Character_Battle_Base.BP_jRPG_Character_Battle_Base_C.GetTiedObject
// 0x0008 (0x0008 - 0x0000)
struct BP_jRPG_Character_Battle_Base_C_GetTiedObject final
{
public:
	class UObject*                                Object;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_jRPG_Character_Battle_Base_C_GetTiedObject) == 0x000008, "Wrong alignment on BP_jRPG_Character_Battle_Base_C_GetTiedObject");
static_assert(sizeof(BP_jRPG_Character_Battle_Base_C_GetTiedObject) == 0x000008, "Wrong size on BP_jRPG_Character_Battle_Base_C_GetTiedObject");
static_assert(offsetof(BP_jRPG_Character_Battle_Base_C_GetTiedObject, Object) == 0x000000, "Member 'BP_jRPG_Character_Battle_Base_C_GetTiedObject::Object' has a wrong offset!");

// Function BP_jRPG_Character_Battle_Base.BP_jRPG_Character_Battle_Base_C.GetIsDead
// 0x0001 (0x0001 - 0x0000)
struct BP_jRPG_Character_Battle_Base_C_GetIsDead final
{
public:
	bool                                          Dead;                                              // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_jRPG_Character_Battle_Base_C_GetIsDead) == 0x000001, "Wrong alignment on BP_jRPG_Character_Battle_Base_C_GetIsDead");
static_assert(sizeof(BP_jRPG_Character_Battle_Base_C_GetIsDead) == 0x000001, "Wrong size on BP_jRPG_Character_Battle_Base_C_GetIsDead");
static_assert(offsetof(BP_jRPG_Character_Battle_Base_C_GetIsDead, Dead) == 0x000000, "Member 'BP_jRPG_Character_Battle_Base_C_GetIsDead::Dead' has a wrong offset!");

// Function BP_jRPG_Character_Battle_Base.BP_jRPG_Character_Battle_Base_C.GetIsDefending
// 0x0002 (0x0002 - 0x0000)
struct BP_jRPG_Character_Battle_Base_C_GetIsDefending final
{
public:
	bool                                          Defending;                                         // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_jRPG_Character_Battle_Base_C_GetIsDefending) == 0x000001, "Wrong alignment on BP_jRPG_Character_Battle_Base_C_GetIsDefending");
static_assert(sizeof(BP_jRPG_Character_Battle_Base_C_GetIsDefending) == 0x000002, "Wrong size on BP_jRPG_Character_Battle_Base_C_GetIsDefending");
static_assert(offsetof(BP_jRPG_Character_Battle_Base_C_GetIsDefending, Defending) == 0x000000, "Member 'BP_jRPG_Character_Battle_Base_C_GetIsDefending::Defending' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Character_Battle_Base_C_GetIsDefending, CallFunc_IsValid_ReturnValue) == 0x000001, "Member 'BP_jRPG_Character_Battle_Base_C_GetIsDefending::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_jRPG_Character_Battle_Base.BP_jRPG_Character_Battle_Base_C.GetCharacterCombatStyle
// 0x0001 (0x0001 - 0x0000)
struct BP_jRPG_Character_Battle_Base_C_GetCharacterCombatStyle final
{
public:
	E_jRPG_CombatStyle                            CombatStyle;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_jRPG_Character_Battle_Base_C_GetCharacterCombatStyle) == 0x000001, "Wrong alignment on BP_jRPG_Character_Battle_Base_C_GetCharacterCombatStyle");
static_assert(sizeof(BP_jRPG_Character_Battle_Base_C_GetCharacterCombatStyle) == 0x000001, "Wrong size on BP_jRPG_Character_Battle_Base_C_GetCharacterCombatStyle");
static_assert(offsetof(BP_jRPG_Character_Battle_Base_C_GetCharacterCombatStyle, CombatStyle) == 0x000000, "Member 'BP_jRPG_Character_Battle_Base_C_GetCharacterCombatStyle::CombatStyle' has a wrong offset!");

// Function BP_jRPG_Character_Battle_Base.BP_jRPG_Character_Battle_Base_C.FlushAdditionalTurnEndEvent
// 0x0002 (0x0002 - 0x0000)
struct BP_jRPG_Character_Battle_Base_C_FlushAdditionalTurnEndEvent final
{
public:
	bool                                          Value;                                             // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          local_output;                                      // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_jRPG_Character_Battle_Base_C_FlushAdditionalTurnEndEvent) == 0x000001, "Wrong alignment on BP_jRPG_Character_Battle_Base_C_FlushAdditionalTurnEndEvent");
static_assert(sizeof(BP_jRPG_Character_Battle_Base_C_FlushAdditionalTurnEndEvent) == 0x000002, "Wrong size on BP_jRPG_Character_Battle_Base_C_FlushAdditionalTurnEndEvent");
static_assert(offsetof(BP_jRPG_Character_Battle_Base_C_FlushAdditionalTurnEndEvent, Value) == 0x000000, "Member 'BP_jRPG_Character_Battle_Base_C_FlushAdditionalTurnEndEvent::Value' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Character_Battle_Base_C_FlushAdditionalTurnEndEvent, local_output) == 0x000001, "Member 'BP_jRPG_Character_Battle_Base_C_FlushAdditionalTurnEndEvent::local_output' has a wrong offset!");

// Function BP_jRPG_Character_Battle_Base.BP_jRPG_Character_Battle_Base_C.HasFinisherSequence
// 0x0002 (0x0002 - 0x0000)
struct BP_jRPG_Character_Battle_Base_C_HasFinisherSequence final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_jRPG_Character_Battle_Base_C_HasFinisherSequence) == 0x000001, "Wrong alignment on BP_jRPG_Character_Battle_Base_C_HasFinisherSequence");
static_assert(sizeof(BP_jRPG_Character_Battle_Base_C_HasFinisherSequence) == 0x000002, "Wrong size on BP_jRPG_Character_Battle_Base_C_HasFinisherSequence");
static_assert(offsetof(BP_jRPG_Character_Battle_Base_C_HasFinisherSequence, ReturnValue) == 0x000000, "Member 'BP_jRPG_Character_Battle_Base_C_HasFinisherSequence::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Character_Battle_Base_C_HasFinisherSequence, CallFunc_IsValidSoftObjectReference_ReturnValue) == 0x000001, "Member 'BP_jRPG_Character_Battle_Base_C_HasFinisherSequence::CallFunc_IsValidSoftObjectReference_ReturnValue' has a wrong offset!");

// Function BP_jRPG_Character_Battle_Base.BP_jRPG_Character_Battle_Base_C.GetTransformForBattleSequenceSnapping
// 0x0130 (0x0130 - 0x0000)
struct BP_jRPG_Character_Battle_Base_C_GetTransformForBattleSequenceSnapping final
{
public:
	struct FTransform                             ReturnValue;                                       // 0x0000(0x0060)(ConstParm, Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0060(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue_1;               // 0x00D0(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_jRPG_Character_Battle_Base_C_GetTransformForBattleSequenceSnapping) == 0x000010, "Wrong alignment on BP_jRPG_Character_Battle_Base_C_GetTransformForBattleSequenceSnapping");
static_assert(sizeof(BP_jRPG_Character_Battle_Base_C_GetTransformForBattleSequenceSnapping) == 0x000130, "Wrong size on BP_jRPG_Character_Battle_Base_C_GetTransformForBattleSequenceSnapping");
static_assert(offsetof(BP_jRPG_Character_Battle_Base_C_GetTransformForBattleSequenceSnapping, ReturnValue) == 0x000000, "Member 'BP_jRPG_Character_Battle_Base_C_GetTransformForBattleSequenceSnapping::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Character_Battle_Base_C_GetTransformForBattleSequenceSnapping, CallFunc_GetTransform_ReturnValue) == 0x000060, "Member 'BP_jRPG_Character_Battle_Base_C_GetTransformForBattleSequenceSnapping::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Character_Battle_Base_C_GetTransformForBattleSequenceSnapping, CallFunc_GetOwner_ReturnValue) == 0x0000C0, "Member 'BP_jRPG_Character_Battle_Base_C_GetTransformForBattleSequenceSnapping::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Character_Battle_Base_C_GetTransformForBattleSequenceSnapping, CallFunc_IsValid_ReturnValue) == 0x0000C8, "Member 'BP_jRPG_Character_Battle_Base_C_GetTransformForBattleSequenceSnapping::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Character_Battle_Base_C_GetTransformForBattleSequenceSnapping, CallFunc_GetTransform_ReturnValue_1) == 0x0000D0, "Member 'BP_jRPG_Character_Battle_Base_C_GetTransformForBattleSequenceSnapping::CallFunc_GetTransform_ReturnValue_1' has a wrong offset!");

// Function BP_jRPG_Character_Battle_Base.BP_jRPG_Character_Battle_Base_C.AddLifeLinkedCharacter
// 0x0010 (0x0010 - 0x0000)
struct BP_jRPG_Character_Battle_Base_C_AddLifeLinkedCharacter final
{
public:
	class ABP_jRPG_Character_Battle_Base_C*       LifeLinkedCharacter;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue_1;            // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_jRPG_Character_Battle_Base_C_AddLifeLinkedCharacter) == 0x000008, "Wrong alignment on BP_jRPG_Character_Battle_Base_C_AddLifeLinkedCharacter");
static_assert(sizeof(BP_jRPG_Character_Battle_Base_C_AddLifeLinkedCharacter) == 0x000010, "Wrong size on BP_jRPG_Character_Battle_Base_C_AddLifeLinkedCharacter");
static_assert(offsetof(BP_jRPG_Character_Battle_Base_C_AddLifeLinkedCharacter, LifeLinkedCharacter) == 0x000000, "Member 'BP_jRPG_Character_Battle_Base_C_AddLifeLinkedCharacter::LifeLinkedCharacter' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Character_Battle_Base_C_AddLifeLinkedCharacter, CallFunc_Array_AddUnique_ReturnValue) == 0x000008, "Member 'BP_jRPG_Character_Battle_Base_C_AddLifeLinkedCharacter::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Character_Battle_Base_C_AddLifeLinkedCharacter, CallFunc_Array_AddUnique_ReturnValue_1) == 0x00000C, "Member 'BP_jRPG_Character_Battle_Base_C_AddLifeLinkedCharacter::CallFunc_Array_AddUnique_ReturnValue_1' has a wrong offset!");

// Function BP_jRPG_Character_Battle_Base.BP_jRPG_Character_Battle_Base_C.IsLifeLinkedMaster
// 0x0001 (0x0001 - 0x0000)
struct BP_jRPG_Character_Battle_Base_C_IsLifeLinkedMaster final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_jRPG_Character_Battle_Base_C_IsLifeLinkedMaster) == 0x000001, "Wrong alignment on BP_jRPG_Character_Battle_Base_C_IsLifeLinkedMaster");
static_assert(sizeof(BP_jRPG_Character_Battle_Base_C_IsLifeLinkedMaster) == 0x000001, "Wrong size on BP_jRPG_Character_Battle_Base_C_IsLifeLinkedMaster");
static_assert(offsetof(BP_jRPG_Character_Battle_Base_C_IsLifeLinkedMaster, ReturnValue) == 0x000000, "Member 'BP_jRPG_Character_Battle_Base_C_IsLifeLinkedMaster::ReturnValue' has a wrong offset!");

// Function BP_jRPG_Character_Battle_Base.BP_jRPG_Character_Battle_Base_C.IsLifeLinked
// 0x0003 (0x0003 - 0x0000)
struct BP_jRPG_Character_Battle_Base_C_IsLifeLinked final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsEmpty_ReturnValue;                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_jRPG_Character_Battle_Base_C_IsLifeLinked) == 0x000001, "Wrong alignment on BP_jRPG_Character_Battle_Base_C_IsLifeLinked");
static_assert(sizeof(BP_jRPG_Character_Battle_Base_C_IsLifeLinked) == 0x000003, "Wrong size on BP_jRPG_Character_Battle_Base_C_IsLifeLinked");
static_assert(offsetof(BP_jRPG_Character_Battle_Base_C_IsLifeLinked, ReturnValue) == 0x000000, "Member 'BP_jRPG_Character_Battle_Base_C_IsLifeLinked::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Character_Battle_Base_C_IsLifeLinked, CallFunc_Array_IsEmpty_ReturnValue) == 0x000001, "Member 'BP_jRPG_Character_Battle_Base_C_IsLifeLinked::CallFunc_Array_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Character_Battle_Base_C_IsLifeLinked, CallFunc_Not_PreBool_ReturnValue) == 0x000002, "Member 'BP_jRPG_Character_Battle_Base_C_IsLifeLinked::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function BP_jRPG_Character_Battle_Base.BP_jRPG_Character_Battle_Base_C.GetLocationForSequenceSnapping
// 0x0040 (0x0040 - 0x0000)
struct BP_jRPG_Character_Battle_Base_C_GetLocationForSequenceSnapping final
{
public:
	struct FVector                                InitialLocation;                                   // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_jRPG_Character_Battle_Base_C*       CallFunc_GetCharacterBattleBase_jRPG_CharacterBattleBase; // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetCharacterBattleBase_IsValid;           // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_jRPG_Character_Battle_Base_C_GetLocationForSequenceSnapping) == 0x000008, "Wrong alignment on BP_jRPG_Character_Battle_Base_C_GetLocationForSequenceSnapping");
static_assert(sizeof(BP_jRPG_Character_Battle_Base_C_GetLocationForSequenceSnapping) == 0x000040, "Wrong size on BP_jRPG_Character_Battle_Base_C_GetLocationForSequenceSnapping");
static_assert(offsetof(BP_jRPG_Character_Battle_Base_C_GetLocationForSequenceSnapping, InitialLocation) == 0x000000, "Member 'BP_jRPG_Character_Battle_Base_C_GetLocationForSequenceSnapping::InitialLocation' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Character_Battle_Base_C_GetLocationForSequenceSnapping, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000018, "Member 'BP_jRPG_Character_Battle_Base_C_GetLocationForSequenceSnapping::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Character_Battle_Base_C_GetLocationForSequenceSnapping, CallFunc_GetCharacterBattleBase_jRPG_CharacterBattleBase) == 0x000030, "Member 'BP_jRPG_Character_Battle_Base_C_GetLocationForSequenceSnapping::CallFunc_GetCharacterBattleBase_jRPG_CharacterBattleBase' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Character_Battle_Base_C_GetLocationForSequenceSnapping, CallFunc_GetCharacterBattleBase_IsValid) == 0x000038, "Member 'BP_jRPG_Character_Battle_Base_C_GetLocationForSequenceSnapping::CallFunc_GetCharacterBattleBase_IsValid' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Character_Battle_Base_C_GetLocationForSequenceSnapping, CallFunc_IsValid_ReturnValue) == 0x000039, "Member 'BP_jRPG_Character_Battle_Base_C_GetLocationForSequenceSnapping::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_jRPG_Character_Battle_Base.BP_jRPG_Character_Battle_Base_C.GetCounterDamageLevelMultiplier
// 0x0040 (0x0040 - 0x0000)
struct BP_jRPG_Character_Battle_Base_C_GetCounterDamageLevelMultiplier final
{
public:
	double                                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_BalancingTableFloatEntry            CallFunc_GetDataTableRowFromName_OutRow;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_jRPG_GI_Custom_C*                   CallFunc_GetCustomGI_ReturnValue;                  // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_CharacterData_C*                    CallFunc_GetCharacterByID_CharacterData;           // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_jRPG_Character_Battle_Base_C_GetCounterDamageLevelMultiplier) == 0x000008, "Wrong alignment on BP_jRPG_Character_Battle_Base_C_GetCounterDamageLevelMultiplier");
static_assert(sizeof(BP_jRPG_Character_Battle_Base_C_GetCounterDamageLevelMultiplier) == 0x000040, "Wrong size on BP_jRPG_Character_Battle_Base_C_GetCounterDamageLevelMultiplier");
static_assert(offsetof(BP_jRPG_Character_Battle_Base_C_GetCounterDamageLevelMultiplier, ReturnValue) == 0x000000, "Member 'BP_jRPG_Character_Battle_Base_C_GetCounterDamageLevelMultiplier::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Character_Battle_Base_C_GetCounterDamageLevelMultiplier, CallFunc_GetDataTableRowFromName_OutRow) == 0x000008, "Member 'BP_jRPG_Character_Battle_Base_C_GetCounterDamageLevelMultiplier::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Character_Battle_Base_C_GetCounterDamageLevelMultiplier, CallFunc_GetCustomGI_ReturnValue) == 0x000010, "Member 'BP_jRPG_Character_Battle_Base_C_GetCounterDamageLevelMultiplier::CallFunc_GetCustomGI_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Character_Battle_Base_C_GetCounterDamageLevelMultiplier, CallFunc_GetCharacterByID_CharacterData) == 0x000018, "Member 'BP_jRPG_Character_Battle_Base_C_GetCounterDamageLevelMultiplier::CallFunc_GetCharacterByID_CharacterData' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Character_Battle_Base_C_GetCounterDamageLevelMultiplier, CallFunc_Subtract_IntInt_ReturnValue) == 0x000020, "Member 'BP_jRPG_Character_Battle_Base_C_GetCounterDamageLevelMultiplier::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Character_Battle_Base_C_GetCounterDamageLevelMultiplier, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000028, "Member 'BP_jRPG_Character_Battle_Base_C_GetCounterDamageLevelMultiplier::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Character_Battle_Base_C_GetCounterDamageLevelMultiplier, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000030, "Member 'BP_jRPG_Character_Battle_Base_C_GetCounterDamageLevelMultiplier::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Character_Battle_Base_C_GetCounterDamageLevelMultiplier, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000038, "Member 'BP_jRPG_Character_Battle_Base_C_GetCounterDamageLevelMultiplier::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");

// Function BP_jRPG_Character_Battle_Base.BP_jRPG_Character_Battle_Base_C.PlayBattleDialogueLine
// 0x0008 (0x0008 - 0x0000)
struct BP_jRPG_Character_Battle_Base_C_PlayBattleDialogueLine final
{
public:
	class USoundBase*                             SoundAsset;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_jRPG_Character_Battle_Base_C_PlayBattleDialogueLine) == 0x000008, "Wrong alignment on BP_jRPG_Character_Battle_Base_C_PlayBattleDialogueLine");
static_assert(sizeof(BP_jRPG_Character_Battle_Base_C_PlayBattleDialogueLine) == 0x000008, "Wrong size on BP_jRPG_Character_Battle_Base_C_PlayBattleDialogueLine");
static_assert(offsetof(BP_jRPG_Character_Battle_Base_C_PlayBattleDialogueLine, SoundAsset) == 0x000000, "Member 'BP_jRPG_Character_Battle_Base_C_PlayBattleDialogueLine::SoundAsset' has a wrong offset!");

// Function BP_jRPG_Character_Battle_Base.BP_jRPG_Character_Battle_Base_C.PlaySkillBattleLine
// 0x0008 (0x0008 - 0x0000)
struct BP_jRPG_Character_Battle_Base_C_PlaySkillBattleLine final
{
public:
	class USoundBase*                             SoundAsset;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_jRPG_Character_Battle_Base_C_PlaySkillBattleLine) == 0x000008, "Wrong alignment on BP_jRPG_Character_Battle_Base_C_PlaySkillBattleLine");
static_assert(sizeof(BP_jRPG_Character_Battle_Base_C_PlaySkillBattleLine) == 0x000008, "Wrong size on BP_jRPG_Character_Battle_Base_C_PlaySkillBattleLine");
static_assert(offsetof(BP_jRPG_Character_Battle_Base_C_PlaySkillBattleLine, SoundAsset) == 0x000000, "Member 'BP_jRPG_Character_Battle_Base_C_PlaySkillBattleLine::SoundAsset' has a wrong offset!");

// Function BP_jRPG_Character_Battle_Base.BP_jRPG_Character_Battle_Base_C.GetBattleLineModel
// 0x0010 (0x0010 - 0x0000)
struct BP_jRPG_Character_Battle_Base_C_GetBattleLineModel final
{
public:
	class UBP_BattleLinesModel_Base_C*            ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash)
	class UBP_BattleLinesModel_Base_C*            CallFunc_GetBattleLineModel_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_jRPG_Character_Battle_Base_C_GetBattleLineModel) == 0x000008, "Wrong alignment on BP_jRPG_Character_Battle_Base_C_GetBattleLineModel");
static_assert(sizeof(BP_jRPG_Character_Battle_Base_C_GetBattleLineModel) == 0x000010, "Wrong size on BP_jRPG_Character_Battle_Base_C_GetBattleLineModel");
static_assert(offsetof(BP_jRPG_Character_Battle_Base_C_GetBattleLineModel, ReturnValue) == 0x000000, "Member 'BP_jRPG_Character_Battle_Base_C_GetBattleLineModel::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Character_Battle_Base_C_GetBattleLineModel, CallFunc_GetBattleLineModel_ReturnValue) == 0x000008, "Member 'BP_jRPG_Character_Battle_Base_C_GetBattleLineModel::CallFunc_GetBattleLineModel_ReturnValue' has a wrong offset!");

// Function BP_jRPG_Character_Battle_Base.BP_jRPG_Character_Battle_Base_C.ApplyDifficultySettings
// 0x0070 (0x0070 - 0x0000)
struct BP_jRPG_Character_Battle_Base_C_ApplyDifficultySettings final
{
public:
	struct FS_BalancingTableFloatEntry            CallFunc_GetDataTableRowFromName_OutRow;           // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_BalancingTableFloatEntry            CallFunc_GetDataTableRowFromName_OutRow_1;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_GameDifficulty                              Temp_byte_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_BalancingTableFloatEntry            CallFunc_GetDataTableRowFromName_OutRow_2;         // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_GameDifficulty                              Temp_byte_Variable_1;                              // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAC_jRPG_BattleManager_C*               CallFunc_GetBattleManager_ReturnValue;             // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FS_BalancingTableFloatEntry            CallFunc_GetDataTableRowFromName_OutRow_3;         // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_GameDifficulty                              CallFunc_GetCurrentBattleDifficulty_ReturnValue;   // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_BalancingTableFloatEntry            CallFunc_GetDataTableRowFromName_OutRow_4;         // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_BalancingTableFloatEntry            CallFunc_GetDataTableRowFromName_OutRow_5;         // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAC_jRPG_BattleManager_C*               CallFunc_GetBattleManager_ReturnValue_1;           // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FS_BalancingTableFloatEntry            K2Node_Select_Default;                             // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_GameDifficulty                              CallFunc_GetCurrentBattleDifficulty_ReturnValue_1; // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_BalancingTableFloatEntry            K2Node_Select_Default_1;                           // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_jRPG_Character_Battle_Base_C_ApplyDifficultySettings) == 0x000008, "Wrong alignment on BP_jRPG_Character_Battle_Base_C_ApplyDifficultySettings");
static_assert(sizeof(BP_jRPG_Character_Battle_Base_C_ApplyDifficultySettings) == 0x000070, "Wrong size on BP_jRPG_Character_Battle_Base_C_ApplyDifficultySettings");
static_assert(offsetof(BP_jRPG_Character_Battle_Base_C_ApplyDifficultySettings, CallFunc_GetDataTableRowFromName_OutRow) == 0x000000, "Member 'BP_jRPG_Character_Battle_Base_C_ApplyDifficultySettings::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Character_Battle_Base_C_ApplyDifficultySettings, CallFunc_GetDataTableRowFromName_OutRow_1) == 0x000008, "Member 'BP_jRPG_Character_Battle_Base_C_ApplyDifficultySettings::CallFunc_GetDataTableRowFromName_OutRow_1' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Character_Battle_Base_C_ApplyDifficultySettings, Temp_byte_Variable) == 0x000010, "Member 'BP_jRPG_Character_Battle_Base_C_ApplyDifficultySettings::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Character_Battle_Base_C_ApplyDifficultySettings, CallFunc_GetDataTableRowFromName_OutRow_2) == 0x000018, "Member 'BP_jRPG_Character_Battle_Base_C_ApplyDifficultySettings::CallFunc_GetDataTableRowFromName_OutRow_2' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Character_Battle_Base_C_ApplyDifficultySettings, Temp_byte_Variable_1) == 0x000020, "Member 'BP_jRPG_Character_Battle_Base_C_ApplyDifficultySettings::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Character_Battle_Base_C_ApplyDifficultySettings, CallFunc_GetBattleManager_ReturnValue) == 0x000028, "Member 'BP_jRPG_Character_Battle_Base_C_ApplyDifficultySettings::CallFunc_GetBattleManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Character_Battle_Base_C_ApplyDifficultySettings, CallFunc_GetDataTableRowFromName_OutRow_3) == 0x000030, "Member 'BP_jRPG_Character_Battle_Base_C_ApplyDifficultySettings::CallFunc_GetDataTableRowFromName_OutRow_3' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Character_Battle_Base_C_ApplyDifficultySettings, CallFunc_GetCurrentBattleDifficulty_ReturnValue) == 0x000038, "Member 'BP_jRPG_Character_Battle_Base_C_ApplyDifficultySettings::CallFunc_GetCurrentBattleDifficulty_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Character_Battle_Base_C_ApplyDifficultySettings, CallFunc_GetDataTableRowFromName_OutRow_4) == 0x000040, "Member 'BP_jRPG_Character_Battle_Base_C_ApplyDifficultySettings::CallFunc_GetDataTableRowFromName_OutRow_4' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Character_Battle_Base_C_ApplyDifficultySettings, CallFunc_GetDataTableRowFromName_OutRow_5) == 0x000048, "Member 'BP_jRPG_Character_Battle_Base_C_ApplyDifficultySettings::CallFunc_GetDataTableRowFromName_OutRow_5' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Character_Battle_Base_C_ApplyDifficultySettings, CallFunc_GetBattleManager_ReturnValue_1) == 0x000050, "Member 'BP_jRPG_Character_Battle_Base_C_ApplyDifficultySettings::CallFunc_GetBattleManager_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Character_Battle_Base_C_ApplyDifficultySettings, K2Node_Select_Default) == 0x000058, "Member 'BP_jRPG_Character_Battle_Base_C_ApplyDifficultySettings::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Character_Battle_Base_C_ApplyDifficultySettings, CallFunc_GetCurrentBattleDifficulty_ReturnValue_1) == 0x000060, "Member 'BP_jRPG_Character_Battle_Base_C_ApplyDifficultySettings::CallFunc_GetCurrentBattleDifficulty_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Character_Battle_Base_C_ApplyDifficultySettings, K2Node_Select_Default_1) == 0x000068, "Member 'BP_jRPG_Character_Battle_Base_C_ApplyDifficultySettings::K2Node_Select_Default_1' has a wrong offset!");

// Function BP_jRPG_Character_Battle_Base.BP_jRPG_Character_Battle_Base_C.Internal_SetUniqueMechanicOverpoweredState
// 0x0002 (0x0002 - 0x0000)
struct BP_jRPG_Character_Battle_Base_C_Internal_SetUniqueMechanicOverpoweredState final
{
public:
	bool                                          Enabled;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_jRPG_Character_Battle_Base_C_Internal_SetUniqueMechanicOverpoweredState) == 0x000001, "Wrong alignment on BP_jRPG_Character_Battle_Base_C_Internal_SetUniqueMechanicOverpoweredState");
static_assert(sizeof(BP_jRPG_Character_Battle_Base_C_Internal_SetUniqueMechanicOverpoweredState) == 0x000002, "Wrong size on BP_jRPG_Character_Battle_Base_C_Internal_SetUniqueMechanicOverpoweredState");
static_assert(offsetof(BP_jRPG_Character_Battle_Base_C_Internal_SetUniqueMechanicOverpoweredState, Enabled) == 0x000000, "Member 'BP_jRPG_Character_Battle_Base_C_Internal_SetUniqueMechanicOverpoweredState::Enabled' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Character_Battle_Base_C_Internal_SetUniqueMechanicOverpoweredState, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000001, "Member 'BP_jRPG_Character_Battle_Base_C_Internal_SetUniqueMechanicOverpoweredState::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");

// Function BP_jRPG_Character_Battle_Base.BP_jRPG_Character_Battle_Base_C.GetParryImmuneDuration
// 0x0058 (0x0058 - 0x0000)
struct BP_jRPG_Character_Battle_Base_C_GetParryImmuneDuration final
{
public:
	double                                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAC_jRPG_BattleManager_C*               CallFunc_GetBattleManager_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UModifierStack_Float*                   CallFunc_GetParryWindowModifier_Stack;             // 0x0010(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UModifierStack_Float*                   CallFunc_GetGlobalParryWindowModifier_Stack;       // 0x0018(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	float                                         CallFunc_GetCurrentValue_ReturnValue;              // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCurrentValue_ReturnValue_1;            // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_B_ImplicitCast;          // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_B_ImplicitCast_1;        // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_jRPG_Character_Battle_Base_C_GetParryImmuneDuration) == 0x000008, "Wrong alignment on BP_jRPG_Character_Battle_Base_C_GetParryImmuneDuration");
static_assert(sizeof(BP_jRPG_Character_Battle_Base_C_GetParryImmuneDuration) == 0x000058, "Wrong size on BP_jRPG_Character_Battle_Base_C_GetParryImmuneDuration");
static_assert(offsetof(BP_jRPG_Character_Battle_Base_C_GetParryImmuneDuration, ReturnValue) == 0x000000, "Member 'BP_jRPG_Character_Battle_Base_C_GetParryImmuneDuration::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Character_Battle_Base_C_GetParryImmuneDuration, CallFunc_GetBattleManager_ReturnValue) == 0x000008, "Member 'BP_jRPG_Character_Battle_Base_C_GetParryImmuneDuration::CallFunc_GetBattleManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Character_Battle_Base_C_GetParryImmuneDuration, CallFunc_GetParryWindowModifier_Stack) == 0x000010, "Member 'BP_jRPG_Character_Battle_Base_C_GetParryImmuneDuration::CallFunc_GetParryWindowModifier_Stack' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Character_Battle_Base_C_GetParryImmuneDuration, CallFunc_GetGlobalParryWindowModifier_Stack) == 0x000018, "Member 'BP_jRPG_Character_Battle_Base_C_GetParryImmuneDuration::CallFunc_GetGlobalParryWindowModifier_Stack' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Character_Battle_Base_C_GetParryImmuneDuration, CallFunc_GetCurrentValue_ReturnValue) == 0x000020, "Member 'BP_jRPG_Character_Battle_Base_C_GetParryImmuneDuration::CallFunc_GetCurrentValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Character_Battle_Base_C_GetParryImmuneDuration, CallFunc_GetCurrentValue_ReturnValue_1) == 0x000024, "Member 'BP_jRPG_Character_Battle_Base_C_GetParryImmuneDuration::CallFunc_GetCurrentValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Character_Battle_Base_C_GetParryImmuneDuration, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000028, "Member 'BP_jRPG_Character_Battle_Base_C_GetParryImmuneDuration::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Character_Battle_Base_C_GetParryImmuneDuration, CallFunc_Add_DoubleDouble_ReturnValue_1) == 0x000030, "Member 'BP_jRPG_Character_Battle_Base_C_GetParryImmuneDuration::CallFunc_Add_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Character_Battle_Base_C_GetParryImmuneDuration, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000038, "Member 'BP_jRPG_Character_Battle_Base_C_GetParryImmuneDuration::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Character_Battle_Base_C_GetParryImmuneDuration, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000040, "Member 'BP_jRPG_Character_Battle_Base_C_GetParryImmuneDuration::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
