#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_jRPG_GI_Custom

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "S_LevelSpawnPointsData_structs.hpp"
#include "Engine_structs.hpp"
#include "S_UINotificationPool_structs.hpp"
#include "S_InteractiveMusicParameters_structs.hpp"
#include "S_UIFavoritePool_structs.hpp"
#include "E_CharacterList_structs.hpp"
#include "FLevelDataEntry_structs.hpp"
#include "FPassiveEffectProgression_structs.hpp"
#include "FPassiveEffect_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "S_AreaAudioParameters_structs.hpp"
#include "E_InteractiveMusicContext_structs.hpp"
#include "S_AudioLevelParameters_structs.hpp"
#include "SandFall_structs.hpp"
#include "S_GameplayPauseParameters_structs.hpp"
#include "S_jRPG_PartySlot_structs.hpp"
#include "FVendorState_structs.hpp"
#include "S_CameraOverrideParameters_structs.hpp"
#include "S_GameFlowTransitionRequest_structs.hpp"
#include "S_jRPG_Item_DynamicData_structs.hpp"
#include "S_jRPG_Item_StaticData_structs.hpp"
#include "S_LevelSpawnPointData_structs.hpp"
#include "S_ManorDoors_structs.hpp"


namespace SDK::Params
{

// Function BP_jRPG_GI_Custom.BP_jRPG_GI_Custom_C.AddInteractedDialogues
// 0x0014 (0x0014 - 0x0000)
struct BP_jRPG_GI_Custom_C_AddInteractedDialogues final
{
public:
	struct FGuid                                  DialogueGUID;                                      // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         DialogueStage;                                     // 0x0010(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_jRPG_GI_Custom_C_AddInteractedDialogues) == 0x000004, "Wrong alignment on BP_jRPG_GI_Custom_C_AddInteractedDialogues");
static_assert(sizeof(BP_jRPG_GI_Custom_C_AddInteractedDialogues) == 0x000014, "Wrong size on BP_jRPG_GI_Custom_C_AddInteractedDialogues");
static_assert(offsetof(BP_jRPG_GI_Custom_C_AddInteractedDialogues, DialogueGUID) == 0x000000, "Member 'BP_jRPG_GI_Custom_C_AddInteractedDialogues::DialogueGUID' has a wrong offset!");
static_assert(offsetof(BP_jRPG_GI_Custom_C_AddInteractedDialogues, DialogueStage) == 0x000010, "Member 'BP_jRPG_GI_Custom_C_AddInteractedDialogues::DialogueStage' has a wrong offset!");

// Function BP_jRPG_GI_Custom.BP_jRPG_GI_Custom_C.AddSkinToCollection
// 0x0010 (0x0010 - 0x0000)
struct BP_jRPG_GI_Custom_C_AddSkinToCollection final
{
public:
	class FName                                   Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   SkinToAdd;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_jRPG_GI_Custom_C_AddSkinToCollection) == 0x000004, "Wrong alignment on BP_jRPG_GI_Custom_C_AddSkinToCollection");
static_assert(sizeof(BP_jRPG_GI_Custom_C_AddSkinToCollection) == 0x000010, "Wrong size on BP_jRPG_GI_Custom_C_AddSkinToCollection");
static_assert(offsetof(BP_jRPG_GI_Custom_C_AddSkinToCollection, Character) == 0x000000, "Member 'BP_jRPG_GI_Custom_C_AddSkinToCollection::Character' has a wrong offset!");
static_assert(offsetof(BP_jRPG_GI_Custom_C_AddSkinToCollection, SkinToAdd) == 0x000008, "Member 'BP_jRPG_GI_Custom_C_AddSkinToCollection::SkinToAdd' has a wrong offset!");

// Function BP_jRPG_GI_Custom.BP_jRPG_GI_Custom_C.AddToUnlockedMapSections
// 0x0014 (0x0014 - 0x0000)
struct BP_jRPG_GI_Custom_C_AddToUnlockedMapSections final
{
public:
	uint8                                         SectionGrayscale;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         AddedIndex;                                        // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_jRPG_GI_Custom_C_AddToUnlockedMapSections) == 0x000004, "Wrong alignment on BP_jRPG_GI_Custom_C_AddToUnlockedMapSections");
static_assert(sizeof(BP_jRPG_GI_Custom_C_AddToUnlockedMapSections) == 0x000014, "Wrong size on BP_jRPG_GI_Custom_C_AddToUnlockedMapSections");
static_assert(offsetof(BP_jRPG_GI_Custom_C_AddToUnlockedMapSections, SectionGrayscale) == 0x000000, "Member 'BP_jRPG_GI_Custom_C_AddToUnlockedMapSections::SectionGrayscale' has a wrong offset!");
static_assert(offsetof(BP_jRPG_GI_Custom_C_AddToUnlockedMapSections, AddedIndex) == 0x000004, "Member 'BP_jRPG_GI_Custom_C_AddToUnlockedMapSections::AddedIndex' has a wrong offset!");
static_assert(offsetof(BP_jRPG_GI_Custom_C_AddToUnlockedMapSections, CallFunc_Array_Contains_ReturnValue) == 0x000008, "Member 'BP_jRPG_GI_Custom_C_AddToUnlockedMapSections::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_GI_Custom_C_AddToUnlockedMapSections, CallFunc_Array_Add_ReturnValue) == 0x00000C, "Member 'BP_jRPG_GI_Custom_C_AddToUnlockedMapSections::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_GI_Custom_C_AddToUnlockedMapSections, CallFunc_Not_PreBool_ReturnValue) == 0x000010, "Member 'BP_jRPG_GI_Custom_C_AddToUnlockedMapSections::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function BP_jRPG_GI_Custom.BP_jRPG_GI_Custom_C.AddVisitedLevel
// 0x0038 (0x0038 - 0x0000)
struct BP_jRPG_GI_Custom_C_AddVisitedLevel final
{
public:
	class FName                                   VisitedLevel;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FGameplayTag>                   local_SpawnPointList;                              // 0x0008(0x0010)(Edit, BlueprintVisible)
	struct FS_LevelSpawnPointsData                local_LevelSpawnPointsData;                        // 0x0018(0x0018)(Edit, BlueprintVisible, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_jRPG_GI_Custom_C_AddVisitedLevel) == 0x000008, "Wrong alignment on BP_jRPG_GI_Custom_C_AddVisitedLevel");
static_assert(sizeof(BP_jRPG_GI_Custom_C_AddVisitedLevel) == 0x000038, "Wrong size on BP_jRPG_GI_Custom_C_AddVisitedLevel");
static_assert(offsetof(BP_jRPG_GI_Custom_C_AddVisitedLevel, VisitedLevel) == 0x000000, "Member 'BP_jRPG_GI_Custom_C_AddVisitedLevel::VisitedLevel' has a wrong offset!");
static_assert(offsetof(BP_jRPG_GI_Custom_C_AddVisitedLevel, local_SpawnPointList) == 0x000008, "Member 'BP_jRPG_GI_Custom_C_AddVisitedLevel::local_SpawnPointList' has a wrong offset!");
static_assert(offsetof(BP_jRPG_GI_Custom_C_AddVisitedLevel, local_LevelSpawnPointsData) == 0x000018, "Member 'BP_jRPG_GI_Custom_C_AddVisitedLevel::local_LevelSpawnPointsData' has a wrong offset!");
static_assert(offsetof(BP_jRPG_GI_Custom_C_AddVisitedLevel, CallFunc_Array_AddUnique_ReturnValue) == 0x000030, "Member 'BP_jRPG_GI_Custom_C_AddVisitedLevel::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");

// Function BP_jRPG_GI_Custom.BP_jRPG_GI_Custom_C.AdjustAmbienceColume
// 0x000C (0x000C - 0x0000)
struct BP_jRPG_GI_Custom_C_AdjustAmbienceColume final
{
public:
	float                                         AdjustVolumeDuration;                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AdjustVolumeLevel;                                 // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAudioFaderCurve                              FadeCurve;                                         // 0x0008(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_jRPG_GI_Custom_C_AdjustAmbienceColume) == 0x000004, "Wrong alignment on BP_jRPG_GI_Custom_C_AdjustAmbienceColume");
static_assert(sizeof(BP_jRPG_GI_Custom_C_AdjustAmbienceColume) == 0x00000C, "Wrong size on BP_jRPG_GI_Custom_C_AdjustAmbienceColume");
static_assert(offsetof(BP_jRPG_GI_Custom_C_AdjustAmbienceColume, AdjustVolumeDuration) == 0x000000, "Member 'BP_jRPG_GI_Custom_C_AdjustAmbienceColume::AdjustVolumeDuration' has a wrong offset!");
static_assert(offsetof(BP_jRPG_GI_Custom_C_AdjustAmbienceColume, AdjustVolumeLevel) == 0x000004, "Member 'BP_jRPG_GI_Custom_C_AdjustAmbienceColume::AdjustVolumeLevel' has a wrong offset!");
static_assert(offsetof(BP_jRPG_GI_Custom_C_AdjustAmbienceColume, FadeCurve) == 0x000008, "Member 'BP_jRPG_GI_Custom_C_AdjustAmbienceColume::FadeCurve' has a wrong offset!");
static_assert(offsetof(BP_jRPG_GI_Custom_C_AdjustAmbienceColume, CallFunc_IsValid_ReturnValue) == 0x000009, "Member 'BP_jRPG_GI_Custom_C_AdjustAmbienceColume::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_GI_Custom_C_AdjustAmbienceColume, CallFunc_Not_PreBool_ReturnValue) == 0x00000A, "Member 'BP_jRPG_GI_Custom_C_AdjustAmbienceColume::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function BP_jRPG_GI_Custom.BP_jRPG_GI_Custom_C.ApplyAccessibilitySettings
// 0x0018 (0x0018 - 0x0000)
struct BP_jRPG_GI_Custom_C_ApplyAccessibilitySettings final
{
public:
	bool                                          CallFunc_GetBoolCVar_ReturnValue;                  // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UConfigurableGameUserSettings*          CallFunc_GetConfigurableGameUserSettings_GameUserSettings; // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EColorVisionDeficiency                        CallFunc_GetColorVisionDeficiency_ReturnValue;     // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetColorVisionDeficiencyCorrectionSeverity_ReturnValue; // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_jRPG_GI_Custom_C_ApplyAccessibilitySettings) == 0x000008, "Wrong alignment on BP_jRPG_GI_Custom_C_ApplyAccessibilitySettings");
static_assert(sizeof(BP_jRPG_GI_Custom_C_ApplyAccessibilitySettings) == 0x000018, "Wrong size on BP_jRPG_GI_Custom_C_ApplyAccessibilitySettings");
static_assert(offsetof(BP_jRPG_GI_Custom_C_ApplyAccessibilitySettings, CallFunc_GetBoolCVar_ReturnValue) == 0x000000, "Member 'BP_jRPG_GI_Custom_C_ApplyAccessibilitySettings::CallFunc_GetBoolCVar_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_GI_Custom_C_ApplyAccessibilitySettings, CallFunc_GetConfigurableGameUserSettings_GameUserSettings) == 0x000008, "Member 'BP_jRPG_GI_Custom_C_ApplyAccessibilitySettings::CallFunc_GetConfigurableGameUserSettings_GameUserSettings' has a wrong offset!");
static_assert(offsetof(BP_jRPG_GI_Custom_C_ApplyAccessibilitySettings, CallFunc_GetColorVisionDeficiency_ReturnValue) == 0x000010, "Member 'BP_jRPG_GI_Custom_C_ApplyAccessibilitySettings::CallFunc_GetColorVisionDeficiency_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_GI_Custom_C_ApplyAccessibilitySettings, CallFunc_GetColorVisionDeficiencyCorrectionSeverity_ReturnValue) == 0x000014, "Member 'BP_jRPG_GI_Custom_C_ApplyAccessibilitySettings::CallFunc_GetColorVisionDeficiencyCorrectionSeverity_ReturnValue' has a wrong offset!");

// Function BP_jRPG_GI_Custom.BP_jRPG_GI_Custom_C.ApplyAllUserSettings
// 0x0018 (0x0018 - 0x0000)
struct BP_jRPG_GI_Custom_C_ApplyAllUserSettings final
{
public:
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_jRPG_Controller_World_C*            K2Node_DynamicCast_AsBP_J_RPG_Controller_World;    // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_jRPG_GI_Custom_C_ApplyAllUserSettings) == 0x000008, "Wrong alignment on BP_jRPG_GI_Custom_C_ApplyAllUserSettings");
static_assert(sizeof(BP_jRPG_GI_Custom_C_ApplyAllUserSettings) == 0x000018, "Wrong size on BP_jRPG_GI_Custom_C_ApplyAllUserSettings");
static_assert(offsetof(BP_jRPG_GI_Custom_C_ApplyAllUserSettings, CallFunc_GetPlayerController_ReturnValue) == 0x000000, "Member 'BP_jRPG_GI_Custom_C_ApplyAllUserSettings::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_GI_Custom_C_ApplyAllUserSettings, K2Node_DynamicCast_AsBP_J_RPG_Controller_World) == 0x000008, "Member 'BP_jRPG_GI_Custom_C_ApplyAllUserSettings::K2Node_DynamicCast_AsBP_J_RPG_Controller_World' has a wrong offset!");
static_assert(offsetof(BP_jRPG_GI_Custom_C_ApplyAllUserSettings, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'BP_jRPG_GI_Custom_C_ApplyAllUserSettings::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BP_jRPG_GI_Custom.BP_jRPG_GI_Custom_C.ApplyPostProcessSettings
// 0x0010 (0x0010 - 0x0000)
struct BP_jRPG_GI_Custom_C_ApplyPostProcessSettings final
{
public:
	class ABP_PostProcess_Global_Sandfall_C*      CallFunc_GetActorOfClass_ReturnValue;              // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_jRPG_GI_Custom_C_ApplyPostProcessSettings) == 0x000008, "Wrong alignment on BP_jRPG_GI_Custom_C_ApplyPostProcessSettings");
static_assert(sizeof(BP_jRPG_GI_Custom_C_ApplyPostProcessSettings) == 0x000010, "Wrong size on BP_jRPG_GI_Custom_C_ApplyPostProcessSettings");
static_assert(offsetof(BP_jRPG_GI_Custom_C_ApplyPostProcessSettings, CallFunc_GetActorOfClass_ReturnValue) == 0x000000, "Member 'BP_jRPG_GI_Custom_C_ApplyPostProcessSettings::CallFunc_GetActorOfClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_GI_Custom_C_ApplyPostProcessSettings, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'BP_jRPG_GI_Custom_C_ApplyPostProcessSettings::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_jRPG_GI_Custom.BP_jRPG_GI_Custom_C.AreAllCharactersDead
// 0x0040 (0x0040 - 0x0000)
struct BP_jRPG_GI_Custom_C_AreAllCharactersDead final
{
public:
	bool                                          AllDead;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          local_hasAliveCharacter;                           // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UBP_CharacterData_C*>            CallFunc_Map_Values_Values;                        // 0x0018(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_CharacterData_C*                    CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_jRPG_GI_Custom_C_AreAllCharactersDead) == 0x000008, "Wrong alignment on BP_jRPG_GI_Custom_C_AreAllCharactersDead");
static_assert(sizeof(BP_jRPG_GI_Custom_C_AreAllCharactersDead) == 0x000040, "Wrong size on BP_jRPG_GI_Custom_C_AreAllCharactersDead");
static_assert(offsetof(BP_jRPG_GI_Custom_C_AreAllCharactersDead, AllDead) == 0x000000, "Member 'BP_jRPG_GI_Custom_C_AreAllCharactersDead::AllDead' has a wrong offset!");
static_assert(offsetof(BP_jRPG_GI_Custom_C_AreAllCharactersDead, local_hasAliveCharacter) == 0x000001, "Member 'BP_jRPG_GI_Custom_C_AreAllCharactersDead::local_hasAliveCharacter' has a wrong offset!");
static_assert(offsetof(BP_jRPG_GI_Custom_C_AreAllCharactersDead, Temp_int_Array_Index_Variable) == 0x000004, "Member 'BP_jRPG_GI_Custom_C_AreAllCharactersDead::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_jRPG_GI_Custom_C_AreAllCharactersDead, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'BP_jRPG_GI_Custom_C_AreAllCharactersDead::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_jRPG_GI_Custom_C_AreAllCharactersDead, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'BP_jRPG_GI_Custom_C_AreAllCharactersDead::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_GI_Custom_C_AreAllCharactersDead, CallFunc_Not_PreBool_ReturnValue) == 0x000010, "Member 'BP_jRPG_GI_Custom_C_AreAllCharactersDead::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_GI_Custom_C_AreAllCharactersDead, CallFunc_Map_Values_Values) == 0x000018, "Member 'BP_jRPG_GI_Custom_C_AreAllCharactersDead::CallFunc_Map_Values_Values' has a wrong offset!");
static_assert(offsetof(BP_jRPG_GI_Custom_C_AreAllCharactersDead, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'BP_jRPG_GI_Custom_C_AreAllCharactersDead::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_GI_Custom_C_AreAllCharactersDead, CallFunc_Array_Get_Item) == 0x000030, "Member 'BP_jRPG_GI_Custom_C_AreAllCharactersDead::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_jRPG_GI_Custom_C_AreAllCharactersDead, CallFunc_Less_IntInt_ReturnValue) == 0x000038, "Member 'BP_jRPG_GI_Custom_C_AreAllCharactersDead::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_GI_Custom_C_AreAllCharactersDead, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000039, "Member 'BP_jRPG_GI_Custom_C_AreAllCharactersDead::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");

// Function BP_jRPG_GI_Custom.BP_jRPG_GI_Custom_C.BindOnSaveLoaded
// 0x0014 (0x0014 - 0x0000)
struct BP_jRPG_GI_Custom_C_BindOnSaveLoaded final
{
public:
	TDelegate<void()>                             Event;                                             // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	bool                                          AlreadyLoaded;                                     // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_jRPG_GI_Custom_C_BindOnSaveLoaded) == 0x000004, "Wrong alignment on BP_jRPG_GI_Custom_C_BindOnSaveLoaded");
static_assert(sizeof(BP_jRPG_GI_Custom_C_BindOnSaveLoaded) == 0x000014, "Wrong size on BP_jRPG_GI_Custom_C_BindOnSaveLoaded");
static_assert(offsetof(BP_jRPG_GI_Custom_C_BindOnSaveLoaded, Event) == 0x000000, "Member 'BP_jRPG_GI_Custom_C_BindOnSaveLoaded::Event' has a wrong offset!");
static_assert(offsetof(BP_jRPG_GI_Custom_C_BindOnSaveLoaded, AlreadyLoaded) == 0x000010, "Member 'BP_jRPG_GI_Custom_C_BindOnSaveLoaded::AlreadyLoaded' has a wrong offset!");

// Function BP_jRPG_GI_Custom.BP_jRPG_GI_Custom_C.CanUseStats
// 0x0038 (0x0038 - 0x0000)
struct BP_jRPG_GI_Custom_C_CanUseStats final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           CallFunc_GetPlatformNameAsTag_ReturnValue;         // 0x0004(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_MakeLiteralGameplayTagContainer_ReturnValue; // 0x0010(0x0020)()
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_jRPG_GI_Custom_C_CanUseStats) == 0x000008, "Wrong alignment on BP_jRPG_GI_Custom_C_CanUseStats");
static_assert(sizeof(BP_jRPG_GI_Custom_C_CanUseStats) == 0x000038, "Wrong size on BP_jRPG_GI_Custom_C_CanUseStats");
static_assert(offsetof(BP_jRPG_GI_Custom_C_CanUseStats, ReturnValue) == 0x000000, "Member 'BP_jRPG_GI_Custom_C_CanUseStats::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_GI_Custom_C_CanUseStats, CallFunc_GetPlatformNameAsTag_ReturnValue) == 0x000004, "Member 'BP_jRPG_GI_Custom_C_CanUseStats::CallFunc_GetPlatformNameAsTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_GI_Custom_C_CanUseStats, CallFunc_MakeLiteralGameplayTagContainer_ReturnValue) == 0x000010, "Member 'BP_jRPG_GI_Custom_C_CanUseStats::CallFunc_MakeLiteralGameplayTagContainer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_GI_Custom_C_CanUseStats, CallFunc_HasTag_ReturnValue) == 0x000030, "Member 'BP_jRPG_GI_Custom_C_CanUseStats::CallFunc_HasTag_ReturnValue' has a wrong offset!");

// Function BP_jRPG_GI_Custom.BP_jRPG_GI_Custom_C.CheckDestroyable
// 0x000C (0x000C - 0x0000)
struct BP_jRPG_GI_Custom_C_CheckDestroyable final
{
public:
	class FName                                   ItemToFind;                                        // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CanDestroy;                                        // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_jRPG_GI_Custom_C_CheckDestroyable) == 0x000004, "Wrong alignment on BP_jRPG_GI_Custom_C_CheckDestroyable");
static_assert(sizeof(BP_jRPG_GI_Custom_C_CheckDestroyable) == 0x00000C, "Wrong size on BP_jRPG_GI_Custom_C_CheckDestroyable");
static_assert(offsetof(BP_jRPG_GI_Custom_C_CheckDestroyable, ItemToFind) == 0x000000, "Member 'BP_jRPG_GI_Custom_C_CheckDestroyable::ItemToFind' has a wrong offset!");
static_assert(offsetof(BP_jRPG_GI_Custom_C_CheckDestroyable, CanDestroy) == 0x000008, "Member 'BP_jRPG_GI_Custom_C_CheckDestroyable::CanDestroy' has a wrong offset!");
static_assert(offsetof(BP_jRPG_GI_Custom_C_CheckDestroyable, CallFunc_Array_Contains_ReturnValue) == 0x000009, "Member 'BP_jRPG_GI_Custom_C_CheckDestroyable::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");

// Function BP_jRPG_GI_Custom.BP_jRPG_GI_Custom_C.CheckDialogueIsAtLeastAtStage
// 0x0070 (0x0070 - 0x0000)
struct BP_jRPG_GI_Custom_C_CheckDialogueIsAtLeastAtStage final
{
public:
	struct FGuid                                  DialogueGUID;                                      // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Stage;                                             // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsAtLeastAtStage;                                  // 0x0014(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<struct FGuid, int32>                     CallFunc_GetInteractedDialogues_InteractedDialogues; // 0x0018(0x0050)()
	int32                                         CallFunc_Map_Find_Value;                           // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x006D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x006E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_jRPG_GI_Custom_C_CheckDialogueIsAtLeastAtStage) == 0x000008, "Wrong alignment on BP_jRPG_GI_Custom_C_CheckDialogueIsAtLeastAtStage");
static_assert(sizeof(BP_jRPG_GI_Custom_C_CheckDialogueIsAtLeastAtStage) == 0x000070, "Wrong size on BP_jRPG_GI_Custom_C_CheckDialogueIsAtLeastAtStage");
static_assert(offsetof(BP_jRPG_GI_Custom_C_CheckDialogueIsAtLeastAtStage, DialogueGUID) == 0x000000, "Member 'BP_jRPG_GI_Custom_C_CheckDialogueIsAtLeastAtStage::DialogueGUID' has a wrong offset!");
static_assert(offsetof(BP_jRPG_GI_Custom_C_CheckDialogueIsAtLeastAtStage, Stage) == 0x000010, "Member 'BP_jRPG_GI_Custom_C_CheckDialogueIsAtLeastAtStage::Stage' has a wrong offset!");
static_assert(offsetof(BP_jRPG_GI_Custom_C_CheckDialogueIsAtLeastAtStage, IsAtLeastAtStage) == 0x000014, "Member 'BP_jRPG_GI_Custom_C_CheckDialogueIsAtLeastAtStage::IsAtLeastAtStage' has a wrong offset!");
static_assert(offsetof(BP_jRPG_GI_Custom_C_CheckDialogueIsAtLeastAtStage, CallFunc_GetInteractedDialogues_InteractedDialogues) == 0x000018, "Member 'BP_jRPG_GI_Custom_C_CheckDialogueIsAtLeastAtStage::CallFunc_GetInteractedDialogues_InteractedDialogues' has a wrong offset!");
static_assert(offsetof(BP_jRPG_GI_Custom_C_CheckDialogueIsAtLeastAtStage, CallFunc_Map_Find_Value) == 0x000068, "Member 'BP_jRPG_GI_Custom_C_CheckDialogueIsAtLeastAtStage::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BP_jRPG_GI_Custom_C_CheckDialogueIsAtLeastAtStage, CallFunc_Map_Find_ReturnValue) == 0x00006C, "Member 'BP_jRPG_GI_Custom_C_CheckDialogueIsAtLeastAtStage::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_GI_Custom_C_CheckDialogueIsAtLeastAtStage, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00006D, "Member 'BP_jRPG_GI_Custom_C_CheckDialogueIsAtLeastAtStage::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_GI_Custom_C_CheckDialogueIsAtLeastAtStage, CallFunc_BooleanAND_ReturnValue) == 0x00006E, "Member 'BP_jRPG_GI_Custom_C_CheckDialogueIsAtLeastAtStage::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BP_jRPG_GI_Custom.BP_jRPG_GI_Custom_C.CheckHasPlayedTutorial
// 0x000C (0x000C - 0x0000)
struct BP_jRPG_GI_Custom_C_CheckHasPlayedTutorial final
{
public:
	class FName                                   TutorialRowName;                                   // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HasPlayed;                                         // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_Value;                           // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_jRPG_GI_Custom_C_CheckHasPlayedTutorial) == 0x000004, "Wrong alignment on BP_jRPG_GI_Custom_C_CheckHasPlayedTutorial");
static_assert(sizeof(BP_jRPG_GI_Custom_C_CheckHasPlayedTutorial) == 0x00000C, "Wrong size on BP_jRPG_GI_Custom_C_CheckHasPlayedTutorial");
static_assert(offsetof(BP_jRPG_GI_Custom_C_CheckHasPlayedTutorial, TutorialRowName) == 0x000000, "Member 'BP_jRPG_GI_Custom_C_CheckHasPlayedTutorial::TutorialRowName' has a wrong offset!");
static_assert(offsetof(BP_jRPG_GI_Custom_C_CheckHasPlayedTutorial, HasPlayed) == 0x000008, "Member 'BP_jRPG_GI_Custom_C_CheckHasPlayedTutorial::HasPlayed' has a wrong offset!");
static_assert(offsetof(BP_jRPG_GI_Custom_C_CheckHasPlayedTutorial, CallFunc_Map_Find_Value) == 0x000009, "Member 'BP_jRPG_GI_Custom_C_CheckHasPlayedTutorial::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BP_jRPG_GI_Custom_C_CheckHasPlayedTutorial, CallFunc_Map_Find_ReturnValue) == 0x00000A, "Member 'BP_jRPG_GI_Custom_C_CheckHasPlayedTutorial::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_GI_Custom_C_CheckHasPlayedTutorial, CallFunc_BooleanAND_ReturnValue) == 0x00000B, "Member 'BP_jRPG_GI_Custom_C_CheckHasPlayedTutorial::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BP_jRPG_GI_Custom.BP_jRPG_GI_Custom_C.CheckInteractionDone
// 0x0040 (0x0040 - 0x0000)
struct BP_jRPG_GI_Custom_C_CheckInteractionDone final
{
public:
	TArray<class FName>                           Interaction;                                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          AllCheckTrue;                                      // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          local_CheckTrue;                                   // 0x0011(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x2];                                       // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_Value;                           // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_Value_1;                         // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_1;                   // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_Value_2;                         // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_2;                   // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_Value_3;                         // 0x0036(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_3;                   // 0x0037(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_Value_4;                         // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_4;                   // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_Value_5;                         // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_5;                   // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_jRPG_GI_Custom_C_CheckInteractionDone) == 0x000008, "Wrong alignment on BP_jRPG_GI_Custom_C_CheckInteractionDone");
static_assert(sizeof(BP_jRPG_GI_Custom_C_CheckInteractionDone) == 0x000040, "Wrong size on BP_jRPG_GI_Custom_C_CheckInteractionDone");
static_assert(offsetof(BP_jRPG_GI_Custom_C_CheckInteractionDone, Interaction) == 0x000000, "Member 'BP_jRPG_GI_Custom_C_CheckInteractionDone::Interaction' has a wrong offset!");
static_assert(offsetof(BP_jRPG_GI_Custom_C_CheckInteractionDone, AllCheckTrue) == 0x000010, "Member 'BP_jRPG_GI_Custom_C_CheckInteractionDone::AllCheckTrue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_GI_Custom_C_CheckInteractionDone, local_CheckTrue) == 0x000011, "Member 'BP_jRPG_GI_Custom_C_CheckInteractionDone::local_CheckTrue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_GI_Custom_C_CheckInteractionDone, CallFunc_Array_Length_ReturnValue) == 0x000014, "Member 'BP_jRPG_GI_Custom_C_CheckInteractionDone::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_GI_Custom_C_CheckInteractionDone, Temp_int_Array_Index_Variable) == 0x000018, "Member 'BP_jRPG_GI_Custom_C_CheckInteractionDone::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_jRPG_GI_Custom_C_CheckInteractionDone, Temp_int_Loop_Counter_Variable) == 0x00001C, "Member 'BP_jRPG_GI_Custom_C_CheckInteractionDone::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_jRPG_GI_Custom_C_CheckInteractionDone, CallFunc_Array_Get_Item) == 0x000020, "Member 'BP_jRPG_GI_Custom_C_CheckInteractionDone::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_jRPG_GI_Custom_C_CheckInteractionDone, CallFunc_NotEqual_NameName_ReturnValue) == 0x000028, "Member 'BP_jRPG_GI_Custom_C_CheckInteractionDone::CallFunc_NotEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_GI_Custom_C_CheckInteractionDone, CallFunc_Less_IntInt_ReturnValue) == 0x000029, "Member 'BP_jRPG_GI_Custom_C_CheckInteractionDone::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_GI_Custom_C_CheckInteractionDone, CallFunc_Add_IntInt_ReturnValue) == 0x00002C, "Member 'BP_jRPG_GI_Custom_C_CheckInteractionDone::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_GI_Custom_C_CheckInteractionDone, CallFunc_Map_Find_Value) == 0x000030, "Member 'BP_jRPG_GI_Custom_C_CheckInteractionDone::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BP_jRPG_GI_Custom_C_CheckInteractionDone, CallFunc_Map_Find_ReturnValue) == 0x000031, "Member 'BP_jRPG_GI_Custom_C_CheckInteractionDone::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_GI_Custom_C_CheckInteractionDone, CallFunc_Map_Find_Value_1) == 0x000032, "Member 'BP_jRPG_GI_Custom_C_CheckInteractionDone::CallFunc_Map_Find_Value_1' has a wrong offset!");
static_assert(offsetof(BP_jRPG_GI_Custom_C_CheckInteractionDone, CallFunc_Map_Find_ReturnValue_1) == 0x000033, "Member 'BP_jRPG_GI_Custom_C_CheckInteractionDone::CallFunc_Map_Find_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_jRPG_GI_Custom_C_CheckInteractionDone, CallFunc_Map_Find_Value_2) == 0x000034, "Member 'BP_jRPG_GI_Custom_C_CheckInteractionDone::CallFunc_Map_Find_Value_2' has a wrong offset!");
static_assert(offsetof(BP_jRPG_GI_Custom_C_CheckInteractionDone, CallFunc_Map_Find_ReturnValue_2) == 0x000035, "Member 'BP_jRPG_GI_Custom_C_CheckInteractionDone::CallFunc_Map_Find_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_jRPG_GI_Custom_C_CheckInteractionDone, CallFunc_Map_Find_Value_3) == 0x000036, "Member 'BP_jRPG_GI_Custom_C_CheckInteractionDone::CallFunc_Map_Find_Value_3' has a wrong offset!");
static_assert(offsetof(BP_jRPG_GI_Custom_C_CheckInteractionDone, CallFunc_Map_Find_ReturnValue_3) == 0x000037, "Member 'BP_jRPG_GI_Custom_C_CheckInteractionDone::CallFunc_Map_Find_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_jRPG_GI_Custom_C_CheckInteractionDone, CallFunc_Map_Find_Value_4) == 0x000038, "Member 'BP_jRPG_GI_Custom_C_CheckInteractionDone::CallFunc_Map_Find_Value_4' has a wrong offset!");
static_assert(offsetof(BP_jRPG_GI_Custom_C_CheckInteractionDone, CallFunc_Map_Find_ReturnValue_4) == 0x000039, "Member 'BP_jRPG_GI_Custom_C_CheckInteractionDone::CallFunc_Map_Find_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_jRPG_GI_Custom_C_CheckInteractionDone, CallFunc_Map_Find_Value_5) == 0x00003A, "Member 'BP_jRPG_GI_Custom_C_CheckInteractionDone::CallFunc_Map_Find_Value_5' has a wrong offset!");
static_assert(offsetof(BP_jRPG_GI_Custom_C_CheckInteractionDone, CallFunc_Map_Find_ReturnValue_5) == 0x00003B, "Member 'BP_jRPG_GI_Custom_C_CheckInteractionDone::CallFunc_Map_Find_ReturnValue_5' has a wrong offset!");

// Function BP_jRPG_GI_Custom.BP_jRPG_GI_Custom_C.CheckInteractiveObjectUnicity
// 0x01D0 (0x01D0 - 0x0000)
struct BP_jRPG_GI_Custom_C_CheckInteractiveObjectUnicity final
{
public:
	class FName                                   InteractiveObjectGlobalID;                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class AActor*                           Actor;                                             // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetCurrentLevelName_ReturnValue;          // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_NameToText_ReturnValue;              // 0x0058(0x0010)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0068(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0078(0x0048)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00C0(0x0048)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10C[0x4];                                      // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0110(0x0010)(ReferenceParm)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0128(0x0010)()
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_NameToText_ReturnValue_1;            // 0x0140(0x0010)()
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_154[0x4];                                      // 0x0154(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0158(0x0048)(HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A1[0x7];                                      // 0x01A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x01A8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x01B8(0x0010)()
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_jRPG_GI_Custom_C_CheckInteractiveObjectUnicity) == 0x000008, "Wrong alignment on BP_jRPG_GI_Custom_C_CheckInteractiveObjectUnicity");
static_assert(sizeof(BP_jRPG_GI_Custom_C_CheckInteractiveObjectUnicity) == 0x0001D0, "Wrong size on BP_jRPG_GI_Custom_C_CheckInteractiveObjectUnicity");
static_assert(offsetof(BP_jRPG_GI_Custom_C_CheckInteractiveObjectUnicity, InteractiveObjectGlobalID) == 0x000000, "Member 'BP_jRPG_GI_Custom_C_CheckInteractiveObjectUnicity::InteractiveObjectGlobalID' has a wrong offset!");
static_assert(offsetof(BP_jRPG_GI_Custom_C_CheckInteractiveObjectUnicity, Actor) == 0x000008, "Member 'BP_jRPG_GI_Custom_C_CheckInteractiveObjectUnicity::Actor' has a wrong offset!");
static_assert(offsetof(BP_jRPG_GI_Custom_C_CheckInteractiveObjectUnicity, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'BP_jRPG_GI_Custom_C_CheckInteractiveObjectUnicity::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_GI_Custom_C_CheckInteractiveObjectUnicity, CallFunc_GetCurrentLevelName_ReturnValue) == 0x000018, "Member 'BP_jRPG_GI_Custom_C_CheckInteractiveObjectUnicity::CallFunc_GetCurrentLevelName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_GI_Custom_C_CheckInteractiveObjectUnicity, CallFunc_GetDisplayName_ReturnValue) == 0x000028, "Member 'BP_jRPG_GI_Custom_C_CheckInteractiveObjectUnicity::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_GI_Custom_C_CheckInteractiveObjectUnicity, CallFunc_Concat_StrStr_ReturnValue) == 0x000038, "Member 'BP_jRPG_GI_Custom_C_CheckInteractiveObjectUnicity::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_GI_Custom_C_CheckInteractiveObjectUnicity, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000048, "Member 'BP_jRPG_GI_Custom_C_CheckInteractiveObjectUnicity::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_jRPG_GI_Custom_C_CheckInteractiveObjectUnicity, CallFunc_Conv_NameToText_ReturnValue) == 0x000058, "Member 'BP_jRPG_GI_Custom_C_CheckInteractiveObjectUnicity::CallFunc_Conv_NameToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_GI_Custom_C_CheckInteractiveObjectUnicity, CallFunc_Conv_StringToText_ReturnValue) == 0x000068, "Member 'BP_jRPG_GI_Custom_C_CheckInteractiveObjectUnicity::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_GI_Custom_C_CheckInteractiveObjectUnicity, K2Node_MakeStruct_FormatArgumentData) == 0x000078, "Member 'BP_jRPG_GI_Custom_C_CheckInteractiveObjectUnicity::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_jRPG_GI_Custom_C_CheckInteractiveObjectUnicity, K2Node_MakeStruct_FormatArgumentData_1) == 0x0000C0, "Member 'BP_jRPG_GI_Custom_C_CheckInteractiveObjectUnicity::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BP_jRPG_GI_Custom_C_CheckInteractiveObjectUnicity, CallFunc_Array_Add_ReturnValue) == 0x000108, "Member 'BP_jRPG_GI_Custom_C_CheckInteractiveObjectUnicity::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_GI_Custom_C_CheckInteractiveObjectUnicity, K2Node_MakeArray_Array) == 0x000110, "Member 'BP_jRPG_GI_Custom_C_CheckInteractiveObjectUnicity::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_jRPG_GI_Custom_C_CheckInteractiveObjectUnicity, CallFunc_Array_Contains_ReturnValue) == 0x000120, "Member 'BP_jRPG_GI_Custom_C_CheckInteractiveObjectUnicity::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_GI_Custom_C_CheckInteractiveObjectUnicity, CallFunc_Format_ReturnValue) == 0x000128, "Member 'BP_jRPG_GI_Custom_C_CheckInteractiveObjectUnicity::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_GI_Custom_C_CheckInteractiveObjectUnicity, CallFunc_Not_PreBool_ReturnValue) == 0x000138, "Member 'BP_jRPG_GI_Custom_C_CheckInteractiveObjectUnicity::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_GI_Custom_C_CheckInteractiveObjectUnicity, CallFunc_Conv_NameToText_ReturnValue_1) == 0x000140, "Member 'BP_jRPG_GI_Custom_C_CheckInteractiveObjectUnicity::CallFunc_Conv_NameToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_jRPG_GI_Custom_C_CheckInteractiveObjectUnicity, CallFunc_Array_Find_ReturnValue) == 0x000150, "Member 'BP_jRPG_GI_Custom_C_CheckInteractiveObjectUnicity::CallFunc_Array_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_GI_Custom_C_CheckInteractiveObjectUnicity, K2Node_MakeStruct_FormatArgumentData_2) == 0x000158, "Member 'BP_jRPG_GI_Custom_C_CheckInteractiveObjectUnicity::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(BP_jRPG_GI_Custom_C_CheckInteractiveObjectUnicity, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0001A0, "Member 'BP_jRPG_GI_Custom_C_CheckInteractiveObjectUnicity::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_GI_Custom_C_CheckInteractiveObjectUnicity, K2Node_MakeArray_Array_1) == 0x0001A8, "Member 'BP_jRPG_GI_Custom_C_CheckInteractiveObjectUnicity::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BP_jRPG_GI_Custom_C_CheckInteractiveObjectUnicity, CallFunc_Format_ReturnValue_1) == 0x0001B8, "Member 'BP_jRPG_GI_Custom_C_CheckInteractiveObjectUnicity::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_jRPG_GI_Custom_C_CheckInteractiveObjectUnicity, CallFunc_Array_AddUnique_ReturnValue) == 0x0001C8, "Member 'BP_jRPG_GI_Custom_C_CheckInteractiveObjectUnicity::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");

// Function BP_jRPG_GI_Custom.BP_jRPG_GI_Custom_C.ComputeAudioParametersForSave
// 0x0098 (0x0098 - 0x0000)
struct BP_jRPG_GI_Custom_C_ComputeAudioParametersForSave final
{
public:
	struct FS_AreaAudioParameters                 AudioParameters;                                   // 0x0000(0x0038)(Parm, OutParm, NoDestructor, HasGetValueTypeHash)
	class UBP_AudioControlSystem_C*               CallFunc_GetAudioControlSystem_AudioControlSystem; // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundControlBusMix*                    CallFunc_GetLastActivatedExplorationControlBusMix_ControlBusMix; // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	E_InteractiveMusicContext                     CallFunc_GetCurrentSoundData_Context;              // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             CallFunc_GetCurrentSoundData_Sound;                // 0x0050(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   CallFunc_GetCurrentSoundData_LastAudioTrigger;     // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_AreaAudioParameters                 K2Node_MakeStruct_S_AreaAudioParameters;           // 0x0060(0x0038)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_jRPG_GI_Custom_C_ComputeAudioParametersForSave) == 0x000008, "Wrong alignment on BP_jRPG_GI_Custom_C_ComputeAudioParametersForSave");
static_assert(sizeof(BP_jRPG_GI_Custom_C_ComputeAudioParametersForSave) == 0x000098, "Wrong size on BP_jRPG_GI_Custom_C_ComputeAudioParametersForSave");
static_assert(offsetof(BP_jRPG_GI_Custom_C_ComputeAudioParametersForSave, AudioParameters) == 0x000000, "Member 'BP_jRPG_GI_Custom_C_ComputeAudioParametersForSave::AudioParameters' has a wrong offset!");
static_assert(offsetof(BP_jRPG_GI_Custom_C_ComputeAudioParametersForSave, CallFunc_GetAudioControlSystem_AudioControlSystem) == 0x000038, "Member 'BP_jRPG_GI_Custom_C_ComputeAudioParametersForSave::CallFunc_GetAudioControlSystem_AudioControlSystem' has a wrong offset!");
static_assert(offsetof(BP_jRPG_GI_Custom_C_ComputeAudioParametersForSave, CallFunc_GetLastActivatedExplorationControlBusMix_ControlBusMix) == 0x000040, "Member 'BP_jRPG_GI_Custom_C_ComputeAudioParametersForSave::CallFunc_GetLastActivatedExplorationControlBusMix_ControlBusMix' has a wrong offset!");
static_assert(offsetof(BP_jRPG_GI_Custom_C_ComputeAudioParametersForSave, CallFunc_GetCurrentSoundData_Context) == 0x000048, "Member 'BP_jRPG_GI_Custom_C_ComputeAudioParametersForSave::CallFunc_GetCurrentSoundData_Context' has a wrong offset!");
static_assert(offsetof(BP_jRPG_GI_Custom_C_ComputeAudioParametersForSave, CallFunc_GetCurrentSoundData_Sound) == 0x000050, "Member 'BP_jRPG_GI_Custom_C_ComputeAudioParametersForSave::CallFunc_GetCurrentSoundData_Sound' has a wrong offset!");
static_assert(offsetof(BP_jRPG_GI_Custom_C_ComputeAudioParametersForSave, CallFunc_GetCurrentSoundData_LastAudioTrigger) == 0x000058, "Member 'BP_jRPG_GI_Custom_C_ComputeAudioParametersForSave::CallFunc_GetCurrentSoundData_LastAudioTrigger' has a wrong offset!");
static_assert(offsetof(BP_jRPG_GI_Custom_C_ComputeAudioParametersForSave, K2Node_MakeStruct_S_AreaAudioParameters) == 0x000060, "Member 'BP_jRPG_GI_Custom_C_ComputeAudioParametersForSave::K2Node_MakeStruct_S_AreaAudioParameters' has a wrong offset!");

// Function BP_jRPG_GI_Custom.BP_jRPG_GI_Custom_C.CreateNotificationWidget
// 0x0018 (0x0018 - 0x0000)
struct BP_jRPG_GI_Custom_C_CreateNotificationWidget final
{
public:
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_FullScreenNotificationContainer_C* CallFunc_Create_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_jRPG_GI_Custom_C_CreateNotificationWidget) == 0x000008, "Wrong alignment on BP_jRPG_GI_Custom_C_CreateNotificationWidget");
static_assert(sizeof(BP_jRPG_GI_Custom_C_CreateNotificationWidget) == 0x000018, "Wrong size on BP_jRPG_GI_Custom_C_CreateNotificationWidget");
static_assert(offsetof(BP_jRPG_GI_Custom_C_CreateNotificationWidget, CallFunc_GetPlayerController_ReturnValue) == 0x000000, "Member 'BP_jRPG_GI_Custom_C_CreateNotificationWidget::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_GI_Custom_C_CreateNotificationWidget, CallFunc_Create_ReturnValue) == 0x000008, "Member 'BP_jRPG_GI_Custom_C_CreateNotificationWidget::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_GI_Custom_C_CreateNotificationWidget, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'BP_jRPG_GI_Custom_C_CreateNotificationWidget::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_jRPG_GI_Custom.BP_jRPG_GI_Custom_C.DEBUG_CVarChanged_MuteAMB
// 0x0001 (0x0001 - 0x0000)
struct BP_jRPG_GI_Custom_C_DEBUG_CVarChanged_MuteAMB final
{
public:
	bool                                          NewValue;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_jRPG_GI_Custom_C_DEBUG_CVarChanged_MuteAMB) == 0x000001, "Wrong alignment on BP_jRPG_GI_Custom_C_DEBUG_CVarChanged_MuteAMB");
static_assert(sizeof(BP_jRPG_GI_Custom_C_DEBUG_CVarChanged_MuteAMB) == 0x000001, "Wrong size on BP_jRPG_GI_Custom_C_DEBUG_CVarChanged_MuteAMB");
static_assert(offsetof(BP_jRPG_GI_Custom_C_DEBUG_CVarChanged_MuteAMB, NewValue) == 0x000000, "Member 'BP_jRPG_GI_Custom_C_DEBUG_CVarChanged_MuteAMB::NewValue' has a wrong offset!");

// Function BP_jRPG_GI_Custom.BP_jRPG_GI_Custom_C.DEBUG_CVarChanged_MuteMusic
// 0x0001 (0x0001 - 0x0000)
struct BP_jRPG_GI_Custom_C_DEBUG_CVarChanged_MuteMusic final
{
public:
	bool                                          NewValue;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
