#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_jRPG_NPC_Base

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_jRPG_NPC_Base.BP_jRPG_NPC_Base_C
// 0x00B0 (0x0720 - 0x0670)
#pragma pack(push, 0x1)
class alignas(0x10) ABP_jRPG_NPC_Base_C : public ACharacter
{
public:
	uint8                                         Pad_668[0x8];                                      // 0x0668(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0670(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UArrowComponent*                        Arrow_InteractionLocation;                         // 0x0678(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Scene;                                             // 0x0680(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_RoamingAiComponent_C*               BP_RoamingAiComponent;                             // 0x0688(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       RoamingStopSphere;                                 // 0x0690(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWidgetComponent*                       Widget;                                            // 0x0698(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       InteractionRange;                                  // 0x06A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_NewTrack_0_FEE616684EB806EBC445B9A7BD4C59B5; // 0x06A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_FEE616684EB806EBC445B9A7BD4C59B5; // 0x06AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6AD[0x3];                                      // 0x06AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x06B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        InteractionRadius;                                 // 0x06B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UAnimMontage*                           DetectPlayerAnim;                                  // 0x06C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               StartDetectPlayerRot;                              // 0x06C8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FRotator                               targetLookAtRot;                                   // 0x06E0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	double                                        WalkingSpeed;                                      // 0x06F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGuid                                  NPC_ID;                                            // 0x0700(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseCustomInteractionLocation;                      // 0x0710(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void CanInteractWithMount(bool* CanInteract);
	void IsInteractionAvailable(bool* Available);
	void UserConstructionScript();
	void OnInteractionRequested(class ABP_jRPG_Character_World_C* InteractingWorldCharacter, bool Instant);
	void OnPlayerEnteredInteractionRange();
	void ReceiveBeginPlay();
	void OnPlayerLeftInteractionRange();
	bool ShouldHideDistantInteraction();
	void IsInteractionDone(bool* Done);
	void GetInteractionPromptParams(struct FFPromptParams* PromptParams);
	void GetNPC_ID(class FName* NPC_ID_0);
	void Timeline_0__FinishedFunc();
	void Timeline_0__UpdateFunc();
	void OnEnemyBattleStateLoaded(bool BattleState);
	void BndEvt__InteractionRange_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void BndEvt__InteractionRange_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void OnObjectInteractionStateLoaded(bool InteractionState);
	void OnInteractionEnabled();
	void OnInteractionDisabled();
	void OnBeginOverlapChild();
	void OnEndOverlapChild();
	void BndEvt__BP_jRPG_NPC_Base_RoamingStopSphere_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void BndEvt__BP_jRPG_NPC_Base_RoamingStopSphere_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void RoamingSphereOnBeginOverlap();
	void RoamingSpehereOnEndOverlap();
	void RotateToPlayerCharacter();
	void OnActorInteractionRangeOverlap(class UObject* Actor);
	void ExecuteUbergraph_BP_jRPG_NPC_Base(int32 EntryPoint);

	void GetInteractionFeedbackLocation(struct FVector* Location) const;
	void GetInteractionLocation(struct FVector* Location) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_jRPG_NPC_Base_C">();
	}
	static class ABP_jRPG_NPC_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_jRPG_NPC_Base_C>();
	}
};
#pragma pack(pop)
static_assert(alignof(ABP_jRPG_NPC_Base_C) == 0x000010, "Wrong alignment on ABP_jRPG_NPC_Base_C");
static_assert(sizeof(ABP_jRPG_NPC_Base_C) == 0x000720, "Wrong size on ABP_jRPG_NPC_Base_C");
static_assert(offsetof(ABP_jRPG_NPC_Base_C, UberGraphFrame) == 0x000670, "Member 'ABP_jRPG_NPC_Base_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_jRPG_NPC_Base_C, Arrow_InteractionLocation) == 0x000678, "Member 'ABP_jRPG_NPC_Base_C::Arrow_InteractionLocation' has a wrong offset!");
static_assert(offsetof(ABP_jRPG_NPC_Base_C, Scene) == 0x000680, "Member 'ABP_jRPG_NPC_Base_C::Scene' has a wrong offset!");
static_assert(offsetof(ABP_jRPG_NPC_Base_C, BP_RoamingAiComponent) == 0x000688, "Member 'ABP_jRPG_NPC_Base_C::BP_RoamingAiComponent' has a wrong offset!");
static_assert(offsetof(ABP_jRPG_NPC_Base_C, RoamingStopSphere) == 0x000690, "Member 'ABP_jRPG_NPC_Base_C::RoamingStopSphere' has a wrong offset!");
static_assert(offsetof(ABP_jRPG_NPC_Base_C, Widget) == 0x000698, "Member 'ABP_jRPG_NPC_Base_C::Widget' has a wrong offset!");
static_assert(offsetof(ABP_jRPG_NPC_Base_C, InteractionRange) == 0x0006A0, "Member 'ABP_jRPG_NPC_Base_C::InteractionRange' has a wrong offset!");
static_assert(offsetof(ABP_jRPG_NPC_Base_C, Timeline_0_NewTrack_0_FEE616684EB806EBC445B9A7BD4C59B5) == 0x0006A8, "Member 'ABP_jRPG_NPC_Base_C::Timeline_0_NewTrack_0_FEE616684EB806EBC445B9A7BD4C59B5' has a wrong offset!");
static_assert(offsetof(ABP_jRPG_NPC_Base_C, Timeline_0__Direction_FEE616684EB806EBC445B9A7BD4C59B5) == 0x0006AC, "Member 'ABP_jRPG_NPC_Base_C::Timeline_0__Direction_FEE616684EB806EBC445B9A7BD4C59B5' has a wrong offset!");
static_assert(offsetof(ABP_jRPG_NPC_Base_C, Timeline_0) == 0x0006B0, "Member 'ABP_jRPG_NPC_Base_C::Timeline_0' has a wrong offset!");
static_assert(offsetof(ABP_jRPG_NPC_Base_C, InteractionRadius) == 0x0006B8, "Member 'ABP_jRPG_NPC_Base_C::InteractionRadius' has a wrong offset!");
static_assert(offsetof(ABP_jRPG_NPC_Base_C, DetectPlayerAnim) == 0x0006C0, "Member 'ABP_jRPG_NPC_Base_C::DetectPlayerAnim' has a wrong offset!");
static_assert(offsetof(ABP_jRPG_NPC_Base_C, StartDetectPlayerRot) == 0x0006C8, "Member 'ABP_jRPG_NPC_Base_C::StartDetectPlayerRot' has a wrong offset!");
static_assert(offsetof(ABP_jRPG_NPC_Base_C, targetLookAtRot) == 0x0006E0, "Member 'ABP_jRPG_NPC_Base_C::targetLookAtRot' has a wrong offset!");
static_assert(offsetof(ABP_jRPG_NPC_Base_C, WalkingSpeed) == 0x0006F8, "Member 'ABP_jRPG_NPC_Base_C::WalkingSpeed' has a wrong offset!");
static_assert(offsetof(ABP_jRPG_NPC_Base_C, NPC_ID) == 0x000700, "Member 'ABP_jRPG_NPC_Base_C::NPC_ID' has a wrong offset!");
static_assert(offsetof(ABP_jRPG_NPC_Base_C, UseCustomInteractionLocation) == 0x000710, "Member 'ABP_jRPG_NPC_Base_C::UseCustomInteractionLocation' has a wrong offset!");

}

