#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_jRPG_DynamicCameraPath

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_jRPG_DynamicCameraPath.BP_jRPG_DynamicCameraPath_C.GetCameraFocusPoint
// 0x0018 (0x0018 - 0x0000)
struct BP_jRPG_DynamicCameraPath_C_GetCameraFocusPoint final
{
public:
	struct FVector                                FocusLocation;                                     // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_jRPG_DynamicCameraPath_C_GetCameraFocusPoint) == 0x000008, "Wrong alignment on BP_jRPG_DynamicCameraPath_C_GetCameraFocusPoint");
static_assert(sizeof(BP_jRPG_DynamicCameraPath_C_GetCameraFocusPoint) == 0x000018, "Wrong size on BP_jRPG_DynamicCameraPath_C_GetCameraFocusPoint");
static_assert(offsetof(BP_jRPG_DynamicCameraPath_C_GetCameraFocusPoint, FocusLocation) == 0x000000, "Member 'BP_jRPG_DynamicCameraPath_C_GetCameraFocusPoint::FocusLocation' has a wrong offset!");

// Function BP_jRPG_DynamicCameraPath.BP_jRPG_DynamicCameraPath_C.GetPathLocationAtDistance
// 0x0040 (0x0040 - 0x0000)
struct BP_jRPG_DynamicCameraPath_C_GetPathLocationAtDistance final
{
public:
	double                                        Time;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                WorldLocation;                                     // 0x0008(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue; // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetLocationAtDistanceAlongSpline_Distance_ImplicitCast; // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_jRPG_DynamicCameraPath_C_GetPathLocationAtDistance) == 0x000008, "Wrong alignment on BP_jRPG_DynamicCameraPath_C_GetPathLocationAtDistance");
static_assert(sizeof(BP_jRPG_DynamicCameraPath_C_GetPathLocationAtDistance) == 0x000040, "Wrong size on BP_jRPG_DynamicCameraPath_C_GetPathLocationAtDistance");
static_assert(offsetof(BP_jRPG_DynamicCameraPath_C_GetPathLocationAtDistance, Time) == 0x000000, "Member 'BP_jRPG_DynamicCameraPath_C_GetPathLocationAtDistance::Time' has a wrong offset!");
static_assert(offsetof(BP_jRPG_DynamicCameraPath_C_GetPathLocationAtDistance, WorldLocation) == 0x000008, "Member 'BP_jRPG_DynamicCameraPath_C_GetPathLocationAtDistance::WorldLocation' has a wrong offset!");
static_assert(offsetof(BP_jRPG_DynamicCameraPath_C_GetPathLocationAtDistance, CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue) == 0x000020, "Member 'BP_jRPG_DynamicCameraPath_C_GetPathLocationAtDistance::CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_DynamicCameraPath_C_GetPathLocationAtDistance, CallFunc_GetLocationAtDistanceAlongSpline_Distance_ImplicitCast) == 0x000038, "Member 'BP_jRPG_DynamicCameraPath_C_GetPathLocationAtDistance::CallFunc_GetLocationAtDistanceAlongSpline_Distance_ImplicitCast' has a wrong offset!");

// Function BP_jRPG_DynamicCameraPath.BP_jRPG_DynamicCameraPath_C.SetCameraFocusPoint
// 0x0018 (0x0018 - 0x0000)
struct BP_jRPG_DynamicCameraPath_C_SetCameraFocusPoint final
{
public:
	struct FVector                                WorldLocation;                                     // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_jRPG_DynamicCameraPath_C_SetCameraFocusPoint) == 0x000008, "Wrong alignment on BP_jRPG_DynamicCameraPath_C_SetCameraFocusPoint");
static_assert(sizeof(BP_jRPG_DynamicCameraPath_C_SetCameraFocusPoint) == 0x000018, "Wrong size on BP_jRPG_DynamicCameraPath_C_SetCameraFocusPoint");
static_assert(offsetof(BP_jRPG_DynamicCameraPath_C_SetCameraFocusPoint, WorldLocation) == 0x000000, "Member 'BP_jRPG_DynamicCameraPath_C_SetCameraFocusPoint::WorldLocation' has a wrong offset!");

// Function BP_jRPG_DynamicCameraPath.BP_jRPG_DynamicCameraPath_C.UserConstructionScript
// 0x04E0 (0x04E0 - 0x0000)
struct BP_jRPG_DynamicCameraPath_C_UserConstructionScript final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x0010(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0108(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue;           // 0x0120(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult;       // 0x0138(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_GetLocationAtTime_ReturnValue;            // 0x0230(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0248(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         CallFunc_GetNumberOfSplinePoints_ReturnValue;      // 0x0340(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0344(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0348(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0350(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_351[0x7];                                      // 0x0351(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_IntFloat_ReturnValue;            // 0x0358(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_1;           // 0x0360(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue;                        // 0x0368(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36C[0x4];                                      // 0x036C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0370(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0378(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_379[0x7];                                      // 0x0379(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_2;           // 0x0380(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x0388(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetRotationAtSplinePoint_ReturnValue;     // 0x0390(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        CallFunc_Multiply_IntFloat_ReturnValue_1;          // 0x03A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_DegSin_ReturnValue;                       // 0x03B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_DegCos_ReturnValue;                       // 0x03B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x03C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x03C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x03D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x03E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x03EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3ED[0x3];                                      // 0x03ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_3;           // 0x03F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_2;        // 0x03F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_IntFloat_ReturnValue_2;          // 0x0400(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x0408(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_DegSin_ReturnValue_1;                     // 0x0410(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_DegCos_ReturnValue_1;                     // 0x0418(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_3;      // 0x0420(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_4;      // 0x0428(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0430(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_2;           // 0x0448(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_449[0x3];                                      // 0x0449(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x044C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAtSplinePoint_ReturnValue;     // 0x0450(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_468[0x8];                                      // 0x0468(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0470(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        CallFunc_AddComponent_ReturnValue;                 // 0x04D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetLocationAtTime_Time_ImplicitCast;      // 0x04D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_jRPG_DynamicCameraPath_C_UserConstructionScript) == 0x000010, "Wrong alignment on BP_jRPG_DynamicCameraPath_C_UserConstructionScript");
static_assert(sizeof(BP_jRPG_DynamicCameraPath_C_UserConstructionScript) == 0x0004E0, "Wrong size on BP_jRPG_DynamicCameraPath_C_UserConstructionScript");
static_assert(offsetof(BP_jRPG_DynamicCameraPath_C_UserConstructionScript, Temp_int_Variable) == 0x000000, "Member 'BP_jRPG_DynamicCameraPath_C_UserConstructionScript::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_jRPG_DynamicCameraPath_C_UserConstructionScript, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'BP_jRPG_DynamicCameraPath_C_UserConstructionScript::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_DynamicCameraPath_C_UserConstructionScript, Temp_int_Variable_1) == 0x000008, "Member 'BP_jRPG_DynamicCameraPath_C_UserConstructionScript::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_jRPG_DynamicCameraPath_C_UserConstructionScript, CallFunc_Add_IntInt_ReturnValue_1) == 0x00000C, "Member 'BP_jRPG_DynamicCameraPath_C_UserConstructionScript::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_jRPG_DynamicCameraPath_C_UserConstructionScript, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x000010, "Member 'BP_jRPG_DynamicCameraPath_C_UserConstructionScript::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_jRPG_DynamicCameraPath_C_UserConstructionScript, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000108, "Member 'BP_jRPG_DynamicCameraPath_C_UserConstructionScript::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_DynamicCameraPath_C_UserConstructionScript, CallFunc_FindLookAtRotation_ReturnValue) == 0x000120, "Member 'BP_jRPG_DynamicCameraPath_C_UserConstructionScript::CallFunc_FindLookAtRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_DynamicCameraPath_C_UserConstructionScript, CallFunc_K2_SetWorldRotation_SweepHitResult) == 0x000138, "Member 'BP_jRPG_DynamicCameraPath_C_UserConstructionScript::CallFunc_K2_SetWorldRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_jRPG_DynamicCameraPath_C_UserConstructionScript, CallFunc_GetLocationAtTime_ReturnValue) == 0x000230, "Member 'BP_jRPG_DynamicCameraPath_C_UserConstructionScript::CallFunc_GetLocationAtTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_DynamicCameraPath_C_UserConstructionScript, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x000248, "Member 'BP_jRPG_DynamicCameraPath_C_UserConstructionScript::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_jRPG_DynamicCameraPath_C_UserConstructionScript, CallFunc_GetNumberOfSplinePoints_ReturnValue) == 0x000340, "Member 'BP_jRPG_DynamicCameraPath_C_UserConstructionScript::CallFunc_GetNumberOfSplinePoints_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_DynamicCameraPath_C_UserConstructionScript, CallFunc_Subtract_IntInt_ReturnValue) == 0x000344, "Member 'BP_jRPG_DynamicCameraPath_C_UserConstructionScript::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_DynamicCameraPath_C_UserConstructionScript, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000348, "Member 'BP_jRPG_DynamicCameraPath_C_UserConstructionScript::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_DynamicCameraPath_C_UserConstructionScript, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000350, "Member 'BP_jRPG_DynamicCameraPath_C_UserConstructionScript::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_DynamicCameraPath_C_UserConstructionScript, CallFunc_Multiply_IntFloat_ReturnValue) == 0x000358, "Member 'BP_jRPG_DynamicCameraPath_C_UserConstructionScript::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_DynamicCameraPath_C_UserConstructionScript, CallFunc_Conv_IntToDouble_ReturnValue_1) == 0x000360, "Member 'BP_jRPG_DynamicCameraPath_C_UserConstructionScript::CallFunc_Conv_IntToDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_jRPG_DynamicCameraPath_C_UserConstructionScript, CallFunc_Round_ReturnValue) == 0x000368, "Member 'BP_jRPG_DynamicCameraPath_C_UserConstructionScript::CallFunc_Round_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_DynamicCameraPath_C_UserConstructionScript, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000370, "Member 'BP_jRPG_DynamicCameraPath_C_UserConstructionScript::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_DynamicCameraPath_C_UserConstructionScript, K2Node_SwitchEnum_CmpSuccess) == 0x000378, "Member 'BP_jRPG_DynamicCameraPath_C_UserConstructionScript::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_jRPG_DynamicCameraPath_C_UserConstructionScript, CallFunc_Conv_IntToDouble_ReturnValue_2) == 0x000380, "Member 'BP_jRPG_DynamicCameraPath_C_UserConstructionScript::CallFunc_Conv_IntToDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_jRPG_DynamicCameraPath_C_UserConstructionScript, CallFunc_Divide_DoubleDouble_ReturnValue_1) == 0x000388, "Member 'BP_jRPG_DynamicCameraPath_C_UserConstructionScript::CallFunc_Divide_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_jRPG_DynamicCameraPath_C_UserConstructionScript, CallFunc_GetRotationAtSplinePoint_ReturnValue) == 0x000390, "Member 'BP_jRPG_DynamicCameraPath_C_UserConstructionScript::CallFunc_GetRotationAtSplinePoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_DynamicCameraPath_C_UserConstructionScript, CallFunc_Multiply_IntFloat_ReturnValue_1) == 0x0003A8, "Member 'BP_jRPG_DynamicCameraPath_C_UserConstructionScript::CallFunc_Multiply_IntFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_jRPG_DynamicCameraPath_C_UserConstructionScript, CallFunc_DegSin_ReturnValue) == 0x0003B0, "Member 'BP_jRPG_DynamicCameraPath_C_UserConstructionScript::CallFunc_DegSin_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_DynamicCameraPath_C_UserConstructionScript, CallFunc_DegCos_ReturnValue) == 0x0003B8, "Member 'BP_jRPG_DynamicCameraPath_C_UserConstructionScript::CallFunc_DegCos_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_DynamicCameraPath_C_UserConstructionScript, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x0003C0, "Member 'BP_jRPG_DynamicCameraPath_C_UserConstructionScript::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_DynamicCameraPath_C_UserConstructionScript, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x0003C8, "Member 'BP_jRPG_DynamicCameraPath_C_UserConstructionScript::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_jRPG_DynamicCameraPath_C_UserConstructionScript, CallFunc_MakeVector_ReturnValue) == 0x0003D0, "Member 'BP_jRPG_DynamicCameraPath_C_UserConstructionScript::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_DynamicCameraPath_C_UserConstructionScript, Temp_int_Variable_2) == 0x0003E8, "Member 'BP_jRPG_DynamicCameraPath_C_UserConstructionScript::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_jRPG_DynamicCameraPath_C_UserConstructionScript, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x0003EC, "Member 'BP_jRPG_DynamicCameraPath_C_UserConstructionScript::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_jRPG_DynamicCameraPath_C_UserConstructionScript, CallFunc_Conv_IntToDouble_ReturnValue_3) == 0x0003F0, "Member 'BP_jRPG_DynamicCameraPath_C_UserConstructionScript::CallFunc_Conv_IntToDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_jRPG_DynamicCameraPath_C_UserConstructionScript, CallFunc_Divide_DoubleDouble_ReturnValue_2) == 0x0003F8, "Member 'BP_jRPG_DynamicCameraPath_C_UserConstructionScript::CallFunc_Divide_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_jRPG_DynamicCameraPath_C_UserConstructionScript, CallFunc_Multiply_IntFloat_ReturnValue_2) == 0x000400, "Member 'BP_jRPG_DynamicCameraPath_C_UserConstructionScript::CallFunc_Multiply_IntFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_jRPG_DynamicCameraPath_C_UserConstructionScript, CallFunc_Multiply_DoubleDouble_ReturnValue_2) == 0x000408, "Member 'BP_jRPG_DynamicCameraPath_C_UserConstructionScript::CallFunc_Multiply_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_jRPG_DynamicCameraPath_C_UserConstructionScript, CallFunc_DegSin_ReturnValue_1) == 0x000410, "Member 'BP_jRPG_DynamicCameraPath_C_UserConstructionScript::CallFunc_DegSin_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_jRPG_DynamicCameraPath_C_UserConstructionScript, CallFunc_DegCos_ReturnValue_1) == 0x000418, "Member 'BP_jRPG_DynamicCameraPath_C_UserConstructionScript::CallFunc_DegCos_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_jRPG_DynamicCameraPath_C_UserConstructionScript, CallFunc_Multiply_DoubleDouble_ReturnValue_3) == 0x000420, "Member 'BP_jRPG_DynamicCameraPath_C_UserConstructionScript::CallFunc_Multiply_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_jRPG_DynamicCameraPath_C_UserConstructionScript, CallFunc_Multiply_DoubleDouble_ReturnValue_4) == 0x000428, "Member 'BP_jRPG_DynamicCameraPath_C_UserConstructionScript::CallFunc_Multiply_DoubleDouble_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_jRPG_DynamicCameraPath_C_UserConstructionScript, CallFunc_MakeVector_ReturnValue_1) == 0x000430, "Member 'BP_jRPG_DynamicCameraPath_C_UserConstructionScript::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_jRPG_DynamicCameraPath_C_UserConstructionScript, CallFunc_LessEqual_IntInt_ReturnValue_2) == 0x000448, "Member 'BP_jRPG_DynamicCameraPath_C_UserConstructionScript::CallFunc_LessEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_jRPG_DynamicCameraPath_C_UserConstructionScript, CallFunc_Add_IntInt_ReturnValue_2) == 0x00044C, "Member 'BP_jRPG_DynamicCameraPath_C_UserConstructionScript::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_jRPG_DynamicCameraPath_C_UserConstructionScript, CallFunc_GetLocationAtSplinePoint_ReturnValue) == 0x000450, "Member 'BP_jRPG_DynamicCameraPath_C_UserConstructionScript::CallFunc_GetLocationAtSplinePoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_DynamicCameraPath_C_UserConstructionScript, CallFunc_MakeTransform_ReturnValue) == 0x000470, "Member 'BP_jRPG_DynamicCameraPath_C_UserConstructionScript::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_DynamicCameraPath_C_UserConstructionScript, CallFunc_AddComponent_ReturnValue) == 0x0004D0, "Member 'BP_jRPG_DynamicCameraPath_C_UserConstructionScript::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_DynamicCameraPath_C_UserConstructionScript, CallFunc_GetLocationAtTime_Time_ImplicitCast) == 0x0004D8, "Member 'BP_jRPG_DynamicCameraPath_C_UserConstructionScript::CallFunc_GetLocationAtTime_Time_ImplicitCast' has a wrong offset!");

}

