#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_jRPG_Enemy_World_Base_Seamless

#include "Basic.hpp"

#include "GameplayCameras_structs.hpp"
#include "Engine_structs.hpp"
#include "EInputDevices_structs.hpp"
#include "SandFall_structs.hpp"
#include "EInWorldAudioContainerComponents_structs.hpp"
#include "FPromptParams_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "ActorDetectionParameters_structs.hpp"
#include "E_jRPG_EngageTypes_structs.hpp"
#include "FBattleStartParams_structs.hpp"
#include "S_jRPG_Encounter_structs.hpp"
#include "EBattleEndResult_structs.hpp"
#include "E_AiStates_structs.hpp"
#include "E_EnemyIdleState_structs.hpp"


namespace SDK::Params
{

// Function BP_jRPG_Enemy_World_Base_Seamless.BP_jRPG_Enemy_World_Base_Seamless_C.AddAggroLock
// 0x000C (0x000C - 0x0000)
struct BP_jRPG_Enemy_World_Base_Seamless_C_AddAggroLock final
{
public:
	class FName                                   LockName;                                          // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_jRPG_Enemy_World_Base_Seamless_C_AddAggroLock) == 0x000004, "Wrong alignment on BP_jRPG_Enemy_World_Base_Seamless_C_AddAggroLock");
static_assert(sizeof(BP_jRPG_Enemy_World_Base_Seamless_C_AddAggroLock) == 0x00000C, "Wrong size on BP_jRPG_Enemy_World_Base_Seamless_C_AddAggroLock");
static_assert(offsetof(BP_jRPG_Enemy_World_Base_Seamless_C_AddAggroLock, LockName) == 0x000000, "Member 'BP_jRPG_Enemy_World_Base_Seamless_C_AddAggroLock::LockName' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Enemy_World_Base_Seamless_C_AddAggroLock, CallFunc_Array_AddUnique_ReturnValue) == 0x000008, "Member 'BP_jRPG_Enemy_World_Base_Seamless_C_AddAggroLock::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");

// Function BP_jRPG_Enemy_World_Base_Seamless.BP_jRPG_Enemy_World_Base_Seamless_C.AddInteractable
// 0x0008 (0x0008 - 0x0000)
struct BP_jRPG_Enemy_World_Base_Seamless_C_AddInteractable final
{
public:
	class AActor*                                 Interactable;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_jRPG_Enemy_World_Base_Seamless_C_AddInteractable) == 0x000008, "Wrong alignment on BP_jRPG_Enemy_World_Base_Seamless_C_AddInteractable");
static_assert(sizeof(BP_jRPG_Enemy_World_Base_Seamless_C_AddInteractable) == 0x000008, "Wrong size on BP_jRPG_Enemy_World_Base_Seamless_C_AddInteractable");
static_assert(offsetof(BP_jRPG_Enemy_World_Base_Seamless_C_AddInteractable, Interactable) == 0x000000, "Member 'BP_jRPG_Enemy_World_Base_Seamless_C_AddInteractable::Interactable' has a wrong offset!");

// Function BP_jRPG_Enemy_World_Base_Seamless.BP_jRPG_Enemy_World_Base_Seamless_C.BeginCustomScriptState
// 0x0098 (0x0098 - 0x0000)
struct BP_jRPG_Enemy_World_Base_Seamless_C_BeginCustomScriptState final
{
public:
	class UObject*                                SourceObject;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_ObjectToText_ReturnValue;            // 0x0008(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0018(0x0048)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0068(0x0010)(ReferenceParm)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0080(0x0010)()
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_jRPG_Enemy_World_Base_Seamless_C_BeginCustomScriptState) == 0x000008, "Wrong alignment on BP_jRPG_Enemy_World_Base_Seamless_C_BeginCustomScriptState");
static_assert(sizeof(BP_jRPG_Enemy_World_Base_Seamless_C_BeginCustomScriptState) == 0x000098, "Wrong size on BP_jRPG_Enemy_World_Base_Seamless_C_BeginCustomScriptState");
static_assert(offsetof(BP_jRPG_Enemy_World_Base_Seamless_C_BeginCustomScriptState, SourceObject) == 0x000000, "Member 'BP_jRPG_Enemy_World_Base_Seamless_C_BeginCustomScriptState::SourceObject' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Enemy_World_Base_Seamless_C_BeginCustomScriptState, CallFunc_Conv_ObjectToText_ReturnValue) == 0x000008, "Member 'BP_jRPG_Enemy_World_Base_Seamless_C_BeginCustomScriptState::CallFunc_Conv_ObjectToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Enemy_World_Base_Seamless_C_BeginCustomScriptState, K2Node_MakeStruct_FormatArgumentData) == 0x000018, "Member 'BP_jRPG_Enemy_World_Base_Seamless_C_BeginCustomScriptState::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Enemy_World_Base_Seamless_C_BeginCustomScriptState, CallFunc_Array_Length_ReturnValue) == 0x000060, "Member 'BP_jRPG_Enemy_World_Base_Seamless_C_BeginCustomScriptState::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Enemy_World_Base_Seamless_C_BeginCustomScriptState, K2Node_MakeArray_Array) == 0x000068, "Member 'BP_jRPG_Enemy_World_Base_Seamless_C_BeginCustomScriptState::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Enemy_World_Base_Seamless_C_BeginCustomScriptState, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000078, "Member 'BP_jRPG_Enemy_World_Base_Seamless_C_BeginCustomScriptState::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Enemy_World_Base_Seamless_C_BeginCustomScriptState, CallFunc_Format_ReturnValue) == 0x000080, "Member 'BP_jRPG_Enemy_World_Base_Seamless_C_BeginCustomScriptState::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Enemy_World_Base_Seamless_C_BeginCustomScriptState, CallFunc_Array_AddUnique_ReturnValue) == 0x000090, "Member 'BP_jRPG_Enemy_World_Base_Seamless_C_BeginCustomScriptState::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Enemy_World_Base_Seamless_C_BeginCustomScriptState, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000094, "Member 'BP_jRPG_Enemy_World_Base_Seamless_C_BeginCustomScriptState::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");

// Function BP_jRPG_Enemy_World_Base_Seamless.BP_jRPG_Enemy_World_Base_Seamless_C.BndEvt__BP_jRPG_Enemy_World_Base_Seamless_EncounterCapsuleRange_K2Node_ComponentBoundEvent_5_ComponentBeginOverlapSignature__DelegateSignature
// 0x0118 (0x0118 - 0x0000)
struct BP_jRPG_Enemy_World_Base_Seamless_C_BndEvt__BP_jRPG_Enemy_World_Base_Seamless_EncounterCapsuleRange_K2Node_ComponentBoundEvent_5_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x00F8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_jRPG_Enemy_World_Base_Seamless_C_BndEvt__BP_jRPG_Enemy_World_Base_Seamless_EncounterCapsuleRange_K2Node_ComponentBoundEvent_5_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_jRPG_Enemy_World_Base_Seamless_C_BndEvt__BP_jRPG_Enemy_World_Base_Seamless_EncounterCapsuleRange_K2Node_ComponentBoundEvent_5_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_jRPG_Enemy_World_Base_Seamless_C_BndEvt__BP_jRPG_Enemy_World_Base_Seamless_EncounterCapsuleRange_K2Node_ComponentBoundEvent_5_ComponentBeginOverlapSignature__DelegateSignature) == 0x000118, "Wrong size on BP_jRPG_Enemy_World_Base_Seamless_C_BndEvt__BP_jRPG_Enemy_World_Base_Seamless_EncounterCapsuleRange_K2Node_ComponentBoundEvent_5_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_jRPG_Enemy_World_Base_Seamless_C_BndEvt__BP_jRPG_Enemy_World_Base_Seamless_EncounterCapsuleRange_K2Node_ComponentBoundEvent_5_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_jRPG_Enemy_World_Base_Seamless_C_BndEvt__BP_jRPG_Enemy_World_Base_Seamless_EncounterCapsuleRange_K2Node_ComponentBoundEvent_5_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Enemy_World_Base_Seamless_C_BndEvt__BP_jRPG_Enemy_World_Base_Seamless_EncounterCapsuleRange_K2Node_ComponentBoundEvent_5_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_jRPG_Enemy_World_Base_Seamless_C_BndEvt__BP_jRPG_Enemy_World_Base_Seamless_EncounterCapsuleRange_K2Node_ComponentBoundEvent_5_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Enemy_World_Base_Seamless_C_BndEvt__BP_jRPG_Enemy_World_Base_Seamless_EncounterCapsuleRange_K2Node_ComponentBoundEvent_5_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_jRPG_Enemy_World_Base_Seamless_C_BndEvt__BP_jRPG_Enemy_World_Base_Seamless_EncounterCapsuleRange_K2Node_ComponentBoundEvent_5_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Enemy_World_Base_Seamless_C_BndEvt__BP_jRPG_Enemy_World_Base_Seamless_EncounterCapsuleRange_K2Node_ComponentBoundEvent_5_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_jRPG_Enemy_World_Base_Seamless_C_BndEvt__BP_jRPG_Enemy_World_Base_Seamless_EncounterCapsuleRange_K2Node_ComponentBoundEvent_5_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Enemy_World_Base_Seamless_C_BndEvt__BP_jRPG_Enemy_World_Base_Seamless_EncounterCapsuleRange_K2Node_ComponentBoundEvent_5_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'BP_jRPG_Enemy_World_Base_Seamless_C_BndEvt__BP_jRPG_Enemy_World_Base_Seamless_EncounterCapsuleRange_K2Node_ComponentBoundEvent_5_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Enemy_World_Base_Seamless_C_BndEvt__BP_jRPG_Enemy_World_Base_Seamless_EncounterCapsuleRange_K2Node_ComponentBoundEvent_5_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'BP_jRPG_Enemy_World_Base_Seamless_C_BndEvt__BP_jRPG_Enemy_World_Base_Seamless_EncounterCapsuleRange_K2Node_ComponentBoundEvent_5_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function BP_jRPG_Enemy_World_Base_Seamless.BP_jRPG_Enemy_World_Base_Seamless_C.BndEvt__BP_jRPG_Enemy_World_Base_Seamless_PPBattleTransitionZone_K2Node_ComponentBoundEvent_6_ComponentBeginOverlapSignature__DelegateSignature
// 0x0118 (0x0118 - 0x0000)
struct BP_jRPG_Enemy_World_Base_Seamless_C_BndEvt__BP_jRPG_Enemy_World_Base_Seamless_PPBattleTransitionZone_K2Node_ComponentBoundEvent_6_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x00F8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_jRPG_Enemy_World_Base_Seamless_C_BndEvt__BP_jRPG_Enemy_World_Base_Seamless_PPBattleTransitionZone_K2Node_ComponentBoundEvent_6_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_jRPG_Enemy_World_Base_Seamless_C_BndEvt__BP_jRPG_Enemy_World_Base_Seamless_PPBattleTransitionZone_K2Node_ComponentBoundEvent_6_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_jRPG_Enemy_World_Base_Seamless_C_BndEvt__BP_jRPG_Enemy_World_Base_Seamless_PPBattleTransitionZone_K2Node_ComponentBoundEvent_6_ComponentBeginOverlapSignature__DelegateSignature) == 0x000118, "Wrong size on BP_jRPG_Enemy_World_Base_Seamless_C_BndEvt__BP_jRPG_Enemy_World_Base_Seamless_PPBattleTransitionZone_K2Node_ComponentBoundEvent_6_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_jRPG_Enemy_World_Base_Seamless_C_BndEvt__BP_jRPG_Enemy_World_Base_Seamless_PPBattleTransitionZone_K2Node_ComponentBoundEvent_6_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_jRPG_Enemy_World_Base_Seamless_C_BndEvt__BP_jRPG_Enemy_World_Base_Seamless_PPBattleTransitionZone_K2Node_ComponentBoundEvent_6_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Enemy_World_Base_Seamless_C_BndEvt__BP_jRPG_Enemy_World_Base_Seamless_PPBattleTransitionZone_K2Node_ComponentBoundEvent_6_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_jRPG_Enemy_World_Base_Seamless_C_BndEvt__BP_jRPG_Enemy_World_Base_Seamless_PPBattleTransitionZone_K2Node_ComponentBoundEvent_6_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Enemy_World_Base_Seamless_C_BndEvt__BP_jRPG_Enemy_World_Base_Seamless_PPBattleTransitionZone_K2Node_ComponentBoundEvent_6_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_jRPG_Enemy_World_Base_Seamless_C_BndEvt__BP_jRPG_Enemy_World_Base_Seamless_PPBattleTransitionZone_K2Node_ComponentBoundEvent_6_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Enemy_World_Base_Seamless_C_BndEvt__BP_jRPG_Enemy_World_Base_Seamless_PPBattleTransitionZone_K2Node_ComponentBoundEvent_6_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_jRPG_Enemy_World_Base_Seamless_C_BndEvt__BP_jRPG_Enemy_World_Base_Seamless_PPBattleTransitionZone_K2Node_ComponentBoundEvent_6_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Enemy_World_Base_Seamless_C_BndEvt__BP_jRPG_Enemy_World_Base_Seamless_PPBattleTransitionZone_K2Node_ComponentBoundEvent_6_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'BP_jRPG_Enemy_World_Base_Seamless_C_BndEvt__BP_jRPG_Enemy_World_Base_Seamless_PPBattleTransitionZone_K2Node_ComponentBoundEvent_6_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Enemy_World_Base_Seamless_C_BndEvt__BP_jRPG_Enemy_World_Base_Seamless_PPBattleTransitionZone_K2Node_ComponentBoundEvent_6_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'BP_jRPG_Enemy_World_Base_Seamless_C_BndEvt__BP_jRPG_Enemy_World_Base_Seamless_PPBattleTransitionZone_K2Node_ComponentBoundEvent_6_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function BP_jRPG_Enemy_World_Base_Seamless.BP_jRPG_Enemy_World_Base_Seamless_C.BndEvt__BP_jRPG_Enemy_World_Base_Seamless_PPBattleTransitionZone_K2Node_ComponentBoundEvent_7_ComponentEndOverlapSignature__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct BP_jRPG_Enemy_World_Base_Seamless_C_BndEvt__BP_jRPG_Enemy_World_Base_Seamless_PPBattleTransitionZone_K2Node_ComponentBoundEvent_7_ComponentEndOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_jRPG_Enemy_World_Base_Seamless_C_BndEvt__BP_jRPG_Enemy_World_Base_Seamless_PPBattleTransitionZone_K2Node_ComponentBoundEvent_7_ComponentEndOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_jRPG_Enemy_World_Base_Seamless_C_BndEvt__BP_jRPG_Enemy_World_Base_Seamless_PPBattleTransitionZone_K2Node_ComponentBoundEvent_7_ComponentEndOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_jRPG_Enemy_World_Base_Seamless_C_BndEvt__BP_jRPG_Enemy_World_Base_Seamless_PPBattleTransitionZone_K2Node_ComponentBoundEvent_7_ComponentEndOverlapSignature__DelegateSignature) == 0x000020, "Wrong size on BP_jRPG_Enemy_World_Base_Seamless_C_BndEvt__BP_jRPG_Enemy_World_Base_Seamless_PPBattleTransitionZone_K2Node_ComponentBoundEvent_7_ComponentEndOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_jRPG_Enemy_World_Base_Seamless_C_BndEvt__BP_jRPG_Enemy_World_Base_Seamless_PPBattleTransitionZone_K2Node_ComponentBoundEvent_7_ComponentEndOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_jRPG_Enemy_World_Base_Seamless_C_BndEvt__BP_jRPG_Enemy_World_Base_Seamless_PPBattleTransitionZone_K2Node_ComponentBoundEvent_7_ComponentEndOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Enemy_World_Base_Seamless_C_BndEvt__BP_jRPG_Enemy_World_Base_Seamless_PPBattleTransitionZone_K2Node_ComponentBoundEvent_7_ComponentEndOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_jRPG_Enemy_World_Base_Seamless_C_BndEvt__BP_jRPG_Enemy_World_Base_Seamless_PPBattleTransitionZone_K2Node_ComponentBoundEvent_7_ComponentEndOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Enemy_World_Base_Seamless_C_BndEvt__BP_jRPG_Enemy_World_Base_Seamless_PPBattleTransitionZone_K2Node_ComponentBoundEvent_7_ComponentEndOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_jRPG_Enemy_World_Base_Seamless_C_BndEvt__BP_jRPG_Enemy_World_Base_Seamless_PPBattleTransitionZone_K2Node_ComponentBoundEvent_7_ComponentEndOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Enemy_World_Base_Seamless_C_BndEvt__BP_jRPG_Enemy_World_Base_Seamless_PPBattleTransitionZone_K2Node_ComponentBoundEvent_7_ComponentEndOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_jRPG_Enemy_World_Base_Seamless_C_BndEvt__BP_jRPG_Enemy_World_Base_Seamless_PPBattleTransitionZone_K2Node_ComponentBoundEvent_7_ComponentEndOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");

// Function BP_jRPG_Enemy_World_Base_Seamless.BP_jRPG_Enemy_World_Base_Seamless_C.CanInteractWithMount
// 0x0001 (0x0001 - 0x0000)
struct BP_jRPG_Enemy_World_Base_Seamless_C_CanInteractWithMount final
{
public:
	bool                                          CanInteract;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_jRPG_Enemy_World_Base_Seamless_C_CanInteractWithMount) == 0x000001, "Wrong alignment on BP_jRPG_Enemy_World_Base_Seamless_C_CanInteractWithMount");
static_assert(sizeof(BP_jRPG_Enemy_World_Base_Seamless_C_CanInteractWithMount) == 0x000001, "Wrong size on BP_jRPG_Enemy_World_Base_Seamless_C_CanInteractWithMount");
static_assert(offsetof(BP_jRPG_Enemy_World_Base_Seamless_C_CanInteractWithMount, CanInteract) == 0x000000, "Member 'BP_jRPG_Enemy_World_Base_Seamless_C_CanInteractWithMount::CanInteract' has a wrong offset!");

// Function BP_jRPG_Enemy_World_Base_Seamless.BP_jRPG_Enemy_World_Base_Seamless_C.CanStartBattleWithCharacter
// 0x0010 (0x0010 - 0x0000)
struct BP_jRPG_Enemy_World_Base_Seamless_C_CanStartBattleWithCharacter final
{
public:
	class ABP_jRPG_Character_World_C*             Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsAttachedToMovingPlatform_ReturnValue; // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_jRPG_Enemy_World_Base_Seamless_C_CanStartBattleWithCharacter) == 0x000008, "Wrong alignment on BP_jRPG_Enemy_World_Base_Seamless_C_CanStartBattleWithCharacter");
static_assert(sizeof(BP_jRPG_Enemy_World_Base_Seamless_C_CanStartBattleWithCharacter) == 0x000010, "Wrong size on BP_jRPG_Enemy_World_Base_Seamless_C_CanStartBattleWithCharacter");
static_assert(offsetof(BP_jRPG_Enemy_World_Base_Seamless_C_CanStartBattleWithCharacter, Character) == 0x000000, "Member 'BP_jRPG_Enemy_World_Base_Seamless_C_CanStartBattleWithCharacter::Character' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Enemy_World_Base_Seamless_C_CanStartBattleWithCharacter, ReturnValue) == 0x000008, "Member 'BP_jRPG_Enemy_World_Base_Seamless_C_CanStartBattleWithCharacter::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Enemy_World_Base_Seamless_C_CanStartBattleWithCharacter, CallFunc_GetIsAttachedToMovingPlatform_ReturnValue) == 0x000009, "Member 'BP_jRPG_Enemy_World_Base_Seamless_C_CanStartBattleWithCharacter::CallFunc_GetIsAttachedToMovingPlatform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Enemy_World_Base_Seamless_C_CanStartBattleWithCharacter, CallFunc_Not_PreBool_ReturnValue) == 0x00000A, "Member 'BP_jRPG_Enemy_World_Base_Seamless_C_CanStartBattleWithCharacter::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function BP_jRPG_Enemy_World_Base_Seamless.BP_jRPG_Enemy_World_Base_Seamless_C.CheckForErrors
// 0x01E8 (0x01E8 - 0x0000)
struct BP_jRPG_Enemy_World_Base_Seamless_C_CheckForErrors final
{
public:
	TArray<class FText>                           ErrorMessages;                                     // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0028(0x0048)(HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0078(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0088(0x0010)()
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_RoamingAiComponent_C*               CallFunc_GetComponentByClass_ReturnValue;          // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCurrentLevelProductionLevel_ReturnValue; // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsEmpty_ReturnValue;                // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AB[0x1];                                       // 0x00AB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x00B0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x00C0(0x0010)()
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x3];                                       // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetBoolCVar_ReturnValue;                  // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    CallFunc_Array_Get_Item;                           // 0x00E0(0x0010)(NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F4[0x4];                                       // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_NameToText_ReturnValue;              // 0x00F8(0x0010)()
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0110(0x0048)(HasGetValueTypeHash)
	bool                                          CallFunc_DoesDataTableRowExist_ReturnValue;        // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_ObjectToText_ReturnValue;            // 0x0160(0x0010)()
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_171[0x7];                                      // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0178(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_2;                          // 0x01C0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_2;                     // 0x01D0(0x0010)()
	int32                                         CallFunc_Array_Add_ReturnValue_2;                  // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_jRPG_Enemy_World_Base_Seamless_C_CheckForErrors) == 0x000008, "Wrong alignment on BP_jRPG_Enemy_World_Base_Seamless_C_CheckForErrors");
static_assert(sizeof(BP_jRPG_Enemy_World_Base_Seamless_C_CheckForErrors) == 0x0001E8, "Wrong size on BP_jRPG_Enemy_World_Base_Seamless_C_CheckForErrors");
static_assert(offsetof(BP_jRPG_Enemy_World_Base_Seamless_C_CheckForErrors, ErrorMessages) == 0x000000, "Member 'BP_jRPG_Enemy_World_Base_Seamless_C_CheckForErrors::ErrorMessages' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Enemy_World_Base_Seamless_C_CheckForErrors, ReturnValue) == 0x000010, "Member 'BP_jRPG_Enemy_World_Base_Seamless_C_CheckForErrors::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Enemy_World_Base_Seamless_C_CheckForErrors, Temp_int_Array_Index_Variable) == 0x000014, "Member 'BP_jRPG_Enemy_World_Base_Seamless_C_CheckForErrors::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Enemy_World_Base_Seamless_C_CheckForErrors, Temp_int_Loop_Counter_Variable) == 0x000018, "Member 'BP_jRPG_Enemy_World_Base_Seamless_C_CheckForErrors::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Enemy_World_Base_Seamless_C_CheckForErrors, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000020, "Member 'BP_jRPG_Enemy_World_Base_Seamless_C_CheckForErrors::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Enemy_World_Base_Seamless_C_CheckForErrors, K2Node_MakeStruct_FormatArgumentData) == 0x000028, "Member 'BP_jRPG_Enemy_World_Base_Seamless_C_CheckForErrors::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Enemy_World_Base_Seamless_C_CheckForErrors, CallFunc_Add_IntInt_ReturnValue) == 0x000070, "Member 'BP_jRPG_Enemy_World_Base_Seamless_C_CheckForErrors::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Enemy_World_Base_Seamless_C_CheckForErrors, K2Node_MakeArray_Array) == 0x000078, "Member 'BP_jRPG_Enemy_World_Base_Seamless_C_CheckForErrors::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Enemy_World_Base_Seamless_C_CheckForErrors, CallFunc_Format_ReturnValue) == 0x000088, "Member 'BP_jRPG_Enemy_World_Base_Seamless_C_CheckForErrors::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Enemy_World_Base_Seamless_C_CheckForErrors, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000098, "Member 'BP_jRPG_Enemy_World_Base_Seamless_C_CheckForErrors::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Enemy_World_Base_Seamless_C_CheckForErrors, CallFunc_GetComponentByClass_ReturnValue) == 0x0000A0, "Member 'BP_jRPG_Enemy_World_Base_Seamless_C_CheckForErrors::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Enemy_World_Base_Seamless_C_CheckForErrors, CallFunc_IsCurrentLevelProductionLevel_ReturnValue) == 0x0000A8, "Member 'BP_jRPG_Enemy_World_Base_Seamless_C_CheckForErrors::CallFunc_IsCurrentLevelProductionLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Enemy_World_Base_Seamless_C_CheckForErrors, CallFunc_Array_IsEmpty_ReturnValue) == 0x0000A9, "Member 'BP_jRPG_Enemy_World_Base_Seamless_C_CheckForErrors::CallFunc_Array_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Enemy_World_Base_Seamless_C_CheckForErrors, CallFunc_BooleanAND_ReturnValue) == 0x0000AA, "Member 'BP_jRPG_Enemy_World_Base_Seamless_C_CheckForErrors::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Enemy_World_Base_Seamless_C_CheckForErrors, CallFunc_Array_Add_ReturnValue) == 0x0000AC, "Member 'BP_jRPG_Enemy_World_Base_Seamless_C_CheckForErrors::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Enemy_World_Base_Seamless_C_CheckForErrors, K2Node_MakeArray_Array_1) == 0x0000B0, "Member 'BP_jRPG_Enemy_World_Base_Seamless_C_CheckForErrors::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Enemy_World_Base_Seamless_C_CheckForErrors, CallFunc_Format_ReturnValue_1) == 0x0000C0, "Member 'BP_jRPG_Enemy_World_Base_Seamless_C_CheckForErrors::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Enemy_World_Base_Seamless_C_CheckForErrors, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x0000D0, "Member 'BP_jRPG_Enemy_World_Base_Seamless_C_CheckForErrors::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Enemy_World_Base_Seamless_C_CheckForErrors, CallFunc_Array_Add_ReturnValue_1) == 0x0000D4, "Member 'BP_jRPG_Enemy_World_Base_Seamless_C_CheckForErrors::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Enemy_World_Base_Seamless_C_CheckForErrors, CallFunc_GetBoolCVar_ReturnValue) == 0x0000D8, "Member 'BP_jRPG_Enemy_World_Base_Seamless_C_CheckForErrors::CallFunc_GetBoolCVar_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Enemy_World_Base_Seamless_C_CheckForErrors, CallFunc_Array_Get_Item) == 0x0000E0, "Member 'BP_jRPG_Enemy_World_Base_Seamless_C_CheckForErrors::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Enemy_World_Base_Seamless_C_CheckForErrors, CallFunc_Array_Length_ReturnValue) == 0x0000F0, "Member 'BP_jRPG_Enemy_World_Base_Seamless_C_CheckForErrors::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Enemy_World_Base_Seamless_C_CheckForErrors, CallFunc_Conv_NameToText_ReturnValue) == 0x0000F8, "Member 'BP_jRPG_Enemy_World_Base_Seamless_C_CheckForErrors::CallFunc_Conv_NameToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Enemy_World_Base_Seamless_C_CheckForErrors, CallFunc_Less_IntInt_ReturnValue) == 0x000108, "Member 'BP_jRPG_Enemy_World_Base_Seamless_C_CheckForErrors::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Enemy_World_Base_Seamless_C_CheckForErrors, K2Node_MakeStruct_FormatArgumentData_1) == 0x000110, "Member 'BP_jRPG_Enemy_World_Base_Seamless_C_CheckForErrors::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Enemy_World_Base_Seamless_C_CheckForErrors, CallFunc_DoesDataTableRowExist_ReturnValue) == 0x000158, "Member 'BP_jRPG_Enemy_World_Base_Seamless_C_CheckForErrors::CallFunc_DoesDataTableRowExist_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Enemy_World_Base_Seamless_C_CheckForErrors, CallFunc_Conv_ObjectToText_ReturnValue) == 0x000160, "Member 'BP_jRPG_Enemy_World_Base_Seamless_C_CheckForErrors::CallFunc_Conv_ObjectToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Enemy_World_Base_Seamless_C_CheckForErrors, CallFunc_Not_PreBool_ReturnValue) == 0x000170, "Member 'BP_jRPG_Enemy_World_Base_Seamless_C_CheckForErrors::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Enemy_World_Base_Seamless_C_CheckForErrors, K2Node_MakeStruct_FormatArgumentData_2) == 0x000178, "Member 'BP_jRPG_Enemy_World_Base_Seamless_C_CheckForErrors::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Enemy_World_Base_Seamless_C_CheckForErrors, K2Node_MakeArray_Array_2) == 0x0001C0, "Member 'BP_jRPG_Enemy_World_Base_Seamless_C_CheckForErrors::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Enemy_World_Base_Seamless_C_CheckForErrors, CallFunc_Format_ReturnValue_2) == 0x0001D0, "Member 'BP_jRPG_Enemy_World_Base_Seamless_C_CheckForErrors::CallFunc_Format_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Enemy_World_Base_Seamless_C_CheckForErrors, CallFunc_Array_Add_ReturnValue_2) == 0x0001E0, "Member 'BP_jRPG_Enemy_World_Base_Seamless_C_CheckForErrors::CallFunc_Array_Add_ReturnValue_2' has a wrong offset!");

// Function BP_jRPG_Enemy_World_Base_Seamless.BP_jRPG_Enemy_World_Base_Seamless_C.ComputeDetectionParameters
// 0x00C0 (0x00C0 - 0x0000)
struct BP_jRPG_Enemy_World_Base_Seamless_C_ComputeDetectionParameters final
{
public:
	struct FActorDetectionParameters              DetectionParameters;                               // 0x0000(0x0028)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Temp_wildcard_Variable;                            // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_VSize_ReturnValue;                        // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0068(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActorDetectionParameters              K2Node_MakeStruct_ActorDetectionParameters;        // 0x0080(0x0028)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x00A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_jRPG_Enemy_World_Base_Seamless_C_ComputeDetectionParameters) == 0x000008, "Wrong alignment on BP_jRPG_Enemy_World_Base_Seamless_C_ComputeDetectionParameters");
static_assert(sizeof(BP_jRPG_Enemy_World_Base_Seamless_C_ComputeDetectionParameters) == 0x0000C0, "Wrong size on BP_jRPG_Enemy_World_Base_Seamless_C_ComputeDetectionParameters");
static_assert(offsetof(BP_jRPG_Enemy_World_Base_Seamless_C_ComputeDetectionParameters, DetectionParameters) == 0x000000, "Member 'BP_jRPG_Enemy_World_Base_Seamless_C_ComputeDetectionParameters::DetectionParameters' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Enemy_World_Base_Seamless_C_ComputeDetectionParameters, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000028, "Member 'BP_jRPG_Enemy_World_Base_Seamless_C_ComputeDetectionParameters::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Enemy_World_Base_Seamless_C_ComputeDetectionParameters, Temp_wildcard_Variable) == 0x000030, "Member 'BP_jRPG_Enemy_World_Base_Seamless_C_ComputeDetectionParameters::Temp_wildcard_Variable' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Enemy_World_Base_Seamless_C_ComputeDetectionParameters, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000048, "Member 'BP_jRPG_Enemy_World_Base_Seamless_C_ComputeDetectionParameters::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Enemy_World_Base_Seamless_C_ComputeDetectionParameters, CallFunc_VSize_ReturnValue) == 0x000060, "Member 'BP_jRPG_Enemy_World_Base_Seamless_C_ComputeDetectionParameters::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Enemy_World_Base_Seamless_C_ComputeDetectionParameters, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000068, "Member 'BP_jRPG_Enemy_World_Base_Seamless_C_ComputeDetectionParameters::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Enemy_World_Base_Seamless_C_ComputeDetectionParameters, K2Node_MakeStruct_ActorDetectionParameters) == 0x000080, "Member 'BP_jRPG_Enemy_World_Base_Seamless_C_ComputeDetectionParameters::K2Node_MakeStruct_ActorDetectionParameters' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Enemy_World_Base_Seamless_C_ComputeDetectionParameters, CallFunc_Subtract_VectorVector_ReturnValue) == 0x0000A8, "Member 'BP_jRPG_Enemy_World_Base_Seamless_C_ComputeDetectionParameters::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");

// Function BP_jRPG_Enemy_World_Base_Seamless.BP_jRPG_Enemy_World_Base_Seamless_C.DEBUG_OnCVarChanged_DisplayVisionDebug
// 0x0001 (0x0001 - 0x0000)
struct BP_jRPG_Enemy_World_Base_Seamless_C_DEBUG_OnCVarChanged_DisplayVisionDebug final
{
public:
	bool                                          NewValue;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_jRPG_Enemy_World_Base_Seamless_C_DEBUG_OnCVarChanged_DisplayVisionDebug) == 0x000001, "Wrong alignment on BP_jRPG_Enemy_World_Base_Seamless_C_DEBUG_OnCVarChanged_DisplayVisionDebug");
static_assert(sizeof(BP_jRPG_Enemy_World_Base_Seamless_C_DEBUG_OnCVarChanged_DisplayVisionDebug) == 0x000001, "Wrong size on BP_jRPG_Enemy_World_Base_Seamless_C_DEBUG_OnCVarChanged_DisplayVisionDebug");
static_assert(offsetof(BP_jRPG_Enemy_World_Base_Seamless_C_DEBUG_OnCVarChanged_DisplayVisionDebug, NewValue) == 0x000000, "Member 'BP_jRPG_Enemy_World_Base_Seamless_C_DEBUG_OnCVarChanged_DisplayVisionDebug::NewValue' has a wrong offset!");

// Function BP_jRPG_Enemy_World_Base_Seamless.BP_jRPG_Enemy_World_Base_Seamless_C.DEBUG_SetOptimizationActive
// 0x0001 (0x0001 - 0x0000)
struct BP_jRPG_Enemy_World_Base_Seamless_C_DEBUG_SetOptimizationActive final
{
public:
	bool                                          LODOptimizationActive_0;                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_jRPG_Enemy_World_Base_Seamless_C_DEBUG_SetOptimizationActive) == 0x000001, "Wrong alignment on BP_jRPG_Enemy_World_Base_Seamless_C_DEBUG_SetOptimizationActive");
static_assert(sizeof(BP_jRPG_Enemy_World_Base_Seamless_C_DEBUG_SetOptimizationActive) == 0x000001, "Wrong size on BP_jRPG_Enemy_World_Base_Seamless_C_DEBUG_SetOptimizationActive");
static_assert(offsetof(BP_jRPG_Enemy_World_Base_Seamless_C_DEBUG_SetOptimizationActive, LODOptimizationActive_0) == 0x000000, "Member 'BP_jRPG_Enemy_World_Base_Seamless_C_DEBUG_SetOptimizationActive::LODOptimizationActive_0' has a wrong offset!");

// Function BP_jRPG_Enemy_World_Base_Seamless.BP_jRPG_Enemy_World_Base_Seamless_C.DEBUG_ShowState
// 0x0188 (0x0188 - 0x0000)
struct BP_jRPG_Enemy_World_Base_Seamless_C_DEBUG_ShowState final
{
public:
	class ATargetPoint*                           CallFunc_GetNextTargetPoint_CurrentTargetPoint;    // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0008(0x0048)(HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATargetPoint*                           CallFunc_GetCurrentTargetPoint_CurrentTargetPoint; // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0080(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00A0(0x0048)(HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x00E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0100(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0110(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0120(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0168(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Format_ReturnValue;                       // 0x0178(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_jRPG_Enemy_World_Base_Seamless_C_DEBUG_ShowState) == 0x000008, "Wrong alignment on BP_jRPG_Enemy_World_Base_Seamless_C_DEBUG_ShowState");
static_assert(sizeof(BP_jRPG_Enemy_World_Base_Seamless_C_DEBUG_ShowState) == 0x000188, "Wrong size on BP_jRPG_Enemy_World_Base_Seamless_C_DEBUG_ShowState");
static_assert(offsetof(BP_jRPG_Enemy_World_Base_Seamless_C_DEBUG_ShowState, CallFunc_GetNextTargetPoint_CurrentTargetPoint) == 0x000000, "Member 'BP_jRPG_Enemy_World_Base_Seamless_C_DEBUG_ShowState::CallFunc_GetNextTargetPoint_CurrentTargetPoint' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Enemy_World_Base_Seamless_C_DEBUG_ShowState, K2Node_MakeStruct_FormatArgumentData) == 0x000008, "Member 'BP_jRPG_Enemy_World_Base_Seamless_C_DEBUG_ShowState::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Enemy_World_Base_Seamless_C_DEBUG_ShowState, CallFunc_IsValid_ReturnValue) == 0x000050, "Member 'BP_jRPG_Enemy_World_Base_Seamless_C_DEBUG_ShowState::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Enemy_World_Base_Seamless_C_DEBUG_ShowState, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000058, "Member 'BP_jRPG_Enemy_World_Base_Seamless_C_DEBUG_ShowState::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Enemy_World_Base_Seamless_C_DEBUG_ShowState, CallFunc_GetCurrentTargetPoint_CurrentTargetPoint) == 0x000070, "Member 'BP_jRPG_Enemy_World_Base_Seamless_C_DEBUG_ShowState::CallFunc_GetCurrentTargetPoint_CurrentTargetPoint' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Enemy_World_Base_Seamless_C_DEBUG_ShowState, CallFunc_IsValid_ReturnValue_1) == 0x000078, "Member 'BP_jRPG_Enemy_World_Base_Seamless_C_DEBUG_ShowState::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Enemy_World_Base_Seamless_C_DEBUG_ShowState, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000080, "Member 'BP_jRPG_Enemy_World_Base_Seamless_C_DEBUG_ShowState::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Enemy_World_Base_Seamless_C_DEBUG_ShowState, CallFunc_BooleanOR_ReturnValue) == 0x000098, "Member 'BP_jRPG_Enemy_World_Base_Seamless_C_DEBUG_ShowState::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Enemy_World_Base_Seamless_C_DEBUG_ShowState, K2Node_MakeStruct_FormatArgumentData_1) == 0x0000A0, "Member 'BP_jRPG_Enemy_World_Base_Seamless_C_DEBUG_ShowState::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Enemy_World_Base_Seamless_C_DEBUG_ShowState, CallFunc_MakeVector_ReturnValue) == 0x0000E8, "Member 'BP_jRPG_Enemy_World_Base_Seamless_C_DEBUG_ShowState::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Enemy_World_Base_Seamless_C_DEBUG_ShowState, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x000100, "Member 'BP_jRPG_Enemy_World_Base_Seamless_C_DEBUG_ShowState::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Enemy_World_Base_Seamless_C_DEBUG_ShowState, CallFunc_Conv_StringToText_ReturnValue) == 0x000110, "Member 'BP_jRPG_Enemy_World_Base_Seamless_C_DEBUG_ShowState::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Enemy_World_Base_Seamless_C_DEBUG_ShowState, K2Node_MakeStruct_FormatArgumentData_2) == 0x000120, "Member 'BP_jRPG_Enemy_World_Base_Seamless_C_DEBUG_ShowState::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Enemy_World_Base_Seamless_C_DEBUG_ShowState, K2Node_MakeArray_Array) == 0x000168, "Member 'BP_jRPG_Enemy_World_Base_Seamless_C_DEBUG_ShowState::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Enemy_World_Base_Seamless_C_DEBUG_ShowState, CallFunc_Format_ReturnValue) == 0x000178, "Member 'BP_jRPG_Enemy_World_Base_Seamless_C_DEBUG_ShowState::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function BP_jRPG_Enemy_World_Base_Seamless.BP_jRPG_Enemy_World_Base_Seamless_C.EndCustomScriptState
// 0x0088 (0x0088 - 0x0000)
struct BP_jRPG_Enemy_World_Base_Seamless_C_EndCustomScriptState final
{
public:
	const class UObject*                          CustomScriptSource;                                // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	E_AiStates                                    DesiredState;                                      // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsEmpty_ReturnValue;                // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B[0x5];                                        // 0x000B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_ObjectToText_ReturnValue;            // 0x0010(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0020(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0068(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0078(0x0010)()
};
static_assert(alignof(BP_jRPG_Enemy_World_Base_Seamless_C_EndCustomScriptState) == 0x000008, "Wrong alignment on BP_jRPG_Enemy_World_Base_Seamless_C_EndCustomScriptState");
static_assert(sizeof(BP_jRPG_Enemy_World_Base_Seamless_C_EndCustomScriptState) == 0x000088, "Wrong size on BP_jRPG_Enemy_World_Base_Seamless_C_EndCustomScriptState");
static_assert(offsetof(BP_jRPG_Enemy_World_Base_Seamless_C_EndCustomScriptState, CustomScriptSource) == 0x000000, "Member 'BP_jRPG_Enemy_World_Base_Seamless_C_EndCustomScriptState::CustomScriptSource' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Enemy_World_Base_Seamless_C_EndCustomScriptState, DesiredState) == 0x000008, "Member 'BP_jRPG_Enemy_World_Base_Seamless_C_EndCustomScriptState::DesiredState' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Enemy_World_Base_Seamless_C_EndCustomScriptState, CallFunc_Array_IsEmpty_ReturnValue) == 0x000009, "Member 'BP_jRPG_Enemy_World_Base_Seamless_C_EndCustomScriptState::CallFunc_Array_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Enemy_World_Base_Seamless_C_EndCustomScriptState, CallFunc_Array_RemoveItem_ReturnValue) == 0x00000A, "Member 'BP_jRPG_Enemy_World_Base_Seamless_C_EndCustomScriptState::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Enemy_World_Base_Seamless_C_EndCustomScriptState, CallFunc_Conv_ObjectToText_ReturnValue) == 0x000010, "Member 'BP_jRPG_Enemy_World_Base_Seamless_C_EndCustomScriptState::CallFunc_Conv_ObjectToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Enemy_World_Base_Seamless_C_EndCustomScriptState, K2Node_MakeStruct_FormatArgumentData) == 0x000020, "Member 'BP_jRPG_Enemy_World_Base_Seamless_C_EndCustomScriptState::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Enemy_World_Base_Seamless_C_EndCustomScriptState, K2Node_MakeArray_Array) == 0x000068, "Member 'BP_jRPG_Enemy_World_Base_Seamless_C_EndCustomScriptState::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Enemy_World_Base_Seamless_C_EndCustomScriptState, CallFunc_Format_ReturnValue) == 0x000078, "Member 'BP_jRPG_Enemy_World_Base_Seamless_C_EndCustomScriptState::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function BP_jRPG_Enemy_World_Base_Seamless.BP_jRPG_Enemy_World_Base_Seamless_C.EnterStunState
// 0x0008 (0x0008 - 0x0000)
struct BP_jRPG_Enemy_World_Base_Seamless_C_EnterStunState final
{
public:
	double                                        StunDuration;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_jRPG_Enemy_World_Base_Seamless_C_EnterStunState) == 0x000008, "Wrong alignment on BP_jRPG_Enemy_World_Base_Seamless_C_EnterStunState");
static_assert(sizeof(BP_jRPG_Enemy_World_Base_Seamless_C_EnterStunState) == 0x000008, "Wrong size on BP_jRPG_Enemy_World_Base_Seamless_C_EnterStunState");
static_assert(offsetof(BP_jRPG_Enemy_World_Base_Seamless_C_EnterStunState, StunDuration) == 0x000000, "Member 'BP_jRPG_Enemy_World_Base_Seamless_C_EnterStunState::StunDuration' has a wrong offset!");

