#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_jRPG_NPC_Dialog

#include "Basic.hpp"

#include "EDialogueCameraType_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "E_NPC_SpolightTypes_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "S_jRPG_WorldCharacters_structs.hpp"
#include "S_GameplayPauseParameters_structs.hpp"
#include "FLevelDataEntry_structs.hpp"
#include "E_CharacterList_structs.hpp"
#include "S_InputLockParameters_structs.hpp"
#include "S_DialogueParameters_structs.hpp"
#include "SandFall_structs.hpp"


namespace SDK::Params
{

// Function BP_jRPG_NPC_Dialog.BP_jRPG_NPC_Dialog_C.BPI_GetDialogueAudioComponent
// 0x0008 (0x0008 - 0x0000)
struct BP_jRPG_NPC_Dialog_C_BPI_GetDialogueAudioComponent final
{
public:
	class UAudioComponent*                        AudioComponent;                                    // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_jRPG_NPC_Dialog_C_BPI_GetDialogueAudioComponent) == 0x000008, "Wrong alignment on BP_jRPG_NPC_Dialog_C_BPI_GetDialogueAudioComponent");
static_assert(sizeof(BP_jRPG_NPC_Dialog_C_BPI_GetDialogueAudioComponent) == 0x000008, "Wrong size on BP_jRPG_NPC_Dialog_C_BPI_GetDialogueAudioComponent");
static_assert(offsetof(BP_jRPG_NPC_Dialog_C_BPI_GetDialogueAudioComponent, AudioComponent) == 0x000000, "Member 'BP_jRPG_NPC_Dialog_C_BPI_GetDialogueAudioComponent::AudioComponent' has a wrong offset!");

// Function BP_jRPG_NPC_Dialog.BP_jRPG_NPC_Dialog_C.BPI_GetDialogueCameraByType
// 0x0040 (0x0040 - 0x0000)
struct BP_jRPG_NPC_Dialog_C_BPI_GetDialogueCameraByType final
{
public:
	EDialogueCameraType                           CameraType;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCameraComponent*                       CameraComponent;                                   // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EDialogueCameraType                           Temp_byte_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCameraComponent*                       Temp_object_Variable;                              // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCameraComponent*                       Temp_object_Variable_1;                            // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCameraComponent*                       Temp_object_Variable_2;                            // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCameraComponent*                       Temp_object_Variable_3;                            // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCameraComponent*                       K2Node_Select_Default;                             // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_jRPG_NPC_Dialog_C_BPI_GetDialogueCameraByType) == 0x000008, "Wrong alignment on BP_jRPG_NPC_Dialog_C_BPI_GetDialogueCameraByType");
static_assert(sizeof(BP_jRPG_NPC_Dialog_C_BPI_GetDialogueCameraByType) == 0x000040, "Wrong size on BP_jRPG_NPC_Dialog_C_BPI_GetDialogueCameraByType");
static_assert(offsetof(BP_jRPG_NPC_Dialog_C_BPI_GetDialogueCameraByType, CameraType) == 0x000000, "Member 'BP_jRPG_NPC_Dialog_C_BPI_GetDialogueCameraByType::CameraType' has a wrong offset!");
static_assert(offsetof(BP_jRPG_NPC_Dialog_C_BPI_GetDialogueCameraByType, CameraComponent) == 0x000008, "Member 'BP_jRPG_NPC_Dialog_C_BPI_GetDialogueCameraByType::CameraComponent' has a wrong offset!");
static_assert(offsetof(BP_jRPG_NPC_Dialog_C_BPI_GetDialogueCameraByType, Temp_byte_Variable) == 0x000010, "Member 'BP_jRPG_NPC_Dialog_C_BPI_GetDialogueCameraByType::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_jRPG_NPC_Dialog_C_BPI_GetDialogueCameraByType, Temp_object_Variable) == 0x000018, "Member 'BP_jRPG_NPC_Dialog_C_BPI_GetDialogueCameraByType::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_jRPG_NPC_Dialog_C_BPI_GetDialogueCameraByType, Temp_object_Variable_1) == 0x000020, "Member 'BP_jRPG_NPC_Dialog_C_BPI_GetDialogueCameraByType::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_jRPG_NPC_Dialog_C_BPI_GetDialogueCameraByType, Temp_object_Variable_2) == 0x000028, "Member 'BP_jRPG_NPC_Dialog_C_BPI_GetDialogueCameraByType::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_jRPG_NPC_Dialog_C_BPI_GetDialogueCameraByType, Temp_object_Variable_3) == 0x000030, "Member 'BP_jRPG_NPC_Dialog_C_BPI_GetDialogueCameraByType::Temp_object_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_jRPG_NPC_Dialog_C_BPI_GetDialogueCameraByType, K2Node_Select_Default) == 0x000038, "Member 'BP_jRPG_NPC_Dialog_C_BPI_GetDialogueCameraByType::K2Node_Select_Default' has a wrong offset!");

// Function BP_jRPG_NPC_Dialog.BP_jRPG_NPC_Dialog_C.BPI_HasLightingAuthority
// 0x0001 (0x0001 - 0x0000)
struct BP_jRPG_NPC_Dialog_C_BPI_HasLightingAuthority final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_jRPG_NPC_Dialog_C_BPI_HasLightingAuthority) == 0x000001, "Wrong alignment on BP_jRPG_NPC_Dialog_C_BPI_HasLightingAuthority");
static_assert(sizeof(BP_jRPG_NPC_Dialog_C_BPI_HasLightingAuthority) == 0x000001, "Wrong size on BP_jRPG_NPC_Dialog_C_BPI_HasLightingAuthority");
static_assert(offsetof(BP_jRPG_NPC_Dialog_C_BPI_HasLightingAuthority, ReturnValue) == 0x000000, "Member 'BP_jRPG_NPC_Dialog_C_BPI_HasLightingAuthority::ReturnValue' has a wrong offset!");

// Function BP_jRPG_NPC_Dialog.BP_jRPG_NPC_Dialog_C.BPI_ShouldMoveCameraPresetsToOtherSide
// 0x0001 (0x0001 - 0x0000)
struct BP_jRPG_NPC_Dialog_C_BPI_ShouldMoveCameraPresetsToOtherSide final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_jRPG_NPC_Dialog_C_BPI_ShouldMoveCameraPresetsToOtherSide) == 0x000001, "Wrong alignment on BP_jRPG_NPC_Dialog_C_BPI_ShouldMoveCameraPresetsToOtherSide");
static_assert(sizeof(BP_jRPG_NPC_Dialog_C_BPI_ShouldMoveCameraPresetsToOtherSide) == 0x000001, "Wrong size on BP_jRPG_NPC_Dialog_C_BPI_ShouldMoveCameraPresetsToOtherSide");
static_assert(offsetof(BP_jRPG_NPC_Dialog_C_BPI_ShouldMoveCameraPresetsToOtherSide, ReturnValue) == 0x000000, "Member 'BP_jRPG_NPC_Dialog_C_BPI_ShouldMoveCameraPresetsToOtherSide::ReturnValue' has a wrong offset!");

// Function BP_jRPG_NPC_Dialog.BP_jRPG_NPC_Dialog_C.BPI_GetInteractingCharacter
// 0x0010 (0x0010 - 0x0000)
struct BP_jRPG_NPC_Dialog_C_BPI_GetInteractingCharacter final
{
public:
	TScriptInterface<class IBPI_DialogueCharacter_C> ReturnValue;                                    // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_jRPG_NPC_Dialog_C_BPI_GetInteractingCharacter) == 0x000008, "Wrong alignment on BP_jRPG_NPC_Dialog_C_BPI_GetInteractingCharacter");
static_assert(sizeof(BP_jRPG_NPC_Dialog_C_BPI_GetInteractingCharacter) == 0x000010, "Wrong size on BP_jRPG_NPC_Dialog_C_BPI_GetInteractingCharacter");
static_assert(offsetof(BP_jRPG_NPC_Dialog_C_BPI_GetInteractingCharacter, ReturnValue) == 0x000000, "Member 'BP_jRPG_NPC_Dialog_C_BPI_GetInteractingCharacter::ReturnValue' has a wrong offset!");

// Function BP_jRPG_NPC_Dialog.BP_jRPG_NPC_Dialog_C.BPI_GetDialogueCameraOffset
// 0x0018 (0x0018 - 0x0000)
struct BP_jRPG_NPC_Dialog_C_BPI_GetDialogueCameraOffset final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_jRPG_NPC_Dialog_C_BPI_GetDialogueCameraOffset) == 0x000008, "Wrong alignment on BP_jRPG_NPC_Dialog_C_BPI_GetDialogueCameraOffset");
static_assert(sizeof(BP_jRPG_NPC_Dialog_C_BPI_GetDialogueCameraOffset) == 0x000018, "Wrong size on BP_jRPG_NPC_Dialog_C_BPI_GetDialogueCameraOffset");
static_assert(offsetof(BP_jRPG_NPC_Dialog_C_BPI_GetDialogueCameraOffset, ReturnValue) == 0x000000, "Member 'BP_jRPG_NPC_Dialog_C_BPI_GetDialogueCameraOffset::ReturnValue' has a wrong offset!");

// Function BP_jRPG_NPC_Dialog.BP_jRPG_NPC_Dialog_C.BPI_GetReverseSpotlightReceiver
// 0x0038 (0x0038 - 0x0000)
struct BP_jRPG_NPC_Dialog_C_BPI_GetReverseSpotlightReceiver final
{
public:
	TScriptInterface<class IBPI_DialogueCharacter_C> ReturnValue;                                    // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_DialogueCharacter_C> Temp_interface_Variable;                        // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_DialogueCharacter_C> K2Node_Select_Default;                          // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_jRPG_NPC_Dialog_C_BPI_GetReverseSpotlightReceiver) == 0x000008, "Wrong alignment on BP_jRPG_NPC_Dialog_C_BPI_GetReverseSpotlightReceiver");
static_assert(sizeof(BP_jRPG_NPC_Dialog_C_BPI_GetReverseSpotlightReceiver) == 0x000038, "Wrong size on BP_jRPG_NPC_Dialog_C_BPI_GetReverseSpotlightReceiver");
static_assert(offsetof(BP_jRPG_NPC_Dialog_C_BPI_GetReverseSpotlightReceiver, ReturnValue) == 0x000000, "Member 'BP_jRPG_NPC_Dialog_C_BPI_GetReverseSpotlightReceiver::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_NPC_Dialog_C_BPI_GetReverseSpotlightReceiver, Temp_bool_Variable) == 0x000010, "Member 'BP_jRPG_NPC_Dialog_C_BPI_GetReverseSpotlightReceiver::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_jRPG_NPC_Dialog_C_BPI_GetReverseSpotlightReceiver, Temp_interface_Variable) == 0x000018, "Member 'BP_jRPG_NPC_Dialog_C_BPI_GetReverseSpotlightReceiver::Temp_interface_Variable' has a wrong offset!");
static_assert(offsetof(BP_jRPG_NPC_Dialog_C_BPI_GetReverseSpotlightReceiver, K2Node_Select_Default) == 0x000028, "Member 'BP_jRPG_NPC_Dialog_C_BPI_GetReverseSpotlightReceiver::K2Node_Select_Default' has a wrong offset!");

// Function BP_jRPG_NPC_Dialog.BP_jRPG_NPC_Dialog_C.BPI_GetLightDirection
// 0x0001 (0x0001 - 0x0000)
struct BP_jRPG_NPC_Dialog_C_BPI_GetLightDirection final
{
public:
	E_NPC_SpolightTypes                           ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_jRPG_NPC_Dialog_C_BPI_GetLightDirection) == 0x000001, "Wrong alignment on BP_jRPG_NPC_Dialog_C_BPI_GetLightDirection");
static_assert(sizeof(BP_jRPG_NPC_Dialog_C_BPI_GetLightDirection) == 0x000001, "Wrong size on BP_jRPG_NPC_Dialog_C_BPI_GetLightDirection");
static_assert(offsetof(BP_jRPG_NPC_Dialog_C_BPI_GetLightDirection, ReturnValue) == 0x000000, "Member 'BP_jRPG_NPC_Dialog_C_BPI_GetLightDirection::ReturnValue' has a wrong offset!");

// Function BP_jRPG_NPC_Dialog.BP_jRPG_NPC_Dialog_C.BPI_GetLightingSet
// 0x0048 (0x0048 - 0x0000)
struct BP_jRPG_NPC_Dialog_C_BPI_GetLightingSet final
{
public:
	E_NPC_SpolightTypes                           LightDirection;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULightComponent*                        FrontLight;                                        // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ULightComponent*                        RimLight;                                          // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	E_NPC_SpolightTypes                           Temp_byte_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULightComponent*                        Temp_object_Variable;                              // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	E_NPC_SpolightTypes                           Temp_byte_Variable_1;                              // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULightComponent*                        Temp_object_Variable_1;                            // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ULightComponent*                        K2Node_Select_Default;                             // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ULightComponent*                        K2Node_Select_Default_1;                           // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_jRPG_NPC_Dialog_C_BPI_GetLightingSet) == 0x000008, "Wrong alignment on BP_jRPG_NPC_Dialog_C_BPI_GetLightingSet");
static_assert(sizeof(BP_jRPG_NPC_Dialog_C_BPI_GetLightingSet) == 0x000048, "Wrong size on BP_jRPG_NPC_Dialog_C_BPI_GetLightingSet");
static_assert(offsetof(BP_jRPG_NPC_Dialog_C_BPI_GetLightingSet, LightDirection) == 0x000000, "Member 'BP_jRPG_NPC_Dialog_C_BPI_GetLightingSet::LightDirection' has a wrong offset!");
static_assert(offsetof(BP_jRPG_NPC_Dialog_C_BPI_GetLightingSet, FrontLight) == 0x000008, "Member 'BP_jRPG_NPC_Dialog_C_BPI_GetLightingSet::FrontLight' has a wrong offset!");
static_assert(offsetof(BP_jRPG_NPC_Dialog_C_BPI_GetLightingSet, RimLight) == 0x000010, "Member 'BP_jRPG_NPC_Dialog_C_BPI_GetLightingSet::RimLight' has a wrong offset!");
static_assert(offsetof(BP_jRPG_NPC_Dialog_C_BPI_GetLightingSet, Temp_byte_Variable) == 0x000018, "Member 'BP_jRPG_NPC_Dialog_C_BPI_GetLightingSet::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_jRPG_NPC_Dialog_C_BPI_GetLightingSet, Temp_object_Variable) == 0x000020, "Member 'BP_jRPG_NPC_Dialog_C_BPI_GetLightingSet::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_jRPG_NPC_Dialog_C_BPI_GetLightingSet, Temp_byte_Variable_1) == 0x000028, "Member 'BP_jRPG_NPC_Dialog_C_BPI_GetLightingSet::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_jRPG_NPC_Dialog_C_BPI_GetLightingSet, Temp_object_Variable_1) == 0x000030, "Member 'BP_jRPG_NPC_Dialog_C_BPI_GetLightingSet::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_jRPG_NPC_Dialog_C_BPI_GetLightingSet, K2Node_Select_Default) == 0x000038, "Member 'BP_jRPG_NPC_Dialog_C_BPI_GetLightingSet::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_jRPG_NPC_Dialog_C_BPI_GetLightingSet, K2Node_Select_Default_1) == 0x000040, "Member 'BP_jRPG_NPC_Dialog_C_BPI_GetLightingSet::K2Node_Select_Default_1' has a wrong offset!");

// Function BP_jRPG_NPC_Dialog.BP_jRPG_NPC_Dialog_C.BPI_GetAllDialogueCameras
// 0x0020 (0x0020 - 0x0000)
struct BP_jRPG_NPC_Dialog_C_BPI_GetAllDialogueCameras final
{
public:
	TArray<class UCineCameraComponent*>           CineCameraComponents;                              // 0x0000(0x0010)(Parm, OutParm, ContainsInstancedReference)
	TArray<class UCineCameraComponent*>           CallFunc_GetAllDialogueCameras_Array;              // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(BP_jRPG_NPC_Dialog_C_BPI_GetAllDialogueCameras) == 0x000008, "Wrong alignment on BP_jRPG_NPC_Dialog_C_BPI_GetAllDialogueCameras");
static_assert(sizeof(BP_jRPG_NPC_Dialog_C_BPI_GetAllDialogueCameras) == 0x000020, "Wrong size on BP_jRPG_NPC_Dialog_C_BPI_GetAllDialogueCameras");
static_assert(offsetof(BP_jRPG_NPC_Dialog_C_BPI_GetAllDialogueCameras, CineCameraComponents) == 0x000000, "Member 'BP_jRPG_NPC_Dialog_C_BPI_GetAllDialogueCameras::CineCameraComponents' has a wrong offset!");
static_assert(offsetof(BP_jRPG_NPC_Dialog_C_BPI_GetAllDialogueCameras, CallFunc_GetAllDialogueCameras_Array) == 0x000010, "Member 'BP_jRPG_NPC_Dialog_C_BPI_GetAllDialogueCameras::CallFunc_GetAllDialogueCameras_Array' has a wrong offset!");

// Function BP_jRPG_NPC_Dialog.BP_jRPG_NPC_Dialog_C.BPI_GetDialogueFocusPoint
// 0x0008 (0x0008 - 0x0000)
struct BP_jRPG_NPC_Dialog_C_BPI_GetDialogueFocusPoint final
{
public:
	class USceneComponent*                        SceneComponent;                                    // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_jRPG_NPC_Dialog_C_BPI_GetDialogueFocusPoint) == 0x000008, "Wrong alignment on BP_jRPG_NPC_Dialog_C_BPI_GetDialogueFocusPoint");
static_assert(sizeof(BP_jRPG_NPC_Dialog_C_BPI_GetDialogueFocusPoint) == 0x000008, "Wrong size on BP_jRPG_NPC_Dialog_C_BPI_GetDialogueFocusPoint");
static_assert(offsetof(BP_jRPG_NPC_Dialog_C_BPI_GetDialogueFocusPoint, SceneComponent) == 0x000000, "Member 'BP_jRPG_NPC_Dialog_C_BPI_GetDialogueFocusPoint::SceneComponent' has a wrong offset!");

// Function BP_jRPG_NPC_Dialog.BP_jRPG_NPC_Dialog_C.BPI_GetSpotlightsToActivateDuringDialogue
// 0x0010 (0x0010 - 0x0000)
struct BP_jRPG_NPC_Dialog_C_BPI_GetSpotlightsToActivateDuringDialogue final
{
public:
	TArray<TSoftObjectPtr<class ASpotLight>>      SpotLightActors;                                   // 0x0000(0x0010)(Parm, OutParm)
};
static_assert(alignof(BP_jRPG_NPC_Dialog_C_BPI_GetSpotlightsToActivateDuringDialogue) == 0x000008, "Wrong alignment on BP_jRPG_NPC_Dialog_C_BPI_GetSpotlightsToActivateDuringDialogue");
static_assert(sizeof(BP_jRPG_NPC_Dialog_C_BPI_GetSpotlightsToActivateDuringDialogue) == 0x000010, "Wrong size on BP_jRPG_NPC_Dialog_C_BPI_GetSpotlightsToActivateDuringDialogue");
static_assert(offsetof(BP_jRPG_NPC_Dialog_C_BPI_GetSpotlightsToActivateDuringDialogue, SpotLightActors) == 0x000000, "Member 'BP_jRPG_NPC_Dialog_C_BPI_GetSpotlightsToActivateDuringDialogue::SpotLightActors' has a wrong offset!");

// Function BP_jRPG_NPC_Dialog.BP_jRPG_NPC_Dialog_C.GetDialogueCharacterInterface
// 0x0010 (0x0010 - 0x0000)
struct BP_jRPG_NPC_Dialog_C_GetDialogueCharacterInterface final
{
public:
	TScriptInterface<class IBPI_DialogueCharacter_C> ReturnValue;                                    // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_jRPG_NPC_Dialog_C_GetDialogueCharacterInterface) == 0x000008, "Wrong alignment on BP_jRPG_NPC_Dialog_C_GetDialogueCharacterInterface");
static_assert(sizeof(BP_jRPG_NPC_Dialog_C_GetDialogueCharacterInterface) == 0x000010, "Wrong size on BP_jRPG_NPC_Dialog_C_GetDialogueCharacterInterface");
static_assert(offsetof(BP_jRPG_NPC_Dialog_C_GetDialogueCharacterInterface, ReturnValue) == 0x000000, "Member 'BP_jRPG_NPC_Dialog_C_GetDialogueCharacterInterface::ReturnValue' has a wrong offset!");

// Function BP_jRPG_NPC_Dialog.BP_jRPG_NPC_Dialog_C.AreDependenciesLoaded
// 0x0001 (0x0001 - 0x0000)
struct BP_jRPG_NPC_Dialog_C_AreDependenciesLoaded final
{
public:
	bool                                          AreLoaded;                                         // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_jRPG_NPC_Dialog_C_AreDependenciesLoaded) == 0x000001, "Wrong alignment on BP_jRPG_NPC_Dialog_C_AreDependenciesLoaded");
static_assert(sizeof(BP_jRPG_NPC_Dialog_C_AreDependenciesLoaded) == 0x000001, "Wrong size on BP_jRPG_NPC_Dialog_C_AreDependenciesLoaded");
static_assert(offsetof(BP_jRPG_NPC_Dialog_C_AreDependenciesLoaded, AreLoaded) == 0x000000, "Member 'BP_jRPG_NPC_Dialog_C_AreDependenciesLoaded::AreLoaded' has a wrong offset!");

// Function BP_jRPG_NPC_Dialog.BP_jRPG_NPC_Dialog_C.GetCharacterActor
// 0x0008 (0x0008 - 0x0000)
struct BP_jRPG_NPC_Dialog_C_GetCharacterActor final
{
public:
	class AActor*                                 Character;                                         // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_jRPG_NPC_Dialog_C_GetCharacterActor) == 0x000008, "Wrong alignment on BP_jRPG_NPC_Dialog_C_GetCharacterActor");
static_assert(sizeof(BP_jRPG_NPC_Dialog_C_GetCharacterActor) == 0x000008, "Wrong size on BP_jRPG_NPC_Dialog_C_GetCharacterActor");
static_assert(offsetof(BP_jRPG_NPC_Dialog_C_GetCharacterActor, Character) == 0x000000, "Member 'BP_jRPG_NPC_Dialog_C_GetCharacterActor::Character' has a wrong offset!");

// Function BP_jRPG_NPC_Dialog.BP_jRPG_NPC_Dialog_C.GetCameraComponent
// 0x0008 (0x0008 - 0x0000)
struct BP_jRPG_NPC_Dialog_C_GetCameraComponent final
{
public:
	class UCameraComponent*                       Camera;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_jRPG_NPC_Dialog_C_GetCameraComponent) == 0x000008, "Wrong alignment on BP_jRPG_NPC_Dialog_C_GetCameraComponent");
static_assert(sizeof(BP_jRPG_NPC_Dialog_C_GetCameraComponent) == 0x000008, "Wrong size on BP_jRPG_NPC_Dialog_C_GetCameraComponent");
static_assert(offsetof(BP_jRPG_NPC_Dialog_C_GetCameraComponent, Camera) == 0x000000, "Member 'BP_jRPG_NPC_Dialog_C_GetCameraComponent::Camera' has a wrong offset!");

// Function BP_jRPG_NPC_Dialog.BP_jRPG_NPC_Dialog_C.GetAssetDialogueCharacter
// 0x0008 (0x0008 - 0x0000)
struct BP_jRPG_NPC_Dialog_C_GetAssetDialogueCharacter final
{
public:
	class UBP_DataAsset_DialogueCharacter_C*      DialogueCharacter_0;                               // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_jRPG_NPC_Dialog_C_GetAssetDialogueCharacter) == 0x000008, "Wrong alignment on BP_jRPG_NPC_Dialog_C_GetAssetDialogueCharacter");
static_assert(sizeof(BP_jRPG_NPC_Dialog_C_GetAssetDialogueCharacter) == 0x000008, "Wrong size on BP_jRPG_NPC_Dialog_C_GetAssetDialogueCharacter");
static_assert(offsetof(BP_jRPG_NPC_Dialog_C_GetAssetDialogueCharacter, DialogueCharacter_0) == 0x000000, "Member 'BP_jRPG_NPC_Dialog_C_GetAssetDialogueCharacter::DialogueCharacter_0' has a wrong offset!");

// Function BP_jRPG_NPC_Dialog.BP_jRPG_NPC_Dialog_C.ForceLODDuringDialogue
// 0x0048 (0x0048 - 0x0000)
struct BP_jRPG_NPC_Dialog_C_ForceLODDuringDialogue final
{
public:
	bool                                          CallFunc_IsCurrentConsoleTypeLockheart_ReturnValue; // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_MakeLiteralGameplayTagContainer_ReturnValue; // 0x0008(0x0020)()
	struct FGameplayTag                           CallFunc_GetPlatformNameAsTag_ReturnValue;         // 0x0028(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetConsoleVariableIntValue_ReturnValue;   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Abs_Int_ReturnValue;                      // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_jRPG_NPC_Dialog_C_ForceLODDuringDialogue) == 0x000008, "Wrong alignment on BP_jRPG_NPC_Dialog_C_ForceLODDuringDialogue");
static_assert(sizeof(BP_jRPG_NPC_Dialog_C_ForceLODDuringDialogue) == 0x000048, "Wrong size on BP_jRPG_NPC_Dialog_C_ForceLODDuringDialogue");
static_assert(offsetof(BP_jRPG_NPC_Dialog_C_ForceLODDuringDialogue, CallFunc_IsCurrentConsoleTypeLockheart_ReturnValue) == 0x000000, "Member 'BP_jRPG_NPC_Dialog_C_ForceLODDuringDialogue::CallFunc_IsCurrentConsoleTypeLockheart_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_NPC_Dialog_C_ForceLODDuringDialogue, CallFunc_MakeLiteralGameplayTagContainer_ReturnValue) == 0x000008, "Member 'BP_jRPG_NPC_Dialog_C_ForceLODDuringDialogue::CallFunc_MakeLiteralGameplayTagContainer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_NPC_Dialog_C_ForceLODDuringDialogue, CallFunc_GetPlatformNameAsTag_ReturnValue) == 0x000028, "Member 'BP_jRPG_NPC_Dialog_C_ForceLODDuringDialogue::CallFunc_GetPlatformNameAsTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_NPC_Dialog_C_ForceLODDuringDialogue, CallFunc_HasTag_ReturnValue) == 0x000030, "Member 'BP_jRPG_NPC_Dialog_C_ForceLODDuringDialogue::CallFunc_HasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_NPC_Dialog_C_ForceLODDuringDialogue, CallFunc_GetConsoleVariableIntValue_ReturnValue) == 0x000034, "Member 'BP_jRPG_NPC_Dialog_C_ForceLODDuringDialogue::CallFunc_GetConsoleVariableIntValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_NPC_Dialog_C_ForceLODDuringDialogue, CallFunc_Subtract_IntInt_ReturnValue) == 0x000038, "Member 'BP_jRPG_NPC_Dialog_C_ForceLODDuringDialogue::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_NPC_Dialog_C_ForceLODDuringDialogue, CallFunc_Abs_Int_ReturnValue) == 0x00003C, "Member 'BP_jRPG_NPC_Dialog_C_ForceLODDuringDialogue::CallFunc_Abs_Int_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_NPC_Dialog_C_ForceLODDuringDialogue, CallFunc_Add_IntInt_ReturnValue) == 0x000040, "Member 'BP_jRPG_NPC_Dialog_C_ForceLODDuringDialogue::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function BP_jRPG_NPC_Dialog.BP_jRPG_NPC_Dialog_C.UnpauseGameplayAfterDialog
// 0x0048 (0x0048 - 0x0000)
struct BP_jRPG_NPC_Dialog_C_UnpauseGameplayAfterDialog final
{
public:
	struct FS_GameplayPauseParameters             K2Node_MakeStruct_S_GameplayPauseParameters;       // 0x0000(0x0030)(HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_jRPG_Controller_World_C*            K2Node_DynamicCast_AsBP_J_RPG_Controller_World;    // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_jRPG_NPC_Dialog_C_UnpauseGameplayAfterDialog) == 0x000008, "Wrong alignment on BP_jRPG_NPC_Dialog_C_UnpauseGameplayAfterDialog");
static_assert(sizeof(BP_jRPG_NPC_Dialog_C_UnpauseGameplayAfterDialog) == 0x000048, "Wrong size on BP_jRPG_NPC_Dialog_C_UnpauseGameplayAfterDialog");
static_assert(offsetof(BP_jRPG_NPC_Dialog_C_UnpauseGameplayAfterDialog, K2Node_MakeStruct_S_GameplayPauseParameters) == 0x000000, "Member 'BP_jRPG_NPC_Dialog_C_UnpauseGameplayAfterDialog::K2Node_MakeStruct_S_GameplayPauseParameters' has a wrong offset!");
static_assert(offsetof(BP_jRPG_NPC_Dialog_C_UnpauseGameplayAfterDialog, CallFunc_GetPlayerController_ReturnValue) == 0x000030, "Member 'BP_jRPG_NPC_Dialog_C_UnpauseGameplayAfterDialog::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_NPC_Dialog_C_UnpauseGameplayAfterDialog, K2Node_DynamicCast_AsBP_J_RPG_Controller_World) == 0x000038, "Member 'BP_jRPG_NPC_Dialog_C_UnpauseGameplayAfterDialog::K2Node_DynamicCast_AsBP_J_RPG_Controller_World' has a wrong offset!");
static_assert(offsetof(BP_jRPG_NPC_Dialog_C_UnpauseGameplayAfterDialog, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'BP_jRPG_NPC_Dialog_C_UnpauseGameplayAfterDialog::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BP_jRPG_NPC_Dialog.BP_jRPG_NPC_Dialog_C.PauseGameplayBeforeDialog
// 0x0058 (0x0058 - 0x0000)
struct BP_jRPG_NPC_Dialog_C_PauseGameplayBeforeDialog final
{
public:
	TArray<class UClass*>                         K2Node_MakeArray_Array;                            // 0x0000(0x0010)(ReferenceParm)
	struct FS_GameplayPauseParameters             K2Node_MakeStruct_S_GameplayPauseParameters;       // 0x0010(0x0030)(HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_jRPG_Controller_World_C*            K2Node_DynamicCast_AsBP_J_RPG_Controller_World;    // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_jRPG_NPC_Dialog_C_PauseGameplayBeforeDialog) == 0x000008, "Wrong alignment on BP_jRPG_NPC_Dialog_C_PauseGameplayBeforeDialog");
static_assert(sizeof(BP_jRPG_NPC_Dialog_C_PauseGameplayBeforeDialog) == 0x000058, "Wrong size on BP_jRPG_NPC_Dialog_C_PauseGameplayBeforeDialog");
static_assert(offsetof(BP_jRPG_NPC_Dialog_C_PauseGameplayBeforeDialog, K2Node_MakeArray_Array) == 0x000000, "Member 'BP_jRPG_NPC_Dialog_C_PauseGameplayBeforeDialog::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_jRPG_NPC_Dialog_C_PauseGameplayBeforeDialog, K2Node_MakeStruct_S_GameplayPauseParameters) == 0x000010, "Member 'BP_jRPG_NPC_Dialog_C_PauseGameplayBeforeDialog::K2Node_MakeStruct_S_GameplayPauseParameters' has a wrong offset!");
static_assert(offsetof(BP_jRPG_NPC_Dialog_C_PauseGameplayBeforeDialog, CallFunc_GetPlayerController_ReturnValue) == 0x000040, "Member 'BP_jRPG_NPC_Dialog_C_PauseGameplayBeforeDialog::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_NPC_Dialog_C_PauseGameplayBeforeDialog, K2Node_DynamicCast_AsBP_J_RPG_Controller_World) == 0x000048, "Member 'BP_jRPG_NPC_Dialog_C_PauseGameplayBeforeDialog::K2Node_DynamicCast_AsBP_J_RPG_Controller_World' has a wrong offset!");
static_assert(offsetof(BP_jRPG_NPC_Dialog_C_PauseGameplayBeforeDialog, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'BP_jRPG_NPC_Dialog_C_PauseGameplayBeforeDialog::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BP_jRPG_NPC_Dialog.BP_jRPG_NPC_Dialog_C.Validate Hidden Actors Visiblity Array
// 0x0188 (0x0188 - 0x0000)
struct BP_jRPG_NPC_Dialog_C_Validate_Hidden_Actors_Visiblity_Array final
{
public:
	TArray<TSoftObjectPtr<class AActor>>          Array;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class AActor>                  CallFunc_Array_Get_Item;                           // 0x0028(0x0028)(HasGetValueTypeHash)
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_DynamicCast_AsActor;                        // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62[0x6];                                       // 0x0062(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0078(0x0010)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0088(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0098(0x0048)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00E0(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0128(0x0010)(ReferenceParm)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0138(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Format_ReturnValue;                       // 0x0148(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Format_ReturnValue_1;                     // 0x0158(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_DynamicCast_AsPawn;                         // 0x0168(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_171[0x7];                                      // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_ConditionCheckerComponent_C*        CallFunc_GetComponentByClass_ReturnValue;          // 0x0178(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_jRPG_NPC_Dialog_C_Validate_Hidden_Actors_Visiblity_Array) == 0x000008, "Wrong alignment on BP_jRPG_NPC_Dialog_C_Validate_Hidden_Actors_Visiblity_Array");
static_assert(sizeof(BP_jRPG_NPC_Dialog_C_Validate_Hidden_Actors_Visiblity_Array) == 0x000188, "Wrong size on BP_jRPG_NPC_Dialog_C_Validate_Hidden_Actors_Visiblity_Array");
static_assert(offsetof(BP_jRPG_NPC_Dialog_C_Validate_Hidden_Actors_Visiblity_Array, Array) == 0x000000, "Member 'BP_jRPG_NPC_Dialog_C_Validate_Hidden_Actors_Visiblity_Array::Array' has a wrong offset!");
static_assert(offsetof(BP_jRPG_NPC_Dialog_C_Validate_Hidden_Actors_Visiblity_Array, Temp_int_Loop_Counter_Variable) == 0x000010, "Member 'BP_jRPG_NPC_Dialog_C_Validate_Hidden_Actors_Visiblity_Array::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_jRPG_NPC_Dialog_C_Validate_Hidden_Actors_Visiblity_Array, CallFunc_Array_Length_ReturnValue) == 0x000014, "Member 'BP_jRPG_NPC_Dialog_C_Validate_Hidden_Actors_Visiblity_Array::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_NPC_Dialog_C_Validate_Hidden_Actors_Visiblity_Array, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'BP_jRPG_NPC_Dialog_C_Validate_Hidden_Actors_Visiblity_Array::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_NPC_Dialog_C_Validate_Hidden_Actors_Visiblity_Array, CallFunc_Less_IntInt_ReturnValue) == 0x00001C, "Member 'BP_jRPG_NPC_Dialog_C_Validate_Hidden_Actors_Visiblity_Array::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_NPC_Dialog_C_Validate_Hidden_Actors_Visiblity_Array, Temp_int_Array_Index_Variable) == 0x000020, "Member 'BP_jRPG_NPC_Dialog_C_Validate_Hidden_Actors_Visiblity_Array::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_jRPG_NPC_Dialog_C_Validate_Hidden_Actors_Visiblity_Array, CallFunc_Array_Get_Item) == 0x000028, "Member 'BP_jRPG_NPC_Dialog_C_Validate_Hidden_Actors_Visiblity_Array::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_jRPG_NPC_Dialog_C_Validate_Hidden_Actors_Visiblity_Array, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue) == 0x000050, "Member 'BP_jRPG_NPC_Dialog_C_Validate_Hidden_Actors_Visiblity_Array::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_NPC_Dialog_C_Validate_Hidden_Actors_Visiblity_Array, K2Node_DynamicCast_AsActor) == 0x000058, "Member 'BP_jRPG_NPC_Dialog_C_Validate_Hidden_Actors_Visiblity_Array::K2Node_DynamicCast_AsActor' has a wrong offset!");
static_assert(offsetof(BP_jRPG_NPC_Dialog_C_Validate_Hidden_Actors_Visiblity_Array, K2Node_DynamicCast_bSuccess) == 0x000060, "Member 'BP_jRPG_NPC_Dialog_C_Validate_Hidden_Actors_Visiblity_Array::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_jRPG_NPC_Dialog_C_Validate_Hidden_Actors_Visiblity_Array, CallFunc_IsValid_ReturnValue) == 0x000061, "Member 'BP_jRPG_NPC_Dialog_C_Validate_Hidden_Actors_Visiblity_Array::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_NPC_Dialog_C_Validate_Hidden_Actors_Visiblity_Array, CallFunc_GetDisplayName_ReturnValue) == 0x000068, "Member 'BP_jRPG_NPC_Dialog_C_Validate_Hidden_Actors_Visiblity_Array::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_NPC_Dialog_C_Validate_Hidden_Actors_Visiblity_Array, CallFunc_Conv_StringToText_ReturnValue) == 0x000078, "Member 'BP_jRPG_NPC_Dialog_C_Validate_Hidden_Actors_Visiblity_Array::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_NPC_Dialog_C_Validate_Hidden_Actors_Visiblity_Array, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000088, "Member 'BP_jRPG_NPC_Dialog_C_Validate_Hidden_Actors_Visiblity_Array::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_jRPG_NPC_Dialog_C_Validate_Hidden_Actors_Visiblity_Array, K2Node_MakeStruct_FormatArgumentData) == 0x000098, "Member 'BP_jRPG_NPC_Dialog_C_Validate_Hidden_Actors_Visiblity_Array::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_jRPG_NPC_Dialog_C_Validate_Hidden_Actors_Visiblity_Array, K2Node_MakeStruct_FormatArgumentData_1) == 0x0000E0, "Member 'BP_jRPG_NPC_Dialog_C_Validate_Hidden_Actors_Visiblity_Array::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BP_jRPG_NPC_Dialog_C_Validate_Hidden_Actors_Visiblity_Array, K2Node_MakeArray_Array) == 0x000128, "Member 'BP_jRPG_NPC_Dialog_C_Validate_Hidden_Actors_Visiblity_Array::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_jRPG_NPC_Dialog_C_Validate_Hidden_Actors_Visiblity_Array, K2Node_MakeArray_Array_1) == 0x000138, "Member 'BP_jRPG_NPC_Dialog_C_Validate_Hidden_Actors_Visiblity_Array::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BP_jRPG_NPC_Dialog_C_Validate_Hidden_Actors_Visiblity_Array, CallFunc_Format_ReturnValue) == 0x000148, "Member 'BP_jRPG_NPC_Dialog_C_Validate_Hidden_Actors_Visiblity_Array::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_NPC_Dialog_C_Validate_Hidden_Actors_Visiblity_Array, CallFunc_Format_ReturnValue_1) == 0x000158, "Member 'BP_jRPG_NPC_Dialog_C_Validate_Hidden_Actors_Visiblity_Array::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_jRPG_NPC_Dialog_C_Validate_Hidden_Actors_Visiblity_Array, K2Node_DynamicCast_AsPawn) == 0x000168, "Member 'BP_jRPG_NPC_Dialog_C_Validate_Hidden_Actors_Visiblity_Array::K2Node_DynamicCast_AsPawn' has a wrong offset!");
static_assert(offsetof(BP_jRPG_NPC_Dialog_C_Validate_Hidden_Actors_Visiblity_Array, K2Node_DynamicCast_bSuccess_1) == 0x000170, "Member 'BP_jRPG_NPC_Dialog_C_Validate_Hidden_Actors_Visiblity_Array::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_jRPG_NPC_Dialog_C_Validate_Hidden_Actors_Visiblity_Array, CallFunc_GetComponentByClass_ReturnValue) == 0x000178, "Member 'BP_jRPG_NPC_Dialog_C_Validate_Hidden_Actors_Visiblity_Array::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_NPC_Dialog_C_Validate_Hidden_Actors_Visiblity_Array, CallFunc_IsValid_ReturnValue_1) == 0x000180, "Member 'BP_jRPG_NPC_Dialog_C_Validate_Hidden_Actors_Visiblity_Array::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function BP_jRPG_NPC_Dialog.BP_jRPG_NPC_Dialog_C.ForceActorsToUnhideVisibility
// 0x0060 (0x0060 - 0x0000)
struct BP_jRPG_NPC_Dialog_C_ForceActorsToUnhideVisibility final
{
public:
	bool                                          NewHidden;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class AActor>                  CallFunc_Array_Get_Item;                           // 0x0018(0x0028)(HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_DynamicCast_AsActor;                        // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_jRPG_NPC_Dialog_C_ForceActorsToUnhideVisibility) == 0x000008, "Wrong alignment on BP_jRPG_NPC_Dialog_C_ForceActorsToUnhideVisibility");
static_assert(sizeof(BP_jRPG_NPC_Dialog_C_ForceActorsToUnhideVisibility) == 0x000060, "Wrong size on BP_jRPG_NPC_Dialog_C_ForceActorsToUnhideVisibility");
static_assert(offsetof(BP_jRPG_NPC_Dialog_C_ForceActorsToUnhideVisibility, NewHidden) == 0x000000, "Member 'BP_jRPG_NPC_Dialog_C_ForceActorsToUnhideVisibility::NewHidden' has a wrong offset!");
static_assert(offsetof(BP_jRPG_NPC_Dialog_C_ForceActorsToUnhideVisibility, Temp_int_Array_Index_Variable) == 0x000004, "Member 'BP_jRPG_NPC_Dialog_C_ForceActorsToUnhideVisibility::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_jRPG_NPC_Dialog_C_ForceActorsToUnhideVisibility, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'BP_jRPG_NPC_Dialog_C_ForceActorsToUnhideVisibility::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_jRPG_NPC_Dialog_C_ForceActorsToUnhideVisibility, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'BP_jRPG_NPC_Dialog_C_ForceActorsToUnhideVisibility::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_NPC_Dialog_C_ForceActorsToUnhideVisibility, CallFunc_Array_Length_ReturnValue) == 0x000010, "Member 'BP_jRPG_NPC_Dialog_C_ForceActorsToUnhideVisibility::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_NPC_Dialog_C_ForceActorsToUnhideVisibility, CallFunc_Array_Get_Item) == 0x000018, "Member 'BP_jRPG_NPC_Dialog_C_ForceActorsToUnhideVisibility::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_jRPG_NPC_Dialog_C_ForceActorsToUnhideVisibility, CallFunc_Less_IntInt_ReturnValue) == 0x000040, "Member 'BP_jRPG_NPC_Dialog_C_ForceActorsToUnhideVisibility::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_NPC_Dialog_C_ForceActorsToUnhideVisibility, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue) == 0x000048, "Member 'BP_jRPG_NPC_Dialog_C_ForceActorsToUnhideVisibility::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_NPC_Dialog_C_ForceActorsToUnhideVisibility, K2Node_DynamicCast_AsActor) == 0x000050, "Member 'BP_jRPG_NPC_Dialog_C_ForceActorsToUnhideVisibility::K2Node_DynamicCast_AsActor' has a wrong offset!");
static_assert(offsetof(BP_jRPG_NPC_Dialog_C_ForceActorsToUnhideVisibility, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'BP_jRPG_NPC_Dialog_C_ForceActorsToUnhideVisibility::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_jRPG_NPC_Dialog_C_ForceActorsToUnhideVisibility, CallFunc_IsValid_ReturnValue) == 0x000059, "Member 'BP_jRPG_NPC_Dialog_C_ForceActorsToUnhideVisibility::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_jRPG_NPC_Dialog.BP_jRPG_NPC_Dialog_C.SetActorsVisibilityForDialogue
// 0x00C0 (0x00C0 - 0x0000)
struct BP_jRPG_NPC_Dialog_C_SetActorsVisibilityForDialogue final
{
public:
	bool                                          ShouldBeVisible;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPackagedForDistribution_ReturnValue;    // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B[0x1];                                        // 0x000B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class AActor>                  CallFunc_Array_Get_Item;                           // 0x0020(0x0028)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_DynamicCast_AsActor;                        // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A[0x2];                                       // 0x006A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class AActor>                  CallFunc_Array_Get_Item_1;                         // 0x0078(0x0028)(HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_1; // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_DynamicCast_AsActor_1;                      // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_jRPG_NPC_Dialog_C_SetActorsVisibilityForDialogue) == 0x000008, "Wrong alignment on BP_jRPG_NPC_Dialog_C_SetActorsVisibilityForDialogue");
static_assert(sizeof(BP_jRPG_NPC_Dialog_C_SetActorsVisibilityForDialogue) == 0x0000C0, "Wrong size on BP_jRPG_NPC_Dialog_C_SetActorsVisibilityForDialogue");
static_assert(offsetof(BP_jRPG_NPC_Dialog_C_SetActorsVisibilityForDialogue, ShouldBeVisible) == 0x000000, "Member 'BP_jRPG_NPC_Dialog_C_SetActorsVisibilityForDialogue::ShouldBeVisible' has a wrong offset!");
static_assert(offsetof(BP_jRPG_NPC_Dialog_C_SetActorsVisibilityForDialogue, Temp_int_Array_Index_Variable) == 0x000004, "Member 'BP_jRPG_NPC_Dialog_C_SetActorsVisibilityForDialogue::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_jRPG_NPC_Dialog_C_SetActorsVisibilityForDialogue, CallFunc_Not_PreBool_ReturnValue) == 0x000008, "Member 'BP_jRPG_NPC_Dialog_C_SetActorsVisibilityForDialogue::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_NPC_Dialog_C_SetActorsVisibilityForDialogue, CallFunc_IsPackagedForDistribution_ReturnValue) == 0x000009, "Member 'BP_jRPG_NPC_Dialog_C_SetActorsVisibilityForDialogue::CallFunc_IsPackagedForDistribution_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_NPC_Dialog_C_SetActorsVisibilityForDialogue, CallFunc_Not_PreBool_ReturnValue_1) == 0x00000A, "Member 'BP_jRPG_NPC_Dialog_C_SetActorsVisibilityForDialogue::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_jRPG_NPC_Dialog_C_SetActorsVisibilityForDialogue, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'BP_jRPG_NPC_Dialog_C_SetActorsVisibilityForDialogue::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_jRPG_NPC_Dialog_C_SetActorsVisibilityForDialogue, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'BP_jRPG_NPC_Dialog_C_SetActorsVisibilityForDialogue::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_NPC_Dialog_C_SetActorsVisibilityForDialogue, Temp_int_Array_Index_Variable_1) == 0x000014, "Member 'BP_jRPG_NPC_Dialog_C_SetActorsVisibilityForDialogue::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_jRPG_NPC_Dialog_C_SetActorsVisibilityForDialogue, Temp_int_Loop_Counter_Variable_1) == 0x000018, "Member 'BP_jRPG_NPC_Dialog_C_SetActorsVisibilityForDialogue::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_jRPG_NPC_Dialog_C_SetActorsVisibilityForDialogue, CallFunc_Array_Get_Item) == 0x000020, "Member 'BP_jRPG_NPC_Dialog_C_SetActorsVisibilityForDialogue::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_jRPG_NPC_Dialog_C_SetActorsVisibilityForDialogue, CallFunc_Array_Length_ReturnValue) == 0x000048, "Member 'BP_jRPG_NPC_Dialog_C_SetActorsVisibilityForDialogue::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_NPC_Dialog_C_SetActorsVisibilityForDialogue, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue) == 0x000050, "Member 'BP_jRPG_NPC_Dialog_C_SetActorsVisibilityForDialogue::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_NPC_Dialog_C_SetActorsVisibilityForDialogue, CallFunc_Less_IntInt_ReturnValue) == 0x000058, "Member 'BP_jRPG_NPC_Dialog_C_SetActorsVisibilityForDialogue::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_NPC_Dialog_C_SetActorsVisibilityForDialogue, K2Node_DynamicCast_AsActor) == 0x000060, "Member 'BP_jRPG_NPC_Dialog_C_SetActorsVisibilityForDialogue::K2Node_DynamicCast_AsActor' has a wrong offset!");
static_assert(offsetof(BP_jRPG_NPC_Dialog_C_SetActorsVisibilityForDialogue, K2Node_DynamicCast_bSuccess) == 0x000068, "Member 'BP_jRPG_NPC_Dialog_C_SetActorsVisibilityForDialogue::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_jRPG_NPC_Dialog_C_SetActorsVisibilityForDialogue, CallFunc_IsValid_ReturnValue) == 0x000069, "Member 'BP_jRPG_NPC_Dialog_C_SetActorsVisibilityForDialogue::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_NPC_Dialog_C_SetActorsVisibilityForDialogue, CallFunc_Add_IntInt_ReturnValue_1) == 0x00006C, "Member 'BP_jRPG_NPC_Dialog_C_SetActorsVisibilityForDialogue::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_jRPG_NPC_Dialog_C_SetActorsVisibilityForDialogue, CallFunc_Array_Length_ReturnValue_1) == 0x000070, "Member 'BP_jRPG_NPC_Dialog_C_SetActorsVisibilityForDialogue::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
