#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_jRPG_CharacterBattleSpot

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_jRPG_CharacterBattleSpot.BP_jRPG_CharacterBattleSpot_C
// 0x0058 (0x02E8 - 0x0290)
class ABP_jRPG_CharacterBattleSpot_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        SpawnPosition;                                     // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 PreviewMesh;                                       // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTextRenderComponent*                   BacklineText;                                      // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        BacklineArrow;                                     // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCapsuleComponent*                      BacklineCapsule;                                   // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTextRenderComponent*                   FrontlineText;                                     // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        FrontlineArrow;                                    // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCapsuleComponent*                      FrontlineCapsule;                                  // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Scene;                                             // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         SlotIndex;                                         // 0x02E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void DEBUG_CVarChange_ShowBattleDebug(bool NewValue);
	void ExecuteUbergraph_BP_jRPG_CharacterBattleSpot(int32 EntryPoint);
	void ReceiveBeginPlay();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_jRPG_CharacterBattleSpot_C">();
	}
	static class ABP_jRPG_CharacterBattleSpot_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_jRPG_CharacterBattleSpot_C>();
	}
};
static_assert(alignof(ABP_jRPG_CharacterBattleSpot_C) == 0x000008, "Wrong alignment on ABP_jRPG_CharacterBattleSpot_C");
static_assert(sizeof(ABP_jRPG_CharacterBattleSpot_C) == 0x0002E8, "Wrong size on ABP_jRPG_CharacterBattleSpot_C");
static_assert(offsetof(ABP_jRPG_CharacterBattleSpot_C, UberGraphFrame) == 0x000290, "Member 'ABP_jRPG_CharacterBattleSpot_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_jRPG_CharacterBattleSpot_C, SpawnPosition) == 0x000298, "Member 'ABP_jRPG_CharacterBattleSpot_C::SpawnPosition' has a wrong offset!");
static_assert(offsetof(ABP_jRPG_CharacterBattleSpot_C, PreviewMesh) == 0x0002A0, "Member 'ABP_jRPG_CharacterBattleSpot_C::PreviewMesh' has a wrong offset!");
static_assert(offsetof(ABP_jRPG_CharacterBattleSpot_C, BacklineText) == 0x0002A8, "Member 'ABP_jRPG_CharacterBattleSpot_C::BacklineText' has a wrong offset!");
static_assert(offsetof(ABP_jRPG_CharacterBattleSpot_C, BacklineArrow) == 0x0002B0, "Member 'ABP_jRPG_CharacterBattleSpot_C::BacklineArrow' has a wrong offset!");
static_assert(offsetof(ABP_jRPG_CharacterBattleSpot_C, BacklineCapsule) == 0x0002B8, "Member 'ABP_jRPG_CharacterBattleSpot_C::BacklineCapsule' has a wrong offset!");
static_assert(offsetof(ABP_jRPG_CharacterBattleSpot_C, FrontlineText) == 0x0002C0, "Member 'ABP_jRPG_CharacterBattleSpot_C::FrontlineText' has a wrong offset!");
static_assert(offsetof(ABP_jRPG_CharacterBattleSpot_C, FrontlineArrow) == 0x0002C8, "Member 'ABP_jRPG_CharacterBattleSpot_C::FrontlineArrow' has a wrong offset!");
static_assert(offsetof(ABP_jRPG_CharacterBattleSpot_C, FrontlineCapsule) == 0x0002D0, "Member 'ABP_jRPG_CharacterBattleSpot_C::FrontlineCapsule' has a wrong offset!");
static_assert(offsetof(ABP_jRPG_CharacterBattleSpot_C, Scene) == 0x0002D8, "Member 'ABP_jRPG_CharacterBattleSpot_C::Scene' has a wrong offset!");
static_assert(offsetof(ABP_jRPG_CharacterBattleSpot_C, SlotIndex) == 0x0002E0, "Member 'ABP_jRPG_CharacterBattleSpot_C::SlotIndex' has a wrong offset!");

}

