#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_LatentAction_LoadGame

#include "Basic.hpp"

#include "E_SaveManagerLoadingStatus_structs.hpp"


namespace SDK::Params
{

// Function BP_LatentAction_LoadGame.BP_LatentAction_LoadGame_C.GetIsSuccessful
// 0x0002 (0x0002 - 0x0000)
struct BP_LatentAction_LoadGame_C_GetIsSuccessful final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LatentAction_LoadGame_C_GetIsSuccessful) == 0x000001, "Wrong alignment on BP_LatentAction_LoadGame_C_GetIsSuccessful");
static_assert(sizeof(BP_LatentAction_LoadGame_C_GetIsSuccessful) == 0x000002, "Wrong size on BP_LatentAction_LoadGame_C_GetIsSuccessful");
static_assert(offsetof(BP_LatentAction_LoadGame_C_GetIsSuccessful, ReturnValue) == 0x000000, "Member 'BP_LatentAction_LoadGame_C_GetIsSuccessful::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LatentAction_LoadGame_C_GetIsSuccessful, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000001, "Member 'BP_LatentAction_LoadGame_C_GetIsSuccessful::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function BP_LatentAction_LoadGame.BP_LatentAction_LoadGame_C.GetStatus
// 0x0001 (0x0001 - 0x0000)
struct BP_LatentAction_LoadGame_C_GetStatus final
{
public:
	E_SaveManagerLoadingStatus                    ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LatentAction_LoadGame_C_GetStatus) == 0x000001, "Wrong alignment on BP_LatentAction_LoadGame_C_GetStatus");
static_assert(sizeof(BP_LatentAction_LoadGame_C_GetStatus) == 0x000001, "Wrong size on BP_LatentAction_LoadGame_C_GetStatus");
static_assert(offsetof(BP_LatentAction_LoadGame_C_GetStatus, ReturnValue) == 0x000000, "Member 'BP_LatentAction_LoadGame_C_GetStatus::ReturnValue' has a wrong offset!");

// Function BP_LatentAction_LoadGame.BP_LatentAction_LoadGame_C.SetStatus
// 0x0001 (0x0001 - 0x0000)
struct BP_LatentAction_LoadGame_C_SetStatus final
{
public:
	E_SaveManagerLoadingStatus                    Status;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LatentAction_LoadGame_C_SetStatus) == 0x000001, "Wrong alignment on BP_LatentAction_LoadGame_C_SetStatus");
static_assert(sizeof(BP_LatentAction_LoadGame_C_SetStatus) == 0x000001, "Wrong size on BP_LatentAction_LoadGame_C_SetStatus");
static_assert(offsetof(BP_LatentAction_LoadGame_C_SetStatus, Status) == 0x000000, "Member 'BP_LatentAction_LoadGame_C_SetStatus::Status' has a wrong offset!");

}

