#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_LatentAction_WaitForGameflowTransitionFadeOut

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_LatentAction_WaitForGameflowTransitionFadeOut.BP_LatentAction_WaitForGameflowTransitionFadeOut_C.ExecuteUbergraph_BP_LatentAction_WaitForGameflowTransitionFadeOut
// 0x0028 (0x0028 - 0x0000)
struct BP_LatentAction_WaitForGameflowTransitionFadeOut_C_ExecuteUbergraph_BP_LatentAction_WaitForGameflowTransitionFadeOut final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_GameFlowTransitionSystem_C*         CallFunc_GetGameFlowTransitionSystem_GameFlowTransitionSystem; // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsTransitionStateValid_ReturnValue;       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LatentAction_WaitForGameflowTransitionFadeOut_C_ExecuteUbergraph_BP_LatentAction_WaitForGameflowTransitionFadeOut) == 0x000008, "Wrong alignment on BP_LatentAction_WaitForGameflowTransitionFadeOut_C_ExecuteUbergraph_BP_LatentAction_WaitForGameflowTransitionFadeOut");
static_assert(sizeof(BP_LatentAction_WaitForGameflowTransitionFadeOut_C_ExecuteUbergraph_BP_LatentAction_WaitForGameflowTransitionFadeOut) == 0x000028, "Wrong size on BP_LatentAction_WaitForGameflowTransitionFadeOut_C_ExecuteUbergraph_BP_LatentAction_WaitForGameflowTransitionFadeOut");
static_assert(offsetof(BP_LatentAction_WaitForGameflowTransitionFadeOut_C_ExecuteUbergraph_BP_LatentAction_WaitForGameflowTransitionFadeOut, EntryPoint) == 0x000000, "Member 'BP_LatentAction_WaitForGameflowTransitionFadeOut_C_ExecuteUbergraph_BP_LatentAction_WaitForGameflowTransitionFadeOut::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_LatentAction_WaitForGameflowTransitionFadeOut_C_ExecuteUbergraph_BP_LatentAction_WaitForGameflowTransitionFadeOut, CallFunc_GetGameFlowTransitionSystem_GameFlowTransitionSystem) == 0x000008, "Member 'BP_LatentAction_WaitForGameflowTransitionFadeOut_C_ExecuteUbergraph_BP_LatentAction_WaitForGameflowTransitionFadeOut::CallFunc_GetGameFlowTransitionSystem_GameFlowTransitionSystem' has a wrong offset!");
static_assert(offsetof(BP_LatentAction_WaitForGameflowTransitionFadeOut_C_ExecuteUbergraph_BP_LatentAction_WaitForGameflowTransitionFadeOut, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'BP_LatentAction_WaitForGameflowTransitionFadeOut_C_ExecuteUbergraph_BP_LatentAction_WaitForGameflowTransitionFadeOut::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_LatentAction_WaitForGameflowTransitionFadeOut_C_ExecuteUbergraph_BP_LatentAction_WaitForGameflowTransitionFadeOut, CallFunc_IsTransitionStateValid_ReturnValue) == 0x000020, "Member 'BP_LatentAction_WaitForGameflowTransitionFadeOut_C_ExecuteUbergraph_BP_LatentAction_WaitForGameflowTransitionFadeOut::CallFunc_IsTransitionStateValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LatentAction_WaitForGameflowTransitionFadeOut_C_ExecuteUbergraph_BP_LatentAction_WaitForGameflowTransitionFadeOut, CallFunc_Not_PreBool_ReturnValue) == 0x000021, "Member 'BP_LatentAction_WaitForGameflowTransitionFadeOut_C_ExecuteUbergraph_BP_LatentAction_WaitForGameflowTransitionFadeOut::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function BP_LatentAction_WaitForGameflowTransitionFadeOut.BP_LatentAction_WaitForGameflowTransitionFadeOut_C.OnFadeOutCompleted
// 0x0018 (0x0018 - 0x0000)
struct BP_LatentAction_WaitForGameflowTransitionFadeOut_C_OnFadeOutCompleted final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_GameFlowTransitionSystem_C*         CallFunc_GetGameFlowTransitionSystem_GameFlowTransitionSystem; // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LatentAction_WaitForGameflowTransitionFadeOut_C_OnFadeOutCompleted) == 0x000008, "Wrong alignment on BP_LatentAction_WaitForGameflowTransitionFadeOut_C_OnFadeOutCompleted");
static_assert(sizeof(BP_LatentAction_WaitForGameflowTransitionFadeOut_C_OnFadeOutCompleted) == 0x000018, "Wrong size on BP_LatentAction_WaitForGameflowTransitionFadeOut_C_OnFadeOutCompleted");
static_assert(offsetof(BP_LatentAction_WaitForGameflowTransitionFadeOut_C_OnFadeOutCompleted, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'BP_LatentAction_WaitForGameflowTransitionFadeOut_C_OnFadeOutCompleted::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_LatentAction_WaitForGameflowTransitionFadeOut_C_OnFadeOutCompleted, CallFunc_GetGameFlowTransitionSystem_GameFlowTransitionSystem) == 0x000010, "Member 'BP_LatentAction_WaitForGameflowTransitionFadeOut_C_OnFadeOutCompleted::CallFunc_GetGameFlowTransitionSystem_GameFlowTransitionSystem' has a wrong offset!");

}

