#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_LevelAmbienceArea

#include "Basic.hpp"

#include "BP_CustomShapeExtruder_classes.hpp"
#include "Engine_structs.hpp"
#include "S_AreaAudioParameters_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_LevelAmbienceArea.BP_LevelAmbienceArea_C
// 0x0080 (0x0338 - 0x02B8)
class ABP_LevelAmbienceArea_C final : public ABP_CustomShapeExtruder_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TSoftObjectPtr<class ABP_LightingScenarioReference_C> LightingScenario;                          // 0x02C0(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FS_AreaAudioParameters                 AreaAudioParameters;                               // 0x02E8(0x0038)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	TArray<EMovementMode>                         IncompatibleMovementModes;                         // 0x0320(0x0010)(Edit, BlueprintVisible)
	int32                                         Priority;                                          // 0x0330(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__BP_WorldMapArea_TriggerDynamicMesh_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void BndEvt__BP_WorldMapArea_TriggerDynamicMesh_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void ExecuteUbergraph_BP_LevelAmbienceArea(int32 EntryPoint);
	class UBP_LevelAmbienceAreaManager_C* GetLevelAmbienceAreaManager();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_LevelAmbienceArea_C">();
	}
	static class ABP_LevelAmbienceArea_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_LevelAmbienceArea_C>();
	}
};
static_assert(alignof(ABP_LevelAmbienceArea_C) == 0x000008, "Wrong alignment on ABP_LevelAmbienceArea_C");
static_assert(sizeof(ABP_LevelAmbienceArea_C) == 0x000338, "Wrong size on ABP_LevelAmbienceArea_C");
static_assert(offsetof(ABP_LevelAmbienceArea_C, UberGraphFrame) == 0x0002B8, "Member 'ABP_LevelAmbienceArea_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_LevelAmbienceArea_C, LightingScenario) == 0x0002C0, "Member 'ABP_LevelAmbienceArea_C::LightingScenario' has a wrong offset!");
static_assert(offsetof(ABP_LevelAmbienceArea_C, AreaAudioParameters) == 0x0002E8, "Member 'ABP_LevelAmbienceArea_C::AreaAudioParameters' has a wrong offset!");
static_assert(offsetof(ABP_LevelAmbienceArea_C, IncompatibleMovementModes) == 0x000320, "Member 'ABP_LevelAmbienceArea_C::IncompatibleMovementModes' has a wrong offset!");
static_assert(offsetof(ABP_LevelAmbienceArea_C, Priority) == 0x000330, "Member 'ABP_LevelAmbienceArea_C::Priority' has a wrong offset!");

}

