#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_LoadClassAssetRequest

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_LoadClassAssetRequest.BP_LoadClassAssetRequest_C.ExecuteUbergraph_BP_LoadClassAssetRequest
// 0x0030 (0x0030 - 0x0000)
struct BP_LoadClassAssetRequest_C_ExecuteUbergraph_BP_LoadClassAssetRequest final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 Temp_class_Variable;                               // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSubclassOf<class UObject>                    K2Node_CustomEvent_Loaded;                         // 0x0010(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftClassReference_ReturnValue;    // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(TSubclassOf<class UObject> Loaded)> K2Node_CreateDelegate_OutputDelegate;         // 0x001C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LoadClassAssetRequest_C_ExecuteUbergraph_BP_LoadClassAssetRequest) == 0x000008, "Wrong alignment on BP_LoadClassAssetRequest_C_ExecuteUbergraph_BP_LoadClassAssetRequest");
static_assert(sizeof(BP_LoadClassAssetRequest_C_ExecuteUbergraph_BP_LoadClassAssetRequest) == 0x000030, "Wrong size on BP_LoadClassAssetRequest_C_ExecuteUbergraph_BP_LoadClassAssetRequest");
static_assert(offsetof(BP_LoadClassAssetRequest_C_ExecuteUbergraph_BP_LoadClassAssetRequest, EntryPoint) == 0x000000, "Member 'BP_LoadClassAssetRequest_C_ExecuteUbergraph_BP_LoadClassAssetRequest::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_LoadClassAssetRequest_C_ExecuteUbergraph_BP_LoadClassAssetRequest, Temp_class_Variable) == 0x000008, "Member 'BP_LoadClassAssetRequest_C_ExecuteUbergraph_BP_LoadClassAssetRequest::Temp_class_Variable' has a wrong offset!");
static_assert(offsetof(BP_LoadClassAssetRequest_C_ExecuteUbergraph_BP_LoadClassAssetRequest, K2Node_CustomEvent_Loaded) == 0x000010, "Member 'BP_LoadClassAssetRequest_C_ExecuteUbergraph_BP_LoadClassAssetRequest::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(BP_LoadClassAssetRequest_C_ExecuteUbergraph_BP_LoadClassAssetRequest, CallFunc_IsValidSoftClassReference_ReturnValue) == 0x000018, "Member 'BP_LoadClassAssetRequest_C_ExecuteUbergraph_BP_LoadClassAssetRequest::CallFunc_IsValidSoftClassReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LoadClassAssetRequest_C_ExecuteUbergraph_BP_LoadClassAssetRequest, K2Node_CreateDelegate_OutputDelegate) == 0x00001C, "Member 'BP_LoadClassAssetRequest_C_ExecuteUbergraph_BP_LoadClassAssetRequest::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function BP_LoadClassAssetRequest.BP_LoadClassAssetRequest_C.GetLoadedClass
// 0x0008 (0x0008 - 0x0000)
struct BP_LoadClassAssetRequest_C_GetLoadedClass final
{
public:
	class UClass*                                 LoadedClass_0;                                     // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LoadClassAssetRequest_C_GetLoadedClass) == 0x000008, "Wrong alignment on BP_LoadClassAssetRequest_C_GetLoadedClass");
static_assert(sizeof(BP_LoadClassAssetRequest_C_GetLoadedClass) == 0x000008, "Wrong size on BP_LoadClassAssetRequest_C_GetLoadedClass");
static_assert(offsetof(BP_LoadClassAssetRequest_C_GetLoadedClass, LoadedClass_0) == 0x000000, "Member 'BP_LoadClassAssetRequest_C_GetLoadedClass::LoadedClass_0' has a wrong offset!");

// Function BP_LoadClassAssetRequest.BP_LoadClassAssetRequest_C.OnLoaded_24BB3CF04E742C1F02C996922FF9C0CF
// 0x0008 (0x0008 - 0x0000)
struct BP_LoadClassAssetRequest_C_OnLoaded_24BB3CF04E742C1F02C996922FF9C0CF final
{
public:
	TSubclassOf<class UObject>                    Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(BP_LoadClassAssetRequest_C_OnLoaded_24BB3CF04E742C1F02C996922FF9C0CF) == 0x000008, "Wrong alignment on BP_LoadClassAssetRequest_C_OnLoaded_24BB3CF04E742C1F02C996922FF9C0CF");
static_assert(sizeof(BP_LoadClassAssetRequest_C_OnLoaded_24BB3CF04E742C1F02C996922FF9C0CF) == 0x000008, "Wrong size on BP_LoadClassAssetRequest_C_OnLoaded_24BB3CF04E742C1F02C996922FF9C0CF");
static_assert(offsetof(BP_LoadClassAssetRequest_C_OnLoaded_24BB3CF04E742C1F02C996922FF9C0CF, Loaded) == 0x000000, "Member 'BP_LoadClassAssetRequest_C_OnLoaded_24BB3CF04E742C1F02C996922FF9C0CF::Loaded' has a wrong offset!");

}

