#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_LastStandSystem

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_LastStandSystem.BP_LastStandSystem_C.ExecuteUbergraph_BP_LastStandSystem
// 0x0168 (0x0168 - 0x0000)
struct BP_LastStandSystem_C_ExecuteUbergraph_BP_LastStandSystem final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_jRPG_Character_Battle_Base_C*       K2Node_CustomEvent_CharacterBattle;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_ObjectToText_ReturnValue;            // 0x0010(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0020(0x0048)(HasGetValueTypeHash)
	class UBP_LastStandRequest_C*                 CallFunc_Array_Get_Item;                           // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0070(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Format_ReturnValue;                       // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0092(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsNotEmpty_ReturnValue;             // 0x0093(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_95[0x3];                                       // 0x0095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_BoolToText_ReturnValue;              // 0x0098(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00A8(0x0048)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F4[0x4];                                       // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0100(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0148(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Format_ReturnValue_1;                     // 0x0158(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LastStandSystem_C_ExecuteUbergraph_BP_LastStandSystem) == 0x000008, "Wrong alignment on BP_LastStandSystem_C_ExecuteUbergraph_BP_LastStandSystem");
static_assert(sizeof(BP_LastStandSystem_C_ExecuteUbergraph_BP_LastStandSystem) == 0x000168, "Wrong size on BP_LastStandSystem_C_ExecuteUbergraph_BP_LastStandSystem");
static_assert(offsetof(BP_LastStandSystem_C_ExecuteUbergraph_BP_LastStandSystem, EntryPoint) == 0x000000, "Member 'BP_LastStandSystem_C_ExecuteUbergraph_BP_LastStandSystem::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_LastStandSystem_C_ExecuteUbergraph_BP_LastStandSystem, K2Node_CustomEvent_CharacterBattle) == 0x000008, "Member 'BP_LastStandSystem_C_ExecuteUbergraph_BP_LastStandSystem::K2Node_CustomEvent_CharacterBattle' has a wrong offset!");
static_assert(offsetof(BP_LastStandSystem_C_ExecuteUbergraph_BP_LastStandSystem, CallFunc_Conv_ObjectToText_ReturnValue) == 0x000010, "Member 'BP_LastStandSystem_C_ExecuteUbergraph_BP_LastStandSystem::CallFunc_Conv_ObjectToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LastStandSystem_C_ExecuteUbergraph_BP_LastStandSystem, K2Node_MakeStruct_FormatArgumentData) == 0x000020, "Member 'BP_LastStandSystem_C_ExecuteUbergraph_BP_LastStandSystem::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_LastStandSystem_C_ExecuteUbergraph_BP_LastStandSystem, CallFunc_Array_Get_Item) == 0x000068, "Member 'BP_LastStandSystem_C_ExecuteUbergraph_BP_LastStandSystem::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_LastStandSystem_C_ExecuteUbergraph_BP_LastStandSystem, K2Node_MakeArray_Array) == 0x000070, "Member 'BP_LastStandSystem_C_ExecuteUbergraph_BP_LastStandSystem::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_LastStandSystem_C_ExecuteUbergraph_BP_LastStandSystem, CallFunc_Format_ReturnValue) == 0x000080, "Member 'BP_LastStandSystem_C_ExecuteUbergraph_BP_LastStandSystem::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LastStandSystem_C_ExecuteUbergraph_BP_LastStandSystem, CallFunc_IsValid_ReturnValue) == 0x000090, "Member 'BP_LastStandSystem_C_ExecuteUbergraph_BP_LastStandSystem::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LastStandSystem_C_ExecuteUbergraph_BP_LastStandSystem, CallFunc_Not_PreBool_ReturnValue) == 0x000091, "Member 'BP_LastStandSystem_C_ExecuteUbergraph_BP_LastStandSystem::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LastStandSystem_C_ExecuteUbergraph_BP_LastStandSystem, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000092, "Member 'BP_LastStandSystem_C_ExecuteUbergraph_BP_LastStandSystem::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LastStandSystem_C_ExecuteUbergraph_BP_LastStandSystem, CallFunc_Array_IsNotEmpty_ReturnValue) == 0x000093, "Member 'BP_LastStandSystem_C_ExecuteUbergraph_BP_LastStandSystem::CallFunc_Array_IsNotEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LastStandSystem_C_ExecuteUbergraph_BP_LastStandSystem, CallFunc_IsValid_ReturnValue_1) == 0x000094, "Member 'BP_LastStandSystem_C_ExecuteUbergraph_BP_LastStandSystem::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LastStandSystem_C_ExecuteUbergraph_BP_LastStandSystem, CallFunc_Conv_BoolToText_ReturnValue) == 0x000098, "Member 'BP_LastStandSystem_C_ExecuteUbergraph_BP_LastStandSystem::CallFunc_Conv_BoolToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LastStandSystem_C_ExecuteUbergraph_BP_LastStandSystem, K2Node_MakeStruct_FormatArgumentData_1) == 0x0000A8, "Member 'BP_LastStandSystem_C_ExecuteUbergraph_BP_LastStandSystem::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BP_LastStandSystem_C_ExecuteUbergraph_BP_LastStandSystem, CallFunc_Array_Length_ReturnValue) == 0x0000F0, "Member 'BP_LastStandSystem_C_ExecuteUbergraph_BP_LastStandSystem::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LastStandSystem_C_ExecuteUbergraph_BP_LastStandSystem, CallFunc_Conv_IntToInt64_ReturnValue) == 0x0000F8, "Member 'BP_LastStandSystem_C_ExecuteUbergraph_BP_LastStandSystem::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LastStandSystem_C_ExecuteUbergraph_BP_LastStandSystem, K2Node_MakeStruct_FormatArgumentData_2) == 0x000100, "Member 'BP_LastStandSystem_C_ExecuteUbergraph_BP_LastStandSystem::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(BP_LastStandSystem_C_ExecuteUbergraph_BP_LastStandSystem, K2Node_MakeArray_Array_1) == 0x000148, "Member 'BP_LastStandSystem_C_ExecuteUbergraph_BP_LastStandSystem::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BP_LastStandSystem_C_ExecuteUbergraph_BP_LastStandSystem, CallFunc_Format_ReturnValue_1) == 0x000158, "Member 'BP_LastStandSystem_C_ExecuteUbergraph_BP_LastStandSystem::CallFunc_Format_ReturnValue_1' has a wrong offset!");

// Function BP_LastStandSystem.BP_LastStandSystem_C.GetActiveCharacter
// 0x0010 (0x0010 - 0x0000)
struct BP_LastStandSystem_C_GetActiveCharacter final
{
public:
	class ABP_jRPG_Character_Battle_Base_C*       Character;                                         // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LastStandSystem_C_GetActiveCharacter) == 0x000008, "Wrong alignment on BP_LastStandSystem_C_GetActiveCharacter");
static_assert(sizeof(BP_LastStandSystem_C_GetActiveCharacter) == 0x000010, "Wrong size on BP_LastStandSystem_C_GetActiveCharacter");
static_assert(offsetof(BP_LastStandSystem_C_GetActiveCharacter, Character) == 0x000000, "Member 'BP_LastStandSystem_C_GetActiveCharacter::Character' has a wrong offset!");
static_assert(offsetof(BP_LastStandSystem_C_GetActiveCharacter, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'BP_LastStandSystem_C_GetActiveCharacter::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_LastStandSystem.BP_LastStandSystem_C.HasLastStandInQueue
// 0x0002 (0x0002 - 0x0000)
struct BP_LastStandSystem_C_HasLastStandInQueue final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsNotEmpty_ReturnValue;             // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LastStandSystem_C_HasLastStandInQueue) == 0x000001, "Wrong alignment on BP_LastStandSystem_C_HasLastStandInQueue");
static_assert(sizeof(BP_LastStandSystem_C_HasLastStandInQueue) == 0x000002, "Wrong size on BP_LastStandSystem_C_HasLastStandInQueue");
static_assert(offsetof(BP_LastStandSystem_C_HasLastStandInQueue, ReturnValue) == 0x000000, "Member 'BP_LastStandSystem_C_HasLastStandInQueue::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LastStandSystem_C_HasLastStandInQueue, CallFunc_Array_IsNotEmpty_ReturnValue) == 0x000001, "Member 'BP_LastStandSystem_C_HasLastStandInQueue::CallFunc_Array_IsNotEmpty_ReturnValue' has a wrong offset!");

// Function BP_LastStandSystem.BP_LastStandSystem_C.IsProcessingLastStand
// 0x0002 (0x0002 - 0x0000)
struct BP_LastStandSystem_C_IsProcessingLastStand final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LastStandSystem_C_IsProcessingLastStand) == 0x000001, "Wrong alignment on BP_LastStandSystem_C_IsProcessingLastStand");
static_assert(sizeof(BP_LastStandSystem_C_IsProcessingLastStand) == 0x000002, "Wrong size on BP_LastStandSystem_C_IsProcessingLastStand");
static_assert(offsetof(BP_LastStandSystem_C_IsProcessingLastStand, ReturnValue) == 0x000000, "Member 'BP_LastStandSystem_C_IsProcessingLastStand::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LastStandSystem_C_IsProcessingLastStand, CallFunc_IsValid_ReturnValue) == 0x000001, "Member 'BP_LastStandSystem_C_IsProcessingLastStand::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_LastStandSystem.BP_LastStandSystem_C.OnLastStandProcessFinished
// 0x0008 (0x0008 - 0x0000)
struct BP_LastStandSystem_C_OnLastStandProcessFinished final
{
public:
	class ABP_jRPG_Character_Battle_Base_C*       CharacterBattle;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LastStandSystem_C_OnLastStandProcessFinished) == 0x000008, "Wrong alignment on BP_LastStandSystem_C_OnLastStandProcessFinished");
static_assert(sizeof(BP_LastStandSystem_C_OnLastStandProcessFinished) == 0x000008, "Wrong size on BP_LastStandSystem_C_OnLastStandProcessFinished");
static_assert(offsetof(BP_LastStandSystem_C_OnLastStandProcessFinished, CharacterBattle) == 0x000000, "Member 'BP_LastStandSystem_C_OnLastStandProcessFinished::CharacterBattle' has a wrong offset!");

// Function BP_LastStandSystem.BP_LastStandSystem_C.TryAddCharacterForLastStand
// 0x0020 (0x0020 - 0x0000)
struct BP_LastStandSystem_C_TryAddCharacterForLastStand final
{
public:
	const class ABP_jRPG_Character_Battle_Base_C* CharacterBattle;                                   // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	bool                                          HasLastStand;                                      // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_LastStandRequest_C*                 CallFunc_SpawnObject_ReturnValue;                  // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LastStandSystem_C_TryAddCharacterForLastStand) == 0x000008, "Wrong alignment on BP_LastStandSystem_C_TryAddCharacterForLastStand");
static_assert(sizeof(BP_LastStandSystem_C_TryAddCharacterForLastStand) == 0x000020, "Wrong size on BP_LastStandSystem_C_TryAddCharacterForLastStand");
static_assert(offsetof(BP_LastStandSystem_C_TryAddCharacterForLastStand, CharacterBattle) == 0x000000, "Member 'BP_LastStandSystem_C_TryAddCharacterForLastStand::CharacterBattle' has a wrong offset!");
static_assert(offsetof(BP_LastStandSystem_C_TryAddCharacterForLastStand, HasLastStand) == 0x000008, "Member 'BP_LastStandSystem_C_TryAddCharacterForLastStand::HasLastStand' has a wrong offset!");
static_assert(offsetof(BP_LastStandSystem_C_TryAddCharacterForLastStand, CallFunc_SpawnObject_ReturnValue) == 0x000010, "Member 'BP_LastStandSystem_C_TryAddCharacterForLastStand::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LastStandSystem_C_TryAddCharacterForLastStand, CallFunc_Array_Add_ReturnValue) == 0x000018, "Member 'BP_LastStandSystem_C_TryAddCharacterForLastStand::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

}

