#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_LighingScenarioMain_DONOTTOUCH

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_LighingScenarioMain_DONOTTOUCH.BP_LighingScenarioMain_DONOTTOUCH_C.Are Sky Light Settings Valid
// 0x0048 (0x0048 - 0x0000)
struct BP_LighingScenarioMain_DONOTTOUCH_C_Are_Sky_Light_Settings_Valid final
{
public:
	class ABP_LightingScenarioReference_C*        LightScenario;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          IsValid;                                           // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASkyLight*                              K2Node_DynamicCast_AsSky_Light;                    // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LighingScenarioMain_DONOTTOUCH_C_Are_Sky_Light_Settings_Valid) == 0x000008, "Wrong alignment on BP_LighingScenarioMain_DONOTTOUCH_C_Are_Sky_Light_Settings_Valid");
static_assert(sizeof(BP_LighingScenarioMain_DONOTTOUCH_C_Are_Sky_Light_Settings_Valid) == 0x000048, "Wrong size on BP_LighingScenarioMain_DONOTTOUCH_C_Are_Sky_Light_Settings_Valid");
static_assert(offsetof(BP_LighingScenarioMain_DONOTTOUCH_C_Are_Sky_Light_Settings_Valid, LightScenario) == 0x000000, "Member 'BP_LighingScenarioMain_DONOTTOUCH_C_Are_Sky_Light_Settings_Valid::LightScenario' has a wrong offset!");
static_assert(offsetof(BP_LighingScenarioMain_DONOTTOUCH_C_Are_Sky_Light_Settings_Valid, IsValid) == 0x000008, "Member 'BP_LighingScenarioMain_DONOTTOUCH_C_Are_Sky_Light_Settings_Valid::IsValid' has a wrong offset!");
static_assert(offsetof(BP_LighingScenarioMain_DONOTTOUCH_C_Are_Sky_Light_Settings_Valid, CallFunc_GetDisplayName_ReturnValue) == 0x000010, "Member 'BP_LighingScenarioMain_DONOTTOUCH_C_Are_Sky_Light_Settings_Valid::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LighingScenarioMain_DONOTTOUCH_C_Are_Sky_Light_Settings_Valid, CallFunc_Concat_StrStr_ReturnValue) == 0x000020, "Member 'BP_LighingScenarioMain_DONOTTOUCH_C_Are_Sky_Light_Settings_Valid::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LighingScenarioMain_DONOTTOUCH_C_Are_Sky_Light_Settings_Valid, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue) == 0x000030, "Member 'BP_LighingScenarioMain_DONOTTOUCH_C_Are_Sky_Light_Settings_Valid::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LighingScenarioMain_DONOTTOUCH_C_Are_Sky_Light_Settings_Valid, K2Node_DynamicCast_AsSky_Light) == 0x000038, "Member 'BP_LighingScenarioMain_DONOTTOUCH_C_Are_Sky_Light_Settings_Valid::K2Node_DynamicCast_AsSky_Light' has a wrong offset!");
static_assert(offsetof(BP_LighingScenarioMain_DONOTTOUCH_C_Are_Sky_Light_Settings_Valid, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'BP_LighingScenarioMain_DONOTTOUCH_C_Are_Sky_Light_Settings_Valid::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_LighingScenarioMain_DONOTTOUCH_C_Are_Sky_Light_Settings_Valid, CallFunc_IsValid_ReturnValue) == 0x000041, "Member 'BP_LighingScenarioMain_DONOTTOUCH_C_Are_Sky_Light_Settings_Valid::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LighingScenarioMain_DONOTTOUCH_C_Are_Sky_Light_Settings_Valid, CallFunc_IsValid_ReturnValue_1) == 0x000042, "Member 'BP_LighingScenarioMain_DONOTTOUCH_C_Are_Sky_Light_Settings_Valid::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LighingScenarioMain_DONOTTOUCH_C_Are_Sky_Light_Settings_Valid, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000043, "Member 'BP_LighingScenarioMain_DONOTTOUCH_C_Are_Sky_Light_Settings_Valid::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LighingScenarioMain_DONOTTOUCH_C_Are_Sky_Light_Settings_Valid, CallFunc_Not_PreBool_ReturnValue) == 0x000044, "Member 'BP_LighingScenarioMain_DONOTTOUCH_C_Are_Sky_Light_Settings_Valid::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LighingScenarioMain_DONOTTOUCH_C_Are_Sky_Light_Settings_Valid, CallFunc_BooleanAND_ReturnValue) == 0x000045, "Member 'BP_LighingScenarioMain_DONOTTOUCH_C_Are_Sky_Light_Settings_Valid::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BP_LighingScenarioMain_DONOTTOUCH.BP_LighingScenarioMain_DONOTTOUCH_C.BlendDirectionalLight
// 0x0250 (0x0250 - 0x0000)
struct BP_LighingScenarioMain_DONOTTOUCH_C_BlendDirectionalLight final
{
public:
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0000(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue;      // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue_1;    // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_RLerp_ReturnValue;                        // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult;       // 0x0060(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x0158(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_LighingScenarioMain_DONOTTOUCH_C_BlendDirectionalLight) == 0x000008, "Wrong alignment on BP_LighingScenarioMain_DONOTTOUCH_C_BlendDirectionalLight");
static_assert(sizeof(BP_LighingScenarioMain_DONOTTOUCH_C_BlendDirectionalLight) == 0x000250, "Wrong size on BP_LighingScenarioMain_DONOTTOUCH_C_BlendDirectionalLight");
static_assert(offsetof(BP_LighingScenarioMain_DONOTTOUCH_C_BlendDirectionalLight, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000000, "Member 'BP_LighingScenarioMain_DONOTTOUCH_C_BlendDirectionalLight::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LighingScenarioMain_DONOTTOUCH_C_BlendDirectionalLight, CallFunc_K2_GetComponentRotation_ReturnValue) == 0x000018, "Member 'BP_LighingScenarioMain_DONOTTOUCH_C_BlendDirectionalLight::CallFunc_K2_GetComponentRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LighingScenarioMain_DONOTTOUCH_C_BlendDirectionalLight, CallFunc_K2_GetComponentRotation_ReturnValue_1) == 0x000030, "Member 'BP_LighingScenarioMain_DONOTTOUCH_C_BlendDirectionalLight::CallFunc_K2_GetComponentRotation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LighingScenarioMain_DONOTTOUCH_C_BlendDirectionalLight, CallFunc_RLerp_ReturnValue) == 0x000048, "Member 'BP_LighingScenarioMain_DONOTTOUCH_C_BlendDirectionalLight::CallFunc_RLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LighingScenarioMain_DONOTTOUCH_C_BlendDirectionalLight, CallFunc_K2_SetWorldRotation_SweepHitResult) == 0x000060, "Member 'BP_LighingScenarioMain_DONOTTOUCH_C_BlendDirectionalLight::CallFunc_K2_SetWorldRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_LighingScenarioMain_DONOTTOUCH_C_BlendDirectionalLight, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x000158, "Member 'BP_LighingScenarioMain_DONOTTOUCH_C_BlendDirectionalLight::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");

// Function BP_LighingScenarioMain_DONOTTOUCH.BP_LighingScenarioMain_DONOTTOUCH_C.BlendDirectionalLightMask
// 0x00A8 (0x00A8 - 0x0000)
struct BP_LighingScenarioMain_DONOTTOUCH_C_BlendDirectionalLightMask final
{
public:
	class FString                                 CallFunc_GetObjectName_ReturnValue;                // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetObjectName_ReturnValue_1;              // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_1;          // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               K2Node_DynamicCast_AsMaterial_Instance_Dynamic;    // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FClamp_ReturnValue_1;                     // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               K2Node_DynamicCast_AsMaterial_Instance_Dynamic_1;  // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               K2Node_DynamicCast_AsMaterial_Instance_Dynamic_2;  // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture*                               CallFunc_K2_GetTextureParameterValue_ReturnValue;  // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetObjectName_ReturnValue_2;              // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_2;          // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FClamp_Value_ImplicitCast;                // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FClamp_Value_ImplicitCast_1;              // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_1; // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LighingScenarioMain_DONOTTOUCH_C_BlendDirectionalLightMask) == 0x000008, "Wrong alignment on BP_LighingScenarioMain_DONOTTOUCH_C_BlendDirectionalLightMask");
static_assert(sizeof(BP_LighingScenarioMain_DONOTTOUCH_C_BlendDirectionalLightMask) == 0x0000A8, "Wrong size on BP_LighingScenarioMain_DONOTTOUCH_C_BlendDirectionalLightMask");
static_assert(offsetof(BP_LighingScenarioMain_DONOTTOUCH_C_BlendDirectionalLightMask, CallFunc_GetObjectName_ReturnValue) == 0x000000, "Member 'BP_LighingScenarioMain_DONOTTOUCH_C_BlendDirectionalLightMask::CallFunc_GetObjectName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LighingScenarioMain_DONOTTOUCH_C_BlendDirectionalLightMask, CallFunc_GetObjectName_ReturnValue_1) == 0x000010, "Member 'BP_LighingScenarioMain_DONOTTOUCH_C_BlendDirectionalLightMask::CallFunc_GetObjectName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LighingScenarioMain_DONOTTOUCH_C_BlendDirectionalLightMask, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000020, "Member 'BP_LighingScenarioMain_DONOTTOUCH_C_BlendDirectionalLightMask::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LighingScenarioMain_DONOTTOUCH_C_BlendDirectionalLightMask, CallFunc_EqualEqual_StrStr_ReturnValue_1) == 0x000021, "Member 'BP_LighingScenarioMain_DONOTTOUCH_C_BlendDirectionalLightMask::CallFunc_EqualEqual_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LighingScenarioMain_DONOTTOUCH_C_BlendDirectionalLightMask, CallFunc_FClamp_ReturnValue) == 0x000028, "Member 'BP_LighingScenarioMain_DONOTTOUCH_C_BlendDirectionalLightMask::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LighingScenarioMain_DONOTTOUCH_C_BlendDirectionalLightMask, K2Node_DynamicCast_AsMaterial_Instance_Dynamic) == 0x000030, "Member 'BP_LighingScenarioMain_DONOTTOUCH_C_BlendDirectionalLightMask::K2Node_DynamicCast_AsMaterial_Instance_Dynamic' has a wrong offset!");
static_assert(offsetof(BP_LighingScenarioMain_DONOTTOUCH_C_BlendDirectionalLightMask, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'BP_LighingScenarioMain_DONOTTOUCH_C_BlendDirectionalLightMask::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_LighingScenarioMain_DONOTTOUCH_C_BlendDirectionalLightMask, CallFunc_FClamp_ReturnValue_1) == 0x000040, "Member 'BP_LighingScenarioMain_DONOTTOUCH_C_BlendDirectionalLightMask::CallFunc_FClamp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LighingScenarioMain_DONOTTOUCH_C_BlendDirectionalLightMask, K2Node_DynamicCast_AsMaterial_Instance_Dynamic_1) == 0x000048, "Member 'BP_LighingScenarioMain_DONOTTOUCH_C_BlendDirectionalLightMask::K2Node_DynamicCast_AsMaterial_Instance_Dynamic_1' has a wrong offset!");
static_assert(offsetof(BP_LighingScenarioMain_DONOTTOUCH_C_BlendDirectionalLightMask, K2Node_DynamicCast_bSuccess_1) == 0x000050, "Member 'BP_LighingScenarioMain_DONOTTOUCH_C_BlendDirectionalLightMask::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_LighingScenarioMain_DONOTTOUCH_C_BlendDirectionalLightMask, K2Node_DynamicCast_AsMaterial_Instance_Dynamic_2) == 0x000058, "Member 'BP_LighingScenarioMain_DONOTTOUCH_C_BlendDirectionalLightMask::K2Node_DynamicCast_AsMaterial_Instance_Dynamic_2' has a wrong offset!");
static_assert(offsetof(BP_LighingScenarioMain_DONOTTOUCH_C_BlendDirectionalLightMask, K2Node_DynamicCast_bSuccess_2) == 0x000060, "Member 'BP_LighingScenarioMain_DONOTTOUCH_C_BlendDirectionalLightMask::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_LighingScenarioMain_DONOTTOUCH_C_BlendDirectionalLightMask, CallFunc_K2_GetTextureParameterValue_ReturnValue) == 0x000068, "Member 'BP_LighingScenarioMain_DONOTTOUCH_C_BlendDirectionalLightMask::CallFunc_K2_GetTextureParameterValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LighingScenarioMain_DONOTTOUCH_C_BlendDirectionalLightMask, CallFunc_GetObjectName_ReturnValue_2) == 0x000070, "Member 'BP_LighingScenarioMain_DONOTTOUCH_C_BlendDirectionalLightMask::CallFunc_GetObjectName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_LighingScenarioMain_DONOTTOUCH_C_BlendDirectionalLightMask, CallFunc_EqualEqual_StrStr_ReturnValue_2) == 0x000080, "Member 'BP_LighingScenarioMain_DONOTTOUCH_C_BlendDirectionalLightMask::CallFunc_EqualEqual_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_LighingScenarioMain_DONOTTOUCH_C_BlendDirectionalLightMask, CallFunc_FClamp_Value_ImplicitCast) == 0x000088, "Member 'BP_LighingScenarioMain_DONOTTOUCH_C_BlendDirectionalLightMask::CallFunc_FClamp_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_LighingScenarioMain_DONOTTOUCH_C_BlendDirectionalLightMask, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000090, "Member 'BP_LighingScenarioMain_DONOTTOUCH_C_BlendDirectionalLightMask::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_LighingScenarioMain_DONOTTOUCH_C_BlendDirectionalLightMask, CallFunc_FClamp_Value_ImplicitCast_1) == 0x000098, "Member 'BP_LighingScenarioMain_DONOTTOUCH_C_BlendDirectionalLightMask::CallFunc_FClamp_Value_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_LighingScenarioMain_DONOTTOUCH_C_BlendDirectionalLightMask, CallFunc_SetScalarParameterValue_Value_ImplicitCast_1) == 0x0000A0, "Member 'BP_LighingScenarioMain_DONOTTOUCH_C_BlendDirectionalLightMask::CallFunc_SetScalarParameterValue_Value_ImplicitCast_1' has a wrong offset!");

// Function BP_LighingScenarioMain_DONOTTOUCH.BP_LighingScenarioMain_DONOTTOUCH_C.BlendFog
// 0x0220 (0x0220 - 0x0000)
struct BP_LighingScenarioMain_DONOTTOUCH_C_BlendFog final
{
public:
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0000(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue_1;     // 0x0060(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_TLerp_ReturnValue;                        // 0x00C0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldTransform_SweepHitResult;      // 0x0120(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_LighingScenarioMain_DONOTTOUCH_C_BlendFog) == 0x000010, "Wrong alignment on BP_LighingScenarioMain_DONOTTOUCH_C_BlendFog");
static_assert(sizeof(BP_LighingScenarioMain_DONOTTOUCH_C_BlendFog) == 0x000220, "Wrong size on BP_LighingScenarioMain_DONOTTOUCH_C_BlendFog");
static_assert(offsetof(BP_LighingScenarioMain_DONOTTOUCH_C_BlendFog, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x000000, "Member 'BP_LighingScenarioMain_DONOTTOUCH_C_BlendFog::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LighingScenarioMain_DONOTTOUCH_C_BlendFog, CallFunc_K2_GetComponentToWorld_ReturnValue_1) == 0x000060, "Member 'BP_LighingScenarioMain_DONOTTOUCH_C_BlendFog::CallFunc_K2_GetComponentToWorld_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LighingScenarioMain_DONOTTOUCH_C_BlendFog, CallFunc_TLerp_ReturnValue) == 0x0000C0, "Member 'BP_LighingScenarioMain_DONOTTOUCH_C_BlendFog::CallFunc_TLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LighingScenarioMain_DONOTTOUCH_C_BlendFog, CallFunc_K2_SetWorldTransform_SweepHitResult) == 0x000120, "Member 'BP_LighingScenarioMain_DONOTTOUCH_C_BlendFog::CallFunc_K2_SetWorldTransform_SweepHitResult' has a wrong offset!");

// Function BP_LighingScenarioMain_DONOTTOUCH.BP_LighingScenarioMain_DONOTTOUCH_C.BlendSkyAtmosphere
// 0x0220 (0x0220 - 0x0000)
struct BP_LighingScenarioMain_DONOTTOUCH_C_BlendSkyAtmosphere final
{
public:
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0000(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue_1;     // 0x0060(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_TLerp_ReturnValue;                        // 0x00C0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldTransform_SweepHitResult;      // 0x0120(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_LighingScenarioMain_DONOTTOUCH_C_BlendSkyAtmosphere) == 0x000010, "Wrong alignment on BP_LighingScenarioMain_DONOTTOUCH_C_BlendSkyAtmosphere");
static_assert(sizeof(BP_LighingScenarioMain_DONOTTOUCH_C_BlendSkyAtmosphere) == 0x000220, "Wrong size on BP_LighingScenarioMain_DONOTTOUCH_C_BlendSkyAtmosphere");
static_assert(offsetof(BP_LighingScenarioMain_DONOTTOUCH_C_BlendSkyAtmosphere, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x000000, "Member 'BP_LighingScenarioMain_DONOTTOUCH_C_BlendSkyAtmosphere::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LighingScenarioMain_DONOTTOUCH_C_BlendSkyAtmosphere, CallFunc_K2_GetComponentToWorld_ReturnValue_1) == 0x000060, "Member 'BP_LighingScenarioMain_DONOTTOUCH_C_BlendSkyAtmosphere::CallFunc_K2_GetComponentToWorld_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LighingScenarioMain_DONOTTOUCH_C_BlendSkyAtmosphere, CallFunc_TLerp_ReturnValue) == 0x0000C0, "Member 'BP_LighingScenarioMain_DONOTTOUCH_C_BlendSkyAtmosphere::CallFunc_TLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LighingScenarioMain_DONOTTOUCH_C_BlendSkyAtmosphere, CallFunc_K2_SetWorldTransform_SweepHitResult) == 0x000120, "Member 'BP_LighingScenarioMain_DONOTTOUCH_C_BlendSkyAtmosphere::CallFunc_K2_SetWorldTransform_SweepHitResult' has a wrong offset!");

// Function BP_LighingScenarioMain_DONOTTOUCH.BP_LighingScenarioMain_DONOTTOUCH_C.BreakLightingScenarioInComponents
// 0x0098 (0x0098 - 0x0000)
struct BP_LighingScenarioMain_DONOTTOUCH_C_BreakLightingScenarioInComponents final
{
public:
	class ABP_LightingScenarioReference_C*        LightingScenario;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UDirectionalLightComponent*             DirectionalLightComponent;                         // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UExponentialHeightFogComponent*         ExponentialFogComponent;                           // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USkyLightComponent*                     SkyLightComponent;                                 // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USkyAtmosphereComponent*                SkyAtmosphereComponent;                            // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_1; // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ADirectionalLight*                      K2Node_DynamicCast_AsDirectional_Light;            // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASkyAtmosphere*                         K2Node_DynamicCast_AsSky_Atmosphere;               // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDirectionalLightComponent*             K2Node_DynamicCast_AsDirectional_Light_Component;  // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_2; // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_3; // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASkyLight*                              K2Node_DynamicCast_AsSky_Light;                    // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AExponentialHeightFog*                  K2Node_DynamicCast_AsExponential_Height_Fog;       // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LighingScenarioMain_DONOTTOUCH_C_BreakLightingScenarioInComponents) == 0x000008, "Wrong alignment on BP_LighingScenarioMain_DONOTTOUCH_C_BreakLightingScenarioInComponents");
static_assert(sizeof(BP_LighingScenarioMain_DONOTTOUCH_C_BreakLightingScenarioInComponents) == 0x000098, "Wrong size on BP_LighingScenarioMain_DONOTTOUCH_C_BreakLightingScenarioInComponents");
static_assert(offsetof(BP_LighingScenarioMain_DONOTTOUCH_C_BreakLightingScenarioInComponents, LightingScenario) == 0x000000, "Member 'BP_LighingScenarioMain_DONOTTOUCH_C_BreakLightingScenarioInComponents::LightingScenario' has a wrong offset!");
static_assert(offsetof(BP_LighingScenarioMain_DONOTTOUCH_C_BreakLightingScenarioInComponents, DirectionalLightComponent) == 0x000008, "Member 'BP_LighingScenarioMain_DONOTTOUCH_C_BreakLightingScenarioInComponents::DirectionalLightComponent' has a wrong offset!");
static_assert(offsetof(BP_LighingScenarioMain_DONOTTOUCH_C_BreakLightingScenarioInComponents, ExponentialFogComponent) == 0x000010, "Member 'BP_LighingScenarioMain_DONOTTOUCH_C_BreakLightingScenarioInComponents::ExponentialFogComponent' has a wrong offset!");
static_assert(offsetof(BP_LighingScenarioMain_DONOTTOUCH_C_BreakLightingScenarioInComponents, SkyLightComponent) == 0x000018, "Member 'BP_LighingScenarioMain_DONOTTOUCH_C_BreakLightingScenarioInComponents::SkyLightComponent' has a wrong offset!");
static_assert(offsetof(BP_LighingScenarioMain_DONOTTOUCH_C_BreakLightingScenarioInComponents, SkyAtmosphereComponent) == 0x000020, "Member 'BP_LighingScenarioMain_DONOTTOUCH_C_BreakLightingScenarioInComponents::SkyAtmosphereComponent' has a wrong offset!");
static_assert(offsetof(BP_LighingScenarioMain_DONOTTOUCH_C_BreakLightingScenarioInComponents, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue) == 0x000028, "Member 'BP_LighingScenarioMain_DONOTTOUCH_C_BreakLightingScenarioInComponents::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LighingScenarioMain_DONOTTOUCH_C_BreakLightingScenarioInComponents, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_1) == 0x000030, "Member 'BP_LighingScenarioMain_DONOTTOUCH_C_BreakLightingScenarioInComponents::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LighingScenarioMain_DONOTTOUCH_C_BreakLightingScenarioInComponents, K2Node_DynamicCast_AsDirectional_Light) == 0x000038, "Member 'BP_LighingScenarioMain_DONOTTOUCH_C_BreakLightingScenarioInComponents::K2Node_DynamicCast_AsDirectional_Light' has a wrong offset!");
static_assert(offsetof(BP_LighingScenarioMain_DONOTTOUCH_C_BreakLightingScenarioInComponents, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'BP_LighingScenarioMain_DONOTTOUCH_C_BreakLightingScenarioInComponents::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_LighingScenarioMain_DONOTTOUCH_C_BreakLightingScenarioInComponents, K2Node_DynamicCast_AsSky_Atmosphere) == 0x000048, "Member 'BP_LighingScenarioMain_DONOTTOUCH_C_BreakLightingScenarioInComponents::K2Node_DynamicCast_AsSky_Atmosphere' has a wrong offset!");
static_assert(offsetof(BP_LighingScenarioMain_DONOTTOUCH_C_BreakLightingScenarioInComponents, K2Node_DynamicCast_bSuccess_1) == 0x000050, "Member 'BP_LighingScenarioMain_DONOTTOUCH_C_BreakLightingScenarioInComponents::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_LighingScenarioMain_DONOTTOUCH_C_BreakLightingScenarioInComponents, K2Node_DynamicCast_AsDirectional_Light_Component) == 0x000058, "Member 'BP_LighingScenarioMain_DONOTTOUCH_C_BreakLightingScenarioInComponents::K2Node_DynamicCast_AsDirectional_Light_Component' has a wrong offset!");
static_assert(offsetof(BP_LighingScenarioMain_DONOTTOUCH_C_BreakLightingScenarioInComponents, K2Node_DynamicCast_bSuccess_2) == 0x000060, "Member 'BP_LighingScenarioMain_DONOTTOUCH_C_BreakLightingScenarioInComponents::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_LighingScenarioMain_DONOTTOUCH_C_BreakLightingScenarioInComponents, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_2) == 0x000068, "Member 'BP_LighingScenarioMain_DONOTTOUCH_C_BreakLightingScenarioInComponents::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_LighingScenarioMain_DONOTTOUCH_C_BreakLightingScenarioInComponents, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_3) == 0x000070, "Member 'BP_LighingScenarioMain_DONOTTOUCH_C_BreakLightingScenarioInComponents::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_LighingScenarioMain_DONOTTOUCH_C_BreakLightingScenarioInComponents, K2Node_DynamicCast_AsSky_Light) == 0x000078, "Member 'BP_LighingScenarioMain_DONOTTOUCH_C_BreakLightingScenarioInComponents::K2Node_DynamicCast_AsSky_Light' has a wrong offset!");
static_assert(offsetof(BP_LighingScenarioMain_DONOTTOUCH_C_BreakLightingScenarioInComponents, K2Node_DynamicCast_bSuccess_3) == 0x000080, "Member 'BP_LighingScenarioMain_DONOTTOUCH_C_BreakLightingScenarioInComponents::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BP_LighingScenarioMain_DONOTTOUCH_C_BreakLightingScenarioInComponents, K2Node_DynamicCast_AsExponential_Height_Fog) == 0x000088, "Member 'BP_LighingScenarioMain_DONOTTOUCH_C_BreakLightingScenarioInComponents::K2Node_DynamicCast_AsExponential_Height_Fog' has a wrong offset!");
static_assert(offsetof(BP_LighingScenarioMain_DONOTTOUCH_C_BreakLightingScenarioInComponents, K2Node_DynamicCast_bSuccess_4) == 0x000090, "Member 'BP_LighingScenarioMain_DONOTTOUCH_C_BreakLightingScenarioInComponents::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");

// Function BP_LighingScenarioMain_DONOTTOUCH.BP_LighingScenarioMain_DONOTTOUCH_C.CanChangeLigthingScenario
// 0x0010 (0x0010 - 0x0000)
struct BP_LighingScenarioMain_DONOTTOUCH_C_CanChangeLigthingScenario final
{
public:
	class ABP_LightingScenarioReference_C*        NewLightingScenario;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Are_Sky_Light_Settings_Valid_IsValid;     // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LighingScenarioMain_DONOTTOUCH_C_CanChangeLigthingScenario) == 0x000008, "Wrong alignment on BP_LighingScenarioMain_DONOTTOUCH_C_CanChangeLigthingScenario");
static_assert(sizeof(BP_LighingScenarioMain_DONOTTOUCH_C_CanChangeLigthingScenario) == 0x000010, "Wrong size on BP_LighingScenarioMain_DONOTTOUCH_C_CanChangeLigthingScenario");
static_assert(offsetof(BP_LighingScenarioMain_DONOTTOUCH_C_CanChangeLigthingScenario, NewLightingScenario) == 0x000000, "Member 'BP_LighingScenarioMain_DONOTTOUCH_C_CanChangeLigthingScenario::NewLightingScenario' has a wrong offset!");
static_assert(offsetof(BP_LighingScenarioMain_DONOTTOUCH_C_CanChangeLigthingScenario, ReturnValue) == 0x000008, "Member 'BP_LighingScenarioMain_DONOTTOUCH_C_CanChangeLigthingScenario::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LighingScenarioMain_DONOTTOUCH_C_CanChangeLigthingScenario, CallFunc_Are_Sky_Light_Settings_Valid_IsValid) == 0x000009, "Member 'BP_LighingScenarioMain_DONOTTOUCH_C_CanChangeLigthingScenario::CallFunc_Are_Sky_Light_Settings_Valid_IsValid' has a wrong offset!");
static_assert(offsetof(BP_LighingScenarioMain_DONOTTOUCH_C_CanChangeLigthingScenario, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x00000A, "Member 'BP_LighingScenarioMain_DONOTTOUCH_C_CanChangeLigthingScenario::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LighingScenarioMain_DONOTTOUCH_C_CanChangeLigthingScenario, CallFunc_IsValid_ReturnValue) == 0x00000B, "Member 'BP_LighingScenarioMain_DONOTTOUCH_C_CanChangeLigthingScenario::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LighingScenarioMain_DONOTTOUCH_C_CanChangeLigthingScenario, CallFunc_BooleanAND_ReturnValue) == 0x00000C, "Member 'BP_LighingScenarioMain_DONOTTOUCH_C_CanChangeLigthingScenario::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LighingScenarioMain_DONOTTOUCH_C_CanChangeLigthingScenario, CallFunc_BooleanAND_ReturnValue_1) == 0x00000D, "Member 'BP_LighingScenarioMain_DONOTTOUCH_C_CanChangeLigthingScenario::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");

// Function BP_LighingScenarioMain_DONOTTOUCH.BP_LighingScenarioMain_DONOTTOUCH_C.ChangeLightingToScenario
// 0x0010 (0x0010 - 0x0000)
struct BP_LighingScenarioMain_DONOTTOUCH_C_ChangeLightingToScenario final
{
public:
	class ABP_LightingScenarioReference_C*        LightingScenarioReference;                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         ChangeSpeedMultiplier;                             // 0x0008(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LighingScenarioMain_DONOTTOUCH_C_ChangeLightingToScenario) == 0x000008, "Wrong alignment on BP_LighingScenarioMain_DONOTTOUCH_C_ChangeLightingToScenario");
static_assert(sizeof(BP_LighingScenarioMain_DONOTTOUCH_C_ChangeLightingToScenario) == 0x000010, "Wrong size on BP_LighingScenarioMain_DONOTTOUCH_C_ChangeLightingToScenario");
static_assert(offsetof(BP_LighingScenarioMain_DONOTTOUCH_C_ChangeLightingToScenario, LightingScenarioReference) == 0x000000, "Member 'BP_LighingScenarioMain_DONOTTOUCH_C_ChangeLightingToScenario::LightingScenarioReference' has a wrong offset!");
static_assert(offsetof(BP_LighingScenarioMain_DONOTTOUCH_C_ChangeLightingToScenario, ChangeSpeedMultiplier) == 0x000008, "Member 'BP_LighingScenarioMain_DONOTTOUCH_C_ChangeLightingToScenario::ChangeSpeedMultiplier' has a wrong offset!");

// Function BP_LighingScenarioMain_DONOTTOUCH.BP_LighingScenarioMain_DONOTTOUCH_C.CheckForErrors
// 0x0058 (0x0058 - 0x0000)
struct BP_LighingScenarioMain_DONOTTOUCH_C_CheckForErrors final
{
public:
	TArray<class FText>                           ErrorMessages;                                     // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0018(0x0010)(ReferenceParm)
	TArray<class ABP_LighingScenarioMain_DONOTTOUCH_C*> CallFunc_GetAllActorsOfClass_OutActors;      // 0x0028(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0038(0x0010)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LighingScenarioMain_DONOTTOUCH_C_CheckForErrors) == 0x000008, "Wrong alignment on BP_LighingScenarioMain_DONOTTOUCH_C_CheckForErrors");
static_assert(sizeof(BP_LighingScenarioMain_DONOTTOUCH_C_CheckForErrors) == 0x000058, "Wrong size on BP_LighingScenarioMain_DONOTTOUCH_C_CheckForErrors");
static_assert(offsetof(BP_LighingScenarioMain_DONOTTOUCH_C_CheckForErrors, ErrorMessages) == 0x000000, "Member 'BP_LighingScenarioMain_DONOTTOUCH_C_CheckForErrors::ErrorMessages' has a wrong offset!");
static_assert(offsetof(BP_LighingScenarioMain_DONOTTOUCH_C_CheckForErrors, ReturnValue) == 0x000010, "Member 'BP_LighingScenarioMain_DONOTTOUCH_C_CheckForErrors::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LighingScenarioMain_DONOTTOUCH_C_CheckForErrors, K2Node_MakeArray_Array) == 0x000018, "Member 'BP_LighingScenarioMain_DONOTTOUCH_C_CheckForErrors::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_LighingScenarioMain_DONOTTOUCH_C_CheckForErrors, CallFunc_GetAllActorsOfClass_OutActors) == 0x000028, "Member 'BP_LighingScenarioMain_DONOTTOUCH_C_CheckForErrors::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(BP_LighingScenarioMain_DONOTTOUCH_C_CheckForErrors, CallFunc_Format_ReturnValue) == 0x000038, "Member 'BP_LighingScenarioMain_DONOTTOUCH_C_CheckForErrors::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LighingScenarioMain_DONOTTOUCH_C_CheckForErrors, CallFunc_Array_Length_ReturnValue) == 0x000048, "Member 'BP_LighingScenarioMain_DONOTTOUCH_C_CheckForErrors::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LighingScenarioMain_DONOTTOUCH_C_CheckForErrors, CallFunc_Array_Add_ReturnValue) == 0x00004C, "Member 'BP_LighingScenarioMain_DONOTTOUCH_C_CheckForErrors::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LighingScenarioMain_DONOTTOUCH_C_CheckForErrors, CallFunc_Greater_IntInt_ReturnValue) == 0x000050, "Member 'BP_LighingScenarioMain_DONOTTOUCH_C_CheckForErrors::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

// Function BP_LighingScenarioMain_DONOTTOUCH.BP_LighingScenarioMain_DONOTTOUCH_C.DEBUG_PrintLightingScenarioChange
// 0x00E0 (0x00E0 - 0x0000)
struct BP_LighingScenarioMain_DONOTTOUCH_C_DEBUG_PrintLightingScenarioChange final
{
public:
	const class UObject*                          LightingScenario;                                  // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         Speed;                                             // 0x0008(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0020(0x0048)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0068(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0078(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00C0(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Format_ReturnValue;                       // 0x00D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LighingScenarioMain_DONOTTOUCH_C_DEBUG_PrintLightingScenarioChange) == 0x000008, "Wrong alignment on BP_LighingScenarioMain_DONOTTOUCH_C_DEBUG_PrintLightingScenarioChange");
static_assert(sizeof(BP_LighingScenarioMain_DONOTTOUCH_C_DEBUG_PrintLightingScenarioChange) == 0x0000E0, "Wrong size on BP_LighingScenarioMain_DONOTTOUCH_C_DEBUG_PrintLightingScenarioChange");
static_assert(offsetof(BP_LighingScenarioMain_DONOTTOUCH_C_DEBUG_PrintLightingScenarioChange, LightingScenario) == 0x000000, "Member 'BP_LighingScenarioMain_DONOTTOUCH_C_DEBUG_PrintLightingScenarioChange::LightingScenario' has a wrong offset!");
static_assert(offsetof(BP_LighingScenarioMain_DONOTTOUCH_C_DEBUG_PrintLightingScenarioChange, Speed) == 0x000008, "Member 'BP_LighingScenarioMain_DONOTTOUCH_C_DEBUG_PrintLightingScenarioChange::Speed' has a wrong offset!");
static_assert(offsetof(BP_LighingScenarioMain_DONOTTOUCH_C_DEBUG_PrintLightingScenarioChange, CallFunc_GetDisplayName_ReturnValue) == 0x000010, "Member 'BP_LighingScenarioMain_DONOTTOUCH_C_DEBUG_PrintLightingScenarioChange::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LighingScenarioMain_DONOTTOUCH_C_DEBUG_PrintLightingScenarioChange, K2Node_MakeStruct_FormatArgumentData) == 0x000020, "Member 'BP_LighingScenarioMain_DONOTTOUCH_C_DEBUG_PrintLightingScenarioChange::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_LighingScenarioMain_DONOTTOUCH_C_DEBUG_PrintLightingScenarioChange, CallFunc_Conv_StringToText_ReturnValue) == 0x000068, "Member 'BP_LighingScenarioMain_DONOTTOUCH_C_DEBUG_PrintLightingScenarioChange::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LighingScenarioMain_DONOTTOUCH_C_DEBUG_PrintLightingScenarioChange, K2Node_MakeStruct_FormatArgumentData_1) == 0x000078, "Member 'BP_LighingScenarioMain_DONOTTOUCH_C_DEBUG_PrintLightingScenarioChange::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BP_LighingScenarioMain_DONOTTOUCH_C_DEBUG_PrintLightingScenarioChange, K2Node_MakeArray_Array) == 0x0000C0, "Member 'BP_LighingScenarioMain_DONOTTOUCH_C_DEBUG_PrintLightingScenarioChange::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_LighingScenarioMain_DONOTTOUCH_C_DEBUG_PrintLightingScenarioChange, CallFunc_Format_ReturnValue) == 0x0000D0, "Member 'BP_LighingScenarioMain_DONOTTOUCH_C_DEBUG_PrintLightingScenarioChange::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function BP_LighingScenarioMain_DONOTTOUCH.BP_LighingScenarioMain_DONOTTOUCH_C.ExecuteUbergraph_BP_LighingScenarioMain_DONOTTOUCH
// 0x0038 (0x0038 - 0x0000)
struct BP_LighingScenarioMain_DONOTTOUCH_C_ExecuteUbergraph_BP_LighingScenarioMain_DONOTTOUCH final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInPlayMode_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_jRPG_Controller_World_C*            K2Node_DynamicCast_AsBP_J_RPG_Controller_World;    // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IncrementTimerAndCompareToRate_ReturnValue; // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_LightingScenarioReference_C*        K2Node_CustomEvent_LightingScenarioReference;      // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_ChangeSpeedMultiplier;          // 0x0028(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanChangeLigthingScenario_ReturnValue;    // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LighingScenarioMain_DONOTTOUCH_C_ExecuteUbergraph_BP_LighingScenarioMain_DONOTTOUCH) == 0x000008, "Wrong alignment on BP_LighingScenarioMain_DONOTTOUCH_C_ExecuteUbergraph_BP_LighingScenarioMain_DONOTTOUCH");
static_assert(sizeof(BP_LighingScenarioMain_DONOTTOUCH_C_ExecuteUbergraph_BP_LighingScenarioMain_DONOTTOUCH) == 0x000038, "Wrong size on BP_LighingScenarioMain_DONOTTOUCH_C_ExecuteUbergraph_BP_LighingScenarioMain_DONOTTOUCH");
static_assert(offsetof(BP_LighingScenarioMain_DONOTTOUCH_C_ExecuteUbergraph_BP_LighingScenarioMain_DONOTTOUCH, EntryPoint) == 0x000000, "Member 'BP_LighingScenarioMain_DONOTTOUCH_C_ExecuteUbergraph_BP_LighingScenarioMain_DONOTTOUCH::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_LighingScenarioMain_DONOTTOUCH_C_ExecuteUbergraph_BP_LighingScenarioMain_DONOTTOUCH, CallFunc_IsInPlayMode_ReturnValue) == 0x000004, "Member 'BP_LighingScenarioMain_DONOTTOUCH_C_ExecuteUbergraph_BP_LighingScenarioMain_DONOTTOUCH::CallFunc_IsInPlayMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LighingScenarioMain_DONOTTOUCH_C_ExecuteUbergraph_BP_LighingScenarioMain_DONOTTOUCH, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'BP_LighingScenarioMain_DONOTTOUCH_C_ExecuteUbergraph_BP_LighingScenarioMain_DONOTTOUCH::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LighingScenarioMain_DONOTTOUCH_C_ExecuteUbergraph_BP_LighingScenarioMain_DONOTTOUCH, K2Node_DynamicCast_AsBP_J_RPG_Controller_World) == 0x000010, "Member 'BP_LighingScenarioMain_DONOTTOUCH_C_ExecuteUbergraph_BP_LighingScenarioMain_DONOTTOUCH::K2Node_DynamicCast_AsBP_J_RPG_Controller_World' has a wrong offset!");
static_assert(offsetof(BP_LighingScenarioMain_DONOTTOUCH_C_ExecuteUbergraph_BP_LighingScenarioMain_DONOTTOUCH, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_LighingScenarioMain_DONOTTOUCH_C_ExecuteUbergraph_BP_LighingScenarioMain_DONOTTOUCH::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_LighingScenarioMain_DONOTTOUCH_C_ExecuteUbergraph_BP_LighingScenarioMain_DONOTTOUCH, CallFunc_Not_PreBool_ReturnValue) == 0x000019, "Member 'BP_LighingScenarioMain_DONOTTOUCH_C_ExecuteUbergraph_BP_LighingScenarioMain_DONOTTOUCH::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LighingScenarioMain_DONOTTOUCH_C_ExecuteUbergraph_BP_LighingScenarioMain_DONOTTOUCH, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x00001A, "Member 'BP_LighingScenarioMain_DONOTTOUCH_C_ExecuteUbergraph_BP_LighingScenarioMain_DONOTTOUCH::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LighingScenarioMain_DONOTTOUCH_C_ExecuteUbergraph_BP_LighingScenarioMain_DONOTTOUCH, CallFunc_BooleanAND_ReturnValue) == 0x00001B, "Member 'BP_LighingScenarioMain_DONOTTOUCH_C_ExecuteUbergraph_BP_LighingScenarioMain_DONOTTOUCH::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LighingScenarioMain_DONOTTOUCH_C_ExecuteUbergraph_BP_LighingScenarioMain_DONOTTOUCH, CallFunc_IncrementTimerAndCompareToRate_ReturnValue) == 0x00001C, "Member 'BP_LighingScenarioMain_DONOTTOUCH_C_ExecuteUbergraph_BP_LighingScenarioMain_DONOTTOUCH::CallFunc_IncrementTimerAndCompareToRate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LighingScenarioMain_DONOTTOUCH_C_ExecuteUbergraph_BP_LighingScenarioMain_DONOTTOUCH, K2Node_CustomEvent_LightingScenarioReference) == 0x000020, "Member 'BP_LighingScenarioMain_DONOTTOUCH_C_ExecuteUbergraph_BP_LighingScenarioMain_DONOTTOUCH::K2Node_CustomEvent_LightingScenarioReference' has a wrong offset!");
static_assert(offsetof(BP_LighingScenarioMain_DONOTTOUCH_C_ExecuteUbergraph_BP_LighingScenarioMain_DONOTTOUCH, K2Node_CustomEvent_ChangeSpeedMultiplier) == 0x000028, "Member 'BP_LighingScenarioMain_DONOTTOUCH_C_ExecuteUbergraph_BP_LighingScenarioMain_DONOTTOUCH::K2Node_CustomEvent_ChangeSpeedMultiplier' has a wrong offset!");
static_assert(offsetof(BP_LighingScenarioMain_DONOTTOUCH_C_ExecuteUbergraph_BP_LighingScenarioMain_DONOTTOUCH, CallFunc_CanChangeLigthingScenario_ReturnValue) == 0x00002C, "Member 'BP_LighingScenarioMain_DONOTTOUCH_C_ExecuteUbergraph_BP_LighingScenarioMain_DONOTTOUCH::CallFunc_CanChangeLigthingScenario_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LighingScenarioMain_DONOTTOUCH_C_ExecuteUbergraph_BP_LighingScenarioMain_DONOTTOUCH, CallFunc_Greater_DoubleDouble_A_ImplicitCast) == 0x000030, "Member 'BP_LighingScenarioMain_DONOTTOUCH_C_ExecuteUbergraph_BP_LighingScenarioMain_DONOTTOUCH::CallFunc_Greater_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function BP_LighingScenarioMain_DONOTTOUCH.BP_LighingScenarioMain_DONOTTOUCH_C.HideAllLigthingScenariosAndSequencerActors
// 0x00E8 (0x00E8 - 0x0000)
struct BP_LighingScenarioMain_DONOTTOUCH_C_HideAllLigthingScenariosAndSequencerActors final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_4;                  // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_4;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AExponentialHeightFog*>          CallFunc_GetAllActorsOfClassWithTag_OutActors;     // 0x0040(0x0010)(ReferenceParm)
	TArray<class ASkyAtmosphere*>                 CallFunc_GetAllActorsOfClassWithTag_OutActors_1;   // 0x0050(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ASkyAtmosphere*                         CallFunc_Array_Get_Item;                           // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ASkyLight*>                      CallFunc_GetAllActorsOfClassWithTag_OutActors_2;   // 0x0078(0x0010)(ReferenceParm)
