#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_LastStandSystem

#include "Basic.hpp"

#include "SandFall_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_LastStandSystem.BP_LastStandSystem_C
// 0x0068 (0x0090 - 0x0028)
class UBP_LastStandSystem_C final : public UExtendedObject
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0028(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TArray<class ABP_jRPG_Character_Battle_Base_C*> LastStandQueue;                                  // 0x0030(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance, Deprecated)
	class ABP_jRPG_Character_Battle_Base_C*       CurrentLastStandCharacter;                         // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, Deprecated, NoDestructor, HasGetValueTypeHash)
	TArray<class UBP_LastStandRequest_C*>         LastStandRequestsQueue;                            // 0x0048(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UBP_LastStandRequest_C*                 CurrentProcessedRequest;                           // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnAllLastStandsProcessed;                          // 0x0060(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(class UAC_jRPG_CharacterBattleStats_C* CharacterStats)> OnCharacterLastStandStarted; // 0x0070(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(class UAC_jRPG_CharacterBattleStats_C* CharacterStats)> OnCharacterLastStandEnded; // 0x0080(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_BP_LastStandSystem(int32 EntryPoint);
	void GetActiveCharacter(class ABP_jRPG_Character_Battle_Base_C** Character);
	bool HasLastStandInQueue();
	bool IsProcessingLastStand();
	void OnLastStandProcessFinished(class ABP_jRPG_Character_Battle_Base_C* CharacterBattle);
	void ProcessLastStandQueue();
	void TryAddCharacterForLastStand(const class ABP_jRPG_Character_Battle_Base_C*& CharacterBattle, bool* HasLastStand);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_LastStandSystem_C">();
	}
	static class UBP_LastStandSystem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_LastStandSystem_C>();
	}
};
static_assert(alignof(UBP_LastStandSystem_C) == 0x000008, "Wrong alignment on UBP_LastStandSystem_C");
static_assert(sizeof(UBP_LastStandSystem_C) == 0x000090, "Wrong size on UBP_LastStandSystem_C");
static_assert(offsetof(UBP_LastStandSystem_C, UberGraphFrame) == 0x000028, "Member 'UBP_LastStandSystem_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_LastStandSystem_C, LastStandQueue) == 0x000030, "Member 'UBP_LastStandSystem_C::LastStandQueue' has a wrong offset!");
static_assert(offsetof(UBP_LastStandSystem_C, CurrentLastStandCharacter) == 0x000040, "Member 'UBP_LastStandSystem_C::CurrentLastStandCharacter' has a wrong offset!");
static_assert(offsetof(UBP_LastStandSystem_C, LastStandRequestsQueue) == 0x000048, "Member 'UBP_LastStandSystem_C::LastStandRequestsQueue' has a wrong offset!");
static_assert(offsetof(UBP_LastStandSystem_C, CurrentProcessedRequest) == 0x000058, "Member 'UBP_LastStandSystem_C::CurrentProcessedRequest' has a wrong offset!");
static_assert(offsetof(UBP_LastStandSystem_C, OnAllLastStandsProcessed) == 0x000060, "Member 'UBP_LastStandSystem_C::OnAllLastStandsProcessed' has a wrong offset!");
static_assert(offsetof(UBP_LastStandSystem_C, OnCharacterLastStandStarted) == 0x000070, "Member 'UBP_LastStandSystem_C::OnCharacterLastStandStarted' has a wrong offset!");
static_assert(offsetof(UBP_LastStandSystem_C, OnCharacterLastStandEnded) == 0x000080, "Member 'UBP_LastStandSystem_C::OnCharacterLastStandEnded' has a wrong offset!");

}

