#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_LevelSequenceExecutor_SerializableComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_LevelSequenceExecutor_SerializableComponent.BP_LevelSequenceExecutor_SerializableComponent_C.SaveState
// 0x0040 (0x0040 - 0x0000)
struct BP_LevelSequenceExecutor_SerializableComponent_C_SaveState final
{
public:
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_LevelSequenceExecutor_Interface_C> K2Node_DynamicCast_AsBPI_Level_Sequence_Executor_Interface; // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetGlobalObjectID_ObjectID;               // 0x001C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSequencePlayed_ReturnValue;             // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_jRPG_GI_Custom_C*                   K2Node_DynamicCast_AsBP_J_RPG_GI_Custom;           // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LevelSequenceExecutor_SerializableComponent_C_SaveState) == 0x000008, "Wrong alignment on BP_LevelSequenceExecutor_SerializableComponent_C_SaveState");
static_assert(sizeof(BP_LevelSequenceExecutor_SerializableComponent_C_SaveState) == 0x000040, "Wrong size on BP_LevelSequenceExecutor_SerializableComponent_C_SaveState");
static_assert(offsetof(BP_LevelSequenceExecutor_SerializableComponent_C_SaveState, CallFunc_GetOwner_ReturnValue) == 0x000000, "Member 'BP_LevelSequenceExecutor_SerializableComponent_C_SaveState::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LevelSequenceExecutor_SerializableComponent_C_SaveState, K2Node_DynamicCast_AsBPI_Level_Sequence_Executor_Interface) == 0x000008, "Member 'BP_LevelSequenceExecutor_SerializableComponent_C_SaveState::K2Node_DynamicCast_AsBPI_Level_Sequence_Executor_Interface' has a wrong offset!");
static_assert(offsetof(BP_LevelSequenceExecutor_SerializableComponent_C_SaveState, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_LevelSequenceExecutor_SerializableComponent_C_SaveState::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_LevelSequenceExecutor_SerializableComponent_C_SaveState, CallFunc_GetGlobalObjectID_ObjectID) == 0x00001C, "Member 'BP_LevelSequenceExecutor_SerializableComponent_C_SaveState::CallFunc_GetGlobalObjectID_ObjectID' has a wrong offset!");
static_assert(offsetof(BP_LevelSequenceExecutor_SerializableComponent_C_SaveState, CallFunc_IsSequencePlayed_ReturnValue) == 0x000024, "Member 'BP_LevelSequenceExecutor_SerializableComponent_C_SaveState::CallFunc_IsSequencePlayed_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LevelSequenceExecutor_SerializableComponent_C_SaveState, CallFunc_GetGameInstance_ReturnValue) == 0x000028, "Member 'BP_LevelSequenceExecutor_SerializableComponent_C_SaveState::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LevelSequenceExecutor_SerializableComponent_C_SaveState, K2Node_DynamicCast_AsBP_J_RPG_GI_Custom) == 0x000030, "Member 'BP_LevelSequenceExecutor_SerializableComponent_C_SaveState::K2Node_DynamicCast_AsBP_J_RPG_GI_Custom' has a wrong offset!");
static_assert(offsetof(BP_LevelSequenceExecutor_SerializableComponent_C_SaveState, K2Node_DynamicCast_bSuccess_1) == 0x000038, "Member 'BP_LevelSequenceExecutor_SerializableComponent_C_SaveState::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function BP_LevelSequenceExecutor_SerializableComponent.BP_LevelSequenceExecutor_SerializableComponent_C.ReadState
// 0x0028 (0x0028 - 0x0000)
struct BP_LevelSequenceExecutor_SerializableComponent_C_ReadState final
{
public:
	bool                                          State;                                             // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetGlobalObjectID_ObjectID;               // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_jRPG_GI_Custom_C*                   K2Node_DynamicCast_AsBP_J_RPG_GI_Custom;           // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_Value;                           // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LevelSequenceExecutor_SerializableComponent_C_ReadState) == 0x000008, "Wrong alignment on BP_LevelSequenceExecutor_SerializableComponent_C_ReadState");
static_assert(sizeof(BP_LevelSequenceExecutor_SerializableComponent_C_ReadState) == 0x000028, "Wrong size on BP_LevelSequenceExecutor_SerializableComponent_C_ReadState");
static_assert(offsetof(BP_LevelSequenceExecutor_SerializableComponent_C_ReadState, State) == 0x000000, "Member 'BP_LevelSequenceExecutor_SerializableComponent_C_ReadState::State' has a wrong offset!");
static_assert(offsetof(BP_LevelSequenceExecutor_SerializableComponent_C_ReadState, CallFunc_GetGlobalObjectID_ObjectID) == 0x000004, "Member 'BP_LevelSequenceExecutor_SerializableComponent_C_ReadState::CallFunc_GetGlobalObjectID_ObjectID' has a wrong offset!");
static_assert(offsetof(BP_LevelSequenceExecutor_SerializableComponent_C_ReadState, CallFunc_GetGameInstance_ReturnValue) == 0x000010, "Member 'BP_LevelSequenceExecutor_SerializableComponent_C_ReadState::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LevelSequenceExecutor_SerializableComponent_C_ReadState, K2Node_DynamicCast_AsBP_J_RPG_GI_Custom) == 0x000018, "Member 'BP_LevelSequenceExecutor_SerializableComponent_C_ReadState::K2Node_DynamicCast_AsBP_J_RPG_GI_Custom' has a wrong offset!");
static_assert(offsetof(BP_LevelSequenceExecutor_SerializableComponent_C_ReadState, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_LevelSequenceExecutor_SerializableComponent_C_ReadState::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_LevelSequenceExecutor_SerializableComponent_C_ReadState, CallFunc_Map_Find_Value) == 0x000021, "Member 'BP_LevelSequenceExecutor_SerializableComponent_C_ReadState::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BP_LevelSequenceExecutor_SerializableComponent_C_ReadState, CallFunc_Map_Find_ReturnValue) == 0x000022, "Member 'BP_LevelSequenceExecutor_SerializableComponent_C_ReadState::CallFunc_Map_Find_ReturnValue' has a wrong offset!");

// Function BP_LevelSequenceExecutor_SerializableComponent.BP_LevelSequenceExecutor_SerializableComponent_C.ExecuteUbergraph_BP_LevelSequenceExecutor_SerializableComponent
// 0x0028 (0x0028 - 0x0000)
struct BP_LevelSequenceExecutor_SerializableComponent_C_ExecuteUbergraph_BP_LevelSequenceExecutor_SerializableComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ReadState_State;                          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_LevelSequenceExecutor_Interface_C> K2Node_DynamicCast_AsBPI_Level_Sequence_Executor_Interface; // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LevelSequenceExecutor_SerializableComponent_C_ExecuteUbergraph_BP_LevelSequenceExecutor_SerializableComponent) == 0x000008, "Wrong alignment on BP_LevelSequenceExecutor_SerializableComponent_C_ExecuteUbergraph_BP_LevelSequenceExecutor_SerializableComponent");
static_assert(sizeof(BP_LevelSequenceExecutor_SerializableComponent_C_ExecuteUbergraph_BP_LevelSequenceExecutor_SerializableComponent) == 0x000028, "Wrong size on BP_LevelSequenceExecutor_SerializableComponent_C_ExecuteUbergraph_BP_LevelSequenceExecutor_SerializableComponent");
static_assert(offsetof(BP_LevelSequenceExecutor_SerializableComponent_C_ExecuteUbergraph_BP_LevelSequenceExecutor_SerializableComponent, EntryPoint) == 0x000000, "Member 'BP_LevelSequenceExecutor_SerializableComponent_C_ExecuteUbergraph_BP_LevelSequenceExecutor_SerializableComponent::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_LevelSequenceExecutor_SerializableComponent_C_ExecuteUbergraph_BP_LevelSequenceExecutor_SerializableComponent, CallFunc_ReadState_State) == 0x000004, "Member 'BP_LevelSequenceExecutor_SerializableComponent_C_ExecuteUbergraph_BP_LevelSequenceExecutor_SerializableComponent::CallFunc_ReadState_State' has a wrong offset!");
static_assert(offsetof(BP_LevelSequenceExecutor_SerializableComponent_C_ExecuteUbergraph_BP_LevelSequenceExecutor_SerializableComponent, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'BP_LevelSequenceExecutor_SerializableComponent_C_ExecuteUbergraph_BP_LevelSequenceExecutor_SerializableComponent::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LevelSequenceExecutor_SerializableComponent_C_ExecuteUbergraph_BP_LevelSequenceExecutor_SerializableComponent, K2Node_DynamicCast_AsBPI_Level_Sequence_Executor_Interface) == 0x000010, "Member 'BP_LevelSequenceExecutor_SerializableComponent_C_ExecuteUbergraph_BP_LevelSequenceExecutor_SerializableComponent::K2Node_DynamicCast_AsBPI_Level_Sequence_Executor_Interface' has a wrong offset!");
static_assert(offsetof(BP_LevelSequenceExecutor_SerializableComponent_C_ExecuteUbergraph_BP_LevelSequenceExecutor_SerializableComponent, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_LevelSequenceExecutor_SerializableComponent_C_ExecuteUbergraph_BP_LevelSequenceExecutor_SerializableComponent::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BP_LevelSequenceExecutor_SerializableComponent.BP_LevelSequenceExecutor_SerializableComponent_C.CheckForErrors
// 0x00C8 (0x00C8 - 0x0000)
struct BP_LevelSequenceExecutor_SerializableComponent_C_CheckForErrors final
{
public:
	TArray<class FText>                           ErrorMessages;                                     // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoesImplementInterface_ReturnValue;       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0038(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0048(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0090(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Format_ReturnValue;                       // 0x00A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x00B0(0x0010)()
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LevelSequenceExecutor_SerializableComponent_C_CheckForErrors) == 0x000008, "Wrong alignment on BP_LevelSequenceExecutor_SerializableComponent_C_CheckForErrors");
static_assert(sizeof(BP_LevelSequenceExecutor_SerializableComponent_C_CheckForErrors) == 0x0000C8, "Wrong size on BP_LevelSequenceExecutor_SerializableComponent_C_CheckForErrors");
static_assert(offsetof(BP_LevelSequenceExecutor_SerializableComponent_C_CheckForErrors, ErrorMessages) == 0x000000, "Member 'BP_LevelSequenceExecutor_SerializableComponent_C_CheckForErrors::ErrorMessages' has a wrong offset!");
static_assert(offsetof(BP_LevelSequenceExecutor_SerializableComponent_C_CheckForErrors, ReturnValue) == 0x000010, "Member 'BP_LevelSequenceExecutor_SerializableComponent_C_CheckForErrors::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LevelSequenceExecutor_SerializableComponent_C_CheckForErrors, CallFunc_GetOwner_ReturnValue) == 0x000018, "Member 'BP_LevelSequenceExecutor_SerializableComponent_C_CheckForErrors::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LevelSequenceExecutor_SerializableComponent_C_CheckForErrors, CallFunc_GetDisplayName_ReturnValue) == 0x000020, "Member 'BP_LevelSequenceExecutor_SerializableComponent_C_CheckForErrors::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LevelSequenceExecutor_SerializableComponent_C_CheckForErrors, CallFunc_DoesImplementInterface_ReturnValue) == 0x000030, "Member 'BP_LevelSequenceExecutor_SerializableComponent_C_CheckForErrors::CallFunc_DoesImplementInterface_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LevelSequenceExecutor_SerializableComponent_C_CheckForErrors, CallFunc_Conv_StringToText_ReturnValue) == 0x000038, "Member 'BP_LevelSequenceExecutor_SerializableComponent_C_CheckForErrors::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LevelSequenceExecutor_SerializableComponent_C_CheckForErrors, K2Node_MakeStruct_FormatArgumentData) == 0x000048, "Member 'BP_LevelSequenceExecutor_SerializableComponent_C_CheckForErrors::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_LevelSequenceExecutor_SerializableComponent_C_CheckForErrors, K2Node_MakeArray_Array) == 0x000090, "Member 'BP_LevelSequenceExecutor_SerializableComponent_C_CheckForErrors::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_LevelSequenceExecutor_SerializableComponent_C_CheckForErrors, CallFunc_Format_ReturnValue) == 0x0000A0, "Member 'BP_LevelSequenceExecutor_SerializableComponent_C_CheckForErrors::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LevelSequenceExecutor_SerializableComponent_C_CheckForErrors, CallFunc_Conv_StringToText_ReturnValue_1) == 0x0000B0, "Member 'BP_LevelSequenceExecutor_SerializableComponent_C_CheckForErrors::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LevelSequenceExecutor_SerializableComponent_C_CheckForErrors, CallFunc_Array_Add_ReturnValue) == 0x0000C0, "Member 'BP_LevelSequenceExecutor_SerializableComponent_C_CheckForErrors::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

}

