#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_LoadAssetRequest

#include "Basic.hpp"

#include "SandFall_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_LoadAssetRequest.BP_LoadAssetRequest_C
// 0x0038 (0x0080 - 0x0048)
class UBP_LoadAssetRequest_C final : public USF_BlueprintLatentAction
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0048(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TSoftObjectPtr<class UObject>                 Asset;                                             // 0x0050(0x0028)(Edit, BlueprintVisible, ExposeOnSpawn, HasGetValueTypeHash)
	class UObject*                                LoadedAsset;                                       // 0x0078(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_LoadAssetRequest(int32 EntryPoint);
	void GetLoadedAsset(class UObject** LoadedAsset_0);
	void OnLoaded_496BAEE54A2F2A38A62777A94F6FE87D(class UObject* Loaded);
	void StartOperation();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_LoadAssetRequest_C">();
	}
	static class UBP_LoadAssetRequest_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_LoadAssetRequest_C>();
	}
};
static_assert(alignof(UBP_LoadAssetRequest_C) == 0x000008, "Wrong alignment on UBP_LoadAssetRequest_C");
static_assert(sizeof(UBP_LoadAssetRequest_C) == 0x000080, "Wrong size on UBP_LoadAssetRequest_C");
static_assert(offsetof(UBP_LoadAssetRequest_C, UberGraphFrame) == 0x000048, "Member 'UBP_LoadAssetRequest_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_LoadAssetRequest_C, Asset) == 0x000050, "Member 'UBP_LoadAssetRequest_C::Asset' has a wrong offset!");
static_assert(offsetof(UBP_LoadAssetRequest_C, LoadedAsset) == 0x000078, "Member 'UBP_LoadAssetRequest_C::LoadedAsset' has a wrong offset!");

}

