#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_LightPerturbatorArea

#include "Basic.hpp"

#include "SandFall_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_LightPerturbatorArea.BP_LightPerturbatorArea_C
// 0x0050 (0x02E0 - 0x0290)
class ABP_LightPerturbatorArea_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      Niagara;                                           // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Box;                                               // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_NewTrack_0_1CE5AE8C4B74D3350A3402AA12CF82A8; // 0x02B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_1CE5AE8C4B74D3350A3402AA12CF82A8; // 0x02B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B5[0x3];                                      // 0x02B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          IsInFeedBack;                                      // 0x02C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C1[0x7];                                      // 0x02C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameAction_Wrapper                    GameActionToPlayOnLightShutDown;                   // 0x02C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          PlayGaOnLightShutDown;                             // 0x02D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_LightPerturbatorArea(int32 EntryPoint);
	void PerturbatorFeedBack();
	void Timeline_0__FinishedFunc();
	void Timeline_0__UpdateFunc();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_LightPerturbatorArea_C">();
	}
	static class ABP_LightPerturbatorArea_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_LightPerturbatorArea_C>();
	}
};
static_assert(alignof(ABP_LightPerturbatorArea_C) == 0x000008, "Wrong alignment on ABP_LightPerturbatorArea_C");
static_assert(sizeof(ABP_LightPerturbatorArea_C) == 0x0002E0, "Wrong size on ABP_LightPerturbatorArea_C");
static_assert(offsetof(ABP_LightPerturbatorArea_C, UberGraphFrame) == 0x000290, "Member 'ABP_LightPerturbatorArea_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_LightPerturbatorArea_C, Niagara) == 0x000298, "Member 'ABP_LightPerturbatorArea_C::Niagara' has a wrong offset!");
static_assert(offsetof(ABP_LightPerturbatorArea_C, Box) == 0x0002A0, "Member 'ABP_LightPerturbatorArea_C::Box' has a wrong offset!");
static_assert(offsetof(ABP_LightPerturbatorArea_C, DefaultSceneRoot) == 0x0002A8, "Member 'ABP_LightPerturbatorArea_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_LightPerturbatorArea_C, Timeline_0_NewTrack_0_1CE5AE8C4B74D3350A3402AA12CF82A8) == 0x0002B0, "Member 'ABP_LightPerturbatorArea_C::Timeline_0_NewTrack_0_1CE5AE8C4B74D3350A3402AA12CF82A8' has a wrong offset!");
static_assert(offsetof(ABP_LightPerturbatorArea_C, Timeline_0__Direction_1CE5AE8C4B74D3350A3402AA12CF82A8) == 0x0002B4, "Member 'ABP_LightPerturbatorArea_C::Timeline_0__Direction_1CE5AE8C4B74D3350A3402AA12CF82A8' has a wrong offset!");
static_assert(offsetof(ABP_LightPerturbatorArea_C, Timeline_0) == 0x0002B8, "Member 'ABP_LightPerturbatorArea_C::Timeline_0' has a wrong offset!");
static_assert(offsetof(ABP_LightPerturbatorArea_C, IsInFeedBack) == 0x0002C0, "Member 'ABP_LightPerturbatorArea_C::IsInFeedBack' has a wrong offset!");
static_assert(offsetof(ABP_LightPerturbatorArea_C, GameActionToPlayOnLightShutDown) == 0x0002C8, "Member 'ABP_LightPerturbatorArea_C::GameActionToPlayOnLightShutDown' has a wrong offset!");
static_assert(offsetof(ABP_LightPerturbatorArea_C, PlayGaOnLightShutDown) == 0x0002D8, "Member 'ABP_LightPerturbatorArea_C::PlayGaOnLightShutDown' has a wrong offset!");

}

