#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_LGUI_UIContainer_BattleWheelRoot

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "LGUI_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_LGUI_UIContainer_BattleWheelRoot.BP_LGUI_UIContainer_BattleWheelRoot_C
// 0x00E8 (0x0380 - 0x0298)
class ABP_LGUI_UIContainer_BattleWheelRoot_C final : public AUIContainerActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0298(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ULGUICanvas*                            LGUICanvas;                                        // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ULGUIWorldSpaceRaycaster*               LGUIWorldSpaceRaycaster;                           // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWBP_HUD_WheelsContainer_C*             WheelsContainer;                                   // 0x02B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B8[0x8];                                      // 0x02B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             TargetTransform;                                   // 0x02C0(0x0060)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SkeletalFollowMeshComponentRef;                    // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   SkeletalFollowBoneName;                            // 0x0328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                DesiredForwardVector;                              // 0x0330(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DesiredForwardAlpha;                               // 0x0348(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34C[0x4];                                      // 0x034C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                SkeletalFollowOffset;                              // 0x0350(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              TwoDOffset;                                        // 0x0368(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_jRPG_Character_Battle_Base_C*       CurrentCharacter;                                  // 0x0378(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_LGUI_UIContainer_BattleWheelRoot(int32 EntryPoint);
	void GetScale2DOffset(struct FVector2D* NewParam);
	struct FVector GetSkeletalFollowTargetLocation();
	class UWBP_HUD_WheelsContainer_C* GetWheelsContainerWidget();
	void OnPageChanged();
	void OverrideDesiredForwardAlpha(float DesiredForwardAlpha_0);
	void ReceiveBeginPlay();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void ReceiveTick(float DeltaSeconds);
	void ResetDesiredForwardAlpha();
	void SetAdditional2DOffset(const struct FVector2D& TwoDOffset_0);
	void SetBaseForwardVector(const struct FVector& DesiredForwardVector_0);
	void SetBattleCharacter(class ABP_jRPG_Character_Battle_Base_C* CurrentCharacter_0);
	void SetLocationAsSkeletalFollow(class USkeletalMeshComponent* SkeletalMeshComponent, class FName BoneName);
	void SetLocationAsStatic(const struct FVector& NewLocation);
	void StartFromBattle();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_LGUI_UIContainer_BattleWheelRoot_C">();
	}
	static class ABP_LGUI_UIContainer_BattleWheelRoot_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_LGUI_UIContainer_BattleWheelRoot_C>();
	}
};
static_assert(alignof(ABP_LGUI_UIContainer_BattleWheelRoot_C) == 0x000010, "Wrong alignment on ABP_LGUI_UIContainer_BattleWheelRoot_C");
static_assert(sizeof(ABP_LGUI_UIContainer_BattleWheelRoot_C) == 0x000380, "Wrong size on ABP_LGUI_UIContainer_BattleWheelRoot_C");
static_assert(offsetof(ABP_LGUI_UIContainer_BattleWheelRoot_C, UberGraphFrame) == 0x000298, "Member 'ABP_LGUI_UIContainer_BattleWheelRoot_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_LGUI_UIContainer_BattleWheelRoot_C, LGUICanvas) == 0x0002A0, "Member 'ABP_LGUI_UIContainer_BattleWheelRoot_C::LGUICanvas' has a wrong offset!");
static_assert(offsetof(ABP_LGUI_UIContainer_BattleWheelRoot_C, LGUIWorldSpaceRaycaster) == 0x0002A8, "Member 'ABP_LGUI_UIContainer_BattleWheelRoot_C::LGUIWorldSpaceRaycaster' has a wrong offset!");
static_assert(offsetof(ABP_LGUI_UIContainer_BattleWheelRoot_C, WheelsContainer) == 0x0002B0, "Member 'ABP_LGUI_UIContainer_BattleWheelRoot_C::WheelsContainer' has a wrong offset!");
static_assert(offsetof(ABP_LGUI_UIContainer_BattleWheelRoot_C, TargetTransform) == 0x0002C0, "Member 'ABP_LGUI_UIContainer_BattleWheelRoot_C::TargetTransform' has a wrong offset!");
static_assert(offsetof(ABP_LGUI_UIContainer_BattleWheelRoot_C, SkeletalFollowMeshComponentRef) == 0x000320, "Member 'ABP_LGUI_UIContainer_BattleWheelRoot_C::SkeletalFollowMeshComponentRef' has a wrong offset!");
static_assert(offsetof(ABP_LGUI_UIContainer_BattleWheelRoot_C, SkeletalFollowBoneName) == 0x000328, "Member 'ABP_LGUI_UIContainer_BattleWheelRoot_C::SkeletalFollowBoneName' has a wrong offset!");
static_assert(offsetof(ABP_LGUI_UIContainer_BattleWheelRoot_C, DesiredForwardVector) == 0x000330, "Member 'ABP_LGUI_UIContainer_BattleWheelRoot_C::DesiredForwardVector' has a wrong offset!");
static_assert(offsetof(ABP_LGUI_UIContainer_BattleWheelRoot_C, DesiredForwardAlpha) == 0x000348, "Member 'ABP_LGUI_UIContainer_BattleWheelRoot_C::DesiredForwardAlpha' has a wrong offset!");
static_assert(offsetof(ABP_LGUI_UIContainer_BattleWheelRoot_C, SkeletalFollowOffset) == 0x000350, "Member 'ABP_LGUI_UIContainer_BattleWheelRoot_C::SkeletalFollowOffset' has a wrong offset!");
static_assert(offsetof(ABP_LGUI_UIContainer_BattleWheelRoot_C, TwoDOffset) == 0x000368, "Member 'ABP_LGUI_UIContainer_BattleWheelRoot_C::TwoDOffset' has a wrong offset!");
static_assert(offsetof(ABP_LGUI_UIContainer_BattleWheelRoot_C, CurrentCharacter) == 0x000378, "Member 'ABP_LGUI_UIContainer_BattleWheelRoot_C::CurrentCharacter' has a wrong offset!");

}

