#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MediaPlayer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_MediaPlayer.BP_MediaPlayer_C
// 0x0038 (0x02C8 - 0x0290)
class ABP_MediaPlayer_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWBP_MedialPlayerWidget_C*              MediaPlayerWidget;                                 // 0x02A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UMediaSource*                           MediaSource;                                       // 0x02A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Interp, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          MuteSound;                                         // 0x02B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_2B1[0x7];                                      // 0x02B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        PreviousDynamicResMinValue;                        // 0x02B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        PreviousDynamicResMaxValue;                        // 0x02C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_MediaPlayer(int32 EntryPoint);
	void OnMediaSourceOpened_Event();
	void OpenMediaSource();
	void PauseMedia();
	void PlayMedia();
	void ReceiveBeginPlay();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void SetMediaSource(class UMediaSource* MediaSource_0);
	void SetMuteSound(bool MuteSound_0);
	void SetRenderingProperties(bool bIsCinematicPlaying);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_MediaPlayer_C">();
	}
	static class ABP_MediaPlayer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_MediaPlayer_C>();
	}
};
static_assert(alignof(ABP_MediaPlayer_C) == 0x000008, "Wrong alignment on ABP_MediaPlayer_C");
static_assert(sizeof(ABP_MediaPlayer_C) == 0x0002C8, "Wrong size on ABP_MediaPlayer_C");
static_assert(offsetof(ABP_MediaPlayer_C, UberGraphFrame) == 0x000290, "Member 'ABP_MediaPlayer_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_MediaPlayer_C, DefaultSceneRoot) == 0x000298, "Member 'ABP_MediaPlayer_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_MediaPlayer_C, MediaPlayerWidget) == 0x0002A0, "Member 'ABP_MediaPlayer_C::MediaPlayerWidget' has a wrong offset!");
static_assert(offsetof(ABP_MediaPlayer_C, MediaSource) == 0x0002A8, "Member 'ABP_MediaPlayer_C::MediaSource' has a wrong offset!");
static_assert(offsetof(ABP_MediaPlayer_C, MuteSound) == 0x0002B0, "Member 'ABP_MediaPlayer_C::MuteSound' has a wrong offset!");
static_assert(offsetof(ABP_MediaPlayer_C, PreviousDynamicResMinValue) == 0x0002B8, "Member 'ABP_MediaPlayer_C::PreviousDynamicResMinValue' has a wrong offset!");
static_assert(offsetof(ABP_MediaPlayer_C, PreviousDynamicResMaxValue) == 0x0002C0, "Member 'ABP_MediaPlayer_C::PreviousDynamicResMaxValue' has a wrong offset!");

}

