#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MerchantConditionCheckerDataAsset

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_MerchantConditionCheckerDataAsset.BP_MerchantConditionCheckerDataAsset_C.GetConditionDisplayName
// 0x0010 (0x0010 - 0x0000)
struct BP_MerchantConditionCheckerDataAsset_C_GetConditionDisplayName final
{
public:
	class FText                                   ConditionDisplayName_0;                            // 0x0000(0x0010)(Parm, OutParm)
};
static_assert(alignof(BP_MerchantConditionCheckerDataAsset_C_GetConditionDisplayName) == 0x000008, "Wrong alignment on BP_MerchantConditionCheckerDataAsset_C_GetConditionDisplayName");
static_assert(sizeof(BP_MerchantConditionCheckerDataAsset_C_GetConditionDisplayName) == 0x000010, "Wrong size on BP_MerchantConditionCheckerDataAsset_C_GetConditionDisplayName");
static_assert(offsetof(BP_MerchantConditionCheckerDataAsset_C_GetConditionDisplayName, ConditionDisplayName_0) == 0x000000, "Member 'BP_MerchantConditionCheckerDataAsset_C_GetConditionDisplayName::ConditionDisplayName_0' has a wrong offset!");

// Function BP_MerchantConditionCheckerDataAsset.BP_MerchantConditionCheckerDataAsset_C.GetConditionDisplayTooltip
// 0x0010 (0x0010 - 0x0000)
struct BP_MerchantConditionCheckerDataAsset_C_GetConditionDisplayTooltip final
{
public:
	class FText                                   ConditionDisplayTooltip_0;                         // 0x0000(0x0010)(Parm, OutParm)
};
static_assert(alignof(BP_MerchantConditionCheckerDataAsset_C_GetConditionDisplayTooltip) == 0x000008, "Wrong alignment on BP_MerchantConditionCheckerDataAsset_C_GetConditionDisplayTooltip");
static_assert(sizeof(BP_MerchantConditionCheckerDataAsset_C_GetConditionDisplayTooltip) == 0x000010, "Wrong size on BP_MerchantConditionCheckerDataAsset_C_GetConditionDisplayTooltip");
static_assert(offsetof(BP_MerchantConditionCheckerDataAsset_C_GetConditionDisplayTooltip, ConditionDisplayTooltip_0) == 0x000000, "Member 'BP_MerchantConditionCheckerDataAsset_C_GetConditionDisplayTooltip::ConditionDisplayTooltip_0' has a wrong offset!");

}

