#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MediaPlayer

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_MediaPlayer.BP_MediaPlayer_C.ExecuteUbergraph_BP_MediaPlayer
// 0x0050 (0x0050 - 0x0000)
struct BP_MediaPlayer_C_ExecuteUbergraph_BP_MediaPlayer final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetConsoleVariableFloatValue_ReturnValue; // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_MedialPlayerWidget_C*              CallFunc_Create_ReturnValue;                       // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_CinematicSystem_C*                  CallFunc_GetCinematicsSystem_ReturnValue;          // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UBP_CinematicSystem_C*                  CallFunc_GetCinematicsSystem_ReturnValue_1;        // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetConsoleVariableFloatValue_ReturnValue_1; // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_VariableSet_PreviousDynamicResMaxValue_ImplicitCast; // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_PreviousDynamicResMinValue_ImplicitCast; // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MediaPlayer_C_ExecuteUbergraph_BP_MediaPlayer) == 0x000008, "Wrong alignment on BP_MediaPlayer_C_ExecuteUbergraph_BP_MediaPlayer");
static_assert(sizeof(BP_MediaPlayer_C_ExecuteUbergraph_BP_MediaPlayer) == 0x000050, "Wrong size on BP_MediaPlayer_C_ExecuteUbergraph_BP_MediaPlayer");
static_assert(offsetof(BP_MediaPlayer_C_ExecuteUbergraph_BP_MediaPlayer, EntryPoint) == 0x000000, "Member 'BP_MediaPlayer_C_ExecuteUbergraph_BP_MediaPlayer::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_MediaPlayer_C_ExecuteUbergraph_BP_MediaPlayer, CallFunc_GetConsoleVariableFloatValue_ReturnValue) == 0x000004, "Member 'BP_MediaPlayer_C_ExecuteUbergraph_BP_MediaPlayer::CallFunc_GetConsoleVariableFloatValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MediaPlayer_C_ExecuteUbergraph_BP_MediaPlayer, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'BP_MediaPlayer_C_ExecuteUbergraph_BP_MediaPlayer::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_MediaPlayer_C_ExecuteUbergraph_BP_MediaPlayer, CallFunc_Create_ReturnValue) == 0x000018, "Member 'BP_MediaPlayer_C_ExecuteUbergraph_BP_MediaPlayer::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MediaPlayer_C_ExecuteUbergraph_BP_MediaPlayer, K2Node_Event_EndPlayReason) == 0x000020, "Member 'BP_MediaPlayer_C_ExecuteUbergraph_BP_MediaPlayer::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BP_MediaPlayer_C_ExecuteUbergraph_BP_MediaPlayer, CallFunc_GetCinematicsSystem_ReturnValue) == 0x000028, "Member 'BP_MediaPlayer_C_ExecuteUbergraph_BP_MediaPlayer::CallFunc_GetCinematicsSystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MediaPlayer_C_ExecuteUbergraph_BP_MediaPlayer, CallFunc_GetCinematicsSystem_ReturnValue_1) == 0x000030, "Member 'BP_MediaPlayer_C_ExecuteUbergraph_BP_MediaPlayer::CallFunc_GetCinematicsSystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MediaPlayer_C_ExecuteUbergraph_BP_MediaPlayer, CallFunc_GetConsoleVariableFloatValue_ReturnValue_1) == 0x000038, "Member 'BP_MediaPlayer_C_ExecuteUbergraph_BP_MediaPlayer::CallFunc_GetConsoleVariableFloatValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MediaPlayer_C_ExecuteUbergraph_BP_MediaPlayer, K2Node_VariableSet_PreviousDynamicResMaxValue_ImplicitCast) == 0x000040, "Member 'BP_MediaPlayer_C_ExecuteUbergraph_BP_MediaPlayer::K2Node_VariableSet_PreviousDynamicResMaxValue_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_MediaPlayer_C_ExecuteUbergraph_BP_MediaPlayer, K2Node_VariableSet_PreviousDynamicResMinValue_ImplicitCast) == 0x000048, "Member 'BP_MediaPlayer_C_ExecuteUbergraph_BP_MediaPlayer::K2Node_VariableSet_PreviousDynamicResMinValue_ImplicitCast' has a wrong offset!");

// Function BP_MediaPlayer.BP_MediaPlayer_C.OpenMediaSource
// 0x0001 (0x0001 - 0x0000)
struct BP_MediaPlayer_C_OpenMediaSource final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MediaPlayer_C_OpenMediaSource) == 0x000001, "Wrong alignment on BP_MediaPlayer_C_OpenMediaSource");
static_assert(sizeof(BP_MediaPlayer_C_OpenMediaSource) == 0x000001, "Wrong size on BP_MediaPlayer_C_OpenMediaSource");
static_assert(offsetof(BP_MediaPlayer_C_OpenMediaSource, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'BP_MediaPlayer_C_OpenMediaSource::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_MediaPlayer.BP_MediaPlayer_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_MediaPlayer_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MediaPlayer_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_MediaPlayer_C_ReceiveEndPlay");
static_assert(sizeof(BP_MediaPlayer_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_MediaPlayer_C_ReceiveEndPlay");
static_assert(offsetof(BP_MediaPlayer_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_MediaPlayer_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function BP_MediaPlayer.BP_MediaPlayer_C.SetMediaSource
// 0x0010 (0x0010 - 0x0000)
struct BP_MediaPlayer_C_SetMediaSource final
{
public:
	class UMediaSource*                           MediaSource_0;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MediaPlayer_C_SetMediaSource) == 0x000008, "Wrong alignment on BP_MediaPlayer_C_SetMediaSource");
static_assert(sizeof(BP_MediaPlayer_C_SetMediaSource) == 0x000010, "Wrong size on BP_MediaPlayer_C_SetMediaSource");
static_assert(offsetof(BP_MediaPlayer_C_SetMediaSource, MediaSource_0) == 0x000000, "Member 'BP_MediaPlayer_C_SetMediaSource::MediaSource_0' has a wrong offset!");
static_assert(offsetof(BP_MediaPlayer_C_SetMediaSource, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000008, "Member 'BP_MediaPlayer_C_SetMediaSource::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MediaPlayer_C_SetMediaSource, CallFunc_IsValid_ReturnValue) == 0x000009, "Member 'BP_MediaPlayer_C_SetMediaSource::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_MediaPlayer.BP_MediaPlayer_C.SetMuteSound
// 0x0001 (0x0001 - 0x0000)
struct BP_MediaPlayer_C_SetMuteSound final
{
public:
	bool                                          MuteSound_0;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MediaPlayer_C_SetMuteSound) == 0x000001, "Wrong alignment on BP_MediaPlayer_C_SetMuteSound");
static_assert(sizeof(BP_MediaPlayer_C_SetMuteSound) == 0x000001, "Wrong size on BP_MediaPlayer_C_SetMuteSound");
static_assert(offsetof(BP_MediaPlayer_C_SetMuteSound, MuteSound_0) == 0x000000, "Member 'BP_MediaPlayer_C_SetMuteSound::MuteSound_0' has a wrong offset!");

// Function BP_MediaPlayer.BP_MediaPlayer_C.SetRenderingProperties
// 0x0068 (0x0068 - 0x0000)
struct BP_MediaPlayer_C_SetRenderingProperties final
{
public:
	bool                                          bIsCinematicPlaying;                               // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_DoubleToString_ReturnValue;          // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_DoubleToString_ReturnValue_1;        // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MediaPlayer_C_SetRenderingProperties) == 0x000008, "Wrong alignment on BP_MediaPlayer_C_SetRenderingProperties");
static_assert(sizeof(BP_MediaPlayer_C_SetRenderingProperties) == 0x000068, "Wrong size on BP_MediaPlayer_C_SetRenderingProperties");
static_assert(offsetof(BP_MediaPlayer_C_SetRenderingProperties, bIsCinematicPlaying) == 0x000000, "Member 'BP_MediaPlayer_C_SetRenderingProperties::bIsCinematicPlaying' has a wrong offset!");
static_assert(offsetof(BP_MediaPlayer_C_SetRenderingProperties, CallFunc_Concat_StrStr_ReturnValue) == 0x000008, "Member 'BP_MediaPlayer_C_SetRenderingProperties::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MediaPlayer_C_SetRenderingProperties, CallFunc_Conv_DoubleToString_ReturnValue) == 0x000018, "Member 'BP_MediaPlayer_C_SetRenderingProperties::CallFunc_Conv_DoubleToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MediaPlayer_C_SetRenderingProperties, CallFunc_Conv_DoubleToString_ReturnValue_1) == 0x000028, "Member 'BP_MediaPlayer_C_SetRenderingProperties::CallFunc_Conv_DoubleToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MediaPlayer_C_SetRenderingProperties, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000038, "Member 'BP_MediaPlayer_C_SetRenderingProperties::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MediaPlayer_C_SetRenderingProperties, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000048, "Member 'BP_MediaPlayer_C_SetRenderingProperties::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_MediaPlayer_C_SetRenderingProperties, CallFunc_Concat_StrStr_ReturnValue_3) == 0x000058, "Member 'BP_MediaPlayer_C_SetRenderingProperties::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");

}

