#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MantaRay_Spline

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_MantaRay_Spline.BP_MantaRay_Spline_C
// 0x0178 (0x0408 - 0x0290)
class ABP_MantaRay_Spline_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USphereComponent*                       Sphere1;                                           // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 MantaRay;                                          // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        MantaRay_Transform;                                // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Sphere_Back;                                       // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       LookAt_Back;                                       // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USplineComponent*                       Spline;                                            // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Speed_Variations__Direction_DCECF47B47D41D997C417FA386BFD57B; // 0x02D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D1[0x7];                                      // 0x02D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Speed_Variations;                                  // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        Distance;                                          // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Lookat_Front_CurrentDistance;                      // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Lookat_Back_CurrentDistance;                       // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Lookat_Back_Offset;                                // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShowLookatSpheres;                                 // 0x0300(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_301[0x7];                                      // 0x0301(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        MovementSpeed_Spline;                              // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        AnimPlayRate_Min;                                  // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Scale;                                             // 0x0318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DynamicSpeed_SpeedingUp_;                          // 0x0320(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_321[0x7];                                      // 0x0321(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        DynamicSpeed_Desired_Speed;                        // 0x0328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Desired_BlendSpace;                                // 0x0330(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DynamicAnim_Fast_Length;                           // 0x0338(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DynamicAnim_Randomness;                            // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DynamicAnim_Slow_Length;                           // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Dynamic_Speed;                                     // 0x0350(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_351[0x7];                                      // 0x0351(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        AnimPlayRate_Max;                                  // 0x0358(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DynamicSpeed_Speed;                                // 0x0360(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DynamicSpeed_Acceleration;                         // 0x0368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        BlendSpace;                                        // 0x0370(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DynamicSpeed_Deceleration;                         // 0x0378(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MovementSpeed_Min;                                 // 0x0380(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MovementSpeed_Max;                                 // 0x0388(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        BlendSpace_Acceleration;                           // 0x0390(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        BlendSpace_Decelaration;                           // 0x0398(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        AnimPlayRate_Non_Dynamic;                          // 0x03A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MovementSpeed_Non_Dynamic;                         // 0x03A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Anim_Intensity_Non_Dynamic;                        // 0x03B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Pitch;                                             // 0x03B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        TurningAngle;                                      // 0x03C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Turning_Rotation_Intensity;                        // 0x03C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	double                                        Turning_Rotation_Speed;                            // 0x03D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	double                                        TurningAngle_Bones;                                // 0x03D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Material;                                          // 0x03E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMantaRay_AnimBP_C*                     MantaRay_AnimBP;                                   // 0x03E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          ShowSpline;                                        // 0x03F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F1[0x7];                                      // 0x03F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        RandomFloat;                                       // 0x03F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DistanceForTick;                                   // 0x0400(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();
	void Toggle_LookAt_Spheres();
	void Speed_Variations__UpdateFunc();
	void Speed_Variations__FinishedFunc();
	bool ShouldHideDistantInteraction();
	void Set_Meshes_initial_Transform();
	void Set_Mesh_to_Distance_along_Spline();
	void Set_Lookat_Positions();
	void Set_Initial_Speed();
	void Rotate_Bones_to_LookAt_Objects();
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();
	void Play_Dynamic_Animations();
	void OnObjectInteractionStateLoaded(bool InteractionState);
	void OnNotifyEnd_576374D2426C5562FBC8B789ACCBE621(class FName NotifyName);
	void OnNotifyBegin_576374D2426C5562FBC8B789ACCBE621(class FName NotifyName);
	void OnInterrupted_576374D2426C5562FBC8B789ACCBE621(class FName NotifyName);
	void OnInteractionRequested(class ABP_jRPG_Character_World_C* InteractingWorldCharacter, bool Instant);
	void OnInteractionEnabled();
	void OnInteractionDisabled();
	void OnEnemyBattleStateLoaded(bool BattleState);
	void OnCompleted_576374D2426C5562FBC8B789ACCBE621(class FName NotifyName);
	void OnBlendOut_576374D2426C5562FBC8B789ACCBE621(class FName NotifyName);
	void IsInteractionDone(bool* Done);
	void IsInteractionAvailable(bool* Available);
	void IsFreeAimTargetDisabled(bool* IsDisabled);
	void GetInteractionPromptParams(struct FFPromptParams* PromptParams);
	void FreeAimHit(class ABP_jRPG_Character_World_C* PlayerCharacterWorld, const struct FVector& HitLocation, bool IsDisabled);
	void ExecuteUbergraph_BP_MantaRay_Spline(int32 EntryPoint);
	void CanInteractWithMount(bool* CanInteract);
	void Calculate_LookatBack_CurrentDistance();
	void Animate_LookAt_Objects();
	void Animate_LookAt_Back_Variable();
	void Animate_Distance_Variable();

	void GetInteractionLocation(struct FVector* Location) const;
	void GetInteractionFeedbackLocation(struct FVector* Location) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_MantaRay_Spline_C">();
	}
	static class ABP_MantaRay_Spline_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_MantaRay_Spline_C>();
	}
};
static_assert(alignof(ABP_MantaRay_Spline_C) == 0x000008, "Wrong alignment on ABP_MantaRay_Spline_C");
static_assert(sizeof(ABP_MantaRay_Spline_C) == 0x000408, "Wrong size on ABP_MantaRay_Spline_C");
static_assert(offsetof(ABP_MantaRay_Spline_C, UberGraphFrame) == 0x000290, "Member 'ABP_MantaRay_Spline_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_MantaRay_Spline_C, Sphere1) == 0x000298, "Member 'ABP_MantaRay_Spline_C::Sphere1' has a wrong offset!");
static_assert(offsetof(ABP_MantaRay_Spline_C, MantaRay) == 0x0002A0, "Member 'ABP_MantaRay_Spline_C::MantaRay' has a wrong offset!");
static_assert(offsetof(ABP_MantaRay_Spline_C, MantaRay_Transform) == 0x0002A8, "Member 'ABP_MantaRay_Spline_C::MantaRay_Transform' has a wrong offset!");
static_assert(offsetof(ABP_MantaRay_Spline_C, Sphere_Back) == 0x0002B0, "Member 'ABP_MantaRay_Spline_C::Sphere_Back' has a wrong offset!");
static_assert(offsetof(ABP_MantaRay_Spline_C, LookAt_Back) == 0x0002B8, "Member 'ABP_MantaRay_Spline_C::LookAt_Back' has a wrong offset!");
static_assert(offsetof(ABP_MantaRay_Spline_C, Spline) == 0x0002C0, "Member 'ABP_MantaRay_Spline_C::Spline' has a wrong offset!");
static_assert(offsetof(ABP_MantaRay_Spline_C, DefaultSceneRoot) == 0x0002C8, "Member 'ABP_MantaRay_Spline_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_MantaRay_Spline_C, Speed_Variations__Direction_DCECF47B47D41D997C417FA386BFD57B) == 0x0002D0, "Member 'ABP_MantaRay_Spline_C::Speed_Variations__Direction_DCECF47B47D41D997C417FA386BFD57B' has a wrong offset!");
static_assert(offsetof(ABP_MantaRay_Spline_C, Speed_Variations) == 0x0002D8, "Member 'ABP_MantaRay_Spline_C::Speed_Variations' has a wrong offset!");
static_assert(offsetof(ABP_MantaRay_Spline_C, Distance) == 0x0002E0, "Member 'ABP_MantaRay_Spline_C::Distance' has a wrong offset!");
static_assert(offsetof(ABP_MantaRay_Spline_C, Lookat_Front_CurrentDistance) == 0x0002E8, "Member 'ABP_MantaRay_Spline_C::Lookat_Front_CurrentDistance' has a wrong offset!");
static_assert(offsetof(ABP_MantaRay_Spline_C, Lookat_Back_CurrentDistance) == 0x0002F0, "Member 'ABP_MantaRay_Spline_C::Lookat_Back_CurrentDistance' has a wrong offset!");
static_assert(offsetof(ABP_MantaRay_Spline_C, Lookat_Back_Offset) == 0x0002F8, "Member 'ABP_MantaRay_Spline_C::Lookat_Back_Offset' has a wrong offset!");
static_assert(offsetof(ABP_MantaRay_Spline_C, ShowLookatSpheres) == 0x000300, "Member 'ABP_MantaRay_Spline_C::ShowLookatSpheres' has a wrong offset!");
static_assert(offsetof(ABP_MantaRay_Spline_C, MovementSpeed_Spline) == 0x000308, "Member 'ABP_MantaRay_Spline_C::MovementSpeed_Spline' has a wrong offset!");
static_assert(offsetof(ABP_MantaRay_Spline_C, AnimPlayRate_Min) == 0x000310, "Member 'ABP_MantaRay_Spline_C::AnimPlayRate_Min' has a wrong offset!");
static_assert(offsetof(ABP_MantaRay_Spline_C, Scale) == 0x000318, "Member 'ABP_MantaRay_Spline_C::Scale' has a wrong offset!");
static_assert(offsetof(ABP_MantaRay_Spline_C, DynamicSpeed_SpeedingUp_) == 0x000320, "Member 'ABP_MantaRay_Spline_C::DynamicSpeed_SpeedingUp_' has a wrong offset!");
static_assert(offsetof(ABP_MantaRay_Spline_C, DynamicSpeed_Desired_Speed) == 0x000328, "Member 'ABP_MantaRay_Spline_C::DynamicSpeed_Desired_Speed' has a wrong offset!");
static_assert(offsetof(ABP_MantaRay_Spline_C, Desired_BlendSpace) == 0x000330, "Member 'ABP_MantaRay_Spline_C::Desired_BlendSpace' has a wrong offset!");
static_assert(offsetof(ABP_MantaRay_Spline_C, DynamicAnim_Fast_Length) == 0x000338, "Member 'ABP_MantaRay_Spline_C::DynamicAnim_Fast_Length' has a wrong offset!");
static_assert(offsetof(ABP_MantaRay_Spline_C, DynamicAnim_Randomness) == 0x000340, "Member 'ABP_MantaRay_Spline_C::DynamicAnim_Randomness' has a wrong offset!");
static_assert(offsetof(ABP_MantaRay_Spline_C, DynamicAnim_Slow_Length) == 0x000348, "Member 'ABP_MantaRay_Spline_C::DynamicAnim_Slow_Length' has a wrong offset!");
static_assert(offsetof(ABP_MantaRay_Spline_C, Dynamic_Speed) == 0x000350, "Member 'ABP_MantaRay_Spline_C::Dynamic_Speed' has a wrong offset!");
static_assert(offsetof(ABP_MantaRay_Spline_C, AnimPlayRate_Max) == 0x000358, "Member 'ABP_MantaRay_Spline_C::AnimPlayRate_Max' has a wrong offset!");
static_assert(offsetof(ABP_MantaRay_Spline_C, DynamicSpeed_Speed) == 0x000360, "Member 'ABP_MantaRay_Spline_C::DynamicSpeed_Speed' has a wrong offset!");
static_assert(offsetof(ABP_MantaRay_Spline_C, DynamicSpeed_Acceleration) == 0x000368, "Member 'ABP_MantaRay_Spline_C::DynamicSpeed_Acceleration' has a wrong offset!");
static_assert(offsetof(ABP_MantaRay_Spline_C, BlendSpace) == 0x000370, "Member 'ABP_MantaRay_Spline_C::BlendSpace' has a wrong offset!");
static_assert(offsetof(ABP_MantaRay_Spline_C, DynamicSpeed_Deceleration) == 0x000378, "Member 'ABP_MantaRay_Spline_C::DynamicSpeed_Deceleration' has a wrong offset!");
static_assert(offsetof(ABP_MantaRay_Spline_C, MovementSpeed_Min) == 0x000380, "Member 'ABP_MantaRay_Spline_C::MovementSpeed_Min' has a wrong offset!");
static_assert(offsetof(ABP_MantaRay_Spline_C, MovementSpeed_Max) == 0x000388, "Member 'ABP_MantaRay_Spline_C::MovementSpeed_Max' has a wrong offset!");
static_assert(offsetof(ABP_MantaRay_Spline_C, BlendSpace_Acceleration) == 0x000390, "Member 'ABP_MantaRay_Spline_C::BlendSpace_Acceleration' has a wrong offset!");
static_assert(offsetof(ABP_MantaRay_Spline_C, BlendSpace_Decelaration) == 0x000398, "Member 'ABP_MantaRay_Spline_C::BlendSpace_Decelaration' has a wrong offset!");
static_assert(offsetof(ABP_MantaRay_Spline_C, AnimPlayRate_Non_Dynamic) == 0x0003A0, "Member 'ABP_MantaRay_Spline_C::AnimPlayRate_Non_Dynamic' has a wrong offset!");
static_assert(offsetof(ABP_MantaRay_Spline_C, MovementSpeed_Non_Dynamic) == 0x0003A8, "Member 'ABP_MantaRay_Spline_C::MovementSpeed_Non_Dynamic' has a wrong offset!");
static_assert(offsetof(ABP_MantaRay_Spline_C, Anim_Intensity_Non_Dynamic) == 0x0003B0, "Member 'ABP_MantaRay_Spline_C::Anim_Intensity_Non_Dynamic' has a wrong offset!");
static_assert(offsetof(ABP_MantaRay_Spline_C, Pitch) == 0x0003B8, "Member 'ABP_MantaRay_Spline_C::Pitch' has a wrong offset!");
static_assert(offsetof(ABP_MantaRay_Spline_C, TurningAngle) == 0x0003C0, "Member 'ABP_MantaRay_Spline_C::TurningAngle' has a wrong offset!");
static_assert(offsetof(ABP_MantaRay_Spline_C, Turning_Rotation_Intensity) == 0x0003C8, "Member 'ABP_MantaRay_Spline_C::Turning_Rotation_Intensity' has a wrong offset!");
static_assert(offsetof(ABP_MantaRay_Spline_C, Turning_Rotation_Speed) == 0x0003D0, "Member 'ABP_MantaRay_Spline_C::Turning_Rotation_Speed' has a wrong offset!");
static_assert(offsetof(ABP_MantaRay_Spline_C, TurningAngle_Bones) == 0x0003D8, "Member 'ABP_MantaRay_Spline_C::TurningAngle_Bones' has a wrong offset!");
static_assert(offsetof(ABP_MantaRay_Spline_C, Material) == 0x0003E0, "Member 'ABP_MantaRay_Spline_C::Material' has a wrong offset!");
static_assert(offsetof(ABP_MantaRay_Spline_C, MantaRay_AnimBP) == 0x0003E8, "Member 'ABP_MantaRay_Spline_C::MantaRay_AnimBP' has a wrong offset!");
static_assert(offsetof(ABP_MantaRay_Spline_C, ShowSpline) == 0x0003F0, "Member 'ABP_MantaRay_Spline_C::ShowSpline' has a wrong offset!");
static_assert(offsetof(ABP_MantaRay_Spline_C, RandomFloat) == 0x0003F8, "Member 'ABP_MantaRay_Spline_C::RandomFloat' has a wrong offset!");
static_assert(offsetof(ABP_MantaRay_Spline_C, DistanceForTick) == 0x000400, "Member 'ABP_MantaRay_Spline_C::DistanceForTick' has a wrong offset!");

}

