#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PerfectionMechanicComponent

#include "Basic.hpp"

#include "EPerfectionReason_structs.hpp"
#include "E_Perfection_Ranks_structs.hpp"
#include "S_BalancingTableFloatEntry_structs.hpp"
#include "E_PerfectionUpdateType_structs.hpp"
#include "Engine_structs.hpp"
#include "S_TutorialCardParameters_structs.hpp"


namespace SDK::Params
{

// Function BP_PerfectionMechanicComponent.BP_PerfectionMechanicComponent_C.AddPerfection
// 0x000C (0x000C - 0x0000)
struct BP_PerfectionMechanicComponent_C_AddPerfection final
{
public:
	int32                                         PerfectionToAdd_0;                                 // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPerfectionReason                             PerfectionChangeReason;                            // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PerfectionMechanicComponent_C_AddPerfection) == 0x000004, "Wrong alignment on BP_PerfectionMechanicComponent_C_AddPerfection");
static_assert(sizeof(BP_PerfectionMechanicComponent_C_AddPerfection) == 0x00000C, "Wrong size on BP_PerfectionMechanicComponent_C_AddPerfection");
static_assert(offsetof(BP_PerfectionMechanicComponent_C_AddPerfection, PerfectionToAdd_0) == 0x000000, "Member 'BP_PerfectionMechanicComponent_C_AddPerfection::PerfectionToAdd_0' has a wrong offset!");
static_assert(offsetof(BP_PerfectionMechanicComponent_C_AddPerfection, PerfectionChangeReason) == 0x000004, "Member 'BP_PerfectionMechanicComponent_C_AddPerfection::PerfectionChangeReason' has a wrong offset!");
static_assert(offsetof(BP_PerfectionMechanicComponent_C_AddPerfection, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_PerfectionMechanicComponent_C_AddPerfection::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function BP_PerfectionMechanicComponent.BP_PerfectionMechanicComponent_C.CreatePortraitWidget
// 0x0020 (0x0020 - 0x0000)
struct BP_PerfectionMechanicComponent_C_CreatePortraitWidget final
{
public:
	class UUserWidget*                            CreatedUserWidget;                                 // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         SlotIndex;                                         // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_Perfection_Letter_Gauge_C*         CallFunc_Create_ReturnValue;                       // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PerfectionMechanicComponent_C_CreatePortraitWidget) == 0x000008, "Wrong alignment on BP_PerfectionMechanicComponent_C_CreatePortraitWidget");
static_assert(sizeof(BP_PerfectionMechanicComponent_C_CreatePortraitWidget) == 0x000020, "Wrong size on BP_PerfectionMechanicComponent_C_CreatePortraitWidget");
static_assert(offsetof(BP_PerfectionMechanicComponent_C_CreatePortraitWidget, CreatedUserWidget) == 0x000000, "Member 'BP_PerfectionMechanicComponent_C_CreatePortraitWidget::CreatedUserWidget' has a wrong offset!");
static_assert(offsetof(BP_PerfectionMechanicComponent_C_CreatePortraitWidget, SlotIndex) == 0x000008, "Member 'BP_PerfectionMechanicComponent_C_CreatePortraitWidget::SlotIndex' has a wrong offset!");
static_assert(offsetof(BP_PerfectionMechanicComponent_C_CreatePortraitWidget, CallFunc_GetPlayerController_ReturnValue) == 0x000010, "Member 'BP_PerfectionMechanicComponent_C_CreatePortraitWidget::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PerfectionMechanicComponent_C_CreatePortraitWidget, CallFunc_Create_ReturnValue) == 0x000018, "Member 'BP_PerfectionMechanicComponent_C_CreatePortraitWidget::CallFunc_Create_ReturnValue' has a wrong offset!");

// Function BP_PerfectionMechanicComponent.BP_PerfectionMechanicComponent_C.ExecuteUbergraph_BP_PerfectionMechanicComponent
// 0x02A0 (0x02A0 - 0x0000)
struct BP_PerfectionMechanicComponent_C_ExecuteUbergraph_BP_PerfectionMechanicComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue_1;             // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetEnumeratorValueFromIndex_ReturnValue;  // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17[0x1];                                       // 0x0017(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_Perfection_Ranks                            Temp_byte_Variable;                                // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable;                                // 0x0020(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_BalancingTableFloatEntry            CallFunc_GetDataTableRowFromName_OutRow;           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_BalancingTableFloatEntry            CallFunc_GetDataTableRowFromName_OutRow_1;         // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_BalancingTableFloatEntry            CallFunc_GetDataTableRowFromName_OutRow_2;         // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_BalancingTableFloatEntry            CallFunc_GetDataTableRowFromName_OutRow_3;         // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_BalancingTableFloatEntry            CallFunc_GetDataTableRowFromName_OutRow_4;         // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable;                                // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<E_Perfection_Ranks, double>              K2Node_MakeMap_Map;                                // 0x0060(0x0050)()
	bool                                          CallFunc_HasPlayedTutorial_Result;                 // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B2[0x2];                                       // 0x00B2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x00B4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	E_Perfection_Ranks                            K2Node_CustomEvent_NewRank_1;                      // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_jRPG_Character_Battle_Base_C*       K2Node_DynamicCast_AsBP_J_RPG_Character_Battle_Base; // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_Perfection_Ranks                            K2Node_CustomEvent_NewRank;                        // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E2[0x2];                                       // 0x00E2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x00E4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x00F4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAC_jRPG_BattleManager_C*               CallFunc_GetBattleManager_ReturnValue;             // 0x0108(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ABP_jRPG_Character_Battle_Base_C*       K2Node_CustomEvent_Character_1;                    // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_jRPG_Character_Battle_Base_C*       K2Node_CustomEvent_Enemy_1;                        // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_jRPG_Character_Battle_Base_C*       K2Node_CustomEvent_Character;                      // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_jRPG_Character_Battle_Base_C*       K2Node_CustomEvent_Enemy;                          // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_2;                   // 0x0138(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualsObjects_ReturnValue;                // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualsObjects_ReturnValue_1;              // 0x0141(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_142[0x6];                                      // 0x0142(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_3;                   // 0x0148(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_BattleBuff_PerfectionManager_C*     CallFunc_SpawnObject_ReturnValue;                  // 0x0150(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_jRPG_Character_Battle_Base_C*       K2Node_DynamicCast_AsBP_J_RPG_Character_Battle_Base_1; // 0x0158(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_BattleBuffInstanceWrapper_C*        CallFunc_ActivateBuff_BuffInstanceWrapper;         // 0x0168(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ActivateBuff_Success;                     // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_171[0x7];                                      // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_CustomEvent_RankDMultiplier;                // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_RankCMultiplier;                // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_RankBMultiplier;                // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_RankAMultiplier;                // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_RankSMultiplier;                // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue;               // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A4[0x4];                                      // 0x01A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_Select_Default;                             // 0x01A8(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B1[0x3];                                      // 0x01B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Map_Find_Value;                           // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B9[0x3];                                      // 0x01B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Map_Find_Value_1;                         // 0x01BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_1;                   // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C1[0x7];                                      // 0x01C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAC_jRPG_BattleManager_C*               CallFunc_GetBattleManager_ReturnValue_1;           // 0x01C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x01D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_UniqueMechanic_Perfection_C*       CallFunc_Create_ReturnValue;                       // 0x01D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x01E0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F1[0x3];                                      // 0x01F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class ABP_jRPG_Character_Battle_Base_C* Character, class ABP_jRPG_Character_Battle_Base_C* Enemy)> K2Node_CreateDelegate_OutputDelegate_4; // 0x01F4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_204[0x4];                                      // 0x0204(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    K2Node_MakeStruct_DataTableRowHandle;              // 0x0208(0x0010)(NoDestructor)
	bool                                          CallFunc_AreTutorialsEnabled_ReturnValue;          // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_219[0x7];                                      // 0x0219(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_TutorialCardParameters              K2Node_MakeStruct_S_TutorialCardParameters;        // 0x0220(0x0020)(NoDestructor, HasGetValueTypeHash)
	class UBP_TutorialSystemComponent_C*          CallFunc_GetTutorialSystemComponent_ReturnValue;   // 0x0240(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_CommonUI_InvisibleModalInputBlocker_C* CallFunc_EnableUI_InputsBlock_ReturnValue;     // 0x0248(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class ABP_jRPG_Character_Battle_Base_C* Character, class ABP_jRPG_Character_Battle_Base_C* Enemy)> K2Node_CreateDelegate_OutputDelegate_5; // 0x0250(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FDataTableRowHandle                    K2Node_MakeStruct_DataTableRowHandle_1;            // 0x0260(0x0010)(NoDestructor)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_4;                   // 0x0270(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_5;                   // 0x0278(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_jRPG_Character_Battle_Base_C*       K2Node_DynamicCast_AsBP_J_RPG_Character_Battle_Base_2; // 0x0280(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_289[0x7];                                      // 0x0289(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_jRPG_Character_Battle_Base_C*       K2Node_DynamicCast_AsBP_J_RPG_Character_Battle_Base_3; // 0x0290(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PerfectionMechanicComponent_C_ExecuteUbergraph_BP_PerfectionMechanicComponent) == 0x000008, "Wrong alignment on BP_PerfectionMechanicComponent_C_ExecuteUbergraph_BP_PerfectionMechanicComponent");
static_assert(sizeof(BP_PerfectionMechanicComponent_C_ExecuteUbergraph_BP_PerfectionMechanicComponent) == 0x0002A0, "Wrong size on BP_PerfectionMechanicComponent_C_ExecuteUbergraph_BP_PerfectionMechanicComponent");
static_assert(offsetof(BP_PerfectionMechanicComponent_C_ExecuteUbergraph_BP_PerfectionMechanicComponent, EntryPoint) == 0x000000, "Member 'BP_PerfectionMechanicComponent_C_ExecuteUbergraph_BP_PerfectionMechanicComponent::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_PerfectionMechanicComponent_C_ExecuteUbergraph_BP_PerfectionMechanicComponent, Temp_int_Variable) == 0x000004, "Member 'BP_PerfectionMechanicComponent_C_ExecuteUbergraph_BP_PerfectionMechanicComponent::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_PerfectionMechanicComponent_C_ExecuteUbergraph_BP_PerfectionMechanicComponent, Temp_int_Variable_1) == 0x000008, "Member 'BP_PerfectionMechanicComponent_C_ExecuteUbergraph_BP_PerfectionMechanicComponent::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_PerfectionMechanicComponent_C_ExecuteUbergraph_BP_PerfectionMechanicComponent, CallFunc_Conv_IntToByte_ReturnValue) == 0x00000C, "Member 'BP_PerfectionMechanicComponent_C_ExecuteUbergraph_BP_PerfectionMechanicComponent::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PerfectionMechanicComponent_C_ExecuteUbergraph_BP_PerfectionMechanicComponent, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'BP_PerfectionMechanicComponent_C_ExecuteUbergraph_BP_PerfectionMechanicComponent::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PerfectionMechanicComponent_C_ExecuteUbergraph_BP_PerfectionMechanicComponent, CallFunc_GetValidValue_ReturnValue) == 0x000014, "Member 'BP_PerfectionMechanicComponent_C_ExecuteUbergraph_BP_PerfectionMechanicComponent::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PerfectionMechanicComponent_C_ExecuteUbergraph_BP_PerfectionMechanicComponent, CallFunc_Conv_IntToByte_ReturnValue_1) == 0x000015, "Member 'BP_PerfectionMechanicComponent_C_ExecuteUbergraph_BP_PerfectionMechanicComponent::CallFunc_Conv_IntToByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PerfectionMechanicComponent_C_ExecuteUbergraph_BP_PerfectionMechanicComponent, CallFunc_GetEnumeratorValueFromIndex_ReturnValue) == 0x000016, "Member 'BP_PerfectionMechanicComponent_C_ExecuteUbergraph_BP_PerfectionMechanicComponent::CallFunc_GetEnumeratorValueFromIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PerfectionMechanicComponent_C_ExecuteUbergraph_BP_PerfectionMechanicComponent, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000018, "Member 'BP_PerfectionMechanicComponent_C_ExecuteUbergraph_BP_PerfectionMechanicComponent::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PerfectionMechanicComponent_C_ExecuteUbergraph_BP_PerfectionMechanicComponent, Temp_byte_Variable) == 0x00001C, "Member 'BP_PerfectionMechanicComponent_C_ExecuteUbergraph_BP_PerfectionMechanicComponent::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_PerfectionMechanicComponent_C_ExecuteUbergraph_BP_PerfectionMechanicComponent, Temp_real_Variable) == 0x000020, "Member 'BP_PerfectionMechanicComponent_C_ExecuteUbergraph_BP_PerfectionMechanicComponent::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(BP_PerfectionMechanicComponent_C_ExecuteUbergraph_BP_PerfectionMechanicComponent, CallFunc_MakeLiteralByte_ReturnValue) == 0x000028, "Member 'BP_PerfectionMechanicComponent_C_ExecuteUbergraph_BP_PerfectionMechanicComponent::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PerfectionMechanicComponent_C_ExecuteUbergraph_BP_PerfectionMechanicComponent, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000029, "Member 'BP_PerfectionMechanicComponent_C_ExecuteUbergraph_BP_PerfectionMechanicComponent::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PerfectionMechanicComponent_C_ExecuteUbergraph_BP_PerfectionMechanicComponent, CallFunc_GetDataTableRowFromName_OutRow) == 0x000030, "Member 'BP_PerfectionMechanicComponent_C_ExecuteUbergraph_BP_PerfectionMechanicComponent::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BP_PerfectionMechanicComponent_C_ExecuteUbergraph_BP_PerfectionMechanicComponent, CallFunc_GetDataTableRowFromName_OutRow_1) == 0x000038, "Member 'BP_PerfectionMechanicComponent_C_ExecuteUbergraph_BP_PerfectionMechanicComponent::CallFunc_GetDataTableRowFromName_OutRow_1' has a wrong offset!");
static_assert(offsetof(BP_PerfectionMechanicComponent_C_ExecuteUbergraph_BP_PerfectionMechanicComponent, CallFunc_GetDataTableRowFromName_OutRow_2) == 0x000040, "Member 'BP_PerfectionMechanicComponent_C_ExecuteUbergraph_BP_PerfectionMechanicComponent::CallFunc_GetDataTableRowFromName_OutRow_2' has a wrong offset!");
static_assert(offsetof(BP_PerfectionMechanicComponent_C_ExecuteUbergraph_BP_PerfectionMechanicComponent, CallFunc_GetDataTableRowFromName_OutRow_3) == 0x000048, "Member 'BP_PerfectionMechanicComponent_C_ExecuteUbergraph_BP_PerfectionMechanicComponent::CallFunc_GetDataTableRowFromName_OutRow_3' has a wrong offset!");
static_assert(offsetof(BP_PerfectionMechanicComponent_C_ExecuteUbergraph_BP_PerfectionMechanicComponent, CallFunc_GetDataTableRowFromName_OutRow_4) == 0x000050, "Member 'BP_PerfectionMechanicComponent_C_ExecuteUbergraph_BP_PerfectionMechanicComponent::CallFunc_GetDataTableRowFromName_OutRow_4' has a wrong offset!");
static_assert(offsetof(BP_PerfectionMechanicComponent_C_ExecuteUbergraph_BP_PerfectionMechanicComponent, Temp_name_Variable) == 0x000058, "Member 'BP_PerfectionMechanicComponent_C_ExecuteUbergraph_BP_PerfectionMechanicComponent::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(BP_PerfectionMechanicComponent_C_ExecuteUbergraph_BP_PerfectionMechanicComponent, K2Node_MakeMap_Map) == 0x000060, "Member 'BP_PerfectionMechanicComponent_C_ExecuteUbergraph_BP_PerfectionMechanicComponent::K2Node_MakeMap_Map' has a wrong offset!");
static_assert(offsetof(BP_PerfectionMechanicComponent_C_ExecuteUbergraph_BP_PerfectionMechanicComponent, CallFunc_HasPlayedTutorial_Result) == 0x0000B0, "Member 'BP_PerfectionMechanicComponent_C_ExecuteUbergraph_BP_PerfectionMechanicComponent::CallFunc_HasPlayedTutorial_Result' has a wrong offset!");
static_assert(offsetof(BP_PerfectionMechanicComponent_C_ExecuteUbergraph_BP_PerfectionMechanicComponent, CallFunc_Not_PreBool_ReturnValue) == 0x0000B1, "Member 'BP_PerfectionMechanicComponent_C_ExecuteUbergraph_BP_PerfectionMechanicComponent::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PerfectionMechanicComponent_C_ExecuteUbergraph_BP_PerfectionMechanicComponent, K2Node_CreateDelegate_OutputDelegate) == 0x0000B4, "Member 'BP_PerfectionMechanicComponent_C_ExecuteUbergraph_BP_PerfectionMechanicComponent::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_PerfectionMechanicComponent_C_ExecuteUbergraph_BP_PerfectionMechanicComponent, CallFunc_GetOwner_ReturnValue) == 0x0000C8, "Member 'BP_PerfectionMechanicComponent_C_ExecuteUbergraph_BP_PerfectionMechanicComponent::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PerfectionMechanicComponent_C_ExecuteUbergraph_BP_PerfectionMechanicComponent, K2Node_CustomEvent_NewRank_1) == 0x0000D0, "Member 'BP_PerfectionMechanicComponent_C_ExecuteUbergraph_BP_PerfectionMechanicComponent::K2Node_CustomEvent_NewRank_1' has a wrong offset!");
static_assert(offsetof(BP_PerfectionMechanicComponent_C_ExecuteUbergraph_BP_PerfectionMechanicComponent, K2Node_DynamicCast_AsBP_J_RPG_Character_Battle_Base) == 0x0000D8, "Member 'BP_PerfectionMechanicComponent_C_ExecuteUbergraph_BP_PerfectionMechanicComponent::K2Node_DynamicCast_AsBP_J_RPG_Character_Battle_Base' has a wrong offset!");
static_assert(offsetof(BP_PerfectionMechanicComponent_C_ExecuteUbergraph_BP_PerfectionMechanicComponent, K2Node_DynamicCast_bSuccess) == 0x0000E0, "Member 'BP_PerfectionMechanicComponent_C_ExecuteUbergraph_BP_PerfectionMechanicComponent::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_PerfectionMechanicComponent_C_ExecuteUbergraph_BP_PerfectionMechanicComponent, K2Node_CustomEvent_NewRank) == 0x0000E1, "Member 'BP_PerfectionMechanicComponent_C_ExecuteUbergraph_BP_PerfectionMechanicComponent::K2Node_CustomEvent_NewRank' has a wrong offset!");
static_assert(offsetof(BP_PerfectionMechanicComponent_C_ExecuteUbergraph_BP_PerfectionMechanicComponent, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000E4, "Member 'BP_PerfectionMechanicComponent_C_ExecuteUbergraph_BP_PerfectionMechanicComponent::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_PerfectionMechanicComponent_C_ExecuteUbergraph_BP_PerfectionMechanicComponent, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000F4, "Member 'BP_PerfectionMechanicComponent_C_ExecuteUbergraph_BP_PerfectionMechanicComponent::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_PerfectionMechanicComponent_C_ExecuteUbergraph_BP_PerfectionMechanicComponent, CallFunc_GetBattleManager_ReturnValue) == 0x000108, "Member 'BP_PerfectionMechanicComponent_C_ExecuteUbergraph_BP_PerfectionMechanicComponent::CallFunc_GetBattleManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PerfectionMechanicComponent_C_ExecuteUbergraph_BP_PerfectionMechanicComponent, K2Node_CustomEvent_Character_1) == 0x000110, "Member 'BP_PerfectionMechanicComponent_C_ExecuteUbergraph_BP_PerfectionMechanicComponent::K2Node_CustomEvent_Character_1' has a wrong offset!");
static_assert(offsetof(BP_PerfectionMechanicComponent_C_ExecuteUbergraph_BP_PerfectionMechanicComponent, K2Node_CustomEvent_Enemy_1) == 0x000118, "Member 'BP_PerfectionMechanicComponent_C_ExecuteUbergraph_BP_PerfectionMechanicComponent::K2Node_CustomEvent_Enemy_1' has a wrong offset!");
static_assert(offsetof(BP_PerfectionMechanicComponent_C_ExecuteUbergraph_BP_PerfectionMechanicComponent, K2Node_CustomEvent_Character) == 0x000120, "Member 'BP_PerfectionMechanicComponent_C_ExecuteUbergraph_BP_PerfectionMechanicComponent::K2Node_CustomEvent_Character' has a wrong offset!");
static_assert(offsetof(BP_PerfectionMechanicComponent_C_ExecuteUbergraph_BP_PerfectionMechanicComponent, K2Node_CustomEvent_Enemy) == 0x000128, "Member 'BP_PerfectionMechanicComponent_C_ExecuteUbergraph_BP_PerfectionMechanicComponent::K2Node_CustomEvent_Enemy' has a wrong offset!");
static_assert(offsetof(BP_PerfectionMechanicComponent_C_ExecuteUbergraph_BP_PerfectionMechanicComponent, CallFunc_GetOwner_ReturnValue_1) == 0x000130, "Member 'BP_PerfectionMechanicComponent_C_ExecuteUbergraph_BP_PerfectionMechanicComponent::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PerfectionMechanicComponent_C_ExecuteUbergraph_BP_PerfectionMechanicComponent, CallFunc_GetOwner_ReturnValue_2) == 0x000138, "Member 'BP_PerfectionMechanicComponent_C_ExecuteUbergraph_BP_PerfectionMechanicComponent::CallFunc_GetOwner_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_PerfectionMechanicComponent_C_ExecuteUbergraph_BP_PerfectionMechanicComponent, CallFunc_EqualsObjects_ReturnValue) == 0x000140, "Member 'BP_PerfectionMechanicComponent_C_ExecuteUbergraph_BP_PerfectionMechanicComponent::CallFunc_EqualsObjects_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PerfectionMechanicComponent_C_ExecuteUbergraph_BP_PerfectionMechanicComponent, CallFunc_EqualsObjects_ReturnValue_1) == 0x000141, "Member 'BP_PerfectionMechanicComponent_C_ExecuteUbergraph_BP_PerfectionMechanicComponent::CallFunc_EqualsObjects_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PerfectionMechanicComponent_C_ExecuteUbergraph_BP_PerfectionMechanicComponent, CallFunc_GetOwner_ReturnValue_3) == 0x000148, "Member 'BP_PerfectionMechanicComponent_C_ExecuteUbergraph_BP_PerfectionMechanicComponent::CallFunc_GetOwner_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_PerfectionMechanicComponent_C_ExecuteUbergraph_BP_PerfectionMechanicComponent, CallFunc_SpawnObject_ReturnValue) == 0x000150, "Member 'BP_PerfectionMechanicComponent_C_ExecuteUbergraph_BP_PerfectionMechanicComponent::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PerfectionMechanicComponent_C_ExecuteUbergraph_BP_PerfectionMechanicComponent, K2Node_DynamicCast_AsBP_J_RPG_Character_Battle_Base_1) == 0x000158, "Member 'BP_PerfectionMechanicComponent_C_ExecuteUbergraph_BP_PerfectionMechanicComponent::K2Node_DynamicCast_AsBP_J_RPG_Character_Battle_Base_1' has a wrong offset!");
static_assert(offsetof(BP_PerfectionMechanicComponent_C_ExecuteUbergraph_BP_PerfectionMechanicComponent, K2Node_DynamicCast_bSuccess_1) == 0x000160, "Member 'BP_PerfectionMechanicComponent_C_ExecuteUbergraph_BP_PerfectionMechanicComponent::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_PerfectionMechanicComponent_C_ExecuteUbergraph_BP_PerfectionMechanicComponent, CallFunc_ActivateBuff_BuffInstanceWrapper) == 0x000168, "Member 'BP_PerfectionMechanicComponent_C_ExecuteUbergraph_BP_PerfectionMechanicComponent::CallFunc_ActivateBuff_BuffInstanceWrapper' has a wrong offset!");
static_assert(offsetof(BP_PerfectionMechanicComponent_C_ExecuteUbergraph_BP_PerfectionMechanicComponent, CallFunc_ActivateBuff_Success) == 0x000170, "Member 'BP_PerfectionMechanicComponent_C_ExecuteUbergraph_BP_PerfectionMechanicComponent::CallFunc_ActivateBuff_Success' has a wrong offset!");
static_assert(offsetof(BP_PerfectionMechanicComponent_C_ExecuteUbergraph_BP_PerfectionMechanicComponent, K2Node_CustomEvent_RankDMultiplier) == 0x000178, "Member 'BP_PerfectionMechanicComponent_C_ExecuteUbergraph_BP_PerfectionMechanicComponent::K2Node_CustomEvent_RankDMultiplier' has a wrong offset!");
static_assert(offsetof(BP_PerfectionMechanicComponent_C_ExecuteUbergraph_BP_PerfectionMechanicComponent, K2Node_CustomEvent_RankCMultiplier) == 0x000180, "Member 'BP_PerfectionMechanicComponent_C_ExecuteUbergraph_BP_PerfectionMechanicComponent::K2Node_CustomEvent_RankCMultiplier' has a wrong offset!");
static_assert(offsetof(BP_PerfectionMechanicComponent_C_ExecuteUbergraph_BP_PerfectionMechanicComponent, K2Node_CustomEvent_RankBMultiplier) == 0x000188, "Member 'BP_PerfectionMechanicComponent_C_ExecuteUbergraph_BP_PerfectionMechanicComponent::K2Node_CustomEvent_RankBMultiplier' has a wrong offset!");
static_assert(offsetof(BP_PerfectionMechanicComponent_C_ExecuteUbergraph_BP_PerfectionMechanicComponent, K2Node_CustomEvent_RankAMultiplier) == 0x000190, "Member 'BP_PerfectionMechanicComponent_C_ExecuteUbergraph_BP_PerfectionMechanicComponent::K2Node_CustomEvent_RankAMultiplier' has a wrong offset!");
static_assert(offsetof(BP_PerfectionMechanicComponent_C_ExecuteUbergraph_BP_PerfectionMechanicComponent, K2Node_CustomEvent_RankSMultiplier) == 0x000198, "Member 'BP_PerfectionMechanicComponent_C_ExecuteUbergraph_BP_PerfectionMechanicComponent::K2Node_CustomEvent_RankSMultiplier' has a wrong offset!");
static_assert(offsetof(BP_PerfectionMechanicComponent_C_ExecuteUbergraph_BP_PerfectionMechanicComponent, CallFunc_MakeLiteralInt_ReturnValue) == 0x0001A0, "Member 'BP_PerfectionMechanicComponent_C_ExecuteUbergraph_BP_PerfectionMechanicComponent::CallFunc_MakeLiteralInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PerfectionMechanicComponent_C_ExecuteUbergraph_BP_PerfectionMechanicComponent, K2Node_Select_Default) == 0x0001A8, "Member 'BP_PerfectionMechanicComponent_C_ExecuteUbergraph_BP_PerfectionMechanicComponent::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_PerfectionMechanicComponent_C_ExecuteUbergraph_BP_PerfectionMechanicComponent, CallFunc_Less_IntInt_ReturnValue) == 0x0001B0, "Member 'BP_PerfectionMechanicComponent_C_ExecuteUbergraph_BP_PerfectionMechanicComponent::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PerfectionMechanicComponent_C_ExecuteUbergraph_BP_PerfectionMechanicComponent, CallFunc_Map_Find_Value) == 0x0001B4, "Member 'BP_PerfectionMechanicComponent_C_ExecuteUbergraph_BP_PerfectionMechanicComponent::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BP_PerfectionMechanicComponent_C_ExecuteUbergraph_BP_PerfectionMechanicComponent, CallFunc_Map_Find_ReturnValue) == 0x0001B8, "Member 'BP_PerfectionMechanicComponent_C_ExecuteUbergraph_BP_PerfectionMechanicComponent::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PerfectionMechanicComponent_C_ExecuteUbergraph_BP_PerfectionMechanicComponent, CallFunc_Map_Find_Value_1) == 0x0001BC, "Member 'BP_PerfectionMechanicComponent_C_ExecuteUbergraph_BP_PerfectionMechanicComponent::CallFunc_Map_Find_Value_1' has a wrong offset!");
static_assert(offsetof(BP_PerfectionMechanicComponent_C_ExecuteUbergraph_BP_PerfectionMechanicComponent, CallFunc_Map_Find_ReturnValue_1) == 0x0001C0, "Member 'BP_PerfectionMechanicComponent_C_ExecuteUbergraph_BP_PerfectionMechanicComponent::CallFunc_Map_Find_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PerfectionMechanicComponent_C_ExecuteUbergraph_BP_PerfectionMechanicComponent, CallFunc_GetBattleManager_ReturnValue_1) == 0x0001C8, "Member 'BP_PerfectionMechanicComponent_C_ExecuteUbergraph_BP_PerfectionMechanicComponent::CallFunc_GetBattleManager_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PerfectionMechanicComponent_C_ExecuteUbergraph_BP_PerfectionMechanicComponent, CallFunc_GetPlayerController_ReturnValue) == 0x0001D0, "Member 'BP_PerfectionMechanicComponent_C_ExecuteUbergraph_BP_PerfectionMechanicComponent::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PerfectionMechanicComponent_C_ExecuteUbergraph_BP_PerfectionMechanicComponent, CallFunc_Create_ReturnValue) == 0x0001D8, "Member 'BP_PerfectionMechanicComponent_C_ExecuteUbergraph_BP_PerfectionMechanicComponent::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PerfectionMechanicComponent_C_ExecuteUbergraph_BP_PerfectionMechanicComponent, K2Node_CreateDelegate_OutputDelegate_3) == 0x0001E0, "Member 'BP_PerfectionMechanicComponent_C_ExecuteUbergraph_BP_PerfectionMechanicComponent::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BP_PerfectionMechanicComponent_C_ExecuteUbergraph_BP_PerfectionMechanicComponent, K2Node_Event_EndPlayReason) == 0x0001F0, "Member 'BP_PerfectionMechanicComponent_C_ExecuteUbergraph_BP_PerfectionMechanicComponent::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BP_PerfectionMechanicComponent_C_ExecuteUbergraph_BP_PerfectionMechanicComponent, K2Node_CreateDelegate_OutputDelegate_4) == 0x0001F4, "Member 'BP_PerfectionMechanicComponent_C_ExecuteUbergraph_BP_PerfectionMechanicComponent::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(BP_PerfectionMechanicComponent_C_ExecuteUbergraph_BP_PerfectionMechanicComponent, K2Node_MakeStruct_DataTableRowHandle) == 0x000208, "Member 'BP_PerfectionMechanicComponent_C_ExecuteUbergraph_BP_PerfectionMechanicComponent::K2Node_MakeStruct_DataTableRowHandle' has a wrong offset!");
static_assert(offsetof(BP_PerfectionMechanicComponent_C_ExecuteUbergraph_BP_PerfectionMechanicComponent, CallFunc_AreTutorialsEnabled_ReturnValue) == 0x000218, "Member 'BP_PerfectionMechanicComponent_C_ExecuteUbergraph_BP_PerfectionMechanicComponent::CallFunc_AreTutorialsEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PerfectionMechanicComponent_C_ExecuteUbergraph_BP_PerfectionMechanicComponent, K2Node_MakeStruct_S_TutorialCardParameters) == 0x000220, "Member 'BP_PerfectionMechanicComponent_C_ExecuteUbergraph_BP_PerfectionMechanicComponent::K2Node_MakeStruct_S_TutorialCardParameters' has a wrong offset!");
static_assert(offsetof(BP_PerfectionMechanicComponent_C_ExecuteUbergraph_BP_PerfectionMechanicComponent, CallFunc_GetTutorialSystemComponent_ReturnValue) == 0x000240, "Member 'BP_PerfectionMechanicComponent_C_ExecuteUbergraph_BP_PerfectionMechanicComponent::CallFunc_GetTutorialSystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PerfectionMechanicComponent_C_ExecuteUbergraph_BP_PerfectionMechanicComponent, CallFunc_EnableUI_InputsBlock_ReturnValue) == 0x000248, "Member 'BP_PerfectionMechanicComponent_C_ExecuteUbergraph_BP_PerfectionMechanicComponent::CallFunc_EnableUI_InputsBlock_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PerfectionMechanicComponent_C_ExecuteUbergraph_BP_PerfectionMechanicComponent, K2Node_CreateDelegate_OutputDelegate_5) == 0x000250, "Member 'BP_PerfectionMechanicComponent_C_ExecuteUbergraph_BP_PerfectionMechanicComponent::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(BP_PerfectionMechanicComponent_C_ExecuteUbergraph_BP_PerfectionMechanicComponent, K2Node_MakeStruct_DataTableRowHandle_1) == 0x000260, "Member 'BP_PerfectionMechanicComponent_C_ExecuteUbergraph_BP_PerfectionMechanicComponent::K2Node_MakeStruct_DataTableRowHandle_1' has a wrong offset!");
static_assert(offsetof(BP_PerfectionMechanicComponent_C_ExecuteUbergraph_BP_PerfectionMechanicComponent, CallFunc_GetOwner_ReturnValue_4) == 0x000270, "Member 'BP_PerfectionMechanicComponent_C_ExecuteUbergraph_BP_PerfectionMechanicComponent::CallFunc_GetOwner_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_PerfectionMechanicComponent_C_ExecuteUbergraph_BP_PerfectionMechanicComponent, CallFunc_GetOwner_ReturnValue_5) == 0x000278, "Member 'BP_PerfectionMechanicComponent_C_ExecuteUbergraph_BP_PerfectionMechanicComponent::CallFunc_GetOwner_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_PerfectionMechanicComponent_C_ExecuteUbergraph_BP_PerfectionMechanicComponent, K2Node_DynamicCast_AsBP_J_RPG_Character_Battle_Base_2) == 0x000280, "Member 'BP_PerfectionMechanicComponent_C_ExecuteUbergraph_BP_PerfectionMechanicComponent::K2Node_DynamicCast_AsBP_J_RPG_Character_Battle_Base_2' has a wrong offset!");
static_assert(offsetof(BP_PerfectionMechanicComponent_C_ExecuteUbergraph_BP_PerfectionMechanicComponent, K2Node_DynamicCast_bSuccess_2) == 0x000288, "Member 'BP_PerfectionMechanicComponent_C_ExecuteUbergraph_BP_PerfectionMechanicComponent::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_PerfectionMechanicComponent_C_ExecuteUbergraph_BP_PerfectionMechanicComponent, K2Node_DynamicCast_AsBP_J_RPG_Character_Battle_Base_3) == 0x000290, "Member 'BP_PerfectionMechanicComponent_C_ExecuteUbergraph_BP_PerfectionMechanicComponent::K2Node_DynamicCast_AsBP_J_RPG_Character_Battle_Base_3' has a wrong offset!");
static_assert(offsetof(BP_PerfectionMechanicComponent_C_ExecuteUbergraph_BP_PerfectionMechanicComponent, K2Node_DynamicCast_bSuccess_3) == 0x000298, "Member 'BP_PerfectionMechanicComponent_C_ExecuteUbergraph_BP_PerfectionMechanicComponent::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");

// Function BP_PerfectionMechanicComponent.BP_PerfectionMechanicComponent_C.Get Rank from Perfection
// 0x0140 (0x0140 - 0x0000)
struct BP_PerfectionMechanicComponent_C_Get_Rank_from_Perfection final
{
public:
	int32                                         PerfectionInput;                                   // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_Perfection_Ranks                            Value;                                             // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 local_sortedKeys;                                  // 0x0008(0x0010)(Edit, BlueprintVisible)
	TArray<int32>                                 Temp_wildcard_Result_array_Variable;               // 0x0018(0x0010)(ConstParm, ReferenceParm)
	TArray<double>                                Temp_real_Variable;                                // 0x0028(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_MinOfFloatArray_IndexOfMinValue;          // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MinOfFloatArray_MinValue;                 // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<int32, int32>                            Temp_wildcard_RemapTable_Variable;                 // 0x0048(0x0050)(ConstParm)
	int32                                         Temp_int_NextIndex_Variable;                       // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 Temp_wildcard_Original_index_Variable;             // 0x00A8(0x0010)(ConstParm, ReferenceParm)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Get_Item;                           // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x3];                                       // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Get_Item_1;                         // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D3[0x1];                                       // 0x00D3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 CallFunc_Map_Keys_Keys;                            // 0x00D8(0x0010)(ReferenceParm)
	int32                                         Temp_int_Variable;                                 // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 CallFunc_Array_Remap_ResultArray;                  // 0x00F0(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_2;                  // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_121[0x3];                                      // 0x0121(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_Perfection_Ranks                            CallFunc_Map_Find_Value;                           // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12A[0x6];                                      // 0x012A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 CallFunc_MinOfFloatArray_FloatArray_ImplicitCast;  // 0x0130(0x0010)(ConstParm, ReferenceParm)
};
static_assert(alignof(BP_PerfectionMechanicComponent_C_Get_Rank_from_Perfection) == 0x000008, "Wrong alignment on BP_PerfectionMechanicComponent_C_Get_Rank_from_Perfection");
static_assert(sizeof(BP_PerfectionMechanicComponent_C_Get_Rank_from_Perfection) == 0x000140, "Wrong size on BP_PerfectionMechanicComponent_C_Get_Rank_from_Perfection");
static_assert(offsetof(BP_PerfectionMechanicComponent_C_Get_Rank_from_Perfection, PerfectionInput) == 0x000000, "Member 'BP_PerfectionMechanicComponent_C_Get_Rank_from_Perfection::PerfectionInput' has a wrong offset!");
static_assert(offsetof(BP_PerfectionMechanicComponent_C_Get_Rank_from_Perfection, Value) == 0x000004, "Member 'BP_PerfectionMechanicComponent_C_Get_Rank_from_Perfection::Value' has a wrong offset!");
static_assert(offsetof(BP_PerfectionMechanicComponent_C_Get_Rank_from_Perfection, local_sortedKeys) == 0x000008, "Member 'BP_PerfectionMechanicComponent_C_Get_Rank_from_Perfection::local_sortedKeys' has a wrong offset!");
static_assert(offsetof(BP_PerfectionMechanicComponent_C_Get_Rank_from_Perfection, Temp_wildcard_Result_array_Variable) == 0x000018, "Member 'BP_PerfectionMechanicComponent_C_Get_Rank_from_Perfection::Temp_wildcard_Result_array_Variable' has a wrong offset!");
static_assert(offsetof(BP_PerfectionMechanicComponent_C_Get_Rank_from_Perfection, Temp_real_Variable) == 0x000028, "Member 'BP_PerfectionMechanicComponent_C_Get_Rank_from_Perfection::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(BP_PerfectionMechanicComponent_C_Get_Rank_from_Perfection, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'BP_PerfectionMechanicComponent_C_Get_Rank_from_Perfection::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PerfectionMechanicComponent_C_Get_Rank_from_Perfection, CallFunc_Greater_IntInt_ReturnValue) == 0x00003C, "Member 'BP_PerfectionMechanicComponent_C_Get_Rank_from_Perfection::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PerfectionMechanicComponent_C_Get_Rank_from_Perfection, CallFunc_MinOfFloatArray_IndexOfMinValue) == 0x000040, "Member 'BP_PerfectionMechanicComponent_C_Get_Rank_from_Perfection::CallFunc_MinOfFloatArray_IndexOfMinValue' has a wrong offset!");
static_assert(offsetof(BP_PerfectionMechanicComponent_C_Get_Rank_from_Perfection, CallFunc_MinOfFloatArray_MinValue) == 0x000044, "Member 'BP_PerfectionMechanicComponent_C_Get_Rank_from_Perfection::CallFunc_MinOfFloatArray_MinValue' has a wrong offset!");
static_assert(offsetof(BP_PerfectionMechanicComponent_C_Get_Rank_from_Perfection, Temp_wildcard_RemapTable_Variable) == 0x000048, "Member 'BP_PerfectionMechanicComponent_C_Get_Rank_from_Perfection::Temp_wildcard_RemapTable_Variable' has a wrong offset!");
static_assert(offsetof(BP_PerfectionMechanicComponent_C_Get_Rank_from_Perfection, Temp_int_NextIndex_Variable) == 0x000098, "Member 'BP_PerfectionMechanicComponent_C_Get_Rank_from_Perfection::Temp_int_NextIndex_Variable' has a wrong offset!");
static_assert(offsetof(BP_PerfectionMechanicComponent_C_Get_Rank_from_Perfection, Temp_int_Array_Index_Variable) == 0x00009C, "Member 'BP_PerfectionMechanicComponent_C_Get_Rank_from_Perfection::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_PerfectionMechanicComponent_C_Get_Rank_from_Perfection, CallFunc_Add_IntInt_ReturnValue) == 0x0000A0, "Member 'BP_PerfectionMechanicComponent_C_Get_Rank_from_Perfection::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PerfectionMechanicComponent_C_Get_Rank_from_Perfection, Temp_wildcard_Original_index_Variable) == 0x0000A8, "Member 'BP_PerfectionMechanicComponent_C_Get_Rank_from_Perfection::Temp_wildcard_Original_index_Variable' has a wrong offset!");
static_assert(offsetof(BP_PerfectionMechanicComponent_C_Get_Rank_from_Perfection, Temp_bool_True_if_break_was_hit_Variable) == 0x0000B8, "Member 'BP_PerfectionMechanicComponent_C_Get_Rank_from_Perfection::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(BP_PerfectionMechanicComponent_C_Get_Rank_from_Perfection, CallFunc_Array_Get_Item) == 0x0000BC, "Member 'BP_PerfectionMechanicComponent_C_Get_Rank_from_Perfection::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_PerfectionMechanicComponent_C_Get_Rank_from_Perfection, CallFunc_Not_PreBool_ReturnValue) == 0x0000C0, "Member 'BP_PerfectionMechanicComponent_C_Get_Rank_from_Perfection::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PerfectionMechanicComponent_C_Get_Rank_from_Perfection, Temp_int_Loop_Counter_Variable) == 0x0000C4, "Member 'BP_PerfectionMechanicComponent_C_Get_Rank_from_Perfection::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_PerfectionMechanicComponent_C_Get_Rank_from_Perfection, CallFunc_Array_Get_Item_1) == 0x0000C8, "Member 'BP_PerfectionMechanicComponent_C_Get_Rank_from_Perfection::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_PerfectionMechanicComponent_C_Get_Rank_from_Perfection, CallFunc_Array_Length_ReturnValue_1) == 0x0000CC, "Member 'BP_PerfectionMechanicComponent_C_Get_Rank_from_Perfection::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PerfectionMechanicComponent_C_Get_Rank_from_Perfection, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x0000D0, "Member 'BP_PerfectionMechanicComponent_C_Get_Rank_from_Perfection::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PerfectionMechanicComponent_C_Get_Rank_from_Perfection, CallFunc_Less_IntInt_ReturnValue) == 0x0000D1, "Member 'BP_PerfectionMechanicComponent_C_Get_Rank_from_Perfection::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PerfectionMechanicComponent_C_Get_Rank_from_Perfection, CallFunc_BooleanAND_ReturnValue) == 0x0000D2, "Member 'BP_PerfectionMechanicComponent_C_Get_Rank_from_Perfection::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
