#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PictoViewItem

#include "Basic.hpp"

#include "FCharacterAssignedEquipment_structs.hpp"
#include "S_jRPG_Item_DynamicData_structs.hpp"


namespace SDK::Params
{

// Function BP_PictoViewItem.BP_PictoViewItem_C.ExecuteUbergraph_BP_PictoViewItem
// 0x0004 (0x0004 - 0x0000)
struct BP_PictoViewItem_C_ExecuteUbergraph_BP_PictoViewItem final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PictoViewItem_C_ExecuteUbergraph_BP_PictoViewItem) == 0x000004, "Wrong alignment on BP_PictoViewItem_C_ExecuteUbergraph_BP_PictoViewItem");
static_assert(sizeof(BP_PictoViewItem_C_ExecuteUbergraph_BP_PictoViewItem) == 0x000004, "Wrong size on BP_PictoViewItem_C_ExecuteUbergraph_BP_PictoViewItem");
static_assert(offsetof(BP_PictoViewItem_C_ExecuteUbergraph_BP_PictoViewItem, EntryPoint) == 0x000000, "Member 'BP_PictoViewItem_C_ExecuteUbergraph_BP_PictoViewItem::EntryPoint' has a wrong offset!");

// Function BP_PictoViewItem.BP_PictoViewItem_C.GetCurrentCharacterData
// 0x0008 (0x0008 - 0x0000)
struct BP_PictoViewItem_C_GetCurrentCharacterData final
{
public:
	class UBP_CharacterData_C*                    CurrentCharacterData_0;                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PictoViewItem_C_GetCurrentCharacterData) == 0x000008, "Wrong alignment on BP_PictoViewItem_C_GetCurrentCharacterData");
static_assert(sizeof(BP_PictoViewItem_C_GetCurrentCharacterData) == 0x000008, "Wrong size on BP_PictoViewItem_C_GetCurrentCharacterData");
static_assert(offsetof(BP_PictoViewItem_C_GetCurrentCharacterData, CurrentCharacterData_0) == 0x000000, "Member 'BP_PictoViewItem_C_GetCurrentCharacterData::CurrentCharacterData_0' has a wrong offset!");

// Function BP_PictoViewItem.BP_PictoViewItem_C.GetGearPictosInstance
// 0x0020 (0x0020 - 0x0000)
struct BP_PictoViewItem_C_GetGearPictosInstance final
{
public:
	class UBP_ItemInstance_Gear_Pictos_C*         AsBP_Item_Instance_Gear_Pictos;                    // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_ItemInstance_Base_C*                CallFunc_FindItemInstanceByID_ItemInstance;        // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_ItemInstance_Gear_Pictos_C*         K2Node_DynamicCast_AsBP_Item_Instance_Gear_Pictos; // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PictoViewItem_C_GetGearPictosInstance) == 0x000008, "Wrong alignment on BP_PictoViewItem_C_GetGearPictosInstance");
static_assert(sizeof(BP_PictoViewItem_C_GetGearPictosInstance) == 0x000020, "Wrong size on BP_PictoViewItem_C_GetGearPictosInstance");
static_assert(offsetof(BP_PictoViewItem_C_GetGearPictosInstance, AsBP_Item_Instance_Gear_Pictos) == 0x000000, "Member 'BP_PictoViewItem_C_GetGearPictosInstance::AsBP_Item_Instance_Gear_Pictos' has a wrong offset!");
static_assert(offsetof(BP_PictoViewItem_C_GetGearPictosInstance, CallFunc_FindItemInstanceByID_ItemInstance) == 0x000008, "Member 'BP_PictoViewItem_C_GetGearPictosInstance::CallFunc_FindItemInstanceByID_ItemInstance' has a wrong offset!");
static_assert(offsetof(BP_PictoViewItem_C_GetGearPictosInstance, K2Node_DynamicCast_AsBP_Item_Instance_Gear_Pictos) == 0x000010, "Member 'BP_PictoViewItem_C_GetGearPictosInstance::K2Node_DynamicCast_AsBP_Item_Instance_Gear_Pictos' has a wrong offset!");
static_assert(offsetof(BP_PictoViewItem_C_GetGearPictosInstance, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_PictoViewItem_C_GetGearPictosInstance::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BP_PictoViewItem.BP_PictoViewItem_C.GetItemDynamicData
// 0x0138 (0x0138 - 0x0000)
struct BP_PictoViewItem_C_GetItemDynamicData final
{
public:
	struct FS_jRPG_Item_DynamicData               ItemDynamicData_0;                                 // 0x0000(0x0138)(Parm, OutParm, ContainsInstancedReference, HasGetValueTypeHash)
};
static_assert(alignof(BP_PictoViewItem_C_GetItemDynamicData) == 0x000008, "Wrong alignment on BP_PictoViewItem_C_GetItemDynamicData");
static_assert(sizeof(BP_PictoViewItem_C_GetItemDynamicData) == 0x000138, "Wrong size on BP_PictoViewItem_C_GetItemDynamicData");
static_assert(offsetof(BP_PictoViewItem_C_GetItemDynamicData, ItemDynamicData_0) == 0x000000, "Member 'BP_PictoViewItem_C_GetItemDynamicData::ItemDynamicData_0' has a wrong offset!");

// Function BP_PictoViewItem.BP_PictoViewItem_C.GetOwnerData
// 0x0038 (0x0038 - 0x0000)
struct BP_PictoViewItem_C_GetOwnerData final
{
public:
	class UBP_CharacterData_C*                    OwnerData;                                         // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_CharacterData_C*                    Temp_object_Variable;                              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFCharacterAssignedEquipment>   CallFunc_GetCharactersWithItemEquipped_AssignedEquipment; // 0x0018(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_CharacterData_C*                    K2Node_Select_Default;                             // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PictoViewItem_C_GetOwnerData) == 0x000008, "Wrong alignment on BP_PictoViewItem_C_GetOwnerData");
static_assert(sizeof(BP_PictoViewItem_C_GetOwnerData) == 0x000038, "Wrong size on BP_PictoViewItem_C_GetOwnerData");
static_assert(offsetof(BP_PictoViewItem_C_GetOwnerData, OwnerData) == 0x000000, "Member 'BP_PictoViewItem_C_GetOwnerData::OwnerData' has a wrong offset!");
static_assert(offsetof(BP_PictoViewItem_C_GetOwnerData, Temp_bool_Variable) == 0x000008, "Member 'BP_PictoViewItem_C_GetOwnerData::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_PictoViewItem_C_GetOwnerData, Temp_object_Variable) == 0x000010, "Member 'BP_PictoViewItem_C_GetOwnerData::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_PictoViewItem_C_GetOwnerData, CallFunc_GetCharactersWithItemEquipped_AssignedEquipment) == 0x000018, "Member 'BP_PictoViewItem_C_GetOwnerData::CallFunc_GetCharactersWithItemEquipped_AssignedEquipment' has a wrong offset!");
static_assert(offsetof(BP_PictoViewItem_C_GetOwnerData, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'BP_PictoViewItem_C_GetOwnerData::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PictoViewItem_C_GetOwnerData, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00002C, "Member 'BP_PictoViewItem_C_GetOwnerData::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PictoViewItem_C_GetOwnerData, K2Node_Select_Default) == 0x000030, "Member 'BP_PictoViewItem_C_GetOwnerData::K2Node_Select_Default' has a wrong offset!");

// Function BP_PictoViewItem.BP_PictoViewItem_C.IsEquippedByCurrentCharacter
// 0x0020 (0x0020 - 0x0000)
struct BP_PictoViewItem_C_IsEquippedByCurrentCharacter final
{
public:
	bool                                          IsEquipped;                                        // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_CharacterData_C*                    CallFunc_GetCurrentCharacterData_CurrentCharacterData; // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_CharacterData_C*                    CallFunc_GetOwnerData_OwnerData;                   // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PictoViewItem_C_IsEquippedByCurrentCharacter) == 0x000008, "Wrong alignment on BP_PictoViewItem_C_IsEquippedByCurrentCharacter");
static_assert(sizeof(BP_PictoViewItem_C_IsEquippedByCurrentCharacter) == 0x000020, "Wrong size on BP_PictoViewItem_C_IsEquippedByCurrentCharacter");
static_assert(offsetof(BP_PictoViewItem_C_IsEquippedByCurrentCharacter, IsEquipped) == 0x000000, "Member 'BP_PictoViewItem_C_IsEquippedByCurrentCharacter::IsEquipped' has a wrong offset!");
static_assert(offsetof(BP_PictoViewItem_C_IsEquippedByCurrentCharacter, CallFunc_GetCurrentCharacterData_CurrentCharacterData) == 0x000008, "Member 'BP_PictoViewItem_C_IsEquippedByCurrentCharacter::CallFunc_GetCurrentCharacterData_CurrentCharacterData' has a wrong offset!");
static_assert(offsetof(BP_PictoViewItem_C_IsEquippedByCurrentCharacter, CallFunc_GetOwnerData_OwnerData) == 0x000010, "Member 'BP_PictoViewItem_C_IsEquippedByCurrentCharacter::CallFunc_GetOwnerData_OwnerData' has a wrong offset!");
static_assert(offsetof(BP_PictoViewItem_C_IsEquippedByCurrentCharacter, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000018, "Member 'BP_PictoViewItem_C_IsEquippedByCurrentCharacter::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");

}

