#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Pawn_AICompanion_Maelle

#include "Basic.hpp"

#include "BP_Pawn_AICompanion_classes.hpp"
#include "E_CharacterList_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Pawn_AICompanion_Maelle.BP_Pawn_AICompanion_Maelle_C
// 0x0030 (0x0B40 - 0x0B10)
class ABP_Pawn_AICompanion_Maelle_C final : public ABP_Pawn_AICompanion_C
{
public:
	uint8                                         Pad_B03[0x5];                                      // 0x0B03(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UGroomComponent*                        Hair2;                                             // 0x0B08(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Haircut_SkeletalMesh2;                             // 0x0B10(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UGroomComponent*                        Mustache2;                                         // 0x0B18(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UGroomComponent*                        Fuzz2;                                             // 0x0B20(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UGroomComponent*                        Beard2;                                            // 0x0B28(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UGroomComponent*                        Eyelashes2;                                        // 0x0B30(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UGroomComponent*                        Eyebrows2;                                         // 0x0B38(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	E_CharacterList GetCharacterEnum();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Pawn_AICompanion_Maelle_C">();
	}
	static class ABP_Pawn_AICompanion_Maelle_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Pawn_AICompanion_Maelle_C>();
	}
};
static_assert(alignof(ABP_Pawn_AICompanion_Maelle_C) == 0x000010, "Wrong alignment on ABP_Pawn_AICompanion_Maelle_C");
static_assert(sizeof(ABP_Pawn_AICompanion_Maelle_C) == 0x000B40, "Wrong size on ABP_Pawn_AICompanion_Maelle_C");
static_assert(offsetof(ABP_Pawn_AICompanion_Maelle_C, Hair2) == 0x000B08, "Member 'ABP_Pawn_AICompanion_Maelle_C::Hair2' has a wrong offset!");
static_assert(offsetof(ABP_Pawn_AICompanion_Maelle_C, Haircut_SkeletalMesh2) == 0x000B10, "Member 'ABP_Pawn_AICompanion_Maelle_C::Haircut_SkeletalMesh2' has a wrong offset!");
static_assert(offsetof(ABP_Pawn_AICompanion_Maelle_C, Mustache2) == 0x000B18, "Member 'ABP_Pawn_AICompanion_Maelle_C::Mustache2' has a wrong offset!");
static_assert(offsetof(ABP_Pawn_AICompanion_Maelle_C, Fuzz2) == 0x000B20, "Member 'ABP_Pawn_AICompanion_Maelle_C::Fuzz2' has a wrong offset!");
static_assert(offsetof(ABP_Pawn_AICompanion_Maelle_C, Beard2) == 0x000B28, "Member 'ABP_Pawn_AICompanion_Maelle_C::Beard2' has a wrong offset!");
static_assert(offsetof(ABP_Pawn_AICompanion_Maelle_C, Eyelashes2) == 0x000B30, "Member 'ABP_Pawn_AICompanion_Maelle_C::Eyelashes2' has a wrong offset!");
static_assert(offsetof(ABP_Pawn_AICompanion_Maelle_C, Eyebrows2) == 0x000B38, "Member 'ABP_Pawn_AICompanion_Maelle_C::Eyebrows2' has a wrong offset!");

}

