#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Pawn_AICompanion_Lune

#include "Basic.hpp"

#include "BP_Pawn_AICompanion_classes.hpp"
#include "E_CharacterList_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Pawn_AICompanion_Lune.BP_Pawn_AICompanion_Lune_C
// 0x0010 (0x0B20 - 0x0B10)
class ABP_Pawn_AICompanion_Lune_C final : public ABP_Pawn_AICompanion_C
{
public:
	uint8                                         Pad_B03[0x5];                                      // 0x0B03(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UGroomComponent*                        Eyebrows;                                          // 0x0B08(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UGroomComponent*                        Eyelashes;                                         // 0x0B10(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Hair_Lune_skl;                                     // 0x0B18(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	E_CharacterList GetCharacterEnum();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Pawn_AICompanion_Lune_C">();
	}
	static class ABP_Pawn_AICompanion_Lune_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Pawn_AICompanion_Lune_C>();
	}
};
static_assert(alignof(ABP_Pawn_AICompanion_Lune_C) == 0x000010, "Wrong alignment on ABP_Pawn_AICompanion_Lune_C");
static_assert(sizeof(ABP_Pawn_AICompanion_Lune_C) == 0x000B20, "Wrong size on ABP_Pawn_AICompanion_Lune_C");
static_assert(offsetof(ABP_Pawn_AICompanion_Lune_C, Eyebrows) == 0x000B08, "Member 'ABP_Pawn_AICompanion_Lune_C::Eyebrows' has a wrong offset!");
static_assert(offsetof(ABP_Pawn_AICompanion_Lune_C, Eyelashes) == 0x000B10, "Member 'ABP_Pawn_AICompanion_Lune_C::Eyelashes' has a wrong offset!");
static_assert(offsetof(ABP_Pawn_AICompanion_Lune_C, Hair_Lune_skl) == 0x000B18, "Member 'ABP_Pawn_AICompanion_Lune_C::Hair_Lune_skl' has a wrong offset!");

}

