#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Pawn_AICompanion_Noah

#include "Basic.hpp"

#include "BP_Pawn_AICompanion_classes.hpp"
#include "E_CharacterList_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Pawn_AICompanion_Noah.BP_Pawn_AICompanion_Noah_C
// 0x0030 (0x0B40 - 0x0B10)
class ABP_Pawn_AICompanion_Noah_C final : public ABP_Pawn_AICompanion_C
{
public:
	uint8                                         Pad_B03[0x5];                                      // 0x0B03(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UGroomComponent*                        Beard;                                             // 0x0B08(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UGroomComponent*                        Mustache;                                          // 0x0B10(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UGroomComponent*                        Eyelashes;                                         // 0x0B18(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UGroomComponent*                        Eyebrows;                                          // 0x0B20(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Haircut_SkeletalMesh;                              // 0x0B28(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Haircut_StaticMesh;                                // 0x0B30(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	E_CharacterList GetCharacterEnum();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Pawn_AICompanion_Noah_C">();
	}
	static class ABP_Pawn_AICompanion_Noah_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Pawn_AICompanion_Noah_C>();
	}
};
static_assert(alignof(ABP_Pawn_AICompanion_Noah_C) == 0x000010, "Wrong alignment on ABP_Pawn_AICompanion_Noah_C");
static_assert(sizeof(ABP_Pawn_AICompanion_Noah_C) == 0x000B40, "Wrong size on ABP_Pawn_AICompanion_Noah_C");
static_assert(offsetof(ABP_Pawn_AICompanion_Noah_C, Beard) == 0x000B08, "Member 'ABP_Pawn_AICompanion_Noah_C::Beard' has a wrong offset!");
static_assert(offsetof(ABP_Pawn_AICompanion_Noah_C, Mustache) == 0x000B10, "Member 'ABP_Pawn_AICompanion_Noah_C::Mustache' has a wrong offset!");
static_assert(offsetof(ABP_Pawn_AICompanion_Noah_C, Eyelashes) == 0x000B18, "Member 'ABP_Pawn_AICompanion_Noah_C::Eyelashes' has a wrong offset!");
static_assert(offsetof(ABP_Pawn_AICompanion_Noah_C, Eyebrows) == 0x000B20, "Member 'ABP_Pawn_AICompanion_Noah_C::Eyebrows' has a wrong offset!");
static_assert(offsetof(ABP_Pawn_AICompanion_Noah_C, Haircut_SkeletalMesh) == 0x000B28, "Member 'ABP_Pawn_AICompanion_Noah_C::Haircut_SkeletalMesh' has a wrong offset!");
static_assert(offsetof(ABP_Pawn_AICompanion_Noah_C, Haircut_StaticMesh) == 0x000B30, "Member 'ABP_Pawn_AICompanion_Noah_C::Haircut_StaticMesh' has a wrong offset!");

}

