#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PassiveEffectInstance

#include "Basic.hpp"

#include "SandFall_classes.hpp"
#include "Engine_structs.hpp"
#include "FPassiveEffect_structs.hpp"
#include "S_jRPG_Item_StaticData_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_PassiveEffectInstance.BP_PassiveEffectInstance_C
// 0x01B0 (0x01D8 - 0x0028)
class UBP_PassiveEffectInstance_C final : public UExtendedObject
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0028(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class FName                                   PassiveEffectID;                                   // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FFPassiveEffect                        PassiveDefinition;                                 // 0x0038(0x0048)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class UBP_CharacterData_C*                    OwnerData;                                         // 0x0080(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          bIsFromGear;                                       // 0x0088(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_jRPG_Item_StaticData                OwningGearData;                                    // 0x0090(0x0130)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          bIsHighlighted;                                    // 0x01C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C1[0x7];                                      // 0x01C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(bool IsHighlighted)> OnHighlightedStateChanged;                    // 0x01C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void BPI_OnMarkNotificationAsRead(class UUserWidget* MarkCaller);
	void BPI_ShouldShowNotification(bool* bShouldShow);
	void ExecuteUbergraph_BP_PassiveEffectInstance(int32 EntryPoint);
	void GetOwnerData(class UBP_CharacterData_C** NewParam);
	void GetOwningGearData(struct FS_jRPG_Item_StaticData* OutOwningGearData);
	struct FFPassiveEffect GetPassiveEffectDefinition();
	class FName GetPassiveEffectID();
	void Initialize();
	void IsEquipped(bool* IsEquipped_0);
	void IsForbidden(bool* IsForbidden_0);
	void IsFromGear(bool* IsFromGear_0);
	void IsHighlighted(bool* bIsHighlighted_0);
	void SetHighlighted(bool bInIsHighlighted);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_PassiveEffectInstance_C">();
	}
	static class UBP_PassiveEffectInstance_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_PassiveEffectInstance_C>();
	}
};
static_assert(alignof(UBP_PassiveEffectInstance_C) == 0x000008, "Wrong alignment on UBP_PassiveEffectInstance_C");
static_assert(sizeof(UBP_PassiveEffectInstance_C) == 0x0001D8, "Wrong size on UBP_PassiveEffectInstance_C");
static_assert(offsetof(UBP_PassiveEffectInstance_C, UberGraphFrame) == 0x000028, "Member 'UBP_PassiveEffectInstance_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_PassiveEffectInstance_C, PassiveEffectID) == 0x000030, "Member 'UBP_PassiveEffectInstance_C::PassiveEffectID' has a wrong offset!");
static_assert(offsetof(UBP_PassiveEffectInstance_C, PassiveDefinition) == 0x000038, "Member 'UBP_PassiveEffectInstance_C::PassiveDefinition' has a wrong offset!");
static_assert(offsetof(UBP_PassiveEffectInstance_C, OwnerData) == 0x000080, "Member 'UBP_PassiveEffectInstance_C::OwnerData' has a wrong offset!");
static_assert(offsetof(UBP_PassiveEffectInstance_C, bIsFromGear) == 0x000088, "Member 'UBP_PassiveEffectInstance_C::bIsFromGear' has a wrong offset!");
static_assert(offsetof(UBP_PassiveEffectInstance_C, OwningGearData) == 0x000090, "Member 'UBP_PassiveEffectInstance_C::OwningGearData' has a wrong offset!");
static_assert(offsetof(UBP_PassiveEffectInstance_C, bIsHighlighted) == 0x0001C0, "Member 'UBP_PassiveEffectInstance_C::bIsHighlighted' has a wrong offset!");
static_assert(offsetof(UBP_PassiveEffectInstance_C, OnHighlightedStateChanged) == 0x0001C8, "Member 'UBP_PassiveEffectInstance_C::OnHighlightedStateChanged' has a wrong offset!");

}

