#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PaintCageLayer_Master

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_PaintCageLayer_Master.BP_PaintCageLayer_Master_C.PaintCageLayer_Disappear
// 0x0001 (0x0001 - 0x0000)
struct BP_PaintCageLayer_Master_C_PaintCageLayer_Disappear final
{
public:
	bool                                          Instant;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PaintCageLayer_Master_C_PaintCageLayer_Disappear) == 0x000001, "Wrong alignment on BP_PaintCageLayer_Master_C_PaintCageLayer_Disappear");
static_assert(sizeof(BP_PaintCageLayer_Master_C_PaintCageLayer_Disappear) == 0x000001, "Wrong size on BP_PaintCageLayer_Master_C_PaintCageLayer_Disappear");
static_assert(offsetof(BP_PaintCageLayer_Master_C_PaintCageLayer_Disappear, Instant) == 0x000000, "Member 'BP_PaintCageLayer_Master_C_PaintCageLayer_Disappear::Instant' has a wrong offset!");

// Function BP_PaintCageLayer_Master.BP_PaintCageLayer_Master_C.ExecuteUbergraph_BP_PaintCageLayer_Master
// 0x0020 (0x0020 - 0x0000)
struct BP_PaintCageLayer_Master_C_ExecuteUbergraph_BP_PaintCageLayer_Master final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Lerp_ReturnValue;                         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_Alpha_ImplicitCast;                  // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValueOnMaterials_ParameterValue_ImplicitCast; // 0x0018(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PaintCageLayer_Master_C_ExecuteUbergraph_BP_PaintCageLayer_Master) == 0x000008, "Wrong alignment on BP_PaintCageLayer_Master_C_ExecuteUbergraph_BP_PaintCageLayer_Master");
static_assert(sizeof(BP_PaintCageLayer_Master_C_ExecuteUbergraph_BP_PaintCageLayer_Master) == 0x000020, "Wrong size on BP_PaintCageLayer_Master_C_ExecuteUbergraph_BP_PaintCageLayer_Master");
static_assert(offsetof(BP_PaintCageLayer_Master_C_ExecuteUbergraph_BP_PaintCageLayer_Master, EntryPoint) == 0x000000, "Member 'BP_PaintCageLayer_Master_C_ExecuteUbergraph_BP_PaintCageLayer_Master::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_PaintCageLayer_Master_C_ExecuteUbergraph_BP_PaintCageLayer_Master, CallFunc_Lerp_ReturnValue) == 0x000008, "Member 'BP_PaintCageLayer_Master_C_ExecuteUbergraph_BP_PaintCageLayer_Master::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PaintCageLayer_Master_C_ExecuteUbergraph_BP_PaintCageLayer_Master, CallFunc_Lerp_Alpha_ImplicitCast) == 0x000010, "Member 'BP_PaintCageLayer_Master_C_ExecuteUbergraph_BP_PaintCageLayer_Master::CallFunc_Lerp_Alpha_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_PaintCageLayer_Master_C_ExecuteUbergraph_BP_PaintCageLayer_Master, CallFunc_SetScalarParameterValueOnMaterials_ParameterValue_ImplicitCast) == 0x000018, "Member 'BP_PaintCageLayer_Master_C_ExecuteUbergraph_BP_PaintCageLayer_Master::CallFunc_SetScalarParameterValueOnMaterials_ParameterValue_ImplicitCast' has a wrong offset!");

}

