#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PP_DistortionParameterControl

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_PP_DistortionParameterControl.BP_PP_DistortionParameterControl_C.ExecuteUbergraph_BP_PP_DistortionParameterControl
// 0x0048 (0x0048 - 0x0000)
struct BP_PP_DistortionParameterControl_C_ExecuteUbergraph_BP_PP_DistortionParameterControl final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_CustomEvent_Speed;                          // 0x0008(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_Speed_1;                        // 0x0010(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_DistortionValue;                // 0x0018(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_HardnessValue;                  // 0x0020(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue;                         // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetPlayRate_NewRate_ImplicitCast;         // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Lerp_Alpha_ImplicitCast;                  // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetPlayRate_NewRate_ImplicitCast_1;       // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PP_DistortionParameterControl_C_ExecuteUbergraph_BP_PP_DistortionParameterControl) == 0x000008, "Wrong alignment on BP_PP_DistortionParameterControl_C_ExecuteUbergraph_BP_PP_DistortionParameterControl");
static_assert(sizeof(BP_PP_DistortionParameterControl_C_ExecuteUbergraph_BP_PP_DistortionParameterControl) == 0x000048, "Wrong size on BP_PP_DistortionParameterControl_C_ExecuteUbergraph_BP_PP_DistortionParameterControl");
static_assert(offsetof(BP_PP_DistortionParameterControl_C_ExecuteUbergraph_BP_PP_DistortionParameterControl, EntryPoint) == 0x000000, "Member 'BP_PP_DistortionParameterControl_C_ExecuteUbergraph_BP_PP_DistortionParameterControl::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_PP_DistortionParameterControl_C_ExecuteUbergraph_BP_PP_DistortionParameterControl, K2Node_CustomEvent_Speed) == 0x000008, "Member 'BP_PP_DistortionParameterControl_C_ExecuteUbergraph_BP_PP_DistortionParameterControl::K2Node_CustomEvent_Speed' has a wrong offset!");
static_assert(offsetof(BP_PP_DistortionParameterControl_C_ExecuteUbergraph_BP_PP_DistortionParameterControl, K2Node_CustomEvent_Speed_1) == 0x000010, "Member 'BP_PP_DistortionParameterControl_C_ExecuteUbergraph_BP_PP_DistortionParameterControl::K2Node_CustomEvent_Speed_1' has a wrong offset!");
static_assert(offsetof(BP_PP_DistortionParameterControl_C_ExecuteUbergraph_BP_PP_DistortionParameterControl, K2Node_CustomEvent_DistortionValue) == 0x000018, "Member 'BP_PP_DistortionParameterControl_C_ExecuteUbergraph_BP_PP_DistortionParameterControl::K2Node_CustomEvent_DistortionValue' has a wrong offset!");
static_assert(offsetof(BP_PP_DistortionParameterControl_C_ExecuteUbergraph_BP_PP_DistortionParameterControl, K2Node_CustomEvent_HardnessValue) == 0x000020, "Member 'BP_PP_DistortionParameterControl_C_ExecuteUbergraph_BP_PP_DistortionParameterControl::K2Node_CustomEvent_HardnessValue' has a wrong offset!");
static_assert(offsetof(BP_PP_DistortionParameterControl_C_ExecuteUbergraph_BP_PP_DistortionParameterControl, CallFunc_Lerp_ReturnValue) == 0x000028, "Member 'BP_PP_DistortionParameterControl_C_ExecuteUbergraph_BP_PP_DistortionParameterControl::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PP_DistortionParameterControl_C_ExecuteUbergraph_BP_PP_DistortionParameterControl, CallFunc_SetPlayRate_NewRate_ImplicitCast) == 0x000030, "Member 'BP_PP_DistortionParameterControl_C_ExecuteUbergraph_BP_PP_DistortionParameterControl::CallFunc_SetPlayRate_NewRate_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_PP_DistortionParameterControl_C_ExecuteUbergraph_BP_PP_DistortionParameterControl, CallFunc_Lerp_Alpha_ImplicitCast) == 0x000038, "Member 'BP_PP_DistortionParameterControl_C_ExecuteUbergraph_BP_PP_DistortionParameterControl::CallFunc_Lerp_Alpha_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_PP_DistortionParameterControl_C_ExecuteUbergraph_BP_PP_DistortionParameterControl, CallFunc_SetPlayRate_NewRate_ImplicitCast_1) == 0x000040, "Member 'BP_PP_DistortionParameterControl_C_ExecuteUbergraph_BP_PP_DistortionParameterControl::CallFunc_SetPlayRate_NewRate_ImplicitCast_1' has a wrong offset!");

// Function BP_PP_DistortionParameterControl.BP_PP_DistortionParameterControl_C.ReverseDistortionParameter
// 0x0008 (0x0008 - 0x0000)
struct BP_PP_DistortionParameterControl_C_ReverseDistortionParameter final
{
public:
	double                                        Speed;                                             // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PP_DistortionParameterControl_C_ReverseDistortionParameter) == 0x000008, "Wrong alignment on BP_PP_DistortionParameterControl_C_ReverseDistortionParameter");
static_assert(sizeof(BP_PP_DistortionParameterControl_C_ReverseDistortionParameter) == 0x000008, "Wrong size on BP_PP_DistortionParameterControl_C_ReverseDistortionParameter");
static_assert(offsetof(BP_PP_DistortionParameterControl_C_ReverseDistortionParameter, Speed) == 0x000000, "Member 'BP_PP_DistortionParameterControl_C_ReverseDistortionParameter::Speed' has a wrong offset!");

// Function BP_PP_DistortionParameterControl.BP_PP_DistortionParameterControl_C.SetDistortion
// 0x0010 (0x0010 - 0x0000)
struct BP_PP_DistortionParameterControl_C_SetDistortion final
{
public:
	double                                        NewParam;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast; // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PP_DistortionParameterControl_C_SetDistortion) == 0x000008, "Wrong alignment on BP_PP_DistortionParameterControl_C_SetDistortion");
static_assert(sizeof(BP_PP_DistortionParameterControl_C_SetDistortion) == 0x000010, "Wrong size on BP_PP_DistortionParameterControl_C_SetDistortion");
static_assert(offsetof(BP_PP_DistortionParameterControl_C_SetDistortion, NewParam) == 0x000000, "Member 'BP_PP_DistortionParameterControl_C_SetDistortion::NewParam' has a wrong offset!");
static_assert(offsetof(BP_PP_DistortionParameterControl_C_SetDistortion, CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast) == 0x000008, "Member 'BP_PP_DistortionParameterControl_C_SetDistortion::CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast' has a wrong offset!");

// Function BP_PP_DistortionParameterControl.BP_PP_DistortionParameterControl_C.SetDistortionParameter
// 0x0018 (0x0018 - 0x0000)
struct BP_PP_DistortionParameterControl_C_SetDistortionParameter final
{
public:
	double                                        Speed;                                             // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DistortionValue;                                   // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        HardnessValue;                                     // 0x0010(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PP_DistortionParameterControl_C_SetDistortionParameter) == 0x000008, "Wrong alignment on BP_PP_DistortionParameterControl_C_SetDistortionParameter");
static_assert(sizeof(BP_PP_DistortionParameterControl_C_SetDistortionParameter) == 0x000018, "Wrong size on BP_PP_DistortionParameterControl_C_SetDistortionParameter");
static_assert(offsetof(BP_PP_DistortionParameterControl_C_SetDistortionParameter, Speed) == 0x000000, "Member 'BP_PP_DistortionParameterControl_C_SetDistortionParameter::Speed' has a wrong offset!");
static_assert(offsetof(BP_PP_DistortionParameterControl_C_SetDistortionParameter, DistortionValue) == 0x000008, "Member 'BP_PP_DistortionParameterControl_C_SetDistortionParameter::DistortionValue' has a wrong offset!");
static_assert(offsetof(BP_PP_DistortionParameterControl_C_SetDistortionParameter, HardnessValue) == 0x000010, "Member 'BP_PP_DistortionParameterControl_C_SetDistortionParameter::HardnessValue' has a wrong offset!");

// Function BP_PP_DistortionParameterControl.BP_PP_DistortionParameterControl_C.SetHardness
// 0x0010 (0x0010 - 0x0000)
struct BP_PP_DistortionParameterControl_C_SetHardness final
{
public:
	double                                        NewParam;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast; // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PP_DistortionParameterControl_C_SetHardness) == 0x000008, "Wrong alignment on BP_PP_DistortionParameterControl_C_SetHardness");
static_assert(sizeof(BP_PP_DistortionParameterControl_C_SetHardness) == 0x000010, "Wrong size on BP_PP_DistortionParameterControl_C_SetHardness");
static_assert(offsetof(BP_PP_DistortionParameterControl_C_SetHardness, NewParam) == 0x000000, "Member 'BP_PP_DistortionParameterControl_C_SetHardness::NewParam' has a wrong offset!");
static_assert(offsetof(BP_PP_DistortionParameterControl_C_SetHardness, CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast) == 0x000008, "Member 'BP_PP_DistortionParameterControl_C_SetHardness::CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast' has a wrong offset!");

}

