#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PostProcess_Global_Sandfall

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_PostProcess_Global_Sandfall.BP_PostProcess_Global_Sandfall_C.ExecuteUbergraph_BP_PostProcess_Global_Sandfall
// 0x00D0 (0x00D0 - 0x0000)
struct BP_PostProcess_Global_Sandfall_C_ExecuteUbergraph_BP_PostProcess_Global_Sandfall final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 NewValue)>               K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_RGBMultiplier;                        // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_LuminanceMultiplier;                  // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector4_X;                           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector4_Y;                           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector4_Z;                           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector4_W;                           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_NewValue;                       // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_3;      // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_4;      // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCurrentPlatformConsole_CurrentPlatformIsConsole; // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector4                               CallFunc_MakeVector4_ReturnValue;                  // 0x0080(0x0020)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast_1;   // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_B_ImplicitCast;     // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast_2;   // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast; // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PostProcess_Global_Sandfall_C_ExecuteUbergraph_BP_PostProcess_Global_Sandfall) == 0x000010, "Wrong alignment on BP_PostProcess_Global_Sandfall_C_ExecuteUbergraph_BP_PostProcess_Global_Sandfall");
static_assert(sizeof(BP_PostProcess_Global_Sandfall_C_ExecuteUbergraph_BP_PostProcess_Global_Sandfall) == 0x0000D0, "Wrong size on BP_PostProcess_Global_Sandfall_C_ExecuteUbergraph_BP_PostProcess_Global_Sandfall");
static_assert(offsetof(BP_PostProcess_Global_Sandfall_C_ExecuteUbergraph_BP_PostProcess_Global_Sandfall, EntryPoint) == 0x000000, "Member 'BP_PostProcess_Global_Sandfall_C_ExecuteUbergraph_BP_PostProcess_Global_Sandfall::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_PostProcess_Global_Sandfall_C_ExecuteUbergraph_BP_PostProcess_Global_Sandfall, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BP_PostProcess_Global_Sandfall_C_ExecuteUbergraph_BP_PostProcess_Global_Sandfall::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_PostProcess_Global_Sandfall_C_ExecuteUbergraph_BP_PostProcess_Global_Sandfall, K2Node_Event_RGBMultiplier) == 0x000014, "Member 'BP_PostProcess_Global_Sandfall_C_ExecuteUbergraph_BP_PostProcess_Global_Sandfall::K2Node_Event_RGBMultiplier' has a wrong offset!");
static_assert(offsetof(BP_PostProcess_Global_Sandfall_C_ExecuteUbergraph_BP_PostProcess_Global_Sandfall, K2Node_Event_LuminanceMultiplier) == 0x000018, "Member 'BP_PostProcess_Global_Sandfall_C_ExecuteUbergraph_BP_PostProcess_Global_Sandfall::K2Node_Event_LuminanceMultiplier' has a wrong offset!");
static_assert(offsetof(BP_PostProcess_Global_Sandfall_C_ExecuteUbergraph_BP_PostProcess_Global_Sandfall, CallFunc_BreakVector4_X) == 0x000020, "Member 'BP_PostProcess_Global_Sandfall_C_ExecuteUbergraph_BP_PostProcess_Global_Sandfall::CallFunc_BreakVector4_X' has a wrong offset!");
static_assert(offsetof(BP_PostProcess_Global_Sandfall_C_ExecuteUbergraph_BP_PostProcess_Global_Sandfall, CallFunc_BreakVector4_Y) == 0x000028, "Member 'BP_PostProcess_Global_Sandfall_C_ExecuteUbergraph_BP_PostProcess_Global_Sandfall::CallFunc_BreakVector4_Y' has a wrong offset!");
static_assert(offsetof(BP_PostProcess_Global_Sandfall_C_ExecuteUbergraph_BP_PostProcess_Global_Sandfall, CallFunc_BreakVector4_Z) == 0x000030, "Member 'BP_PostProcess_Global_Sandfall_C_ExecuteUbergraph_BP_PostProcess_Global_Sandfall::CallFunc_BreakVector4_Z' has a wrong offset!");
static_assert(offsetof(BP_PostProcess_Global_Sandfall_C_ExecuteUbergraph_BP_PostProcess_Global_Sandfall, CallFunc_BreakVector4_W) == 0x000038, "Member 'BP_PostProcess_Global_Sandfall_C_ExecuteUbergraph_BP_PostProcess_Global_Sandfall::CallFunc_BreakVector4_W' has a wrong offset!");
static_assert(offsetof(BP_PostProcess_Global_Sandfall_C_ExecuteUbergraph_BP_PostProcess_Global_Sandfall, K2Node_CustomEvent_NewValue) == 0x000040, "Member 'BP_PostProcess_Global_Sandfall_C_ExecuteUbergraph_BP_PostProcess_Global_Sandfall::K2Node_CustomEvent_NewValue' has a wrong offset!");
static_assert(offsetof(BP_PostProcess_Global_Sandfall_C_ExecuteUbergraph_BP_PostProcess_Global_Sandfall, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000048, "Member 'BP_PostProcess_Global_Sandfall_C_ExecuteUbergraph_BP_PostProcess_Global_Sandfall::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PostProcess_Global_Sandfall_C_ExecuteUbergraph_BP_PostProcess_Global_Sandfall, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000050, "Member 'BP_PostProcess_Global_Sandfall_C_ExecuteUbergraph_BP_PostProcess_Global_Sandfall::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PostProcess_Global_Sandfall_C_ExecuteUbergraph_BP_PostProcess_Global_Sandfall, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000058, "Member 'BP_PostProcess_Global_Sandfall_C_ExecuteUbergraph_BP_PostProcess_Global_Sandfall::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PostProcess_Global_Sandfall_C_ExecuteUbergraph_BP_PostProcess_Global_Sandfall, CallFunc_Multiply_DoubleDouble_ReturnValue_2) == 0x000060, "Member 'BP_PostProcess_Global_Sandfall_C_ExecuteUbergraph_BP_PostProcess_Global_Sandfall::CallFunc_Multiply_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_PostProcess_Global_Sandfall_C_ExecuteUbergraph_BP_PostProcess_Global_Sandfall, CallFunc_Multiply_DoubleDouble_ReturnValue_3) == 0x000068, "Member 'BP_PostProcess_Global_Sandfall_C_ExecuteUbergraph_BP_PostProcess_Global_Sandfall::CallFunc_Multiply_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_PostProcess_Global_Sandfall_C_ExecuteUbergraph_BP_PostProcess_Global_Sandfall, CallFunc_Multiply_DoubleDouble_ReturnValue_4) == 0x000070, "Member 'BP_PostProcess_Global_Sandfall_C_ExecuteUbergraph_BP_PostProcess_Global_Sandfall::CallFunc_Multiply_DoubleDouble_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_PostProcess_Global_Sandfall_C_ExecuteUbergraph_BP_PostProcess_Global_Sandfall, CallFunc_IsCurrentPlatformConsole_CurrentPlatformIsConsole) == 0x000078, "Member 'BP_PostProcess_Global_Sandfall_C_ExecuteUbergraph_BP_PostProcess_Global_Sandfall::CallFunc_IsCurrentPlatformConsole_CurrentPlatformIsConsole' has a wrong offset!");
static_assert(offsetof(BP_PostProcess_Global_Sandfall_C_ExecuteUbergraph_BP_PostProcess_Global_Sandfall, CallFunc_MakeVector4_ReturnValue) == 0x000080, "Member 'BP_PostProcess_Global_Sandfall_C_ExecuteUbergraph_BP_PostProcess_Global_Sandfall::CallFunc_MakeVector4_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PostProcess_Global_Sandfall_C_ExecuteUbergraph_BP_PostProcess_Global_Sandfall, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x0000A0, "Member 'BP_PostProcess_Global_Sandfall_C_ExecuteUbergraph_BP_PostProcess_Global_Sandfall::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_PostProcess_Global_Sandfall_C_ExecuteUbergraph_BP_PostProcess_Global_Sandfall, CallFunc_Multiply_DoubleDouble_A_ImplicitCast_1) == 0x0000A8, "Member 'BP_PostProcess_Global_Sandfall_C_ExecuteUbergraph_BP_PostProcess_Global_Sandfall::CallFunc_Multiply_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_PostProcess_Global_Sandfall_C_ExecuteUbergraph_BP_PostProcess_Global_Sandfall, CallFunc_Multiply_DoubleDouble_B_ImplicitCast) == 0x0000B0, "Member 'BP_PostProcess_Global_Sandfall_C_ExecuteUbergraph_BP_PostProcess_Global_Sandfall::CallFunc_Multiply_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_PostProcess_Global_Sandfall_C_ExecuteUbergraph_BP_PostProcess_Global_Sandfall, CallFunc_Multiply_DoubleDouble_A_ImplicitCast_2) == 0x0000B8, "Member 'BP_PostProcess_Global_Sandfall_C_ExecuteUbergraph_BP_PostProcess_Global_Sandfall::CallFunc_Multiply_DoubleDouble_A_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(BP_PostProcess_Global_Sandfall_C_ExecuteUbergraph_BP_PostProcess_Global_Sandfall, CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast) == 0x0000C0, "Member 'BP_PostProcess_Global_Sandfall_C_ExecuteUbergraph_BP_PostProcess_Global_Sandfall::CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast' has a wrong offset!");

// Function BP_PostProcess_Global_Sandfall.BP_PostProcess_Global_Sandfall_C.MakeUniformColorAsVector4
// 0x0050 (0x0050 - 0x0000)
struct BP_PostProcess_Global_Sandfall_C_MakeUniformColorAsVector4 final
{
public:
	double                                        Value;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector4                               Vector4;                                           // 0x0010(0x0020)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector4                               CallFunc_MakeVector4_ReturnValue;                  // 0x0030(0x0020)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PostProcess_Global_Sandfall_C_MakeUniformColorAsVector4) == 0x000010, "Wrong alignment on BP_PostProcess_Global_Sandfall_C_MakeUniformColorAsVector4");
static_assert(sizeof(BP_PostProcess_Global_Sandfall_C_MakeUniformColorAsVector4) == 0x000050, "Wrong size on BP_PostProcess_Global_Sandfall_C_MakeUniformColorAsVector4");
static_assert(offsetof(BP_PostProcess_Global_Sandfall_C_MakeUniformColorAsVector4, Value) == 0x000000, "Member 'BP_PostProcess_Global_Sandfall_C_MakeUniformColorAsVector4::Value' has a wrong offset!");
static_assert(offsetof(BP_PostProcess_Global_Sandfall_C_MakeUniformColorAsVector4, Vector4) == 0x000010, "Member 'BP_PostProcess_Global_Sandfall_C_MakeUniformColorAsVector4::Vector4' has a wrong offset!");
static_assert(offsetof(BP_PostProcess_Global_Sandfall_C_MakeUniformColorAsVector4, CallFunc_MakeVector4_ReturnValue) == 0x000030, "Member 'BP_PostProcess_Global_Sandfall_C_MakeUniformColorAsVector4::CallFunc_MakeVector4_ReturnValue' has a wrong offset!");

// Function BP_PostProcess_Global_Sandfall.BP_PostProcess_Global_Sandfall_C.OnScreenPercentageChanged
// 0x0004 (0x0004 - 0x0000)
struct BP_PostProcess_Global_Sandfall_C_OnScreenPercentageChanged final
{
public:
	int32                                         NewValue;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PostProcess_Global_Sandfall_C_OnScreenPercentageChanged) == 0x000004, "Wrong alignment on BP_PostProcess_Global_Sandfall_C_OnScreenPercentageChanged");
static_assert(sizeof(BP_PostProcess_Global_Sandfall_C_OnScreenPercentageChanged) == 0x000004, "Wrong size on BP_PostProcess_Global_Sandfall_C_OnScreenPercentageChanged");
static_assert(offsetof(BP_PostProcess_Global_Sandfall_C_OnScreenPercentageChanged, NewValue) == 0x000000, "Member 'BP_PostProcess_Global_Sandfall_C_OnScreenPercentageChanged::NewValue' has a wrong offset!");

// Function BP_PostProcess_Global_Sandfall.BP_PostProcess_Global_Sandfall_C.RegisterPostProcessingDefaultValues
// 0x0020 (0x0020 - 0x0000)
struct BP_PostProcess_Global_Sandfall_C_RegisterPostProcessingDefaultValues final
{
public:
	double                                        K2Node_VariableSet_DefaultChromaticAberrationIntensity_ImplicitCast; // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_DefaultVignetteIntensity_ImplicitCast; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_DefaultFilmGrainIntensity_ImplicitCast; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_DefaultMotionBlurAmount_ImplicitCast; // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PostProcess_Global_Sandfall_C_RegisterPostProcessingDefaultValues) == 0x000008, "Wrong alignment on BP_PostProcess_Global_Sandfall_C_RegisterPostProcessingDefaultValues");
static_assert(sizeof(BP_PostProcess_Global_Sandfall_C_RegisterPostProcessingDefaultValues) == 0x000020, "Wrong size on BP_PostProcess_Global_Sandfall_C_RegisterPostProcessingDefaultValues");
static_assert(offsetof(BP_PostProcess_Global_Sandfall_C_RegisterPostProcessingDefaultValues, K2Node_VariableSet_DefaultChromaticAberrationIntensity_ImplicitCast) == 0x000000, "Member 'BP_PostProcess_Global_Sandfall_C_RegisterPostProcessingDefaultValues::K2Node_VariableSet_DefaultChromaticAberrationIntensity_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_PostProcess_Global_Sandfall_C_RegisterPostProcessingDefaultValues, K2Node_VariableSet_DefaultVignetteIntensity_ImplicitCast) == 0x000008, "Member 'BP_PostProcess_Global_Sandfall_C_RegisterPostProcessingDefaultValues::K2Node_VariableSet_DefaultVignetteIntensity_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_PostProcess_Global_Sandfall_C_RegisterPostProcessingDefaultValues, K2Node_VariableSet_DefaultFilmGrainIntensity_ImplicitCast) == 0x000010, "Member 'BP_PostProcess_Global_Sandfall_C_RegisterPostProcessingDefaultValues::K2Node_VariableSet_DefaultFilmGrainIntensity_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_PostProcess_Global_Sandfall_C_RegisterPostProcessingDefaultValues, K2Node_VariableSet_DefaultMotionBlurAmount_ImplicitCast) == 0x000018, "Member 'BP_PostProcess_Global_Sandfall_C_RegisterPostProcessingDefaultValues::K2Node_VariableSet_DefaultMotionBlurAmount_ImplicitCast' has a wrong offset!");

// Function BP_PostProcess_Global_Sandfall.BP_PostProcess_Global_Sandfall_C.UpdateChromaticAberrationValue
// 0x0010 (0x0010 - 0x0000)
struct BP_PostProcess_Global_Sandfall_C_UpdateChromaticAberrationValue final
{
public:
	class UConfigurableGameUserSettings*          CallFunc_GetConfigurableGameUserSettings_GameUserSettings; // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetEnableChromaticAberration_ReturnValue; // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_SetFieldsInStruct_SceneFringeIntensity_ImplicitCast; // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PostProcess_Global_Sandfall_C_UpdateChromaticAberrationValue) == 0x000008, "Wrong alignment on BP_PostProcess_Global_Sandfall_C_UpdateChromaticAberrationValue");
static_assert(sizeof(BP_PostProcess_Global_Sandfall_C_UpdateChromaticAberrationValue) == 0x000010, "Wrong size on BP_PostProcess_Global_Sandfall_C_UpdateChromaticAberrationValue");
static_assert(offsetof(BP_PostProcess_Global_Sandfall_C_UpdateChromaticAberrationValue, CallFunc_GetConfigurableGameUserSettings_GameUserSettings) == 0x000000, "Member 'BP_PostProcess_Global_Sandfall_C_UpdateChromaticAberrationValue::CallFunc_GetConfigurableGameUserSettings_GameUserSettings' has a wrong offset!");
static_assert(offsetof(BP_PostProcess_Global_Sandfall_C_UpdateChromaticAberrationValue, CallFunc_GetEnableChromaticAberration_ReturnValue) == 0x000008, "Member 'BP_PostProcess_Global_Sandfall_C_UpdateChromaticAberrationValue::CallFunc_GetEnableChromaticAberration_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PostProcess_Global_Sandfall_C_UpdateChromaticAberrationValue, K2Node_SetFieldsInStruct_SceneFringeIntensity_ImplicitCast) == 0x00000C, "Member 'BP_PostProcess_Global_Sandfall_C_UpdateChromaticAberrationValue::K2Node_SetFieldsInStruct_SceneFringeIntensity_ImplicitCast' has a wrong offset!");

// Function BP_PostProcess_Global_Sandfall.BP_PostProcess_Global_Sandfall_C.UpdateFilmGrainValue
// 0x0010 (0x0010 - 0x0000)
struct BP_PostProcess_Global_Sandfall_C_UpdateFilmGrainValue final
{
public:
	class UConfigurableGameUserSettings*          CallFunc_GetConfigurableGameUserSettings_GameUserSettings; // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetEnableFilmGrain_ReturnValue;           // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_SetFieldsInStruct_FilmGrainIntensity_ImplicitCast; // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PostProcess_Global_Sandfall_C_UpdateFilmGrainValue) == 0x000008, "Wrong alignment on BP_PostProcess_Global_Sandfall_C_UpdateFilmGrainValue");
static_assert(sizeof(BP_PostProcess_Global_Sandfall_C_UpdateFilmGrainValue) == 0x000010, "Wrong size on BP_PostProcess_Global_Sandfall_C_UpdateFilmGrainValue");
static_assert(offsetof(BP_PostProcess_Global_Sandfall_C_UpdateFilmGrainValue, CallFunc_GetConfigurableGameUserSettings_GameUserSettings) == 0x000000, "Member 'BP_PostProcess_Global_Sandfall_C_UpdateFilmGrainValue::CallFunc_GetConfigurableGameUserSettings_GameUserSettings' has a wrong offset!");
static_assert(offsetof(BP_PostProcess_Global_Sandfall_C_UpdateFilmGrainValue, CallFunc_GetEnableFilmGrain_ReturnValue) == 0x000008, "Member 'BP_PostProcess_Global_Sandfall_C_UpdateFilmGrainValue::CallFunc_GetEnableFilmGrain_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PostProcess_Global_Sandfall_C_UpdateFilmGrainValue, K2Node_SetFieldsInStruct_FilmGrainIntensity_ImplicitCast) == 0x00000C, "Member 'BP_PostProcess_Global_Sandfall_C_UpdateFilmGrainValue::K2Node_SetFieldsInStruct_FilmGrainIntensity_ImplicitCast' has a wrong offset!");

// Function BP_PostProcess_Global_Sandfall.BP_PostProcess_Global_Sandfall_C.UpdateImageSettingsValues
// 0x00A0 (0x00A0 - 0x0000)
struct BP_PostProcess_Global_Sandfall_C_UpdateImageSettingsValues final
{
public:
	class UConfigurableGameUserSettings*          CallFunc_GetConfigurableGameUserSettings_GameUserSettings; // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetBrightnessValue_ReturnValue;           // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector4                               CallFunc_MakeUniformColorAsVector4_Vector4;        // 0x0010(0x0020)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetContrastValue_ReturnValue;             // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGammaValue_ReturnValue;                // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector4                               CallFunc_MakeUniformColorAsVector4_Vector4_1;      // 0x0040(0x0020)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector4                               CallFunc_MakeUniformColorAsVector4_Vector4_2;      // 0x0060(0x0020)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MakeUniformColorAsVector4_Value_ImplicitCast; // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MakeUniformColorAsVector4_Value_ImplicitCast_1; // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MakeUniformColorAsVector4_Value_ImplicitCast_2; // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PostProcess_Global_Sandfall_C_UpdateImageSettingsValues) == 0x000010, "Wrong alignment on BP_PostProcess_Global_Sandfall_C_UpdateImageSettingsValues");
static_assert(sizeof(BP_PostProcess_Global_Sandfall_C_UpdateImageSettingsValues) == 0x0000A0, "Wrong size on BP_PostProcess_Global_Sandfall_C_UpdateImageSettingsValues");
static_assert(offsetof(BP_PostProcess_Global_Sandfall_C_UpdateImageSettingsValues, CallFunc_GetConfigurableGameUserSettings_GameUserSettings) == 0x000000, "Member 'BP_PostProcess_Global_Sandfall_C_UpdateImageSettingsValues::CallFunc_GetConfigurableGameUserSettings_GameUserSettings' has a wrong offset!");
static_assert(offsetof(BP_PostProcess_Global_Sandfall_C_UpdateImageSettingsValues, CallFunc_GetBrightnessValue_ReturnValue) == 0x000008, "Member 'BP_PostProcess_Global_Sandfall_C_UpdateImageSettingsValues::CallFunc_GetBrightnessValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PostProcess_Global_Sandfall_C_UpdateImageSettingsValues, CallFunc_MakeUniformColorAsVector4_Vector4) == 0x000010, "Member 'BP_PostProcess_Global_Sandfall_C_UpdateImageSettingsValues::CallFunc_MakeUniformColorAsVector4_Vector4' has a wrong offset!");
static_assert(offsetof(BP_PostProcess_Global_Sandfall_C_UpdateImageSettingsValues, CallFunc_GetContrastValue_ReturnValue) == 0x000030, "Member 'BP_PostProcess_Global_Sandfall_C_UpdateImageSettingsValues::CallFunc_GetContrastValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PostProcess_Global_Sandfall_C_UpdateImageSettingsValues, CallFunc_GetGammaValue_ReturnValue) == 0x000034, "Member 'BP_PostProcess_Global_Sandfall_C_UpdateImageSettingsValues::CallFunc_GetGammaValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PostProcess_Global_Sandfall_C_UpdateImageSettingsValues, CallFunc_MakeUniformColorAsVector4_Vector4_1) == 0x000040, "Member 'BP_PostProcess_Global_Sandfall_C_UpdateImageSettingsValues::CallFunc_MakeUniformColorAsVector4_Vector4_1' has a wrong offset!");
static_assert(offsetof(BP_PostProcess_Global_Sandfall_C_UpdateImageSettingsValues, CallFunc_MakeUniformColorAsVector4_Vector4_2) == 0x000060, "Member 'BP_PostProcess_Global_Sandfall_C_UpdateImageSettingsValues::CallFunc_MakeUniformColorAsVector4_Vector4_2' has a wrong offset!");
static_assert(offsetof(BP_PostProcess_Global_Sandfall_C_UpdateImageSettingsValues, CallFunc_MakeUniformColorAsVector4_Value_ImplicitCast) == 0x000080, "Member 'BP_PostProcess_Global_Sandfall_C_UpdateImageSettingsValues::CallFunc_MakeUniformColorAsVector4_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_PostProcess_Global_Sandfall_C_UpdateImageSettingsValues, CallFunc_MakeUniformColorAsVector4_Value_ImplicitCast_1) == 0x000088, "Member 'BP_PostProcess_Global_Sandfall_C_UpdateImageSettingsValues::CallFunc_MakeUniformColorAsVector4_Value_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_PostProcess_Global_Sandfall_C_UpdateImageSettingsValues, CallFunc_MakeUniformColorAsVector4_Value_ImplicitCast_2) == 0x000090, "Member 'BP_PostProcess_Global_Sandfall_C_UpdateImageSettingsValues::CallFunc_MakeUniformColorAsVector4_Value_ImplicitCast_2' has a wrong offset!");

// Function BP_PostProcess_Global_Sandfall.BP_PostProcess_Global_Sandfall_C.UpdateMotionBlurValue
// 0x0010 (0x0010 - 0x0000)
struct BP_PostProcess_Global_Sandfall_C_UpdateMotionBlurValue final
{
public:
	class UConfigurableGameUserSettings*          CallFunc_GetConfigurableGameUserSettings_GameUserSettings; // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetEnableMotionBlur_ReturnValue;          // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_SetFieldsInStruct_MotionBlurAmount_ImplicitCast; // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PostProcess_Global_Sandfall_C_UpdateMotionBlurValue) == 0x000008, "Wrong alignment on BP_PostProcess_Global_Sandfall_C_UpdateMotionBlurValue");
static_assert(sizeof(BP_PostProcess_Global_Sandfall_C_UpdateMotionBlurValue) == 0x000010, "Wrong size on BP_PostProcess_Global_Sandfall_C_UpdateMotionBlurValue");
static_assert(offsetof(BP_PostProcess_Global_Sandfall_C_UpdateMotionBlurValue, CallFunc_GetConfigurableGameUserSettings_GameUserSettings) == 0x000000, "Member 'BP_PostProcess_Global_Sandfall_C_UpdateMotionBlurValue::CallFunc_GetConfigurableGameUserSettings_GameUserSettings' has a wrong offset!");
static_assert(offsetof(BP_PostProcess_Global_Sandfall_C_UpdateMotionBlurValue, CallFunc_GetEnableMotionBlur_ReturnValue) == 0x000008, "Member 'BP_PostProcess_Global_Sandfall_C_UpdateMotionBlurValue::CallFunc_GetEnableMotionBlur_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PostProcess_Global_Sandfall_C_UpdateMotionBlurValue, K2Node_SetFieldsInStruct_MotionBlurAmount_ImplicitCast) == 0x00000C, "Member 'BP_PostProcess_Global_Sandfall_C_UpdateMotionBlurValue::K2Node_SetFieldsInStruct_MotionBlurAmount_ImplicitCast' has a wrong offset!");

// Function BP_PostProcess_Global_Sandfall.BP_PostProcess_Global_Sandfall_C.UpdatePostProcessSaturation
// 0x0008 (0x0008 - 0x0000)
struct BP_PostProcess_Global_Sandfall_C_UpdatePostProcessSaturation final
{
public:
	float                                         RGBMultiplier;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LuminanceMultiplier;                               // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PostProcess_Global_Sandfall_C_UpdatePostProcessSaturation) == 0x000004, "Wrong alignment on BP_PostProcess_Global_Sandfall_C_UpdatePostProcessSaturation");
static_assert(sizeof(BP_PostProcess_Global_Sandfall_C_UpdatePostProcessSaturation) == 0x000008, "Wrong size on BP_PostProcess_Global_Sandfall_C_UpdatePostProcessSaturation");
static_assert(offsetof(BP_PostProcess_Global_Sandfall_C_UpdatePostProcessSaturation, RGBMultiplier) == 0x000000, "Member 'BP_PostProcess_Global_Sandfall_C_UpdatePostProcessSaturation::RGBMultiplier' has a wrong offset!");
static_assert(offsetof(BP_PostProcess_Global_Sandfall_C_UpdatePostProcessSaturation, LuminanceMultiplier) == 0x000004, "Member 'BP_PostProcess_Global_Sandfall_C_UpdatePostProcessSaturation::LuminanceMultiplier' has a wrong offset!");

// Function BP_PostProcess_Global_Sandfall.BP_PostProcess_Global_Sandfall_C.UpdatePostProcessValues
// 0x0001 (0x0001 - 0x0000)
struct BP_PostProcess_Global_Sandfall_C_UpdatePostProcessValues final
{
public:
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PostProcess_Global_Sandfall_C_UpdatePostProcessValues) == 0x000001, "Wrong alignment on BP_PostProcess_Global_Sandfall_C_UpdatePostProcessValues");
static_assert(sizeof(BP_PostProcess_Global_Sandfall_C_UpdatePostProcessValues) == 0x000001, "Wrong size on BP_PostProcess_Global_Sandfall_C_UpdatePostProcessValues");
static_assert(offsetof(BP_PostProcess_Global_Sandfall_C_UpdatePostProcessValues, CallFunc_Not_PreBool_ReturnValue) == 0x000000, "Member 'BP_PostProcess_Global_Sandfall_C_UpdatePostProcessValues::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function BP_PostProcess_Global_Sandfall.BP_PostProcess_Global_Sandfall_C.UpdateVignetteValue
// 0x0010 (0x0010 - 0x0000)
struct BP_PostProcess_Global_Sandfall_C_UpdateVignetteValue final
{
public:
	class UConfigurableGameUserSettings*          CallFunc_GetConfigurableGameUserSettings_GameUserSettings; // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetEnableVignette_ReturnValue;            // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_SetFieldsInStruct_VignetteIntensity_ImplicitCast; // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PostProcess_Global_Sandfall_C_UpdateVignetteValue) == 0x000008, "Wrong alignment on BP_PostProcess_Global_Sandfall_C_UpdateVignetteValue");
static_assert(sizeof(BP_PostProcess_Global_Sandfall_C_UpdateVignetteValue) == 0x000010, "Wrong size on BP_PostProcess_Global_Sandfall_C_UpdateVignetteValue");
static_assert(offsetof(BP_PostProcess_Global_Sandfall_C_UpdateVignetteValue, CallFunc_GetConfigurableGameUserSettings_GameUserSettings) == 0x000000, "Member 'BP_PostProcess_Global_Sandfall_C_UpdateVignetteValue::CallFunc_GetConfigurableGameUserSettings_GameUserSettings' has a wrong offset!");
static_assert(offsetof(BP_PostProcess_Global_Sandfall_C_UpdateVignetteValue, CallFunc_GetEnableVignette_ReturnValue) == 0x000008, "Member 'BP_PostProcess_Global_Sandfall_C_UpdateVignetteValue::CallFunc_GetEnableVignette_ReturnValue' has a wrong offset!");
