#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PostProcess_Global_Sandfall

#include "Basic.hpp"

#include "SandFall_classes.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_PostProcess_Global_Sandfall.BP_PostProcess_Global_Sandfall_C
// 0x0070 (0x0300 - 0x0290)
class ABP_PostProcess_Global_Sandfall_C final : public AGlobalPostProcessActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UPostProcessComponent*                  PostProcess;                                       // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A8[0x8];                                      // 0x02A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector4                               DefaultSaturationValues;                           // 0x02B0(0x0020)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DefaultMotionBlurAmount;                           // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DefaultVignetteIntensity;                          // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DefaultFilmGrainIntensity;                         // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DefaultChromaticAberrationIntensity;               // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DefaultPPValuesRegistered;                         // 0x02F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_PostProcess_Global_Sandfall(int32 EntryPoint);
	void MakeUniformColorAsVector4(double Value, struct FVector4* Vector4);
	void OnScreenPercentageChanged(int32 NewValue);
	void ReceiveBeginPlay();
	void RegisterPostProcessingDefaultValues();
	void UpdateChromaticAberrationValue();
	void UpdateFilmGrainValue();
	void UpdateImageSettingsValues();
	void UpdateMotionBlurValue();
	void UpdatePostProcessSaturation(float RGBMultiplier, float LuminanceMultiplier);
	void UpdatePostProcessValues();
	void UpdateVignetteValue();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_PostProcess_Global_Sandfall_C">();
	}
	static class ABP_PostProcess_Global_Sandfall_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_PostProcess_Global_Sandfall_C>();
	}
};
static_assert(alignof(ABP_PostProcess_Global_Sandfall_C) == 0x000010, "Wrong alignment on ABP_PostProcess_Global_Sandfall_C");
static_assert(sizeof(ABP_PostProcess_Global_Sandfall_C) == 0x000300, "Wrong size on ABP_PostProcess_Global_Sandfall_C");
static_assert(offsetof(ABP_PostProcess_Global_Sandfall_C, UberGraphFrame) == 0x000290, "Member 'ABP_PostProcess_Global_Sandfall_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_PostProcess_Global_Sandfall_C, PostProcess) == 0x000298, "Member 'ABP_PostProcess_Global_Sandfall_C::PostProcess' has a wrong offset!");
static_assert(offsetof(ABP_PostProcess_Global_Sandfall_C, DefaultSceneRoot) == 0x0002A0, "Member 'ABP_PostProcess_Global_Sandfall_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_PostProcess_Global_Sandfall_C, DefaultSaturationValues) == 0x0002B0, "Member 'ABP_PostProcess_Global_Sandfall_C::DefaultSaturationValues' has a wrong offset!");
static_assert(offsetof(ABP_PostProcess_Global_Sandfall_C, DefaultMotionBlurAmount) == 0x0002D0, "Member 'ABP_PostProcess_Global_Sandfall_C::DefaultMotionBlurAmount' has a wrong offset!");
static_assert(offsetof(ABP_PostProcess_Global_Sandfall_C, DefaultVignetteIntensity) == 0x0002D8, "Member 'ABP_PostProcess_Global_Sandfall_C::DefaultVignetteIntensity' has a wrong offset!");
static_assert(offsetof(ABP_PostProcess_Global_Sandfall_C, DefaultFilmGrainIntensity) == 0x0002E0, "Member 'ABP_PostProcess_Global_Sandfall_C::DefaultFilmGrainIntensity' has a wrong offset!");
static_assert(offsetof(ABP_PostProcess_Global_Sandfall_C, DefaultChromaticAberrationIntensity) == 0x0002E8, "Member 'ABP_PostProcess_Global_Sandfall_C::DefaultChromaticAberrationIntensity' has a wrong offset!");
static_assert(offsetof(ABP_PostProcess_Global_Sandfall_C, DefaultPPValuesRegistered) == 0x0002F0, "Member 'ABP_PostProcess_Global_Sandfall_C::DefaultPPValuesRegistered' has a wrong offset!");

}

