#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PaintCageLayer_Master

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_PaintCageLayer_Master.BP_PaintCageLayer_Master_C
// 0x0028 (0x02B8 - 0x0290)
class ABP_PaintCageLayer_Master_C : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   Paint;                                             // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Disappear_NewTrack_1_2EE5E62942598916D2B679A8A4C7A633; // 0x02A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Disappear__Direction_2EE5E62942598916D2B679A8A4C7A633; // 0x02AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2AD[0x3];                                      // 0x02AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Disappear;                                         // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void PaintCageLayer_Disappear(bool Instant);
	void ExecuteUbergraph_BP_PaintCageLayer_Master(int32 EntryPoint);
	void Disappear__UpdateFunc();
	void Disappear__FinishedFunc();
	void DestroyLayer();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_PaintCageLayer_Master_C">();
	}
	static class ABP_PaintCageLayer_Master_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_PaintCageLayer_Master_C>();
	}
};
static_assert(alignof(ABP_PaintCageLayer_Master_C) == 0x000008, "Wrong alignment on ABP_PaintCageLayer_Master_C");
static_assert(sizeof(ABP_PaintCageLayer_Master_C) == 0x0002B8, "Wrong size on ABP_PaintCageLayer_Master_C");
static_assert(offsetof(ABP_PaintCageLayer_Master_C, UberGraphFrame) == 0x000290, "Member 'ABP_PaintCageLayer_Master_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_PaintCageLayer_Master_C, Paint) == 0x000298, "Member 'ABP_PaintCageLayer_Master_C::Paint' has a wrong offset!");
static_assert(offsetof(ABP_PaintCageLayer_Master_C, DefaultSceneRoot) == 0x0002A0, "Member 'ABP_PaintCageLayer_Master_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_PaintCageLayer_Master_C, Disappear_NewTrack_1_2EE5E62942598916D2B679A8A4C7A633) == 0x0002A8, "Member 'ABP_PaintCageLayer_Master_C::Disappear_NewTrack_1_2EE5E62942598916D2B679A8A4C7A633' has a wrong offset!");
static_assert(offsetof(ABP_PaintCageLayer_Master_C, Disappear__Direction_2EE5E62942598916D2B679A8A4C7A633) == 0x0002AC, "Member 'ABP_PaintCageLayer_Master_C::Disappear__Direction_2EE5E62942598916D2B679A8A4C7A633' has a wrong offset!");
static_assert(offsetof(ABP_PaintCageLayer_Master_C, Disappear) == 0x0002B0, "Member 'ABP_PaintCageLayer_Master_C::Disappear' has a wrong offset!");

}

