#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_QuestHelperFunctionLibrary

#include "Basic.hpp"

#include "SandFall_structs.hpp"
#include "E_QuestStatus_structs.hpp"


namespace SDK::Params
{

// Function BP_QuestHelperFunctionLibrary.BP_QuestHelperFunctionLibrary_C.GetIsObjectiveCompleted
// 0x0030 (0x0030 - 0x0000)
struct BP_QuestHelperFunctionLibrary_C_GetIsObjectiveCompleted final
{
public:
	struct FQuestObjectiveIdentifier              QuestObjective;                                    // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_QuestSystem_C*                      CallFunc_GetQuestSystem_QuestSystem;               // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	E_QuestStatus                                 CallFunc_GetObjectiveStatus_Status;                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_QuestHelperFunctionLibrary_C_GetIsObjectiveCompleted) == 0x000008, "Wrong alignment on BP_QuestHelperFunctionLibrary_C_GetIsObjectiveCompleted");
static_assert(sizeof(BP_QuestHelperFunctionLibrary_C_GetIsObjectiveCompleted) == 0x000030, "Wrong size on BP_QuestHelperFunctionLibrary_C_GetIsObjectiveCompleted");
static_assert(offsetof(BP_QuestHelperFunctionLibrary_C_GetIsObjectiveCompleted, QuestObjective) == 0x000000, "Member 'BP_QuestHelperFunctionLibrary_C_GetIsObjectiveCompleted::QuestObjective' has a wrong offset!");
static_assert(offsetof(BP_QuestHelperFunctionLibrary_C_GetIsObjectiveCompleted, __WorldContext) == 0x000010, "Member 'BP_QuestHelperFunctionLibrary_C_GetIsObjectiveCompleted::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_QuestHelperFunctionLibrary_C_GetIsObjectiveCompleted, ReturnValue) == 0x000018, "Member 'BP_QuestHelperFunctionLibrary_C_GetIsObjectiveCompleted::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_QuestHelperFunctionLibrary_C_GetIsObjectiveCompleted, CallFunc_GetQuestSystem_QuestSystem) == 0x000020, "Member 'BP_QuestHelperFunctionLibrary_C_GetIsObjectiveCompleted::CallFunc_GetQuestSystem_QuestSystem' has a wrong offset!");
static_assert(offsetof(BP_QuestHelperFunctionLibrary_C_GetIsObjectiveCompleted, CallFunc_GetObjectiveStatus_Status) == 0x000028, "Member 'BP_QuestHelperFunctionLibrary_C_GetIsObjectiveCompleted::CallFunc_GetObjectiveStatus_Status' has a wrong offset!");
static_assert(offsetof(BP_QuestHelperFunctionLibrary_C_GetIsObjectiveCompleted, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000029, "Member 'BP_QuestHelperFunctionLibrary_C_GetIsObjectiveCompleted::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function BP_QuestHelperFunctionLibrary.BP_QuestHelperFunctionLibrary_C.DEBUG_ConvertStringToQuestStatus
// 0x0050 (0x0050 - 0x0000)
struct BP_QuestHelperFunctionLibrary_C_DEBUG_ConvertStringToQuestStatus final
{
public:
	class FString                                 String;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	E_QuestStatus                                 Status;                                            // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ConversionSuccessful;                              // 0x0019(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x2];                                       // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue_1;             // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E[0x2];                                       // 0x002E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetEnumeratorValueFromIndex_ReturnValue;  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StriStri_ReturnValue;          // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42[0x2];                                       // 0x0042(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue;               // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_QuestHelperFunctionLibrary_C_DEBUG_ConvertStringToQuestStatus) == 0x000008, "Wrong alignment on BP_QuestHelperFunctionLibrary_C_DEBUG_ConvertStringToQuestStatus");
static_assert(sizeof(BP_QuestHelperFunctionLibrary_C_DEBUG_ConvertStringToQuestStatus) == 0x000050, "Wrong size on BP_QuestHelperFunctionLibrary_C_DEBUG_ConvertStringToQuestStatus");
static_assert(offsetof(BP_QuestHelperFunctionLibrary_C_DEBUG_ConvertStringToQuestStatus, String) == 0x000000, "Member 'BP_QuestHelperFunctionLibrary_C_DEBUG_ConvertStringToQuestStatus::String' has a wrong offset!");
static_assert(offsetof(BP_QuestHelperFunctionLibrary_C_DEBUG_ConvertStringToQuestStatus, __WorldContext) == 0x000010, "Member 'BP_QuestHelperFunctionLibrary_C_DEBUG_ConvertStringToQuestStatus::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_QuestHelperFunctionLibrary_C_DEBUG_ConvertStringToQuestStatus, Status) == 0x000018, "Member 'BP_QuestHelperFunctionLibrary_C_DEBUG_ConvertStringToQuestStatus::Status' has a wrong offset!");
static_assert(offsetof(BP_QuestHelperFunctionLibrary_C_DEBUG_ConvertStringToQuestStatus, ConversionSuccessful) == 0x000019, "Member 'BP_QuestHelperFunctionLibrary_C_DEBUG_ConvertStringToQuestStatus::ConversionSuccessful' has a wrong offset!");
static_assert(offsetof(BP_QuestHelperFunctionLibrary_C_DEBUG_ConvertStringToQuestStatus, Temp_int_Variable) == 0x00001C, "Member 'BP_QuestHelperFunctionLibrary_C_DEBUG_ConvertStringToQuestStatus::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_QuestHelperFunctionLibrary_C_DEBUG_ConvertStringToQuestStatus, Temp_int_Variable_1) == 0x000020, "Member 'BP_QuestHelperFunctionLibrary_C_DEBUG_ConvertStringToQuestStatus::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_QuestHelperFunctionLibrary_C_DEBUG_ConvertStringToQuestStatus, CallFunc_Conv_IntToByte_ReturnValue) == 0x000024, "Member 'BP_QuestHelperFunctionLibrary_C_DEBUG_ConvertStringToQuestStatus::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_QuestHelperFunctionLibrary_C_DEBUG_ConvertStringToQuestStatus, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'BP_QuestHelperFunctionLibrary_C_DEBUG_ConvertStringToQuestStatus::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_QuestHelperFunctionLibrary_C_DEBUG_ConvertStringToQuestStatus, CallFunc_GetValidValue_ReturnValue) == 0x00002C, "Member 'BP_QuestHelperFunctionLibrary_C_DEBUG_ConvertStringToQuestStatus::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_QuestHelperFunctionLibrary_C_DEBUG_ConvertStringToQuestStatus, CallFunc_Conv_IntToByte_ReturnValue_1) == 0x00002D, "Member 'BP_QuestHelperFunctionLibrary_C_DEBUG_ConvertStringToQuestStatus::CallFunc_Conv_IntToByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_QuestHelperFunctionLibrary_C_DEBUG_ConvertStringToQuestStatus, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x000030, "Member 'BP_QuestHelperFunctionLibrary_C_DEBUG_ConvertStringToQuestStatus::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_QuestHelperFunctionLibrary_C_DEBUG_ConvertStringToQuestStatus, CallFunc_GetEnumeratorValueFromIndex_ReturnValue) == 0x000040, "Member 'BP_QuestHelperFunctionLibrary_C_DEBUG_ConvertStringToQuestStatus::CallFunc_GetEnumeratorValueFromIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_QuestHelperFunctionLibrary_C_DEBUG_ConvertStringToQuestStatus, CallFunc_EqualEqual_StriStri_ReturnValue) == 0x000041, "Member 'BP_QuestHelperFunctionLibrary_C_DEBUG_ConvertStringToQuestStatus::CallFunc_EqualEqual_StriStri_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_QuestHelperFunctionLibrary_C_DEBUG_ConvertStringToQuestStatus, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000044, "Member 'BP_QuestHelperFunctionLibrary_C_DEBUG_ConvertStringToQuestStatus::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_QuestHelperFunctionLibrary_C_DEBUG_ConvertStringToQuestStatus, CallFunc_MakeLiteralInt_ReturnValue) == 0x000048, "Member 'BP_QuestHelperFunctionLibrary_C_DEBUG_ConvertStringToQuestStatus::CallFunc_MakeLiteralInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_QuestHelperFunctionLibrary_C_DEBUG_ConvertStringToQuestStatus, CallFunc_Less_IntInt_ReturnValue) == 0x00004C, "Member 'BP_QuestHelperFunctionLibrary_C_DEBUG_ConvertStringToQuestStatus::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function BP_QuestHelperFunctionLibrary.BP_QuestHelperFunctionLibrary_C.GetQuestList
// 0x0040 (0x0040 - 0x0000)
struct BP_QuestHelperFunctionLibrary_C_GetQuestList final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           Quests;                                            // 0x0008(0x0010)(Parm, OutParm)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_jRPG_GI_Custom_C*                   K2Node_DynamicCast_AsBP_J_RPG_GI_Custom;           // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_GetQuestList_Quests;                      // 0x0030(0x0010)(ReferenceParm)
};
static_assert(alignof(BP_QuestHelperFunctionLibrary_C_GetQuestList) == 0x000008, "Wrong alignment on BP_QuestHelperFunctionLibrary_C_GetQuestList");
static_assert(sizeof(BP_QuestHelperFunctionLibrary_C_GetQuestList) == 0x000040, "Wrong size on BP_QuestHelperFunctionLibrary_C_GetQuestList");
static_assert(offsetof(BP_QuestHelperFunctionLibrary_C_GetQuestList, __WorldContext) == 0x000000, "Member 'BP_QuestHelperFunctionLibrary_C_GetQuestList::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_QuestHelperFunctionLibrary_C_GetQuestList, Quests) == 0x000008, "Member 'BP_QuestHelperFunctionLibrary_C_GetQuestList::Quests' has a wrong offset!");
static_assert(offsetof(BP_QuestHelperFunctionLibrary_C_GetQuestList, CallFunc_GetGameInstance_ReturnValue) == 0x000018, "Member 'BP_QuestHelperFunctionLibrary_C_GetQuestList::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_QuestHelperFunctionLibrary_C_GetQuestList, K2Node_DynamicCast_AsBP_J_RPG_GI_Custom) == 0x000020, "Member 'BP_QuestHelperFunctionLibrary_C_GetQuestList::K2Node_DynamicCast_AsBP_J_RPG_GI_Custom' has a wrong offset!");
static_assert(offsetof(BP_QuestHelperFunctionLibrary_C_GetQuestList, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BP_QuestHelperFunctionLibrary_C_GetQuestList::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_QuestHelperFunctionLibrary_C_GetQuestList, CallFunc_GetQuestList_Quests) == 0x000030, "Member 'BP_QuestHelperFunctionLibrary_C_GetQuestList::CallFunc_GetQuestList_Quests' has a wrong offset!");

// Function BP_QuestHelperFunctionLibrary.BP_QuestHelperFunctionLibrary_C.GetObjectiveList
// 0x0048 (0x0048 - 0x0000)
struct BP_QuestHelperFunctionLibrary_C_GetObjectiveList final
{
public:
	class FName                                   QuestName;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FQuestObjectiveIdentifier>      ObjectiveIdentifiers;                              // 0x0010(0x0010)(Parm, OutParm)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_jRPG_GI_Custom_C*                   K2Node_DynamicCast_AsBP_J_RPG_GI_Custom;           // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FQuestObjectiveIdentifier>      CallFunc_GetObjectiveList_Objectives;              // 0x0038(0x0010)(ReferenceParm)
};
static_assert(alignof(BP_QuestHelperFunctionLibrary_C_GetObjectiveList) == 0x000008, "Wrong alignment on BP_QuestHelperFunctionLibrary_C_GetObjectiveList");
static_assert(sizeof(BP_QuestHelperFunctionLibrary_C_GetObjectiveList) == 0x000048, "Wrong size on BP_QuestHelperFunctionLibrary_C_GetObjectiveList");
static_assert(offsetof(BP_QuestHelperFunctionLibrary_C_GetObjectiveList, QuestName) == 0x000000, "Member 'BP_QuestHelperFunctionLibrary_C_GetObjectiveList::QuestName' has a wrong offset!");
static_assert(offsetof(BP_QuestHelperFunctionLibrary_C_GetObjectiveList, __WorldContext) == 0x000008, "Member 'BP_QuestHelperFunctionLibrary_C_GetObjectiveList::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_QuestHelperFunctionLibrary_C_GetObjectiveList, ObjectiveIdentifiers) == 0x000010, "Member 'BP_QuestHelperFunctionLibrary_C_GetObjectiveList::ObjectiveIdentifiers' has a wrong offset!");
static_assert(offsetof(BP_QuestHelperFunctionLibrary_C_GetObjectiveList, CallFunc_GetGameInstance_ReturnValue) == 0x000020, "Member 'BP_QuestHelperFunctionLibrary_C_GetObjectiveList::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_QuestHelperFunctionLibrary_C_GetObjectiveList, K2Node_DynamicCast_AsBP_J_RPG_GI_Custom) == 0x000028, "Member 'BP_QuestHelperFunctionLibrary_C_GetObjectiveList::K2Node_DynamicCast_AsBP_J_RPG_GI_Custom' has a wrong offset!");
static_assert(offsetof(BP_QuestHelperFunctionLibrary_C_GetObjectiveList, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'BP_QuestHelperFunctionLibrary_C_GetObjectiveList::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_QuestHelperFunctionLibrary_C_GetObjectiveList, CallFunc_GetObjectiveList_Objectives) == 0x000038, "Member 'BP_QuestHelperFunctionLibrary_C_GetObjectiveList::CallFunc_GetObjectiveList_Objectives' has a wrong offset!");

// Function BP_QuestHelperFunctionLibrary.BP_QuestHelperFunctionLibrary_C.GetObjectiveStatus
// 0x0030 (0x0030 - 0x0000)
struct BP_QuestHelperFunctionLibrary_C_GetObjectiveStatus final
{
public:
	struct FQuestObjectiveIdentifier              QuestObjective;                                    // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	E_QuestStatus                                 Status;                                            // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_QuestSystem_C*                      CallFunc_GetQuestSystem_QuestSystem;               // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	E_QuestStatus                                 CallFunc_GetObjectiveStatus_Status;                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_QuestHelperFunctionLibrary_C_GetObjectiveStatus) == 0x000008, "Wrong alignment on BP_QuestHelperFunctionLibrary_C_GetObjectiveStatus");
static_assert(sizeof(BP_QuestHelperFunctionLibrary_C_GetObjectiveStatus) == 0x000030, "Wrong size on BP_QuestHelperFunctionLibrary_C_GetObjectiveStatus");
static_assert(offsetof(BP_QuestHelperFunctionLibrary_C_GetObjectiveStatus, QuestObjective) == 0x000000, "Member 'BP_QuestHelperFunctionLibrary_C_GetObjectiveStatus::QuestObjective' has a wrong offset!");
static_assert(offsetof(BP_QuestHelperFunctionLibrary_C_GetObjectiveStatus, __WorldContext) == 0x000010, "Member 'BP_QuestHelperFunctionLibrary_C_GetObjectiveStatus::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_QuestHelperFunctionLibrary_C_GetObjectiveStatus, Status) == 0x000018, "Member 'BP_QuestHelperFunctionLibrary_C_GetObjectiveStatus::Status' has a wrong offset!");
static_assert(offsetof(BP_QuestHelperFunctionLibrary_C_GetObjectiveStatus, CallFunc_GetQuestSystem_QuestSystem) == 0x000020, "Member 'BP_QuestHelperFunctionLibrary_C_GetObjectiveStatus::CallFunc_GetQuestSystem_QuestSystem' has a wrong offset!");
static_assert(offsetof(BP_QuestHelperFunctionLibrary_C_GetObjectiveStatus, CallFunc_GetObjectiveStatus_Status) == 0x000028, "Member 'BP_QuestHelperFunctionLibrary_C_GetObjectiveStatus::CallFunc_GetObjectiveStatus_Status' has a wrong offset!");

// Function BP_QuestHelperFunctionLibrary.BP_QuestHelperFunctionLibrary_C.GetQuestStatus
// 0x0028 (0x0028 - 0x0000)
struct BP_QuestHelperFunctionLibrary_C_GetQuestStatus final
{
public:
	class FName                                   QuestName;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	E_QuestStatus                                 Status;                                            // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_QuestSystem_C*                      CallFunc_GetQuestSystem_QuestSystem;               // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	E_QuestStatus                                 CallFunc_GetQuestStatus_Status;                    // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_QuestHelperFunctionLibrary_C_GetQuestStatus) == 0x000008, "Wrong alignment on BP_QuestHelperFunctionLibrary_C_GetQuestStatus");
static_assert(sizeof(BP_QuestHelperFunctionLibrary_C_GetQuestStatus) == 0x000028, "Wrong size on BP_QuestHelperFunctionLibrary_C_GetQuestStatus");
static_assert(offsetof(BP_QuestHelperFunctionLibrary_C_GetQuestStatus, QuestName) == 0x000000, "Member 'BP_QuestHelperFunctionLibrary_C_GetQuestStatus::QuestName' has a wrong offset!");
static_assert(offsetof(BP_QuestHelperFunctionLibrary_C_GetQuestStatus, __WorldContext) == 0x000008, "Member 'BP_QuestHelperFunctionLibrary_C_GetQuestStatus::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_QuestHelperFunctionLibrary_C_GetQuestStatus, Status) == 0x000010, "Member 'BP_QuestHelperFunctionLibrary_C_GetQuestStatus::Status' has a wrong offset!");
static_assert(offsetof(BP_QuestHelperFunctionLibrary_C_GetQuestStatus, CallFunc_GetQuestSystem_QuestSystem) == 0x000018, "Member 'BP_QuestHelperFunctionLibrary_C_GetQuestStatus::CallFunc_GetQuestSystem_QuestSystem' has a wrong offset!");
static_assert(offsetof(BP_QuestHelperFunctionLibrary_C_GetQuestStatus, CallFunc_GetQuestStatus_Status) == 0x000020, "Member 'BP_QuestHelperFunctionLibrary_C_GetQuestStatus::CallFunc_GetQuestStatus_Status' has a wrong offset!");

// Function BP_QuestHelperFunctionLibrary.BP_QuestHelperFunctionLibrary_C.GetQuestSystem
// 0x0018 (0x0018 - 0x0000)
struct BP_QuestHelperFunctionLibrary_C_GetQuestSystem final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_QuestSystem_C*                      QuestSystem;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_jRPG_GI_Custom_C*                   CallFunc_GetCustomGI_ReturnValue;                  // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_QuestHelperFunctionLibrary_C_GetQuestSystem) == 0x000008, "Wrong alignment on BP_QuestHelperFunctionLibrary_C_GetQuestSystem");
static_assert(sizeof(BP_QuestHelperFunctionLibrary_C_GetQuestSystem) == 0x000018, "Wrong size on BP_QuestHelperFunctionLibrary_C_GetQuestSystem");
static_assert(offsetof(BP_QuestHelperFunctionLibrary_C_GetQuestSystem, __WorldContext) == 0x000000, "Member 'BP_QuestHelperFunctionLibrary_C_GetQuestSystem::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_QuestHelperFunctionLibrary_C_GetQuestSystem, QuestSystem) == 0x000008, "Member 'BP_QuestHelperFunctionLibrary_C_GetQuestSystem::QuestSystem' has a wrong offset!");
static_assert(offsetof(BP_QuestHelperFunctionLibrary_C_GetQuestSystem, CallFunc_GetCustomGI_ReturnValue) == 0x000010, "Member 'BP_QuestHelperFunctionLibrary_C_GetQuestSystem::CallFunc_GetCustomGI_ReturnValue' has a wrong offset!");

}

