#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ReadingCube

#include "Basic.hpp"

#include "S_jRPG_Item_StaticData_structs.hpp"
#include "Engine_structs.hpp"
#include "S_GameplayPauseParameters_structs.hpp"


namespace SDK::Params
{

// Function BP_ReadingCube.BP_ReadingCube_C.CheckForErrors
// 0x0260 (0x0260 - 0x0000)
struct BP_ReadingCube_C_CheckForErrors final
{
public:
	TArray<class FText>                           ErrorMessages;                                     // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_jRPG_Item_StaticData                CallFunc_GetDataTableRowFromName_OutRow;           // 0x0018(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_149[0x7];                                      // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_NameToText_ReturnValue;              // 0x0150(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0160(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x01A8(0x0010)(ReferenceParm)
	class UBP_DataAsset_Item_Journal_C*           K2Node_DynamicCast_AsBP_Data_Asset_Item_Journal;   // 0x01B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C1[0x7];                                      // 0x01C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x01C8(0x0010)()
	class FText                                   CallFunc_Conv_NameToText_ReturnValue_1;            // 0x01D8(0x0010)()
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1EC[0x4];                                      // 0x01EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x01F0(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0238(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0248(0x0010)()
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0258(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ReadingCube_C_CheckForErrors) == 0x000008, "Wrong alignment on BP_ReadingCube_C_CheckForErrors");
static_assert(sizeof(BP_ReadingCube_C_CheckForErrors) == 0x000260, "Wrong size on BP_ReadingCube_C_CheckForErrors");
static_assert(offsetof(BP_ReadingCube_C_CheckForErrors, ErrorMessages) == 0x000000, "Member 'BP_ReadingCube_C_CheckForErrors::ErrorMessages' has a wrong offset!");
static_assert(offsetof(BP_ReadingCube_C_CheckForErrors, ReturnValue) == 0x000010, "Member 'BP_ReadingCube_C_CheckForErrors::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ReadingCube_C_CheckForErrors, CallFunc_GetDataTableRowFromName_OutRow) == 0x000018, "Member 'BP_ReadingCube_C_CheckForErrors::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BP_ReadingCube_C_CheckForErrors, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000148, "Member 'BP_ReadingCube_C_CheckForErrors::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ReadingCube_C_CheckForErrors, CallFunc_Conv_NameToText_ReturnValue) == 0x000150, "Member 'BP_ReadingCube_C_CheckForErrors::CallFunc_Conv_NameToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ReadingCube_C_CheckForErrors, K2Node_MakeStruct_FormatArgumentData) == 0x000160, "Member 'BP_ReadingCube_C_CheckForErrors::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_ReadingCube_C_CheckForErrors, K2Node_MakeArray_Array) == 0x0001A8, "Member 'BP_ReadingCube_C_CheckForErrors::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_ReadingCube_C_CheckForErrors, K2Node_DynamicCast_AsBP_Data_Asset_Item_Journal) == 0x0001B8, "Member 'BP_ReadingCube_C_CheckForErrors::K2Node_DynamicCast_AsBP_Data_Asset_Item_Journal' has a wrong offset!");
static_assert(offsetof(BP_ReadingCube_C_CheckForErrors, K2Node_DynamicCast_bSuccess) == 0x0001C0, "Member 'BP_ReadingCube_C_CheckForErrors::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ReadingCube_C_CheckForErrors, CallFunc_Format_ReturnValue) == 0x0001C8, "Member 'BP_ReadingCube_C_CheckForErrors::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ReadingCube_C_CheckForErrors, CallFunc_Conv_NameToText_ReturnValue_1) == 0x0001D8, "Member 'BP_ReadingCube_C_CheckForErrors::CallFunc_Conv_NameToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ReadingCube_C_CheckForErrors, CallFunc_Array_Add_ReturnValue) == 0x0001E8, "Member 'BP_ReadingCube_C_CheckForErrors::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ReadingCube_C_CheckForErrors, K2Node_MakeStruct_FormatArgumentData_1) == 0x0001F0, "Member 'BP_ReadingCube_C_CheckForErrors::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BP_ReadingCube_C_CheckForErrors, K2Node_MakeArray_Array_1) == 0x000238, "Member 'BP_ReadingCube_C_CheckForErrors::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BP_ReadingCube_C_CheckForErrors, CallFunc_Format_ReturnValue_1) == 0x000248, "Member 'BP_ReadingCube_C_CheckForErrors::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ReadingCube_C_CheckForErrors, CallFunc_Array_Add_ReturnValue_1) == 0x000258, "Member 'BP_ReadingCube_C_CheckForErrors::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");

// Function BP_ReadingCube.BP_ReadingCube_C.ExecuteUbergraph_BP_ReadingCube
// 0x0050 (0x0050 - 0x0000)
struct BP_ReadingCube_C_ExecuteUbergraph_BP_ReadingCube final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_jRPG_Character_World_C*             K2Node_Event_InteractingWorldCharacter;            // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_Instant;                              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSound2D_ReturnValue;                 // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FS_GameplayPauseParameters             K2Node_MakeStruct_S_GameplayPauseParameters;       // 0x0020(0x0030)(HasGetValueTypeHash)
};
static_assert(alignof(BP_ReadingCube_C_ExecuteUbergraph_BP_ReadingCube) == 0x000008, "Wrong alignment on BP_ReadingCube_C_ExecuteUbergraph_BP_ReadingCube");
static_assert(sizeof(BP_ReadingCube_C_ExecuteUbergraph_BP_ReadingCube) == 0x000050, "Wrong size on BP_ReadingCube_C_ExecuteUbergraph_BP_ReadingCube");
static_assert(offsetof(BP_ReadingCube_C_ExecuteUbergraph_BP_ReadingCube, EntryPoint) == 0x000000, "Member 'BP_ReadingCube_C_ExecuteUbergraph_BP_ReadingCube::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ReadingCube_C_ExecuteUbergraph_BP_ReadingCube, K2Node_Event_InteractingWorldCharacter) == 0x000008, "Member 'BP_ReadingCube_C_ExecuteUbergraph_BP_ReadingCube::K2Node_Event_InteractingWorldCharacter' has a wrong offset!");
static_assert(offsetof(BP_ReadingCube_C_ExecuteUbergraph_BP_ReadingCube, K2Node_Event_Instant) == 0x000010, "Member 'BP_ReadingCube_C_ExecuteUbergraph_BP_ReadingCube::K2Node_Event_Instant' has a wrong offset!");
static_assert(offsetof(BP_ReadingCube_C_ExecuteUbergraph_BP_ReadingCube, CallFunc_SpawnSound2D_ReturnValue) == 0x000018, "Member 'BP_ReadingCube_C_ExecuteUbergraph_BP_ReadingCube::CallFunc_SpawnSound2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ReadingCube_C_ExecuteUbergraph_BP_ReadingCube, K2Node_MakeStruct_S_GameplayPauseParameters) == 0x000020, "Member 'BP_ReadingCube_C_ExecuteUbergraph_BP_ReadingCube::K2Node_MakeStruct_S_GameplayPauseParameters' has a wrong offset!");

// Function BP_ReadingCube.BP_ReadingCube_C.GetJournalItemHardcodedName
// 0x0140 (0x0140 - 0x0000)
struct BP_ReadingCube_C_GetJournalItemHardcodedName final
{
public:
	class FName                                   Name_0;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_jRPG_Item_StaticData                CallFunc_GetDataTableRowFromName_OutRow;           // 0x0008(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ReadingCube_C_GetJournalItemHardcodedName) == 0x000008, "Wrong alignment on BP_ReadingCube_C_GetJournalItemHardcodedName");
static_assert(sizeof(BP_ReadingCube_C_GetJournalItemHardcodedName) == 0x000140, "Wrong size on BP_ReadingCube_C_GetJournalItemHardcodedName");
static_assert(offsetof(BP_ReadingCube_C_GetJournalItemHardcodedName, Name_0) == 0x000000, "Member 'BP_ReadingCube_C_GetJournalItemHardcodedName::Name_0' has a wrong offset!");
static_assert(offsetof(BP_ReadingCube_C_GetJournalItemHardcodedName, CallFunc_GetDataTableRowFromName_OutRow) == 0x000008, "Member 'BP_ReadingCube_C_GetJournalItemHardcodedName::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BP_ReadingCube_C_GetJournalItemHardcodedName, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000138, "Member 'BP_ReadingCube_C_GetJournalItemHardcodedName::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");

// Function BP_ReadingCube.BP_ReadingCube_C.OnInteractionRequested
// 0x0010 (0x0010 - 0x0000)
struct BP_ReadingCube_C_OnInteractionRequested final
{
public:
	class ABP_jRPG_Character_World_C*             InteractingWorldCharacter;                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Instant;                                           // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ReadingCube_C_OnInteractionRequested) == 0x000008, "Wrong alignment on BP_ReadingCube_C_OnInteractionRequested");
static_assert(sizeof(BP_ReadingCube_C_OnInteractionRequested) == 0x000010, "Wrong size on BP_ReadingCube_C_OnInteractionRequested");
static_assert(offsetof(BP_ReadingCube_C_OnInteractionRequested, InteractingWorldCharacter) == 0x000000, "Member 'BP_ReadingCube_C_OnInteractionRequested::InteractingWorldCharacter' has a wrong offset!");
static_assert(offsetof(BP_ReadingCube_C_OnInteractionRequested, Instant) == 0x000008, "Member 'BP_ReadingCube_C_OnInteractionRequested::Instant' has a wrong offset!");

// Function BP_ReadingCube.BP_ReadingCube_C.OnPutAwayDocument
// 0x0068 (0x0068 - 0x0000)
struct BP_ReadingCube_C_OnPutAwayDocument final
{
public:
	struct FS_GameplayPauseParameters             K2Node_MakeStruct_S_GameplayPauseParameters;       // 0x0000(0x0030)(HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetJournalItemHardcodedName_Name;         // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_jRPG_Controller_World_C*            K2Node_DynamicCast_AsBP_J_RPG_Controller_World;    // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsNameValid_ReturnValue;                  // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAC_jRPG_InventoryManager_C*            CallFunc_GetInventoryManager_ReturnValue;          // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UBP_GeneratedItemInfo_Base_C*           CallFunc_AddItemToInventory_GeneratedItem;         // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidGameActionWrapper_IsValid;         // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ReadingCube_C_OnPutAwayDocument) == 0x000008, "Wrong alignment on BP_ReadingCube_C_OnPutAwayDocument");
static_assert(sizeof(BP_ReadingCube_C_OnPutAwayDocument) == 0x000068, "Wrong size on BP_ReadingCube_C_OnPutAwayDocument");
static_assert(offsetof(BP_ReadingCube_C_OnPutAwayDocument, K2Node_MakeStruct_S_GameplayPauseParameters) == 0x000000, "Member 'BP_ReadingCube_C_OnPutAwayDocument::K2Node_MakeStruct_S_GameplayPauseParameters' has a wrong offset!");
static_assert(offsetof(BP_ReadingCube_C_OnPutAwayDocument, CallFunc_GetPlayerController_ReturnValue) == 0x000030, "Member 'BP_ReadingCube_C_OnPutAwayDocument::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ReadingCube_C_OnPutAwayDocument, CallFunc_GetJournalItemHardcodedName_Name) == 0x000038, "Member 'BP_ReadingCube_C_OnPutAwayDocument::CallFunc_GetJournalItemHardcodedName_Name' has a wrong offset!");
static_assert(offsetof(BP_ReadingCube_C_OnPutAwayDocument, K2Node_DynamicCast_AsBP_J_RPG_Controller_World) == 0x000040, "Member 'BP_ReadingCube_C_OnPutAwayDocument::K2Node_DynamicCast_AsBP_J_RPG_Controller_World' has a wrong offset!");
static_assert(offsetof(BP_ReadingCube_C_OnPutAwayDocument, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'BP_ReadingCube_C_OnPutAwayDocument::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ReadingCube_C_OnPutAwayDocument, CallFunc_IsNameValid_ReturnValue) == 0x000049, "Member 'BP_ReadingCube_C_OnPutAwayDocument::CallFunc_IsNameValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ReadingCube_C_OnPutAwayDocument, CallFunc_GetInventoryManager_ReturnValue) == 0x000050, "Member 'BP_ReadingCube_C_OnPutAwayDocument::CallFunc_GetInventoryManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ReadingCube_C_OnPutAwayDocument, CallFunc_AddItemToInventory_GeneratedItem) == 0x000058, "Member 'BP_ReadingCube_C_OnPutAwayDocument::CallFunc_AddItemToInventory_GeneratedItem' has a wrong offset!");
static_assert(offsetof(BP_ReadingCube_C_OnPutAwayDocument, CallFunc_IsValidGameActionWrapper_IsValid) == 0x000060, "Member 'BP_ReadingCube_C_OnPutAwayDocument::CallFunc_IsValidGameActionWrapper_IsValid' has a wrong offset!");
static_assert(offsetof(BP_ReadingCube_C_OnPutAwayDocument, CallFunc_IsValid_ReturnValue) == 0x000061, "Member 'BP_ReadingCube_C_OnPutAwayDocument::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

