#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SaveGameObjectUpgrader_V1_To_V2

#include "Basic.hpp"

#include "BP_SaveGameObjectUpgrader_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_SaveGameObjectUpgrader_V1_To_V2.BP_SaveGameObjectUpgrader_V1_To_V2_C
// 0x0018 (0x0050 - 0x0038)
class UBP_SaveGameObjectUpgrader_V1_To_V2_C final : public UBP_SaveGameObjectUpgrader_C
{
public:
	class FName                                   WorldMap_TriggerZone_IWD_EntrySpringMeadow_ObjectID; // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   WorldMap_TriggerZone_EnterWorldMap_ObjectID;       // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNamedID*                               WorldMap_NamedID_EnterWorldMap;                    // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void PatchPersistentFlags(class UBP_SaveGameObject_V1_C* From, class UBP_SaveGameObject_V2_C* To);
	void ProcessUpgradeSaveGameObject(class UBP_SaveGameBase_C* FromSaveGameObject, class UBP_SaveGameBase_C* ToSaveGameObject);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_SaveGameObjectUpgrader_V1_To_V2_C">();
	}
	static class UBP_SaveGameObjectUpgrader_V1_To_V2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_SaveGameObjectUpgrader_V1_To_V2_C>();
	}
};
static_assert(alignof(UBP_SaveGameObjectUpgrader_V1_To_V2_C) == 0x000008, "Wrong alignment on UBP_SaveGameObjectUpgrader_V1_To_V2_C");
static_assert(sizeof(UBP_SaveGameObjectUpgrader_V1_To_V2_C) == 0x000050, "Wrong size on UBP_SaveGameObjectUpgrader_V1_To_V2_C");
static_assert(offsetof(UBP_SaveGameObjectUpgrader_V1_To_V2_C, WorldMap_TriggerZone_IWD_EntrySpringMeadow_ObjectID) == 0x000038, "Member 'UBP_SaveGameObjectUpgrader_V1_To_V2_C::WorldMap_TriggerZone_IWD_EntrySpringMeadow_ObjectID' has a wrong offset!");
static_assert(offsetof(UBP_SaveGameObjectUpgrader_V1_To_V2_C, WorldMap_TriggerZone_EnterWorldMap_ObjectID) == 0x000040, "Member 'UBP_SaveGameObjectUpgrader_V1_To_V2_C::WorldMap_TriggerZone_EnterWorldMap_ObjectID' has a wrong offset!");
static_assert(offsetof(UBP_SaveGameObjectUpgrader_V1_To_V2_C, WorldMap_NamedID_EnterWorldMap) == 0x000048, "Member 'UBP_SaveGameObjectUpgrader_V1_To_V2_C::WorldMap_NamedID_EnterWorldMap' has a wrong offset!");

}

