#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SkillDataComponent_StainsMechanic

#include "Basic.hpp"

#include "EAttackType_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_SkillDataComponent_StainsMechanic.BP_SkillDataComponent_StainsMechanic_C.IsOverchargeActive
// 0x01B8 (0x01B8 - 0x0000)
struct BP_SkillDataComponent_StainsMechanic_C_IsOverchargeActive final
{
public:
	class UAC_jRPG_CharacterBattleStats_C*        CharacterStat;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Active;                                            // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<EAttackType, int32>                      local_characterStains;                             // 0x0010(0x0050)(Edit, BlueprintVisible)
	TMap<EAttackType, int32>                      K2Node_MakeVariable_MakeVariableOutput;            // 0x0060(0x0050)()
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x00B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UBP_StainHolderComponent_C*             CallFunc_GetComponentByClass_ReturnValue;          // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x00D0(0x0010)()
	TMap<EAttackType, int32>                      CallFunc_Get_Active_Stain_Count_By_Type_result;    // 0x00E0(0x0050)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0130(0x0048)(HasGetValueTypeHash)
	bool                                          CallFunc_CanOverchargeWithDarkStains_ReturnValue;  // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_179[0x7];                                      // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0180(0x0010)(ReferenceParm)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_191[0x7];                                      // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0198(0x0010)()
	EAttackType                                   Temp_byte_Variable;                                // 0x01A8(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A9[0x3];                                      // 0x01A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Map_Find_Value;                           // 0x01AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_IsNotEmpty_ReturnValue;               // 0x01B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x01B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x01B3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasStainQuantities_ReturnValue;           // 0x01B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x01B5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SkillDataComponent_StainsMechanic_C_IsOverchargeActive) == 0x000008, "Wrong alignment on BP_SkillDataComponent_StainsMechanic_C_IsOverchargeActive");
static_assert(sizeof(BP_SkillDataComponent_StainsMechanic_C_IsOverchargeActive) == 0x0001B8, "Wrong size on BP_SkillDataComponent_StainsMechanic_C_IsOverchargeActive");
static_assert(offsetof(BP_SkillDataComponent_StainsMechanic_C_IsOverchargeActive, CharacterStat) == 0x000000, "Member 'BP_SkillDataComponent_StainsMechanic_C_IsOverchargeActive::CharacterStat' has a wrong offset!");
static_assert(offsetof(BP_SkillDataComponent_StainsMechanic_C_IsOverchargeActive, Active) == 0x000008, "Member 'BP_SkillDataComponent_StainsMechanic_C_IsOverchargeActive::Active' has a wrong offset!");
static_assert(offsetof(BP_SkillDataComponent_StainsMechanic_C_IsOverchargeActive, local_characterStains) == 0x000010, "Member 'BP_SkillDataComponent_StainsMechanic_C_IsOverchargeActive::local_characterStains' has a wrong offset!");
static_assert(offsetof(BP_SkillDataComponent_StainsMechanic_C_IsOverchargeActive, K2Node_MakeVariable_MakeVariableOutput) == 0x000060, "Member 'BP_SkillDataComponent_StainsMechanic_C_IsOverchargeActive::K2Node_MakeVariable_MakeVariableOutput' has a wrong offset!");
static_assert(offsetof(BP_SkillDataComponent_StainsMechanic_C_IsOverchargeActive, CallFunc_GetOwner_ReturnValue) == 0x0000B0, "Member 'BP_SkillDataComponent_StainsMechanic_C_IsOverchargeActive::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillDataComponent_StainsMechanic_C_IsOverchargeActive, CallFunc_GetDisplayName_ReturnValue) == 0x0000B8, "Member 'BP_SkillDataComponent_StainsMechanic_C_IsOverchargeActive::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillDataComponent_StainsMechanic_C_IsOverchargeActive, CallFunc_GetComponentByClass_ReturnValue) == 0x0000C8, "Member 'BP_SkillDataComponent_StainsMechanic_C_IsOverchargeActive::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillDataComponent_StainsMechanic_C_IsOverchargeActive, CallFunc_Conv_StringToText_ReturnValue) == 0x0000D0, "Member 'BP_SkillDataComponent_StainsMechanic_C_IsOverchargeActive::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillDataComponent_StainsMechanic_C_IsOverchargeActive, CallFunc_Get_Active_Stain_Count_By_Type_result) == 0x0000E0, "Member 'BP_SkillDataComponent_StainsMechanic_C_IsOverchargeActive::CallFunc_Get_Active_Stain_Count_By_Type_result' has a wrong offset!");
static_assert(offsetof(BP_SkillDataComponent_StainsMechanic_C_IsOverchargeActive, K2Node_MakeStruct_FormatArgumentData) == 0x000130, "Member 'BP_SkillDataComponent_StainsMechanic_C_IsOverchargeActive::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_SkillDataComponent_StainsMechanic_C_IsOverchargeActive, CallFunc_CanOverchargeWithDarkStains_ReturnValue) == 0x000178, "Member 'BP_SkillDataComponent_StainsMechanic_C_IsOverchargeActive::CallFunc_CanOverchargeWithDarkStains_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillDataComponent_StainsMechanic_C_IsOverchargeActive, K2Node_MakeArray_Array) == 0x000180, "Member 'BP_SkillDataComponent_StainsMechanic_C_IsOverchargeActive::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_SkillDataComponent_StainsMechanic_C_IsOverchargeActive, CallFunc_IsValid_ReturnValue) == 0x000190, "Member 'BP_SkillDataComponent_StainsMechanic_C_IsOverchargeActive::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillDataComponent_StainsMechanic_C_IsOverchargeActive, CallFunc_Format_ReturnValue) == 0x000198, "Member 'BP_SkillDataComponent_StainsMechanic_C_IsOverchargeActive::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillDataComponent_StainsMechanic_C_IsOverchargeActive, Temp_byte_Variable) == 0x0001A8, "Member 'BP_SkillDataComponent_StainsMechanic_C_IsOverchargeActive::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_SkillDataComponent_StainsMechanic_C_IsOverchargeActive, CallFunc_Map_Find_Value) == 0x0001AC, "Member 'BP_SkillDataComponent_StainsMechanic_C_IsOverchargeActive::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BP_SkillDataComponent_StainsMechanic_C_IsOverchargeActive, CallFunc_Map_Find_ReturnValue) == 0x0001B0, "Member 'BP_SkillDataComponent_StainsMechanic_C_IsOverchargeActive::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillDataComponent_StainsMechanic_C_IsOverchargeActive, CallFunc_Map_IsNotEmpty_ReturnValue) == 0x0001B1, "Member 'BP_SkillDataComponent_StainsMechanic_C_IsOverchargeActive::CallFunc_Map_IsNotEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillDataComponent_StainsMechanic_C_IsOverchargeActive, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0001B2, "Member 'BP_SkillDataComponent_StainsMechanic_C_IsOverchargeActive::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillDataComponent_StainsMechanic_C_IsOverchargeActive, CallFunc_BooleanAND_ReturnValue) == 0x0001B3, "Member 'BP_SkillDataComponent_StainsMechanic_C_IsOverchargeActive::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillDataComponent_StainsMechanic_C_IsOverchargeActive, CallFunc_HasStainQuantities_ReturnValue) == 0x0001B4, "Member 'BP_SkillDataComponent_StainsMechanic_C_IsOverchargeActive::CallFunc_HasStainQuantities_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillDataComponent_StainsMechanic_C_IsOverchargeActive, CallFunc_BooleanOR_ReturnValue) == 0x0001B5, "Member 'BP_SkillDataComponent_StainsMechanic_C_IsOverchargeActive::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function BP_SkillDataComponent_StainsMechanic.BP_SkillDataComponent_StainsMechanic_C.ModifySkillButton
// 0x0018 (0x0018 - 0x0000)
struct BP_SkillDataComponent_StainsMechanic_C_ModifySkillButton final
{
public:
	class UWBP_HUD_SkillButton_Big_C*             SkillButtonWidget;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Map_Length_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_SkillButtonModifier_RequiredStains_C* CallFunc_SpawnObject_ReturnValue;               // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SkillDataComponent_StainsMechanic_C_ModifySkillButton) == 0x000008, "Wrong alignment on BP_SkillDataComponent_StainsMechanic_C_ModifySkillButton");
static_assert(sizeof(BP_SkillDataComponent_StainsMechanic_C_ModifySkillButton) == 0x000018, "Wrong size on BP_SkillDataComponent_StainsMechanic_C_ModifySkillButton");
static_assert(offsetof(BP_SkillDataComponent_StainsMechanic_C_ModifySkillButton, SkillButtonWidget) == 0x000000, "Member 'BP_SkillDataComponent_StainsMechanic_C_ModifySkillButton::SkillButtonWidget' has a wrong offset!");
static_assert(offsetof(BP_SkillDataComponent_StainsMechanic_C_ModifySkillButton, CallFunc_Map_Length_ReturnValue) == 0x000008, "Member 'BP_SkillDataComponent_StainsMechanic_C_ModifySkillButton::CallFunc_Map_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillDataComponent_StainsMechanic_C_ModifySkillButton, CallFunc_NotEqual_IntInt_ReturnValue) == 0x00000C, "Member 'BP_SkillDataComponent_StainsMechanic_C_ModifySkillButton::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillDataComponent_StainsMechanic_C_ModifySkillButton, CallFunc_SpawnObject_ReturnValue) == 0x000010, "Member 'BP_SkillDataComponent_StainsMechanic_C_ModifySkillButton::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");

// Function BP_SkillDataComponent_StainsMechanic.BP_SkillDataComponent_StainsMechanic_C.ModifySkillTooltip
// 0x0018 (0x0018 - 0x0000)
struct BP_SkillDataComponent_StainsMechanic_C_ModifySkillTooltip final
{
public:
	class UWBP_SkillTooltip_C*                    SkillTooltipWidget;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_SkillButtonModifier_RequiredStains_C* CallFunc_SpawnObject_ReturnValue;               // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Map_Length_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SkillDataComponent_StainsMechanic_C_ModifySkillTooltip) == 0x000008, "Wrong alignment on BP_SkillDataComponent_StainsMechanic_C_ModifySkillTooltip");
static_assert(sizeof(BP_SkillDataComponent_StainsMechanic_C_ModifySkillTooltip) == 0x000018, "Wrong size on BP_SkillDataComponent_StainsMechanic_C_ModifySkillTooltip");
static_assert(offsetof(BP_SkillDataComponent_StainsMechanic_C_ModifySkillTooltip, SkillTooltipWidget) == 0x000000, "Member 'BP_SkillDataComponent_StainsMechanic_C_ModifySkillTooltip::SkillTooltipWidget' has a wrong offset!");
static_assert(offsetof(BP_SkillDataComponent_StainsMechanic_C_ModifySkillTooltip, CallFunc_SpawnObject_ReturnValue) == 0x000008, "Member 'BP_SkillDataComponent_StainsMechanic_C_ModifySkillTooltip::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillDataComponent_StainsMechanic_C_ModifySkillTooltip, CallFunc_Map_Length_ReturnValue) == 0x000010, "Member 'BP_SkillDataComponent_StainsMechanic_C_ModifySkillTooltip::CallFunc_Map_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillDataComponent_StainsMechanic_C_ModifySkillTooltip, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000014, "Member 'BP_SkillDataComponent_StainsMechanic_C_ModifySkillTooltip::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");

// Function BP_SkillDataComponent_StainsMechanic.BP_SkillDataComponent_StainsMechanic_C.RegisterSkillChecks
// 0x0028 (0x0028 - 0x0000)
struct BP_SkillDataComponent_StainsMechanic_C_RegisterSkillChecks final
{
public:
	class UAC_jRPG_CharacterBattleStats_C*        CharacterStats;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<EAttackType>                           CallFunc_Map_Keys_Keys;                            // 0x0010(0x0010)(ReferenceParm)
	class UBP_StainHolderComponent_C*             CallFunc_GetComponentByClass_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SkillDataComponent_StainsMechanic_C_RegisterSkillChecks) == 0x000008, "Wrong alignment on BP_SkillDataComponent_StainsMechanic_C_RegisterSkillChecks");
static_assert(sizeof(BP_SkillDataComponent_StainsMechanic_C_RegisterSkillChecks) == 0x000028, "Wrong size on BP_SkillDataComponent_StainsMechanic_C_RegisterSkillChecks");
static_assert(offsetof(BP_SkillDataComponent_StainsMechanic_C_RegisterSkillChecks, CharacterStats) == 0x000000, "Member 'BP_SkillDataComponent_StainsMechanic_C_RegisterSkillChecks::CharacterStats' has a wrong offset!");
static_assert(offsetof(BP_SkillDataComponent_StainsMechanic_C_RegisterSkillChecks, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'BP_SkillDataComponent_StainsMechanic_C_RegisterSkillChecks::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillDataComponent_StainsMechanic_C_RegisterSkillChecks, CallFunc_Map_Keys_Keys) == 0x000010, "Member 'BP_SkillDataComponent_StainsMechanic_C_RegisterSkillChecks::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(BP_SkillDataComponent_StainsMechanic_C_RegisterSkillChecks, CallFunc_GetComponentByClass_ReturnValue) == 0x000020, "Member 'BP_SkillDataComponent_StainsMechanic_C_RegisterSkillChecks::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");

}

