#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SaveGameObject_V1

#include "Basic.hpp"

#include "S_UIFavoritePool_structs.hpp"
#include "S_UINotificationPool_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "S_LevelSpawnPointData_structs.hpp"
#include "BP_SaveGameObject_V0_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_SaveGameObject_V1.BP_SaveGameObject_V1_C
// 0x00C0 (0x0B20 - 0x0A60)
class UBP_SaveGameObject_V1_C : public UBP_SaveGameObject_V0_C
{
public:
	TMap<struct FGameplayTag, struct FS_UINotificationPool> NotificationPools;                       // 0x0A60(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<struct FGameplayTag, struct FS_UIFavoritePool> FavoritePools;                               // 0x0AB0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FS_LevelSpawnPointData                 LastUsedSavePoint;                                 // 0x0B00(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           VisitedLevelRowNames;                              // 0x0B10(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_SaveGameObject_V1_C">();
	}
	static class UBP_SaveGameObject_V1_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_SaveGameObject_V1_C>();
	}
};
static_assert(alignof(UBP_SaveGameObject_V1_C) == 0x000010, "Wrong alignment on UBP_SaveGameObject_V1_C");
static_assert(sizeof(UBP_SaveGameObject_V1_C) == 0x000B20, "Wrong size on UBP_SaveGameObject_V1_C");
static_assert(offsetof(UBP_SaveGameObject_V1_C, NotificationPools) == 0x000A60, "Member 'UBP_SaveGameObject_V1_C::NotificationPools' has a wrong offset!");
static_assert(offsetof(UBP_SaveGameObject_V1_C, FavoritePools) == 0x000AB0, "Member 'UBP_SaveGameObject_V1_C::FavoritePools' has a wrong offset!");
static_assert(offsetof(UBP_SaveGameObject_V1_C, LastUsedSavePoint) == 0x000B00, "Member 'UBP_SaveGameObject_V1_C::LastUsedSavePoint' has a wrong offset!");
static_assert(offsetof(UBP_SaveGameObject_V1_C, VisitedLevelRowNames) == 0x000B10, "Member 'UBP_SaveGameObject_V1_C::VisitedLevelRowNames' has a wrong offset!");

}

