#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SkillDataComponent_ApplyBuffOnBattleStart

#include "Basic.hpp"

#include "BP_SkillDataComponent_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_SkillDataComponent_ApplyBuffOnBattleStart.BP_SkillDataComponent_ApplyBuffOnBattleStart_C
// 0x0028 (0x0058 - 0x0030)
class UBP_SkillDataComponent_ApplyBuffOnBattleStart_C final : public UBP_SkillDataComponent_Base_C
{
public:
	class UClass*                                 BuffClass;                                         // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          ForcePermanent;                                    // 0x0038(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          FeedbackAsBattleStartEvent;                        // 0x0039(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        FeedbackDelayBeforeBuff;                           // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        FeedbackDelayAfterBuff;                            // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TurnDurationIfNotPermanent;                        // 0x0050(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_SkillDataComponent_ApplyBuffOnBattleStart_C">();
	}
	static class UBP_SkillDataComponent_ApplyBuffOnBattleStart_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_SkillDataComponent_ApplyBuffOnBattleStart_C>();
	}
};
static_assert(alignof(UBP_SkillDataComponent_ApplyBuffOnBattleStart_C) == 0x000008, "Wrong alignment on UBP_SkillDataComponent_ApplyBuffOnBattleStart_C");
static_assert(sizeof(UBP_SkillDataComponent_ApplyBuffOnBattleStart_C) == 0x000058, "Wrong size on UBP_SkillDataComponent_ApplyBuffOnBattleStart_C");
static_assert(offsetof(UBP_SkillDataComponent_ApplyBuffOnBattleStart_C, BuffClass) == 0x000030, "Member 'UBP_SkillDataComponent_ApplyBuffOnBattleStart_C::BuffClass' has a wrong offset!");
static_assert(offsetof(UBP_SkillDataComponent_ApplyBuffOnBattleStart_C, ForcePermanent) == 0x000038, "Member 'UBP_SkillDataComponent_ApplyBuffOnBattleStart_C::ForcePermanent' has a wrong offset!");
static_assert(offsetof(UBP_SkillDataComponent_ApplyBuffOnBattleStart_C, FeedbackAsBattleStartEvent) == 0x000039, "Member 'UBP_SkillDataComponent_ApplyBuffOnBattleStart_C::FeedbackAsBattleStartEvent' has a wrong offset!");
static_assert(offsetof(UBP_SkillDataComponent_ApplyBuffOnBattleStart_C, FeedbackDelayBeforeBuff) == 0x000040, "Member 'UBP_SkillDataComponent_ApplyBuffOnBattleStart_C::FeedbackDelayBeforeBuff' has a wrong offset!");
static_assert(offsetof(UBP_SkillDataComponent_ApplyBuffOnBattleStart_C, FeedbackDelayAfterBuff) == 0x000048, "Member 'UBP_SkillDataComponent_ApplyBuffOnBattleStart_C::FeedbackDelayAfterBuff' has a wrong offset!");
static_assert(offsetof(UBP_SkillDataComponent_ApplyBuffOnBattleStart_C, TurnDurationIfNotPermanent) == 0x000050, "Member 'UBP_SkillDataComponent_ApplyBuffOnBattleStart_C::TurnDurationIfNotPermanent' has a wrong offset!");

}

