#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SkillDataComponent_PerformBreakStun

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function BP_SkillDataComponent_PerformBreakStun.BP_SkillDataComponent_PerformBreakStun_C.IsOverchargeActiveFeedbackForced
// 0x0038 (0x0038 - 0x0000)
struct BP_SkillDataComponent_PerformBreakStun_C_IsOverchargeActiveFeedbackForced final
{
public:
	class UAC_jRPG_CharacterBattleStats_C*        CharacterStat;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Active;                                            // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAC_jRPG_TargetingManager_C*            CallFunc_GetTargetingManager_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_jRPG_Character_Battle_Base_C*       CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanPerformBreakStun_ReturnValue;          // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SkillDataComponent_PerformBreakStun_C_IsOverchargeActiveFeedbackForced) == 0x000008, "Wrong alignment on BP_SkillDataComponent_PerformBreakStun_C_IsOverchargeActiveFeedbackForced");
static_assert(sizeof(BP_SkillDataComponent_PerformBreakStun_C_IsOverchargeActiveFeedbackForced) == 0x000038, "Wrong size on BP_SkillDataComponent_PerformBreakStun_C_IsOverchargeActiveFeedbackForced");
static_assert(offsetof(BP_SkillDataComponent_PerformBreakStun_C_IsOverchargeActiveFeedbackForced, CharacterStat) == 0x000000, "Member 'BP_SkillDataComponent_PerformBreakStun_C_IsOverchargeActiveFeedbackForced::CharacterStat' has a wrong offset!");
static_assert(offsetof(BP_SkillDataComponent_PerformBreakStun_C_IsOverchargeActiveFeedbackForced, Active) == 0x000008, "Member 'BP_SkillDataComponent_PerformBreakStun_C_IsOverchargeActiveFeedbackForced::Active' has a wrong offset!");
static_assert(offsetof(BP_SkillDataComponent_PerformBreakStun_C_IsOverchargeActiveFeedbackForced, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'BP_SkillDataComponent_PerformBreakStun_C_IsOverchargeActiveFeedbackForced::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_SkillDataComponent_PerformBreakStun_C_IsOverchargeActiveFeedbackForced, CallFunc_GetTargetingManager_ReturnValue) == 0x000010, "Member 'BP_SkillDataComponent_PerformBreakStun_C_IsOverchargeActiveFeedbackForced::CallFunc_GetTargetingManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillDataComponent_PerformBreakStun_C_IsOverchargeActiveFeedbackForced, Temp_int_Loop_Counter_Variable) == 0x000018, "Member 'BP_SkillDataComponent_PerformBreakStun_C_IsOverchargeActiveFeedbackForced::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_SkillDataComponent_PerformBreakStun_C_IsOverchargeActiveFeedbackForced, CallFunc_Array_Get_Item) == 0x000020, "Member 'BP_SkillDataComponent_PerformBreakStun_C_IsOverchargeActiveFeedbackForced::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_SkillDataComponent_PerformBreakStun_C_IsOverchargeActiveFeedbackForced, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'BP_SkillDataComponent_PerformBreakStun_C_IsOverchargeActiveFeedbackForced::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillDataComponent_PerformBreakStun_C_IsOverchargeActiveFeedbackForced, CallFunc_CanPerformBreakStun_ReturnValue) == 0x00002C, "Member 'BP_SkillDataComponent_PerformBreakStun_C_IsOverchargeActiveFeedbackForced::CallFunc_CanPerformBreakStun_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillDataComponent_PerformBreakStun_C_IsOverchargeActiveFeedbackForced, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'BP_SkillDataComponent_PerformBreakStun_C_IsOverchargeActiveFeedbackForced::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillDataComponent_PerformBreakStun_C_IsOverchargeActiveFeedbackForced, CallFunc_Less_IntInt_ReturnValue) == 0x000034, "Member 'BP_SkillDataComponent_PerformBreakStun_C_IsOverchargeActiveFeedbackForced::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function BP_SkillDataComponent_PerformBreakStun.BP_SkillDataComponent_PerformBreakStun_C.ModifySkillButton
// 0x00F0 (0x00F0 - 0x0000)
struct BP_SkillDataComponent_PerformBreakStun_C_ModifySkillButton final
{
public:
	class UWBP_HUD_SkillButton_Big_C*             SkillButtonWidget;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            CallFunc_MakeBrushFromTexture_ReturnValue;         // 0x0010(0x00D0)()
	class UImage*                                 CallFunc_SpawnObject_ReturnValue;                  // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SkillDataComponent_PerformBreakStun_C_ModifySkillButton) == 0x000010, "Wrong alignment on BP_SkillDataComponent_PerformBreakStun_C_ModifySkillButton");
static_assert(sizeof(BP_SkillDataComponent_PerformBreakStun_C_ModifySkillButton) == 0x0000F0, "Wrong size on BP_SkillDataComponent_PerformBreakStun_C_ModifySkillButton");
static_assert(offsetof(BP_SkillDataComponent_PerformBreakStun_C_ModifySkillButton, SkillButtonWidget) == 0x000000, "Member 'BP_SkillDataComponent_PerformBreakStun_C_ModifySkillButton::SkillButtonWidget' has a wrong offset!");
static_assert(offsetof(BP_SkillDataComponent_PerformBreakStun_C_ModifySkillButton, CallFunc_MakeBrushFromTexture_ReturnValue) == 0x000010, "Member 'BP_SkillDataComponent_PerformBreakStun_C_ModifySkillButton::CallFunc_MakeBrushFromTexture_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillDataComponent_PerformBreakStun_C_ModifySkillButton, CallFunc_SpawnObject_ReturnValue) == 0x0000E0, "Member 'BP_SkillDataComponent_PerformBreakStun_C_ModifySkillButton::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");

// Function BP_SkillDataComponent_PerformBreakStun.BP_SkillDataComponent_PerformBreakStun_C.ModifySkillTooltip
// 0x00F0 (0x00F0 - 0x0000)
struct BP_SkillDataComponent_PerformBreakStun_C_ModifySkillTooltip final
{
public:
	class UWBP_SkillTooltip_C*                    SkillTooltipWidget;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            CallFunc_MakeBrushFromTexture_ReturnValue;         // 0x0010(0x00D0)()
	class UImage*                                 CallFunc_SpawnObject_ReturnValue;                  // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SkillDataComponent_PerformBreakStun_C_ModifySkillTooltip) == 0x000010, "Wrong alignment on BP_SkillDataComponent_PerformBreakStun_C_ModifySkillTooltip");
static_assert(sizeof(BP_SkillDataComponent_PerformBreakStun_C_ModifySkillTooltip) == 0x0000F0, "Wrong size on BP_SkillDataComponent_PerformBreakStun_C_ModifySkillTooltip");
static_assert(offsetof(BP_SkillDataComponent_PerformBreakStun_C_ModifySkillTooltip, SkillTooltipWidget) == 0x000000, "Member 'BP_SkillDataComponent_PerformBreakStun_C_ModifySkillTooltip::SkillTooltipWidget' has a wrong offset!");
static_assert(offsetof(BP_SkillDataComponent_PerformBreakStun_C_ModifySkillTooltip, CallFunc_MakeBrushFromTexture_ReturnValue) == 0x000010, "Member 'BP_SkillDataComponent_PerformBreakStun_C_ModifySkillTooltip::CallFunc_MakeBrushFromTexture_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillDataComponent_PerformBreakStun_C_ModifySkillTooltip, CallFunc_SpawnObject_ReturnValue) == 0x0000E0, "Member 'BP_SkillDataComponent_PerformBreakStun_C_ModifySkillTooltip::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");

}

