#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SerializableActorComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_SerializableActorComponent.BP_SerializableActorComponent_C.CheckForErrors
// 0x00C8 (0x00C8 - 0x0000)
struct BP_SerializableActorComponent_C_CheckForErrors final
{
public:
	TArray<class FText>                           ErrorMessages;                                     // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGlobalObjectIDValid_IsValid;            // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0038(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0048(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0090(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Format_ReturnValue;                       // 0x00A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x00B0(0x0010)()
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SerializableActorComponent_C_CheckForErrors) == 0x000008, "Wrong alignment on BP_SerializableActorComponent_C_CheckForErrors");
static_assert(sizeof(BP_SerializableActorComponent_C_CheckForErrors) == 0x0000C8, "Wrong size on BP_SerializableActorComponent_C_CheckForErrors");
static_assert(offsetof(BP_SerializableActorComponent_C_CheckForErrors, ErrorMessages) == 0x000000, "Member 'BP_SerializableActorComponent_C_CheckForErrors::ErrorMessages' has a wrong offset!");
static_assert(offsetof(BP_SerializableActorComponent_C_CheckForErrors, ReturnValue) == 0x000010, "Member 'BP_SerializableActorComponent_C_CheckForErrors::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SerializableActorComponent_C_CheckForErrors, CallFunc_GetOwner_ReturnValue) == 0x000018, "Member 'BP_SerializableActorComponent_C_CheckForErrors::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SerializableActorComponent_C_CheckForErrors, CallFunc_IsGlobalObjectIDValid_IsValid) == 0x000020, "Member 'BP_SerializableActorComponent_C_CheckForErrors::CallFunc_IsGlobalObjectIDValid_IsValid' has a wrong offset!");
static_assert(offsetof(BP_SerializableActorComponent_C_CheckForErrors, CallFunc_GetDisplayName_ReturnValue) == 0x000028, "Member 'BP_SerializableActorComponent_C_CheckForErrors::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SerializableActorComponent_C_CheckForErrors, CallFunc_Conv_StringToText_ReturnValue) == 0x000038, "Member 'BP_SerializableActorComponent_C_CheckForErrors::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SerializableActorComponent_C_CheckForErrors, K2Node_MakeStruct_FormatArgumentData) == 0x000048, "Member 'BP_SerializableActorComponent_C_CheckForErrors::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_SerializableActorComponent_C_CheckForErrors, K2Node_MakeArray_Array) == 0x000090, "Member 'BP_SerializableActorComponent_C_CheckForErrors::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_SerializableActorComponent_C_CheckForErrors, CallFunc_Format_ReturnValue) == 0x0000A0, "Member 'BP_SerializableActorComponent_C_CheckForErrors::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SerializableActorComponent_C_CheckForErrors, CallFunc_Conv_StringToText_ReturnValue_1) == 0x0000B0, "Member 'BP_SerializableActorComponent_C_CheckForErrors::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SerializableActorComponent_C_CheckForErrors, CallFunc_Array_Add_ReturnValue) == 0x0000C0, "Member 'BP_SerializableActorComponent_C_CheckForErrors::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function BP_SerializableActorComponent.BP_SerializableActorComponent_C.CheckGlobalObjectIDValidity
// 0x00A0 (0x00A0 - 0x0000)
struct BP_SerializableActorComponent_C_CheckGlobalObjectIDValidity final
{
public:
	bool                                          CallFunc_IsGlobalObjectIDValid_IsValid;            // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0018(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0028(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0070(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Format_ReturnValue;                       // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0090(0x0010)()
};
static_assert(alignof(BP_SerializableActorComponent_C_CheckGlobalObjectIDValidity) == 0x000008, "Wrong alignment on BP_SerializableActorComponent_C_CheckGlobalObjectIDValidity");
static_assert(sizeof(BP_SerializableActorComponent_C_CheckGlobalObjectIDValidity) == 0x0000A0, "Wrong size on BP_SerializableActorComponent_C_CheckGlobalObjectIDValidity");
static_assert(offsetof(BP_SerializableActorComponent_C_CheckGlobalObjectIDValidity, CallFunc_IsGlobalObjectIDValid_IsValid) == 0x000000, "Member 'BP_SerializableActorComponent_C_CheckGlobalObjectIDValidity::CallFunc_IsGlobalObjectIDValid_IsValid' has a wrong offset!");
static_assert(offsetof(BP_SerializableActorComponent_C_CheckGlobalObjectIDValidity, CallFunc_GetDisplayName_ReturnValue) == 0x000008, "Member 'BP_SerializableActorComponent_C_CheckGlobalObjectIDValidity::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SerializableActorComponent_C_CheckGlobalObjectIDValidity, CallFunc_Conv_StringToText_ReturnValue) == 0x000018, "Member 'BP_SerializableActorComponent_C_CheckGlobalObjectIDValidity::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SerializableActorComponent_C_CheckGlobalObjectIDValidity, K2Node_MakeStruct_FormatArgumentData) == 0x000028, "Member 'BP_SerializableActorComponent_C_CheckGlobalObjectIDValidity::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_SerializableActorComponent_C_CheckGlobalObjectIDValidity, K2Node_MakeArray_Array) == 0x000070, "Member 'BP_SerializableActorComponent_C_CheckGlobalObjectIDValidity::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_SerializableActorComponent_C_CheckGlobalObjectIDValidity, CallFunc_Format_ReturnValue) == 0x000080, "Member 'BP_SerializableActorComponent_C_CheckGlobalObjectIDValidity::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SerializableActorComponent_C_CheckGlobalObjectIDValidity, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000090, "Member 'BP_SerializableActorComponent_C_CheckGlobalObjectIDValidity::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");

// Function BP_SerializableActorComponent.BP_SerializableActorComponent_C.ForceGlobalObjectID
// 0x0008 (0x0008 - 0x0000)
struct BP_SerializableActorComponent_C_ForceGlobalObjectID final
{
public:
	class FName                                   ObjectId;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SerializableActorComponent_C_ForceGlobalObjectID) == 0x000004, "Wrong alignment on BP_SerializableActorComponent_C_ForceGlobalObjectID");
static_assert(sizeof(BP_SerializableActorComponent_C_ForceGlobalObjectID) == 0x000008, "Wrong size on BP_SerializableActorComponent_C_ForceGlobalObjectID");
static_assert(offsetof(BP_SerializableActorComponent_C_ForceGlobalObjectID, ObjectId) == 0x000000, "Member 'BP_SerializableActorComponent_C_ForceGlobalObjectID::ObjectId' has a wrong offset!");

// Function BP_SerializableActorComponent.BP_SerializableActorComponent_C.GenerateGlobalObjectID
// 0x0160 (0x0160 - 0x0000)
struct BP_SerializableActorComponent_C_GenerateGlobalObjectID final
{
public:
	class FString                                 OptionalPrefix;                                    // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          ForceGeneration;                                   // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GenerateNewGUID_GUID;                     // 0x0014(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E[0x2];                                       // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_GetAllActorsOfClass_OutActors;            // 0x0028(0x0010)(ReferenceParm)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_SerializableActorComponent_C*       CallFunc_GetComponentByClass_ReturnValue;          // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetGlobalObjectID_ObjectID;               // 0x004C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGlobalObjectIDValid_IsValid;            // 0x0055(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0056(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57[0x1];                                       // 0x0057(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x005D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E[0x2];                                       // 0x005E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_NameToText_ReturnValue;              // 0x0070(0x0010)()
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0090(0x0048)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x00D8(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00E8(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0130(0x0010)(ReferenceParm)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0148(0x0010)()
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0159(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SerializableActorComponent_C_GenerateGlobalObjectID) == 0x000008, "Wrong alignment on BP_SerializableActorComponent_C_GenerateGlobalObjectID");
static_assert(sizeof(BP_SerializableActorComponent_C_GenerateGlobalObjectID) == 0x000160, "Wrong size on BP_SerializableActorComponent_C_GenerateGlobalObjectID");
static_assert(offsetof(BP_SerializableActorComponent_C_GenerateGlobalObjectID, OptionalPrefix) == 0x000000, "Member 'BP_SerializableActorComponent_C_GenerateGlobalObjectID::OptionalPrefix' has a wrong offset!");
static_assert(offsetof(BP_SerializableActorComponent_C_GenerateGlobalObjectID, ForceGeneration) == 0x000010, "Member 'BP_SerializableActorComponent_C_GenerateGlobalObjectID::ForceGeneration' has a wrong offset!");
static_assert(offsetof(BP_SerializableActorComponent_C_GenerateGlobalObjectID, CallFunc_GenerateNewGUID_GUID) == 0x000014, "Member 'BP_SerializableActorComponent_C_GenerateGlobalObjectID::CallFunc_GenerateNewGUID_GUID' has a wrong offset!");
static_assert(offsetof(BP_SerializableActorComponent_C_GenerateGlobalObjectID, Temp_bool_True_if_break_was_hit_Variable) == 0x00001C, "Member 'BP_SerializableActorComponent_C_GenerateGlobalObjectID::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(BP_SerializableActorComponent_C_GenerateGlobalObjectID, CallFunc_Not_PreBool_ReturnValue) == 0x00001D, "Member 'BP_SerializableActorComponent_C_GenerateGlobalObjectID::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SerializableActorComponent_C_GenerateGlobalObjectID, Temp_int_Array_Index_Variable) == 0x000020, "Member 'BP_SerializableActorComponent_C_GenerateGlobalObjectID::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_SerializableActorComponent_C_GenerateGlobalObjectID, CallFunc_GetAllActorsOfClass_OutActors) == 0x000028, "Member 'BP_SerializableActorComponent_C_GenerateGlobalObjectID::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(BP_SerializableActorComponent_C_GenerateGlobalObjectID, CallFunc_Array_Get_Item) == 0x000038, "Member 'BP_SerializableActorComponent_C_GenerateGlobalObjectID::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_SerializableActorComponent_C_GenerateGlobalObjectID, CallFunc_GetComponentByClass_ReturnValue) == 0x000040, "Member 'BP_SerializableActorComponent_C_GenerateGlobalObjectID::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SerializableActorComponent_C_GenerateGlobalObjectID, CallFunc_Array_Length_ReturnValue) == 0x000048, "Member 'BP_SerializableActorComponent_C_GenerateGlobalObjectID::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SerializableActorComponent_C_GenerateGlobalObjectID, CallFunc_GetGlobalObjectID_ObjectID) == 0x00004C, "Member 'BP_SerializableActorComponent_C_GenerateGlobalObjectID::CallFunc_GetGlobalObjectID_ObjectID' has a wrong offset!");
static_assert(offsetof(BP_SerializableActorComponent_C_GenerateGlobalObjectID, CallFunc_IsValid_ReturnValue) == 0x000054, "Member 'BP_SerializableActorComponent_C_GenerateGlobalObjectID::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SerializableActorComponent_C_GenerateGlobalObjectID, CallFunc_IsGlobalObjectIDValid_IsValid) == 0x000055, "Member 'BP_SerializableActorComponent_C_GenerateGlobalObjectID::CallFunc_IsGlobalObjectIDValid_IsValid' has a wrong offset!");
static_assert(offsetof(BP_SerializableActorComponent_C_GenerateGlobalObjectID, CallFunc_Not_PreBool_ReturnValue_1) == 0x000056, "Member 'BP_SerializableActorComponent_C_GenerateGlobalObjectID::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SerializableActorComponent_C_GenerateGlobalObjectID, Temp_int_Loop_Counter_Variable) == 0x000058, "Member 'BP_SerializableActorComponent_C_GenerateGlobalObjectID::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_SerializableActorComponent_C_GenerateGlobalObjectID, CallFunc_BooleanOR_ReturnValue) == 0x00005C, "Member 'BP_SerializableActorComponent_C_GenerateGlobalObjectID::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SerializableActorComponent_C_GenerateGlobalObjectID, CallFunc_Less_IntInt_ReturnValue) == 0x00005D, "Member 'BP_SerializableActorComponent_C_GenerateGlobalObjectID::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SerializableActorComponent_C_GenerateGlobalObjectID, CallFunc_Add_IntInt_ReturnValue) == 0x000060, "Member 'BP_SerializableActorComponent_C_GenerateGlobalObjectID::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SerializableActorComponent_C_GenerateGlobalObjectID, CallFunc_BooleanAND_ReturnValue) == 0x000064, "Member 'BP_SerializableActorComponent_C_GenerateGlobalObjectID::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SerializableActorComponent_C_GenerateGlobalObjectID, CallFunc_GetOwner_ReturnValue) == 0x000068, "Member 'BP_SerializableActorComponent_C_GenerateGlobalObjectID::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SerializableActorComponent_C_GenerateGlobalObjectID, CallFunc_Conv_NameToText_ReturnValue) == 0x000070, "Member 'BP_SerializableActorComponent_C_GenerateGlobalObjectID::CallFunc_Conv_NameToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SerializableActorComponent_C_GenerateGlobalObjectID, CallFunc_GetDisplayName_ReturnValue) == 0x000080, "Member 'BP_SerializableActorComponent_C_GenerateGlobalObjectID::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SerializableActorComponent_C_GenerateGlobalObjectID, K2Node_MakeStruct_FormatArgumentData) == 0x000090, "Member 'BP_SerializableActorComponent_C_GenerateGlobalObjectID::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_SerializableActorComponent_C_GenerateGlobalObjectID, CallFunc_Conv_StringToText_ReturnValue) == 0x0000D8, "Member 'BP_SerializableActorComponent_C_GenerateGlobalObjectID::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SerializableActorComponent_C_GenerateGlobalObjectID, K2Node_MakeStruct_FormatArgumentData_1) == 0x0000E8, "Member 'BP_SerializableActorComponent_C_GenerateGlobalObjectID::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BP_SerializableActorComponent_C_GenerateGlobalObjectID, K2Node_MakeArray_Array) == 0x000130, "Member 'BP_SerializableActorComponent_C_GenerateGlobalObjectID::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_SerializableActorComponent_C_GenerateGlobalObjectID, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000140, "Member 'BP_SerializableActorComponent_C_GenerateGlobalObjectID::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SerializableActorComponent_C_GenerateGlobalObjectID, CallFunc_Format_ReturnValue) == 0x000148, "Member 'BP_SerializableActorComponent_C_GenerateGlobalObjectID::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SerializableActorComponent_C_GenerateGlobalObjectID, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000158, "Member 'BP_SerializableActorComponent_C_GenerateGlobalObjectID::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SerializableActorComponent_C_GenerateGlobalObjectID, CallFunc_BooleanAND_ReturnValue_1) == 0x000159, "Member 'BP_SerializableActorComponent_C_GenerateGlobalObjectID::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");

// Function BP_SerializableActorComponent.BP_SerializableActorComponent_C.GenerateNewGUID
// 0x00F8 (0x00F8 - 0x0000)
struct BP_SerializableActorComponent_C_GenerateNewGUID final
{
public:
	class FString                                 OptionalPrefix;                                    // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FName                                   Guid;                                              // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetCurrentLevelName_ReturnValue;          // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEmpty_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_SelectString_ReturnValue;                 // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetClassDisplayName_ReturnValue;          // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x0090(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_4;              // 0x00A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FGuid                                  CallFunc_NewGuid_ReturnValue;                      // 0x00B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_5;              // 0x00C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_GuidToString_ReturnValue;            // 0x00D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_6;              // 0x00E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SerializableActorComponent_C_GenerateNewGUID) == 0x000008, "Wrong alignment on BP_SerializableActorComponent_C_GenerateNewGUID");
static_assert(sizeof(BP_SerializableActorComponent_C_GenerateNewGUID) == 0x0000F8, "Wrong size on BP_SerializableActorComponent_C_GenerateNewGUID");
static_assert(offsetof(BP_SerializableActorComponent_C_GenerateNewGUID, OptionalPrefix) == 0x000000, "Member 'BP_SerializableActorComponent_C_GenerateNewGUID::OptionalPrefix' has a wrong offset!");
static_assert(offsetof(BP_SerializableActorComponent_C_GenerateNewGUID, Guid) == 0x000010, "Member 'BP_SerializableActorComponent_C_GenerateNewGUID::Guid' has a wrong offset!");
static_assert(offsetof(BP_SerializableActorComponent_C_GenerateNewGUID, CallFunc_GetCurrentLevelName_ReturnValue) == 0x000018, "Member 'BP_SerializableActorComponent_C_GenerateNewGUID::CallFunc_GetCurrentLevelName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SerializableActorComponent_C_GenerateNewGUID, CallFunc_IsEmpty_ReturnValue) == 0x000028, "Member 'BP_SerializableActorComponent_C_GenerateNewGUID::CallFunc_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SerializableActorComponent_C_GenerateNewGUID, CallFunc_Concat_StrStr_ReturnValue) == 0x000030, "Member 'BP_SerializableActorComponent_C_GenerateNewGUID::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SerializableActorComponent_C_GenerateNewGUID, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000040, "Member 'BP_SerializableActorComponent_C_GenerateNewGUID::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SerializableActorComponent_C_GenerateNewGUID, CallFunc_GetOwner_ReturnValue) == 0x000050, "Member 'BP_SerializableActorComponent_C_GenerateNewGUID::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SerializableActorComponent_C_GenerateNewGUID, CallFunc_SelectString_ReturnValue) == 0x000058, "Member 'BP_SerializableActorComponent_C_GenerateNewGUID::CallFunc_SelectString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SerializableActorComponent_C_GenerateNewGUID, CallFunc_GetObjectClass_ReturnValue) == 0x000068, "Member 'BP_SerializableActorComponent_C_GenerateNewGUID::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SerializableActorComponent_C_GenerateNewGUID, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000070, "Member 'BP_SerializableActorComponent_C_GenerateNewGUID::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_SerializableActorComponent_C_GenerateNewGUID, CallFunc_GetClassDisplayName_ReturnValue) == 0x000080, "Member 'BP_SerializableActorComponent_C_GenerateNewGUID::CallFunc_GetClassDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SerializableActorComponent_C_GenerateNewGUID, CallFunc_Concat_StrStr_ReturnValue_3) == 0x000090, "Member 'BP_SerializableActorComponent_C_GenerateNewGUID::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_SerializableActorComponent_C_GenerateNewGUID, CallFunc_Concat_StrStr_ReturnValue_4) == 0x0000A0, "Member 'BP_SerializableActorComponent_C_GenerateNewGUID::CallFunc_Concat_StrStr_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_SerializableActorComponent_C_GenerateNewGUID, CallFunc_NewGuid_ReturnValue) == 0x0000B0, "Member 'BP_SerializableActorComponent_C_GenerateNewGUID::CallFunc_NewGuid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SerializableActorComponent_C_GenerateNewGUID, CallFunc_Concat_StrStr_ReturnValue_5) == 0x0000C0, "Member 'BP_SerializableActorComponent_C_GenerateNewGUID::CallFunc_Concat_StrStr_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_SerializableActorComponent_C_GenerateNewGUID, CallFunc_Conv_GuidToString_ReturnValue) == 0x0000D0, "Member 'BP_SerializableActorComponent_C_GenerateNewGUID::CallFunc_Conv_GuidToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SerializableActorComponent_C_GenerateNewGUID, CallFunc_Concat_StrStr_ReturnValue_6) == 0x0000E0, "Member 'BP_SerializableActorComponent_C_GenerateNewGUID::CallFunc_Concat_StrStr_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_SerializableActorComponent_C_GenerateNewGUID, CallFunc_Conv_StringToName_ReturnValue) == 0x0000F0, "Member 'BP_SerializableActorComponent_C_GenerateNewGUID::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");

// Function BP_SerializableActorComponent.BP_SerializableActorComponent_C.GetGlobalObjectID
// 0x0008 (0x0008 - 0x0000)
struct BP_SerializableActorComponent_C_GetGlobalObjectID final
{
public:
	class FName                                   ObjectId;                                          // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SerializableActorComponent_C_GetGlobalObjectID) == 0x000004, "Wrong alignment on BP_SerializableActorComponent_C_GetGlobalObjectID");
static_assert(sizeof(BP_SerializableActorComponent_C_GetGlobalObjectID) == 0x000008, "Wrong size on BP_SerializableActorComponent_C_GetGlobalObjectID");
static_assert(offsetof(BP_SerializableActorComponent_C_GetGlobalObjectID, ObjectId) == 0x000000, "Member 'BP_SerializableActorComponent_C_GetGlobalObjectID::ObjectId' has a wrong offset!");

// Function BP_SerializableActorComponent.BP_SerializableActorComponent_C.IsGlobalObjectIDValid
// 0x0010 (0x0010 - 0x0000)
struct BP_SerializableActorComponent_C_IsGlobalObjectIDValid final
{
public:
	bool                                          IsValid;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   local_EmptyName;                                   // 0x0004(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SerializableActorComponent_C_IsGlobalObjectIDValid) == 0x000004, "Wrong alignment on BP_SerializableActorComponent_C_IsGlobalObjectIDValid");
static_assert(sizeof(BP_SerializableActorComponent_C_IsGlobalObjectIDValid) == 0x000010, "Wrong size on BP_SerializableActorComponent_C_IsGlobalObjectIDValid");
static_assert(offsetof(BP_SerializableActorComponent_C_IsGlobalObjectIDValid, IsValid) == 0x000000, "Member 'BP_SerializableActorComponent_C_IsGlobalObjectIDValid::IsValid' has a wrong offset!");
static_assert(offsetof(BP_SerializableActorComponent_C_IsGlobalObjectIDValid, local_EmptyName) == 0x000004, "Member 'BP_SerializableActorComponent_C_IsGlobalObjectIDValid::local_EmptyName' has a wrong offset!");
