#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SaveGameObjectUpgrader_V0_To_V1

#include "Basic.hpp"

#include "E_QuestStatus_structs.hpp"
#include "FLevelDataEntry_structs.hpp"
#include "E_CharacterList_structs.hpp"
#include "S_LevelSpawnPointsData_structs.hpp"
#include "S_QuestStatusData_structs.hpp"
#include "E_WorldMapExplorationCapacity_structs.hpp"


namespace SDK::Params
{

// Function BP_SaveGameObjectUpgrader_V0_To_V1.BP_SaveGameObjectUpgrader_V0_To_V1_C.PatchOldLumiereData
// 0x0078 (0x0078 - 0x0000)
struct BP_SaveGameObjectUpgrader_V0_To_V1_C_PatchOldLumiereData final
{
public:
	class UBP_SaveGameObject_V0_C*                From;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_SaveGameObject_V1_C*                To;                                                // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_QuestStatusData                     CallFunc_Map_Find_Value;                           // 0x0018(0x0058)(HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SaveGameObjectUpgrader_V0_To_V1_C_PatchOldLumiereData) == 0x000008, "Wrong alignment on BP_SaveGameObjectUpgrader_V0_To_V1_C_PatchOldLumiereData");
static_assert(sizeof(BP_SaveGameObjectUpgrader_V0_To_V1_C_PatchOldLumiereData) == 0x000078, "Wrong size on BP_SaveGameObjectUpgrader_V0_To_V1_C_PatchOldLumiereData");
static_assert(offsetof(BP_SaveGameObjectUpgrader_V0_To_V1_C_PatchOldLumiereData, From) == 0x000000, "Member 'BP_SaveGameObjectUpgrader_V0_To_V1_C_PatchOldLumiereData::From' has a wrong offset!");
static_assert(offsetof(BP_SaveGameObjectUpgrader_V0_To_V1_C_PatchOldLumiereData, To) == 0x000008, "Member 'BP_SaveGameObjectUpgrader_V0_To_V1_C_PatchOldLumiereData::To' has a wrong offset!");
static_assert(offsetof(BP_SaveGameObjectUpgrader_V0_To_V1_C_PatchOldLumiereData, Temp_bool_Variable) == 0x000010, "Member 'BP_SaveGameObjectUpgrader_V0_To_V1_C_PatchOldLumiereData::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_SaveGameObjectUpgrader_V0_To_V1_C_PatchOldLumiereData, CallFunc_Map_Find_Value) == 0x000018, "Member 'BP_SaveGameObjectUpgrader_V0_To_V1_C_PatchOldLumiereData::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BP_SaveGameObjectUpgrader_V0_To_V1_C_PatchOldLumiereData, CallFunc_Map_Find_ReturnValue) == 0x000070, "Member 'BP_SaveGameObjectUpgrader_V0_To_V1_C_PatchOldLumiereData::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SaveGameObjectUpgrader_V0_To_V1_C_PatchOldLumiereData, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000071, "Member 'BP_SaveGameObjectUpgrader_V0_To_V1_C_PatchOldLumiereData::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function BP_SaveGameObjectUpgrader_V0_To_V1.BP_SaveGameObjectUpgrader_V0_To_V1_C.PatchPersistentFlags
// 0x0020 (0x0020 - 0x0000)
struct BP_SaveGameObjectUpgrader_V0_To_V1_C_PatchPersistentFlags final
{
public:
	class UBP_SaveGameObject_V0_C*                From;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_SaveGameObject_V1_C*                To;                                                // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	E_CharacterList                               Temp_byte_Variable;                                // 0x0010(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Map_Find_Value;                           // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x001A(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SaveGameObjectUpgrader_V0_To_V1_C_PatchPersistentFlags) == 0x000008, "Wrong alignment on BP_SaveGameObjectUpgrader_V0_To_V1_C_PatchPersistentFlags");
static_assert(sizeof(BP_SaveGameObjectUpgrader_V0_To_V1_C_PatchPersistentFlags) == 0x000020, "Wrong size on BP_SaveGameObjectUpgrader_V0_To_V1_C_PatchPersistentFlags");
static_assert(offsetof(BP_SaveGameObjectUpgrader_V0_To_V1_C_PatchPersistentFlags, From) == 0x000000, "Member 'BP_SaveGameObjectUpgrader_V0_To_V1_C_PatchPersistentFlags::From' has a wrong offset!");
static_assert(offsetof(BP_SaveGameObjectUpgrader_V0_To_V1_C_PatchPersistentFlags, To) == 0x000008, "Member 'BP_SaveGameObjectUpgrader_V0_To_V1_C_PatchPersistentFlags::To' has a wrong offset!");
static_assert(offsetof(BP_SaveGameObjectUpgrader_V0_To_V1_C_PatchPersistentFlags, Temp_byte_Variable) == 0x000010, "Member 'BP_SaveGameObjectUpgrader_V0_To_V1_C_PatchPersistentFlags::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_SaveGameObjectUpgrader_V0_To_V1_C_PatchPersistentFlags, CallFunc_Map_Find_Value) == 0x000014, "Member 'BP_SaveGameObjectUpgrader_V0_To_V1_C_PatchPersistentFlags::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BP_SaveGameObjectUpgrader_V0_To_V1_C_PatchPersistentFlags, CallFunc_Map_Find_ReturnValue) == 0x000018, "Member 'BP_SaveGameObjectUpgrader_V0_To_V1_C_PatchPersistentFlags::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SaveGameObjectUpgrader_V0_To_V1_C_PatchPersistentFlags, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000019, "Member 'BP_SaveGameObjectUpgrader_V0_To_V1_C_PatchPersistentFlags::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SaveGameObjectUpgrader_V0_To_V1_C_PatchPersistentFlags, Temp_bool_Variable) == 0x00001A, "Member 'BP_SaveGameObjectUpgrader_V0_To_V1_C_PatchPersistentFlags::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_SaveGameObjectUpgrader_V0_To_V1_C_PatchPersistentFlags, CallFunc_BooleanAND_ReturnValue) == 0x00001B, "Member 'BP_SaveGameObjectUpgrader_V0_To_V1_C_PatchPersistentFlags::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BP_SaveGameObjectUpgrader_V0_To_V1.BP_SaveGameObjectUpgrader_V0_To_V1_C.PatchRedForestData
// 0x0018 (0x0018 - 0x0000)
struct BP_SaveGameObjectUpgrader_V0_To_V1_C_PatchRedForestData final
{
public:
	class UBP_SaveGameObject_V0_C*                From;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_SaveGameObject_V1_C*                To;                                                // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_Value;                           // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SaveGameObjectUpgrader_V0_To_V1_C_PatchRedForestData) == 0x000008, "Wrong alignment on BP_SaveGameObjectUpgrader_V0_To_V1_C_PatchRedForestData");
static_assert(sizeof(BP_SaveGameObjectUpgrader_V0_To_V1_C_PatchRedForestData) == 0x000018, "Wrong size on BP_SaveGameObjectUpgrader_V0_To_V1_C_PatchRedForestData");
static_assert(offsetof(BP_SaveGameObjectUpgrader_V0_To_V1_C_PatchRedForestData, From) == 0x000000, "Member 'BP_SaveGameObjectUpgrader_V0_To_V1_C_PatchRedForestData::From' has a wrong offset!");
static_assert(offsetof(BP_SaveGameObjectUpgrader_V0_To_V1_C_PatchRedForestData, To) == 0x000008, "Member 'BP_SaveGameObjectUpgrader_V0_To_V1_C_PatchRedForestData::To' has a wrong offset!");
static_assert(offsetof(BP_SaveGameObjectUpgrader_V0_To_V1_C_PatchRedForestData, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000010, "Member 'BP_SaveGameObjectUpgrader_V0_To_V1_C_PatchRedForestData::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SaveGameObjectUpgrader_V0_To_V1_C_PatchRedForestData, CallFunc_Map_Find_Value) == 0x000011, "Member 'BP_SaveGameObjectUpgrader_V0_To_V1_C_PatchRedForestData::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BP_SaveGameObjectUpgrader_V0_To_V1_C_PatchRedForestData, CallFunc_Map_Find_ReturnValue) == 0x000012, "Member 'BP_SaveGameObjectUpgrader_V0_To_V1_C_PatchRedForestData::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SaveGameObjectUpgrader_V0_To_V1_C_PatchRedForestData, CallFunc_BooleanAND_ReturnValue) == 0x000013, "Member 'BP_SaveGameObjectUpgrader_V0_To_V1_C_PatchRedForestData::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BP_SaveGameObjectUpgrader_V0_To_V1.BP_SaveGameObjectUpgrader_V0_To_V1_C.PatchSeaCliffData
// 0x0018 (0x0018 - 0x0000)
struct BP_SaveGameObjectUpgrader_V0_To_V1_C_PatchSeaCliffData final
{
public:
	class UBP_SaveGameObject_V0_C*                From;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_SaveGameObject_V1_C*                To;                                                // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0011(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_Value;                           // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SaveGameObjectUpgrader_V0_To_V1_C_PatchSeaCliffData) == 0x000008, "Wrong alignment on BP_SaveGameObjectUpgrader_V0_To_V1_C_PatchSeaCliffData");
static_assert(sizeof(BP_SaveGameObjectUpgrader_V0_To_V1_C_PatchSeaCliffData) == 0x000018, "Wrong size on BP_SaveGameObjectUpgrader_V0_To_V1_C_PatchSeaCliffData");
static_assert(offsetof(BP_SaveGameObjectUpgrader_V0_To_V1_C_PatchSeaCliffData, From) == 0x000000, "Member 'BP_SaveGameObjectUpgrader_V0_To_V1_C_PatchSeaCliffData::From' has a wrong offset!");
static_assert(offsetof(BP_SaveGameObjectUpgrader_V0_To_V1_C_PatchSeaCliffData, To) == 0x000008, "Member 'BP_SaveGameObjectUpgrader_V0_To_V1_C_PatchSeaCliffData::To' has a wrong offset!");
static_assert(offsetof(BP_SaveGameObjectUpgrader_V0_To_V1_C_PatchSeaCliffData, Temp_bool_Variable) == 0x000010, "Member 'BP_SaveGameObjectUpgrader_V0_To_V1_C_PatchSeaCliffData::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_SaveGameObjectUpgrader_V0_To_V1_C_PatchSeaCliffData, Temp_bool_Variable_1) == 0x000011, "Member 'BP_SaveGameObjectUpgrader_V0_To_V1_C_PatchSeaCliffData::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_SaveGameObjectUpgrader_V0_To_V1_C_PatchSeaCliffData, CallFunc_Map_Find_Value) == 0x000012, "Member 'BP_SaveGameObjectUpgrader_V0_To_V1_C_PatchSeaCliffData::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BP_SaveGameObjectUpgrader_V0_To_V1_C_PatchSeaCliffData, CallFunc_Map_Find_ReturnValue) == 0x000013, "Member 'BP_SaveGameObjectUpgrader_V0_To_V1_C_PatchSeaCliffData::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SaveGameObjectUpgrader_V0_To_V1_C_PatchSeaCliffData, CallFunc_BooleanAND_ReturnValue) == 0x000014, "Member 'BP_SaveGameObjectUpgrader_V0_To_V1_C_PatchSeaCliffData::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BP_SaveGameObjectUpgrader_V0_To_V1.BP_SaveGameObjectUpgrader_V0_To_V1_C.PatchSmallLevelSireneMusicHear
// 0x0018 (0x0018 - 0x0000)
struct BP_SaveGameObjectUpgrader_V0_To_V1_C_PatchSmallLevelSireneMusicHear final
{
public:
	class UBP_SaveGameObject_V0_C*                From;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_SaveGameObject_V1_C*                To;                                                // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Map_Find_Value;                           // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0015(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SaveGameObjectUpgrader_V0_To_V1_C_PatchSmallLevelSireneMusicHear) == 0x000008, "Wrong alignment on BP_SaveGameObjectUpgrader_V0_To_V1_C_PatchSmallLevelSireneMusicHear");
static_assert(sizeof(BP_SaveGameObjectUpgrader_V0_To_V1_C_PatchSmallLevelSireneMusicHear) == 0x000018, "Wrong size on BP_SaveGameObjectUpgrader_V0_To_V1_C_PatchSmallLevelSireneMusicHear");
static_assert(offsetof(BP_SaveGameObjectUpgrader_V0_To_V1_C_PatchSmallLevelSireneMusicHear, From) == 0x000000, "Member 'BP_SaveGameObjectUpgrader_V0_To_V1_C_PatchSmallLevelSireneMusicHear::From' has a wrong offset!");
static_assert(offsetof(BP_SaveGameObjectUpgrader_V0_To_V1_C_PatchSmallLevelSireneMusicHear, To) == 0x000008, "Member 'BP_SaveGameObjectUpgrader_V0_To_V1_C_PatchSmallLevelSireneMusicHear::To' has a wrong offset!");
static_assert(offsetof(BP_SaveGameObjectUpgrader_V0_To_V1_C_PatchSmallLevelSireneMusicHear, CallFunc_Map_Find_Value) == 0x000010, "Member 'BP_SaveGameObjectUpgrader_V0_To_V1_C_PatchSmallLevelSireneMusicHear::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BP_SaveGameObjectUpgrader_V0_To_V1_C_PatchSmallLevelSireneMusicHear, CallFunc_Map_Find_ReturnValue) == 0x000014, "Member 'BP_SaveGameObjectUpgrader_V0_To_V1_C_PatchSmallLevelSireneMusicHear::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SaveGameObjectUpgrader_V0_To_V1_C_PatchSmallLevelSireneMusicHear, Temp_bool_Variable) == 0x000015, "Member 'BP_SaveGameObjectUpgrader_V0_To_V1_C_PatchSmallLevelSireneMusicHear::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_SaveGameObjectUpgrader_V0_To_V1_C_PatchSmallLevelSireneMusicHear, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000016, "Member 'BP_SaveGameObjectUpgrader_V0_To_V1_C_PatchSmallLevelSireneMusicHear::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SaveGameObjectUpgrader_V0_To_V1_C_PatchSmallLevelSireneMusicHear, CallFunc_BooleanAND_ReturnValue) == 0x000017, "Member 'BP_SaveGameObjectUpgrader_V0_To_V1_C_PatchSmallLevelSireneMusicHear::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BP_SaveGameObjectUpgrader_V0_To_V1.BP_SaveGameObjectUpgrader_V0_To_V1_C.PatchVisitedLevels
// 0x0200 (0x0200 - 0x0000)
struct BP_SaveGameObjectUpgrader_V0_To_V1_C_PatchVisitedLevels final
{
public:
	class UBP_SaveGameObject_V0_C*                From;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_SaveGameObject_V1_C*                To;                                                // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_LevelSpawnPointsData                CallFunc_Array_Get_Item;                           // 0x0018(0x0018)(HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FindLevelDataByLevelFile_Found;           // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_FindLevelDataByLevelFile_RowName;         // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFLevelDataEntry                       CallFunc_FindLevelDataByLevelFile_LevelData;       // 0x0040(0x01B0)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F5[0x3];                                      // 0x01F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SaveGameObjectUpgrader_V0_To_V1_C_PatchVisitedLevels) == 0x000008, "Wrong alignment on BP_SaveGameObjectUpgrader_V0_To_V1_C_PatchVisitedLevels");
static_assert(sizeof(BP_SaveGameObjectUpgrader_V0_To_V1_C_PatchVisitedLevels) == 0x000200, "Wrong size on BP_SaveGameObjectUpgrader_V0_To_V1_C_PatchVisitedLevels");
static_assert(offsetof(BP_SaveGameObjectUpgrader_V0_To_V1_C_PatchVisitedLevels, From) == 0x000000, "Member 'BP_SaveGameObjectUpgrader_V0_To_V1_C_PatchVisitedLevels::From' has a wrong offset!");
static_assert(offsetof(BP_SaveGameObjectUpgrader_V0_To_V1_C_PatchVisitedLevels, To) == 0x000008, "Member 'BP_SaveGameObjectUpgrader_V0_To_V1_C_PatchVisitedLevels::To' has a wrong offset!");
static_assert(offsetof(BP_SaveGameObjectUpgrader_V0_To_V1_C_PatchVisitedLevels, Temp_int_Array_Index_Variable) == 0x000010, "Member 'BP_SaveGameObjectUpgrader_V0_To_V1_C_PatchVisitedLevels::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_SaveGameObjectUpgrader_V0_To_V1_C_PatchVisitedLevels, CallFunc_Array_Length_ReturnValue) == 0x000014, "Member 'BP_SaveGameObjectUpgrader_V0_To_V1_C_PatchVisitedLevels::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SaveGameObjectUpgrader_V0_To_V1_C_PatchVisitedLevels, CallFunc_Array_Get_Item) == 0x000018, "Member 'BP_SaveGameObjectUpgrader_V0_To_V1_C_PatchVisitedLevels::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_SaveGameObjectUpgrader_V0_To_V1_C_PatchVisitedLevels, Temp_int_Loop_Counter_Variable) == 0x000030, "Member 'BP_SaveGameObjectUpgrader_V0_To_V1_C_PatchVisitedLevels::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_SaveGameObjectUpgrader_V0_To_V1_C_PatchVisitedLevels, CallFunc_FindLevelDataByLevelFile_Found) == 0x000034, "Member 'BP_SaveGameObjectUpgrader_V0_To_V1_C_PatchVisitedLevels::CallFunc_FindLevelDataByLevelFile_Found' has a wrong offset!");
static_assert(offsetof(BP_SaveGameObjectUpgrader_V0_To_V1_C_PatchVisitedLevels, CallFunc_FindLevelDataByLevelFile_RowName) == 0x000038, "Member 'BP_SaveGameObjectUpgrader_V0_To_V1_C_PatchVisitedLevels::CallFunc_FindLevelDataByLevelFile_RowName' has a wrong offset!");
static_assert(offsetof(BP_SaveGameObjectUpgrader_V0_To_V1_C_PatchVisitedLevels, CallFunc_FindLevelDataByLevelFile_LevelData) == 0x000040, "Member 'BP_SaveGameObjectUpgrader_V0_To_V1_C_PatchVisitedLevels::CallFunc_FindLevelDataByLevelFile_LevelData' has a wrong offset!");
static_assert(offsetof(BP_SaveGameObjectUpgrader_V0_To_V1_C_PatchVisitedLevels, CallFunc_Array_AddUnique_ReturnValue) == 0x0001F0, "Member 'BP_SaveGameObjectUpgrader_V0_To_V1_C_PatchVisitedLevels::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SaveGameObjectUpgrader_V0_To_V1_C_PatchVisitedLevels, CallFunc_Less_IntInt_ReturnValue) == 0x0001F4, "Member 'BP_SaveGameObjectUpgrader_V0_To_V1_C_PatchVisitedLevels::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SaveGameObjectUpgrader_V0_To_V1_C_PatchVisitedLevels, CallFunc_Add_IntInt_ReturnValue) == 0x0001F8, "Member 'BP_SaveGameObjectUpgrader_V0_To_V1_C_PatchVisitedLevels::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function BP_SaveGameObjectUpgrader_V0_To_V1.BP_SaveGameObjectUpgrader_V0_To_V1_C.PatchWorldMapData
// 0x0018 (0x0018 - 0x0000)
struct BP_SaveGameObjectUpgrader_V0_To_V1_C_PatchWorldMapData final
{
public:
	class UBP_SaveGameObject_V0_C*                From;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_SaveGameObject_V1_C*                To;                                                // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_WorldMapExplorationCapacity                 Temp_byte_Variable;                                // 0x0011(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_WorldMapExplorationCapacity                 Temp_byte_Variable_1;                              // 0x0012(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue_1;             // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0015(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SaveGameObjectUpgrader_V0_To_V1_C_PatchWorldMapData) == 0x000008, "Wrong alignment on BP_SaveGameObjectUpgrader_V0_To_V1_C_PatchWorldMapData");
static_assert(sizeof(BP_SaveGameObjectUpgrader_V0_To_V1_C_PatchWorldMapData) == 0x000018, "Wrong size on BP_SaveGameObjectUpgrader_V0_To_V1_C_PatchWorldMapData");
static_assert(offsetof(BP_SaveGameObjectUpgrader_V0_To_V1_C_PatchWorldMapData, From) == 0x000000, "Member 'BP_SaveGameObjectUpgrader_V0_To_V1_C_PatchWorldMapData::From' has a wrong offset!");
static_assert(offsetof(BP_SaveGameObjectUpgrader_V0_To_V1_C_PatchWorldMapData, To) == 0x000008, "Member 'BP_SaveGameObjectUpgrader_V0_To_V1_C_PatchWorldMapData::To' has a wrong offset!");
static_assert(offsetof(BP_SaveGameObjectUpgrader_V0_To_V1_C_PatchWorldMapData, Temp_bool_Variable) == 0x000010, "Member 'BP_SaveGameObjectUpgrader_V0_To_V1_C_PatchWorldMapData::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_SaveGameObjectUpgrader_V0_To_V1_C_PatchWorldMapData, Temp_byte_Variable) == 0x000011, "Member 'BP_SaveGameObjectUpgrader_V0_To_V1_C_PatchWorldMapData::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_SaveGameObjectUpgrader_V0_To_V1_C_PatchWorldMapData, Temp_byte_Variable_1) == 0x000012, "Member 'BP_SaveGameObjectUpgrader_V0_To_V1_C_PatchWorldMapData::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_SaveGameObjectUpgrader_V0_To_V1_C_PatchWorldMapData, CallFunc_Array_Contains_ReturnValue) == 0x000013, "Member 'BP_SaveGameObjectUpgrader_V0_To_V1_C_PatchWorldMapData::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SaveGameObjectUpgrader_V0_To_V1_C_PatchWorldMapData, CallFunc_Array_Contains_ReturnValue_1) == 0x000014, "Member 'BP_SaveGameObjectUpgrader_V0_To_V1_C_PatchWorldMapData::CallFunc_Array_Contains_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SaveGameObjectUpgrader_V0_To_V1_C_PatchWorldMapData, Temp_bool_Variable_1) == 0x000015, "Member 'BP_SaveGameObjectUpgrader_V0_To_V1_C_PatchWorldMapData::Temp_bool_Variable_1' has a wrong offset!");

// Function BP_SaveGameObjectUpgrader_V0_To_V1.BP_SaveGameObjectUpgrader_V0_To_V1_C.ProcessUpgradeSaveGameObject
// 0x0030 (0x0030 - 0x0000)
struct BP_SaveGameObjectUpgrader_V0_To_V1_C_ProcessUpgradeSaveGameObject final
{
public:
	class UBP_SaveGameBase_C*                     FromSaveGameObject;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_SaveGameBase_C*                     ToSaveGameObject;                                  // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_SaveGameObject_V0_C*                K2Node_DynamicCast_AsBP_Save_Game_Object_V0;       // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_SaveGameObject_V1_C*                K2Node_DynamicCast_AsBP_Save_Game_Object_V1;       // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SaveGameObjectUpgrader_V0_To_V1_C_ProcessUpgradeSaveGameObject) == 0x000008, "Wrong alignment on BP_SaveGameObjectUpgrader_V0_To_V1_C_ProcessUpgradeSaveGameObject");
static_assert(sizeof(BP_SaveGameObjectUpgrader_V0_To_V1_C_ProcessUpgradeSaveGameObject) == 0x000030, "Wrong size on BP_SaveGameObjectUpgrader_V0_To_V1_C_ProcessUpgradeSaveGameObject");
static_assert(offsetof(BP_SaveGameObjectUpgrader_V0_To_V1_C_ProcessUpgradeSaveGameObject, FromSaveGameObject) == 0x000000, "Member 'BP_SaveGameObjectUpgrader_V0_To_V1_C_ProcessUpgradeSaveGameObject::FromSaveGameObject' has a wrong offset!");
static_assert(offsetof(BP_SaveGameObjectUpgrader_V0_To_V1_C_ProcessUpgradeSaveGameObject, ToSaveGameObject) == 0x000008, "Member 'BP_SaveGameObjectUpgrader_V0_To_V1_C_ProcessUpgradeSaveGameObject::ToSaveGameObject' has a wrong offset!");
static_assert(offsetof(BP_SaveGameObjectUpgrader_V0_To_V1_C_ProcessUpgradeSaveGameObject, K2Node_DynamicCast_AsBP_Save_Game_Object_V0) == 0x000010, "Member 'BP_SaveGameObjectUpgrader_V0_To_V1_C_ProcessUpgradeSaveGameObject::K2Node_DynamicCast_AsBP_Save_Game_Object_V0' has a wrong offset!");
static_assert(offsetof(BP_SaveGameObjectUpgrader_V0_To_V1_C_ProcessUpgradeSaveGameObject, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_SaveGameObjectUpgrader_V0_To_V1_C_ProcessUpgradeSaveGameObject::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_SaveGameObjectUpgrader_V0_To_V1_C_ProcessUpgradeSaveGameObject, K2Node_DynamicCast_AsBP_Save_Game_Object_V1) == 0x000020, "Member 'BP_SaveGameObjectUpgrader_V0_To_V1_C_ProcessUpgradeSaveGameObject::K2Node_DynamicCast_AsBP_Save_Game_Object_V1' has a wrong offset!");
static_assert(offsetof(BP_SaveGameObjectUpgrader_V0_To_V1_C_ProcessUpgradeSaveGameObject, K2Node_DynamicCast_bSuccess_1) == 0x000028, "Member 'BP_SaveGameObjectUpgrader_V0_To_V1_C_ProcessUpgradeSaveGameObject::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function BP_SaveGameObjectUpgrader_V0_To_V1.BP_SaveGameObjectUpgrader_V0_To_V1_C.SetRedForestQuestState
// 0x0150 (0x0150 - 0x0000)
struct BP_SaveGameObjectUpgrader_V0_To_V1_C_SetRedForestQuestState final
{
public:
	class UBP_SaveGameObject_V0_C*                From;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_SaveGameObject_V1_C*                To;                                                // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Completed;                                         // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FName, E_QuestStatus>              local_RedForestObjectiveStates;                    // 0x0018(0x0050)(Edit, BlueprintVisible)
	struct FS_QuestStatusData                     local_RedForestQuestState;                         // 0x0068(0x0058)(Edit, BlueprintVisible, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_QuestStatusData                     CallFunc_Map_Find_Value;                           // 0x00D0(0x0058)(HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_QuestStatus                                 Temp_byte_Variable;                                // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12A[0x6];                                      // 0x012A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_Map_Keys_Keys;                            // 0x0130(0x0010)(ReferenceParm)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x014C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_QuestStatus                                 Temp_byte_Variable_1;                              // 0x014D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x014E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_QuestStatus                                 K2Node_Select_Default;                             // 0x014F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SaveGameObjectUpgrader_V0_To_V1_C_SetRedForestQuestState) == 0x000008, "Wrong alignment on BP_SaveGameObjectUpgrader_V0_To_V1_C_SetRedForestQuestState");
static_assert(sizeof(BP_SaveGameObjectUpgrader_V0_To_V1_C_SetRedForestQuestState) == 0x000150, "Wrong size on BP_SaveGameObjectUpgrader_V0_To_V1_C_SetRedForestQuestState");
static_assert(offsetof(BP_SaveGameObjectUpgrader_V0_To_V1_C_SetRedForestQuestState, From) == 0x000000, "Member 'BP_SaveGameObjectUpgrader_V0_To_V1_C_SetRedForestQuestState::From' has a wrong offset!");
static_assert(offsetof(BP_SaveGameObjectUpgrader_V0_To_V1_C_SetRedForestQuestState, To) == 0x000008, "Member 'BP_SaveGameObjectUpgrader_V0_To_V1_C_SetRedForestQuestState::To' has a wrong offset!");
