#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SaveManager

#include "Basic.hpp"

#include "S_SaveGameObjectUpgraderData_structs.hpp"
#include "E_SaveManagerLoadingStatus_structs.hpp"
#include "S_jRPG_Item_DynamicData_structs.hpp"
#include "S_LevelSpawnPointsData_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "S_SaveSlotMetaData_structs.hpp"
#include "S_jRPG_CharacterSaveState_structs.hpp"
#include "S_jRPG_PartySlot_structs.hpp"
#include "FLevelDataEntry_structs.hpp"
#include "S_SaveSlotData_structs.hpp"
#include "FDebugSaveGame_structs.hpp"
#include "E_QuestStatus_structs.hpp"
#include "S_QuestStatusData_structs.hpp"
#include "SandFall_structs.hpp"
#include "S_LootContext_structs.hpp"
#include "S_jRPG_CharacterDefinition_structs.hpp"
#include "S_LoadGameRequest_structs.hpp"
#include "ELevelType_structs.hpp"
#include "S_UINotificationPool_structs.hpp"
#include "FPassiveEffectProgression_structs.hpp"
#include "S_UIFavoritePool_structs.hpp"
#include "S_AreaAudioParameters_structs.hpp"
#include "S_WeaponInstanceHandle_structs.hpp"


namespace SDK::Params
{

// Function BP_SaveManager.BP_SaveManager_C.AddBackupSaveToSelectedSlot
// 0x00E8 (0x00E8 - 0x0000)
struct BP_SaveManager_C_AddBackupSaveToSelectedSlot final
{
public:
	class FString                                 SaveName;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	TArray<class FString>                         SavesToDelete;                                     // 0x0010(0x0010)(Parm, OutParm)
	TArray<class FString>                         LocalSavesToDelete;                                // 0x0020(0x0010)(Edit, BlueprintVisible)
	TArray<class FString>                         local_BackupSaves;                                 // 0x0030(0x0010)(Edit, BlueprintVisible)
	TArray<class FString>                         Temp_wildcard_Variable;                            // 0x0040(0x0010)(ReferenceParm)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDateTime                              CallFunc_UtcNow_ReturnValue;                       // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Array_Get_Item;                           // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_ComputeSaveFilePath_ReturnValue;          // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8D[0x3];                                       // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_95[0x3];                                       // 0x0095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9D[0x3];                                       // 0x009D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Array_Get_Item_1;                         // 0x00B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C5[0x3];                                       // 0x00C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_LastIndex_ReturnValue_1;            // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Min_ReturnValue;                          // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue;                          // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SaveManager_C_AddBackupSaveToSelectedSlot) == 0x000008, "Wrong alignment on BP_SaveManager_C_AddBackupSaveToSelectedSlot");
static_assert(sizeof(BP_SaveManager_C_AddBackupSaveToSelectedSlot) == 0x0000E8, "Wrong size on BP_SaveManager_C_AddBackupSaveToSelectedSlot");
static_assert(offsetof(BP_SaveManager_C_AddBackupSaveToSelectedSlot, SaveName) == 0x000000, "Member 'BP_SaveManager_C_AddBackupSaveToSelectedSlot::SaveName' has a wrong offset!");
static_assert(offsetof(BP_SaveManager_C_AddBackupSaveToSelectedSlot, SavesToDelete) == 0x000010, "Member 'BP_SaveManager_C_AddBackupSaveToSelectedSlot::SavesToDelete' has a wrong offset!");
static_assert(offsetof(BP_SaveManager_C_AddBackupSaveToSelectedSlot, LocalSavesToDelete) == 0x000020, "Member 'BP_SaveManager_C_AddBackupSaveToSelectedSlot::LocalSavesToDelete' has a wrong offset!");
static_assert(offsetof(BP_SaveManager_C_AddBackupSaveToSelectedSlot, local_BackupSaves) == 0x000030, "Member 'BP_SaveManager_C_AddBackupSaveToSelectedSlot::local_BackupSaves' has a wrong offset!");
static_assert(offsetof(BP_SaveManager_C_AddBackupSaveToSelectedSlot, Temp_wildcard_Variable) == 0x000040, "Member 'BP_SaveManager_C_AddBackupSaveToSelectedSlot::Temp_wildcard_Variable' has a wrong offset!");
static_assert(offsetof(BP_SaveManager_C_AddBackupSaveToSelectedSlot, Temp_int_Array_Index_Variable) == 0x000050, "Member 'BP_SaveManager_C_AddBackupSaveToSelectedSlot::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_SaveManager_C_AddBackupSaveToSelectedSlot, CallFunc_UtcNow_ReturnValue) == 0x000058, "Member 'BP_SaveManager_C_AddBackupSaveToSelectedSlot::CallFunc_UtcNow_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SaveManager_C_AddBackupSaveToSelectedSlot, CallFunc_Subtract_IntInt_ReturnValue) == 0x000060, "Member 'BP_SaveManager_C_AddBackupSaveToSelectedSlot::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SaveManager_C_AddBackupSaveToSelectedSlot, CallFunc_Array_Get_Item) == 0x000068, "Member 'BP_SaveManager_C_AddBackupSaveToSelectedSlot::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_SaveManager_C_AddBackupSaveToSelectedSlot, CallFunc_ComputeSaveFilePath_ReturnValue) == 0x000078, "Member 'BP_SaveManager_C_AddBackupSaveToSelectedSlot::CallFunc_ComputeSaveFilePath_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SaveManager_C_AddBackupSaveToSelectedSlot, CallFunc_Array_Add_ReturnValue) == 0x000088, "Member 'BP_SaveManager_C_AddBackupSaveToSelectedSlot::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SaveManager_C_AddBackupSaveToSelectedSlot, CallFunc_Array_Contains_ReturnValue) == 0x00008C, "Member 'BP_SaveManager_C_AddBackupSaveToSelectedSlot::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SaveManager_C_AddBackupSaveToSelectedSlot, CallFunc_Array_Length_ReturnValue) == 0x000090, "Member 'BP_SaveManager_C_AddBackupSaveToSelectedSlot::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SaveManager_C_AddBackupSaveToSelectedSlot, CallFunc_Not_PreBool_ReturnValue) == 0x000094, "Member 'BP_SaveManager_C_AddBackupSaveToSelectedSlot::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SaveManager_C_AddBackupSaveToSelectedSlot, Temp_int_Loop_Counter_Variable) == 0x000098, "Member 'BP_SaveManager_C_AddBackupSaveToSelectedSlot::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_SaveManager_C_AddBackupSaveToSelectedSlot, CallFunc_Less_IntInt_ReturnValue) == 0x00009C, "Member 'BP_SaveManager_C_AddBackupSaveToSelectedSlot::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SaveManager_C_AddBackupSaveToSelectedSlot, CallFunc_Add_IntInt_ReturnValue) == 0x0000A0, "Member 'BP_SaveManager_C_AddBackupSaveToSelectedSlot::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SaveManager_C_AddBackupSaveToSelectedSlot, Temp_int_Variable) == 0x0000A4, "Member 'BP_SaveManager_C_AddBackupSaveToSelectedSlot::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_SaveManager_C_AddBackupSaveToSelectedSlot, CallFunc_Add_IntInt_ReturnValue_1) == 0x0000A8, "Member 'BP_SaveManager_C_AddBackupSaveToSelectedSlot::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SaveManager_C_AddBackupSaveToSelectedSlot, CallFunc_Array_Get_Item_1) == 0x0000B0, "Member 'BP_SaveManager_C_AddBackupSaveToSelectedSlot::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_SaveManager_C_AddBackupSaveToSelectedSlot, CallFunc_Array_Add_ReturnValue_1) == 0x0000C0, "Member 'BP_SaveManager_C_AddBackupSaveToSelectedSlot::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SaveManager_C_AddBackupSaveToSelectedSlot, CallFunc_Array_IsValidIndex_ReturnValue) == 0x0000C4, "Member 'BP_SaveManager_C_AddBackupSaveToSelectedSlot::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SaveManager_C_AddBackupSaveToSelectedSlot, CallFunc_Array_LastIndex_ReturnValue) == 0x0000C8, "Member 'BP_SaveManager_C_AddBackupSaveToSelectedSlot::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SaveManager_C_AddBackupSaveToSelectedSlot, CallFunc_Array_AddUnique_ReturnValue) == 0x0000CC, "Member 'BP_SaveManager_C_AddBackupSaveToSelectedSlot::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SaveManager_C_AddBackupSaveToSelectedSlot, CallFunc_Array_LastIndex_ReturnValue_1) == 0x0000D0, "Member 'BP_SaveManager_C_AddBackupSaveToSelectedSlot::CallFunc_Array_LastIndex_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SaveManager_C_AddBackupSaveToSelectedSlot, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x0000D4, "Member 'BP_SaveManager_C_AddBackupSaveToSelectedSlot::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SaveManager_C_AddBackupSaveToSelectedSlot, CallFunc_Min_ReturnValue) == 0x0000D8, "Member 'BP_SaveManager_C_AddBackupSaveToSelectedSlot::CallFunc_Min_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SaveManager_C_AddBackupSaveToSelectedSlot, CallFunc_Max_ReturnValue) == 0x0000DC, "Member 'BP_SaveManager_C_AddBackupSaveToSelectedSlot::CallFunc_Max_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SaveManager_C_AddBackupSaveToSelectedSlot, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0000E0, "Member 'BP_SaveManager_C_AddBackupSaveToSelectedSlot::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");

// Function BP_SaveManager.BP_SaveManager_C.AsyncLoadGameFromSlot
// 0x0010 (0x0010 - 0x0000)
struct BP_SaveManager_C_AsyncLoadGameFromSlot final
{
public:
	class FString                                 SlotName;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SaveManager_C_AsyncLoadGameFromSlot) == 0x000008, "Wrong alignment on BP_SaveManager_C_AsyncLoadGameFromSlot");
static_assert(sizeof(BP_SaveManager_C_AsyncLoadGameFromSlot) == 0x000010, "Wrong size on BP_SaveManager_C_AsyncLoadGameFromSlot");
static_assert(offsetof(BP_SaveManager_C_AsyncLoadGameFromSlot, SlotName) == 0x000000, "Member 'BP_SaveManager_C_AsyncLoadGameFromSlot::SlotName' has a wrong offset!");

// Function BP_SaveManager.BP_SaveManager_C.AsyncSaveGameToSlot
// 0x0018 (0x0018 - 0x0000)
struct BP_SaveManager_C_AsyncSaveGameToSlot final
{
public:
	class USaveGame*                              SaveGameObject;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 SlotName;                                          // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SaveManager_C_AsyncSaveGameToSlot) == 0x000008, "Wrong alignment on BP_SaveManager_C_AsyncSaveGameToSlot");
static_assert(sizeof(BP_SaveManager_C_AsyncSaveGameToSlot) == 0x000018, "Wrong size on BP_SaveManager_C_AsyncSaveGameToSlot");
static_assert(offsetof(BP_SaveManager_C_AsyncSaveGameToSlot, SaveGameObject) == 0x000000, "Member 'BP_SaveManager_C_AsyncSaveGameToSlot::SaveGameObject' has a wrong offset!");
static_assert(offsetof(BP_SaveManager_C_AsyncSaveGameToSlot, SlotName) == 0x000008, "Member 'BP_SaveManager_C_AsyncSaveGameToSlot::SlotName' has a wrong offset!");

// Function BP_SaveManager.BP_SaveManager_C.CacheLastSaveTimestamp
// 0x0008 (0x0008 - 0x0000)
struct BP_SaveManager_C_CacheLastSaveTimestamp final
{
public:
	struct FDateTime                              CallFunc_UtcNow_ReturnValue;                       // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SaveManager_C_CacheLastSaveTimestamp) == 0x000008, "Wrong alignment on BP_SaveManager_C_CacheLastSaveTimestamp");
static_assert(sizeof(BP_SaveManager_C_CacheLastSaveTimestamp) == 0x000008, "Wrong size on BP_SaveManager_C_CacheLastSaveTimestamp");
static_assert(offsetof(BP_SaveManager_C_CacheLastSaveTimestamp, CallFunc_UtcNow_ReturnValue) == 0x000000, "Member 'BP_SaveManager_C_CacheLastSaveTimestamp::CallFunc_UtcNow_ReturnValue' has a wrong offset!");

// Function BP_SaveManager.BP_SaveManager_C.CanLoadSave
// 0x0006 (0x0006 - 0x0000)
struct BP_SaveManager_C_CanLoadSave final
{
public:
	bool                                          CanLoad;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLoadInProgress_IsInProgress;            // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSaveInProgress_IsInProgress;            // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SaveManager_C_CanLoadSave) == 0x000001, "Wrong alignment on BP_SaveManager_C_CanLoadSave");
static_assert(sizeof(BP_SaveManager_C_CanLoadSave) == 0x000006, "Wrong size on BP_SaveManager_C_CanLoadSave");
static_assert(offsetof(BP_SaveManager_C_CanLoadSave, CanLoad) == 0x000000, "Member 'BP_SaveManager_C_CanLoadSave::CanLoad' has a wrong offset!");
static_assert(offsetof(BP_SaveManager_C_CanLoadSave, CallFunc_IsLoadInProgress_IsInProgress) == 0x000001, "Member 'BP_SaveManager_C_CanLoadSave::CallFunc_IsLoadInProgress_IsInProgress' has a wrong offset!");
static_assert(offsetof(BP_SaveManager_C_CanLoadSave, CallFunc_IsSaveInProgress_IsInProgress) == 0x000002, "Member 'BP_SaveManager_C_CanLoadSave::CallFunc_IsSaveInProgress_IsInProgress' has a wrong offset!");
static_assert(offsetof(BP_SaveManager_C_CanLoadSave, CallFunc_Not_PreBool_ReturnValue) == 0x000003, "Member 'BP_SaveManager_C_CanLoadSave::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SaveManager_C_CanLoadSave, CallFunc_Not_PreBool_ReturnValue_1) == 0x000004, "Member 'BP_SaveManager_C_CanLoadSave::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SaveManager_C_CanLoadSave, CallFunc_BooleanAND_ReturnValue) == 0x000005, "Member 'BP_SaveManager_C_CanLoadSave::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BP_SaveManager.BP_SaveManager_C.CanSave
// 0x0060 (0x0060 - 0x0000)
struct BP_SaveManager_C_CanSave final
{
public:
	bool                                          CanSave_0;                                         // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSaveOrLoadInProgress_ReturnValue;       // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasProcessSaveRecently_ReturnValue;       // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldInfoComponent_C*               CallFunc_GetComponentByClass_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ABP_jRPG_Controller_World_C*            K2Node_DynamicCast_AsBP_J_RPG_Controller_World;    // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetDistanceToClosestEnemy_DistanceToClosestEnemy; // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAreaChangeInProgress_ReturnNode;        // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInBattle_ReturnValue;                   // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnyMenuVisible_ReturnValue;             // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldBlockAutoSave_ReturnValue;          // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasDialogueInQueue_ReturnValue;           // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasActiveDialogue_ReturnValue;            // 0x003E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMapChangeInProgress_InProgress;         // 0x003F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_3;                  // 0x0053(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_4;                  // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCrouching_ReturnValue;                  // 0x0055(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_5;                  // 0x0056(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0057(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_6;                  // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMovingOnGround_ReturnValue;             // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_7;                  // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x005B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_8;                  // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SaveManager_C_CanSave) == 0x000008, "Wrong alignment on BP_SaveManager_C_CanSave");
static_assert(sizeof(BP_SaveManager_C_CanSave) == 0x000060, "Wrong size on BP_SaveManager_C_CanSave");
static_assert(offsetof(BP_SaveManager_C_CanSave, CanSave_0) == 0x000000, "Member 'BP_SaveManager_C_CanSave::CanSave_0' has a wrong offset!");
static_assert(offsetof(BP_SaveManager_C_CanSave, CallFunc_IsSaveOrLoadInProgress_ReturnValue) == 0x000001, "Member 'BP_SaveManager_C_CanSave::CallFunc_IsSaveOrLoadInProgress_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SaveManager_C_CanSave, CallFunc_HasProcessSaveRecently_ReturnValue) == 0x000002, "Member 'BP_SaveManager_C_CanSave::CallFunc_HasProcessSaveRecently_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SaveManager_C_CanSave, CallFunc_GetGameMode_ReturnValue) == 0x000008, "Member 'BP_SaveManager_C_CanSave::CallFunc_GetGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SaveManager_C_CanSave, CallFunc_GetPlayerController_ReturnValue) == 0x000010, "Member 'BP_SaveManager_C_CanSave::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SaveManager_C_CanSave, CallFunc_GetComponentByClass_ReturnValue) == 0x000018, "Member 'BP_SaveManager_C_CanSave::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SaveManager_C_CanSave, K2Node_DynamicCast_AsBP_J_RPG_Controller_World) == 0x000020, "Member 'BP_SaveManager_C_CanSave::K2Node_DynamicCast_AsBP_J_RPG_Controller_World' has a wrong offset!");
static_assert(offsetof(BP_SaveManager_C_CanSave, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BP_SaveManager_C_CanSave::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_SaveManager_C_CanSave, CallFunc_GetDistanceToClosestEnemy_DistanceToClosestEnemy) == 0x000030, "Member 'BP_SaveManager_C_CanSave::CallFunc_GetDistanceToClosestEnemy_DistanceToClosestEnemy' has a wrong offset!");
static_assert(offsetof(BP_SaveManager_C_CanSave, CallFunc_IsAreaChangeInProgress_ReturnNode) == 0x000038, "Member 'BP_SaveManager_C_CanSave::CallFunc_IsAreaChangeInProgress_ReturnNode' has a wrong offset!");
static_assert(offsetof(BP_SaveManager_C_CanSave, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x000039, "Member 'BP_SaveManager_C_CanSave::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SaveManager_C_CanSave, CallFunc_IsInBattle_ReturnValue) == 0x00003A, "Member 'BP_SaveManager_C_CanSave::CallFunc_IsInBattle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SaveManager_C_CanSave, CallFunc_IsAnyMenuVisible_ReturnValue) == 0x00003B, "Member 'BP_SaveManager_C_CanSave::CallFunc_IsAnyMenuVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SaveManager_C_CanSave, CallFunc_ShouldBlockAutoSave_ReturnValue) == 0x00003C, "Member 'BP_SaveManager_C_CanSave::CallFunc_ShouldBlockAutoSave_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SaveManager_C_CanSave, CallFunc_HasDialogueInQueue_ReturnValue) == 0x00003D, "Member 'BP_SaveManager_C_CanSave::CallFunc_HasDialogueInQueue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SaveManager_C_CanSave, CallFunc_HasActiveDialogue_ReturnValue) == 0x00003E, "Member 'BP_SaveManager_C_CanSave::CallFunc_HasActiveDialogue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SaveManager_C_CanSave, CallFunc_IsMapChangeInProgress_InProgress) == 0x00003F, "Member 'BP_SaveManager_C_CanSave::CallFunc_IsMapChangeInProgress_InProgress' has a wrong offset!");
static_assert(offsetof(BP_SaveManager_C_CanSave, CallFunc_BooleanOR_ReturnValue) == 0x000040, "Member 'BP_SaveManager_C_CanSave::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SaveManager_C_CanSave, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000048, "Member 'BP_SaveManager_C_CanSave::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SaveManager_C_CanSave, CallFunc_BooleanOR_ReturnValue_1) == 0x000050, "Member 'BP_SaveManager_C_CanSave::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SaveManager_C_CanSave, CallFunc_IsValid_ReturnValue) == 0x000051, "Member 'BP_SaveManager_C_CanSave::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SaveManager_C_CanSave, CallFunc_BooleanOR_ReturnValue_2) == 0x000052, "Member 'BP_SaveManager_C_CanSave::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_SaveManager_C_CanSave, CallFunc_BooleanOR_ReturnValue_3) == 0x000053, "Member 'BP_SaveManager_C_CanSave::CallFunc_BooleanOR_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_SaveManager_C_CanSave, CallFunc_BooleanOR_ReturnValue_4) == 0x000054, "Member 'BP_SaveManager_C_CanSave::CallFunc_BooleanOR_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_SaveManager_C_CanSave, CallFunc_IsCrouching_ReturnValue) == 0x000055, "Member 'BP_SaveManager_C_CanSave::CallFunc_IsCrouching_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SaveManager_C_CanSave, CallFunc_BooleanOR_ReturnValue_5) == 0x000056, "Member 'BP_SaveManager_C_CanSave::CallFunc_BooleanOR_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_SaveManager_C_CanSave, CallFunc_Not_PreBool_ReturnValue) == 0x000057, "Member 'BP_SaveManager_C_CanSave::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SaveManager_C_CanSave, CallFunc_BooleanOR_ReturnValue_6) == 0x000058, "Member 'BP_SaveManager_C_CanSave::CallFunc_BooleanOR_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_SaveManager_C_CanSave, CallFunc_IsMovingOnGround_ReturnValue) == 0x000059, "Member 'BP_SaveManager_C_CanSave::CallFunc_IsMovingOnGround_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SaveManager_C_CanSave, CallFunc_BooleanOR_ReturnValue_7) == 0x00005A, "Member 'BP_SaveManager_C_CanSave::CallFunc_BooleanOR_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_SaveManager_C_CanSave, CallFunc_BooleanAND_ReturnValue) == 0x00005B, "Member 'BP_SaveManager_C_CanSave::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SaveManager_C_CanSave, CallFunc_BooleanOR_ReturnValue_8) == 0x00005C, "Member 'BP_SaveManager_C_CanSave::CallFunc_BooleanOR_ReturnValue_8' has a wrong offset!");

// Function BP_SaveManager.BP_SaveManager_C.ChangeAreaName
// 0x0018 (0x0018 - 0x0000)
struct BP_SaveManager_C_ChangeAreaName final
{
public:
	class FText                                   NewAreaName;                                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SaveManager_C_ChangeAreaName) == 0x000008, "Wrong alignment on BP_SaveManager_C_ChangeAreaName");
static_assert(sizeof(BP_SaveManager_C_ChangeAreaName) == 0x000018, "Wrong size on BP_SaveManager_C_ChangeAreaName");
static_assert(offsetof(BP_SaveManager_C_ChangeAreaName, NewAreaName) == 0x000000, "Member 'BP_SaveManager_C_ChangeAreaName::NewAreaName' has a wrong offset!");
static_assert(offsetof(BP_SaveManager_C_ChangeAreaName, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'BP_SaveManager_C_ChangeAreaName::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_SaveManager.BP_SaveManager_C.CheckSaveManagerSanity
// 0x00D8 (0x00D8 - 0x0000)
struct BP_SaveManager_C_CheckSaveManagerSanity final
{
public:
	bool                                          CallFunc_HasDetectedPotentialError_ReturnValue;    // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPackagedForDistribution_ReturnValue;    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetSaveManagerDebugStatus_ReturnValue;    // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0018(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0028(0x0048)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0070(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00B8(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Format_ReturnValue;                       // 0x00C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SaveManager_C_CheckSaveManagerSanity) == 0x000008, "Wrong alignment on BP_SaveManager_C_CheckSaveManagerSanity");
static_assert(sizeof(BP_SaveManager_C_CheckSaveManagerSanity) == 0x0000D8, "Wrong size on BP_SaveManager_C_CheckSaveManagerSanity");
static_assert(offsetof(BP_SaveManager_C_CheckSaveManagerSanity, CallFunc_HasDetectedPotentialError_ReturnValue) == 0x000000, "Member 'BP_SaveManager_C_CheckSaveManagerSanity::CallFunc_HasDetectedPotentialError_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SaveManager_C_CheckSaveManagerSanity, CallFunc_IsPackagedForDistribution_ReturnValue) == 0x000001, "Member 'BP_SaveManager_C_CheckSaveManagerSanity::CallFunc_IsPackagedForDistribution_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SaveManager_C_CheckSaveManagerSanity, CallFunc_Not_PreBool_ReturnValue) == 0x000002, "Member 'BP_SaveManager_C_CheckSaveManagerSanity::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SaveManager_C_CheckSaveManagerSanity, CallFunc_Not_PreBool_ReturnValue_1) == 0x000003, "Member 'BP_SaveManager_C_CheckSaveManagerSanity::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SaveManager_C_CheckSaveManagerSanity, CallFunc_GetSaveManagerDebugStatus_ReturnValue) == 0x000008, "Member 'BP_SaveManager_C_CheckSaveManagerSanity::CallFunc_GetSaveManagerDebugStatus_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SaveManager_C_CheckSaveManagerSanity, CallFunc_Conv_StringToText_ReturnValue) == 0x000018, "Member 'BP_SaveManager_C_CheckSaveManagerSanity::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SaveManager_C_CheckSaveManagerSanity, K2Node_MakeStruct_FormatArgumentData) == 0x000028, "Member 'BP_SaveManager_C_CheckSaveManagerSanity::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_SaveManager_C_CheckSaveManagerSanity, K2Node_MakeStruct_FormatArgumentData_1) == 0x000070, "Member 'BP_SaveManager_C_CheckSaveManagerSanity::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BP_SaveManager_C_CheckSaveManagerSanity, K2Node_MakeArray_Array) == 0x0000B8, "Member 'BP_SaveManager_C_CheckSaveManagerSanity::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_SaveManager_C_CheckSaveManagerSanity, CallFunc_Format_ReturnValue) == 0x0000C8, "Member 'BP_SaveManager_C_CheckSaveManagerSanity::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function BP_SaveManager.BP_SaveManager_C.Completed_1BF970B0492988DFD9A83ABA0B6CA48F
// 0x0001 (0x0001 - 0x0000)
struct BP_SaveManager_C_Completed_1BF970B0492988DFD9A83ABA0B6CA48F final
{
public:
	bool                                          bSuccess;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SaveManager_C_Completed_1BF970B0492988DFD9A83ABA0B6CA48F) == 0x000001, "Wrong alignment on BP_SaveManager_C_Completed_1BF970B0492988DFD9A83ABA0B6CA48F");
static_assert(sizeof(BP_SaveManager_C_Completed_1BF970B0492988DFD9A83ABA0B6CA48F) == 0x000001, "Wrong size on BP_SaveManager_C_Completed_1BF970B0492988DFD9A83ABA0B6CA48F");
static_assert(offsetof(BP_SaveManager_C_Completed_1BF970B0492988DFD9A83ABA0B6CA48F, bSuccess) == 0x000000, "Member 'BP_SaveManager_C_Completed_1BF970B0492988DFD9A83ABA0B6CA48F::bSuccess' has a wrong offset!");

// Function BP_SaveManager.BP_SaveManager_C.Completed_685A6FB94E7D73F6E74DDE807397F51F
// 0x0010 (0x0010 - 0x0000)
struct BP_SaveManager_C_Completed_685A6FB94E7D73F6E74DDE807397F51F final
{
public:
	class USaveGame*                              SaveGame;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          bSuccess;                                          // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SaveManager_C_Completed_685A6FB94E7D73F6E74DDE807397F51F) == 0x000008, "Wrong alignment on BP_SaveManager_C_Completed_685A6FB94E7D73F6E74DDE807397F51F");
static_assert(sizeof(BP_SaveManager_C_Completed_685A6FB94E7D73F6E74DDE807397F51F) == 0x000010, "Wrong size on BP_SaveManager_C_Completed_685A6FB94E7D73F6E74DDE807397F51F");
static_assert(offsetof(BP_SaveManager_C_Completed_685A6FB94E7D73F6E74DDE807397F51F, SaveGame) == 0x000000, "Member 'BP_SaveManager_C_Completed_685A6FB94E7D73F6E74DDE807397F51F::SaveGame' has a wrong offset!");
static_assert(offsetof(BP_SaveManager_C_Completed_685A6FB94E7D73F6E74DDE807397F51F, bSuccess) == 0x000008, "Member 'BP_SaveManager_C_Completed_685A6FB94E7D73F6E74DDE807397F51F::bSuccess' has a wrong offset!");

// Function BP_SaveManager.BP_SaveManager_C.Completed_9195BA6349F82F2F84FF31A31A028C3E
// 0x0010 (0x0010 - 0x0000)
struct BP_SaveManager_C_Completed_9195BA6349F82F2F84FF31A31A028C3E final
{
public:
	class USaveGame*                              SaveGame;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          bSuccess;                                          // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SaveManager_C_Completed_9195BA6349F82F2F84FF31A31A028C3E) == 0x000008, "Wrong alignment on BP_SaveManager_C_Completed_9195BA6349F82F2F84FF31A31A028C3E");
static_assert(sizeof(BP_SaveManager_C_Completed_9195BA6349F82F2F84FF31A31A028C3E) == 0x000010, "Wrong size on BP_SaveManager_C_Completed_9195BA6349F82F2F84FF31A31A028C3E");
static_assert(offsetof(BP_SaveManager_C_Completed_9195BA6349F82F2F84FF31A31A028C3E, SaveGame) == 0x000000, "Member 'BP_SaveManager_C_Completed_9195BA6349F82F2F84FF31A31A028C3E::SaveGame' has a wrong offset!");
static_assert(offsetof(BP_SaveManager_C_Completed_9195BA6349F82F2F84FF31A31A028C3E, bSuccess) == 0x000008, "Member 'BP_SaveManager_C_Completed_9195BA6349F82F2F84FF31A31A028C3E::bSuccess' has a wrong offset!");

// Function BP_SaveManager.BP_SaveManager_C.Completed_BC27564C4EAA81FC716AA5B004066701
// 0x0010 (0x0010 - 0x0000)
struct BP_SaveManager_C_Completed_BC27564C4EAA81FC716AA5B004066701 final
{
public:
	class USaveGame*                              SaveGame;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          bSuccess;                                          // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SaveManager_C_Completed_BC27564C4EAA81FC716AA5B004066701) == 0x000008, "Wrong alignment on BP_SaveManager_C_Completed_BC27564C4EAA81FC716AA5B004066701");
static_assert(sizeof(BP_SaveManager_C_Completed_BC27564C4EAA81FC716AA5B004066701) == 0x000010, "Wrong size on BP_SaveManager_C_Completed_BC27564C4EAA81FC716AA5B004066701");
static_assert(offsetof(BP_SaveManager_C_Completed_BC27564C4EAA81FC716AA5B004066701, SaveGame) == 0x000000, "Member 'BP_SaveManager_C_Completed_BC27564C4EAA81FC716AA5B004066701::SaveGame' has a wrong offset!");
static_assert(offsetof(BP_SaveManager_C_Completed_BC27564C4EAA81FC716AA5B004066701, bSuccess) == 0x000008, "Member 'BP_SaveManager_C_Completed_BC27564C4EAA81FC716AA5B004066701::bSuccess' has a wrong offset!");

// Function BP_SaveManager.BP_SaveManager_C.Completed_CBDE04C044E45CF17D3AE2ABD1343457
// 0x0010 (0x0010 - 0x0000)
struct BP_SaveManager_C_Completed_CBDE04C044E45CF17D3AE2ABD1343457 final
{
public:
	class USaveGame*                              SaveGame;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          bSuccess;                                          // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SaveManager_C_Completed_CBDE04C044E45CF17D3AE2ABD1343457) == 0x000008, "Wrong alignment on BP_SaveManager_C_Completed_CBDE04C044E45CF17D3AE2ABD1343457");
static_assert(sizeof(BP_SaveManager_C_Completed_CBDE04C044E45CF17D3AE2ABD1343457) == 0x000010, "Wrong size on BP_SaveManager_C_Completed_CBDE04C044E45CF17D3AE2ABD1343457");
static_assert(offsetof(BP_SaveManager_C_Completed_CBDE04C044E45CF17D3AE2ABD1343457, SaveGame) == 0x000000, "Member 'BP_SaveManager_C_Completed_CBDE04C044E45CF17D3AE2ABD1343457::SaveGame' has a wrong offset!");
static_assert(offsetof(BP_SaveManager_C_Completed_CBDE04C044E45CF17D3AE2ABD1343457, bSuccess) == 0x000008, "Member 'BP_SaveManager_C_Completed_CBDE04C044E45CF17D3AE2ABD1343457::bSuccess' has a wrong offset!");

// Function BP_SaveManager.BP_SaveManager_C.Completed_DE2492DD4E117FE40A9225B702CCF94E
// 0x0010 (0x0010 - 0x0000)
struct BP_SaveManager_C_Completed_DE2492DD4E117FE40A9225B702CCF94E final
{
public:
	class USaveGame*                              SaveGame;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          bSuccess;                                          // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SaveManager_C_Completed_DE2492DD4E117FE40A9225B702CCF94E) == 0x000008, "Wrong alignment on BP_SaveManager_C_Completed_DE2492DD4E117FE40A9225B702CCF94E");
static_assert(sizeof(BP_SaveManager_C_Completed_DE2492DD4E117FE40A9225B702CCF94E) == 0x000010, "Wrong size on BP_SaveManager_C_Completed_DE2492DD4E117FE40A9225B702CCF94E");
static_assert(offsetof(BP_SaveManager_C_Completed_DE2492DD4E117FE40A9225B702CCF94E, SaveGame) == 0x000000, "Member 'BP_SaveManager_C_Completed_DE2492DD4E117FE40A9225B702CCF94E::SaveGame' has a wrong offset!");
static_assert(offsetof(BP_SaveManager_C_Completed_DE2492DD4E117FE40A9225B702CCF94E, bSuccess) == 0x000008, "Member 'BP_SaveManager_C_Completed_DE2492DD4E117FE40A9225B702CCF94E::bSuccess' has a wrong offset!");

// Function BP_SaveManager.BP_SaveManager_C.ComputeSaveFilePath
// 0x0038 (0x0038 - 0x0000)
struct BP_SaveManager_C_ComputeSaveFilePath final
{
public:
	class FString                                 SaveName;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
	class UPlatformsSubsystem*                    CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_ComputeSaveNameWithPath_ReturnValue;      // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SaveManager_C_ComputeSaveFilePath) == 0x000008, "Wrong alignment on BP_SaveManager_C_ComputeSaveFilePath");
static_assert(sizeof(BP_SaveManager_C_ComputeSaveFilePath) == 0x000038, "Wrong size on BP_SaveManager_C_ComputeSaveFilePath");
static_assert(offsetof(BP_SaveManager_C_ComputeSaveFilePath, SaveName) == 0x000000, "Member 'BP_SaveManager_C_ComputeSaveFilePath::SaveName' has a wrong offset!");
static_assert(offsetof(BP_SaveManager_C_ComputeSaveFilePath, ReturnValue) == 0x000010, "Member 'BP_SaveManager_C_ComputeSaveFilePath::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SaveManager_C_ComputeSaveFilePath, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000020, "Member 'BP_SaveManager_C_ComputeSaveFilePath::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SaveManager_C_ComputeSaveFilePath, CallFunc_ComputeSaveNameWithPath_ReturnValue) == 0x000028, "Member 'BP_SaveManager_C_ComputeSaveFilePath::CallFunc_ComputeSaveNameWithPath_ReturnValue' has a wrong offset!");

// Function BP_SaveManager.BP_SaveManager_C.ComputeSaveMetaData
// 0x0060 (0x0060 - 0x0000)
struct BP_SaveManager_C_ComputeSaveMetaData final
{
public:
	struct FS_SaveSlotMetaData                    SaveMetaData;                                      // 0x0000(0x0030)(Parm, OutParm, HasGetValueTypeHash)
	struct FS_SaveSlotMetaData                    K2Node_MakeStruct_S_SaveSlotMetaData;              // 0x0030(0x0030)(HasGetValueTypeHash)
};
static_assert(alignof(BP_SaveManager_C_ComputeSaveMetaData) == 0x000008, "Wrong alignment on BP_SaveManager_C_ComputeSaveMetaData");
static_assert(sizeof(BP_SaveManager_C_ComputeSaveMetaData) == 0x000060, "Wrong size on BP_SaveManager_C_ComputeSaveMetaData");
static_assert(offsetof(BP_SaveManager_C_ComputeSaveMetaData, SaveMetaData) == 0x000000, "Member 'BP_SaveManager_C_ComputeSaveMetaData::SaveMetaData' has a wrong offset!");
static_assert(offsetof(BP_SaveManager_C_ComputeSaveMetaData, K2Node_MakeStruct_S_SaveSlotMetaData) == 0x000030, "Member 'BP_SaveManager_C_ComputeSaveMetaData::K2Node_MakeStruct_S_SaveSlotMetaData' has a wrong offset!");

// Function BP_SaveManager.BP_SaveManager_C.DEBUG_MakeSaveGameFromData
// 0x04B0 (0x04B0 - 0x0000)
struct BP_SaveManager_C_DEBUG_MakeSaveGameFromData final
{
public:
	struct FFDebugSaveGame                        SaveData;                                          // 0x0000(0x0180)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference, HasGetValueTypeHash)
	class UBP_jRPG_GameSave_C*                    CreatedSaveGameObject;                             // 0x0180(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TMap<class FName, int32>                      local_legacyInventoryItems;                        // 0x0188(0x0050)(Edit, BlueprintVisible)
	struct FFDebugSaveGame                        local_debugSaveRow;                                // 0x01D8(0x0180)(Edit, BlueprintVisible, ContainsInstancedReference, HasGetValueTypeHash)
	class UBP_jRPG_GameSave_C*                    local_createdSaveGame;                             // 0x0358(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0360(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0364(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0368(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x036C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x036D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36E[0x2];                                      // 0x036E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0370(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0374(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0378(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x037C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames;         // 0x0380(0x0010)(ReferenceParm)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0390(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0398(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39C[0x4];                                      // 0x039C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_jRPG_GameSave_C*                    CallFunc_SpawnObject_ReturnValue;                  // 0x03A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           CallFunc_Map_Keys_Keys;                            // 0x03A8(0x0010)(ReferenceParm)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x03B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B9[0x3];                                      // 0x03B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Array_Get_Item_1;                         // 0x03BC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Map_Find_Value;                           // 0x03C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x03C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C9[0x3];                                      // 0x03C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x03CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDataRowHandleSet_ReturnValue;           // 0x03D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x03D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x03D2(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_QuestStatus                                 Temp_byte_Variable;                                // 0x03D3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_QuestStatus                                 Temp_byte_Variable_1;                              // 0x03D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x03D5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_QuestStatus                                 K2Node_Select_Default;                             // 0x03D6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D7[0x1];                                      // 0x03D7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x03D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3DC[0x4];                                      // 0x03DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_QuestStatusData                     K2Node_MakeStruct_S_QuestStatusData;               // 0x03E0(0x0058)(HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0438(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_439[0x3];                                      // 0x0439(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x043C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0440(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_441[0x7];                                      // 0x0441(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNamedID*                               CallFunc_Array_Get_Item_2;                         // 0x0448(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TMap<class FName, int32>                      CallFunc_ConvertItemsToSave_SavedItems;            // 0x0450(0x0050)()
	bool                                          CallFunc_Array_IsEmpty_ReturnValue;                // 0x04A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A1[0x3];                                      // 0x04A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x04A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x04A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SaveManager_C_DEBUG_MakeSaveGameFromData) == 0x000008, "Wrong alignment on BP_SaveManager_C_DEBUG_MakeSaveGameFromData");
static_assert(sizeof(BP_SaveManager_C_DEBUG_MakeSaveGameFromData) == 0x0004B0, "Wrong size on BP_SaveManager_C_DEBUG_MakeSaveGameFromData");
static_assert(offsetof(BP_SaveManager_C_DEBUG_MakeSaveGameFromData, SaveData) == 0x000000, "Member 'BP_SaveManager_C_DEBUG_MakeSaveGameFromData::SaveData' has a wrong offset!");
static_assert(offsetof(BP_SaveManager_C_DEBUG_MakeSaveGameFromData, CreatedSaveGameObject) == 0x000180, "Member 'BP_SaveManager_C_DEBUG_MakeSaveGameFromData::CreatedSaveGameObject' has a wrong offset!");
static_assert(offsetof(BP_SaveManager_C_DEBUG_MakeSaveGameFromData, local_legacyInventoryItems) == 0x000188, "Member 'BP_SaveManager_C_DEBUG_MakeSaveGameFromData::local_legacyInventoryItems' has a wrong offset!");
static_assert(offsetof(BP_SaveManager_C_DEBUG_MakeSaveGameFromData, local_debugSaveRow) == 0x0001D8, "Member 'BP_SaveManager_C_DEBUG_MakeSaveGameFromData::local_debugSaveRow' has a wrong offset!");
static_assert(offsetof(BP_SaveManager_C_DEBUG_MakeSaveGameFromData, local_createdSaveGame) == 0x000358, "Member 'BP_SaveManager_C_DEBUG_MakeSaveGameFromData::local_createdSaveGame' has a wrong offset!");
static_assert(offsetof(BP_SaveManager_C_DEBUG_MakeSaveGameFromData, Temp_int_Loop_Counter_Variable) == 0x000360, "Member 'BP_SaveManager_C_DEBUG_MakeSaveGameFromData::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_SaveManager_C_DEBUG_MakeSaveGameFromData, CallFunc_Add_IntInt_ReturnValue) == 0x000364, "Member 'BP_SaveManager_C_DEBUG_MakeSaveGameFromData::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
