#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Shard_ArmRing

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_Shard_ArmRing.BP_Shard_ArmRing_C.ExecuteUbergraph_BP_Shard_ArmRing
// 0x0210 (0x0210 - 0x0000)
struct BP_Shard_ArmRing_C_ExecuteUbergraph_BP_Shard_ArmRing final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Lerp_ReturnValue;                         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue_1;                       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue_2;                       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue_3;                       // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue_4;                       // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue_5;                       // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue;           // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue_6;                       // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_2;         // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue_7;                       // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue_8;                       // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0090(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x00C0(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	double                                        CallFunc_Lerp_Alpha_ImplicitCast;                  // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_Alpha_ImplicitCast_1;                // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_Alpha_ImplicitCast_2;                // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_Alpha_ImplicitCast_3;                // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_Alpha_ImplicitCast_4;                // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_Alpha_ImplicitCast_5;                // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_Alpha_ImplicitCast_6;                // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_Alpha_ImplicitCast_7;                // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_Alpha_ImplicitCast_8;                // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetFloatParameter_Param_ImplicitCast;     // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValueOnMaterials_ParameterValue_ImplicitCast; // 0x0204(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetFloatParameter_Param_ImplicitCast_1;   // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetFloatParameter_Param_ImplicitCast_2;   // 0x020C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Shard_ArmRing_C_ExecuteUbergraph_BP_Shard_ArmRing) == 0x000008, "Wrong alignment on BP_Shard_ArmRing_C_ExecuteUbergraph_BP_Shard_ArmRing");
static_assert(sizeof(BP_Shard_ArmRing_C_ExecuteUbergraph_BP_Shard_ArmRing) == 0x000210, "Wrong size on BP_Shard_ArmRing_C_ExecuteUbergraph_BP_Shard_ArmRing");
static_assert(offsetof(BP_Shard_ArmRing_C_ExecuteUbergraph_BP_Shard_ArmRing, EntryPoint) == 0x000000, "Member 'BP_Shard_ArmRing_C_ExecuteUbergraph_BP_Shard_ArmRing::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Shard_ArmRing_C_ExecuteUbergraph_BP_Shard_ArmRing, CallFunc_Lerp_ReturnValue) == 0x000008, "Member 'BP_Shard_ArmRing_C_ExecuteUbergraph_BP_Shard_ArmRing::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Shard_ArmRing_C_ExecuteUbergraph_BP_Shard_ArmRing, CallFunc_Lerp_ReturnValue_1) == 0x000010, "Member 'BP_Shard_ArmRing_C_ExecuteUbergraph_BP_Shard_ArmRing::CallFunc_Lerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Shard_ArmRing_C_ExecuteUbergraph_BP_Shard_ArmRing, CallFunc_Lerp_ReturnValue_2) == 0x000018, "Member 'BP_Shard_ArmRing_C_ExecuteUbergraph_BP_Shard_ArmRing::CallFunc_Lerp_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Shard_ArmRing_C_ExecuteUbergraph_BP_Shard_ArmRing, CallFunc_Lerp_ReturnValue_3) == 0x000020, "Member 'BP_Shard_ArmRing_C_ExecuteUbergraph_BP_Shard_ArmRing::CallFunc_Lerp_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Shard_ArmRing_C_ExecuteUbergraph_BP_Shard_ArmRing, CallFunc_Lerp_ReturnValue_4) == 0x000028, "Member 'BP_Shard_ArmRing_C_ExecuteUbergraph_BP_Shard_ArmRing::CallFunc_Lerp_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Shard_ArmRing_C_ExecuteUbergraph_BP_Shard_ArmRing, CallFunc_Lerp_ReturnValue_5) == 0x000030, "Member 'BP_Shard_ArmRing_C_ExecuteUbergraph_BP_Shard_ArmRing::CallFunc_Lerp_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_Shard_ArmRing_C_ExecuteUbergraph_BP_Shard_ArmRing, K2Node_Event_DeltaSeconds) == 0x000038, "Member 'BP_Shard_ArmRing_C_ExecuteUbergraph_BP_Shard_ArmRing::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_Shard_ArmRing_C_ExecuteUbergraph_BP_Shard_ArmRing, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000040, "Member 'BP_Shard_ArmRing_C_ExecuteUbergraph_BP_Shard_ArmRing::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Shard_ArmRing_C_ExecuteUbergraph_BP_Shard_ArmRing, CallFunc_RandomFloatInRange_ReturnValue) == 0x000048, "Member 'BP_Shard_ArmRing_C_ExecuteUbergraph_BP_Shard_ArmRing::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Shard_ArmRing_C_ExecuteUbergraph_BP_Shard_ArmRing, CallFunc_Lerp_ReturnValue_6) == 0x000050, "Member 'BP_Shard_ArmRing_C_ExecuteUbergraph_BP_Shard_ArmRing::CallFunc_Lerp_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_Shard_ArmRing_C_ExecuteUbergraph_BP_Shard_ArmRing, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000058, "Member 'BP_Shard_ArmRing_C_ExecuteUbergraph_BP_Shard_ArmRing::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Shard_ArmRing_C_ExecuteUbergraph_BP_Shard_ArmRing, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000060, "Member 'BP_Shard_ArmRing_C_ExecuteUbergraph_BP_Shard_ArmRing::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Shard_ArmRing_C_ExecuteUbergraph_BP_Shard_ArmRing, CallFunc_Multiply_DoubleDouble_ReturnValue_2) == 0x000068, "Member 'BP_Shard_ArmRing_C_ExecuteUbergraph_BP_Shard_ArmRing::CallFunc_Multiply_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Shard_ArmRing_C_ExecuteUbergraph_BP_Shard_ArmRing, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x000070, "Member 'BP_Shard_ArmRing_C_ExecuteUbergraph_BP_Shard_ArmRing::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Shard_ArmRing_C_ExecuteUbergraph_BP_Shard_ArmRing, CallFunc_RandomFloatInRange_ReturnValue_2) == 0x000078, "Member 'BP_Shard_ArmRing_C_ExecuteUbergraph_BP_Shard_ArmRing::CallFunc_RandomFloatInRange_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Shard_ArmRing_C_ExecuteUbergraph_BP_Shard_ArmRing, CallFunc_Lerp_ReturnValue_7) == 0x000080, "Member 'BP_Shard_ArmRing_C_ExecuteUbergraph_BP_Shard_ArmRing::CallFunc_Lerp_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_Shard_ArmRing_C_ExecuteUbergraph_BP_Shard_ArmRing, CallFunc_Lerp_ReturnValue_8) == 0x000088, "Member 'BP_Shard_ArmRing_C_ExecuteUbergraph_BP_Shard_ArmRing::CallFunc_Lerp_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_Shard_ArmRing_C_ExecuteUbergraph_BP_Shard_ArmRing, CallFunc_MakeVector_ReturnValue) == 0x000090, "Member 'BP_Shard_ArmRing_C_ExecuteUbergraph_BP_Shard_ArmRing::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Shard_ArmRing_C_ExecuteUbergraph_BP_Shard_ArmRing, CallFunc_Add_VectorVector_ReturnValue) == 0x0000A8, "Member 'BP_Shard_ArmRing_C_ExecuteUbergraph_BP_Shard_ArmRing::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Shard_ArmRing_C_ExecuteUbergraph_BP_Shard_ArmRing, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x0000C0, "Member 'BP_Shard_ArmRing_C_ExecuteUbergraph_BP_Shard_ArmRing::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_Shard_ArmRing_C_ExecuteUbergraph_BP_Shard_ArmRing, CallFunc_Lerp_Alpha_ImplicitCast) == 0x0001B8, "Member 'BP_Shard_ArmRing_C_ExecuteUbergraph_BP_Shard_ArmRing::CallFunc_Lerp_Alpha_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Shard_ArmRing_C_ExecuteUbergraph_BP_Shard_ArmRing, CallFunc_Lerp_Alpha_ImplicitCast_1) == 0x0001C0, "Member 'BP_Shard_ArmRing_C_ExecuteUbergraph_BP_Shard_ArmRing::CallFunc_Lerp_Alpha_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_Shard_ArmRing_C_ExecuteUbergraph_BP_Shard_ArmRing, CallFunc_Lerp_Alpha_ImplicitCast_2) == 0x0001C8, "Member 'BP_Shard_ArmRing_C_ExecuteUbergraph_BP_Shard_ArmRing::CallFunc_Lerp_Alpha_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(BP_Shard_ArmRing_C_ExecuteUbergraph_BP_Shard_ArmRing, CallFunc_Lerp_Alpha_ImplicitCast_3) == 0x0001D0, "Member 'BP_Shard_ArmRing_C_ExecuteUbergraph_BP_Shard_ArmRing::CallFunc_Lerp_Alpha_ImplicitCast_3' has a wrong offset!");
static_assert(offsetof(BP_Shard_ArmRing_C_ExecuteUbergraph_BP_Shard_ArmRing, CallFunc_Lerp_Alpha_ImplicitCast_4) == 0x0001D8, "Member 'BP_Shard_ArmRing_C_ExecuteUbergraph_BP_Shard_ArmRing::CallFunc_Lerp_Alpha_ImplicitCast_4' has a wrong offset!");
static_assert(offsetof(BP_Shard_ArmRing_C_ExecuteUbergraph_BP_Shard_ArmRing, CallFunc_Lerp_Alpha_ImplicitCast_5) == 0x0001E0, "Member 'BP_Shard_ArmRing_C_ExecuteUbergraph_BP_Shard_ArmRing::CallFunc_Lerp_Alpha_ImplicitCast_5' has a wrong offset!");
static_assert(offsetof(BP_Shard_ArmRing_C_ExecuteUbergraph_BP_Shard_ArmRing, CallFunc_Lerp_Alpha_ImplicitCast_6) == 0x0001E8, "Member 'BP_Shard_ArmRing_C_ExecuteUbergraph_BP_Shard_ArmRing::CallFunc_Lerp_Alpha_ImplicitCast_6' has a wrong offset!");
static_assert(offsetof(BP_Shard_ArmRing_C_ExecuteUbergraph_BP_Shard_ArmRing, CallFunc_Lerp_Alpha_ImplicitCast_7) == 0x0001F0, "Member 'BP_Shard_ArmRing_C_ExecuteUbergraph_BP_Shard_ArmRing::CallFunc_Lerp_Alpha_ImplicitCast_7' has a wrong offset!");
static_assert(offsetof(BP_Shard_ArmRing_C_ExecuteUbergraph_BP_Shard_ArmRing, CallFunc_Lerp_Alpha_ImplicitCast_8) == 0x0001F8, "Member 'BP_Shard_ArmRing_C_ExecuteUbergraph_BP_Shard_ArmRing::CallFunc_Lerp_Alpha_ImplicitCast_8' has a wrong offset!");
static_assert(offsetof(BP_Shard_ArmRing_C_ExecuteUbergraph_BP_Shard_ArmRing, CallFunc_SetFloatParameter_Param_ImplicitCast) == 0x000200, "Member 'BP_Shard_ArmRing_C_ExecuteUbergraph_BP_Shard_ArmRing::CallFunc_SetFloatParameter_Param_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Shard_ArmRing_C_ExecuteUbergraph_BP_Shard_ArmRing, CallFunc_SetScalarParameterValueOnMaterials_ParameterValue_ImplicitCast) == 0x000204, "Member 'BP_Shard_ArmRing_C_ExecuteUbergraph_BP_Shard_ArmRing::CallFunc_SetScalarParameterValueOnMaterials_ParameterValue_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Shard_ArmRing_C_ExecuteUbergraph_BP_Shard_ArmRing, CallFunc_SetFloatParameter_Param_ImplicitCast_1) == 0x000208, "Member 'BP_Shard_ArmRing_C_ExecuteUbergraph_BP_Shard_ArmRing::CallFunc_SetFloatParameter_Param_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_Shard_ArmRing_C_ExecuteUbergraph_BP_Shard_ArmRing, CallFunc_SetFloatParameter_Param_ImplicitCast_2) == 0x00020C, "Member 'BP_Shard_ArmRing_C_ExecuteUbergraph_BP_Shard_ArmRing::CallFunc_SetFloatParameter_Param_ImplicitCast_2' has a wrong offset!");

// Function BP_Shard_ArmRing.BP_Shard_ArmRing_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_Shard_ArmRing_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Shard_ArmRing_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_Shard_ArmRing_C_ReceiveTick");
static_assert(sizeof(BP_Shard_ArmRing_C_ReceiveTick) == 0x000004, "Wrong size on BP_Shard_ArmRing_C_ReceiveTick");
static_assert(offsetof(BP_Shard_ArmRing_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_Shard_ArmRing_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_Shard_ArmRing.BP_Shard_ArmRing_C.UserConstructionScript
// 0x0018 (0x0018 - 0x0000)
struct BP_Shard_ArmRing_C_UserConstructionScript final
{
public:
	struct FVector                                CallFunc_Conv_LinearColorToVector_ReturnValue;     // 0x0000(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Shard_ArmRing_C_UserConstructionScript) == 0x000008, "Wrong alignment on BP_Shard_ArmRing_C_UserConstructionScript");
static_assert(sizeof(BP_Shard_ArmRing_C_UserConstructionScript) == 0x000018, "Wrong size on BP_Shard_ArmRing_C_UserConstructionScript");
static_assert(offsetof(BP_Shard_ArmRing_C_UserConstructionScript, CallFunc_Conv_LinearColorToVector_ReturnValue) == 0x000000, "Member 'BP_Shard_ArmRing_C_UserConstructionScript::CallFunc_Conv_LinearColorToVector_ReturnValue' has a wrong offset!");

}

