#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SerializableActorComponent

#include "Basic.hpp"

#include "SandFall_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_SerializableActorComponent.BP_SerializableActorComponent_C
// 0x0010 (0x00B0 - 0x00A0)
class UBP_SerializableActorComponent_C : public UExtendedActorComponent
{
public:
	class FName                                   GlobalObjectID;                                    // 0x00A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	int32                                         GeneratedVersion;                                  // 0x00A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CURRENT_VERSION;                                   // 0x00AC(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	bool CheckForErrors(TArray<class FText>& ErrorMessages);
	void CheckGlobalObjectIDValidity();
	void ForceGlobalObjectID(class FName ObjectId);
	void GenerateGlobalObjectID(const class FString& OptionalPrefix, bool ForceGeneration);
	void GenerateNewGUID(const class FString& OptionalPrefix, class FName* Guid);
	void GetGlobalObjectID(class FName* ObjectId);
	void IsGlobalObjectIDValid(bool* IsValid);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_SerializableActorComponent_C">();
	}
	static class UBP_SerializableActorComponent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_SerializableActorComponent_C>();
	}
};
static_assert(alignof(UBP_SerializableActorComponent_C) == 0x000008, "Wrong alignment on UBP_SerializableActorComponent_C");
static_assert(sizeof(UBP_SerializableActorComponent_C) == 0x0000B0, "Wrong size on UBP_SerializableActorComponent_C");
static_assert(offsetof(UBP_SerializableActorComponent_C, GlobalObjectID) == 0x0000A0, "Member 'UBP_SerializableActorComponent_C::GlobalObjectID' has a wrong offset!");
static_assert(offsetof(UBP_SerializableActorComponent_C, GeneratedVersion) == 0x0000A8, "Member 'UBP_SerializableActorComponent_C::GeneratedVersion' has a wrong offset!");
static_assert(offsetof(UBP_SerializableActorComponent_C, CURRENT_VERSION) == 0x0000AC, "Member 'UBP_SerializableActorComponent_C::CURRENT_VERSION' has a wrong offset!");

}

