#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SkillDataComponent_OverchargeOnBuff

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_SkillDataComponent_OverchargeOnBuff.BP_SkillDataComponent_OverchargeOnBuff_C.CheckCharacterHasAnyBuffs
// 0x0068 (0x0068 - 0x0000)
struct BP_SkillDataComponent_OverchargeOnBuff_C_CheckCharacterHasAnyBuffs final
{
public:
	class UAC_jRPG_CharacterBattleStats_C*        CharacterStats;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<TSoftClassPtr<class UClass>>           Buffs;                                             // 0x0008(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_BattleBuffInstanceWrapper_C*        CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   CallFunc_Conv_ClassToSoftClassReference_ReturnValue; // 0x0038(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62[0x2];                                       // 0x0062(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SkillDataComponent_OverchargeOnBuff_C_CheckCharacterHasAnyBuffs) == 0x000008, "Wrong alignment on BP_SkillDataComponent_OverchargeOnBuff_C_CheckCharacterHasAnyBuffs");
static_assert(sizeof(BP_SkillDataComponent_OverchargeOnBuff_C_CheckCharacterHasAnyBuffs) == 0x000068, "Wrong size on BP_SkillDataComponent_OverchargeOnBuff_C_CheckCharacterHasAnyBuffs");
static_assert(offsetof(BP_SkillDataComponent_OverchargeOnBuff_C_CheckCharacterHasAnyBuffs, CharacterStats) == 0x000000, "Member 'BP_SkillDataComponent_OverchargeOnBuff_C_CheckCharacterHasAnyBuffs::CharacterStats' has a wrong offset!");
static_assert(offsetof(BP_SkillDataComponent_OverchargeOnBuff_C_CheckCharacterHasAnyBuffs, Buffs) == 0x000008, "Member 'BP_SkillDataComponent_OverchargeOnBuff_C_CheckCharacterHasAnyBuffs::Buffs' has a wrong offset!");
static_assert(offsetof(BP_SkillDataComponent_OverchargeOnBuff_C_CheckCharacterHasAnyBuffs, ReturnValue) == 0x000018, "Member 'BP_SkillDataComponent_OverchargeOnBuff_C_CheckCharacterHasAnyBuffs::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillDataComponent_OverchargeOnBuff_C_CheckCharacterHasAnyBuffs, Temp_int_Array_Index_Variable) == 0x00001C, "Member 'BP_SkillDataComponent_OverchargeOnBuff_C_CheckCharacterHasAnyBuffs::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_SkillDataComponent_OverchargeOnBuff_C_CheckCharacterHasAnyBuffs, CallFunc_Array_Get_Item) == 0x000020, "Member 'BP_SkillDataComponent_OverchargeOnBuff_C_CheckCharacterHasAnyBuffs::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_SkillDataComponent_OverchargeOnBuff_C_CheckCharacterHasAnyBuffs, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'BP_SkillDataComponent_OverchargeOnBuff_C_CheckCharacterHasAnyBuffs::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillDataComponent_OverchargeOnBuff_C_CheckCharacterHasAnyBuffs, Temp_int_Loop_Counter_Variable) == 0x00002C, "Member 'BP_SkillDataComponent_OverchargeOnBuff_C_CheckCharacterHasAnyBuffs::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_SkillDataComponent_OverchargeOnBuff_C_CheckCharacterHasAnyBuffs, CallFunc_GetObjectClass_ReturnValue) == 0x000030, "Member 'BP_SkillDataComponent_OverchargeOnBuff_C_CheckCharacterHasAnyBuffs::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillDataComponent_OverchargeOnBuff_C_CheckCharacterHasAnyBuffs, CallFunc_Conv_ClassToSoftClassReference_ReturnValue) == 0x000038, "Member 'BP_SkillDataComponent_OverchargeOnBuff_C_CheckCharacterHasAnyBuffs::CallFunc_Conv_ClassToSoftClassReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillDataComponent_OverchargeOnBuff_C_CheckCharacterHasAnyBuffs, CallFunc_Less_IntInt_ReturnValue) == 0x000060, "Member 'BP_SkillDataComponent_OverchargeOnBuff_C_CheckCharacterHasAnyBuffs::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillDataComponent_OverchargeOnBuff_C_CheckCharacterHasAnyBuffs, CallFunc_Array_Contains_ReturnValue) == 0x000061, "Member 'BP_SkillDataComponent_OverchargeOnBuff_C_CheckCharacterHasAnyBuffs::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillDataComponent_OverchargeOnBuff_C_CheckCharacterHasAnyBuffs, CallFunc_Add_IntInt_ReturnValue) == 0x000064, "Member 'BP_SkillDataComponent_OverchargeOnBuff_C_CheckCharacterHasAnyBuffs::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function BP_SkillDataComponent_OverchargeOnBuff.BP_SkillDataComponent_OverchargeOnBuff_C.IsOverchargeActive
// 0x0038 (0x0038 - 0x0000)
struct BP_SkillDataComponent_OverchargeOnBuff_C_IsOverchargeActive final
{
public:
	class UAC_jRPG_CharacterBattleStats_C*        CharacterStat;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Active;                                            // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAC_jRPG_TargetingManager_C*            CallFunc_GetTargetingManager_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_jRPG_Character_Battle_Base_C*       CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckCharacterHasAnyBuffs_ReturnValue;    // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsEmpty_ReturnValue;                // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckCharacterHasAnyBuffs_ReturnValue_1;  // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SkillDataComponent_OverchargeOnBuff_C_IsOverchargeActive) == 0x000008, "Wrong alignment on BP_SkillDataComponent_OverchargeOnBuff_C_IsOverchargeActive");
static_assert(sizeof(BP_SkillDataComponent_OverchargeOnBuff_C_IsOverchargeActive) == 0x000038, "Wrong size on BP_SkillDataComponent_OverchargeOnBuff_C_IsOverchargeActive");
static_assert(offsetof(BP_SkillDataComponent_OverchargeOnBuff_C_IsOverchargeActive, CharacterStat) == 0x000000, "Member 'BP_SkillDataComponent_OverchargeOnBuff_C_IsOverchargeActive::CharacterStat' has a wrong offset!");
static_assert(offsetof(BP_SkillDataComponent_OverchargeOnBuff_C_IsOverchargeActive, Active) == 0x000008, "Member 'BP_SkillDataComponent_OverchargeOnBuff_C_IsOverchargeActive::Active' has a wrong offset!");
static_assert(offsetof(BP_SkillDataComponent_OverchargeOnBuff_C_IsOverchargeActive, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'BP_SkillDataComponent_OverchargeOnBuff_C_IsOverchargeActive::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_SkillDataComponent_OverchargeOnBuff_C_IsOverchargeActive, CallFunc_GetTargetingManager_ReturnValue) == 0x000010, "Member 'BP_SkillDataComponent_OverchargeOnBuff_C_IsOverchargeActive::CallFunc_GetTargetingManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillDataComponent_OverchargeOnBuff_C_IsOverchargeActive, Temp_int_Loop_Counter_Variable) == 0x000018, "Member 'BP_SkillDataComponent_OverchargeOnBuff_C_IsOverchargeActive::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_SkillDataComponent_OverchargeOnBuff_C_IsOverchargeActive, CallFunc_Array_Get_Item) == 0x000020, "Member 'BP_SkillDataComponent_OverchargeOnBuff_C_IsOverchargeActive::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_SkillDataComponent_OverchargeOnBuff_C_IsOverchargeActive, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'BP_SkillDataComponent_OverchargeOnBuff_C_IsOverchargeActive::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillDataComponent_OverchargeOnBuff_C_IsOverchargeActive, CallFunc_Array_Length_ReturnValue) == 0x00002C, "Member 'BP_SkillDataComponent_OverchargeOnBuff_C_IsOverchargeActive::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillDataComponent_OverchargeOnBuff_C_IsOverchargeActive, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'BP_SkillDataComponent_OverchargeOnBuff_C_IsOverchargeActive::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillDataComponent_OverchargeOnBuff_C_IsOverchargeActive, CallFunc_CheckCharacterHasAnyBuffs_ReturnValue) == 0x000031, "Member 'BP_SkillDataComponent_OverchargeOnBuff_C_IsOverchargeActive::CallFunc_CheckCharacterHasAnyBuffs_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillDataComponent_OverchargeOnBuff_C_IsOverchargeActive, CallFunc_Array_IsEmpty_ReturnValue) == 0x000032, "Member 'BP_SkillDataComponent_OverchargeOnBuff_C_IsOverchargeActive::CallFunc_Array_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillDataComponent_OverchargeOnBuff_C_IsOverchargeActive, CallFunc_CheckCharacterHasAnyBuffs_ReturnValue_1) == 0x000033, "Member 'BP_SkillDataComponent_OverchargeOnBuff_C_IsOverchargeActive::CallFunc_CheckCharacterHasAnyBuffs_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SkillDataComponent_OverchargeOnBuff_C_IsOverchargeActive, CallFunc_BooleanOR_ReturnValue) == 0x000034, "Member 'BP_SkillDataComponent_OverchargeOnBuff_C_IsOverchargeActive::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

}

