#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SkillComponentScript_StanceMechanic

#include "Basic.hpp"

#include "E_StanceType_structs.hpp"


namespace SDK::Params
{

// Function BP_SkillComponentScript_StanceMechanic.BP_SkillComponentScript_StanceMechanic_C.GetNextSkillStance
// 0x0001 (0x0001 - 0x0000)
struct BP_SkillComponentScript_StanceMechanic_C_GetNextSkillStance final
{
public:
	E_StanceType                                  NextSkillStance_0;                                 // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SkillComponentScript_StanceMechanic_C_GetNextSkillStance) == 0x000001, "Wrong alignment on BP_SkillComponentScript_StanceMechanic_C_GetNextSkillStance");
static_assert(sizeof(BP_SkillComponentScript_StanceMechanic_C_GetNextSkillStance) == 0x000001, "Wrong size on BP_SkillComponentScript_StanceMechanic_C_GetNextSkillStance");
static_assert(offsetof(BP_SkillComponentScript_StanceMechanic_C_GetNextSkillStance, NextSkillStance_0) == 0x000000, "Member 'BP_SkillComponentScript_StanceMechanic_C_GetNextSkillStance::NextSkillStance_0' has a wrong offset!");

// Function BP_SkillComponentScript_StanceMechanic.BP_SkillComponentScript_StanceMechanic_C.UpdateState
// 0x0018 (0x0018 - 0x0000)
struct BP_SkillComponentScript_StanceMechanic_C_UpdateState final
{
public:
	TScriptInterface<class IBPI_StanceMechanicSkill_C> K2Node_DynamicCast_AsBPI_Stance_Mechanic_Skill; // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BPI_GetNextStance_IsDefined;              // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_StanceType                                  CallFunc_BPI_GetNextStance_DesiredStance;          // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SkillComponentScript_StanceMechanic_C_UpdateState) == 0x000008, "Wrong alignment on BP_SkillComponentScript_StanceMechanic_C_UpdateState");
static_assert(sizeof(BP_SkillComponentScript_StanceMechanic_C_UpdateState) == 0x000018, "Wrong size on BP_SkillComponentScript_StanceMechanic_C_UpdateState");
static_assert(offsetof(BP_SkillComponentScript_StanceMechanic_C_UpdateState, K2Node_DynamicCast_AsBPI_Stance_Mechanic_Skill) == 0x000000, "Member 'BP_SkillComponentScript_StanceMechanic_C_UpdateState::K2Node_DynamicCast_AsBPI_Stance_Mechanic_Skill' has a wrong offset!");
static_assert(offsetof(BP_SkillComponentScript_StanceMechanic_C_UpdateState, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'BP_SkillComponentScript_StanceMechanic_C_UpdateState::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_SkillComponentScript_StanceMechanic_C_UpdateState, CallFunc_BPI_GetNextStance_IsDefined) == 0x000011, "Member 'BP_SkillComponentScript_StanceMechanic_C_UpdateState::CallFunc_BPI_GetNextStance_IsDefined' has a wrong offset!");
static_assert(offsetof(BP_SkillComponentScript_StanceMechanic_C_UpdateState, CallFunc_BPI_GetNextStance_DesiredStance) == 0x000012, "Member 'BP_SkillComponentScript_StanceMechanic_C_UpdateState::CallFunc_BPI_GetNextStance_DesiredStance' has a wrong offset!");

}

