#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SaveGameObjectUpgrader

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_SaveGameObjectUpgrader.BP_SaveGameObjectUpgrader_C.ProcessUpgradeSaveGameObject
// 0x0010 (0x0010 - 0x0000)
struct BP_SaveGameObjectUpgrader_C_ProcessUpgradeSaveGameObject final
{
public:
	class UBP_SaveGameBase_C*                     FromSaveGameObject;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_SaveGameBase_C*                     ToSaveGameObject;                                  // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SaveGameObjectUpgrader_C_ProcessUpgradeSaveGameObject) == 0x000008, "Wrong alignment on BP_SaveGameObjectUpgrader_C_ProcessUpgradeSaveGameObject");
static_assert(sizeof(BP_SaveGameObjectUpgrader_C_ProcessUpgradeSaveGameObject) == 0x000010, "Wrong size on BP_SaveGameObjectUpgrader_C_ProcessUpgradeSaveGameObject");
static_assert(offsetof(BP_SaveGameObjectUpgrader_C_ProcessUpgradeSaveGameObject, FromSaveGameObject) == 0x000000, "Member 'BP_SaveGameObjectUpgrader_C_ProcessUpgradeSaveGameObject::FromSaveGameObject' has a wrong offset!");
static_assert(offsetof(BP_SaveGameObjectUpgrader_C_ProcessUpgradeSaveGameObject, ToSaveGameObject) == 0x000008, "Member 'BP_SaveGameObjectUpgrader_C_ProcessUpgradeSaveGameObject::ToSaveGameObject' has a wrong offset!");

// Function BP_SaveGameObjectUpgrader.BP_SaveGameObjectUpgrader_C.ValidateParameters
// 0x0110 (0x0110 - 0x0000)
struct BP_SaveGameObjectUpgrader_C_ValidateParameters final
{
public:
	class UBP_SaveGameBase_C*                     SaveObject;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          IsValid;                                           // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetClassDisplayName_ReturnValue;          // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue;        // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0030(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0040(0x0048)(HasGetValueTypeHash)
	class FString                                 CallFunc_GetClassDisplayName_ReturnValue_1;        // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0098(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00A8(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00F0(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Format_ReturnValue;                       // 0x0100(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SaveGameObjectUpgrader_C_ValidateParameters) == 0x000008, "Wrong alignment on BP_SaveGameObjectUpgrader_C_ValidateParameters");
static_assert(sizeof(BP_SaveGameObjectUpgrader_C_ValidateParameters) == 0x000110, "Wrong size on BP_SaveGameObjectUpgrader_C_ValidateParameters");
static_assert(offsetof(BP_SaveGameObjectUpgrader_C_ValidateParameters, SaveObject) == 0x000000, "Member 'BP_SaveGameObjectUpgrader_C_ValidateParameters::SaveObject' has a wrong offset!");
static_assert(offsetof(BP_SaveGameObjectUpgrader_C_ValidateParameters, IsValid) == 0x000008, "Member 'BP_SaveGameObjectUpgrader_C_ValidateParameters::IsValid' has a wrong offset!");
static_assert(offsetof(BP_SaveGameObjectUpgrader_C_ValidateParameters, CallFunc_GetObjectClass_ReturnValue) == 0x000010, "Member 'BP_SaveGameObjectUpgrader_C_ValidateParameters::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SaveGameObjectUpgrader_C_ValidateParameters, CallFunc_GetClassDisplayName_ReturnValue) == 0x000018, "Member 'BP_SaveGameObjectUpgrader_C_ValidateParameters::CallFunc_GetClassDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SaveGameObjectUpgrader_C_ValidateParameters, CallFunc_EqualEqual_ClassClass_ReturnValue) == 0x000028, "Member 'BP_SaveGameObjectUpgrader_C_ValidateParameters::CallFunc_EqualEqual_ClassClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SaveGameObjectUpgrader_C_ValidateParameters, CallFunc_Conv_StringToText_ReturnValue) == 0x000030, "Member 'BP_SaveGameObjectUpgrader_C_ValidateParameters::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SaveGameObjectUpgrader_C_ValidateParameters, K2Node_MakeStruct_FormatArgumentData) == 0x000040, "Member 'BP_SaveGameObjectUpgrader_C_ValidateParameters::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_SaveGameObjectUpgrader_C_ValidateParameters, CallFunc_GetClassDisplayName_ReturnValue_1) == 0x000088, "Member 'BP_SaveGameObjectUpgrader_C_ValidateParameters::CallFunc_GetClassDisplayName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SaveGameObjectUpgrader_C_ValidateParameters, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000098, "Member 'BP_SaveGameObjectUpgrader_C_ValidateParameters::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SaveGameObjectUpgrader_C_ValidateParameters, K2Node_MakeStruct_FormatArgumentData_1) == 0x0000A8, "Member 'BP_SaveGameObjectUpgrader_C_ValidateParameters::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BP_SaveGameObjectUpgrader_C_ValidateParameters, K2Node_MakeArray_Array) == 0x0000F0, "Member 'BP_SaveGameObjectUpgrader_C_ValidateParameters::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_SaveGameObjectUpgrader_C_ValidateParameters, CallFunc_Format_ReturnValue) == 0x000100, "Member 'BP_SaveGameObjectUpgrader_C_ValidateParameters::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function BP_SaveGameObjectUpgrader.BP_SaveGameObjectUpgrader_C.UpgradeSaveGameObject
// 0x0118 (0x0118 - 0x0000)
struct BP_SaveGameObjectUpgrader_C_UpgradeSaveGameObject final
{
public:
	class UBP_SaveGameBase_C*                     FromSaveGameObject;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_SaveGameBase_C*                     ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash)
	class UBP_SaveGameBase_C*                     local_ToSaveGameObject;                            // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ValidateParameters_IsValid;               // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetClassDisplayName_ReturnValue;          // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0030(0x0010)()
	class FString                                 CallFunc_GetClassDisplayName_ReturnValue_1;        // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0050(0x0048)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0098(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00A8(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00F0(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Format_ReturnValue;                       // 0x0100(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UBP_SaveGameBase_C*                     CallFunc_SpawnObject_ReturnValue;                  // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SaveGameObjectUpgrader_C_UpgradeSaveGameObject) == 0x000008, "Wrong alignment on BP_SaveGameObjectUpgrader_C_UpgradeSaveGameObject");
static_assert(sizeof(BP_SaveGameObjectUpgrader_C_UpgradeSaveGameObject) == 0x000118, "Wrong size on BP_SaveGameObjectUpgrader_C_UpgradeSaveGameObject");
static_assert(offsetof(BP_SaveGameObjectUpgrader_C_UpgradeSaveGameObject, FromSaveGameObject) == 0x000000, "Member 'BP_SaveGameObjectUpgrader_C_UpgradeSaveGameObject::FromSaveGameObject' has a wrong offset!");
static_assert(offsetof(BP_SaveGameObjectUpgrader_C_UpgradeSaveGameObject, ReturnValue) == 0x000008, "Member 'BP_SaveGameObjectUpgrader_C_UpgradeSaveGameObject::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SaveGameObjectUpgrader_C_UpgradeSaveGameObject, local_ToSaveGameObject) == 0x000010, "Member 'BP_SaveGameObjectUpgrader_C_UpgradeSaveGameObject::local_ToSaveGameObject' has a wrong offset!");
static_assert(offsetof(BP_SaveGameObjectUpgrader_C_UpgradeSaveGameObject, CallFunc_ValidateParameters_IsValid) == 0x000018, "Member 'BP_SaveGameObjectUpgrader_C_UpgradeSaveGameObject::CallFunc_ValidateParameters_IsValid' has a wrong offset!");
static_assert(offsetof(BP_SaveGameObjectUpgrader_C_UpgradeSaveGameObject, CallFunc_GetClassDisplayName_ReturnValue) == 0x000020, "Member 'BP_SaveGameObjectUpgrader_C_UpgradeSaveGameObject::CallFunc_GetClassDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SaveGameObjectUpgrader_C_UpgradeSaveGameObject, CallFunc_Conv_StringToText_ReturnValue) == 0x000030, "Member 'BP_SaveGameObjectUpgrader_C_UpgradeSaveGameObject::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SaveGameObjectUpgrader_C_UpgradeSaveGameObject, CallFunc_GetClassDisplayName_ReturnValue_1) == 0x000040, "Member 'BP_SaveGameObjectUpgrader_C_UpgradeSaveGameObject::CallFunc_GetClassDisplayName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SaveGameObjectUpgrader_C_UpgradeSaveGameObject, K2Node_MakeStruct_FormatArgumentData) == 0x000050, "Member 'BP_SaveGameObjectUpgrader_C_UpgradeSaveGameObject::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_SaveGameObjectUpgrader_C_UpgradeSaveGameObject, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000098, "Member 'BP_SaveGameObjectUpgrader_C_UpgradeSaveGameObject::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SaveGameObjectUpgrader_C_UpgradeSaveGameObject, K2Node_MakeStruct_FormatArgumentData_1) == 0x0000A8, "Member 'BP_SaveGameObjectUpgrader_C_UpgradeSaveGameObject::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BP_SaveGameObjectUpgrader_C_UpgradeSaveGameObject, K2Node_MakeArray_Array) == 0x0000F0, "Member 'BP_SaveGameObjectUpgrader_C_UpgradeSaveGameObject::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_SaveGameObjectUpgrader_C_UpgradeSaveGameObject, CallFunc_Format_ReturnValue) == 0x000100, "Member 'BP_SaveGameObjectUpgrader_C_UpgradeSaveGameObject::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SaveGameObjectUpgrader_C_UpgradeSaveGameObject, CallFunc_SpawnObject_ReturnValue) == 0x000110, "Member 'BP_SaveGameObjectUpgrader_C_UpgradeSaveGameObject::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");

}

