#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SkillDataComponentScript

#include "Basic.hpp"

#include "SandFall_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_SkillDataComponentScript.BP_SkillDataComponentScript_C
// 0x0018 (0x0040 - 0x0028)
class UBP_SkillDataComponentScript_C : public UExtendedObject
{
public:
	class UBP_SkillDataComponent_Base_C*          SkillComponent;                                    // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UAC_jRPG_CharacterBattleStats_C*        OwnerCharacterStats;                               // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UBP_SkillState_C*                       OwningSkillState;                                  // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteBattleStartEvent(class UBP_DependencyRefCounter_C* Dependencies, bool ForceInstant);
	bool HasTurnStartEvent();
	void Init(class UBP_SkillDataComponent_Base_C* SkillComponent_0);
	void OnBattleStart();
	void UpdateState();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_SkillDataComponentScript_C">();
	}
	static class UBP_SkillDataComponentScript_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_SkillDataComponentScript_C>();
	}
};
static_assert(alignof(UBP_SkillDataComponentScript_C) == 0x000008, "Wrong alignment on UBP_SkillDataComponentScript_C");
static_assert(sizeof(UBP_SkillDataComponentScript_C) == 0x000040, "Wrong size on UBP_SkillDataComponentScript_C");
static_assert(offsetof(UBP_SkillDataComponentScript_C, SkillComponent) == 0x000028, "Member 'UBP_SkillDataComponentScript_C::SkillComponent' has a wrong offset!");
static_assert(offsetof(UBP_SkillDataComponentScript_C, OwnerCharacterStats) == 0x000030, "Member 'UBP_SkillDataComponentScript_C::OwnerCharacterStats' has a wrong offset!");
static_assert(offsetof(UBP_SkillDataComponentScript_C, OwningSkillState) == 0x000038, "Member 'UBP_SkillDataComponentScript_C::OwningSkillState' has a wrong offset!");

}

