#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SpermWhale

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_SpermWhale.BP_SpermWhale_C
// 0x01D8 (0x0468 - 0x0290)
class ABP_SpermWhale_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USkeletalMeshComponent*                 SpermWhale;                                        // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        Whale_Sounds;                                      // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Whale_Transform;                                   // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Sphere_Front;                                      // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       LookAt_Front;                                      // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USplineComponent*                       Spline;                                            // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Speed_Variations__Direction_A107591E4103CC7B61CE25AB0ED255A5; // 0x02D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D1[0x7];                                      // 0x02D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Speed_Variations;                                  // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        Distance;                                          // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Lookat_Front_CurrentDistance;                      // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Lookat_Front_Offset;                               // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShowLookatSpheres;                                 // 0x02F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F9[0x7];                                      // 0x02F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        MovementSpeed_Spline;                              // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        AnimPlayRate_Min;                                  // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DynamicSpeed_SpeedingUp_;                          // 0x0310(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_311[0x7];                                      // 0x0311(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        DynamicSpeed_Desired_Speed;                        // 0x0318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Desired_BlendSpace;                                // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DynamicAnim_Fast_Length;                           // 0x0328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DynamicAnim_Time_Randomness;                       // 0x0330(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DynamicAnim_Slow_Length;                           // 0x0338(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Dynamic_Speed;                                     // 0x0340(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_341[0x7];                                      // 0x0341(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        AnimPlayRate_Max;                                  // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DynamicSpeed_Speed;                                // 0x0350(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DynamicSpeed_Acceleration;                         // 0x0358(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        BlendSpace;                                        // 0x0360(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DynamicSpeed_Deceleration;                         // 0x0368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MovementSpeed_Min;                                 // 0x0370(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MovementSpeed_Max;                                 // 0x0378(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        BlendSpace_Acceleration;                           // 0x0380(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        BlendSpace_Decelaration;                           // 0x0388(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Non_Dynamic_AnimPlayRate;                          // 0x0390(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Non_Dynamic_MovementSpeed;                         // 0x0398(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Non_Dynamic_Anim_Intensity;                        // 0x03A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Pitch;                                             // 0x03A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        TurningAngle;                                      // 0x03B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Roll_Rotation_Intensity;                           // 0x03B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	double                                        Roll_Smoothing_Speed;                              // 0x03C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	double                                        TurningBlendSpaceAngle;                            // 0x03C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Rotation_Smoothing_Speed;                          // 0x03D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Movement_Smoothing_Speed;                          // 0x03D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Mouth_DistanceToOpen;                              // 0x03E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Mouth_OpensNearPlayer;                             // 0x03E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E9[0x7];                                      // 0x03E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Scale_LengthRatio;                                 // 0x03F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Scale;                                             // 0x03F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShowSpline;                                        // 0x0400(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_401[0x7];                                      // 0x0401(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Mouth_Interactive_Variable;                        // 0x0408(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Whale_Noises;                                      // 0x0410(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_411[0x7];                                      // 0x0411(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Mouth_Open_Interactive_Speed;                      // 0x0418(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               DynamicMaterial;                                   // 0x0420(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        MaterialVariation;                                 // 0x0428(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Material;                                          // 0x0430(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          MouthStatic_;                                      // 0x0438(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_439[0x7];                                      // 0x0439(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        MouthStatic_Amount;                                // 0x0440(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimBlueprint_SpermWhale_C*            AnimationBlueprint;                                // 0x0448(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          Dynamic_SideFins_Animation;                        // 0x0450(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_451[0x7];                                      // 0x0451(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        SideFins_Target;                                   // 0x0458(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DistanceForTick;                                   // 0x0460(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Animate_Distance_Variable();
	void Animate_LookAt_Front();
	void Animate_LookAt_Front_Variable();
	void Animate_Mouth_when_Near_Player();
	void Animate_Turning_Blendspace();
	void Animate_Mouth_Intermittently();
	void ExecuteUbergraph_BP_SpermWhale(int32 EntryPoint);
	void Interpolate_Dynamic_Speed_Variables();
	void Interpolate_SideFins_Animation();
	void Play_Dynamic_Animations();
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);
	void Set_Initial_Speed();
	void Set_LookAt_Front_s_initial_Position();
	void Set_Mesh_to_Distance_along_Spline();
	void Set_Meshes_initial_Transform();
	void Speed_Variations__FinishedFunc();
	void Speed_Variations__UpdateFunc();
	void Toggle_LookAt_Spheres();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_SpermWhale_C">();
	}
	static class ABP_SpermWhale_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_SpermWhale_C>();
	}
};
static_assert(alignof(ABP_SpermWhale_C) == 0x000008, "Wrong alignment on ABP_SpermWhale_C");
static_assert(sizeof(ABP_SpermWhale_C) == 0x000468, "Wrong size on ABP_SpermWhale_C");
static_assert(offsetof(ABP_SpermWhale_C, UberGraphFrame) == 0x000290, "Member 'ABP_SpermWhale_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_SpermWhale_C, SpermWhale) == 0x000298, "Member 'ABP_SpermWhale_C::SpermWhale' has a wrong offset!");
static_assert(offsetof(ABP_SpermWhale_C, Whale_Sounds) == 0x0002A0, "Member 'ABP_SpermWhale_C::Whale_Sounds' has a wrong offset!");
static_assert(offsetof(ABP_SpermWhale_C, Whale_Transform) == 0x0002A8, "Member 'ABP_SpermWhale_C::Whale_Transform' has a wrong offset!");
static_assert(offsetof(ABP_SpermWhale_C, Sphere_Front) == 0x0002B0, "Member 'ABP_SpermWhale_C::Sphere_Front' has a wrong offset!");
static_assert(offsetof(ABP_SpermWhale_C, LookAt_Front) == 0x0002B8, "Member 'ABP_SpermWhale_C::LookAt_Front' has a wrong offset!");
static_assert(offsetof(ABP_SpermWhale_C, Spline) == 0x0002C0, "Member 'ABP_SpermWhale_C::Spline' has a wrong offset!");
static_assert(offsetof(ABP_SpermWhale_C, DefaultSceneRoot) == 0x0002C8, "Member 'ABP_SpermWhale_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_SpermWhale_C, Speed_Variations__Direction_A107591E4103CC7B61CE25AB0ED255A5) == 0x0002D0, "Member 'ABP_SpermWhale_C::Speed_Variations__Direction_A107591E4103CC7B61CE25AB0ED255A5' has a wrong offset!");
static_assert(offsetof(ABP_SpermWhale_C, Speed_Variations) == 0x0002D8, "Member 'ABP_SpermWhale_C::Speed_Variations' has a wrong offset!");
static_assert(offsetof(ABP_SpermWhale_C, Distance) == 0x0002E0, "Member 'ABP_SpermWhale_C::Distance' has a wrong offset!");
static_assert(offsetof(ABP_SpermWhale_C, Lookat_Front_CurrentDistance) == 0x0002E8, "Member 'ABP_SpermWhale_C::Lookat_Front_CurrentDistance' has a wrong offset!");
static_assert(offsetof(ABP_SpermWhale_C, Lookat_Front_Offset) == 0x0002F0, "Member 'ABP_SpermWhale_C::Lookat_Front_Offset' has a wrong offset!");
static_assert(offsetof(ABP_SpermWhale_C, ShowLookatSpheres) == 0x0002F8, "Member 'ABP_SpermWhale_C::ShowLookatSpheres' has a wrong offset!");
static_assert(offsetof(ABP_SpermWhale_C, MovementSpeed_Spline) == 0x000300, "Member 'ABP_SpermWhale_C::MovementSpeed_Spline' has a wrong offset!");
static_assert(offsetof(ABP_SpermWhale_C, AnimPlayRate_Min) == 0x000308, "Member 'ABP_SpermWhale_C::AnimPlayRate_Min' has a wrong offset!");
static_assert(offsetof(ABP_SpermWhale_C, DynamicSpeed_SpeedingUp_) == 0x000310, "Member 'ABP_SpermWhale_C::DynamicSpeed_SpeedingUp_' has a wrong offset!");
static_assert(offsetof(ABP_SpermWhale_C, DynamicSpeed_Desired_Speed) == 0x000318, "Member 'ABP_SpermWhale_C::DynamicSpeed_Desired_Speed' has a wrong offset!");
static_assert(offsetof(ABP_SpermWhale_C, Desired_BlendSpace) == 0x000320, "Member 'ABP_SpermWhale_C::Desired_BlendSpace' has a wrong offset!");
static_assert(offsetof(ABP_SpermWhale_C, DynamicAnim_Fast_Length) == 0x000328, "Member 'ABP_SpermWhale_C::DynamicAnim_Fast_Length' has a wrong offset!");
static_assert(offsetof(ABP_SpermWhale_C, DynamicAnim_Time_Randomness) == 0x000330, "Member 'ABP_SpermWhale_C::DynamicAnim_Time_Randomness' has a wrong offset!");
static_assert(offsetof(ABP_SpermWhale_C, DynamicAnim_Slow_Length) == 0x000338, "Member 'ABP_SpermWhale_C::DynamicAnim_Slow_Length' has a wrong offset!");
static_assert(offsetof(ABP_SpermWhale_C, Dynamic_Speed) == 0x000340, "Member 'ABP_SpermWhale_C::Dynamic_Speed' has a wrong offset!");
static_assert(offsetof(ABP_SpermWhale_C, AnimPlayRate_Max) == 0x000348, "Member 'ABP_SpermWhale_C::AnimPlayRate_Max' has a wrong offset!");
static_assert(offsetof(ABP_SpermWhale_C, DynamicSpeed_Speed) == 0x000350, "Member 'ABP_SpermWhale_C::DynamicSpeed_Speed' has a wrong offset!");
static_assert(offsetof(ABP_SpermWhale_C, DynamicSpeed_Acceleration) == 0x000358, "Member 'ABP_SpermWhale_C::DynamicSpeed_Acceleration' has a wrong offset!");
static_assert(offsetof(ABP_SpermWhale_C, BlendSpace) == 0x000360, "Member 'ABP_SpermWhale_C::BlendSpace' has a wrong offset!");
static_assert(offsetof(ABP_SpermWhale_C, DynamicSpeed_Deceleration) == 0x000368, "Member 'ABP_SpermWhale_C::DynamicSpeed_Deceleration' has a wrong offset!");
static_assert(offsetof(ABP_SpermWhale_C, MovementSpeed_Min) == 0x000370, "Member 'ABP_SpermWhale_C::MovementSpeed_Min' has a wrong offset!");
static_assert(offsetof(ABP_SpermWhale_C, MovementSpeed_Max) == 0x000378, "Member 'ABP_SpermWhale_C::MovementSpeed_Max' has a wrong offset!");
static_assert(offsetof(ABP_SpermWhale_C, BlendSpace_Acceleration) == 0x000380, "Member 'ABP_SpermWhale_C::BlendSpace_Acceleration' has a wrong offset!");
static_assert(offsetof(ABP_SpermWhale_C, BlendSpace_Decelaration) == 0x000388, "Member 'ABP_SpermWhale_C::BlendSpace_Decelaration' has a wrong offset!");
static_assert(offsetof(ABP_SpermWhale_C, Non_Dynamic_AnimPlayRate) == 0x000390, "Member 'ABP_SpermWhale_C::Non_Dynamic_AnimPlayRate' has a wrong offset!");
static_assert(offsetof(ABP_SpermWhale_C, Non_Dynamic_MovementSpeed) == 0x000398, "Member 'ABP_SpermWhale_C::Non_Dynamic_MovementSpeed' has a wrong offset!");
static_assert(offsetof(ABP_SpermWhale_C, Non_Dynamic_Anim_Intensity) == 0x0003A0, "Member 'ABP_SpermWhale_C::Non_Dynamic_Anim_Intensity' has a wrong offset!");
static_assert(offsetof(ABP_SpermWhale_C, Pitch) == 0x0003A8, "Member 'ABP_SpermWhale_C::Pitch' has a wrong offset!");
static_assert(offsetof(ABP_SpermWhale_C, TurningAngle) == 0x0003B0, "Member 'ABP_SpermWhale_C::TurningAngle' has a wrong offset!");
static_assert(offsetof(ABP_SpermWhale_C, Roll_Rotation_Intensity) == 0x0003B8, "Member 'ABP_SpermWhale_C::Roll_Rotation_Intensity' has a wrong offset!");
static_assert(offsetof(ABP_SpermWhale_C, Roll_Smoothing_Speed) == 0x0003C0, "Member 'ABP_SpermWhale_C::Roll_Smoothing_Speed' has a wrong offset!");
static_assert(offsetof(ABP_SpermWhale_C, TurningBlendSpaceAngle) == 0x0003C8, "Member 'ABP_SpermWhale_C::TurningBlendSpaceAngle' has a wrong offset!");
static_assert(offsetof(ABP_SpermWhale_C, Rotation_Smoothing_Speed) == 0x0003D0, "Member 'ABP_SpermWhale_C::Rotation_Smoothing_Speed' has a wrong offset!");
static_assert(offsetof(ABP_SpermWhale_C, Movement_Smoothing_Speed) == 0x0003D8, "Member 'ABP_SpermWhale_C::Movement_Smoothing_Speed' has a wrong offset!");
static_assert(offsetof(ABP_SpermWhale_C, Mouth_DistanceToOpen) == 0x0003E0, "Member 'ABP_SpermWhale_C::Mouth_DistanceToOpen' has a wrong offset!");
static_assert(offsetof(ABP_SpermWhale_C, Mouth_OpensNearPlayer) == 0x0003E8, "Member 'ABP_SpermWhale_C::Mouth_OpensNearPlayer' has a wrong offset!");
static_assert(offsetof(ABP_SpermWhale_C, Scale_LengthRatio) == 0x0003F0, "Member 'ABP_SpermWhale_C::Scale_LengthRatio' has a wrong offset!");
static_assert(offsetof(ABP_SpermWhale_C, Scale) == 0x0003F8, "Member 'ABP_SpermWhale_C::Scale' has a wrong offset!");
static_assert(offsetof(ABP_SpermWhale_C, ShowSpline) == 0x000400, "Member 'ABP_SpermWhale_C::ShowSpline' has a wrong offset!");
static_assert(offsetof(ABP_SpermWhale_C, Mouth_Interactive_Variable) == 0x000408, "Member 'ABP_SpermWhale_C::Mouth_Interactive_Variable' has a wrong offset!");
static_assert(offsetof(ABP_SpermWhale_C, Whale_Noises) == 0x000410, "Member 'ABP_SpermWhale_C::Whale_Noises' has a wrong offset!");
static_assert(offsetof(ABP_SpermWhale_C, Mouth_Open_Interactive_Speed) == 0x000418, "Member 'ABP_SpermWhale_C::Mouth_Open_Interactive_Speed' has a wrong offset!");
static_assert(offsetof(ABP_SpermWhale_C, DynamicMaterial) == 0x000420, "Member 'ABP_SpermWhale_C::DynamicMaterial' has a wrong offset!");
static_assert(offsetof(ABP_SpermWhale_C, MaterialVariation) == 0x000428, "Member 'ABP_SpermWhale_C::MaterialVariation' has a wrong offset!");
static_assert(offsetof(ABP_SpermWhale_C, Material) == 0x000430, "Member 'ABP_SpermWhale_C::Material' has a wrong offset!");
static_assert(offsetof(ABP_SpermWhale_C, MouthStatic_) == 0x000438, "Member 'ABP_SpermWhale_C::MouthStatic_' has a wrong offset!");
static_assert(offsetof(ABP_SpermWhale_C, MouthStatic_Amount) == 0x000440, "Member 'ABP_SpermWhale_C::MouthStatic_Amount' has a wrong offset!");
static_assert(offsetof(ABP_SpermWhale_C, AnimationBlueprint) == 0x000448, "Member 'ABP_SpermWhale_C::AnimationBlueprint' has a wrong offset!");
static_assert(offsetof(ABP_SpermWhale_C, Dynamic_SideFins_Animation) == 0x000450, "Member 'ABP_SpermWhale_C::Dynamic_SideFins_Animation' has a wrong offset!");
static_assert(offsetof(ABP_SpermWhale_C, SideFins_Target) == 0x000458, "Member 'ABP_SpermWhale_C::SideFins_Target' has a wrong offset!");
static_assert(offsetof(ABP_SpermWhale_C, DistanceForTick) == 0x000460, "Member 'ABP_SpermWhale_C::DistanceForTick' has a wrong offset!");

}

