#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TriggerInteractiveEnvironmentZone

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_TriggerInteractiveEnvironmentZone.BP_TriggerInteractiveEnvironmentZone_C.ExecuteUbergraph_BP_TriggerInteractiveEnvironmentZone
// 0x0038 (0x0038 - 0x0000)
struct BP_TriggerInteractiveEnvironmentZone_C_ExecuteUbergraph_BP_TriggerInteractiveEnvironmentZone final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_OtherActor_1;                         // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_EnvironmentInteractorComponent_C*   CallFunc_GetComponentByClass_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_OtherActor;                           // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TriggerInteractiveEnvironmentZone_C_ExecuteUbergraph_BP_TriggerInteractiveEnvironmentZone) == 0x000008, "Wrong alignment on BP_TriggerInteractiveEnvironmentZone_C_ExecuteUbergraph_BP_TriggerInteractiveEnvironmentZone");
static_assert(sizeof(BP_TriggerInteractiveEnvironmentZone_C_ExecuteUbergraph_BP_TriggerInteractiveEnvironmentZone) == 0x000038, "Wrong size on BP_TriggerInteractiveEnvironmentZone_C_ExecuteUbergraph_BP_TriggerInteractiveEnvironmentZone");
static_assert(offsetof(BP_TriggerInteractiveEnvironmentZone_C_ExecuteUbergraph_BP_TriggerInteractiveEnvironmentZone, EntryPoint) == 0x000000, "Member 'BP_TriggerInteractiveEnvironmentZone_C_ExecuteUbergraph_BP_TriggerInteractiveEnvironmentZone::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_TriggerInteractiveEnvironmentZone_C_ExecuteUbergraph_BP_TriggerInteractiveEnvironmentZone, K2Node_Event_OtherActor_1) == 0x000008, "Member 'BP_TriggerInteractiveEnvironmentZone_C_ExecuteUbergraph_BP_TriggerInteractiveEnvironmentZone::K2Node_Event_OtherActor_1' has a wrong offset!");
static_assert(offsetof(BP_TriggerInteractiveEnvironmentZone_C_ExecuteUbergraph_BP_TriggerInteractiveEnvironmentZone, CallFunc_GetComponentByClass_ReturnValue) == 0x000010, "Member 'BP_TriggerInteractiveEnvironmentZone_C_ExecuteUbergraph_BP_TriggerInteractiveEnvironmentZone::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TriggerInteractiveEnvironmentZone_C_ExecuteUbergraph_BP_TriggerInteractiveEnvironmentZone, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'BP_TriggerInteractiveEnvironmentZone_C_ExecuteUbergraph_BP_TriggerInteractiveEnvironmentZone::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TriggerInteractiveEnvironmentZone_C_ExecuteUbergraph_BP_TriggerInteractiveEnvironmentZone, K2Node_Event_OtherActor) == 0x000020, "Member 'BP_TriggerInteractiveEnvironmentZone_C_ExecuteUbergraph_BP_TriggerInteractiveEnvironmentZone::K2Node_Event_OtherActor' has a wrong offset!");
static_assert(offsetof(BP_TriggerInteractiveEnvironmentZone_C_ExecuteUbergraph_BP_TriggerInteractiveEnvironmentZone, CallFunc_Array_RemoveItem_ReturnValue) == 0x000028, "Member 'BP_TriggerInteractiveEnvironmentZone_C_ExecuteUbergraph_BP_TriggerInteractiveEnvironmentZone::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TriggerInteractiveEnvironmentZone_C_ExecuteUbergraph_BP_TriggerInteractiveEnvironmentZone, CallFunc_Array_Add_ReturnValue) == 0x00002C, "Member 'BP_TriggerInteractiveEnvironmentZone_C_ExecuteUbergraph_BP_TriggerInteractiveEnvironmentZone::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TriggerInteractiveEnvironmentZone_C_ExecuteUbergraph_BP_TriggerInteractiveEnvironmentZone, K2Node_Event_EndPlayReason) == 0x000030, "Member 'BP_TriggerInteractiveEnvironmentZone_C_ExecuteUbergraph_BP_TriggerInteractiveEnvironmentZone::K2Node_Event_EndPlayReason' has a wrong offset!");

// Function BP_TriggerInteractiveEnvironmentZone.BP_TriggerInteractiveEnvironmentZone_C.ReceiveActorBeginOverlap
// 0x0008 (0x0008 - 0x0000)
struct BP_TriggerInteractiveEnvironmentZone_C_ReceiveActorBeginOverlap final
{
public:
	class AActor*                                 OtherActor;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TriggerInteractiveEnvironmentZone_C_ReceiveActorBeginOverlap) == 0x000008, "Wrong alignment on BP_TriggerInteractiveEnvironmentZone_C_ReceiveActorBeginOverlap");
static_assert(sizeof(BP_TriggerInteractiveEnvironmentZone_C_ReceiveActorBeginOverlap) == 0x000008, "Wrong size on BP_TriggerInteractiveEnvironmentZone_C_ReceiveActorBeginOverlap");
static_assert(offsetof(BP_TriggerInteractiveEnvironmentZone_C_ReceiveActorBeginOverlap, OtherActor) == 0x000000, "Member 'BP_TriggerInteractiveEnvironmentZone_C_ReceiveActorBeginOverlap::OtherActor' has a wrong offset!");

// Function BP_TriggerInteractiveEnvironmentZone.BP_TriggerInteractiveEnvironmentZone_C.ReceiveActorEndOverlap
// 0x0008 (0x0008 - 0x0000)
struct BP_TriggerInteractiveEnvironmentZone_C_ReceiveActorEndOverlap final
{
public:
	class AActor*                                 OtherActor;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TriggerInteractiveEnvironmentZone_C_ReceiveActorEndOverlap) == 0x000008, "Wrong alignment on BP_TriggerInteractiveEnvironmentZone_C_ReceiveActorEndOverlap");
static_assert(sizeof(BP_TriggerInteractiveEnvironmentZone_C_ReceiveActorEndOverlap) == 0x000008, "Wrong size on BP_TriggerInteractiveEnvironmentZone_C_ReceiveActorEndOverlap");
static_assert(offsetof(BP_TriggerInteractiveEnvironmentZone_C_ReceiveActorEndOverlap, OtherActor) == 0x000000, "Member 'BP_TriggerInteractiveEnvironmentZone_C_ReceiveActorEndOverlap::OtherActor' has a wrong offset!");

// Function BP_TriggerInteractiveEnvironmentZone.BP_TriggerInteractiveEnvironmentZone_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_TriggerInteractiveEnvironmentZone_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TriggerInteractiveEnvironmentZone_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_TriggerInteractiveEnvironmentZone_C_ReceiveEndPlay");
static_assert(sizeof(BP_TriggerInteractiveEnvironmentZone_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_TriggerInteractiveEnvironmentZone_C_ReceiveEndPlay");
static_assert(offsetof(BP_TriggerInteractiveEnvironmentZone_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_TriggerInteractiveEnvironmentZone_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

}

