#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TutorialListener_CardCompletedDispatcher

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_TutorialListener_CardCompletedDispatcher.BP_TutorialListener_CardCompletedDispatcher_C.OnTutorialCardCompleted
// 0x0030 (0x0030 - 0x0000)
struct BP_TutorialListener_CardCompletedDispatcher_C_OnTutorialCardCompleted final
{
public:
	struct FDataTableRowHandle                    TutorialCardRow;                                   // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	bool                                          ShouldBeDestroyed;                                 // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FDataTableRowHandle>            K2Node_MakeArray_Array;                            // 0x0018(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TutorialListener_CardCompletedDispatcher_C_OnTutorialCardCompleted) == 0x000008, "Wrong alignment on BP_TutorialListener_CardCompletedDispatcher_C_OnTutorialCardCompleted");
static_assert(sizeof(BP_TutorialListener_CardCompletedDispatcher_C_OnTutorialCardCompleted) == 0x000030, "Wrong size on BP_TutorialListener_CardCompletedDispatcher_C_OnTutorialCardCompleted");
static_assert(offsetof(BP_TutorialListener_CardCompletedDispatcher_C_OnTutorialCardCompleted, TutorialCardRow) == 0x000000, "Member 'BP_TutorialListener_CardCompletedDispatcher_C_OnTutorialCardCompleted::TutorialCardRow' has a wrong offset!");
static_assert(offsetof(BP_TutorialListener_CardCompletedDispatcher_C_OnTutorialCardCompleted, ShouldBeDestroyed) == 0x000010, "Member 'BP_TutorialListener_CardCompletedDispatcher_C_OnTutorialCardCompleted::ShouldBeDestroyed' has a wrong offset!");
static_assert(offsetof(BP_TutorialListener_CardCompletedDispatcher_C_OnTutorialCardCompleted, K2Node_MakeArray_Array) == 0x000018, "Member 'BP_TutorialListener_CardCompletedDispatcher_C_OnTutorialCardCompleted::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_TutorialListener_CardCompletedDispatcher_C_OnTutorialCardCompleted, CallFunc_Array_Contains_ReturnValue) == 0x000028, "Member 'BP_TutorialListener_CardCompletedDispatcher_C_OnTutorialCardCompleted::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");

}

