#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TeamMotivationGenerator

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_BattleListener_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_TeamMotivationGenerator.BP_TeamMotivationGenerator_C
// 0x0058 (0x0088 - 0x0030)
class UBP_TeamMotivationGenerator_C final : public UBP_BattleListener_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_TeamMotivationGenerator_C;       // 0x0030(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAC_jRPG_BattleManager_C*               BattleManager;                                     // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	double                                        ChangeValue_AllyDeath;                             // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ChangeValue_AllyWasHit;                            // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ChangeValue_AllyWasCriticallyHit;                  // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ChangeValue_AllyWasHitOnWeakness;                  // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ChangeValue_EnemyWasHit;                           // 0x0060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ChangeValue_EnemyWasCriticallyHit;                 // 0x0068(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ChangeValue_EnemyWasHitOnWeakness;                 // 0x0070(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ChangeValue_EnemyReceivedDebuff;                   // 0x0078(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ChangeValue_AllyReceivedDebuff;                    // 0x0080(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_TeamMotivationGenerator(int32 EntryPoint);
	void OnCharacterKilled(class UAC_jRPG_CharacterBattleStats_C* CharacterStats);
	void OnCharacterReceivedDamages(class UAC_jRPG_CharacterBattleStats_C* TargetCharacter, class UAC_jRPG_CharacterBattleStats_C* SourceCharacter, double ReceivedDamages, class UBP_BattleDamages_C* BattleDamages);
	void ProcessAddBuffAction(const class UAction_AddBuff_C*& BuffAddAction);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_TeamMotivationGenerator_C">();
	}
	static class UBP_TeamMotivationGenerator_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_TeamMotivationGenerator_C>();
	}
};
static_assert(alignof(UBP_TeamMotivationGenerator_C) == 0x000008, "Wrong alignment on UBP_TeamMotivationGenerator_C");
static_assert(sizeof(UBP_TeamMotivationGenerator_C) == 0x000088, "Wrong size on UBP_TeamMotivationGenerator_C");
static_assert(offsetof(UBP_TeamMotivationGenerator_C, UberGraphFrame_BP_TeamMotivationGenerator_C) == 0x000030, "Member 'UBP_TeamMotivationGenerator_C::UberGraphFrame_BP_TeamMotivationGenerator_C' has a wrong offset!");
static_assert(offsetof(UBP_TeamMotivationGenerator_C, BattleManager) == 0x000038, "Member 'UBP_TeamMotivationGenerator_C::BattleManager' has a wrong offset!");
static_assert(offsetof(UBP_TeamMotivationGenerator_C, ChangeValue_AllyDeath) == 0x000040, "Member 'UBP_TeamMotivationGenerator_C::ChangeValue_AllyDeath' has a wrong offset!");
static_assert(offsetof(UBP_TeamMotivationGenerator_C, ChangeValue_AllyWasHit) == 0x000048, "Member 'UBP_TeamMotivationGenerator_C::ChangeValue_AllyWasHit' has a wrong offset!");
static_assert(offsetof(UBP_TeamMotivationGenerator_C, ChangeValue_AllyWasCriticallyHit) == 0x000050, "Member 'UBP_TeamMotivationGenerator_C::ChangeValue_AllyWasCriticallyHit' has a wrong offset!");
static_assert(offsetof(UBP_TeamMotivationGenerator_C, ChangeValue_AllyWasHitOnWeakness) == 0x000058, "Member 'UBP_TeamMotivationGenerator_C::ChangeValue_AllyWasHitOnWeakness' has a wrong offset!");
static_assert(offsetof(UBP_TeamMotivationGenerator_C, ChangeValue_EnemyWasHit) == 0x000060, "Member 'UBP_TeamMotivationGenerator_C::ChangeValue_EnemyWasHit' has a wrong offset!");
static_assert(offsetof(UBP_TeamMotivationGenerator_C, ChangeValue_EnemyWasCriticallyHit) == 0x000068, "Member 'UBP_TeamMotivationGenerator_C::ChangeValue_EnemyWasCriticallyHit' has a wrong offset!");
static_assert(offsetof(UBP_TeamMotivationGenerator_C, ChangeValue_EnemyWasHitOnWeakness) == 0x000070, "Member 'UBP_TeamMotivationGenerator_C::ChangeValue_EnemyWasHitOnWeakness' has a wrong offset!");
static_assert(offsetof(UBP_TeamMotivationGenerator_C, ChangeValue_EnemyReceivedDebuff) == 0x000078, "Member 'UBP_TeamMotivationGenerator_C::ChangeValue_EnemyReceivedDebuff' has a wrong offset!");
static_assert(offsetof(UBP_TeamMotivationGenerator_C, ChangeValue_AllyReceivedDebuff) == 0x000080, "Member 'UBP_TeamMotivationGenerator_C::ChangeValue_AllyReceivedDebuff' has a wrong offset!");

}

