#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TutorialSystemComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "S_TutorialHintParameters_structs.hpp"
#include "S_TutorialCardParameters_structs.hpp"


namespace SDK::Params
{

// Function BP_TutorialSystemComponent.BP_TutorialSystemComponent_C.AddTutorialListener
// 0x0018 (0x0018 - 0x0000)
struct BP_TutorialSystemComponent_C_AddTutorialListener final
{
public:
	TScriptInterface<class IBPI_TutorialListenerInterface_C> Listener;                               // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TutorialSystemComponent_C_AddTutorialListener) == 0x000008, "Wrong alignment on BP_TutorialSystemComponent_C_AddTutorialListener");
static_assert(sizeof(BP_TutorialSystemComponent_C_AddTutorialListener) == 0x000018, "Wrong size on BP_TutorialSystemComponent_C_AddTutorialListener");
static_assert(offsetof(BP_TutorialSystemComponent_C_AddTutorialListener, Listener) == 0x000000, "Member 'BP_TutorialSystemComponent_C_AddTutorialListener::Listener' has a wrong offset!");
static_assert(offsetof(BP_TutorialSystemComponent_C_AddTutorialListener, CallFunc_Array_Add_ReturnValue) == 0x000010, "Member 'BP_TutorialSystemComponent_C_AddTutorialListener::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function BP_TutorialSystemComponent.BP_TutorialSystemComponent_C.AreTutorialsEnabled
// 0x0018 (0x0018 - 0x0000)
struct BP_TutorialSystemComponent_C_AreTutorialsEnabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetFinishedGameCount_FinishedGameCount;   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UConfigurableGameUserSettings*          CallFunc_GetConfigurableGameUserSettings_GameUserSettings; // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetEnableTutorials_ReturnValue;           // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetBoolCVar_ReturnValue;                  // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TutorialSystemComponent_C_AreTutorialsEnabled) == 0x000008, "Wrong alignment on BP_TutorialSystemComponent_C_AreTutorialsEnabled");
static_assert(sizeof(BP_TutorialSystemComponent_C_AreTutorialsEnabled) == 0x000018, "Wrong size on BP_TutorialSystemComponent_C_AreTutorialsEnabled");
static_assert(offsetof(BP_TutorialSystemComponent_C_AreTutorialsEnabled, ReturnValue) == 0x000000, "Member 'BP_TutorialSystemComponent_C_AreTutorialsEnabled::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TutorialSystemComponent_C_AreTutorialsEnabled, CallFunc_GetFinishedGameCount_FinishedGameCount) == 0x000004, "Member 'BP_TutorialSystemComponent_C_AreTutorialsEnabled::CallFunc_GetFinishedGameCount_FinishedGameCount' has a wrong offset!");
static_assert(offsetof(BP_TutorialSystemComponent_C_AreTutorialsEnabled, CallFunc_GetConfigurableGameUserSettings_GameUserSettings) == 0x000008, "Member 'BP_TutorialSystemComponent_C_AreTutorialsEnabled::CallFunc_GetConfigurableGameUserSettings_GameUserSettings' has a wrong offset!");
static_assert(offsetof(BP_TutorialSystemComponent_C_AreTutorialsEnabled, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000010, "Member 'BP_TutorialSystemComponent_C_AreTutorialsEnabled::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TutorialSystemComponent_C_AreTutorialsEnabled, CallFunc_GetEnableTutorials_ReturnValue) == 0x000011, "Member 'BP_TutorialSystemComponent_C_AreTutorialsEnabled::CallFunc_GetEnableTutorials_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TutorialSystemComponent_C_AreTutorialsEnabled, CallFunc_GetBoolCVar_ReturnValue) == 0x000012, "Member 'BP_TutorialSystemComponent_C_AreTutorialsEnabled::CallFunc_GetBoolCVar_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TutorialSystemComponent_C_AreTutorialsEnabled, CallFunc_Not_PreBool_ReturnValue) == 0x000013, "Member 'BP_TutorialSystemComponent_C_AreTutorialsEnabled::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TutorialSystemComponent_C_AreTutorialsEnabled, CallFunc_BooleanAND_ReturnValue) == 0x000014, "Member 'BP_TutorialSystemComponent_C_AreTutorialsEnabled::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TutorialSystemComponent_C_AreTutorialsEnabled, CallFunc_BooleanAND_ReturnValue_1) == 0x000015, "Member 'BP_TutorialSystemComponent_C_AreTutorialsEnabled::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");

// Function BP_TutorialSystemComponent.BP_TutorialSystemComponent_C.CleanAllQueuedTutorials
// 0x0002 (0x0002 - 0x0000)
struct BP_TutorialSystemComponent_C_CleanAllQueuedTutorials final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TutorialSystemComponent_C_CleanAllQueuedTutorials) == 0x000001, "Wrong alignment on BP_TutorialSystemComponent_C_CleanAllQueuedTutorials");
static_assert(sizeof(BP_TutorialSystemComponent_C_CleanAllQueuedTutorials) == 0x000002, "Wrong size on BP_TutorialSystemComponent_C_CleanAllQueuedTutorials");
static_assert(offsetof(BP_TutorialSystemComponent_C_CleanAllQueuedTutorials, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'BP_TutorialSystemComponent_C_CleanAllQueuedTutorials::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TutorialSystemComponent_C_CleanAllQueuedTutorials, CallFunc_IsValid_ReturnValue_1) == 0x000001, "Member 'BP_TutorialSystemComponent_C_CleanAllQueuedTutorials::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function BP_TutorialSystemComponent.BP_TutorialSystemComponent_C.ExecuteUbergraph_BP_TutorialSystemComponent
// 0x0050 (0x0050 - 0x0000)
struct BP_TutorialSystemComponent_C_ExecuteUbergraph_BP_TutorialSystemComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UConfigurableGameUserSettings*          CallFunc_GetConfigurableGameUserSettings_GameUserSettings; // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class UConfigurableGameUserSettings* UserConfig)> K2Node_CreateDelegate_OutputDelegate; // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool NewValue)>                K2Node_CreateDelegate_OutputDelegate_1;            // 0x0020(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_jRPG_GI_Custom_C*                   CallFunc_GetCustomGI_ReturnValue;                  // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName LevelDestination)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0040(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TutorialSystemComponent_C_ExecuteUbergraph_BP_TutorialSystemComponent) == 0x000008, "Wrong alignment on BP_TutorialSystemComponent_C_ExecuteUbergraph_BP_TutorialSystemComponent");
static_assert(sizeof(BP_TutorialSystemComponent_C_ExecuteUbergraph_BP_TutorialSystemComponent) == 0x000050, "Wrong size on BP_TutorialSystemComponent_C_ExecuteUbergraph_BP_TutorialSystemComponent");
static_assert(offsetof(BP_TutorialSystemComponent_C_ExecuteUbergraph_BP_TutorialSystemComponent, EntryPoint) == 0x000000, "Member 'BP_TutorialSystemComponent_C_ExecuteUbergraph_BP_TutorialSystemComponent::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_TutorialSystemComponent_C_ExecuteUbergraph_BP_TutorialSystemComponent, CallFunc_GetConfigurableGameUserSettings_GameUserSettings) == 0x000008, "Member 'BP_TutorialSystemComponent_C_ExecuteUbergraph_BP_TutorialSystemComponent::CallFunc_GetConfigurableGameUserSettings_GameUserSettings' has a wrong offset!");
static_assert(offsetof(BP_TutorialSystemComponent_C_ExecuteUbergraph_BP_TutorialSystemComponent, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'BP_TutorialSystemComponent_C_ExecuteUbergraph_BP_TutorialSystemComponent::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_TutorialSystemComponent_C_ExecuteUbergraph_BP_TutorialSystemComponent, K2Node_CreateDelegate_OutputDelegate_1) == 0x000020, "Member 'BP_TutorialSystemComponent_C_ExecuteUbergraph_BP_TutorialSystemComponent::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_TutorialSystemComponent_C_ExecuteUbergraph_BP_TutorialSystemComponent, K2Node_Event_EndPlayReason) == 0x000030, "Member 'BP_TutorialSystemComponent_C_ExecuteUbergraph_BP_TutorialSystemComponent::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BP_TutorialSystemComponent_C_ExecuteUbergraph_BP_TutorialSystemComponent, CallFunc_GetCustomGI_ReturnValue) == 0x000038, "Member 'BP_TutorialSystemComponent_C_ExecuteUbergraph_BP_TutorialSystemComponent::CallFunc_GetCustomGI_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TutorialSystemComponent_C_ExecuteUbergraph_BP_TutorialSystemComponent, K2Node_CreateDelegate_OutputDelegate_2) == 0x000040, "Member 'BP_TutorialSystemComponent_C_ExecuteUbergraph_BP_TutorialSystemComponent::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");

// Function BP_TutorialSystemComponent.BP_TutorialSystemComponent_C.HasActiveTutorialCard
// 0x0002 (0x0002 - 0x0000)
struct BP_TutorialSystemComponent_C_HasActiveTutorialCard final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TutorialSystemComponent_C_HasActiveTutorialCard) == 0x000001, "Wrong alignment on BP_TutorialSystemComponent_C_HasActiveTutorialCard");
static_assert(sizeof(BP_TutorialSystemComponent_C_HasActiveTutorialCard) == 0x000002, "Wrong size on BP_TutorialSystemComponent_C_HasActiveTutorialCard");
static_assert(offsetof(BP_TutorialSystemComponent_C_HasActiveTutorialCard, ReturnValue) == 0x000000, "Member 'BP_TutorialSystemComponent_C_HasActiveTutorialCard::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TutorialSystemComponent_C_HasActiveTutorialCard, CallFunc_IsValid_ReturnValue) == 0x000001, "Member 'BP_TutorialSystemComponent_C_HasActiveTutorialCard::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_TutorialSystemComponent.BP_TutorialSystemComponent_C.OnChangeMapProcessStarted
// 0x0008 (0x0008 - 0x0000)
struct BP_TutorialSystemComponent_C_OnChangeMapProcessStarted final
{
public:
	class FName                                   LevelDestination;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TutorialSystemComponent_C_OnChangeMapProcessStarted) == 0x000004, "Wrong alignment on BP_TutorialSystemComponent_C_OnChangeMapProcessStarted");
static_assert(sizeof(BP_TutorialSystemComponent_C_OnChangeMapProcessStarted) == 0x000008, "Wrong size on BP_TutorialSystemComponent_C_OnChangeMapProcessStarted");
static_assert(offsetof(BP_TutorialSystemComponent_C_OnChangeMapProcessStarted, LevelDestination) == 0x000000, "Member 'BP_TutorialSystemComponent_C_OnChangeMapProcessStarted::LevelDestination' has a wrong offset!");

// Function BP_TutorialSystemComponent.BP_TutorialSystemComponent_C.OnCVarAutoSkipTutorialsChanged
// 0x0001 (0x0001 - 0x0000)
struct BP_TutorialSystemComponent_C_OnCVarAutoSkipTutorialsChanged final
{
public:
	bool                                          NewValue;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TutorialSystemComponent_C_OnCVarAutoSkipTutorialsChanged) == 0x000001, "Wrong alignment on BP_TutorialSystemComponent_C_OnCVarAutoSkipTutorialsChanged");
static_assert(sizeof(BP_TutorialSystemComponent_C_OnCVarAutoSkipTutorialsChanged) == 0x000001, "Wrong size on BP_TutorialSystemComponent_C_OnCVarAutoSkipTutorialsChanged");
static_assert(offsetof(BP_TutorialSystemComponent_C_OnCVarAutoSkipTutorialsChanged, NewValue) == 0x000000, "Member 'BP_TutorialSystemComponent_C_OnCVarAutoSkipTutorialsChanged::NewValue' has a wrong offset!");

// Function BP_TutorialSystemComponent.BP_TutorialSystemComponent_C.OnNewSettingsApplied
// 0x0008 (0x0008 - 0x0000)
struct BP_TutorialSystemComponent_C_OnNewSettingsApplied final
{
public:
	const class UConfigurableGameUserSettings*    UserConfig;                                        // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TutorialSystemComponent_C_OnNewSettingsApplied) == 0x000008, "Wrong alignment on BP_TutorialSystemComponent_C_OnNewSettingsApplied");
static_assert(sizeof(BP_TutorialSystemComponent_C_OnNewSettingsApplied) == 0x000008, "Wrong size on BP_TutorialSystemComponent_C_OnNewSettingsApplied");
static_assert(offsetof(BP_TutorialSystemComponent_C_OnNewSettingsApplied, UserConfig) == 0x000000, "Member 'BP_TutorialSystemComponent_C_OnNewSettingsApplied::UserConfig' has a wrong offset!");

// Function BP_TutorialSystemComponent.BP_TutorialSystemComponent_C.OnTutorialCardDiscarded
// 0x0030 (0x0030 - 0x0000)
struct BP_TutorialSystemComponent_C_OnTutorialCardDiscarded final
{
public:
	class UWBP_TutorialCard_C*                    Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FDataTableRowHandle                    local_currentTutorial;                             // 0x0008(0x0010)(Edit, BlueprintVisible, NoDestructor)
	struct FDataTableRowHandle                    CallFunc_GetTutorialCardRow_TutorialCardRow;       // 0x0018(0x0010)(NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TutorialSystemComponent_C_OnTutorialCardDiscarded) == 0x000008, "Wrong alignment on BP_TutorialSystemComponent_C_OnTutorialCardDiscarded");
static_assert(sizeof(BP_TutorialSystemComponent_C_OnTutorialCardDiscarded) == 0x000030, "Wrong size on BP_TutorialSystemComponent_C_OnTutorialCardDiscarded");
static_assert(offsetof(BP_TutorialSystemComponent_C_OnTutorialCardDiscarded, Widget) == 0x000000, "Member 'BP_TutorialSystemComponent_C_OnTutorialCardDiscarded::Widget' has a wrong offset!");
static_assert(offsetof(BP_TutorialSystemComponent_C_OnTutorialCardDiscarded, local_currentTutorial) == 0x000008, "Member 'BP_TutorialSystemComponent_C_OnTutorialCardDiscarded::local_currentTutorial' has a wrong offset!");
static_assert(offsetof(BP_TutorialSystemComponent_C_OnTutorialCardDiscarded, CallFunc_GetTutorialCardRow_TutorialCardRow) == 0x000018, "Member 'BP_TutorialSystemComponent_C_OnTutorialCardDiscarded::CallFunc_GetTutorialCardRow_TutorialCardRow' has a wrong offset!");
static_assert(offsetof(BP_TutorialSystemComponent_C_OnTutorialCardDiscarded, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000028, "Member 'BP_TutorialSystemComponent_C_OnTutorialCardDiscarded::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");

// Function BP_TutorialSystemComponent.BP_TutorialSystemComponent_C.OnTutorialCardRowDiscarded
// 0x0030 (0x0030 - 0x0000)
struct BP_TutorialSystemComponent_C_OnTutorialCardRowDiscarded final
{
public:
	struct FDataTableRowHandle                    TutorialCardRow;                                   // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FDataTableRowHandle                    local_currentTutorial;                             // 0x0010(0x0010)(Edit, BlueprintVisible, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_jRPG_GI_Custom_C*                   CallFunc_GetCustomGI_ReturnValue;                  // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TutorialSystemComponent_C_OnTutorialCardRowDiscarded) == 0x000008, "Wrong alignment on BP_TutorialSystemComponent_C_OnTutorialCardRowDiscarded");
static_assert(sizeof(BP_TutorialSystemComponent_C_OnTutorialCardRowDiscarded) == 0x000030, "Wrong size on BP_TutorialSystemComponent_C_OnTutorialCardRowDiscarded");
static_assert(offsetof(BP_TutorialSystemComponent_C_OnTutorialCardRowDiscarded, TutorialCardRow) == 0x000000, "Member 'BP_TutorialSystemComponent_C_OnTutorialCardRowDiscarded::TutorialCardRow' has a wrong offset!");
static_assert(offsetof(BP_TutorialSystemComponent_C_OnTutorialCardRowDiscarded, local_currentTutorial) == 0x000010, "Member 'BP_TutorialSystemComponent_C_OnTutorialCardRowDiscarded::local_currentTutorial' has a wrong offset!");
static_assert(offsetof(BP_TutorialSystemComponent_C_OnTutorialCardRowDiscarded, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'BP_TutorialSystemComponent_C_OnTutorialCardRowDiscarded::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TutorialSystemComponent_C_OnTutorialCardRowDiscarded, CallFunc_Not_PreBool_ReturnValue) == 0x000021, "Member 'BP_TutorialSystemComponent_C_OnTutorialCardRowDiscarded::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TutorialSystemComponent_C_OnTutorialCardRowDiscarded, CallFunc_GetCustomGI_ReturnValue) == 0x000028, "Member 'BP_TutorialSystemComponent_C_OnTutorialCardRowDiscarded::CallFunc_GetCustomGI_ReturnValue' has a wrong offset!");

// Function BP_TutorialSystemComponent.BP_TutorialSystemComponent_C.OnTutorialHintFinished
// 0x0018 (0x0018 - 0x0000)
struct BP_TutorialSystemComponent_C_OnTutorialHintFinished final
{
public:
	class UWBP_TutorialHint_C*                    Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FDataTableRowHandle                    CallFunc_GetTutorialHintRow_TutorialHintRow;       // 0x0008(0x0010)(NoDestructor)
};
static_assert(alignof(BP_TutorialSystemComponent_C_OnTutorialHintFinished) == 0x000008, "Wrong alignment on BP_TutorialSystemComponent_C_OnTutorialHintFinished");
static_assert(sizeof(BP_TutorialSystemComponent_C_OnTutorialHintFinished) == 0x000018, "Wrong size on BP_TutorialSystemComponent_C_OnTutorialHintFinished");
static_assert(offsetof(BP_TutorialSystemComponent_C_OnTutorialHintFinished, Widget) == 0x000000, "Member 'BP_TutorialSystemComponent_C_OnTutorialHintFinished::Widget' has a wrong offset!");
static_assert(offsetof(BP_TutorialSystemComponent_C_OnTutorialHintFinished, CallFunc_GetTutorialHintRow_TutorialHintRow) == 0x000008, "Member 'BP_TutorialSystemComponent_C_OnTutorialHintFinished::CallFunc_GetTutorialHintRow_TutorialHintRow' has a wrong offset!");

// Function BP_TutorialSystemComponent.BP_TutorialSystemComponent_C.OnTutorialHintRowFinished
// 0x0010 (0x0010 - 0x0000)
struct BP_TutorialSystemComponent_C_OnTutorialHintRowFinished final
{
public:
	struct FDataTableRowHandle                    TutorialHintRow;                                   // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(BP_TutorialSystemComponent_C_OnTutorialHintRowFinished) == 0x000008, "Wrong alignment on BP_TutorialSystemComponent_C_OnTutorialHintRowFinished");
static_assert(sizeof(BP_TutorialSystemComponent_C_OnTutorialHintRowFinished) == 0x000010, "Wrong size on BP_TutorialSystemComponent_C_OnTutorialHintRowFinished");
static_assert(offsetof(BP_TutorialSystemComponent_C_OnTutorialHintRowFinished, TutorialHintRow) == 0x000000, "Member 'BP_TutorialSystemComponent_C_OnTutorialHintRowFinished::TutorialHintRow' has a wrong offset!");

// Function BP_TutorialSystemComponent.BP_TutorialSystemComponent_C.ProcessTutorialListenersForCard
// 0x0048 (0x0048 - 0x0000)
struct BP_TutorialSystemComponent_C_ProcessTutorialListenersForCard final
{
public:
	struct FDataTableRowHandle                    TutorialCardRow;                                   // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_TutorialListenerInterface_C> CallFunc_Array_Get_Item;                // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_OnTutorialCardCompleted_ShouldBeDestroyed; // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue;                          // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TutorialSystemComponent_C_ProcessTutorialListenersForCard) == 0x000008, "Wrong alignment on BP_TutorialSystemComponent_C_ProcessTutorialListenersForCard");
static_assert(sizeof(BP_TutorialSystemComponent_C_ProcessTutorialListenersForCard) == 0x000048, "Wrong size on BP_TutorialSystemComponent_C_ProcessTutorialListenersForCard");
static_assert(offsetof(BP_TutorialSystemComponent_C_ProcessTutorialListenersForCard, TutorialCardRow) == 0x000000, "Member 'BP_TutorialSystemComponent_C_ProcessTutorialListenersForCard::TutorialCardRow' has a wrong offset!");
static_assert(offsetof(BP_TutorialSystemComponent_C_ProcessTutorialListenersForCard, Temp_int_Array_Index_Variable) == 0x000010, "Member 'BP_TutorialSystemComponent_C_ProcessTutorialListenersForCard::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_TutorialSystemComponent_C_ProcessTutorialListenersForCard, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'BP_TutorialSystemComponent_C_ProcessTutorialListenersForCard::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_TutorialSystemComponent_C_ProcessTutorialListenersForCard, CallFunc_Subtract_IntInt_ReturnValue) == 0x000018, "Member 'BP_TutorialSystemComponent_C_ProcessTutorialListenersForCard::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TutorialSystemComponent_C_ProcessTutorialListenersForCard, CallFunc_Array_Get_Item) == 0x000020, "Member 'BP_TutorialSystemComponent_C_ProcessTutorialListenersForCard::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_TutorialSystemComponent_C_ProcessTutorialListenersForCard, CallFunc_OnTutorialCardCompleted_ShouldBeDestroyed) == 0x000030, "Member 'BP_TutorialSystemComponent_C_ProcessTutorialListenersForCard::CallFunc_OnTutorialCardCompleted_ShouldBeDestroyed' has a wrong offset!");
static_assert(offsetof(BP_TutorialSystemComponent_C_ProcessTutorialListenersForCard, CallFunc_Array_Length_ReturnValue) == 0x000034, "Member 'BP_TutorialSystemComponent_C_ProcessTutorialListenersForCard::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TutorialSystemComponent_C_ProcessTutorialListenersForCard, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000038, "Member 'BP_TutorialSystemComponent_C_ProcessTutorialListenersForCard::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TutorialSystemComponent_C_ProcessTutorialListenersForCard, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x00003C, "Member 'BP_TutorialSystemComponent_C_ProcessTutorialListenersForCard::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TutorialSystemComponent_C_ProcessTutorialListenersForCard, CallFunc_Max_ReturnValue) == 0x000040, "Member 'BP_TutorialSystemComponent_C_ProcessTutorialListenersForCard::CallFunc_Max_ReturnValue' has a wrong offset!");

// Function BP_TutorialSystemComponent.BP_TutorialSystemComponent_C.QueueTutorialCard
// 0x0028 (0x0028 - 0x0000)
struct BP_TutorialSystemComponent_C_QueueTutorialCard final
{
public:
	struct FS_TutorialCardParameters              TutorialCardParameters;                            // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TutorialSystemComponent_C_QueueTutorialCard) == 0x000008, "Wrong alignment on BP_TutorialSystemComponent_C_QueueTutorialCard");
static_assert(sizeof(BP_TutorialSystemComponent_C_QueueTutorialCard) == 0x000028, "Wrong size on BP_TutorialSystemComponent_C_QueueTutorialCard");
static_assert(offsetof(BP_TutorialSystemComponent_C_QueueTutorialCard, TutorialCardParameters) == 0x000000, "Member 'BP_TutorialSystemComponent_C_QueueTutorialCard::TutorialCardParameters' has a wrong offset!");
static_assert(offsetof(BP_TutorialSystemComponent_C_QueueTutorialCard, CallFunc_Array_Add_ReturnValue) == 0x000020, "Member 'BP_TutorialSystemComponent_C_QueueTutorialCard::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function BP_TutorialSystemComponent.BP_TutorialSystemComponent_C.QueueTutorialHint
// 0x0020 (0x0020 - 0x0000)
struct BP_TutorialSystemComponent_C_QueueTutorialHint final
{
public:
	struct FS_TutorialHintParameters              TutorialHintParameters;                            // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TutorialSystemComponent_C_QueueTutorialHint) == 0x000008, "Wrong alignment on BP_TutorialSystemComponent_C_QueueTutorialHint");
static_assert(sizeof(BP_TutorialSystemComponent_C_QueueTutorialHint) == 0x000020, "Wrong size on BP_TutorialSystemComponent_C_QueueTutorialHint");
static_assert(offsetof(BP_TutorialSystemComponent_C_QueueTutorialHint, TutorialHintParameters) == 0x000000, "Member 'BP_TutorialSystemComponent_C_QueueTutorialHint::TutorialHintParameters' has a wrong offset!");
static_assert(offsetof(BP_TutorialSystemComponent_C_QueueTutorialHint, CallFunc_Array_Add_ReturnValue) == 0x000018, "Member 'BP_TutorialSystemComponent_C_QueueTutorialHint::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function BP_TutorialSystemComponent.BP_TutorialSystemComponent_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_TutorialSystemComponent_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TutorialSystemComponent_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_TutorialSystemComponent_C_ReceiveEndPlay");
static_assert(sizeof(BP_TutorialSystemComponent_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_TutorialSystemComponent_C_ReceiveEndPlay");
static_assert(offsetof(BP_TutorialSystemComponent_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_TutorialSystemComponent_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function BP_TutorialSystemComponent.BP_TutorialSystemComponent_C.SetTutorialCardContextActive
// 0x0020 (0x0020 - 0x0000)
struct BP_TutorialSystemComponent_C_SetTutorialCardContextActive final
{
public:
	bool                                          Active;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_InputManager_C*                     CallFunc_GetInputManager_InputManager;             // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetGamePaused_ReturnValue;                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetGlobalTimeDilation_TimeDilation_ImplicitCast; // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TutorialSystemComponent_C_SetTutorialCardContextActive) == 0x000008, "Wrong alignment on BP_TutorialSystemComponent_C_SetTutorialCardContextActive");
static_assert(sizeof(BP_TutorialSystemComponent_C_SetTutorialCardContextActive) == 0x000020, "Wrong size on BP_TutorialSystemComponent_C_SetTutorialCardContextActive");
static_assert(offsetof(BP_TutorialSystemComponent_C_SetTutorialCardContextActive, Active) == 0x000000, "Member 'BP_TutorialSystemComponent_C_SetTutorialCardContextActive::Active' has a wrong offset!");
static_assert(offsetof(BP_TutorialSystemComponent_C_SetTutorialCardContextActive, CallFunc_GetInputManager_InputManager) == 0x000008, "Member 'BP_TutorialSystemComponent_C_SetTutorialCardContextActive::CallFunc_GetInputManager_InputManager' has a wrong offset!");
static_assert(offsetof(BP_TutorialSystemComponent_C_SetTutorialCardContextActive, CallFunc_SelectFloat_ReturnValue) == 0x000010, "Member 'BP_TutorialSystemComponent_C_SetTutorialCardContextActive::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TutorialSystemComponent_C_SetTutorialCardContextActive, CallFunc_SetGamePaused_ReturnValue) == 0x000018, "Member 'BP_TutorialSystemComponent_C_SetTutorialCardContextActive::CallFunc_SetGamePaused_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TutorialSystemComponent_C_SetTutorialCardContextActive, CallFunc_SetGlobalTimeDilation_TimeDilation_ImplicitCast) == 0x00001C, "Member 'BP_TutorialSystemComponent_C_SetTutorialCardContextActive::CallFunc_SetGlobalTimeDilation_TimeDilation_ImplicitCast' has a wrong offset!");

// Function BP_TutorialSystemComponent.BP_TutorialSystemComponent_C.SkipTutorialCard
// 0x0010 (0x0010 - 0x0000)
struct BP_TutorialSystemComponent_C_SkipTutorialCard final
{
public:
	struct FDataTableRowHandle                    Temp_wildcard_Variable;                            // 0x0000(0x0010)(NoDestructor)
};
static_assert(alignof(BP_TutorialSystemComponent_C_SkipTutorialCard) == 0x000008, "Wrong alignment on BP_TutorialSystemComponent_C_SkipTutorialCard");
static_assert(sizeof(BP_TutorialSystemComponent_C_SkipTutorialCard) == 0x000010, "Wrong size on BP_TutorialSystemComponent_C_SkipTutorialCard");
static_assert(offsetof(BP_TutorialSystemComponent_C_SkipTutorialCard, Temp_wildcard_Variable) == 0x000000, "Member 'BP_TutorialSystemComponent_C_SkipTutorialCard::Temp_wildcard_Variable' has a wrong offset!");

// Function BP_TutorialSystemComponent.BP_TutorialSystemComponent_C.SkipTutorialHint
// 0x0018 (0x0018 - 0x0000)
struct BP_TutorialSystemComponent_C_SkipTutorialHint final
{
public:
	struct FS_TutorialHintParameters              Temp_wildcard_Variable;                            // 0x0000(0x0018)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TutorialSystemComponent_C_SkipTutorialHint) == 0x000008, "Wrong alignment on BP_TutorialSystemComponent_C_SkipTutorialHint");
static_assert(sizeof(BP_TutorialSystemComponent_C_SkipTutorialHint) == 0x000018, "Wrong size on BP_TutorialSystemComponent_C_SkipTutorialHint");
static_assert(offsetof(BP_TutorialSystemComponent_C_SkipTutorialHint, Temp_wildcard_Variable) == 0x000000, "Member 'BP_TutorialSystemComponent_C_SkipTutorialHint::Temp_wildcard_Variable' has a wrong offset!");

// Function BP_TutorialSystemComponent.BP_TutorialSystemComponent_C.TryDisplayNextTutorialCard
// 0x0028 (0x0028 - 0x0000)
struct BP_TutorialSystemComponent_C_TryDisplayNextTutorialCard final
{
public:
	bool                                          CallFunc_AreTutorialsEnabled_ReturnValue;          // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UWBP_TutorialCard_C* Widget)> K2Node_CreateDelegate_OutputDelegate;         // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsNotEmpty_ReturnValue;             // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_TutorialCard_C*                    CallFunc_Create_ReturnValue;                       // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TutorialSystemComponent_C_TryDisplayNextTutorialCard) == 0x000008, "Wrong alignment on BP_TutorialSystemComponent_C_TryDisplayNextTutorialCard");
static_assert(sizeof(BP_TutorialSystemComponent_C_TryDisplayNextTutorialCard) == 0x000028, "Wrong size on BP_TutorialSystemComponent_C_TryDisplayNextTutorialCard");
static_assert(offsetof(BP_TutorialSystemComponent_C_TryDisplayNextTutorialCard, CallFunc_AreTutorialsEnabled_ReturnValue) == 0x000000, "Member 'BP_TutorialSystemComponent_C_TryDisplayNextTutorialCard::CallFunc_AreTutorialsEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TutorialSystemComponent_C_TryDisplayNextTutorialCard, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BP_TutorialSystemComponent_C_TryDisplayNextTutorialCard::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_TutorialSystemComponent_C_TryDisplayNextTutorialCard, CallFunc_Array_IsNotEmpty_ReturnValue) == 0x000014, "Member 'BP_TutorialSystemComponent_C_TryDisplayNextTutorialCard::CallFunc_Array_IsNotEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TutorialSystemComponent_C_TryDisplayNextTutorialCard, CallFunc_Create_ReturnValue) == 0x000018, "Member 'BP_TutorialSystemComponent_C_TryDisplayNextTutorialCard::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TutorialSystemComponent_C_TryDisplayNextTutorialCard, CallFunc_Not_PreBool_ReturnValue) == 0x000020, "Member 'BP_TutorialSystemComponent_C_TryDisplayNextTutorialCard::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TutorialSystemComponent_C_TryDisplayNextTutorialCard, CallFunc_IsValid_ReturnValue) == 0x000021, "Member 'BP_TutorialSystemComponent_C_TryDisplayNextTutorialCard::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_TutorialSystemComponent.BP_TutorialSystemComponent_C.TryDisplayNextTutorialHint
// 0x0020 (0x0020 - 0x0000)
struct BP_TutorialSystemComponent_C_TryDisplayNextTutorialHint final
{
public:
	TDelegate<void(class UWBP_TutorialHint_C* Widget)> K2Node_CreateDelegate_OutputDelegate;         // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_TutorialHint_C*                    CallFunc_Create_ReturnValue;                       // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsNotEmpty_ReturnValue;             // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TutorialSystemComponent_C_TryDisplayNextTutorialHint) == 0x000008, "Wrong alignment on BP_TutorialSystemComponent_C_TryDisplayNextTutorialHint");
static_assert(sizeof(BP_TutorialSystemComponent_C_TryDisplayNextTutorialHint) == 0x000020, "Wrong size on BP_TutorialSystemComponent_C_TryDisplayNextTutorialHint");
static_assert(offsetof(BP_TutorialSystemComponent_C_TryDisplayNextTutorialHint, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'BP_TutorialSystemComponent_C_TryDisplayNextTutorialHint::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_TutorialSystemComponent_C_TryDisplayNextTutorialHint, CallFunc_Create_ReturnValue) == 0x000010, "Member 'BP_TutorialSystemComponent_C_TryDisplayNextTutorialHint::CallFunc_Create_ReturnValue' has a wrong offset!");
