#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_UINavigationComponent

#include "Basic.hpp"

#include "FNavigationGridCreationInfo_structs.hpp"
#include "EUINavigationDirection_structs.hpp"
#include "Engine_structs.hpp"
#include "EUINavigationLayer_structs.hpp"
#include "EInputAction_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FUINavigationNode_structs.hpp"
#include "EFaceActions_structs.hpp"


namespace SDK::Params
{

// Function BP_UINavigationComponent.BP_UINavigationComponent_C.BP_UINavigationComponent_AutoGenFunc
// 0x0048 (0x0048 - 0x0000)
struct BP_UINavigationComponent_C_BP_UINavigationComponent_AutoGenFunc final
{
public:
	class UBP_InputKeyState_C*                    KeyState;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue_1;             // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E[0x2];                                       // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetEnumeratorValueFromIndex_ReturnValue;  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0034(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UINavigationComponent_C_BP_UINavigationComponent_AutoGenFunc) == 0x000008, "Wrong alignment on BP_UINavigationComponent_C_BP_UINavigationComponent_AutoGenFunc");
static_assert(sizeof(BP_UINavigationComponent_C_BP_UINavigationComponent_AutoGenFunc) == 0x000048, "Wrong size on BP_UINavigationComponent_C_BP_UINavigationComponent_AutoGenFunc");
static_assert(offsetof(BP_UINavigationComponent_C_BP_UINavigationComponent_AutoGenFunc, KeyState) == 0x000000, "Member 'BP_UINavigationComponent_C_BP_UINavigationComponent_AutoGenFunc::KeyState' has a wrong offset!");
static_assert(offsetof(BP_UINavigationComponent_C_BP_UINavigationComponent_AutoGenFunc, CallFunc_MakeLiteralInt_ReturnValue) == 0x000008, "Member 'BP_UINavigationComponent_C_BP_UINavigationComponent_AutoGenFunc::CallFunc_MakeLiteralInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UINavigationComponent_C_BP_UINavigationComponent_AutoGenFunc, Temp_int_Variable) == 0x00000C, "Member 'BP_UINavigationComponent_C_BP_UINavigationComponent_AutoGenFunc::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_UINavigationComponent_C_BP_UINavigationComponent_AutoGenFunc, Temp_int_Variable_1) == 0x000010, "Member 'BP_UINavigationComponent_C_BP_UINavigationComponent_AutoGenFunc::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_UINavigationComponent_C_BP_UINavigationComponent_AutoGenFunc, CallFunc_Conv_IntToByte_ReturnValue) == 0x000014, "Member 'BP_UINavigationComponent_C_BP_UINavigationComponent_AutoGenFunc::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UINavigationComponent_C_BP_UINavigationComponent_AutoGenFunc, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'BP_UINavigationComponent_C_BP_UINavigationComponent_AutoGenFunc::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UINavigationComponent_C_BP_UINavigationComponent_AutoGenFunc, CallFunc_GetValidValue_ReturnValue) == 0x00001C, "Member 'BP_UINavigationComponent_C_BP_UINavigationComponent_AutoGenFunc::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UINavigationComponent_C_BP_UINavigationComponent_AutoGenFunc, CallFunc_Conv_IntToByte_ReturnValue_1) == 0x00001D, "Member 'BP_UINavigationComponent_C_BP_UINavigationComponent_AutoGenFunc::CallFunc_Conv_IntToByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_UINavigationComponent_C_BP_UINavigationComponent_AutoGenFunc, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x000020, "Member 'BP_UINavigationComponent_C_BP_UINavigationComponent_AutoGenFunc::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UINavigationComponent_C_BP_UINavigationComponent_AutoGenFunc, CallFunc_GetEnumeratorValueFromIndex_ReturnValue) == 0x000030, "Member 'BP_UINavigationComponent_C_BP_UINavigationComponent_AutoGenFunc::CallFunc_GetEnumeratorValueFromIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UINavigationComponent_C_BP_UINavigationComponent_AutoGenFunc, CallFunc_Conv_StringToName_ReturnValue) == 0x000034, "Member 'BP_UINavigationComponent_C_BP_UINavigationComponent_AutoGenFunc::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UINavigationComponent_C_BP_UINavigationComponent_AutoGenFunc, CallFunc_Conv_ByteToInt_ReturnValue) == 0x00003C, "Member 'BP_UINavigationComponent_C_BP_UINavigationComponent_AutoGenFunc::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UINavigationComponent_C_BP_UINavigationComponent_AutoGenFunc, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000040, "Member 'BP_UINavigationComponent_C_BP_UINavigationComponent_AutoGenFunc::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UINavigationComponent_C_BP_UINavigationComponent_AutoGenFunc, CallFunc_Less_IntInt_ReturnValue) == 0x000041, "Member 'BP_UINavigationComponent_C_BP_UINavigationComponent_AutoGenFunc::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function BP_UINavigationComponent.BP_UINavigationComponent_C.GetInputActionUICallback
// 0x00F8 (0x00F8 - 0x0000)
struct BP_UINavigationComponent_C_GetInputActionUICallback final
{
public:
	EInputAction                                  InputAction;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             ReturnValue;                                       // 0x0004(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0038(0x0010)()
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0050(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0098(0x0010)(ReferenceParm)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00B0(0x0010)()
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x3];                                       // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x00C4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x00D4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x00E4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UINavigationComponent_C_GetInputActionUICallback) == 0x000008, "Wrong alignment on BP_UINavigationComponent_C_GetInputActionUICallback");
static_assert(sizeof(BP_UINavigationComponent_C_GetInputActionUICallback) == 0x0000F8, "Wrong size on BP_UINavigationComponent_C_GetInputActionUICallback");
static_assert(offsetof(BP_UINavigationComponent_C_GetInputActionUICallback, InputAction) == 0x000000, "Member 'BP_UINavigationComponent_C_GetInputActionUICallback::InputAction' has a wrong offset!");
static_assert(offsetof(BP_UINavigationComponent_C_GetInputActionUICallback, ReturnValue) == 0x000004, "Member 'BP_UINavigationComponent_C_GetInputActionUICallback::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UINavigationComponent_C_GetInputActionUICallback, K2Node_CreateDelegate_OutputDelegate) == 0x000014, "Member 'BP_UINavigationComponent_C_GetInputActionUICallback::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_UINavigationComponent_C_GetInputActionUICallback, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x000028, "Member 'BP_UINavigationComponent_C_GetInputActionUICallback::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UINavigationComponent_C_GetInputActionUICallback, CallFunc_Conv_StringToText_ReturnValue) == 0x000038, "Member 'BP_UINavigationComponent_C_GetInputActionUICallback::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UINavigationComponent_C_GetInputActionUICallback, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000048, "Member 'BP_UINavigationComponent_C_GetInputActionUICallback::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UINavigationComponent_C_GetInputActionUICallback, K2Node_MakeStruct_FormatArgumentData) == 0x000050, "Member 'BP_UINavigationComponent_C_GetInputActionUICallback::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_UINavigationComponent_C_GetInputActionUICallback, K2Node_MakeArray_Array) == 0x000098, "Member 'BP_UINavigationComponent_C_GetInputActionUICallback::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_UINavigationComponent_C_GetInputActionUICallback, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x0000A8, "Member 'BP_UINavigationComponent_C_GetInputActionUICallback::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_UINavigationComponent_C_GetInputActionUICallback, CallFunc_Format_ReturnValue) == 0x0000B0, "Member 'BP_UINavigationComponent_C_GetInputActionUICallback::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UINavigationComponent_C_GetInputActionUICallback, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x0000C0, "Member 'BP_UINavigationComponent_C_GetInputActionUICallback::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_UINavigationComponent_C_GetInputActionUICallback, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000C4, "Member 'BP_UINavigationComponent_C_GetInputActionUICallback::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_UINavigationComponent_C_GetInputActionUICallback, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000D4, "Member 'BP_UINavigationComponent_C_GetInputActionUICallback::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_UINavigationComponent_C_GetInputActionUICallback, K2Node_CreateDelegate_OutputDelegate_3) == 0x0000E4, "Member 'BP_UINavigationComponent_C_GetInputActionUICallback::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");

// Function BP_UINavigationComponent.BP_UINavigationComponent_C.Has Any Input Action From List
// 0x0068 (0x0068 - 0x0000)
struct BP_UINavigationComponent_C_Has_Any_Input_Action_From_List final
{
public:
	TScriptInterface<class IBPI_UINavigationElement_C> Element;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Return_Value;                                      // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInputAction                                  ArrayElement;                                      // 0x0011(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TScriptInterface<class IBPI_UINavigationElement_C>> K2Node_MakeArray_Array;               // 0x0018(0x0010)(ConstParm, ReferenceParm)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EInputAction>                          CallFunc_Map_Keys_Keys;                            // 0x0038(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInputAction                                  CallFunc_Array_Get_Item;                           // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E[0x2];                                       // 0x004E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_UINavigationElement_C> CallFunc_Map_Find_Value;                      // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UINavigationComponent_C_Has_Any_Input_Action_From_List) == 0x000008, "Wrong alignment on BP_UINavigationComponent_C_Has_Any_Input_Action_From_List");
static_assert(sizeof(BP_UINavigationComponent_C_Has_Any_Input_Action_From_List) == 0x000068, "Wrong size on BP_UINavigationComponent_C_Has_Any_Input_Action_From_List");
static_assert(offsetof(BP_UINavigationComponent_C_Has_Any_Input_Action_From_List, Element) == 0x000000, "Member 'BP_UINavigationComponent_C_Has_Any_Input_Action_From_List::Element' has a wrong offset!");
static_assert(offsetof(BP_UINavigationComponent_C_Has_Any_Input_Action_From_List, Return_Value) == 0x000010, "Member 'BP_UINavigationComponent_C_Has_Any_Input_Action_From_List::Return_Value' has a wrong offset!");
static_assert(offsetof(BP_UINavigationComponent_C_Has_Any_Input_Action_From_List, ArrayElement) == 0x000011, "Member 'BP_UINavigationComponent_C_Has_Any_Input_Action_From_List::ArrayElement' has a wrong offset!");
static_assert(offsetof(BP_UINavigationComponent_C_Has_Any_Input_Action_From_List, K2Node_MakeArray_Array) == 0x000018, "Member 'BP_UINavigationComponent_C_Has_Any_Input_Action_From_List::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_UINavigationComponent_C_Has_Any_Input_Action_From_List, Temp_int_Array_Index_Variable) == 0x000028, "Member 'BP_UINavigationComponent_C_Has_Any_Input_Action_From_List::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_UINavigationComponent_C_Has_Any_Input_Action_From_List, Temp_int_Loop_Counter_Variable) == 0x00002C, "Member 'BP_UINavigationComponent_C_Has_Any_Input_Action_From_List::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_UINavigationComponent_C_Has_Any_Input_Action_From_List, CallFunc_Add_IntInt_ReturnValue) == 0x000030, "Member 'BP_UINavigationComponent_C_Has_Any_Input_Action_From_List::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UINavigationComponent_C_Has_Any_Input_Action_From_List, CallFunc_Map_Keys_Keys) == 0x000038, "Member 'BP_UINavigationComponent_C_Has_Any_Input_Action_From_List::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(BP_UINavigationComponent_C_Has_Any_Input_Action_From_List, CallFunc_Array_Length_ReturnValue) == 0x000048, "Member 'BP_UINavigationComponent_C_Has_Any_Input_Action_From_List::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UINavigationComponent_C_Has_Any_Input_Action_From_List, CallFunc_Array_Get_Item) == 0x00004C, "Member 'BP_UINavigationComponent_C_Has_Any_Input_Action_From_List::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_UINavigationComponent_C_Has_Any_Input_Action_From_List, CallFunc_Less_IntInt_ReturnValue) == 0x00004D, "Member 'BP_UINavigationComponent_C_Has_Any_Input_Action_From_List::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UINavigationComponent_C_Has_Any_Input_Action_From_List, CallFunc_Map_Find_Value) == 0x000050, "Member 'BP_UINavigationComponent_C_Has_Any_Input_Action_From_List::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BP_UINavigationComponent_C_Has_Any_Input_Action_From_List, CallFunc_Map_Find_ReturnValue) == 0x000060, "Member 'BP_UINavigationComponent_C_Has_Any_Input_Action_From_List::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UINavigationComponent_C_Has_Any_Input_Action_From_List, CallFunc_Array_Contains_ReturnValue) == 0x000061, "Member 'BP_UINavigationComponent_C_Has_Any_Input_Action_From_List::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");

// Function BP_UINavigationComponent.BP_UINavigationComponent_C.UnregisterInputAction
// 0x01A0 (0x01A0 - 0x0000)
struct BP_UINavigationComponent_C_UnregisterInputAction final
{
public:
	TScriptInterface<class IBPI_UINavigationElement_C> Element;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_Get_Tied_Object_From_Interface_Object;    // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_GetTiedObject_Object;                     // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_ObjectToText_ReturnValue;            // 0x0020(0x0010)()
	bool                                          CallFunc_Has_Any_Input_Action_From_List_Return_Value; // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInputAction                                  CallFunc_Has_Any_Input_Action_From_List_ArrayElement; // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0038(0x0048)(HasGetValueTypeHash)
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Remove_ReturnValue;                   // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0098(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00A8(0x0048)(HasGetValueTypeHash)
	class UObject*                                CallFunc_Get_Tied_Object_From_Interface_Object_1;  // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00F8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Conv_ObjectToText_ReturnValue_1;          // 0x0108(0x0010)()
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0118(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0128(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0170(0x0010)(ReferenceParm)
	class UBP_InputManager_C*                     CallFunc_GetInputManager_InputManager;             // 0x0180(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0188(0x0010)()
	bool                                          CallFunc_IsPackagedBuild_ReturnValue;              // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UINavigationComponent_C_UnregisterInputAction) == 0x000008, "Wrong alignment on BP_UINavigationComponent_C_UnregisterInputAction");
static_assert(sizeof(BP_UINavigationComponent_C_UnregisterInputAction) == 0x0001A0, "Wrong size on BP_UINavigationComponent_C_UnregisterInputAction");
static_assert(offsetof(BP_UINavigationComponent_C_UnregisterInputAction, Element) == 0x000000, "Member 'BP_UINavigationComponent_C_UnregisterInputAction::Element' has a wrong offset!");
static_assert(offsetof(BP_UINavigationComponent_C_UnregisterInputAction, CallFunc_Get_Tied_Object_From_Interface_Object) == 0x000010, "Member 'BP_UINavigationComponent_C_UnregisterInputAction::CallFunc_Get_Tied_Object_From_Interface_Object' has a wrong offset!");
static_assert(offsetof(BP_UINavigationComponent_C_UnregisterInputAction, CallFunc_GetTiedObject_Object) == 0x000018, "Member 'BP_UINavigationComponent_C_UnregisterInputAction::CallFunc_GetTiedObject_Object' has a wrong offset!");
static_assert(offsetof(BP_UINavigationComponent_C_UnregisterInputAction, CallFunc_Conv_ObjectToText_ReturnValue) == 0x000020, "Member 'BP_UINavigationComponent_C_UnregisterInputAction::CallFunc_Conv_ObjectToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UINavigationComponent_C_UnregisterInputAction, CallFunc_Has_Any_Input_Action_From_List_Return_Value) == 0x000030, "Member 'BP_UINavigationComponent_C_UnregisterInputAction::CallFunc_Has_Any_Input_Action_From_List_Return_Value' has a wrong offset!");
static_assert(offsetof(BP_UINavigationComponent_C_UnregisterInputAction, CallFunc_Has_Any_Input_Action_From_List_ArrayElement) == 0x000031, "Member 'BP_UINavigationComponent_C_UnregisterInputAction::CallFunc_Has_Any_Input_Action_From_List_ArrayElement' has a wrong offset!");
static_assert(offsetof(BP_UINavigationComponent_C_UnregisterInputAction, K2Node_MakeStruct_FormatArgumentData) == 0x000038, "Member 'BP_UINavigationComponent_C_UnregisterInputAction::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_UINavigationComponent_C_UnregisterInputAction, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x000080, "Member 'BP_UINavigationComponent_C_UnregisterInputAction::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UINavigationComponent_C_UnregisterInputAction, CallFunc_Map_Remove_ReturnValue) == 0x000090, "Member 'BP_UINavigationComponent_C_UnregisterInputAction::CallFunc_Map_Remove_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UINavigationComponent_C_UnregisterInputAction, CallFunc_Conv_StringToText_ReturnValue) == 0x000098, "Member 'BP_UINavigationComponent_C_UnregisterInputAction::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UINavigationComponent_C_UnregisterInputAction, K2Node_MakeStruct_FormatArgumentData_1) == 0x0000A8, "Member 'BP_UINavigationComponent_C_UnregisterInputAction::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BP_UINavigationComponent_C_UnregisterInputAction, CallFunc_Get_Tied_Object_From_Interface_Object_1) == 0x0000F0, "Member 'BP_UINavigationComponent_C_UnregisterInputAction::CallFunc_Get_Tied_Object_From_Interface_Object_1' has a wrong offset!");
static_assert(offsetof(BP_UINavigationComponent_C_UnregisterInputAction, K2Node_MakeArray_Array) == 0x0000F8, "Member 'BP_UINavigationComponent_C_UnregisterInputAction::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_UINavigationComponent_C_UnregisterInputAction, CallFunc_Conv_ObjectToText_ReturnValue_1) == 0x000108, "Member 'BP_UINavigationComponent_C_UnregisterInputAction::CallFunc_Conv_ObjectToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_UINavigationComponent_C_UnregisterInputAction, CallFunc_Format_ReturnValue) == 0x000118, "Member 'BP_UINavigationComponent_C_UnregisterInputAction::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UINavigationComponent_C_UnregisterInputAction, K2Node_MakeStruct_FormatArgumentData_2) == 0x000128, "Member 'BP_UINavigationComponent_C_UnregisterInputAction::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(BP_UINavigationComponent_C_UnregisterInputAction, K2Node_MakeArray_Array_1) == 0x000170, "Member 'BP_UINavigationComponent_C_UnregisterInputAction::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BP_UINavigationComponent_C_UnregisterInputAction, CallFunc_GetInputManager_InputManager) == 0x000180, "Member 'BP_UINavigationComponent_C_UnregisterInputAction::CallFunc_GetInputManager_InputManager' has a wrong offset!");
static_assert(offsetof(BP_UINavigationComponent_C_UnregisterInputAction, CallFunc_Format_ReturnValue_1) == 0x000188, "Member 'BP_UINavigationComponent_C_UnregisterInputAction::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_UINavigationComponent_C_UnregisterInputAction, CallFunc_IsPackagedBuild_ReturnValue) == 0x000198, "Member 'BP_UINavigationComponent_C_UnregisterInputAction::CallFunc_IsPackagedBuild_ReturnValue' has a wrong offset!");

// Function BP_UINavigationComponent.BP_UINavigationComponent_C.OnElementAction
// 0x0040 (0x0040 - 0x0000)
struct BP_UINavigationComponent_C_OnElementAction final
{
public:
	TScriptInterface<class IBPI_UINavigationElement_C> InputPin;                                     // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_InputManager_C*                     CallFunc_GetInputManager_InputManager;             // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_UINavigationElement_C> Temp_wildcard_Variable;                       // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UINavigationComponent_C_OnElementAction) == 0x000008, "Wrong alignment on BP_UINavigationComponent_C_OnElementAction");
static_assert(sizeof(BP_UINavigationComponent_C_OnElementAction) == 0x000040, "Wrong size on BP_UINavigationComponent_C_OnElementAction");
static_assert(offsetof(BP_UINavigationComponent_C_OnElementAction, InputPin) == 0x000000, "Member 'BP_UINavigationComponent_C_OnElementAction::InputPin' has a wrong offset!");
static_assert(offsetof(BP_UINavigationComponent_C_OnElementAction, CallFunc_GetInputManager_InputManager) == 0x000010, "Member 'BP_UINavigationComponent_C_OnElementAction::CallFunc_GetInputManager_InputManager' has a wrong offset!");
static_assert(offsetof(BP_UINavigationComponent_C_OnElementAction, CallFunc_Not_PreBool_ReturnValue) == 0x000018, "Member 'BP_UINavigationComponent_C_OnElementAction::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UINavigationComponent_C_OnElementAction, Temp_wildcard_Variable) == 0x000020, "Member 'BP_UINavigationComponent_C_OnElementAction::Temp_wildcard_Variable' has a wrong offset!");
static_assert(offsetof(BP_UINavigationComponent_C_OnElementAction, CallFunc_Array_RemoveItem_ReturnValue) == 0x000030, "Member 'BP_UINavigationComponent_C_OnElementAction::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UINavigationComponent_C_OnElementAction, CallFunc_Array_Contains_ReturnValue) == 0x000031, "Member 'BP_UINavigationComponent_C_OnElementAction::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UINavigationComponent_C_OnElementAction, CallFunc_Not_PreBool_ReturnValue_1) == 0x000032, "Member 'BP_UINavigationComponent_C_OnElementAction::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_UINavigationComponent_C_OnElementAction, CallFunc_BooleanOR_ReturnValue) == 0x000033, "Member 'BP_UINavigationComponent_C_OnElementAction::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UINavigationComponent_C_OnElementAction, CallFunc_Array_Length_ReturnValue) == 0x000034, "Member 'BP_UINavigationComponent_C_OnElementAction::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UINavigationComponent_C_OnElementAction, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000038, "Member 'BP_UINavigationComponent_C_OnElementAction::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UINavigationComponent_C_OnElementAction, CallFunc_BooleanOR_ReturnValue_1) == 0x000039, "Member 'BP_UINavigationComponent_C_OnElementAction::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");

// Function BP_UINavigationComponent.BP_UINavigationComponent_C.StopForceNavigationToElement
// 0x0008 (0x0008 - 0x0000)
struct BP_UINavigationComponent_C_StopForceNavigationToElement final
{
public:
	class UBP_InputManager_C*                     CallFunc_GetInputManager_InputManager;             // 0x0000(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UINavigationComponent_C_StopForceNavigationToElement) == 0x000008, "Wrong alignment on BP_UINavigationComponent_C_StopForceNavigationToElement");
static_assert(sizeof(BP_UINavigationComponent_C_StopForceNavigationToElement) == 0x000008, "Wrong size on BP_UINavigationComponent_C_StopForceNavigationToElement");
static_assert(offsetof(BP_UINavigationComponent_C_StopForceNavigationToElement, CallFunc_GetInputManager_InputManager) == 0x000000, "Member 'BP_UINavigationComponent_C_StopForceNavigationToElement::CallFunc_GetInputManager_InputManager' has a wrong offset!");

// Function BP_UINavigationComponent.BP_UINavigationComponent_C.RegisterInputAction
// 0x02B0 (0x02B0 - 0x0000)
struct BP_UINavigationComponent_C_RegisterInputAction final
{
public:
	EInputAction                                  InputAction;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_UINavigationElement_C> Element;                                      // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_Get_Tied_Object_From_Interface_Object;    // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_DynamicCast_AsObject;                       // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_ObjectToText_ReturnValue;            // 0x0030(0x0010)()
	class FText                                   CallFunc_Conv_ObjectToText_ReturnValue_1;          // 0x0040(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0050(0x0048)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0098(0x0048)(HasGetValueTypeHash)
	class UObject*                                CallFunc_GetTiedObject_Object;                     // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00E8(0x0010)(ReferenceParm)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0100(0x0010)()
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0110(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0120(0x0010)()
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_1; // 0x0130(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0140(0x0048)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0188(0x0010)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0198(0x0010)(ReferenceParm)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x01A8(0x0048)(HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x01F0(0x0010)()
	TDelegate<void(class UBP_InputKeyState_C* KeyState)> K2Node_CreateDelegate_OutputDelegate;       // 0x0200(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_InputManager_C*                     CallFunc_GetInputManager_InputManager;             // 0x0210(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UINavigationElement_C> CallFunc_Map_Find_Value;                      // 0x0218(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_229[0x7];                                      // 0x0229(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Get_Tied_Object_From_Interface_Object_1;  // 0x0230(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_ObjectToText_ReturnValue_2;          // 0x0238(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_4;            // 0x0248(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_2;                          // 0x0290(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_2;                     // 0x02A0(0x0010)()
};
static_assert(alignof(BP_UINavigationComponent_C_RegisterInputAction) == 0x000008, "Wrong alignment on BP_UINavigationComponent_C_RegisterInputAction");
static_assert(sizeof(BP_UINavigationComponent_C_RegisterInputAction) == 0x0002B0, "Wrong size on BP_UINavigationComponent_C_RegisterInputAction");
static_assert(offsetof(BP_UINavigationComponent_C_RegisterInputAction, InputAction) == 0x000000, "Member 'BP_UINavigationComponent_C_RegisterInputAction::InputAction' has a wrong offset!");
static_assert(offsetof(BP_UINavigationComponent_C_RegisterInputAction, Element) == 0x000008, "Member 'BP_UINavigationComponent_C_RegisterInputAction::Element' has a wrong offset!");
static_assert(offsetof(BP_UINavigationComponent_C_RegisterInputAction, CallFunc_Get_Tied_Object_From_Interface_Object) == 0x000018, "Member 'BP_UINavigationComponent_C_RegisterInputAction::CallFunc_Get_Tied_Object_From_Interface_Object' has a wrong offset!");
static_assert(offsetof(BP_UINavigationComponent_C_RegisterInputAction, K2Node_DynamicCast_AsObject) == 0x000020, "Member 'BP_UINavigationComponent_C_RegisterInputAction::K2Node_DynamicCast_AsObject' has a wrong offset!");
static_assert(offsetof(BP_UINavigationComponent_C_RegisterInputAction, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BP_UINavigationComponent_C_RegisterInputAction::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_UINavigationComponent_C_RegisterInputAction, CallFunc_Conv_ObjectToText_ReturnValue) == 0x000030, "Member 'BP_UINavigationComponent_C_RegisterInputAction::CallFunc_Conv_ObjectToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UINavigationComponent_C_RegisterInputAction, CallFunc_Conv_ObjectToText_ReturnValue_1) == 0x000040, "Member 'BP_UINavigationComponent_C_RegisterInputAction::CallFunc_Conv_ObjectToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_UINavigationComponent_C_RegisterInputAction, K2Node_MakeStruct_FormatArgumentData) == 0x000050, "Member 'BP_UINavigationComponent_C_RegisterInputAction::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_UINavigationComponent_C_RegisterInputAction, K2Node_MakeStruct_FormatArgumentData_1) == 0x000098, "Member 'BP_UINavigationComponent_C_RegisterInputAction::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BP_UINavigationComponent_C_RegisterInputAction, CallFunc_GetTiedObject_Object) == 0x0000E0, "Member 'BP_UINavigationComponent_C_RegisterInputAction::CallFunc_GetTiedObject_Object' has a wrong offset!");
static_assert(offsetof(BP_UINavigationComponent_C_RegisterInputAction, K2Node_MakeArray_Array) == 0x0000E8, "Member 'BP_UINavigationComponent_C_RegisterInputAction::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_UINavigationComponent_C_RegisterInputAction, CallFunc_IsValid_ReturnValue) == 0x0000F8, "Member 'BP_UINavigationComponent_C_RegisterInputAction::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UINavigationComponent_C_RegisterInputAction, CallFunc_Format_ReturnValue) == 0x000100, "Member 'BP_UINavigationComponent_C_RegisterInputAction::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UINavigationComponent_C_RegisterInputAction, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x000110, "Member 'BP_UINavigationComponent_C_RegisterInputAction::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UINavigationComponent_C_RegisterInputAction, CallFunc_Conv_StringToText_ReturnValue) == 0x000120, "Member 'BP_UINavigationComponent_C_RegisterInputAction::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UINavigationComponent_C_RegisterInputAction, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_1) == 0x000130, "Member 'BP_UINavigationComponent_C_RegisterInputAction::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_UINavigationComponent_C_RegisterInputAction, K2Node_MakeStruct_FormatArgumentData_2) == 0x000140, "Member 'BP_UINavigationComponent_C_RegisterInputAction::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(BP_UINavigationComponent_C_RegisterInputAction, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000188, "Member 'BP_UINavigationComponent_C_RegisterInputAction::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_UINavigationComponent_C_RegisterInputAction, K2Node_MakeArray_Array_1) == 0x000198, "Member 'BP_UINavigationComponent_C_RegisterInputAction::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BP_UINavigationComponent_C_RegisterInputAction, K2Node_MakeStruct_FormatArgumentData_3) == 0x0001A8, "Member 'BP_UINavigationComponent_C_RegisterInputAction::K2Node_MakeStruct_FormatArgumentData_3' has a wrong offset!");
static_assert(offsetof(BP_UINavigationComponent_C_RegisterInputAction, CallFunc_Format_ReturnValue_1) == 0x0001F0, "Member 'BP_UINavigationComponent_C_RegisterInputAction::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_UINavigationComponent_C_RegisterInputAction, K2Node_CreateDelegate_OutputDelegate) == 0x000200, "Member 'BP_UINavigationComponent_C_RegisterInputAction::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_UINavigationComponent_C_RegisterInputAction, CallFunc_GetInputManager_InputManager) == 0x000210, "Member 'BP_UINavigationComponent_C_RegisterInputAction::CallFunc_GetInputManager_InputManager' has a wrong offset!");
static_assert(offsetof(BP_UINavigationComponent_C_RegisterInputAction, CallFunc_Map_Find_Value) == 0x000218, "Member 'BP_UINavigationComponent_C_RegisterInputAction::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BP_UINavigationComponent_C_RegisterInputAction, CallFunc_Map_Find_ReturnValue) == 0x000228, "Member 'BP_UINavigationComponent_C_RegisterInputAction::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UINavigationComponent_C_RegisterInputAction, CallFunc_Get_Tied_Object_From_Interface_Object_1) == 0x000230, "Member 'BP_UINavigationComponent_C_RegisterInputAction::CallFunc_Get_Tied_Object_From_Interface_Object_1' has a wrong offset!");
static_assert(offsetof(BP_UINavigationComponent_C_RegisterInputAction, CallFunc_Conv_ObjectToText_ReturnValue_2) == 0x000238, "Member 'BP_UINavigationComponent_C_RegisterInputAction::CallFunc_Conv_ObjectToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_UINavigationComponent_C_RegisterInputAction, K2Node_MakeStruct_FormatArgumentData_4) == 0x000248, "Member 'BP_UINavigationComponent_C_RegisterInputAction::K2Node_MakeStruct_FormatArgumentData_4' has a wrong offset!");
static_assert(offsetof(BP_UINavigationComponent_C_RegisterInputAction, K2Node_MakeArray_Array_2) == 0x000290, "Member 'BP_UINavigationComponent_C_RegisterInputAction::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(BP_UINavigationComponent_C_RegisterInputAction, CallFunc_Format_ReturnValue_2) == 0x0002A0, "Member 'BP_UINavigationComponent_C_RegisterInputAction::CallFunc_Format_ReturnValue_2' has a wrong offset!");

// Function BP_UINavigationComponent.BP_UINavigationComponent_C.ForceNavigationToElement
// 0x0038 (0x0038 - 0x0000)
struct BP_UINavigationComponent_C_ForceNavigationToElement final
{
public:
	TScriptInterface<class IBPI_UINavigationElement_C> Element;                                      // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(TScriptInterface<class IBPI_UINavigationElement_C> NavigationElement)> OnActivated; // 0x0010(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	bool                                          RestrictInput;                                     // 0x0020(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HijackInteraction_0;                               // 0x0021(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_InputManager_C*                     CallFunc_GetInputManager_InputManager;             // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UINavigationComponent_C_ForceNavigationToElement) == 0x000008, "Wrong alignment on BP_UINavigationComponent_C_ForceNavigationToElement");
static_assert(sizeof(BP_UINavigationComponent_C_ForceNavigationToElement) == 0x000038, "Wrong size on BP_UINavigationComponent_C_ForceNavigationToElement");
static_assert(offsetof(BP_UINavigationComponent_C_ForceNavigationToElement, Element) == 0x000000, "Member 'BP_UINavigationComponent_C_ForceNavigationToElement::Element' has a wrong offset!");
static_assert(offsetof(BP_UINavigationComponent_C_ForceNavigationToElement, OnActivated) == 0x000010, "Member 'BP_UINavigationComponent_C_ForceNavigationToElement::OnActivated' has a wrong offset!");
static_assert(offsetof(BP_UINavigationComponent_C_ForceNavigationToElement, RestrictInput) == 0x000020, "Member 'BP_UINavigationComponent_C_ForceNavigationToElement::RestrictInput' has a wrong offset!");
static_assert(offsetof(BP_UINavigationComponent_C_ForceNavigationToElement, HijackInteraction_0) == 0x000021, "Member 'BP_UINavigationComponent_C_ForceNavigationToElement::HijackInteraction_0' has a wrong offset!");
static_assert(offsetof(BP_UINavigationComponent_C_ForceNavigationToElement, CallFunc_GetInputManager_InputManager) == 0x000028, "Member 'BP_UINavigationComponent_C_ForceNavigationToElement::CallFunc_GetInputManager_InputManager' has a wrong offset!");
static_assert(offsetof(BP_UINavigationComponent_C_ForceNavigationToElement, CallFunc_Array_Add_ReturnValue) == 0x000030, "Member 'BP_UINavigationComponent_C_ForceNavigationToElement::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function BP_UINavigationComponent.BP_UINavigationComponent_C.CreateInputActor
// 0x00B0 (0x00B0 - 0x0000)
struct BP_UINavigationComponent_C_CreateInputActor final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EUINavigationLayer>                    CallFunc_Map_Keys_Keys;                            // 0x0008(0x0010)(ReferenceParm)
	EUINavigationLayer                            CallFunc_Array_Get_Item;                           // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Map_Find_Value;                           // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32[0x2];                                       // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0040(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_UINavigationInputActor_C*           CallFunc_FinishSpawningActor_ReturnValue;          // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UINavigationComponent_C_CreateInputActor) == 0x000010, "Wrong alignment on BP_UINavigationComponent_C_CreateInputActor");
static_assert(sizeof(BP_UINavigationComponent_C_CreateInputActor) == 0x0000B0, "Wrong size on BP_UINavigationComponent_C_CreateInputActor");
static_assert(offsetof(BP_UINavigationComponent_C_CreateInputActor, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BP_UINavigationComponent_C_CreateInputActor::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_UINavigationComponent_C_CreateInputActor, CallFunc_Map_Keys_Keys) == 0x000008, "Member 'BP_UINavigationComponent_C_CreateInputActor::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(BP_UINavigationComponent_C_CreateInputActor, CallFunc_Array_Get_Item) == 0x000018, "Member 'BP_UINavigationComponent_C_CreateInputActor::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_UINavigationComponent_C_CreateInputActor, CallFunc_Array_Length_ReturnValue) == 0x00001C, "Member 'BP_UINavigationComponent_C_CreateInputActor::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UINavigationComponent_C_CreateInputActor, K2Node_SwitchEnum_CmpSuccess) == 0x000020, "Member 'BP_UINavigationComponent_C_CreateInputActor::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_UINavigationComponent_C_CreateInputActor, CallFunc_Map_Find_Value) == 0x000024, "Member 'BP_UINavigationComponent_C_CreateInputActor::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BP_UINavigationComponent_C_CreateInputActor, CallFunc_Map_Find_ReturnValue) == 0x000028, "Member 'BP_UINavigationComponent_C_CreateInputActor::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UINavigationComponent_C_CreateInputActor, Temp_int_Loop_Counter_Variable) == 0x00002C, "Member 'BP_UINavigationComponent_C_CreateInputActor::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_UINavigationComponent_C_CreateInputActor, CallFunc_Greater_IntInt_ReturnValue) == 0x000030, "Member 'BP_UINavigationComponent_C_CreateInputActor::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UINavigationComponent_C_CreateInputActor, CallFunc_Less_IntInt_ReturnValue) == 0x000031, "Member 'BP_UINavigationComponent_C_CreateInputActor::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UINavigationComponent_C_CreateInputActor, CallFunc_Add_IntInt_ReturnValue) == 0x000034, "Member 'BP_UINavigationComponent_C_CreateInputActor::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UINavigationComponent_C_CreateInputActor, CallFunc_MakeTransform_ReturnValue) == 0x000040, "Member 'BP_UINavigationComponent_C_CreateInputActor::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UINavigationComponent_C_CreateInputActor, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0000A0, "Member 'BP_UINavigationComponent_C_CreateInputActor::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UINavigationComponent_C_CreateInputActor, CallFunc_FinishSpawningActor_ReturnValue) == 0x0000A8, "Member 'BP_UINavigationComponent_C_CreateInputActor::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");

// Function BP_UINavigationComponent.BP_UINavigationComponent_C.HighlightWidget
// 0x0020 (0x0020 - 0x0000)
