#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_UINavigationGenericElement_PanelWidget

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_UINavigationGenericElement_PanelWidget.BP_UINavigationGenericElement_PanelWidget_C.ExecuteUbergraph_BP_UINavigationGenericElement_PanelWidget
// 0x0028 (0x0028 - 0x0000)
struct BP_UINavigationGenericElement_PanelWidget_C_ExecuteUbergraph_BP_UINavigationGenericElement_PanelWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0008(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	const class UBP_UINavigationFocusEvent_C*     K2Node_Event_FocusEventBP;                         // 0x0020(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UINavigationGenericElement_PanelWidget_C_ExecuteUbergraph_BP_UINavigationGenericElement_PanelWidget) == 0x000008, "Wrong alignment on BP_UINavigationGenericElement_PanelWidget_C_ExecuteUbergraph_BP_UINavigationGenericElement_PanelWidget");
static_assert(sizeof(BP_UINavigationGenericElement_PanelWidget_C_ExecuteUbergraph_BP_UINavigationGenericElement_PanelWidget) == 0x000028, "Wrong size on BP_UINavigationGenericElement_PanelWidget_C_ExecuteUbergraph_BP_UINavigationGenericElement_PanelWidget");
static_assert(offsetof(BP_UINavigationGenericElement_PanelWidget_C_ExecuteUbergraph_BP_UINavigationGenericElement_PanelWidget, EntryPoint) == 0x000000, "Member 'BP_UINavigationGenericElement_PanelWidget_C_ExecuteUbergraph_BP_UINavigationGenericElement_PanelWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_UINavigationGenericElement_PanelWidget_C_ExecuteUbergraph_BP_UINavigationGenericElement_PanelWidget, CallFunc_GetAllChildren_ReturnValue) == 0x000008, "Member 'BP_UINavigationGenericElement_PanelWidget_C_ExecuteUbergraph_BP_UINavigationGenericElement_PanelWidget::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UINavigationGenericElement_PanelWidget_C_ExecuteUbergraph_BP_UINavigationGenericElement_PanelWidget, CallFunc_Array_Get_Item) == 0x000018, "Member 'BP_UINavigationGenericElement_PanelWidget_C_ExecuteUbergraph_BP_UINavigationGenericElement_PanelWidget::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_UINavigationGenericElement_PanelWidget_C_ExecuteUbergraph_BP_UINavigationGenericElement_PanelWidget, K2Node_Event_FocusEventBP) == 0x000020, "Member 'BP_UINavigationGenericElement_PanelWidget_C_ExecuteUbergraph_BP_UINavigationGenericElement_PanelWidget::K2Node_Event_FocusEventBP' has a wrong offset!");

// Function BP_UINavigationGenericElement_PanelWidget.BP_UINavigationGenericElement_PanelWidget_C.GetTiedObject
// 0x0008 (0x0008 - 0x0000)
struct BP_UINavigationGenericElement_PanelWidget_C_GetTiedObject final
{
public:
	class UObject*                                Object;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UINavigationGenericElement_PanelWidget_C_GetTiedObject) == 0x000008, "Wrong alignment on BP_UINavigationGenericElement_PanelWidget_C_GetTiedObject");
static_assert(sizeof(BP_UINavigationGenericElement_PanelWidget_C_GetTiedObject) == 0x000008, "Wrong size on BP_UINavigationGenericElement_PanelWidget_C_GetTiedObject");
static_assert(offsetof(BP_UINavigationGenericElement_PanelWidget_C_GetTiedObject, Object) == 0x000000, "Member 'BP_UINavigationGenericElement_PanelWidget_C_GetTiedObject::Object' has a wrong offset!");

// Function BP_UINavigationGenericElement_PanelWidget.BP_UINavigationGenericElement_PanelWidget_C.OnUINavigationFocus
// 0x0008 (0x0008 - 0x0000)
struct BP_UINavigationGenericElement_PanelWidget_C_OnUINavigationFocus final
{
public:
	const class UBP_UINavigationFocusEvent_C*     FocusEventBP;                                      // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UINavigationGenericElement_PanelWidget_C_OnUINavigationFocus) == 0x000008, "Wrong alignment on BP_UINavigationGenericElement_PanelWidget_C_OnUINavigationFocus");
static_assert(sizeof(BP_UINavigationGenericElement_PanelWidget_C_OnUINavigationFocus) == 0x000008, "Wrong size on BP_UINavigationGenericElement_PanelWidget_C_OnUINavigationFocus");
static_assert(offsetof(BP_UINavigationGenericElement_PanelWidget_C_OnUINavigationFocus, FocusEventBP) == 0x000000, "Member 'BP_UINavigationGenericElement_PanelWidget_C_OnUINavigationFocus::FocusEventBP' has a wrong offset!");

}

