#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_WeaponSkin

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "EAttackType_structs.hpp"
#include "EPermeateIntensity_structs.hpp"


namespace SDK::Params
{

// Function BP_WeaponSkin.BP_WeaponSkin_C.GetAllTrailsOnWeaponL
// 0x0010 (0x0010 - 0x0000)
struct BP_WeaponSkin_C_GetAllTrailsOnWeaponL final
{
public:
	TArray<class UNiagaraComponent*>              TrailsArrayL;                                      // 0x0000(0x0010)(Parm, OutParm, ContainsInstancedReference)
};
static_assert(alignof(BP_WeaponSkin_C_GetAllTrailsOnWeaponL) == 0x000008, "Wrong alignment on BP_WeaponSkin_C_GetAllTrailsOnWeaponL");
static_assert(sizeof(BP_WeaponSkin_C_GetAllTrailsOnWeaponL) == 0x000010, "Wrong size on BP_WeaponSkin_C_GetAllTrailsOnWeaponL");
static_assert(offsetof(BP_WeaponSkin_C_GetAllTrailsOnWeaponL, TrailsArrayL) == 0x000000, "Member 'BP_WeaponSkin_C_GetAllTrailsOnWeaponL::TrailsArrayL' has a wrong offset!");

// Function BP_WeaponSkin.BP_WeaponSkin_C.GetAllTrailsOnWeaponR
// 0x0010 (0x0010 - 0x0000)
struct BP_WeaponSkin_C_GetAllTrailsOnWeaponR final
{
public:
	TArray<class UNiagaraComponent*>              TrailsArrayR;                                      // 0x0000(0x0010)(Parm, OutParm, ContainsInstancedReference)
};
static_assert(alignof(BP_WeaponSkin_C_GetAllTrailsOnWeaponR) == 0x000008, "Wrong alignment on BP_WeaponSkin_C_GetAllTrailsOnWeaponR");
static_assert(sizeof(BP_WeaponSkin_C_GetAllTrailsOnWeaponR) == 0x000010, "Wrong size on BP_WeaponSkin_C_GetAllTrailsOnWeaponR");
static_assert(offsetof(BP_WeaponSkin_C_GetAllTrailsOnWeaponR, TrailsArrayR) == 0x000000, "Member 'BP_WeaponSkin_C_GetAllTrailsOnWeaponR::TrailsArrayR' has a wrong offset!");

// Function BP_WeaponSkin.BP_WeaponSkin_C.UserConstructionScript
// 0x0050 (0x0050 - 0x0000)
struct BP_WeaponSkin_C_UserConstructionScript final
{
public:
	TArray<class UMeshComponent*>                 Temp_wildcard_Variable;                            // 0x0000(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_EditorValidatePartsGetters_HasErrors;     // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         CallFunc_EditorValidatePartsGetters_Errors;        // 0x0018(0x0010)(ReferenceParm)
	bool                                          CallFunc_IsPackagedBuild_ReturnValue;              // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInPlayMode_ReturnValue;                 // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMeshComponent*>                 CallFunc_GetAllWeaponLParts_MeshComponentL;        // 0x0030(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<class UMeshComponent*>                 CallFunc_GetAllWeaponRParts_MeshComponentR;        // 0x0040(0x0010)(ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(BP_WeaponSkin_C_UserConstructionScript) == 0x000008, "Wrong alignment on BP_WeaponSkin_C_UserConstructionScript");
static_assert(sizeof(BP_WeaponSkin_C_UserConstructionScript) == 0x000050, "Wrong size on BP_WeaponSkin_C_UserConstructionScript");
static_assert(offsetof(BP_WeaponSkin_C_UserConstructionScript, Temp_wildcard_Variable) == 0x000000, "Member 'BP_WeaponSkin_C_UserConstructionScript::Temp_wildcard_Variable' has a wrong offset!");
static_assert(offsetof(BP_WeaponSkin_C_UserConstructionScript, CallFunc_EditorValidatePartsGetters_HasErrors) == 0x000010, "Member 'BP_WeaponSkin_C_UserConstructionScript::CallFunc_EditorValidatePartsGetters_HasErrors' has a wrong offset!");
static_assert(offsetof(BP_WeaponSkin_C_UserConstructionScript, CallFunc_EditorValidatePartsGetters_Errors) == 0x000018, "Member 'BP_WeaponSkin_C_UserConstructionScript::CallFunc_EditorValidatePartsGetters_Errors' has a wrong offset!");
static_assert(offsetof(BP_WeaponSkin_C_UserConstructionScript, CallFunc_IsPackagedBuild_ReturnValue) == 0x000028, "Member 'BP_WeaponSkin_C_UserConstructionScript::CallFunc_IsPackagedBuild_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeaponSkin_C_UserConstructionScript, CallFunc_IsInPlayMode_ReturnValue) == 0x000029, "Member 'BP_WeaponSkin_C_UserConstructionScript::CallFunc_IsInPlayMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeaponSkin_C_UserConstructionScript, CallFunc_GetAllWeaponLParts_MeshComponentL) == 0x000030, "Member 'BP_WeaponSkin_C_UserConstructionScript::CallFunc_GetAllWeaponLParts_MeshComponentL' has a wrong offset!");
static_assert(offsetof(BP_WeaponSkin_C_UserConstructionScript, CallFunc_GetAllWeaponRParts_MeshComponentR) == 0x000040, "Member 'BP_WeaponSkin_C_UserConstructionScript::CallFunc_GetAllWeaponRParts_MeshComponentR' has a wrong offset!");

// Function BP_WeaponSkin.BP_WeaponSkin_C.EditorCheckData
// 0x00A0 (0x00A0 - 0x0000)
struct BP_WeaponSkin_C_EditorCheckData final
{
public:
	bool                                          CallFunc_EditorValidatePartsGetters_HasErrors;     // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         CallFunc_EditorValidatePartsGetters_Errors;        // 0x0008(0x0010)(ReferenceParm)
	class FString                                 CallFunc_JoinStringArray_ReturnValue;              // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0028(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0038(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0080(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Format_ReturnValue;                       // 0x0090(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_WeaponSkin_C_EditorCheckData) == 0x000008, "Wrong alignment on BP_WeaponSkin_C_EditorCheckData");
static_assert(sizeof(BP_WeaponSkin_C_EditorCheckData) == 0x0000A0, "Wrong size on BP_WeaponSkin_C_EditorCheckData");
static_assert(offsetof(BP_WeaponSkin_C_EditorCheckData, CallFunc_EditorValidatePartsGetters_HasErrors) == 0x000000, "Member 'BP_WeaponSkin_C_EditorCheckData::CallFunc_EditorValidatePartsGetters_HasErrors' has a wrong offset!");
static_assert(offsetof(BP_WeaponSkin_C_EditorCheckData, CallFunc_EditorValidatePartsGetters_Errors) == 0x000008, "Member 'BP_WeaponSkin_C_EditorCheckData::CallFunc_EditorValidatePartsGetters_Errors' has a wrong offset!");
static_assert(offsetof(BP_WeaponSkin_C_EditorCheckData, CallFunc_JoinStringArray_ReturnValue) == 0x000018, "Member 'BP_WeaponSkin_C_EditorCheckData::CallFunc_JoinStringArray_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeaponSkin_C_EditorCheckData, CallFunc_Conv_StringToText_ReturnValue) == 0x000028, "Member 'BP_WeaponSkin_C_EditorCheckData::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeaponSkin_C_EditorCheckData, K2Node_MakeStruct_FormatArgumentData) == 0x000038, "Member 'BP_WeaponSkin_C_EditorCheckData::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_WeaponSkin_C_EditorCheckData, K2Node_MakeArray_Array) == 0x000080, "Member 'BP_WeaponSkin_C_EditorCheckData::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_WeaponSkin_C_EditorCheckData, CallFunc_Format_ReturnValue) == 0x000090, "Member 'BP_WeaponSkin_C_EditorCheckData::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function BP_WeaponSkin.BP_WeaponSkin_C.EditorValidatePartsGetters
// 0x01F0 (0x01F0 - 0x0000)
struct BP_WeaponSkin_C_EditorValidatePartsGetters final
{
public:
	bool                                          HasErrors;                                         // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         Errors;                                            // 0x0008(0x0010)(Parm, OutParm)
	TArray<class FString>                         local_errors;                                      // 0x0018(0x0010)(Edit, BlueprintVisible)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMeshComponent*>                 Temp_wildcard_Variable;                            // 0x0038(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UMeshComponent*                         CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0070(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0080(0x0048)(HasGetValueTypeHash)
	ECollisionEnabled                             CallFunc_GetCollisionEnabled_ReturnValue;          // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00D0(0x0010)(ReferenceParm)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Format_ReturnValue;                       // 0x00E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<class FString>                         Temp_wildcard_We_need_a_second_array_to_store_the_result_and_be_able_to_wipe_the_first__buffer__array_Variable; // 0x00F8(0x0010)(ConstParm, ReferenceParm)
	TArray<class FString>                         Temp_wildcard_Temp_buffer_array_Variable;          // 0x0108(0x0010)(ConstParm, ReferenceParm)
	TArray<class UMeshComponent*>                 CallFunc_K2_GetComponentsByClass_ReturnValue;      // 0x0118(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsNotEmpty_ReturnValue;             // 0x012C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12D[0x3];                                      // 0x012D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UNiagaraComponent*>              CallFunc_GetAllTrailsOnWeaponR_TrailsArrayR;       // 0x0130(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<class UNiagaraComponent*>              CallFunc_GetAllTrailsOnWeaponL_TrailsArrayL;       // 0x0140(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_ValidateObjectArray_IsValid;              // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_ValidateObjectArray_ErrorMessage;         // 0x0158(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_ValidateObjectArray_IsValid_1;            // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_ValidateObjectArray_ErrorMessage_1;       // 0x0170(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_2;                  // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0189(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18A[0x6];                                      // 0x018A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMeshComponent*>                 CallFunc_GetAllWeaponRParts_MeshComponentR;        // 0x0190(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_ValidateObjectArray_IsValid_2;            // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A1[0x7];                                      // 0x01A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_ValidateObjectArray_ErrorMessage_2;       // 0x01A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<class UMeshComponent*>                 CallFunc_GetAllWeaponLParts_MeshComponentL;        // 0x01B8(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Add_ReturnValue_3;                  // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ValidateObjectArray_IsValid_3;            // 0x01CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1CD[0x3];                                      // 0x01CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_ValidateObjectArray_ErrorMessage_3;       // 0x01D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E1[0x3];                                      // 0x01E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue_4;                  // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_WeaponSkin_C_EditorValidatePartsGetters) == 0x000008, "Wrong alignment on BP_WeaponSkin_C_EditorValidatePartsGetters");
static_assert(sizeof(BP_WeaponSkin_C_EditorValidatePartsGetters) == 0x0001F0, "Wrong size on BP_WeaponSkin_C_EditorValidatePartsGetters");
static_assert(offsetof(BP_WeaponSkin_C_EditorValidatePartsGetters, HasErrors) == 0x000000, "Member 'BP_WeaponSkin_C_EditorValidatePartsGetters::HasErrors' has a wrong offset!");
static_assert(offsetof(BP_WeaponSkin_C_EditorValidatePartsGetters, Errors) == 0x000008, "Member 'BP_WeaponSkin_C_EditorValidatePartsGetters::Errors' has a wrong offset!");
static_assert(offsetof(BP_WeaponSkin_C_EditorValidatePartsGetters, local_errors) == 0x000018, "Member 'BP_WeaponSkin_C_EditorValidatePartsGetters::local_errors' has a wrong offset!");
static_assert(offsetof(BP_WeaponSkin_C_EditorValidatePartsGetters, Temp_int_Loop_Counter_Variable) == 0x000028, "Member 'BP_WeaponSkin_C_EditorValidatePartsGetters::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_WeaponSkin_C_EditorValidatePartsGetters, CallFunc_Add_IntInt_ReturnValue) == 0x00002C, "Member 'BP_WeaponSkin_C_EditorValidatePartsGetters::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeaponSkin_C_EditorValidatePartsGetters, Temp_int_Array_Index_Variable) == 0x000030, "Member 'BP_WeaponSkin_C_EditorValidatePartsGetters::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_WeaponSkin_C_EditorValidatePartsGetters, Temp_wildcard_Variable) == 0x000038, "Member 'BP_WeaponSkin_C_EditorValidatePartsGetters::Temp_wildcard_Variable' has a wrong offset!");
static_assert(offsetof(BP_WeaponSkin_C_EditorValidatePartsGetters, CallFunc_Array_Get_Item) == 0x000048, "Member 'BP_WeaponSkin_C_EditorValidatePartsGetters::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_WeaponSkin_C_EditorValidatePartsGetters, CallFunc_Array_Length_ReturnValue) == 0x000050, "Member 'BP_WeaponSkin_C_EditorValidatePartsGetters::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeaponSkin_C_EditorValidatePartsGetters, CallFunc_GetDisplayName_ReturnValue) == 0x000058, "Member 'BP_WeaponSkin_C_EditorValidatePartsGetters::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeaponSkin_C_EditorValidatePartsGetters, CallFunc_Less_IntInt_ReturnValue) == 0x000068, "Member 'BP_WeaponSkin_C_EditorValidatePartsGetters::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeaponSkin_C_EditorValidatePartsGetters, CallFunc_Conv_StringToText_ReturnValue) == 0x000070, "Member 'BP_WeaponSkin_C_EditorValidatePartsGetters::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeaponSkin_C_EditorValidatePartsGetters, K2Node_MakeStruct_FormatArgumentData) == 0x000080, "Member 'BP_WeaponSkin_C_EditorValidatePartsGetters::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_WeaponSkin_C_EditorValidatePartsGetters, CallFunc_GetCollisionEnabled_ReturnValue) == 0x0000C8, "Member 'BP_WeaponSkin_C_EditorValidatePartsGetters::CallFunc_GetCollisionEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeaponSkin_C_EditorValidatePartsGetters, K2Node_MakeArray_Array) == 0x0000D0, "Member 'BP_WeaponSkin_C_EditorValidatePartsGetters::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_WeaponSkin_C_EditorValidatePartsGetters, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x0000E0, "Member 'BP_WeaponSkin_C_EditorValidatePartsGetters::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeaponSkin_C_EditorValidatePartsGetters, CallFunc_Format_ReturnValue) == 0x0000E8, "Member 'BP_WeaponSkin_C_EditorValidatePartsGetters::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeaponSkin_C_EditorValidatePartsGetters, Temp_wildcard_We_need_a_second_array_to_store_the_result_and_be_able_to_wipe_the_first__buffer__array_Variable) == 0x0000F8, "Member 'BP_WeaponSkin_C_EditorValidatePartsGetters::Temp_wildcard_We_need_a_second_array_to_store_the_result_and_be_able_to_wipe_the_first__buffer__array_Variable' has a wrong offset!");
static_assert(offsetof(BP_WeaponSkin_C_EditorValidatePartsGetters, Temp_wildcard_Temp_buffer_array_Variable) == 0x000108, "Member 'BP_WeaponSkin_C_EditorValidatePartsGetters::Temp_wildcard_Temp_buffer_array_Variable' has a wrong offset!");
static_assert(offsetof(BP_WeaponSkin_C_EditorValidatePartsGetters, CallFunc_K2_GetComponentsByClass_ReturnValue) == 0x000118, "Member 'BP_WeaponSkin_C_EditorValidatePartsGetters::CallFunc_K2_GetComponentsByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeaponSkin_C_EditorValidatePartsGetters, CallFunc_Array_Add_ReturnValue) == 0x000128, "Member 'BP_WeaponSkin_C_EditorValidatePartsGetters::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeaponSkin_C_EditorValidatePartsGetters, CallFunc_Array_IsNotEmpty_ReturnValue) == 0x00012C, "Member 'BP_WeaponSkin_C_EditorValidatePartsGetters::CallFunc_Array_IsNotEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeaponSkin_C_EditorValidatePartsGetters, CallFunc_GetAllTrailsOnWeaponR_TrailsArrayR) == 0x000130, "Member 'BP_WeaponSkin_C_EditorValidatePartsGetters::CallFunc_GetAllTrailsOnWeaponR_TrailsArrayR' has a wrong offset!");
static_assert(offsetof(BP_WeaponSkin_C_EditorValidatePartsGetters, CallFunc_GetAllTrailsOnWeaponL_TrailsArrayL) == 0x000140, "Member 'BP_WeaponSkin_C_EditorValidatePartsGetters::CallFunc_GetAllTrailsOnWeaponL_TrailsArrayL' has a wrong offset!");
static_assert(offsetof(BP_WeaponSkin_C_EditorValidatePartsGetters, CallFunc_ValidateObjectArray_IsValid) == 0x000150, "Member 'BP_WeaponSkin_C_EditorValidatePartsGetters::CallFunc_ValidateObjectArray_IsValid' has a wrong offset!");
static_assert(offsetof(BP_WeaponSkin_C_EditorValidatePartsGetters, CallFunc_ValidateObjectArray_ErrorMessage) == 0x000158, "Member 'BP_WeaponSkin_C_EditorValidatePartsGetters::CallFunc_ValidateObjectArray_ErrorMessage' has a wrong offset!");
static_assert(offsetof(BP_WeaponSkin_C_EditorValidatePartsGetters, CallFunc_ValidateObjectArray_IsValid_1) == 0x000168, "Member 'BP_WeaponSkin_C_EditorValidatePartsGetters::CallFunc_ValidateObjectArray_IsValid_1' has a wrong offset!");
static_assert(offsetof(BP_WeaponSkin_C_EditorValidatePartsGetters, CallFunc_ValidateObjectArray_ErrorMessage_1) == 0x000170, "Member 'BP_WeaponSkin_C_EditorValidatePartsGetters::CallFunc_ValidateObjectArray_ErrorMessage_1' has a wrong offset!");
static_assert(offsetof(BP_WeaponSkin_C_EditorValidatePartsGetters, CallFunc_Array_Add_ReturnValue_1) == 0x000180, "Member 'BP_WeaponSkin_C_EditorValidatePartsGetters::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WeaponSkin_C_EditorValidatePartsGetters, CallFunc_Array_Add_ReturnValue_2) == 0x000184, "Member 'BP_WeaponSkin_C_EditorValidatePartsGetters::CallFunc_Array_Add_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_WeaponSkin_C_EditorValidatePartsGetters, CallFunc_Not_PreBool_ReturnValue) == 0x000188, "Member 'BP_WeaponSkin_C_EditorValidatePartsGetters::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeaponSkin_C_EditorValidatePartsGetters, CallFunc_Not_PreBool_ReturnValue_1) == 0x000189, "Member 'BP_WeaponSkin_C_EditorValidatePartsGetters::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WeaponSkin_C_EditorValidatePartsGetters, CallFunc_GetAllWeaponRParts_MeshComponentR) == 0x000190, "Member 'BP_WeaponSkin_C_EditorValidatePartsGetters::CallFunc_GetAllWeaponRParts_MeshComponentR' has a wrong offset!");
static_assert(offsetof(BP_WeaponSkin_C_EditorValidatePartsGetters, CallFunc_ValidateObjectArray_IsValid_2) == 0x0001A0, "Member 'BP_WeaponSkin_C_EditorValidatePartsGetters::CallFunc_ValidateObjectArray_IsValid_2' has a wrong offset!");
static_assert(offsetof(BP_WeaponSkin_C_EditorValidatePartsGetters, CallFunc_ValidateObjectArray_ErrorMessage_2) == 0x0001A8, "Member 'BP_WeaponSkin_C_EditorValidatePartsGetters::CallFunc_ValidateObjectArray_ErrorMessage_2' has a wrong offset!");
static_assert(offsetof(BP_WeaponSkin_C_EditorValidatePartsGetters, CallFunc_GetAllWeaponLParts_MeshComponentL) == 0x0001B8, "Member 'BP_WeaponSkin_C_EditorValidatePartsGetters::CallFunc_GetAllWeaponLParts_MeshComponentL' has a wrong offset!");
static_assert(offsetof(BP_WeaponSkin_C_EditorValidatePartsGetters, CallFunc_Array_Add_ReturnValue_3) == 0x0001C8, "Member 'BP_WeaponSkin_C_EditorValidatePartsGetters::CallFunc_Array_Add_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_WeaponSkin_C_EditorValidatePartsGetters, CallFunc_ValidateObjectArray_IsValid_3) == 0x0001CC, "Member 'BP_WeaponSkin_C_EditorValidatePartsGetters::CallFunc_ValidateObjectArray_IsValid_3' has a wrong offset!");
static_assert(offsetof(BP_WeaponSkin_C_EditorValidatePartsGetters, CallFunc_ValidateObjectArray_ErrorMessage_3) == 0x0001D0, "Member 'BP_WeaponSkin_C_EditorValidatePartsGetters::CallFunc_ValidateObjectArray_ErrorMessage_3' has a wrong offset!");
static_assert(offsetof(BP_WeaponSkin_C_EditorValidatePartsGetters, CallFunc_Not_PreBool_ReturnValue_2) == 0x0001E0, "Member 'BP_WeaponSkin_C_EditorValidatePartsGetters::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_WeaponSkin_C_EditorValidatePartsGetters, CallFunc_Array_Add_ReturnValue_4) == 0x0001E4, "Member 'BP_WeaponSkin_C_EditorValidatePartsGetters::CallFunc_Array_Add_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_WeaponSkin_C_EditorValidatePartsGetters, CallFunc_Not_PreBool_ReturnValue_3) == 0x0001E8, "Member 'BP_WeaponSkin_C_EditorValidatePartsGetters::CallFunc_Not_PreBool_ReturnValue_3' has a wrong offset!");

// Function BP_WeaponSkin.BP_WeaponSkin_C.SpawnFXOnWeaponRParts
// 0x0040 (0x0040 - 0x0000)
struct BP_WeaponSkin_C_SpawnFXOnWeaponRParts final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMeshComponent*>                 CallFunc_GetAllWeaponRParts_MeshComponentR;        // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMeshComponent*                         CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_SpawnSystemAttached_ReturnValue;          // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_WeaponSkin_C_SpawnFXOnWeaponRParts) == 0x000008, "Wrong alignment on BP_WeaponSkin_C_SpawnFXOnWeaponRParts");
static_assert(sizeof(BP_WeaponSkin_C_SpawnFXOnWeaponRParts) == 0x000040, "Wrong size on BP_WeaponSkin_C_SpawnFXOnWeaponRParts");
static_assert(offsetof(BP_WeaponSkin_C_SpawnFXOnWeaponRParts, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BP_WeaponSkin_C_SpawnFXOnWeaponRParts::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_WeaponSkin_C_SpawnFXOnWeaponRParts, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_WeaponSkin_C_SpawnFXOnWeaponRParts::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_WeaponSkin_C_SpawnFXOnWeaponRParts, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_WeaponSkin_C_SpawnFXOnWeaponRParts::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeaponSkin_C_SpawnFXOnWeaponRParts, CallFunc_GetAllWeaponRParts_MeshComponentR) == 0x000010, "Member 'BP_WeaponSkin_C_SpawnFXOnWeaponRParts::CallFunc_GetAllWeaponRParts_MeshComponentR' has a wrong offset!");
static_assert(offsetof(BP_WeaponSkin_C_SpawnFXOnWeaponRParts, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'BP_WeaponSkin_C_SpawnFXOnWeaponRParts::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeaponSkin_C_SpawnFXOnWeaponRParts, CallFunc_Array_Get_Item) == 0x000028, "Member 'BP_WeaponSkin_C_SpawnFXOnWeaponRParts::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_WeaponSkin_C_SpawnFXOnWeaponRParts, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'BP_WeaponSkin_C_SpawnFXOnWeaponRParts::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeaponSkin_C_SpawnFXOnWeaponRParts, CallFunc_SpawnSystemAttached_ReturnValue) == 0x000038, "Member 'BP_WeaponSkin_C_SpawnFXOnWeaponRParts::CallFunc_SpawnSystemAttached_ReturnValue' has a wrong offset!");

// Function BP_WeaponSkin.BP_WeaponSkin_C.SpawnFXOnWeaponLParts
// 0x0048 (0x0048 - 0x0000)
struct BP_WeaponSkin_C_SpawnFXOnWeaponLParts final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMeshComponent*>                 CallFunc_GetAllWeaponLParts_MeshComponentL;        // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMeshComponent*                         CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_SpawnSystemAttached_ReturnValue;          // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_WeaponSkin_C_SpawnFXOnWeaponLParts) == 0x000008, "Wrong alignment on BP_WeaponSkin_C_SpawnFXOnWeaponLParts");
static_assert(sizeof(BP_WeaponSkin_C_SpawnFXOnWeaponLParts) == 0x000048, "Wrong size on BP_WeaponSkin_C_SpawnFXOnWeaponLParts");
static_assert(offsetof(BP_WeaponSkin_C_SpawnFXOnWeaponLParts, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BP_WeaponSkin_C_SpawnFXOnWeaponLParts::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_WeaponSkin_C_SpawnFXOnWeaponLParts, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_WeaponSkin_C_SpawnFXOnWeaponLParts::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_WeaponSkin_C_SpawnFXOnWeaponLParts, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_WeaponSkin_C_SpawnFXOnWeaponLParts::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeaponSkin_C_SpawnFXOnWeaponLParts, CallFunc_GetAllWeaponLParts_MeshComponentL) == 0x000010, "Member 'BP_WeaponSkin_C_SpawnFXOnWeaponLParts::CallFunc_GetAllWeaponLParts_MeshComponentL' has a wrong offset!");
static_assert(offsetof(BP_WeaponSkin_C_SpawnFXOnWeaponLParts, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'BP_WeaponSkin_C_SpawnFXOnWeaponLParts::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeaponSkin_C_SpawnFXOnWeaponLParts, CallFunc_Array_Get_Item) == 0x000028, "Member 'BP_WeaponSkin_C_SpawnFXOnWeaponLParts::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_WeaponSkin_C_SpawnFXOnWeaponLParts, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'BP_WeaponSkin_C_SpawnFXOnWeaponLParts::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeaponSkin_C_SpawnFXOnWeaponLParts, CallFunc_SpawnSystemAttached_ReturnValue) == 0x000038, "Member 'BP_WeaponSkin_C_SpawnFXOnWeaponLParts::CallFunc_SpawnSystemAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeaponSkin_C_SpawnFXOnWeaponLParts, CallFunc_Array_Add_ReturnValue) == 0x000040, "Member 'BP_WeaponSkin_C_SpawnFXOnWeaponLParts::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function BP_WeaponSkin.BP_WeaponSkin_C.GetAllWeaponLParts
// 0x0020 (0x0020 - 0x0000)
struct BP_WeaponSkin_C_GetAllWeaponLParts final
{
public:
	TArray<class UMeshComponent*>                 MeshComponentL;                                    // 0x0000(0x0010)(Parm, OutParm, ContainsInstancedReference)
	TArray<class UMeshComponent*>                 K2Node_MakeArray_Array;                            // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(BP_WeaponSkin_C_GetAllWeaponLParts) == 0x000008, "Wrong alignment on BP_WeaponSkin_C_GetAllWeaponLParts");
static_assert(sizeof(BP_WeaponSkin_C_GetAllWeaponLParts) == 0x000020, "Wrong size on BP_WeaponSkin_C_GetAllWeaponLParts");
static_assert(offsetof(BP_WeaponSkin_C_GetAllWeaponLParts, MeshComponentL) == 0x000000, "Member 'BP_WeaponSkin_C_GetAllWeaponLParts::MeshComponentL' has a wrong offset!");
static_assert(offsetof(BP_WeaponSkin_C_GetAllWeaponLParts, K2Node_MakeArray_Array) == 0x000010, "Member 'BP_WeaponSkin_C_GetAllWeaponLParts::K2Node_MakeArray_Array' has a wrong offset!");

// Function BP_WeaponSkin.BP_WeaponSkin_C.GetAllWeaponRParts
// 0x0020 (0x0020 - 0x0000)
struct BP_WeaponSkin_C_GetAllWeaponRParts final
{
public:
	TArray<class UMeshComponent*>                 MeshComponentR;                                    // 0x0000(0x0010)(Parm, OutParm, ContainsInstancedReference)
	TArray<class UMeshComponent*>                 K2Node_MakeArray_Array;                            // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(BP_WeaponSkin_C_GetAllWeaponRParts) == 0x000008, "Wrong alignment on BP_WeaponSkin_C_GetAllWeaponRParts");
static_assert(sizeof(BP_WeaponSkin_C_GetAllWeaponRParts) == 0x000020, "Wrong size on BP_WeaponSkin_C_GetAllWeaponRParts");
static_assert(offsetof(BP_WeaponSkin_C_GetAllWeaponRParts, MeshComponentR) == 0x000000, "Member 'BP_WeaponSkin_C_GetAllWeaponRParts::MeshComponentR' has a wrong offset!");
static_assert(offsetof(BP_WeaponSkin_C_GetAllWeaponRParts, K2Node_MakeArray_Array) == 0x000010, "Member 'BP_WeaponSkin_C_GetAllWeaponRParts::K2Node_MakeArray_Array' has a wrong offset!");

// Function BP_WeaponSkin.BP_WeaponSkin_C.WeaponSummon_Instant
// 0x0020 (0x0020 - 0x0000)
struct BP_WeaponSkin_C_WeaponSummon_Instant final
{
public:
	bool                                          R;                                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          L;                                                 // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Unsummon;                                          // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x1];                                        // 0x0003(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMeshComponent*                         CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_WeaponSkin_C_WeaponSummon_Instant) == 0x000008, "Wrong alignment on BP_WeaponSkin_C_WeaponSummon_Instant");
static_assert(sizeof(BP_WeaponSkin_C_WeaponSummon_Instant) == 0x000020, "Wrong size on BP_WeaponSkin_C_WeaponSummon_Instant");
static_assert(offsetof(BP_WeaponSkin_C_WeaponSummon_Instant, R) == 0x000000, "Member 'BP_WeaponSkin_C_WeaponSummon_Instant::R' has a wrong offset!");
static_assert(offsetof(BP_WeaponSkin_C_WeaponSummon_Instant, L) == 0x000001, "Member 'BP_WeaponSkin_C_WeaponSummon_Instant::L' has a wrong offset!");
static_assert(offsetof(BP_WeaponSkin_C_WeaponSummon_Instant, Unsummon) == 0x000002, "Member 'BP_WeaponSkin_C_WeaponSummon_Instant::Unsummon' has a wrong offset!");
static_assert(offsetof(BP_WeaponSkin_C_WeaponSummon_Instant, Temp_int_Array_Index_Variable) == 0x000004, "Member 'BP_WeaponSkin_C_WeaponSummon_Instant::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_WeaponSkin_C_WeaponSummon_Instant, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'BP_WeaponSkin_C_WeaponSummon_Instant::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_WeaponSkin_C_WeaponSummon_Instant, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'BP_WeaponSkin_C_WeaponSummon_Instant::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeaponSkin_C_WeaponSummon_Instant, CallFunc_Array_Get_Item) == 0x000010, "Member 'BP_WeaponSkin_C_WeaponSummon_Instant::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_WeaponSkin_C_WeaponSummon_Instant, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'BP_WeaponSkin_C_WeaponSummon_Instant::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeaponSkin_C_WeaponSummon_Instant, CallFunc_Less_IntInt_ReturnValue) == 0x00001C, "Member 'BP_WeaponSkin_C_WeaponSummon_Instant::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function BP_WeaponSkin.BP_WeaponSkin_C.GetWeaponR_VelocityAndSpeed
// 0x0070 (0x0070 - 0x0000)
struct BP_WeaponSkin_C_GetWeaponR_VelocityAndSpeed final
{
public:
	struct FVector                                Velocity;                                          // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Speed;                                             // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Temp_wildcard_Variable;                            // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0050(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_VSize_ReturnValue;                        // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_WeaponSkin_C_GetWeaponR_VelocityAndSpeed) == 0x000008, "Wrong alignment on BP_WeaponSkin_C_GetWeaponR_VelocityAndSpeed");
static_assert(sizeof(BP_WeaponSkin_C_GetWeaponR_VelocityAndSpeed) == 0x000070, "Wrong size on BP_WeaponSkin_C_GetWeaponR_VelocityAndSpeed");
static_assert(offsetof(BP_WeaponSkin_C_GetWeaponR_VelocityAndSpeed, Velocity) == 0x000000, "Member 'BP_WeaponSkin_C_GetWeaponR_VelocityAndSpeed::Velocity' has a wrong offset!");
static_assert(offsetof(BP_WeaponSkin_C_GetWeaponR_VelocityAndSpeed, Speed) == 0x000018, "Member 'BP_WeaponSkin_C_GetWeaponR_VelocityAndSpeed::Speed' has a wrong offset!");
static_assert(offsetof(BP_WeaponSkin_C_GetWeaponR_VelocityAndSpeed, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000020, "Member 'BP_WeaponSkin_C_GetWeaponR_VelocityAndSpeed::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeaponSkin_C_GetWeaponR_VelocityAndSpeed, Temp_wildcard_Variable) == 0x000038, "Member 'BP_WeaponSkin_C_GetWeaponR_VelocityAndSpeed::Temp_wildcard_Variable' has a wrong offset!");
static_assert(offsetof(BP_WeaponSkin_C_GetWeaponR_VelocityAndSpeed, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000050, "Member 'BP_WeaponSkin_C_GetWeaponR_VelocityAndSpeed::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeaponSkin_C_GetWeaponR_VelocityAndSpeed, CallFunc_VSize_ReturnValue) == 0x000068, "Member 'BP_WeaponSkin_C_GetWeaponR_VelocityAndSpeed::CallFunc_VSize_ReturnValue' has a wrong offset!");

// Function BP_WeaponSkin.BP_WeaponSkin_C.GetWeaponL_VelocityAndSpeed
// 0x0070 (0x0070 - 0x0000)
struct BP_WeaponSkin_C_GetWeaponL_VelocityAndSpeed final
{
public:
	struct FVector                                Velocity;                                          // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Speed;                                             // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Temp_wildcard_Variable;                            // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_VSize_ReturnValue;                        // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_WeaponSkin_C_GetWeaponL_VelocityAndSpeed) == 0x000008, "Wrong alignment on BP_WeaponSkin_C_GetWeaponL_VelocityAndSpeed");
static_assert(sizeof(BP_WeaponSkin_C_GetWeaponL_VelocityAndSpeed) == 0x000070, "Wrong size on BP_WeaponSkin_C_GetWeaponL_VelocityAndSpeed");
static_assert(offsetof(BP_WeaponSkin_C_GetWeaponL_VelocityAndSpeed, Velocity) == 0x000000, "Member 'BP_WeaponSkin_C_GetWeaponL_VelocityAndSpeed::Velocity' has a wrong offset!");
static_assert(offsetof(BP_WeaponSkin_C_GetWeaponL_VelocityAndSpeed, Speed) == 0x000018, "Member 'BP_WeaponSkin_C_GetWeaponL_VelocityAndSpeed::Speed' has a wrong offset!");
static_assert(offsetof(BP_WeaponSkin_C_GetWeaponL_VelocityAndSpeed, Temp_wildcard_Variable) == 0x000020, "Member 'BP_WeaponSkin_C_GetWeaponL_VelocityAndSpeed::Temp_wildcard_Variable' has a wrong offset!");
static_assert(offsetof(BP_WeaponSkin_C_GetWeaponL_VelocityAndSpeed, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000038, "Member 'BP_WeaponSkin_C_GetWeaponL_VelocityAndSpeed::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeaponSkin_C_GetWeaponL_VelocityAndSpeed, CallFunc_VSize_ReturnValue) == 0x000050, "Member 'BP_WeaponSkin_C_GetWeaponL_VelocityAndSpeed::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeaponSkin_C_GetWeaponL_VelocityAndSpeed, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000058, "Member 'BP_WeaponSkin_C_GetWeaponL_VelocityAndSpeed::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");

// Function BP_WeaponSkin.BP_WeaponSkin_C.SetGlow
// 0x0008 (0x0008 - 0x0000)
struct BP_WeaponSkin_C_SetGlow final
{
public:
	double                                        Glow_0;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_WeaponSkin_C_SetGlow) == 0x000008, "Wrong alignment on BP_WeaponSkin_C_SetGlow");
static_assert(sizeof(BP_WeaponSkin_C_SetGlow) == 0x000008, "Wrong size on BP_WeaponSkin_C_SetGlow");
static_assert(offsetof(BP_WeaponSkin_C_SetGlow, Glow_0) == 0x000000, "Member 'BP_WeaponSkin_C_SetGlow::Glow_0' has a wrong offset!");

// Function BP_WeaponSkin.BP_WeaponSkin_C.SetEmissive Color
// 0x0010 (0x0010 - 0x0000)
struct BP_WeaponSkin_C_SetEmissive_Color final
{
public:
	struct FLinearColor                           Emissive_Color_0;                                  // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_WeaponSkin_C_SetEmissive_Color) == 0x000004, "Wrong alignment on BP_WeaponSkin_C_SetEmissive_Color");
static_assert(sizeof(BP_WeaponSkin_C_SetEmissive_Color) == 0x000010, "Wrong size on BP_WeaponSkin_C_SetEmissive_Color");
static_assert(offsetof(BP_WeaponSkin_C_SetEmissive_Color, Emissive_Color_0) == 0x000000, "Member 'BP_WeaponSkin_C_SetEmissive_Color::Emissive_Color_0' has a wrong offset!");

// Function BP_WeaponSkin.BP_WeaponSkin_C.UpdateVisualParameters
// 0x0088 (0x0088 - 0x0000)
struct BP_WeaponSkin_C_UpdateVisualParameters final
{
public:
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMeshComponent*>                 CallFunc_GetAllWeaponLParts_MeshComponentL;        // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UMeshComponent*                         CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E[0x2];                                       // 0x002E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMeshComponent*>                 CallFunc_GetAllWeaponRParts_MeshComponentR;        // 0x0030(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<class UNiagaraComponent*>              CallFunc_GetAllTrailsOnWeaponR_TrailsArrayR;       // 0x0040(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UNiagaraComponent*>              CallFunc_GetAllTrailsOnWeaponL_TrailsArrayL;       // 0x0058(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMeshComponent*                         CallFunc_Array_Get_Item_1;                         // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_WeaponSkin_C_UpdateVisualParameters) == 0x000008, "Wrong alignment on BP_WeaponSkin_C_UpdateVisualParameters");
static_assert(sizeof(BP_WeaponSkin_C_UpdateVisualParameters) == 0x000088, "Wrong size on BP_WeaponSkin_C_UpdateVisualParameters");
static_assert(offsetof(BP_WeaponSkin_C_UpdateVisualParameters, Temp_int_Loop_Counter_Variable) == 0x000000, "Member 'BP_WeaponSkin_C_UpdateVisualParameters::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_WeaponSkin_C_UpdateVisualParameters, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'BP_WeaponSkin_C_UpdateVisualParameters::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeaponSkin_C_UpdateVisualParameters, Temp_int_Array_Index_Variable) == 0x000008, "Member 'BP_WeaponSkin_C_UpdateVisualParameters::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_WeaponSkin_C_UpdateVisualParameters, CallFunc_GetAllWeaponLParts_MeshComponentL) == 0x000010, "Member 'BP_WeaponSkin_C_UpdateVisualParameters::CallFunc_GetAllWeaponLParts_MeshComponentL' has a wrong offset!");
static_assert(offsetof(BP_WeaponSkin_C_UpdateVisualParameters, CallFunc_Array_Get_Item) == 0x000020, "Member 'BP_WeaponSkin_C_UpdateVisualParameters::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_WeaponSkin_C_UpdateVisualParameters, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'BP_WeaponSkin_C_UpdateVisualParameters::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeaponSkin_C_UpdateVisualParameters, CallFunc_Less_IntInt_ReturnValue) == 0x00002C, "Member 'BP_WeaponSkin_C_UpdateVisualParameters::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeaponSkin_C_UpdateVisualParameters, CallFunc_IsValid_ReturnValue) == 0x00002D, "Member 'BP_WeaponSkin_C_UpdateVisualParameters::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeaponSkin_C_UpdateVisualParameters, CallFunc_GetAllWeaponRParts_MeshComponentR) == 0x000030, "Member 'BP_WeaponSkin_C_UpdateVisualParameters::CallFunc_GetAllWeaponRParts_MeshComponentR' has a wrong offset!");
static_assert(offsetof(BP_WeaponSkin_C_UpdateVisualParameters, CallFunc_GetAllTrailsOnWeaponR_TrailsArrayR) == 0x000040, "Member 'BP_WeaponSkin_C_UpdateVisualParameters::CallFunc_GetAllTrailsOnWeaponR_TrailsArrayR' has a wrong offset!");
static_assert(offsetof(BP_WeaponSkin_C_UpdateVisualParameters, CallFunc_Array_Length_ReturnValue_1) == 0x000050, "Member 'BP_WeaponSkin_C_UpdateVisualParameters::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WeaponSkin_C_UpdateVisualParameters, CallFunc_GetAllTrailsOnWeaponL_TrailsArrayL) == 0x000058, "Member 'BP_WeaponSkin_C_UpdateVisualParameters::CallFunc_GetAllTrailsOnWeaponL_TrailsArrayL' has a wrong offset!");
static_assert(offsetof(BP_WeaponSkin_C_UpdateVisualParameters, Temp_int_Loop_Counter_Variable_1) == 0x000068, "Member 'BP_WeaponSkin_C_UpdateVisualParameters::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_WeaponSkin_C_UpdateVisualParameters, Temp_int_Array_Index_Variable_1) == 0x00006C, "Member 'BP_WeaponSkin_C_UpdateVisualParameters::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_WeaponSkin_C_UpdateVisualParameters, CallFunc_Less_IntInt_ReturnValue_1) == 0x000070, "Member 'BP_WeaponSkin_C_UpdateVisualParameters::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WeaponSkin_C_UpdateVisualParameters, CallFunc_Array_Get_Item_1) == 0x000078, "Member 'BP_WeaponSkin_C_UpdateVisualParameters::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_WeaponSkin_C_UpdateVisualParameters, CallFunc_IsValid_ReturnValue_1) == 0x000080, "Member 'BP_WeaponSkin_C_UpdateVisualParameters::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WeaponSkin_C_UpdateVisualParameters, CallFunc_Add_IntInt_ReturnValue_1) == 0x000084, "Member 'BP_WeaponSkin_C_UpdateVisualParameters::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");

// Function BP_WeaponSkin.BP_WeaponSkin_C.SetColor
// 0x0010 (0x0010 - 0x0000)
struct BP_WeaponSkin_C_SetColor final
{
public:
	struct FLinearColor                           Color_0;                                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_WeaponSkin_C_SetColor) == 0x000004, "Wrong alignment on BP_WeaponSkin_C_SetColor");
static_assert(sizeof(BP_WeaponSkin_C_SetColor) == 0x000010, "Wrong size on BP_WeaponSkin_C_SetColor");
static_assert(offsetof(BP_WeaponSkin_C_SetColor, Color_0) == 0x000000, "Member 'BP_WeaponSkin_C_SetColor::Color_0' has a wrong offset!");

// Function BP_WeaponSkin.BP_WeaponSkin_C.UpdatePermeate
// 0x0170 (0x0170 - 0x0000)
struct BP_WeaponSkin_C_UpdatePermeate final
{
public:
	class USkeletalMeshComponent*                 SkeletalMesh;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EAttackType                                   PermeateType;                                      // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPermeateIntensity                            PermeateIntensity;                                 // 0x0009(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TrailWidth;                                        // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
