#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_WeaponSkin_Maelle_Base

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_WeaponSkin_Maelle_Base.BP_WeaponSkin_Maelle_Base_C.GetAllTrailsOnWeaponR
// 0x0040 (0x0040 - 0x0000)
struct BP_WeaponSkin_Maelle_Base_C_GetAllTrailsOnWeaponR final
{
public:
	TArray<class UNiagaraComponent*>              TrailsArrayR;                                      // 0x0000(0x0010)(Parm, OutParm, ContainsInstancedReference)
	TArray<class UNiagaraComponent*>              Temp_wildcard_Variable;                            // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<class UNiagaraComponent*>              CallFunc_GetAllTrailsOnWeaponR_TrailsArrayR;       // 0x0020(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<class UNiagaraComponent*>              K2Node_MakeArray_Array;                            // 0x0030(0x0010)(ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(BP_WeaponSkin_Maelle_Base_C_GetAllTrailsOnWeaponR) == 0x000008, "Wrong alignment on BP_WeaponSkin_Maelle_Base_C_GetAllTrailsOnWeaponR");
static_assert(sizeof(BP_WeaponSkin_Maelle_Base_C_GetAllTrailsOnWeaponR) == 0x000040, "Wrong size on BP_WeaponSkin_Maelle_Base_C_GetAllTrailsOnWeaponR");
static_assert(offsetof(BP_WeaponSkin_Maelle_Base_C_GetAllTrailsOnWeaponR, TrailsArrayR) == 0x000000, "Member 'BP_WeaponSkin_Maelle_Base_C_GetAllTrailsOnWeaponR::TrailsArrayR' has a wrong offset!");
static_assert(offsetof(BP_WeaponSkin_Maelle_Base_C_GetAllTrailsOnWeaponR, Temp_wildcard_Variable) == 0x000010, "Member 'BP_WeaponSkin_Maelle_Base_C_GetAllTrailsOnWeaponR::Temp_wildcard_Variable' has a wrong offset!");
static_assert(offsetof(BP_WeaponSkin_Maelle_Base_C_GetAllTrailsOnWeaponR, CallFunc_GetAllTrailsOnWeaponR_TrailsArrayR) == 0x000020, "Member 'BP_WeaponSkin_Maelle_Base_C_GetAllTrailsOnWeaponR::CallFunc_GetAllTrailsOnWeaponR_TrailsArrayR' has a wrong offset!");
static_assert(offsetof(BP_WeaponSkin_Maelle_Base_C_GetAllTrailsOnWeaponR, K2Node_MakeArray_Array) == 0x000030, "Member 'BP_WeaponSkin_Maelle_Base_C_GetAllTrailsOnWeaponR::K2Node_MakeArray_Array' has a wrong offset!");

}

