#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_WeaponSkin_Noah_Base

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_WeaponSkin_Noah_Base.BP_WeaponSkin_Noah_Base_C.ApplyVersoOverrides
// 0x000C (0x000C - 0x0000)
struct BP_WeaponSkin_Noah_Base_C_ApplyVersoOverrides final
{
public:
	bool                                          IsVerso_0;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetFloatParameter_Param_ImplicitCast;     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetFloatParameter_Param_ImplicitCast_1;   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_WeaponSkin_Noah_Base_C_ApplyVersoOverrides) == 0x000004, "Wrong alignment on BP_WeaponSkin_Noah_Base_C_ApplyVersoOverrides");
static_assert(sizeof(BP_WeaponSkin_Noah_Base_C_ApplyVersoOverrides) == 0x00000C, "Wrong size on BP_WeaponSkin_Noah_Base_C_ApplyVersoOverrides");
static_assert(offsetof(BP_WeaponSkin_Noah_Base_C_ApplyVersoOverrides, IsVerso_0) == 0x000000, "Member 'BP_WeaponSkin_Noah_Base_C_ApplyVersoOverrides::IsVerso_0' has a wrong offset!");
static_assert(offsetof(BP_WeaponSkin_Noah_Base_C_ApplyVersoOverrides, CallFunc_Not_PreBool_ReturnValue) == 0x000001, "Member 'BP_WeaponSkin_Noah_Base_C_ApplyVersoOverrides::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeaponSkin_Noah_Base_C_ApplyVersoOverrides, CallFunc_SetFloatParameter_Param_ImplicitCast) == 0x000004, "Member 'BP_WeaponSkin_Noah_Base_C_ApplyVersoOverrides::CallFunc_SetFloatParameter_Param_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_WeaponSkin_Noah_Base_C_ApplyVersoOverrides, CallFunc_SetFloatParameter_Param_ImplicitCast_1) == 0x000008, "Member 'BP_WeaponSkin_Noah_Base_C_ApplyVersoOverrides::CallFunc_SetFloatParameter_Param_ImplicitCast_1' has a wrong offset!");

// Function BP_WeaponSkin_Noah_Base.BP_WeaponSkin_Noah_Base_C.GetAllTrailsOnWeaponL
// 0x0068 (0x0068 - 0x0000)
struct BP_WeaponSkin_Noah_Base_C_GetAllTrailsOnWeaponL final
{
public:
	TArray<class UNiagaraComponent*>              TrailsArrayL;                                      // 0x0000(0x0010)(Parm, OutParm, ContainsInstancedReference)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UNiagaraComponent*>              Temp_wildcard_Variable;                            // 0x0018(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<class UNiagaraComponent*>              K2Node_MakeArray_Array;                            // 0x0028(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<class UNiagaraComponent*>              CallFunc_GetAllTrailsOnWeaponL_TrailsArrayL;       // 0x0038(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<class UNiagaraComponent*>              K2Node_MakeArray_Array_1;                          // 0x0048(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<class UNiagaraComponent*>              K2Node_Select_Default;                             // 0x0058(0x0010)(ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(BP_WeaponSkin_Noah_Base_C_GetAllTrailsOnWeaponL) == 0x000008, "Wrong alignment on BP_WeaponSkin_Noah_Base_C_GetAllTrailsOnWeaponL");
static_assert(sizeof(BP_WeaponSkin_Noah_Base_C_GetAllTrailsOnWeaponL) == 0x000068, "Wrong size on BP_WeaponSkin_Noah_Base_C_GetAllTrailsOnWeaponL");
static_assert(offsetof(BP_WeaponSkin_Noah_Base_C_GetAllTrailsOnWeaponL, TrailsArrayL) == 0x000000, "Member 'BP_WeaponSkin_Noah_Base_C_GetAllTrailsOnWeaponL::TrailsArrayL' has a wrong offset!");
static_assert(offsetof(BP_WeaponSkin_Noah_Base_C_GetAllTrailsOnWeaponL, Temp_bool_Variable) == 0x000010, "Member 'BP_WeaponSkin_Noah_Base_C_GetAllTrailsOnWeaponL::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_WeaponSkin_Noah_Base_C_GetAllTrailsOnWeaponL, Temp_wildcard_Variable) == 0x000018, "Member 'BP_WeaponSkin_Noah_Base_C_GetAllTrailsOnWeaponL::Temp_wildcard_Variable' has a wrong offset!");
static_assert(offsetof(BP_WeaponSkin_Noah_Base_C_GetAllTrailsOnWeaponL, K2Node_MakeArray_Array) == 0x000028, "Member 'BP_WeaponSkin_Noah_Base_C_GetAllTrailsOnWeaponL::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_WeaponSkin_Noah_Base_C_GetAllTrailsOnWeaponL, CallFunc_GetAllTrailsOnWeaponL_TrailsArrayL) == 0x000038, "Member 'BP_WeaponSkin_Noah_Base_C_GetAllTrailsOnWeaponL::CallFunc_GetAllTrailsOnWeaponL_TrailsArrayL' has a wrong offset!");
static_assert(offsetof(BP_WeaponSkin_Noah_Base_C_GetAllTrailsOnWeaponL, K2Node_MakeArray_Array_1) == 0x000048, "Member 'BP_WeaponSkin_Noah_Base_C_GetAllTrailsOnWeaponL::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BP_WeaponSkin_Noah_Base_C_GetAllTrailsOnWeaponL, K2Node_Select_Default) == 0x000058, "Member 'BP_WeaponSkin_Noah_Base_C_GetAllTrailsOnWeaponL::K2Node_Select_Default' has a wrong offset!");

// Function BP_WeaponSkin_Noah_Base.BP_WeaponSkin_Noah_Base_C.GetAllTrailsOnWeaponR
// 0x0040 (0x0040 - 0x0000)
struct BP_WeaponSkin_Noah_Base_C_GetAllTrailsOnWeaponR final
{
public:
	TArray<class UNiagaraComponent*>              TrailsArrayR;                                      // 0x0000(0x0010)(Parm, OutParm, ContainsInstancedReference)
	TArray<class UNiagaraComponent*>              Temp_wildcard_Variable;                            // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<class UNiagaraComponent*>              CallFunc_GetAllTrailsOnWeaponR_TrailsArrayR;       // 0x0020(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<class UNiagaraComponent*>              K2Node_MakeArray_Array;                            // 0x0030(0x0010)(ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(BP_WeaponSkin_Noah_Base_C_GetAllTrailsOnWeaponR) == 0x000008, "Wrong alignment on BP_WeaponSkin_Noah_Base_C_GetAllTrailsOnWeaponR");
static_assert(sizeof(BP_WeaponSkin_Noah_Base_C_GetAllTrailsOnWeaponR) == 0x000040, "Wrong size on BP_WeaponSkin_Noah_Base_C_GetAllTrailsOnWeaponR");
static_assert(offsetof(BP_WeaponSkin_Noah_Base_C_GetAllTrailsOnWeaponR, TrailsArrayR) == 0x000000, "Member 'BP_WeaponSkin_Noah_Base_C_GetAllTrailsOnWeaponR::TrailsArrayR' has a wrong offset!");
static_assert(offsetof(BP_WeaponSkin_Noah_Base_C_GetAllTrailsOnWeaponR, Temp_wildcard_Variable) == 0x000010, "Member 'BP_WeaponSkin_Noah_Base_C_GetAllTrailsOnWeaponR::Temp_wildcard_Variable' has a wrong offset!");
static_assert(offsetof(BP_WeaponSkin_Noah_Base_C_GetAllTrailsOnWeaponR, CallFunc_GetAllTrailsOnWeaponR_TrailsArrayR) == 0x000020, "Member 'BP_WeaponSkin_Noah_Base_C_GetAllTrailsOnWeaponR::CallFunc_GetAllTrailsOnWeaponR_TrailsArrayR' has a wrong offset!");
static_assert(offsetof(BP_WeaponSkin_Noah_Base_C_GetAllTrailsOnWeaponR, K2Node_MakeArray_Array) == 0x000030, "Member 'BP_WeaponSkin_Noah_Base_C_GetAllTrailsOnWeaponR::K2Node_MakeArray_Array' has a wrong offset!");

}

