#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Water_Reaction

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Water_Reaction.BP_Water_Reaction_C
// 0x0028 (0x02B8 - 0x0290)
class ABP_Water_Reaction_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      WaterReaction;                                     // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           WaterFXColor;                                      // 0x02A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void DeactivateAndDestroy();
	void ExecuteUbergraph_BP_Water_Reaction(int32 EntryPoint);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Water_Reaction_C">();
	}
	static class ABP_Water_Reaction_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Water_Reaction_C>();
	}
};
static_assert(alignof(ABP_Water_Reaction_C) == 0x000008, "Wrong alignment on ABP_Water_Reaction_C");
static_assert(sizeof(ABP_Water_Reaction_C) == 0x0002B8, "Wrong size on ABP_Water_Reaction_C");
static_assert(offsetof(ABP_Water_Reaction_C, UberGraphFrame) == 0x000290, "Member 'ABP_Water_Reaction_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Water_Reaction_C, WaterReaction) == 0x000298, "Member 'ABP_Water_Reaction_C::WaterReaction' has a wrong offset!");
static_assert(offsetof(ABP_Water_Reaction_C, DefaultSceneRoot) == 0x0002A0, "Member 'ABP_Water_Reaction_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_Water_Reaction_C, WaterFXColor) == 0x0002A8, "Member 'ABP_Water_Reaction_C::WaterFXColor' has a wrong offset!");

}

