#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPC_LightAreaMecanic

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BPC_LightAreaMecanic.BPC_LightAreaMecanic_C.EnterLightArea
// 0x0001 (0x0001 - 0x0000)
struct BPC_LightAreaMecanic_C_EnterLightArea final
{
public:
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_LightAreaMecanic_C_EnterLightArea) == 0x000001, "Wrong alignment on BPC_LightAreaMecanic_C_EnterLightArea");
static_assert(sizeof(BPC_LightAreaMecanic_C_EnterLightArea) == 0x000001, "Wrong size on BPC_LightAreaMecanic_C_EnterLightArea");
static_assert(offsetof(BPC_LightAreaMecanic_C_EnterLightArea, CallFunc_Not_PreBool_ReturnValue) == 0x000000, "Member 'BPC_LightAreaMecanic_C_EnterLightArea::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function BPC_LightAreaMecanic.BPC_LightAreaMecanic_C.ExecuteUbergraph_BPC_LightAreaMecanic
// 0x0130 (0x0130 - 0x0000)
struct BPC_LightAreaMecanic_C_ExecuteUbergraph_BPC_LightAreaMecanic final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_jRPG_Character_World_C*             K2Node_DynamicCast_AsBP_J_RPG_Character_World;     // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue;      // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PlayAnimMontage_ReturnValue;              // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0xC];                                       // 0x0064(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0070(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_ProtoArmRingLight_C*                CallFunc_FinishSpawningActor_ReturnValue;          // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToActor_ReturnValue;             // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F4[0x4];                                       // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             K2Node_DynamicCast_AsCharacter;                    // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x0108(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_VSize_ReturnValue;                        // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x012A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_LightAreaMecanic_C_ExecuteUbergraph_BPC_LightAreaMecanic) == 0x000010, "Wrong alignment on BPC_LightAreaMecanic_C_ExecuteUbergraph_BPC_LightAreaMecanic");
static_assert(sizeof(BPC_LightAreaMecanic_C_ExecuteUbergraph_BPC_LightAreaMecanic) == 0x000130, "Wrong size on BPC_LightAreaMecanic_C_ExecuteUbergraph_BPC_LightAreaMecanic");
static_assert(offsetof(BPC_LightAreaMecanic_C_ExecuteUbergraph_BPC_LightAreaMecanic, EntryPoint) == 0x000000, "Member 'BPC_LightAreaMecanic_C_ExecuteUbergraph_BPC_LightAreaMecanic::EntryPoint' has a wrong offset!");
static_assert(offsetof(BPC_LightAreaMecanic_C_ExecuteUbergraph_BPC_LightAreaMecanic, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'BPC_LightAreaMecanic_C_ExecuteUbergraph_BPC_LightAreaMecanic::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_LightAreaMecanic_C_ExecuteUbergraph_BPC_LightAreaMecanic, CallFunc_GetPlayerController_ReturnValue_1) == 0x000010, "Member 'BPC_LightAreaMecanic_C_ExecuteUbergraph_BPC_LightAreaMecanic::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_LightAreaMecanic_C_ExecuteUbergraph_BPC_LightAreaMecanic, CallFunc_GetOwner_ReturnValue) == 0x000018, "Member 'BPC_LightAreaMecanic_C_ExecuteUbergraph_BPC_LightAreaMecanic::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_LightAreaMecanic_C_ExecuteUbergraph_BPC_LightAreaMecanic, K2Node_DynamicCast_AsBP_J_RPG_Character_World) == 0x000020, "Member 'BPC_LightAreaMecanic_C_ExecuteUbergraph_BPC_LightAreaMecanic::K2Node_DynamicCast_AsBP_J_RPG_Character_World' has a wrong offset!");
static_assert(offsetof(BPC_LightAreaMecanic_C_ExecuteUbergraph_BPC_LightAreaMecanic, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BPC_LightAreaMecanic_C_ExecuteUbergraph_BPC_LightAreaMecanic::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPC_LightAreaMecanic_C_ExecuteUbergraph_BPC_LightAreaMecanic, CallFunc_K2_GetComponentRotation_ReturnValue) == 0x000030, "Member 'BPC_LightAreaMecanic_C_ExecuteUbergraph_BPC_LightAreaMecanic::CallFunc_K2_GetComponentRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_LightAreaMecanic_C_ExecuteUbergraph_BPC_LightAreaMecanic, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000048, "Member 'BPC_LightAreaMecanic_C_ExecuteUbergraph_BPC_LightAreaMecanic::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_LightAreaMecanic_C_ExecuteUbergraph_BPC_LightAreaMecanic, CallFunc_PlayAnimMontage_ReturnValue) == 0x000060, "Member 'BPC_LightAreaMecanic_C_ExecuteUbergraph_BPC_LightAreaMecanic::CallFunc_PlayAnimMontage_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_LightAreaMecanic_C_ExecuteUbergraph_BPC_LightAreaMecanic, CallFunc_MakeTransform_ReturnValue) == 0x000070, "Member 'BPC_LightAreaMecanic_C_ExecuteUbergraph_BPC_LightAreaMecanic::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_LightAreaMecanic_C_ExecuteUbergraph_BPC_LightAreaMecanic, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0000D0, "Member 'BPC_LightAreaMecanic_C_ExecuteUbergraph_BPC_LightAreaMecanic::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_LightAreaMecanic_C_ExecuteUbergraph_BPC_LightAreaMecanic, CallFunc_FinishSpawningActor_ReturnValue) == 0x0000D8, "Member 'BPC_LightAreaMecanic_C_ExecuteUbergraph_BPC_LightAreaMecanic::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_LightAreaMecanic_C_ExecuteUbergraph_BPC_LightAreaMecanic, CallFunc_K2_AttachToActor_ReturnValue) == 0x0000E0, "Member 'BPC_LightAreaMecanic_C_ExecuteUbergraph_BPC_LightAreaMecanic::CallFunc_K2_AttachToActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_LightAreaMecanic_C_ExecuteUbergraph_BPC_LightAreaMecanic, CallFunc_GetOwner_ReturnValue_1) == 0x0000E8, "Member 'BPC_LightAreaMecanic_C_ExecuteUbergraph_BPC_LightAreaMecanic::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_LightAreaMecanic_C_ExecuteUbergraph_BPC_LightAreaMecanic, K2Node_Event_DeltaSeconds) == 0x0000F0, "Member 'BPC_LightAreaMecanic_C_ExecuteUbergraph_BPC_LightAreaMecanic::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BPC_LightAreaMecanic_C_ExecuteUbergraph_BPC_LightAreaMecanic, K2Node_DynamicCast_AsCharacter) == 0x0000F8, "Member 'BPC_LightAreaMecanic_C_ExecuteUbergraph_BPC_LightAreaMecanic::K2Node_DynamicCast_AsCharacter' has a wrong offset!");
static_assert(offsetof(BPC_LightAreaMecanic_C_ExecuteUbergraph_BPC_LightAreaMecanic, K2Node_DynamicCast_bSuccess_1) == 0x000100, "Member 'BPC_LightAreaMecanic_C_ExecuteUbergraph_BPC_LightAreaMecanic::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BPC_LightAreaMecanic_C_ExecuteUbergraph_BPC_LightAreaMecanic, CallFunc_GetVelocity_ReturnValue) == 0x000108, "Member 'BPC_LightAreaMecanic_C_ExecuteUbergraph_BPC_LightAreaMecanic::CallFunc_GetVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_LightAreaMecanic_C_ExecuteUbergraph_BPC_LightAreaMecanic, CallFunc_VSize_ReturnValue) == 0x000120, "Member 'BPC_LightAreaMecanic_C_ExecuteUbergraph_BPC_LightAreaMecanic::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_LightAreaMecanic_C_ExecuteUbergraph_BPC_LightAreaMecanic, CallFunc_IsValid_ReturnValue) == 0x000128, "Member 'BPC_LightAreaMecanic_C_ExecuteUbergraph_BPC_LightAreaMecanic::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_LightAreaMecanic_C_ExecuteUbergraph_BPC_LightAreaMecanic, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x000129, "Member 'BPC_LightAreaMecanic_C_ExecuteUbergraph_BPC_LightAreaMecanic::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_LightAreaMecanic_C_ExecuteUbergraph_BPC_LightAreaMecanic, CallFunc_IsValid_ReturnValue_1) == 0x00012A, "Member 'BPC_LightAreaMecanic_C_ExecuteUbergraph_BPC_LightAreaMecanic::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function BPC_LightAreaMecanic.BPC_LightAreaMecanic_C.IsProtected
// 0x0002 (0x0002 - 0x0000)
struct BPC_LightAreaMecanic_C_IsProtected final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_LightAreaMecanic_C_IsProtected) == 0x000001, "Wrong alignment on BPC_LightAreaMecanic_C_IsProtected");
static_assert(sizeof(BPC_LightAreaMecanic_C_IsProtected) == 0x000002, "Wrong size on BPC_LightAreaMecanic_C_IsProtected");
static_assert(offsetof(BPC_LightAreaMecanic_C_IsProtected, ReturnValue) == 0x000000, "Member 'BPC_LightAreaMecanic_C_IsProtected::ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_LightAreaMecanic_C_IsProtected, CallFunc_BooleanOR_ReturnValue) == 0x000001, "Member 'BPC_LightAreaMecanic_C_IsProtected::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function BPC_LightAreaMecanic.BPC_LightAreaMecanic_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BPC_LightAreaMecanic_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_LightAreaMecanic_C_ReceiveTick) == 0x000004, "Wrong alignment on BPC_LightAreaMecanic_C_ReceiveTick");
static_assert(sizeof(BPC_LightAreaMecanic_C_ReceiveTick) == 0x000004, "Wrong size on BPC_LightAreaMecanic_C_ReceiveTick");
static_assert(offsetof(BPC_LightAreaMecanic_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BPC_LightAreaMecanic_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

