#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPI_GPE_OrchestratorInterface

#include "Basic.hpp"


namespace SDK::Params
{

// Function BPI_GPE_OrchestratorInterface.BPI_GPE_OrchestratorInterface_C.ProcessDeactivateOrchestrator
// 0x0008 (0x0008 - 0x0000)
struct BPI_GPE_OrchestratorInterface_C_ProcessDeactivateOrchestrator final
{
public:
	class UBP_GPE_InternalActivationComponent_C*  GPE;                                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_GPE_OrchestratorInterface_C_ProcessDeactivateOrchestrator) == 0x000008, "Wrong alignment on BPI_GPE_OrchestratorInterface_C_ProcessDeactivateOrchestrator");
static_assert(sizeof(BPI_GPE_OrchestratorInterface_C_ProcessDeactivateOrchestrator) == 0x000008, "Wrong size on BPI_GPE_OrchestratorInterface_C_ProcessDeactivateOrchestrator");
static_assert(offsetof(BPI_GPE_OrchestratorInterface_C_ProcessDeactivateOrchestrator, GPE) == 0x000000, "Member 'BPI_GPE_OrchestratorInterface_C_ProcessDeactivateOrchestrator::GPE' has a wrong offset!");

// Function BPI_GPE_OrchestratorInterface.BPI_GPE_OrchestratorInterface_C.ProcessTickOrchestrator
// 0x0008 (0x0008 - 0x0000)
struct BPI_GPE_OrchestratorInterface_C_ProcessTickOrchestrator final
{
public:
	class UBP_GPE_InternalActivationComponent_C*  GPE;                                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_GPE_OrchestratorInterface_C_ProcessTickOrchestrator) == 0x000008, "Wrong alignment on BPI_GPE_OrchestratorInterface_C_ProcessTickOrchestrator");
static_assert(sizeof(BPI_GPE_OrchestratorInterface_C_ProcessTickOrchestrator) == 0x000008, "Wrong size on BPI_GPE_OrchestratorInterface_C_ProcessTickOrchestrator");
static_assert(offsetof(BPI_GPE_OrchestratorInterface_C_ProcessTickOrchestrator, GPE) == 0x000000, "Member 'BPI_GPE_OrchestratorInterface_C_ProcessTickOrchestrator::GPE' has a wrong offset!");

}

