#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPI_UINotifiedObject

#include "Basic.hpp"


namespace SDK::Params
{

// Function BPI_UINotifiedObject.BPI_UINotifiedObject_C.BPI_OnMarkNotificationAsRead
// 0x0008 (0x0008 - 0x0000)
struct BPI_UINotifiedObject_C_BPI_OnMarkNotificationAsRead final
{
public:
	class UUserWidget*                            MarkCaller;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_UINotifiedObject_C_BPI_OnMarkNotificationAsRead) == 0x000008, "Wrong alignment on BPI_UINotifiedObject_C_BPI_OnMarkNotificationAsRead");
static_assert(sizeof(BPI_UINotifiedObject_C_BPI_OnMarkNotificationAsRead) == 0x000008, "Wrong size on BPI_UINotifiedObject_C_BPI_OnMarkNotificationAsRead");
static_assert(offsetof(BPI_UINotifiedObject_C_BPI_OnMarkNotificationAsRead, MarkCaller) == 0x000000, "Member 'BPI_UINotifiedObject_C_BPI_OnMarkNotificationAsRead::MarkCaller' has a wrong offset!");

// Function BPI_UINotifiedObject.BPI_UINotifiedObject_C.BPI_ShouldShowNotification
// 0x0001 (0x0001 - 0x0000)
struct BPI_UINotifiedObject_C_BPI_ShouldShowNotification final
{
public:
	bool                                          bShouldShow;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_UINotifiedObject_C_BPI_ShouldShowNotification) == 0x000001, "Wrong alignment on BPI_UINotifiedObject_C_BPI_ShouldShowNotification");
static_assert(sizeof(BPI_UINotifiedObject_C_BPI_ShouldShowNotification) == 0x000001, "Wrong size on BPI_UINotifiedObject_C_BPI_ShouldShowNotification");
static_assert(offsetof(BPI_UINotifiedObject_C_BPI_ShouldShowNotification, bShouldShow) == 0x000000, "Member 'BPI_UINotifiedObject_C_BPI_ShouldShowNotification::bShouldShow' has a wrong offset!");

}

