#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPI_BattleListener

#include "Basic.hpp"


namespace SDK::Params
{

// Function BPI_BattleListener.BPI_BattleListener_C.BPI_OnAnyCharacterAP_Changed
// 0x0008 (0x0008 - 0x0000)
struct BPI_BattleListener_C_BPI_OnAnyCharacterAP_Changed final
{
public:
	class UBP_BattleEvent_APChange_C*             AP_Change;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_BattleListener_C_BPI_OnAnyCharacterAP_Changed) == 0x000008, "Wrong alignment on BPI_BattleListener_C_BPI_OnAnyCharacterAP_Changed");
static_assert(sizeof(BPI_BattleListener_C_BPI_OnAnyCharacterAP_Changed) == 0x000008, "Wrong size on BPI_BattleListener_C_BPI_OnAnyCharacterAP_Changed");
static_assert(offsetof(BPI_BattleListener_C_BPI_OnAnyCharacterAP_Changed, AP_Change) == 0x000000, "Member 'BPI_BattleListener_C_BPI_OnAnyCharacterAP_Changed::AP_Change' has a wrong offset!");

// Function BPI_BattleListener.BPI_BattleListener_C.BPI_OnAnyCharacterDamaged
// 0x0008 (0x0008 - 0x0000)
struct BPI_BattleListener_C_BPI_OnAnyCharacterDamaged final
{
public:
	class UBP_BattleDamages_C*                    BattleDamage;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_BattleListener_C_BPI_OnAnyCharacterDamaged) == 0x000008, "Wrong alignment on BPI_BattleListener_C_BPI_OnAnyCharacterDamaged");
static_assert(sizeof(BPI_BattleListener_C_BPI_OnAnyCharacterDamaged) == 0x000008, "Wrong size on BPI_BattleListener_C_BPI_OnAnyCharacterDamaged");
static_assert(offsetof(BPI_BattleListener_C_BPI_OnAnyCharacterDamaged, BattleDamage) == 0x000000, "Member 'BPI_BattleListener_C_BPI_OnAnyCharacterDamaged::BattleDamage' has a wrong offset!");

// Function BPI_BattleListener.BPI_BattleListener_C.IsTurnStartInProgress
// 0x0001 (0x0001 - 0x0000)
struct BPI_BattleListener_C_IsTurnStartInProgress final
{
public:
	bool                                          InProgress;                                        // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_BattleListener_C_IsTurnStartInProgress) == 0x000001, "Wrong alignment on BPI_BattleListener_C_IsTurnStartInProgress");
static_assert(sizeof(BPI_BattleListener_C_IsTurnStartInProgress) == 0x000001, "Wrong size on BPI_BattleListener_C_IsTurnStartInProgress");
static_assert(offsetof(BPI_BattleListener_C_IsTurnStartInProgress, InProgress) == 0x000000, "Member 'BPI_BattleListener_C_IsTurnStartInProgress::InProgress' has a wrong offset!");

// Function BPI_BattleListener.BPI_BattleListener_C.OnCharacterDealtDamages
// 0x0018 (0x0018 - 0x0000)
struct BPI_BattleListener_C_OnCharacterDealtDamages final
{
public:
	class UAC_jRPG_CharacterBattleStats_C*        CharacterStats;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        Damages;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ProcessedDamages;                                  // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_BattleListener_C_OnCharacterDealtDamages) == 0x000008, "Wrong alignment on BPI_BattleListener_C_OnCharacterDealtDamages");
static_assert(sizeof(BPI_BattleListener_C_OnCharacterDealtDamages) == 0x000018, "Wrong size on BPI_BattleListener_C_OnCharacterDealtDamages");
static_assert(offsetof(BPI_BattleListener_C_OnCharacterDealtDamages, CharacterStats) == 0x000000, "Member 'BPI_BattleListener_C_OnCharacterDealtDamages::CharacterStats' has a wrong offset!");
static_assert(offsetof(BPI_BattleListener_C_OnCharacterDealtDamages, Damages) == 0x000008, "Member 'BPI_BattleListener_C_OnCharacterDealtDamages::Damages' has a wrong offset!");
static_assert(offsetof(BPI_BattleListener_C_OnCharacterDealtDamages, ProcessedDamages) == 0x000010, "Member 'BPI_BattleListener_C_OnCharacterDealtDamages::ProcessedDamages' has a wrong offset!");

// Function BPI_BattleListener.BPI_BattleListener_C.OnCharacterKilled
// 0x0008 (0x0008 - 0x0000)
struct BPI_BattleListener_C_OnCharacterKilled final
{
public:
	class UAC_jRPG_CharacterBattleStats_C*        CharacterStats;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_BattleListener_C_OnCharacterKilled) == 0x000008, "Wrong alignment on BPI_BattleListener_C_OnCharacterKilled");
static_assert(sizeof(BPI_BattleListener_C_OnCharacterKilled) == 0x000008, "Wrong size on BPI_BattleListener_C_OnCharacterKilled");
static_assert(offsetof(BPI_BattleListener_C_OnCharacterKilled, CharacterStats) == 0x000000, "Member 'BPI_BattleListener_C_OnCharacterKilled::CharacterStats' has a wrong offset!");

// Function BPI_BattleListener.BPI_BattleListener_C.OnCharacterReceivedDamages
// 0x0020 (0x0020 - 0x0000)
struct BPI_BattleListener_C_OnCharacterReceivedDamages final
{
public:
	class UAC_jRPG_CharacterBattleStats_C*        TargetCharacter;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAC_jRPG_CharacterBattleStats_C*        SourceCharacter;                                   // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        ReceivedDamages;                                   // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_BattleDamages_C*                    BattleDamages;                                     // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_BattleListener_C_OnCharacterReceivedDamages) == 0x000008, "Wrong alignment on BPI_BattleListener_C_OnCharacterReceivedDamages");
static_assert(sizeof(BPI_BattleListener_C_OnCharacterReceivedDamages) == 0x000020, "Wrong size on BPI_BattleListener_C_OnCharacterReceivedDamages");
static_assert(offsetof(BPI_BattleListener_C_OnCharacterReceivedDamages, TargetCharacter) == 0x000000, "Member 'BPI_BattleListener_C_OnCharacterReceivedDamages::TargetCharacter' has a wrong offset!");
static_assert(offsetof(BPI_BattleListener_C_OnCharacterReceivedDamages, SourceCharacter) == 0x000008, "Member 'BPI_BattleListener_C_OnCharacterReceivedDamages::SourceCharacter' has a wrong offset!");
static_assert(offsetof(BPI_BattleListener_C_OnCharacterReceivedDamages, ReceivedDamages) == 0x000010, "Member 'BPI_BattleListener_C_OnCharacterReceivedDamages::ReceivedDamages' has a wrong offset!");
static_assert(offsetof(BPI_BattleListener_C_OnCharacterReceivedDamages, BattleDamages) == 0x000018, "Member 'BPI_BattleListener_C_OnCharacterReceivedDamages::BattleDamages' has a wrong offset!");

// Function BPI_BattleListener.BPI_BattleListener_C.OnCharacterTurnStart
// 0x0010 (0x0010 - 0x0000)
struct BPI_BattleListener_C_OnCharacterTurnStart final
{
public:
	class UAC_jRPG_CharacterBattleStats_C*        CharacterStats;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	const class UBP_DependencyRefCounter_C*       TurnStartDependencies;                             // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_BattleListener_C_OnCharacterTurnStart) == 0x000008, "Wrong alignment on BPI_BattleListener_C_OnCharacterTurnStart");
static_assert(sizeof(BPI_BattleListener_C_OnCharacterTurnStart) == 0x000010, "Wrong size on BPI_BattleListener_C_OnCharacterTurnStart");
static_assert(offsetof(BPI_BattleListener_C_OnCharacterTurnStart, CharacterStats) == 0x000000, "Member 'BPI_BattleListener_C_OnCharacterTurnStart::CharacterStats' has a wrong offset!");
static_assert(offsetof(BPI_BattleListener_C_OnCharacterTurnStart, TurnStartDependencies) == 0x000008, "Member 'BPI_BattleListener_C_OnCharacterTurnStart::TurnStartDependencies' has a wrong offset!");

// Function BPI_BattleListener.BPI_BattleListener_C.ProcessAddBuffAction
// 0x0008 (0x0008 - 0x0000)
struct BPI_BattleListener_C_ProcessAddBuffAction final
{
public:
	const class UAction_AddBuff_C*                BuffAddAction;                                     // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_BattleListener_C_ProcessAddBuffAction) == 0x000008, "Wrong alignment on BPI_BattleListener_C_ProcessAddBuffAction");
static_assert(sizeof(BPI_BattleListener_C_ProcessAddBuffAction) == 0x000008, "Wrong size on BPI_BattleListener_C_ProcessAddBuffAction");
static_assert(offsetof(BPI_BattleListener_C_ProcessAddBuffAction, BuffAddAction) == 0x000000, "Member 'BPI_BattleListener_C_ProcessAddBuffAction::BuffAddAction' has a wrong offset!");

}

