#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPI_Dialogue_SpeakerSlot

#include "Basic.hpp"


namespace SDK::Params
{

// Function BPI_Dialogue_SpeakerSlot.BPI_Dialogue_SpeakerSlot_C.AreDependenciesLoaded
// 0x0001 (0x0001 - 0x0000)
struct BPI_Dialogue_SpeakerSlot_C_AreDependenciesLoaded final
{
public:
	bool                                          AreLoaded;                                         // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_Dialogue_SpeakerSlot_C_AreDependenciesLoaded) == 0x000001, "Wrong alignment on BPI_Dialogue_SpeakerSlot_C_AreDependenciesLoaded");
static_assert(sizeof(BPI_Dialogue_SpeakerSlot_C_AreDependenciesLoaded) == 0x000001, "Wrong size on BPI_Dialogue_SpeakerSlot_C_AreDependenciesLoaded");
static_assert(offsetof(BPI_Dialogue_SpeakerSlot_C_AreDependenciesLoaded, AreLoaded) == 0x000000, "Member 'BPI_Dialogue_SpeakerSlot_C_AreDependenciesLoaded::AreLoaded' has a wrong offset!");

// Function BPI_Dialogue_SpeakerSlot.BPI_Dialogue_SpeakerSlot_C.GetAssetDialogueCharacter
// 0x0008 (0x0008 - 0x0000)
struct BPI_Dialogue_SpeakerSlot_C_GetAssetDialogueCharacter final
{
public:
	class UBP_DataAsset_DialogueCharacter_C*      DialogueCharacter;                                 // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_Dialogue_SpeakerSlot_C_GetAssetDialogueCharacter) == 0x000008, "Wrong alignment on BPI_Dialogue_SpeakerSlot_C_GetAssetDialogueCharacter");
static_assert(sizeof(BPI_Dialogue_SpeakerSlot_C_GetAssetDialogueCharacter) == 0x000008, "Wrong size on BPI_Dialogue_SpeakerSlot_C_GetAssetDialogueCharacter");
static_assert(offsetof(BPI_Dialogue_SpeakerSlot_C_GetAssetDialogueCharacter, DialogueCharacter) == 0x000000, "Member 'BPI_Dialogue_SpeakerSlot_C_GetAssetDialogueCharacter::DialogueCharacter' has a wrong offset!");

// Function BPI_Dialogue_SpeakerSlot.BPI_Dialogue_SpeakerSlot_C.GetCameraComponent
// 0x0008 (0x0008 - 0x0000)
struct BPI_Dialogue_SpeakerSlot_C_GetCameraComponent final
{
public:
	class UCameraComponent*                       Camera;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_Dialogue_SpeakerSlot_C_GetCameraComponent) == 0x000008, "Wrong alignment on BPI_Dialogue_SpeakerSlot_C_GetCameraComponent");
static_assert(sizeof(BPI_Dialogue_SpeakerSlot_C_GetCameraComponent) == 0x000008, "Wrong size on BPI_Dialogue_SpeakerSlot_C_GetCameraComponent");
static_assert(offsetof(BPI_Dialogue_SpeakerSlot_C_GetCameraComponent, Camera) == 0x000000, "Member 'BPI_Dialogue_SpeakerSlot_C_GetCameraComponent::Camera' has a wrong offset!");

// Function BPI_Dialogue_SpeakerSlot.BPI_Dialogue_SpeakerSlot_C.GetCharacterActor
// 0x0008 (0x0008 - 0x0000)
struct BPI_Dialogue_SpeakerSlot_C_GetCharacterActor final
{
public:
	class AActor*                                 Character;                                         // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_Dialogue_SpeakerSlot_C_GetCharacterActor) == 0x000008, "Wrong alignment on BPI_Dialogue_SpeakerSlot_C_GetCharacterActor");
static_assert(sizeof(BPI_Dialogue_SpeakerSlot_C_GetCharacterActor) == 0x000008, "Wrong size on BPI_Dialogue_SpeakerSlot_C_GetCharacterActor");
static_assert(offsetof(BPI_Dialogue_SpeakerSlot_C_GetCharacterActor, Character) == 0x000000, "Member 'BPI_Dialogue_SpeakerSlot_C_GetCharacterActor::Character' has a wrong offset!");

// Function BPI_Dialogue_SpeakerSlot.BPI_Dialogue_SpeakerSlot_C.GetDialogueCharacterInterface
// 0x0010 (0x0010 - 0x0000)
struct BPI_Dialogue_SpeakerSlot_C_GetDialogueCharacterInterface final
{
public:
	TScriptInterface<class IBPI_DialogueCharacter_C> ReturnValue;                                    // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_Dialogue_SpeakerSlot_C_GetDialogueCharacterInterface) == 0x000008, "Wrong alignment on BPI_Dialogue_SpeakerSlot_C_GetDialogueCharacterInterface");
static_assert(sizeof(BPI_Dialogue_SpeakerSlot_C_GetDialogueCharacterInterface) == 0x000010, "Wrong size on BPI_Dialogue_SpeakerSlot_C_GetDialogueCharacterInterface");
static_assert(offsetof(BPI_Dialogue_SpeakerSlot_C_GetDialogueCharacterInterface, ReturnValue) == 0x000000, "Member 'BPI_Dialogue_SpeakerSlot_C_GetDialogueCharacterInterface::ReturnValue' has a wrong offset!");

}

