#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPI_LevelSequenceExecutor_Interface

#include "Basic.hpp"


namespace SDK::Params
{

// Function BPI_LevelSequenceExecutor_Interface.BPI_LevelSequenceExecutor_Interface_C.OnSequenceStateLoaded
// 0x0001 (0x0001 - 0x0000)
struct BPI_LevelSequenceExecutor_Interface_C_OnSequenceStateLoaded final
{
public:
	bool                                          State;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_LevelSequenceExecutor_Interface_C_OnSequenceStateLoaded) == 0x000001, "Wrong alignment on BPI_LevelSequenceExecutor_Interface_C_OnSequenceStateLoaded");
static_assert(sizeof(BPI_LevelSequenceExecutor_Interface_C_OnSequenceStateLoaded) == 0x000001, "Wrong size on BPI_LevelSequenceExecutor_Interface_C_OnSequenceStateLoaded");
static_assert(offsetof(BPI_LevelSequenceExecutor_Interface_C_OnSequenceStateLoaded, State) == 0x000000, "Member 'BPI_LevelSequenceExecutor_Interface_C_OnSequenceStateLoaded::State' has a wrong offset!");

// Function BPI_LevelSequenceExecutor_Interface.BPI_LevelSequenceExecutor_Interface_C.IsSequencePlayed
// 0x0001 (0x0001 - 0x0000)
struct BPI_LevelSequenceExecutor_Interface_C_IsSequencePlayed final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_LevelSequenceExecutor_Interface_C_IsSequencePlayed) == 0x000001, "Wrong alignment on BPI_LevelSequenceExecutor_Interface_C_IsSequencePlayed");
static_assert(sizeof(BPI_LevelSequenceExecutor_Interface_C_IsSequencePlayed) == 0x000001, "Wrong size on BPI_LevelSequenceExecutor_Interface_C_IsSequencePlayed");
static_assert(offsetof(BPI_LevelSequenceExecutor_Interface_C_IsSequencePlayed, ReturnValue) == 0x000000, "Member 'BPI_LevelSequenceExecutor_Interface_C_IsSequencePlayed::ReturnValue' has a wrong offset!");

}

