#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPT_SelectRandomDestination

#include "Basic.hpp"

#include "AIModule_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BPT_SelectRandomDestination.BPT_SelectRandomDestination_C.ExecuteUbergraph_BPT_SelectRandomDestination
// 0x0070 (0x0070 - 0x0000)
struct BPT_SelectRandomDestination_C_ExecuteUbergraph_BPT_SelectRandomDestination final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_OwnerActor;                           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FBlackboardKeySelector                 K2Node_MakeStruct_BlackboardKeySelector;           // 0x0010(0x0028)()
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetRandomReachablePointInRadius_RandomLocation; // 0x0050(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_GetRandomReachablePointInRadius_ReturnValue; // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_K2_GetRandomReachablePointInRadius_Radius_ImplicitCast; // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPT_SelectRandomDestination_C_ExecuteUbergraph_BPT_SelectRandomDestination) == 0x000008, "Wrong alignment on BPT_SelectRandomDestination_C_ExecuteUbergraph_BPT_SelectRandomDestination");
static_assert(sizeof(BPT_SelectRandomDestination_C_ExecuteUbergraph_BPT_SelectRandomDestination) == 0x000070, "Wrong size on BPT_SelectRandomDestination_C_ExecuteUbergraph_BPT_SelectRandomDestination");
static_assert(offsetof(BPT_SelectRandomDestination_C_ExecuteUbergraph_BPT_SelectRandomDestination, EntryPoint) == 0x000000, "Member 'BPT_SelectRandomDestination_C_ExecuteUbergraph_BPT_SelectRandomDestination::EntryPoint' has a wrong offset!");
static_assert(offsetof(BPT_SelectRandomDestination_C_ExecuteUbergraph_BPT_SelectRandomDestination, K2Node_Event_OwnerActor) == 0x000008, "Member 'BPT_SelectRandomDestination_C_ExecuteUbergraph_BPT_SelectRandomDestination::K2Node_Event_OwnerActor' has a wrong offset!");
static_assert(offsetof(BPT_SelectRandomDestination_C_ExecuteUbergraph_BPT_SelectRandomDestination, K2Node_MakeStruct_BlackboardKeySelector) == 0x000010, "Member 'BPT_SelectRandomDestination_C_ExecuteUbergraph_BPT_SelectRandomDestination::K2Node_MakeStruct_BlackboardKeySelector' has a wrong offset!");
static_assert(offsetof(BPT_SelectRandomDestination_C_ExecuteUbergraph_BPT_SelectRandomDestination, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000038, "Member 'BPT_SelectRandomDestination_C_ExecuteUbergraph_BPT_SelectRandomDestination::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPT_SelectRandomDestination_C_ExecuteUbergraph_BPT_SelectRandomDestination, CallFunc_K2_GetRandomReachablePointInRadius_RandomLocation) == 0x000050, "Member 'BPT_SelectRandomDestination_C_ExecuteUbergraph_BPT_SelectRandomDestination::CallFunc_K2_GetRandomReachablePointInRadius_RandomLocation' has a wrong offset!");
static_assert(offsetof(BPT_SelectRandomDestination_C_ExecuteUbergraph_BPT_SelectRandomDestination, CallFunc_K2_GetRandomReachablePointInRadius_ReturnValue) == 0x000068, "Member 'BPT_SelectRandomDestination_C_ExecuteUbergraph_BPT_SelectRandomDestination::CallFunc_K2_GetRandomReachablePointInRadius_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPT_SelectRandomDestination_C_ExecuteUbergraph_BPT_SelectRandomDestination, CallFunc_K2_GetRandomReachablePointInRadius_Radius_ImplicitCast) == 0x00006C, "Member 'BPT_SelectRandomDestination_C_ExecuteUbergraph_BPT_SelectRandomDestination::CallFunc_K2_GetRandomReachablePointInRadius_Radius_ImplicitCast' has a wrong offset!");

// Function BPT_SelectRandomDestination.BPT_SelectRandomDestination_C.ReceiveExecute
// 0x0008 (0x0008 - 0x0000)
struct BPT_SelectRandomDestination_C_ReceiveExecute final
{
public:
	class AActor*                                 OwnerActor;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPT_SelectRandomDestination_C_ReceiveExecute) == 0x000008, "Wrong alignment on BPT_SelectRandomDestination_C_ReceiveExecute");
static_assert(sizeof(BPT_SelectRandomDestination_C_ReceiveExecute) == 0x000008, "Wrong size on BPT_SelectRandomDestination_C_ReceiveExecute");
static_assert(offsetof(BPT_SelectRandomDestination_C_ReceiveExecute, OwnerActor) == 0x000000, "Member 'BPT_SelectRandomDestination_C_ReceiveExecute::OwnerActor' has a wrong offset!");

}

