#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTDecorator_ActorIsInMovementMode

#include "Basic.hpp"


namespace SDK::Params
{

// Function BTDecorator_ActorIsInMovementMode.BTDecorator_ActorIsInMovementMode_C.PerformConditionCheckAI
// 0x0038 (0x0038 - 0x0000)
struct BTDecorator_ActorIsInMovementMode_C_PerformConditionCheckAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_GetBlackboardValueAsObject_ReturnValue;   // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             K2Node_DynamicCast_AsCharacter;                    // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x2];                                       // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTDecorator_ActorIsInMovementMode_C_PerformConditionCheckAI) == 0x000008, "Wrong alignment on BTDecorator_ActorIsInMovementMode_C_PerformConditionCheckAI");
static_assert(sizeof(BTDecorator_ActorIsInMovementMode_C_PerformConditionCheckAI) == 0x000038, "Wrong size on BTDecorator_ActorIsInMovementMode_C_PerformConditionCheckAI");
static_assert(offsetof(BTDecorator_ActorIsInMovementMode_C_PerformConditionCheckAI, OwnerController) == 0x000000, "Member 'BTDecorator_ActorIsInMovementMode_C_PerformConditionCheckAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTDecorator_ActorIsInMovementMode_C_PerformConditionCheckAI, ControlledPawn) == 0x000008, "Member 'BTDecorator_ActorIsInMovementMode_C_PerformConditionCheckAI::ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTDecorator_ActorIsInMovementMode_C_PerformConditionCheckAI, ReturnValue) == 0x000010, "Member 'BTDecorator_ActorIsInMovementMode_C_PerformConditionCheckAI::ReturnValue' has a wrong offset!");
static_assert(offsetof(BTDecorator_ActorIsInMovementMode_C_PerformConditionCheckAI, CallFunc_GetBlackboardValueAsObject_ReturnValue) == 0x000018, "Member 'BTDecorator_ActorIsInMovementMode_C_PerformConditionCheckAI::CallFunc_GetBlackboardValueAsObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTDecorator_ActorIsInMovementMode_C_PerformConditionCheckAI, K2Node_DynamicCast_AsCharacter) == 0x000020, "Member 'BTDecorator_ActorIsInMovementMode_C_PerformConditionCheckAI::K2Node_DynamicCast_AsCharacter' has a wrong offset!");
static_assert(offsetof(BTDecorator_ActorIsInMovementMode_C_PerformConditionCheckAI, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BTDecorator_ActorIsInMovementMode_C_PerformConditionCheckAI::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BTDecorator_ActorIsInMovementMode_C_PerformConditionCheckAI, CallFunc_IsValid_ReturnValue) == 0x000029, "Member 'BTDecorator_ActorIsInMovementMode_C_PerformConditionCheckAI::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTDecorator_ActorIsInMovementMode_C_PerformConditionCheckAI, CallFunc_Array_Find_ReturnValue) == 0x00002C, "Member 'BTDecorator_ActorIsInMovementMode_C_PerformConditionCheckAI::CallFunc_Array_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTDecorator_ActorIsInMovementMode_C_PerformConditionCheckAI, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000030, "Member 'BTDecorator_ActorIsInMovementMode_C_PerformConditionCheckAI::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");

}

