#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTDecorator_ClearBlackboardEntry

#include "Basic.hpp"

#include "E_DecoratorCallbackType_structs.hpp"
#include "Engine_structs.hpp"
#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BTDecorator_ClearBlackboardEntry.BTDecorator_ClearBlackboardEntry_C
// 0x0038 (0x00D8 - 0x00A0)
class UBTDecorator_ClearBlackboardEntry_C final : public UBTDecorator_BlueprintBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	E_DecoratorCallbackType                       CallbackType;                                      // 0x00A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBlackboardKeySelector                 KeySelector;                                       // 0x00B0(0x0028)(Edit, BlueprintVisible)

public:
	void ExecuteUbergraph_BTDecorator_ClearBlackboardEntry(int32 EntryPoint);
	bool PerformConditionCheck(class AActor* OwnerActor);
	void ReceiveExecutionFinishAI(class AAIController* OwnerController, class APawn* ControlledPawn, EBTNodeResult NodeResult);
	void ReceiveExecutionStartAI(class AAIController* OwnerController, class APawn* ControlledPawn);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BTDecorator_ClearBlackboardEntry_C">();
	}
	static class UBTDecorator_ClearBlackboardEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTDecorator_ClearBlackboardEntry_C>();
	}
};
static_assert(alignof(UBTDecorator_ClearBlackboardEntry_C) == 0x000008, "Wrong alignment on UBTDecorator_ClearBlackboardEntry_C");
static_assert(sizeof(UBTDecorator_ClearBlackboardEntry_C) == 0x0000D8, "Wrong size on UBTDecorator_ClearBlackboardEntry_C");
static_assert(offsetof(UBTDecorator_ClearBlackboardEntry_C, UberGraphFrame) == 0x0000A0, "Member 'UBTDecorator_ClearBlackboardEntry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBTDecorator_ClearBlackboardEntry_C, CallbackType) == 0x0000A8, "Member 'UBTDecorator_ClearBlackboardEntry_C::CallbackType' has a wrong offset!");
static_assert(offsetof(UBTDecorator_ClearBlackboardEntry_C, KeySelector) == 0x0000B0, "Member 'UBTDecorator_ClearBlackboardEntry_C::KeySelector' has a wrong offset!");

}

