#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTService_UpdatePlayerCharacterParameters

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BTService_UpdatePlayerCharacterParameters.BTService_UpdatePlayerCharacterParameters_C.ExecuteUbergraph_BTService_UpdatePlayerCharacterParameters
// 0x0048 (0x0048 - 0x0000)
struct BTService_UpdatePlayerCharacterParameters_C_ExecuteUbergraph_BTService_UpdatePlayerCharacterParameters final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0010(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTService_UpdatePlayerCharacterParameters_C_ExecuteUbergraph_BTService_UpdatePlayerCharacterParameters) == 0x000008, "Wrong alignment on BTService_UpdatePlayerCharacterParameters_C_ExecuteUbergraph_BTService_UpdatePlayerCharacterParameters");
static_assert(sizeof(BTService_UpdatePlayerCharacterParameters_C_ExecuteUbergraph_BTService_UpdatePlayerCharacterParameters) == 0x000048, "Wrong size on BTService_UpdatePlayerCharacterParameters_C_ExecuteUbergraph_BTService_UpdatePlayerCharacterParameters");
static_assert(offsetof(BTService_UpdatePlayerCharacterParameters_C_ExecuteUbergraph_BTService_UpdatePlayerCharacterParameters, EntryPoint) == 0x000000, "Member 'BTService_UpdatePlayerCharacterParameters_C_ExecuteUbergraph_BTService_UpdatePlayerCharacterParameters::EntryPoint' has a wrong offset!");
static_assert(offsetof(BTService_UpdatePlayerCharacterParameters_C_ExecuteUbergraph_BTService_UpdatePlayerCharacterParameters, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000008, "Member 'BTService_UpdatePlayerCharacterParameters_C_ExecuteUbergraph_BTService_UpdatePlayerCharacterParameters::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTService_UpdatePlayerCharacterParameters_C_ExecuteUbergraph_BTService_UpdatePlayerCharacterParameters, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000010, "Member 'BTService_UpdatePlayerCharacterParameters_C_ExecuteUbergraph_BTService_UpdatePlayerCharacterParameters::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTService_UpdatePlayerCharacterParameters_C_ExecuteUbergraph_BTService_UpdatePlayerCharacterParameters, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'BTService_UpdatePlayerCharacterParameters_C_ExecuteUbergraph_BTService_UpdatePlayerCharacterParameters::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTService_UpdatePlayerCharacterParameters_C_ExecuteUbergraph_BTService_UpdatePlayerCharacterParameters, K2Node_Event_OwnerController) == 0x000030, "Member 'BTService_UpdatePlayerCharacterParameters_C_ExecuteUbergraph_BTService_UpdatePlayerCharacterParameters::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(BTService_UpdatePlayerCharacterParameters_C_ExecuteUbergraph_BTService_UpdatePlayerCharacterParameters, K2Node_Event_ControlledPawn) == 0x000038, "Member 'BTService_UpdatePlayerCharacterParameters_C_ExecuteUbergraph_BTService_UpdatePlayerCharacterParameters::K2Node_Event_ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTService_UpdatePlayerCharacterParameters_C_ExecuteUbergraph_BTService_UpdatePlayerCharacterParameters, K2Node_Event_DeltaSeconds) == 0x000040, "Member 'BTService_UpdatePlayerCharacterParameters_C_ExecuteUbergraph_BTService_UpdatePlayerCharacterParameters::K2Node_Event_DeltaSeconds' has a wrong offset!");

// Function BTService_UpdatePlayerCharacterParameters.BTService_UpdatePlayerCharacterParameters_C.ReceiveTickAI
// 0x0018 (0x0018 - 0x0000)
struct BTService_UpdatePlayerCharacterParameters_C_ReceiveTickAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaSeconds;                                      // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTService_UpdatePlayerCharacterParameters_C_ReceiveTickAI) == 0x000008, "Wrong alignment on BTService_UpdatePlayerCharacterParameters_C_ReceiveTickAI");
static_assert(sizeof(BTService_UpdatePlayerCharacterParameters_C_ReceiveTickAI) == 0x000018, "Wrong size on BTService_UpdatePlayerCharacterParameters_C_ReceiveTickAI");
static_assert(offsetof(BTService_UpdatePlayerCharacterParameters_C_ReceiveTickAI, OwnerController) == 0x000000, "Member 'BTService_UpdatePlayerCharacterParameters_C_ReceiveTickAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTService_UpdatePlayerCharacterParameters_C_ReceiveTickAI, ControlledPawn) == 0x000008, "Member 'BTService_UpdatePlayerCharacterParameters_C_ReceiveTickAI::ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTService_UpdatePlayerCharacterParameters_C_ReceiveTickAI, DeltaSeconds) == 0x000010, "Member 'BTService_UpdatePlayerCharacterParameters_C_ReceiveTickAI::DeltaSeconds' has a wrong offset!");

}

