#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTService_ComputeDistanceBetweenActors

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BTService_ComputeDistanceBetweenActors.BTService_ComputeDistanceBetweenActors_C
// 0x0080 (0x0118 - 0x0098)
class UBTService_ComputeDistanceBetweenActors_C final : public UBTService_BlueprintBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0098(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FBlackboardKeySelector                 KeySelectorFirstActor;                             // 0x00A0(0x0028)(Edit, BlueprintVisible)
	struct FBlackboardKeySelector                 KeySelectorSecondActor;                            // 0x00C8(0x0028)(Edit, BlueprintVisible)
	struct FBlackboardKeySelector                 KeySelectorDistance;                               // 0x00F0(0x0028)(Edit, BlueprintVisible)

public:
	void ExecuteUbergraph_BTService_ComputeDistanceBetweenActors(int32 EntryPoint);
	struct FVector GetActorLocationFromKeySelector(const struct FBlackboardKeySelector& Key, bool* IsValid);
	void ReceiveTickAI(class AAIController* OwnerController, class APawn* ControlledPawn, float DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BTService_ComputeDistanceBetweenActors_C">();
	}
	static class UBTService_ComputeDistanceBetweenActors_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTService_ComputeDistanceBetweenActors_C>();
	}
};
static_assert(alignof(UBTService_ComputeDistanceBetweenActors_C) == 0x000008, "Wrong alignment on UBTService_ComputeDistanceBetweenActors_C");
static_assert(sizeof(UBTService_ComputeDistanceBetweenActors_C) == 0x000118, "Wrong size on UBTService_ComputeDistanceBetweenActors_C");
static_assert(offsetof(UBTService_ComputeDistanceBetweenActors_C, UberGraphFrame) == 0x000098, "Member 'UBTService_ComputeDistanceBetweenActors_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBTService_ComputeDistanceBetweenActors_C, KeySelectorFirstActor) == 0x0000A0, "Member 'UBTService_ComputeDistanceBetweenActors_C::KeySelectorFirstActor' has a wrong offset!");
static_assert(offsetof(UBTService_ComputeDistanceBetweenActors_C, KeySelectorSecondActor) == 0x0000C8, "Member 'UBTService_ComputeDistanceBetweenActors_C::KeySelectorSecondActor' has a wrong offset!");
static_assert(offsetof(UBTService_ComputeDistanceBetweenActors_C, KeySelectorDistance) == 0x0000F0, "Member 'UBTService_ComputeDistanceBetweenActors_C::KeySelectorDistance' has a wrong offset!");

}

