#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTService_UpdateWaitingPointParameters

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BTService_UpdateWaitingPointParameters.BTService_UpdateWaitingPointParameters_C
// 0x0080 (0x0118 - 0x0098)
class UBTService_UpdateWaitingPointParameters_C final : public UBTService_BlueprintBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0098(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FBlackboardKeySelector                 KeySelectorWaitingPointLocation;                   // 0x00A0(0x0028)(Edit, BlueprintVisible)
	struct FBlackboardKeySelector                 KeySelectorWaitingPointDistance;                   // 0x00C8(0x0028)(Edit, BlueprintVisible)
	struct FBlackboardKeySelector                 KeySelectorWaitingPointRotation;                   // 0x00F0(0x0028)(Edit, BlueprintVisible)

public:
	void ResetBlackboardValues(class APawn* ControlledPawn);
	void ReceiveTickAI(class AAIController* OwnerController, class APawn* ControlledPawn, float DeltaSeconds);
	void ExecuteUbergraph_BTService_UpdateWaitingPointParameters(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BTService_UpdateWaitingPointParameters_C">();
	}
	static class UBTService_UpdateWaitingPointParameters_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTService_UpdateWaitingPointParameters_C>();
	}
};
static_assert(alignof(UBTService_UpdateWaitingPointParameters_C) == 0x000008, "Wrong alignment on UBTService_UpdateWaitingPointParameters_C");
static_assert(sizeof(UBTService_UpdateWaitingPointParameters_C) == 0x000118, "Wrong size on UBTService_UpdateWaitingPointParameters_C");
static_assert(offsetof(UBTService_UpdateWaitingPointParameters_C, UberGraphFrame) == 0x000098, "Member 'UBTService_UpdateWaitingPointParameters_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBTService_UpdateWaitingPointParameters_C, KeySelectorWaitingPointLocation) == 0x0000A0, "Member 'UBTService_UpdateWaitingPointParameters_C::KeySelectorWaitingPointLocation' has a wrong offset!");
static_assert(offsetof(UBTService_UpdateWaitingPointParameters_C, KeySelectorWaitingPointDistance) == 0x0000C8, "Member 'UBTService_UpdateWaitingPointParameters_C::KeySelectorWaitingPointDistance' has a wrong offset!");
static_assert(offsetof(UBTService_UpdateWaitingPointParameters_C, KeySelectorWaitingPointRotation) == 0x0000F0, "Member 'UBTService_UpdateWaitingPointParameters_C::KeySelectorWaitingPointRotation' has a wrong offset!");

}

