#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTService_UpdateSmartObjectParameters

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BTService_UpdateSmartObjectParameters.BTService_UpdateSmartObjectParameters_C
// 0x00B0 (0x0148 - 0x0098)
class UBTService_UpdateSmartObjectParameters_C final : public UBTService_BlueprintBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0098(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FBlackboardKeySelector                 KeySelectorSmartObjectSearchBoxExtent;             // 0x00A0(0x0028)(Edit, BlueprintVisible)
	struct FBlackboardKeySelector                 KeySelectorSmartObjectSearchCooldown;              // 0x00C8(0x0028)(Edit, BlueprintVisible)
	struct FBlackboardKeySelector                 KeySelectorSmartObjectClaimProbability;            // 0x00F0(0x0028)(Edit, BlueprintVisible)
	struct FBlackboardKeySelector                 KeySelectorSmartObjectInUse;                       // 0x0118(0x0028)(Edit, BlueprintVisible)
	class UBP_SmartObjectInteractorComponent_C*   SmartObjectInteractorComponentRef;                 // 0x0140(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BTService_UpdateSmartObjectParameters(int32 EntryPoint);
	void ReceiveActivationAI(class AAIController* OwnerController, class APawn* ControlledPawn);
	void ReceiveDeactivationAI(class AAIController* OwnerController, class APawn* ControlledPawn);
	void ReceiveTickAI(class AAIController* OwnerController, class APawn* ControlledPawn, float DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BTService_UpdateSmartObjectParameters_C">();
	}
	static class UBTService_UpdateSmartObjectParameters_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTService_UpdateSmartObjectParameters_C>();
	}
};
static_assert(alignof(UBTService_UpdateSmartObjectParameters_C) == 0x000008, "Wrong alignment on UBTService_UpdateSmartObjectParameters_C");
static_assert(sizeof(UBTService_UpdateSmartObjectParameters_C) == 0x000148, "Wrong size on UBTService_UpdateSmartObjectParameters_C");
static_assert(offsetof(UBTService_UpdateSmartObjectParameters_C, UberGraphFrame) == 0x000098, "Member 'UBTService_UpdateSmartObjectParameters_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBTService_UpdateSmartObjectParameters_C, KeySelectorSmartObjectSearchBoxExtent) == 0x0000A0, "Member 'UBTService_UpdateSmartObjectParameters_C::KeySelectorSmartObjectSearchBoxExtent' has a wrong offset!");
static_assert(offsetof(UBTService_UpdateSmartObjectParameters_C, KeySelectorSmartObjectSearchCooldown) == 0x0000C8, "Member 'UBTService_UpdateSmartObjectParameters_C::KeySelectorSmartObjectSearchCooldown' has a wrong offset!");
static_assert(offsetof(UBTService_UpdateSmartObjectParameters_C, KeySelectorSmartObjectClaimProbability) == 0x0000F0, "Member 'UBTService_UpdateSmartObjectParameters_C::KeySelectorSmartObjectClaimProbability' has a wrong offset!");
static_assert(offsetof(UBTService_UpdateSmartObjectParameters_C, KeySelectorSmartObjectInUse) == 0x000118, "Member 'UBTService_UpdateSmartObjectParameters_C::KeySelectorSmartObjectInUse' has a wrong offset!");
static_assert(offsetof(UBTService_UpdateSmartObjectParameters_C, SmartObjectInteractorComponentRef) == 0x000140, "Member 'UBTService_UpdateSmartObjectParameters_C::SmartObjectInteractorComponentRef' has a wrong offset!");

}

