#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTService_AICompanion_UpdateDestination

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BTService_AICompanion_UpdateDestination.BTService_AICompanion_UpdateDestination_C
// 0x0098 (0x0130 - 0x0098)
class UBTService_AICompanion_UpdateDestination_C final : public UBTService_BlueprintBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0098(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FBlackboardKeySelector                 DestinationBlackboardKeySelector;                  // 0x00A0(0x0028)(Edit, BlueprintVisible)
	struct FVector                                QueryExtentToNavMesh;                              // 0x00C8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBlackboardKeySelector                 ActorBlackboardKeySelector;                        // 0x00E0(0x0028)(Edit, BlueprintVisible)
	struct FBlackboardKeySelector                 DistanceToDestinationBlackboardKeySelector;        // 0x0108(0x0028)(Edit, BlueprintVisible)

public:
	void ClearBlackboardValues();
	void ExecuteUbergraph_BTService_AICompanion_UpdateDestination(int32 EntryPoint);
	void ReceiveDeactivationAI(class AAIController* OwnerController, class APawn* ControlledPawn);
	void ReceiveTickAI(class AAIController* OwnerController, class APawn* ControlledPawn, float DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BTService_AICompanion_UpdateDestination_C">();
	}
	static class UBTService_AICompanion_UpdateDestination_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTService_AICompanion_UpdateDestination_C>();
	}
};
static_assert(alignof(UBTService_AICompanion_UpdateDestination_C) == 0x000008, "Wrong alignment on UBTService_AICompanion_UpdateDestination_C");
static_assert(sizeof(UBTService_AICompanion_UpdateDestination_C) == 0x000130, "Wrong size on UBTService_AICompanion_UpdateDestination_C");
static_assert(offsetof(UBTService_AICompanion_UpdateDestination_C, UberGraphFrame) == 0x000098, "Member 'UBTService_AICompanion_UpdateDestination_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBTService_AICompanion_UpdateDestination_C, DestinationBlackboardKeySelector) == 0x0000A0, "Member 'UBTService_AICompanion_UpdateDestination_C::DestinationBlackboardKeySelector' has a wrong offset!");
static_assert(offsetof(UBTService_AICompanion_UpdateDestination_C, QueryExtentToNavMesh) == 0x0000C8, "Member 'UBTService_AICompanion_UpdateDestination_C::QueryExtentToNavMesh' has a wrong offset!");
static_assert(offsetof(UBTService_AICompanion_UpdateDestination_C, ActorBlackboardKeySelector) == 0x0000E0, "Member 'UBTService_AICompanion_UpdateDestination_C::ActorBlackboardKeySelector' has a wrong offset!");
static_assert(offsetof(UBTService_AICompanion_UpdateDestination_C, DistanceToDestinationBlackboardKeySelector) == 0x000108, "Member 'UBTService_AICompanion_UpdateDestination_C::DistanceToDestinationBlackboardKeySelector' has a wrong offset!");

}

