#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTService_UpdateSmartObjectParameters

#include "Basic.hpp"


namespace SDK::Params
{

// Function BTService_UpdateSmartObjectParameters.BTService_UpdateSmartObjectParameters_C.ExecuteUbergraph_BTService_UpdateSmartObjectParameters
// 0x0060 (0x0060 - 0x0000)
struct BTService_UpdateSmartObjectParameters_C_ExecuteUbergraph_BTService_UpdateSmartObjectParameters final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController_2;                    // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn_2;                     // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_SmartObjectInteractorComponent_C*   CallFunc_GetComponentByClass_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetBlackboardValueAsBool_ReturnValue;     // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController_1;                    // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn_1;                     // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52[0x2];                                       // 0x0052(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetBlackboardValueAsFloat_Value_ImplicitCast; // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetBlackboardValueAsFloat_Value_ImplicitCast_1; // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetBlackboardValueAsFloat_Value_ImplicitCast_2; // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTService_UpdateSmartObjectParameters_C_ExecuteUbergraph_BTService_UpdateSmartObjectParameters) == 0x000008, "Wrong alignment on BTService_UpdateSmartObjectParameters_C_ExecuteUbergraph_BTService_UpdateSmartObjectParameters");
static_assert(sizeof(BTService_UpdateSmartObjectParameters_C_ExecuteUbergraph_BTService_UpdateSmartObjectParameters) == 0x000060, "Wrong size on BTService_UpdateSmartObjectParameters_C_ExecuteUbergraph_BTService_UpdateSmartObjectParameters");
static_assert(offsetof(BTService_UpdateSmartObjectParameters_C_ExecuteUbergraph_BTService_UpdateSmartObjectParameters, EntryPoint) == 0x000000, "Member 'BTService_UpdateSmartObjectParameters_C_ExecuteUbergraph_BTService_UpdateSmartObjectParameters::EntryPoint' has a wrong offset!");
static_assert(offsetof(BTService_UpdateSmartObjectParameters_C_ExecuteUbergraph_BTService_UpdateSmartObjectParameters, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'BTService_UpdateSmartObjectParameters_C_ExecuteUbergraph_BTService_UpdateSmartObjectParameters::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTService_UpdateSmartObjectParameters_C_ExecuteUbergraph_BTService_UpdateSmartObjectParameters, K2Node_Event_OwnerController_2) == 0x000008, "Member 'BTService_UpdateSmartObjectParameters_C_ExecuteUbergraph_BTService_UpdateSmartObjectParameters::K2Node_Event_OwnerController_2' has a wrong offset!");
static_assert(offsetof(BTService_UpdateSmartObjectParameters_C_ExecuteUbergraph_BTService_UpdateSmartObjectParameters, K2Node_Event_ControlledPawn_2) == 0x000010, "Member 'BTService_UpdateSmartObjectParameters_C_ExecuteUbergraph_BTService_UpdateSmartObjectParameters::K2Node_Event_ControlledPawn_2' has a wrong offset!");
static_assert(offsetof(BTService_UpdateSmartObjectParameters_C_ExecuteUbergraph_BTService_UpdateSmartObjectParameters, CallFunc_GetComponentByClass_ReturnValue) == 0x000018, "Member 'BTService_UpdateSmartObjectParameters_C_ExecuteUbergraph_BTService_UpdateSmartObjectParameters::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTService_UpdateSmartObjectParameters_C_ExecuteUbergraph_BTService_UpdateSmartObjectParameters, CallFunc_GetBlackboardValueAsBool_ReturnValue) == 0x000020, "Member 'BTService_UpdateSmartObjectParameters_C_ExecuteUbergraph_BTService_UpdateSmartObjectParameters::CallFunc_GetBlackboardValueAsBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTService_UpdateSmartObjectParameters_C_ExecuteUbergraph_BTService_UpdateSmartObjectParameters, K2Node_Event_OwnerController_1) == 0x000028, "Member 'BTService_UpdateSmartObjectParameters_C_ExecuteUbergraph_BTService_UpdateSmartObjectParameters::K2Node_Event_OwnerController_1' has a wrong offset!");
static_assert(offsetof(BTService_UpdateSmartObjectParameters_C_ExecuteUbergraph_BTService_UpdateSmartObjectParameters, K2Node_Event_ControlledPawn_1) == 0x000030, "Member 'BTService_UpdateSmartObjectParameters_C_ExecuteUbergraph_BTService_UpdateSmartObjectParameters::K2Node_Event_ControlledPawn_1' has a wrong offset!");
static_assert(offsetof(BTService_UpdateSmartObjectParameters_C_ExecuteUbergraph_BTService_UpdateSmartObjectParameters, K2Node_Event_DeltaSeconds) == 0x000038, "Member 'BTService_UpdateSmartObjectParameters_C_ExecuteUbergraph_BTService_UpdateSmartObjectParameters::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BTService_UpdateSmartObjectParameters_C_ExecuteUbergraph_BTService_UpdateSmartObjectParameters, K2Node_Event_OwnerController) == 0x000040, "Member 'BTService_UpdateSmartObjectParameters_C_ExecuteUbergraph_BTService_UpdateSmartObjectParameters::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(BTService_UpdateSmartObjectParameters_C_ExecuteUbergraph_BTService_UpdateSmartObjectParameters, K2Node_Event_ControlledPawn) == 0x000048, "Member 'BTService_UpdateSmartObjectParameters_C_ExecuteUbergraph_BTService_UpdateSmartObjectParameters::K2Node_Event_ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTService_UpdateSmartObjectParameters_C_ExecuteUbergraph_BTService_UpdateSmartObjectParameters, CallFunc_IsValid_ReturnValue_1) == 0x000050, "Member 'BTService_UpdateSmartObjectParameters_C_ExecuteUbergraph_BTService_UpdateSmartObjectParameters::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BTService_UpdateSmartObjectParameters_C_ExecuteUbergraph_BTService_UpdateSmartObjectParameters, CallFunc_IsValid_ReturnValue_2) == 0x000051, "Member 'BTService_UpdateSmartObjectParameters_C_ExecuteUbergraph_BTService_UpdateSmartObjectParameters::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BTService_UpdateSmartObjectParameters_C_ExecuteUbergraph_BTService_UpdateSmartObjectParameters, CallFunc_SetBlackboardValueAsFloat_Value_ImplicitCast) == 0x000054, "Member 'BTService_UpdateSmartObjectParameters_C_ExecuteUbergraph_BTService_UpdateSmartObjectParameters::CallFunc_SetBlackboardValueAsFloat_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BTService_UpdateSmartObjectParameters_C_ExecuteUbergraph_BTService_UpdateSmartObjectParameters, CallFunc_SetBlackboardValueAsFloat_Value_ImplicitCast_1) == 0x000058, "Member 'BTService_UpdateSmartObjectParameters_C_ExecuteUbergraph_BTService_UpdateSmartObjectParameters::CallFunc_SetBlackboardValueAsFloat_Value_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BTService_UpdateSmartObjectParameters_C_ExecuteUbergraph_BTService_UpdateSmartObjectParameters, CallFunc_SetBlackboardValueAsFloat_Value_ImplicitCast_2) == 0x00005C, "Member 'BTService_UpdateSmartObjectParameters_C_ExecuteUbergraph_BTService_UpdateSmartObjectParameters::CallFunc_SetBlackboardValueAsFloat_Value_ImplicitCast_2' has a wrong offset!");

// Function BTService_UpdateSmartObjectParameters.BTService_UpdateSmartObjectParameters_C.ReceiveActivationAI
// 0x0010 (0x0010 - 0x0000)
struct BTService_UpdateSmartObjectParameters_C_ReceiveActivationAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTService_UpdateSmartObjectParameters_C_ReceiveActivationAI) == 0x000008, "Wrong alignment on BTService_UpdateSmartObjectParameters_C_ReceiveActivationAI");
static_assert(sizeof(BTService_UpdateSmartObjectParameters_C_ReceiveActivationAI) == 0x000010, "Wrong size on BTService_UpdateSmartObjectParameters_C_ReceiveActivationAI");
static_assert(offsetof(BTService_UpdateSmartObjectParameters_C_ReceiveActivationAI, OwnerController) == 0x000000, "Member 'BTService_UpdateSmartObjectParameters_C_ReceiveActivationAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTService_UpdateSmartObjectParameters_C_ReceiveActivationAI, ControlledPawn) == 0x000008, "Member 'BTService_UpdateSmartObjectParameters_C_ReceiveActivationAI::ControlledPawn' has a wrong offset!");

// Function BTService_UpdateSmartObjectParameters.BTService_UpdateSmartObjectParameters_C.ReceiveDeactivationAI
// 0x0010 (0x0010 - 0x0000)
struct BTService_UpdateSmartObjectParameters_C_ReceiveDeactivationAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTService_UpdateSmartObjectParameters_C_ReceiveDeactivationAI) == 0x000008, "Wrong alignment on BTService_UpdateSmartObjectParameters_C_ReceiveDeactivationAI");
static_assert(sizeof(BTService_UpdateSmartObjectParameters_C_ReceiveDeactivationAI) == 0x000010, "Wrong size on BTService_UpdateSmartObjectParameters_C_ReceiveDeactivationAI");
static_assert(offsetof(BTService_UpdateSmartObjectParameters_C_ReceiveDeactivationAI, OwnerController) == 0x000000, "Member 'BTService_UpdateSmartObjectParameters_C_ReceiveDeactivationAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTService_UpdateSmartObjectParameters_C_ReceiveDeactivationAI, ControlledPawn) == 0x000008, "Member 'BTService_UpdateSmartObjectParameters_C_ReceiveDeactivationAI::ControlledPawn' has a wrong offset!");

// Function BTService_UpdateSmartObjectParameters.BTService_UpdateSmartObjectParameters_C.ReceiveTickAI
// 0x0018 (0x0018 - 0x0000)
struct BTService_UpdateSmartObjectParameters_C_ReceiveTickAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaSeconds;                                      // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTService_UpdateSmartObjectParameters_C_ReceiveTickAI) == 0x000008, "Wrong alignment on BTService_UpdateSmartObjectParameters_C_ReceiveTickAI");
static_assert(sizeof(BTService_UpdateSmartObjectParameters_C_ReceiveTickAI) == 0x000018, "Wrong size on BTService_UpdateSmartObjectParameters_C_ReceiveTickAI");
static_assert(offsetof(BTService_UpdateSmartObjectParameters_C_ReceiveTickAI, OwnerController) == 0x000000, "Member 'BTService_UpdateSmartObjectParameters_C_ReceiveTickAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTService_UpdateSmartObjectParameters_C_ReceiveTickAI, ControlledPawn) == 0x000008, "Member 'BTService_UpdateSmartObjectParameters_C_ReceiveTickAI::ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTService_UpdateSmartObjectParameters_C_ReceiveTickAI, DeltaSeconds) == 0x000010, "Member 'BTService_UpdateSmartObjectParameters_C_ReceiveTickAI::DeltaSeconds' has a wrong offset!");

}

