#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTTask_FindSmartObject

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SmartObjectsModule_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BTTask_FindSmartObject.BTTask_FindSmartObject_C.CanSearchSmartObjects
// 0x0018 (0x0018 - 0x0000)
struct BTTask_FindSmartObject_C_CanSearchSmartObjects final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInCooldown_ReturnValue;                 // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x1];                                        // 0x0003(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetBlackboardValueAsFloat_ReturnValue;    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTTask_FindSmartObject_C_CanSearchSmartObjects) == 0x000008, "Wrong alignment on BTTask_FindSmartObject_C_CanSearchSmartObjects");
static_assert(sizeof(BTTask_FindSmartObject_C_CanSearchSmartObjects) == 0x000018, "Wrong size on BTTask_FindSmartObject_C_CanSearchSmartObjects");
static_assert(offsetof(BTTask_FindSmartObject_C_CanSearchSmartObjects, Result) == 0x000000, "Member 'BTTask_FindSmartObject_C_CanSearchSmartObjects::Result' has a wrong offset!");
static_assert(offsetof(BTTask_FindSmartObject_C_CanSearchSmartObjects, CallFunc_IsInCooldown_ReturnValue) == 0x000001, "Member 'BTTask_FindSmartObject_C_CanSearchSmartObjects::CallFunc_IsInCooldown_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTTask_FindSmartObject_C_CanSearchSmartObjects, CallFunc_Not_PreBool_ReturnValue) == 0x000002, "Member 'BTTask_FindSmartObject_C_CanSearchSmartObjects::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTTask_FindSmartObject_C_CanSearchSmartObjects, CallFunc_GetBlackboardValueAsFloat_ReturnValue) == 0x000004, "Member 'BTTask_FindSmartObject_C_CanSearchSmartObjects::CallFunc_GetBlackboardValueAsFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTTask_FindSmartObject_C_CanSearchSmartObjects, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000008, "Member 'BTTask_FindSmartObject_C_CanSearchSmartObjects::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTTask_FindSmartObject_C_CanSearchSmartObjects, CallFunc_BooleanAND_ReturnValue) == 0x000009, "Member 'BTTask_FindSmartObject_C_CanSearchSmartObjects::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTTask_FindSmartObject_C_CanSearchSmartObjects, CallFunc_Greater_DoubleDouble_A_ImplicitCast) == 0x000010, "Member 'BTTask_FindSmartObject_C_CanSearchSmartObjects::CallFunc_Greater_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function BTTask_FindSmartObject.BTTask_FindSmartObject_C.ExecuteUbergraph_BTTask_FindSmartObject
// 0x0100 (0x0100 - 0x0000)
struct BTTask_FindSmartObject_C_ExecuteUbergraph_BTTask_FindSmartObject final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController_1;                    // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn_1;                     // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSmartObjectRequestResult>      CallFunc_SearchForSmartObjects_OutResults;         // 0x0020(0x0010)(ReferenceParm)
	bool                                          CallFunc_Array_IsNotEmpty_ReturnValue;             // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSmartObjectRequestResult              CallFunc_Array_Random_OutItem;                     // 0x0038(0x0018)(NoDestructor)
	int32                                         CallFunc_Array_Random_OutIndex;                    // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSmartObjectRequestResult              Temp_wildcard_Variable;                            // 0x0058(0x0018)(NoDestructor)
	double                                        CallFunc_RandomFloat_ReturnValue;                  // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USmartObjectSubsystem*                  CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Release_ReturnValue;                      // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSmartObjectClaimHandle_ReturnValue; // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_82[0x6];                                       // 0x0082(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USmartObjectSubsystem*                  CallFunc_GetWorldSubsystem_ReturnValue_1;          // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FSmartObjectClaimHandle                CallFunc_Claim_ReturnValue;                        // 0x0090(0x0020)(NoDestructor)
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanSearchSmartObjects_Result;             // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x3];                                       // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetBlackboardValueAsFloat_ReturnValue;    // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloat_ReturnValue_1;                // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USmartObjectSubsystem*                  CallFunc_GetWorldSubsystem_ReturnValue_2;          // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USmartObjectComponent*                  CallFunc_GetSmartObjectComponent_ReturnValue;      // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UBP_SmartObjectComponent_C*             K2Node_DynamicCast_AsBP_Smart_Object_Component;    // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F2[0x6];                                       // 0x00F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_LessEqual_DoubleDouble_B_ImplicitCast;    // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTTask_FindSmartObject_C_ExecuteUbergraph_BTTask_FindSmartObject) == 0x000008, "Wrong alignment on BTTask_FindSmartObject_C_ExecuteUbergraph_BTTask_FindSmartObject");
static_assert(sizeof(BTTask_FindSmartObject_C_ExecuteUbergraph_BTTask_FindSmartObject) == 0x000100, "Wrong size on BTTask_FindSmartObject_C_ExecuteUbergraph_BTTask_FindSmartObject");
static_assert(offsetof(BTTask_FindSmartObject_C_ExecuteUbergraph_BTTask_FindSmartObject, EntryPoint) == 0x000000, "Member 'BTTask_FindSmartObject_C_ExecuteUbergraph_BTTask_FindSmartObject::EntryPoint' has a wrong offset!");
static_assert(offsetof(BTTask_FindSmartObject_C_ExecuteUbergraph_BTTask_FindSmartObject, K2Node_Event_OwnerController_1) == 0x000008, "Member 'BTTask_FindSmartObject_C_ExecuteUbergraph_BTTask_FindSmartObject::K2Node_Event_OwnerController_1' has a wrong offset!");
static_assert(offsetof(BTTask_FindSmartObject_C_ExecuteUbergraph_BTTask_FindSmartObject, K2Node_Event_ControlledPawn_1) == 0x000010, "Member 'BTTask_FindSmartObject_C_ExecuteUbergraph_BTTask_FindSmartObject::K2Node_Event_ControlledPawn_1' has a wrong offset!");
static_assert(offsetof(BTTask_FindSmartObject_C_ExecuteUbergraph_BTTask_FindSmartObject, K2Node_Event_DeltaSeconds) == 0x000018, "Member 'BTTask_FindSmartObject_C_ExecuteUbergraph_BTTask_FindSmartObject::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BTTask_FindSmartObject_C_ExecuteUbergraph_BTTask_FindSmartObject, CallFunc_SearchForSmartObjects_OutResults) == 0x000020, "Member 'BTTask_FindSmartObject_C_ExecuteUbergraph_BTTask_FindSmartObject::CallFunc_SearchForSmartObjects_OutResults' has a wrong offset!");
static_assert(offsetof(BTTask_FindSmartObject_C_ExecuteUbergraph_BTTask_FindSmartObject, CallFunc_Array_IsNotEmpty_ReturnValue) == 0x000030, "Member 'BTTask_FindSmartObject_C_ExecuteUbergraph_BTTask_FindSmartObject::CallFunc_Array_IsNotEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTTask_FindSmartObject_C_ExecuteUbergraph_BTTask_FindSmartObject, CallFunc_Array_Random_OutItem) == 0x000038, "Member 'BTTask_FindSmartObject_C_ExecuteUbergraph_BTTask_FindSmartObject::CallFunc_Array_Random_OutItem' has a wrong offset!");
static_assert(offsetof(BTTask_FindSmartObject_C_ExecuteUbergraph_BTTask_FindSmartObject, CallFunc_Array_Random_OutIndex) == 0x000050, "Member 'BTTask_FindSmartObject_C_ExecuteUbergraph_BTTask_FindSmartObject::CallFunc_Array_Random_OutIndex' has a wrong offset!");
static_assert(offsetof(BTTask_FindSmartObject_C_ExecuteUbergraph_BTTask_FindSmartObject, Temp_wildcard_Variable) == 0x000058, "Member 'BTTask_FindSmartObject_C_ExecuteUbergraph_BTTask_FindSmartObject::Temp_wildcard_Variable' has a wrong offset!");
static_assert(offsetof(BTTask_FindSmartObject_C_ExecuteUbergraph_BTTask_FindSmartObject, CallFunc_RandomFloat_ReturnValue) == 0x000070, "Member 'BTTask_FindSmartObject_C_ExecuteUbergraph_BTTask_FindSmartObject::CallFunc_RandomFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTTask_FindSmartObject_C_ExecuteUbergraph_BTTask_FindSmartObject, CallFunc_GetWorldSubsystem_ReturnValue) == 0x000078, "Member 'BTTask_FindSmartObject_C_ExecuteUbergraph_BTTask_FindSmartObject::CallFunc_GetWorldSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTTask_FindSmartObject_C_ExecuteUbergraph_BTTask_FindSmartObject, CallFunc_Release_ReturnValue) == 0x000080, "Member 'BTTask_FindSmartObject_C_ExecuteUbergraph_BTTask_FindSmartObject::CallFunc_Release_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTTask_FindSmartObject_C_ExecuteUbergraph_BTTask_FindSmartObject, CallFunc_IsValidSmartObjectClaimHandle_ReturnValue) == 0x000081, "Member 'BTTask_FindSmartObject_C_ExecuteUbergraph_BTTask_FindSmartObject::CallFunc_IsValidSmartObjectClaimHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTTask_FindSmartObject_C_ExecuteUbergraph_BTTask_FindSmartObject, CallFunc_GetWorldSubsystem_ReturnValue_1) == 0x000088, "Member 'BTTask_FindSmartObject_C_ExecuteUbergraph_BTTask_FindSmartObject::CallFunc_GetWorldSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BTTask_FindSmartObject_C_ExecuteUbergraph_BTTask_FindSmartObject, CallFunc_Claim_ReturnValue) == 0x000090, "Member 'BTTask_FindSmartObject_C_ExecuteUbergraph_BTTask_FindSmartObject::CallFunc_Claim_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTTask_FindSmartObject_C_ExecuteUbergraph_BTTask_FindSmartObject, K2Node_Event_OwnerController) == 0x0000B0, "Member 'BTTask_FindSmartObject_C_ExecuteUbergraph_BTTask_FindSmartObject::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(BTTask_FindSmartObject_C_ExecuteUbergraph_BTTask_FindSmartObject, K2Node_Event_ControlledPawn) == 0x0000B8, "Member 'BTTask_FindSmartObject_C_ExecuteUbergraph_BTTask_FindSmartObject::K2Node_Event_ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTTask_FindSmartObject_C_ExecuteUbergraph_BTTask_FindSmartObject, CallFunc_CanSearchSmartObjects_Result) == 0x0000C0, "Member 'BTTask_FindSmartObject_C_ExecuteUbergraph_BTTask_FindSmartObject::CallFunc_CanSearchSmartObjects_Result' has a wrong offset!");
static_assert(offsetof(BTTask_FindSmartObject_C_ExecuteUbergraph_BTTask_FindSmartObject, CallFunc_GetBlackboardValueAsFloat_ReturnValue) == 0x0000C4, "Member 'BTTask_FindSmartObject_C_ExecuteUbergraph_BTTask_FindSmartObject::CallFunc_GetBlackboardValueAsFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTTask_FindSmartObject_C_ExecuteUbergraph_BTTask_FindSmartObject, CallFunc_RandomFloat_ReturnValue_1) == 0x0000C8, "Member 'BTTask_FindSmartObject_C_ExecuteUbergraph_BTTask_FindSmartObject::CallFunc_RandomFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BTTask_FindSmartObject_C_ExecuteUbergraph_BTTask_FindSmartObject, CallFunc_GetWorldSubsystem_ReturnValue_2) == 0x0000D0, "Member 'BTTask_FindSmartObject_C_ExecuteUbergraph_BTTask_FindSmartObject::CallFunc_GetWorldSubsystem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BTTask_FindSmartObject_C_ExecuteUbergraph_BTTask_FindSmartObject, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x0000D8, "Member 'BTTask_FindSmartObject_C_ExecuteUbergraph_BTTask_FindSmartObject::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTTask_FindSmartObject_C_ExecuteUbergraph_BTTask_FindSmartObject, CallFunc_GetSmartObjectComponent_ReturnValue) == 0x0000E0, "Member 'BTTask_FindSmartObject_C_ExecuteUbergraph_BTTask_FindSmartObject::CallFunc_GetSmartObjectComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTTask_FindSmartObject_C_ExecuteUbergraph_BTTask_FindSmartObject, K2Node_DynamicCast_AsBP_Smart_Object_Component) == 0x0000E8, "Member 'BTTask_FindSmartObject_C_ExecuteUbergraph_BTTask_FindSmartObject::K2Node_DynamicCast_AsBP_Smart_Object_Component' has a wrong offset!");
static_assert(offsetof(BTTask_FindSmartObject_C_ExecuteUbergraph_BTTask_FindSmartObject, K2Node_DynamicCast_bSuccess) == 0x0000F0, "Member 'BTTask_FindSmartObject_C_ExecuteUbergraph_BTTask_FindSmartObject::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BTTask_FindSmartObject_C_ExecuteUbergraph_BTTask_FindSmartObject, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x0000F1, "Member 'BTTask_FindSmartObject_C_ExecuteUbergraph_BTTask_FindSmartObject::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTTask_FindSmartObject_C_ExecuteUbergraph_BTTask_FindSmartObject, CallFunc_LessEqual_DoubleDouble_B_ImplicitCast) == 0x0000F8, "Member 'BTTask_FindSmartObject_C_ExecuteUbergraph_BTTask_FindSmartObject::CallFunc_LessEqual_DoubleDouble_B_ImplicitCast' has a wrong offset!");

// Function BTTask_FindSmartObject.BTTask_FindSmartObject_C.IsInCooldown
// 0x0002 (0x0002 - 0x0000)
struct BTTask_FindSmartObject_C_IsInCooldown final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_IsTimerActiveHandle_ReturnValue;       // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTTask_FindSmartObject_C_IsInCooldown) == 0x000001, "Wrong alignment on BTTask_FindSmartObject_C_IsInCooldown");
static_assert(sizeof(BTTask_FindSmartObject_C_IsInCooldown) == 0x000002, "Wrong size on BTTask_FindSmartObject_C_IsInCooldown");
static_assert(offsetof(BTTask_FindSmartObject_C_IsInCooldown, ReturnValue) == 0x000000, "Member 'BTTask_FindSmartObject_C_IsInCooldown::ReturnValue' has a wrong offset!");
static_assert(offsetof(BTTask_FindSmartObject_C_IsInCooldown, CallFunc_K2_IsTimerActiveHandle_ReturnValue) == 0x000001, "Member 'BTTask_FindSmartObject_C_IsInCooldown::CallFunc_K2_IsTimerActiveHandle_ReturnValue' has a wrong offset!");

// Function BTTask_FindSmartObject.BTTask_FindSmartObject_C.ReceiveExecuteAI
// 0x0010 (0x0010 - 0x0000)
struct BTTask_FindSmartObject_C_ReceiveExecuteAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTTask_FindSmartObject_C_ReceiveExecuteAI) == 0x000008, "Wrong alignment on BTTask_FindSmartObject_C_ReceiveExecuteAI");
static_assert(sizeof(BTTask_FindSmartObject_C_ReceiveExecuteAI) == 0x000010, "Wrong size on BTTask_FindSmartObject_C_ReceiveExecuteAI");
static_assert(offsetof(BTTask_FindSmartObject_C_ReceiveExecuteAI, OwnerController) == 0x000000, "Member 'BTTask_FindSmartObject_C_ReceiveExecuteAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTTask_FindSmartObject_C_ReceiveExecuteAI, ControlledPawn) == 0x000008, "Member 'BTTask_FindSmartObject_C_ReceiveExecuteAI::ControlledPawn' has a wrong offset!");

// Function BTTask_FindSmartObject.BTTask_FindSmartObject_C.ReceiveTickAI
// 0x0018 (0x0018 - 0x0000)
struct BTTask_FindSmartObject_C_ReceiveTickAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaSeconds;                                      // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTTask_FindSmartObject_C_ReceiveTickAI) == 0x000008, "Wrong alignment on BTTask_FindSmartObject_C_ReceiveTickAI");
static_assert(sizeof(BTTask_FindSmartObject_C_ReceiveTickAI) == 0x000018, "Wrong size on BTTask_FindSmartObject_C_ReceiveTickAI");
static_assert(offsetof(BTTask_FindSmartObject_C_ReceiveTickAI, OwnerController) == 0x000000, "Member 'BTTask_FindSmartObject_C_ReceiveTickAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTTask_FindSmartObject_C_ReceiveTickAI, ControlledPawn) == 0x000008, "Member 'BTTask_FindSmartObject_C_ReceiveTickAI::ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTTask_FindSmartObject_C_ReceiveTickAI, DeltaSeconds) == 0x000010, "Member 'BTTask_FindSmartObject_C_ReceiveTickAI::DeltaSeconds' has a wrong offset!");

// Function BTTask_FindSmartObject.BTTask_FindSmartObject_C.SearchForSmartObjects
// 0x01B0 (0x01B0 - 0x0000)
struct BTTask_FindSmartObject_C_SearchForSmartObjects final
{
public:
	class APawn*                                  Pawn;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FSmartObjectRequestResult>      OutResults;                                        // 0x0008(0x0010)(Parm, OutParm)
	class USmartObjectSubsystem*                  CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetBlackboardValueAsFloat_ReturnValue;    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBox                                   CallFunc_ComputeSearchBox_Box;                     // 0x0028(0x0038)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FSmartObjectRequest                    K2Node_MakeStruct_SmartObjectRequest;              // 0x0060(0x0130)()
	TArray<struct FSmartObjectRequestResult>      CallFunc_FindSmartObjects_OutResults;              // 0x0190(0x0010)(ReferenceParm)
	bool                                          CallFunc_FindSmartObjects_ReturnValue;             // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A1[0x7];                                      // 0x01A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_ComputeSearchBox_SearchBoxExtent_ImplicitCast; // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTTask_FindSmartObject_C_SearchForSmartObjects) == 0x000010, "Wrong alignment on BTTask_FindSmartObject_C_SearchForSmartObjects");
static_assert(sizeof(BTTask_FindSmartObject_C_SearchForSmartObjects) == 0x0001B0, "Wrong size on BTTask_FindSmartObject_C_SearchForSmartObjects");
static_assert(offsetof(BTTask_FindSmartObject_C_SearchForSmartObjects, Pawn) == 0x000000, "Member 'BTTask_FindSmartObject_C_SearchForSmartObjects::Pawn' has a wrong offset!");
static_assert(offsetof(BTTask_FindSmartObject_C_SearchForSmartObjects, OutResults) == 0x000008, "Member 'BTTask_FindSmartObject_C_SearchForSmartObjects::OutResults' has a wrong offset!");
static_assert(offsetof(BTTask_FindSmartObject_C_SearchForSmartObjects, CallFunc_GetWorldSubsystem_ReturnValue) == 0x000018, "Member 'BTTask_FindSmartObject_C_SearchForSmartObjects::CallFunc_GetWorldSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTTask_FindSmartObject_C_SearchForSmartObjects, CallFunc_GetBlackboardValueAsFloat_ReturnValue) == 0x000020, "Member 'BTTask_FindSmartObject_C_SearchForSmartObjects::CallFunc_GetBlackboardValueAsFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTTask_FindSmartObject_C_SearchForSmartObjects, CallFunc_ComputeSearchBox_Box) == 0x000028, "Member 'BTTask_FindSmartObject_C_SearchForSmartObjects::CallFunc_ComputeSearchBox_Box' has a wrong offset!");
static_assert(offsetof(BTTask_FindSmartObject_C_SearchForSmartObjects, K2Node_MakeStruct_SmartObjectRequest) == 0x000060, "Member 'BTTask_FindSmartObject_C_SearchForSmartObjects::K2Node_MakeStruct_SmartObjectRequest' has a wrong offset!");
static_assert(offsetof(BTTask_FindSmartObject_C_SearchForSmartObjects, CallFunc_FindSmartObjects_OutResults) == 0x000190, "Member 'BTTask_FindSmartObject_C_SearchForSmartObjects::CallFunc_FindSmartObjects_OutResults' has a wrong offset!");
static_assert(offsetof(BTTask_FindSmartObject_C_SearchForSmartObjects, CallFunc_FindSmartObjects_ReturnValue) == 0x0001A0, "Member 'BTTask_FindSmartObject_C_SearchForSmartObjects::CallFunc_FindSmartObjects_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTTask_FindSmartObject_C_SearchForSmartObjects, CallFunc_ComputeSearchBox_SearchBoxExtent_ImplicitCast) == 0x0001A8, "Member 'BTTask_FindSmartObject_C_SearchForSmartObjects::CallFunc_ComputeSearchBox_SearchBoxExtent_ImplicitCast' has a wrong offset!");

// Function BTTask_FindSmartObject.BTTask_FindSmartObject_C.StartCooldown
// 0x0030 (0x0030 - 0x0000)
struct BTTask_FindSmartObject_C_StartCooldown final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_wildcard_Variable;                            // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetBlackboardValueAsFloat_ReturnValue;    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0020(0x0008)(NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTTask_FindSmartObject_C_StartCooldown) == 0x000008, "Wrong alignment on BTTask_FindSmartObject_C_StartCooldown");
static_assert(sizeof(BTTask_FindSmartObject_C_StartCooldown) == 0x000030, "Wrong size on BTTask_FindSmartObject_C_StartCooldown");
static_assert(offsetof(BTTask_FindSmartObject_C_StartCooldown, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'BTTask_FindSmartObject_C_StartCooldown::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BTTask_FindSmartObject_C_StartCooldown, Temp_wildcard_Variable) == 0x000010, "Member 'BTTask_FindSmartObject_C_StartCooldown::Temp_wildcard_Variable' has a wrong offset!");
static_assert(offsetof(BTTask_FindSmartObject_C_StartCooldown, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000014, "Member 'BTTask_FindSmartObject_C_StartCooldown::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTTask_FindSmartObject_C_StartCooldown, CallFunc_GetBlackboardValueAsFloat_ReturnValue) == 0x000018, "Member 'BTTask_FindSmartObject_C_StartCooldown::CallFunc_GetBlackboardValueAsFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTTask_FindSmartObject_C_StartCooldown, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000020, "Member 'BTTask_FindSmartObject_C_StartCooldown::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTTask_FindSmartObject_C_StartCooldown, CallFunc_Greater_DoubleDouble_A_ImplicitCast) == 0x000028, "Member 'BTTask_FindSmartObject_C_StartCooldown::CallFunc_Greater_DoubleDouble_A_ImplicitCast' has a wrong offset!");

}

