#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTTask_RotateToSmartObject

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SmartObjectsModule_structs.hpp"


namespace SDK::Params
{

// Function BTTask_RotateToSmartObject.BTTask_RotateToSmartObject_C.ExecuteUbergraph_BTTask_RotateToSmartObject
// 0x01C0 (0x01C0 - 0x0000)
struct BTTask_RotateToSmartObject_C_ExecuteUbergraph_BTTask_RotateToSmartObject final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController_2;                    // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn_2;                     // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AAIController*                          K2Node_Event_OwnerController_1;                    // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn_1;                     // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCharacterMovementComponent*            CallFunc_GetComponentByClass_ReturnValue;          // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_RInterpTo_Constant_ReturnValue;           // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               Temp_wildcard_Variable;                            // 0x0070(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_RotatorRotator_ReturnValue;    // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_SetActorRotation_ReturnValue;          // 0x0095(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_96[0x2];                                       // 0x0096(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class USmartObjectSubsystem*                  CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FSmartObjectClaimHandle                CallFunc_GetBlackboardValueAsSOClaimHandle_ReturnValue; // 0x00A0(0x0020)(NoDestructor)
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_GetSlotTransform_OutSlotTransform;        // 0x00D0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetSlotTransform_ReturnValue;             // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USmartObjectSubsystem*                  CallFunc_GetWorldSubsystem_ReturnValue_1;          // 0x0138(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0140(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0158(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0170(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSmartObjectClaimHandle                CallFunc_GetBlackboardValueAsSOClaimHandle_ReturnValue_1; // 0x0188(0x0020)(NoDestructor)
	bool                                          CallFunc_Release_ReturnValue;                      // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A9[0x3];                                      // 0x01A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RInterpTo_Constant_InterpSpeed_ImplicitCast; // 0x01AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_RotationSpeed_ImplicitCast;     // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTTask_RotateToSmartObject_C_ExecuteUbergraph_BTTask_RotateToSmartObject) == 0x000010, "Wrong alignment on BTTask_RotateToSmartObject_C_ExecuteUbergraph_BTTask_RotateToSmartObject");
static_assert(sizeof(BTTask_RotateToSmartObject_C_ExecuteUbergraph_BTTask_RotateToSmartObject) == 0x0001C0, "Wrong size on BTTask_RotateToSmartObject_C_ExecuteUbergraph_BTTask_RotateToSmartObject");
static_assert(offsetof(BTTask_RotateToSmartObject_C_ExecuteUbergraph_BTTask_RotateToSmartObject, EntryPoint) == 0x000000, "Member 'BTTask_RotateToSmartObject_C_ExecuteUbergraph_BTTask_RotateToSmartObject::EntryPoint' has a wrong offset!");
static_assert(offsetof(BTTask_RotateToSmartObject_C_ExecuteUbergraph_BTTask_RotateToSmartObject, K2Node_Event_OwnerController_2) == 0x000008, "Member 'BTTask_RotateToSmartObject_C_ExecuteUbergraph_BTTask_RotateToSmartObject::K2Node_Event_OwnerController_2' has a wrong offset!");
static_assert(offsetof(BTTask_RotateToSmartObject_C_ExecuteUbergraph_BTTask_RotateToSmartObject, K2Node_Event_ControlledPawn_2) == 0x000010, "Member 'BTTask_RotateToSmartObject_C_ExecuteUbergraph_BTTask_RotateToSmartObject::K2Node_Event_ControlledPawn_2' has a wrong offset!");
static_assert(offsetof(BTTask_RotateToSmartObject_C_ExecuteUbergraph_BTTask_RotateToSmartObject, K2Node_Event_OwnerController_1) == 0x000018, "Member 'BTTask_RotateToSmartObject_C_ExecuteUbergraph_BTTask_RotateToSmartObject::K2Node_Event_OwnerController_1' has a wrong offset!");
static_assert(offsetof(BTTask_RotateToSmartObject_C_ExecuteUbergraph_BTTask_RotateToSmartObject, K2Node_Event_ControlledPawn_1) == 0x000020, "Member 'BTTask_RotateToSmartObject_C_ExecuteUbergraph_BTTask_RotateToSmartObject::K2Node_Event_ControlledPawn_1' has a wrong offset!");
static_assert(offsetof(BTTask_RotateToSmartObject_C_ExecuteUbergraph_BTTask_RotateToSmartObject, K2Node_Event_DeltaSeconds) == 0x000028, "Member 'BTTask_RotateToSmartObject_C_ExecuteUbergraph_BTTask_RotateToSmartObject::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BTTask_RotateToSmartObject_C_ExecuteUbergraph_BTTask_RotateToSmartObject, CallFunc_GetComponentByClass_ReturnValue) == 0x000030, "Member 'BTTask_RotateToSmartObject_C_ExecuteUbergraph_BTTask_RotateToSmartObject::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTTask_RotateToSmartObject_C_ExecuteUbergraph_BTTask_RotateToSmartObject, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000038, "Member 'BTTask_RotateToSmartObject_C_ExecuteUbergraph_BTTask_RotateToSmartObject::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTTask_RotateToSmartObject_C_ExecuteUbergraph_BTTask_RotateToSmartObject, CallFunc_IsValid_ReturnValue) == 0x000050, "Member 'BTTask_RotateToSmartObject_C_ExecuteUbergraph_BTTask_RotateToSmartObject::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTTask_RotateToSmartObject_C_ExecuteUbergraph_BTTask_RotateToSmartObject, CallFunc_RInterpTo_Constant_ReturnValue) == 0x000058, "Member 'BTTask_RotateToSmartObject_C_ExecuteUbergraph_BTTask_RotateToSmartObject::CallFunc_RInterpTo_Constant_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTTask_RotateToSmartObject_C_ExecuteUbergraph_BTTask_RotateToSmartObject, Temp_wildcard_Variable) == 0x000070, "Member 'BTTask_RotateToSmartObject_C_ExecuteUbergraph_BTTask_RotateToSmartObject::Temp_wildcard_Variable' has a wrong offset!");
static_assert(offsetof(BTTask_RotateToSmartObject_C_ExecuteUbergraph_BTTask_RotateToSmartObject, CallFunc_BreakRotator_Roll) == 0x000088, "Member 'BTTask_RotateToSmartObject_C_ExecuteUbergraph_BTTask_RotateToSmartObject::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(BTTask_RotateToSmartObject_C_ExecuteUbergraph_BTTask_RotateToSmartObject, CallFunc_BreakRotator_Pitch) == 0x00008C, "Member 'BTTask_RotateToSmartObject_C_ExecuteUbergraph_BTTask_RotateToSmartObject::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(BTTask_RotateToSmartObject_C_ExecuteUbergraph_BTTask_RotateToSmartObject, CallFunc_BreakRotator_Yaw) == 0x000090, "Member 'BTTask_RotateToSmartObject_C_ExecuteUbergraph_BTTask_RotateToSmartObject::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(BTTask_RotateToSmartObject_C_ExecuteUbergraph_BTTask_RotateToSmartObject, CallFunc_EqualEqual_RotatorRotator_ReturnValue) == 0x000094, "Member 'BTTask_RotateToSmartObject_C_ExecuteUbergraph_BTTask_RotateToSmartObject::CallFunc_EqualEqual_RotatorRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTTask_RotateToSmartObject_C_ExecuteUbergraph_BTTask_RotateToSmartObject, CallFunc_K2_SetActorRotation_ReturnValue) == 0x000095, "Member 'BTTask_RotateToSmartObject_C_ExecuteUbergraph_BTTask_RotateToSmartObject::CallFunc_K2_SetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTTask_RotateToSmartObject_C_ExecuteUbergraph_BTTask_RotateToSmartObject, CallFunc_GetWorldSubsystem_ReturnValue) == 0x000098, "Member 'BTTask_RotateToSmartObject_C_ExecuteUbergraph_BTTask_RotateToSmartObject::CallFunc_GetWorldSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTTask_RotateToSmartObject_C_ExecuteUbergraph_BTTask_RotateToSmartObject, CallFunc_GetBlackboardValueAsSOClaimHandle_ReturnValue) == 0x0000A0, "Member 'BTTask_RotateToSmartObject_C_ExecuteUbergraph_BTTask_RotateToSmartObject::CallFunc_GetBlackboardValueAsSOClaimHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTTask_RotateToSmartObject_C_ExecuteUbergraph_BTTask_RotateToSmartObject, K2Node_Event_OwnerController) == 0x0000C0, "Member 'BTTask_RotateToSmartObject_C_ExecuteUbergraph_BTTask_RotateToSmartObject::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(BTTask_RotateToSmartObject_C_ExecuteUbergraph_BTTask_RotateToSmartObject, K2Node_Event_ControlledPawn) == 0x0000C8, "Member 'BTTask_RotateToSmartObject_C_ExecuteUbergraph_BTTask_RotateToSmartObject::K2Node_Event_ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTTask_RotateToSmartObject_C_ExecuteUbergraph_BTTask_RotateToSmartObject, CallFunc_GetSlotTransform_OutSlotTransform) == 0x0000D0, "Member 'BTTask_RotateToSmartObject_C_ExecuteUbergraph_BTTask_RotateToSmartObject::CallFunc_GetSlotTransform_OutSlotTransform' has a wrong offset!");
static_assert(offsetof(BTTask_RotateToSmartObject_C_ExecuteUbergraph_BTTask_RotateToSmartObject, CallFunc_GetSlotTransform_ReturnValue) == 0x000130, "Member 'BTTask_RotateToSmartObject_C_ExecuteUbergraph_BTTask_RotateToSmartObject::CallFunc_GetSlotTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTTask_RotateToSmartObject_C_ExecuteUbergraph_BTTask_RotateToSmartObject, CallFunc_GetWorldSubsystem_ReturnValue_1) == 0x000138, "Member 'BTTask_RotateToSmartObject_C_ExecuteUbergraph_BTTask_RotateToSmartObject::CallFunc_GetWorldSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BTTask_RotateToSmartObject_C_ExecuteUbergraph_BTTask_RotateToSmartObject, CallFunc_BreakTransform_Location) == 0x000140, "Member 'BTTask_RotateToSmartObject_C_ExecuteUbergraph_BTTask_RotateToSmartObject::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(BTTask_RotateToSmartObject_C_ExecuteUbergraph_BTTask_RotateToSmartObject, CallFunc_BreakTransform_Rotation) == 0x000158, "Member 'BTTask_RotateToSmartObject_C_ExecuteUbergraph_BTTask_RotateToSmartObject::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(BTTask_RotateToSmartObject_C_ExecuteUbergraph_BTTask_RotateToSmartObject, CallFunc_BreakTransform_Scale) == 0x000170, "Member 'BTTask_RotateToSmartObject_C_ExecuteUbergraph_BTTask_RotateToSmartObject::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(BTTask_RotateToSmartObject_C_ExecuteUbergraph_BTTask_RotateToSmartObject, CallFunc_GetBlackboardValueAsSOClaimHandle_ReturnValue_1) == 0x000188, "Member 'BTTask_RotateToSmartObject_C_ExecuteUbergraph_BTTask_RotateToSmartObject::CallFunc_GetBlackboardValueAsSOClaimHandle_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BTTask_RotateToSmartObject_C_ExecuteUbergraph_BTTask_RotateToSmartObject, CallFunc_Release_ReturnValue) == 0x0001A8, "Member 'BTTask_RotateToSmartObject_C_ExecuteUbergraph_BTTask_RotateToSmartObject::CallFunc_Release_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTTask_RotateToSmartObject_C_ExecuteUbergraph_BTTask_RotateToSmartObject, CallFunc_RInterpTo_Constant_InterpSpeed_ImplicitCast) == 0x0001AC, "Member 'BTTask_RotateToSmartObject_C_ExecuteUbergraph_BTTask_RotateToSmartObject::CallFunc_RInterpTo_Constant_InterpSpeed_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BTTask_RotateToSmartObject_C_ExecuteUbergraph_BTTask_RotateToSmartObject, K2Node_VariableSet_RotationSpeed_ImplicitCast) == 0x0001B0, "Member 'BTTask_RotateToSmartObject_C_ExecuteUbergraph_BTTask_RotateToSmartObject::K2Node_VariableSet_RotationSpeed_ImplicitCast' has a wrong offset!");

// Function BTTask_RotateToSmartObject.BTTask_RotateToSmartObject_C.ReceiveAbortAI
// 0x0010 (0x0010 - 0x0000)
struct BTTask_RotateToSmartObject_C_ReceiveAbortAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTTask_RotateToSmartObject_C_ReceiveAbortAI) == 0x000008, "Wrong alignment on BTTask_RotateToSmartObject_C_ReceiveAbortAI");
static_assert(sizeof(BTTask_RotateToSmartObject_C_ReceiveAbortAI) == 0x000010, "Wrong size on BTTask_RotateToSmartObject_C_ReceiveAbortAI");
static_assert(offsetof(BTTask_RotateToSmartObject_C_ReceiveAbortAI, OwnerController) == 0x000000, "Member 'BTTask_RotateToSmartObject_C_ReceiveAbortAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTTask_RotateToSmartObject_C_ReceiveAbortAI, ControlledPawn) == 0x000008, "Member 'BTTask_RotateToSmartObject_C_ReceiveAbortAI::ControlledPawn' has a wrong offset!");

// Function BTTask_RotateToSmartObject.BTTask_RotateToSmartObject_C.ReceiveExecuteAI
// 0x0010 (0x0010 - 0x0000)
struct BTTask_RotateToSmartObject_C_ReceiveExecuteAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTTask_RotateToSmartObject_C_ReceiveExecuteAI) == 0x000008, "Wrong alignment on BTTask_RotateToSmartObject_C_ReceiveExecuteAI");
static_assert(sizeof(BTTask_RotateToSmartObject_C_ReceiveExecuteAI) == 0x000010, "Wrong size on BTTask_RotateToSmartObject_C_ReceiveExecuteAI");
static_assert(offsetof(BTTask_RotateToSmartObject_C_ReceiveExecuteAI, OwnerController) == 0x000000, "Member 'BTTask_RotateToSmartObject_C_ReceiveExecuteAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTTask_RotateToSmartObject_C_ReceiveExecuteAI, ControlledPawn) == 0x000008, "Member 'BTTask_RotateToSmartObject_C_ReceiveExecuteAI::ControlledPawn' has a wrong offset!");

// Function BTTask_RotateToSmartObject.BTTask_RotateToSmartObject_C.ReceiveTickAI
// 0x0018 (0x0018 - 0x0000)
struct BTTask_RotateToSmartObject_C_ReceiveTickAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaSeconds;                                      // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTTask_RotateToSmartObject_C_ReceiveTickAI) == 0x000008, "Wrong alignment on BTTask_RotateToSmartObject_C_ReceiveTickAI");
static_assert(sizeof(BTTask_RotateToSmartObject_C_ReceiveTickAI) == 0x000018, "Wrong size on BTTask_RotateToSmartObject_C_ReceiveTickAI");
static_assert(offsetof(BTTask_RotateToSmartObject_C_ReceiveTickAI, OwnerController) == 0x000000, "Member 'BTTask_RotateToSmartObject_C_ReceiveTickAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTTask_RotateToSmartObject_C_ReceiveTickAI, ControlledPawn) == 0x000008, "Member 'BTTask_RotateToSmartObject_C_ReceiveTickAI::ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTTask_RotateToSmartObject_C_ReceiveTickAI, DeltaSeconds) == 0x000010, "Member 'BTTask_RotateToSmartObject_C_ReceiveTickAI::DeltaSeconds' has a wrong offset!");

}

