#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTTask_FindSmartObject

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SmartObjectsModule_structs.hpp"
#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BTTask_FindSmartObject.BTTask_FindSmartObject_C
// 0x00E0 (0x0188 - 0x00A8)
class UBTTask_FindSmartObject_C final : public UBTTask_BlueprintBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TArray<struct FSmartObjectRequestResult>      FoundSmartObjects;                                 // 0x00B0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSmartObjectClaimHandle                SmartObjectClaimHandle;                            // 0x00C0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FBlackboardKeySelector                 KeySmartObjectSearchBoxExtent;                     // 0x00E0(0x0028)(Edit, BlueprintVisible)
	struct FBlackboardKeySelector                 KeySmartObjectSearchCooldown;                      // 0x0108(0x0028)(Edit, BlueprintVisible)
	struct FTimerHandle                           CooldownTimerHandle;                               // 0x0130(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FBlackboardKeySelector                 KeySmartObjectClaimHandle;                         // 0x0138(0x0028)(Edit, BlueprintVisible)
	struct FBlackboardKeySelector                 KeySmartObjectClaimProbability;                    // 0x0160(0x0028)(Edit, BlueprintVisible)

public:
	void CanSearchSmartObjects(bool* Result);
	void ExecuteUbergraph_BTTask_FindSmartObject(int32 EntryPoint);
	bool IsInCooldown();
	void OnCooldownTimerElapsed();
	void ReceiveExecuteAI(class AAIController* OwnerController, class APawn* ControlledPawn);
	void ReceiveTickAI(class AAIController* OwnerController, class APawn* ControlledPawn, float DeltaSeconds);
	void SearchForSmartObjects(class APawn* Pawn, TArray<struct FSmartObjectRequestResult>* OutResults);
	void StartCooldown();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BTTask_FindSmartObject_C">();
	}
	static class UBTTask_FindSmartObject_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTTask_FindSmartObject_C>();
	}
};
static_assert(alignof(UBTTask_FindSmartObject_C) == 0x000008, "Wrong alignment on UBTTask_FindSmartObject_C");
static_assert(sizeof(UBTTask_FindSmartObject_C) == 0x000188, "Wrong size on UBTTask_FindSmartObject_C");
static_assert(offsetof(UBTTask_FindSmartObject_C, UberGraphFrame) == 0x0000A8, "Member 'UBTTask_FindSmartObject_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBTTask_FindSmartObject_C, FoundSmartObjects) == 0x0000B0, "Member 'UBTTask_FindSmartObject_C::FoundSmartObjects' has a wrong offset!");
static_assert(offsetof(UBTTask_FindSmartObject_C, SmartObjectClaimHandle) == 0x0000C0, "Member 'UBTTask_FindSmartObject_C::SmartObjectClaimHandle' has a wrong offset!");
static_assert(offsetof(UBTTask_FindSmartObject_C, KeySmartObjectSearchBoxExtent) == 0x0000E0, "Member 'UBTTask_FindSmartObject_C::KeySmartObjectSearchBoxExtent' has a wrong offset!");
static_assert(offsetof(UBTTask_FindSmartObject_C, KeySmartObjectSearchCooldown) == 0x000108, "Member 'UBTTask_FindSmartObject_C::KeySmartObjectSearchCooldown' has a wrong offset!");
static_assert(offsetof(UBTTask_FindSmartObject_C, CooldownTimerHandle) == 0x000130, "Member 'UBTTask_FindSmartObject_C::CooldownTimerHandle' has a wrong offset!");
static_assert(offsetof(UBTTask_FindSmartObject_C, KeySmartObjectClaimHandle) == 0x000138, "Member 'UBTTask_FindSmartObject_C::KeySmartObjectClaimHandle' has a wrong offset!");
static_assert(offsetof(UBTTask_FindSmartObject_C, KeySmartObjectClaimProbability) == 0x000160, "Member 'UBTTask_FindSmartObject_C::KeySmartObjectClaimProbability' has a wrong offset!");

}

