#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTTask_UpdateFleePointParameters

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BTTask_UpdateFleePointParameters.BTTask_UpdateFleePointParameters_C.ExecuteUbergraph_BTTask_UpdateFleePointParameters
// 0x0060 (0x0060 - 0x0000)
struct BTTask_UpdateFleePointParameters_C_ExecuteUbergraph_BTTask_UpdateFleePointParameters final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetBlackboardValueAsActor_ReturnValue;    // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBT_FleeAiComponent_C*                  Temp_wildcard_Variable;                            // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UBT_FleeAiComponent_C*                  CallFunc_GetComponentByClass_ReturnValue;          // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ABP_FleePoint_C*                        CallFunc_FindNextFleePoint_FleePoint;              // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTTask_UpdateFleePointParameters_C_ExecuteUbergraph_BTTask_UpdateFleePointParameters) == 0x000008, "Wrong alignment on BTTask_UpdateFleePointParameters_C_ExecuteUbergraph_BTTask_UpdateFleePointParameters");
static_assert(sizeof(BTTask_UpdateFleePointParameters_C_ExecuteUbergraph_BTTask_UpdateFleePointParameters) == 0x000060, "Wrong size on BTTask_UpdateFleePointParameters_C_ExecuteUbergraph_BTTask_UpdateFleePointParameters");
static_assert(offsetof(BTTask_UpdateFleePointParameters_C_ExecuteUbergraph_BTTask_UpdateFleePointParameters, EntryPoint) == 0x000000, "Member 'BTTask_UpdateFleePointParameters_C_ExecuteUbergraph_BTTask_UpdateFleePointParameters::EntryPoint' has a wrong offset!");
static_assert(offsetof(BTTask_UpdateFleePointParameters_C_ExecuteUbergraph_BTTask_UpdateFleePointParameters, CallFunc_GetBlackboardValueAsActor_ReturnValue) == 0x000008, "Member 'BTTask_UpdateFleePointParameters_C_ExecuteUbergraph_BTTask_UpdateFleePointParameters::CallFunc_GetBlackboardValueAsActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTTask_UpdateFleePointParameters_C_ExecuteUbergraph_BTTask_UpdateFleePointParameters, K2Node_Event_OwnerController) == 0x000010, "Member 'BTTask_UpdateFleePointParameters_C_ExecuteUbergraph_BTTask_UpdateFleePointParameters::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(BTTask_UpdateFleePointParameters_C_ExecuteUbergraph_BTTask_UpdateFleePointParameters, K2Node_Event_ControlledPawn) == 0x000018, "Member 'BTTask_UpdateFleePointParameters_C_ExecuteUbergraph_BTTask_UpdateFleePointParameters::K2Node_Event_ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTTask_UpdateFleePointParameters_C_ExecuteUbergraph_BTTask_UpdateFleePointParameters, K2Node_Event_DeltaSeconds) == 0x000020, "Member 'BTTask_UpdateFleePointParameters_C_ExecuteUbergraph_BTTask_UpdateFleePointParameters::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BTTask_UpdateFleePointParameters_C_ExecuteUbergraph_BTTask_UpdateFleePointParameters, Temp_wildcard_Variable) == 0x000028, "Member 'BTTask_UpdateFleePointParameters_C_ExecuteUbergraph_BTTask_UpdateFleePointParameters::Temp_wildcard_Variable' has a wrong offset!");
static_assert(offsetof(BTTask_UpdateFleePointParameters_C_ExecuteUbergraph_BTTask_UpdateFleePointParameters, CallFunc_GetComponentByClass_ReturnValue) == 0x000030, "Member 'BTTask_UpdateFleePointParameters_C_ExecuteUbergraph_BTTask_UpdateFleePointParameters::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTTask_UpdateFleePointParameters_C_ExecuteUbergraph_BTTask_UpdateFleePointParameters, CallFunc_FindNextFleePoint_FleePoint) == 0x000038, "Member 'BTTask_UpdateFleePointParameters_C_ExecuteUbergraph_BTTask_UpdateFleePointParameters::CallFunc_FindNextFleePoint_FleePoint' has a wrong offset!");
static_assert(offsetof(BTTask_UpdateFleePointParameters_C_ExecuteUbergraph_BTTask_UpdateFleePointParameters, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000040, "Member 'BTTask_UpdateFleePointParameters_C_ExecuteUbergraph_BTTask_UpdateFleePointParameters::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTTask_UpdateFleePointParameters_C_ExecuteUbergraph_BTTask_UpdateFleePointParameters, CallFunc_IsValid_ReturnValue) == 0x000058, "Member 'BTTask_UpdateFleePointParameters_C_ExecuteUbergraph_BTTask_UpdateFleePointParameters::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTTask_UpdateFleePointParameters_C_ExecuteUbergraph_BTTask_UpdateFleePointParameters, CallFunc_IsValid_ReturnValue_1) == 0x000059, "Member 'BTTask_UpdateFleePointParameters_C_ExecuteUbergraph_BTTask_UpdateFleePointParameters::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function BTTask_UpdateFleePointParameters.BTTask_UpdateFleePointParameters_C.ReceiveTickAI
// 0x0018 (0x0018 - 0x0000)
struct BTTask_UpdateFleePointParameters_C_ReceiveTickAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaSeconds;                                      // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTTask_UpdateFleePointParameters_C_ReceiveTickAI) == 0x000008, "Wrong alignment on BTTask_UpdateFleePointParameters_C_ReceiveTickAI");
static_assert(sizeof(BTTask_UpdateFleePointParameters_C_ReceiveTickAI) == 0x000018, "Wrong size on BTTask_UpdateFleePointParameters_C_ReceiveTickAI");
static_assert(offsetof(BTTask_UpdateFleePointParameters_C_ReceiveTickAI, OwnerController) == 0x000000, "Member 'BTTask_UpdateFleePointParameters_C_ReceiveTickAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTTask_UpdateFleePointParameters_C_ReceiveTickAI, ControlledPawn) == 0x000008, "Member 'BTTask_UpdateFleePointParameters_C_ReceiveTickAI::ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTTask_UpdateFleePointParameters_C_ReceiveTickAI, DeltaSeconds) == 0x000010, "Member 'BTTask_UpdateFleePointParameters_C_ReceiveTickAI::DeltaSeconds' has a wrong offset!");

}

