#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CR_Mannequin_BasicFootIK_V2_Explo

#include "Basic.hpp"

#include "ControlRig_classes.hpp"


namespace SDK
{

// RigVMBlueprintGeneratedClass CR_Mannequin_BasicFootIK_V2_Explo.CR_Mannequin_BasicFootIK_V2_Explo_C
// 0x0030 (0x0AD8 - 0x0AA8)
class UCR_Mannequin_BasicFootIK_V2_Explo_C final : public UControlRig
{
public:
	double                                        ZOffset_L_Target;                                  // 0x0AA8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ZOffset_R_Target;                                  // 0x0AB0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ZOffset_L;                                         // 0x0AB8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ZOffset_R;                                         // 0x0AC0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ZOffset_Pelvis;                                    // 0x0AC8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShouldDoIKTrace;                                   // 0x0AD0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AD1[0x3];                                      // 0x0AD1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         IkScale;                                           // 0x0AD4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CR_Mannequin_BasicFootIK_V2_Explo_C">();
	}
	static class UCR_Mannequin_BasicFootIK_V2_Explo_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCR_Mannequin_BasicFootIK_V2_Explo_C>();
	}
};
static_assert(alignof(UCR_Mannequin_BasicFootIK_V2_Explo_C) == 0x000008, "Wrong alignment on UCR_Mannequin_BasicFootIK_V2_Explo_C");
static_assert(sizeof(UCR_Mannequin_BasicFootIK_V2_Explo_C) == 0x000AD8, "Wrong size on UCR_Mannequin_BasicFootIK_V2_Explo_C");
static_assert(offsetof(UCR_Mannequin_BasicFootIK_V2_Explo_C, ZOffset_L_Target) == 0x000AA8, "Member 'UCR_Mannequin_BasicFootIK_V2_Explo_C::ZOffset_L_Target' has a wrong offset!");
static_assert(offsetof(UCR_Mannequin_BasicFootIK_V2_Explo_C, ZOffset_R_Target) == 0x000AB0, "Member 'UCR_Mannequin_BasicFootIK_V2_Explo_C::ZOffset_R_Target' has a wrong offset!");
static_assert(offsetof(UCR_Mannequin_BasicFootIK_V2_Explo_C, ZOffset_L) == 0x000AB8, "Member 'UCR_Mannequin_BasicFootIK_V2_Explo_C::ZOffset_L' has a wrong offset!");
static_assert(offsetof(UCR_Mannequin_BasicFootIK_V2_Explo_C, ZOffset_R) == 0x000AC0, "Member 'UCR_Mannequin_BasicFootIK_V2_Explo_C::ZOffset_R' has a wrong offset!");
static_assert(offsetof(UCR_Mannequin_BasicFootIK_V2_Explo_C, ZOffset_Pelvis) == 0x000AC8, "Member 'UCR_Mannequin_BasicFootIK_V2_Explo_C::ZOffset_Pelvis' has a wrong offset!");
static_assert(offsetof(UCR_Mannequin_BasicFootIK_V2_Explo_C, ShouldDoIKTrace) == 0x000AD0, "Member 'UCR_Mannequin_BasicFootIK_V2_Explo_C::ShouldDoIKTrace' has a wrong offset!");
static_assert(offsetof(UCR_Mannequin_BasicFootIK_V2_Explo_C, IkScale) == 0x000AD4, "Member 'UCR_Mannequin_BasicFootIK_V2_Explo_C::IkScale' has a wrong offset!");

}

