#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DialogCondition_Struct

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct DialogCondition_Struct.DialogCondition_Struct
// 0x0020 (0x0020 - 0x0000)
struct FDialogCondition_Struct final
{
public:
	class UDataTable*                             Datatable_3_6C1AA10648E0F37B0BB805983B9E215B;      // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   DataTableRowId_11_96735675403AB004A58FDC97F8068FFF; // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           Interaction_12_D79DAC344C7888A7C7C0D89020DB7807;   // 0x0010(0x0010)(Edit, BlueprintVisible)
};
static_assert(alignof(FDialogCondition_Struct) == 0x000008, "Wrong alignment on FDialogCondition_Struct");
static_assert(sizeof(FDialogCondition_Struct) == 0x000020, "Wrong size on FDialogCondition_Struct");
static_assert(offsetof(FDialogCondition_Struct, Datatable_3_6C1AA10648E0F37B0BB805983B9E215B) == 0x000000, "Member 'FDialogCondition_Struct::Datatable_3_6C1AA10648E0F37B0BB805983B9E215B' has a wrong offset!");
static_assert(offsetof(FDialogCondition_Struct, DataTableRowId_11_96735675403AB004A58FDC97F8068FFF) == 0x000008, "Member 'FDialogCondition_Struct::DataTableRowId_11_96735675403AB004A58FDC97F8068FFF' has a wrong offset!");
static_assert(offsetof(FDialogCondition_Struct, Interaction_12_D79DAC344C7888A7C7C0D89020DB7807) == 0x000010, "Member 'FDialogCondition_Struct::Interaction_12_D79DAC344C7888A7C7C0D89020DB7807' has a wrong offset!");

}

