#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Face_AnimBP_Companion

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function Face_AnimBP_Companion.Face_AnimBP_Companion_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct Face_AnimBP_Companion_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(Face_AnimBP_Companion_C_AnimGraph) == 0x000008, "Wrong alignment on Face_AnimBP_Companion_C_AnimGraph");
static_assert(sizeof(Face_AnimBP_Companion_C_AnimGraph) == 0x000010, "Wrong size on Face_AnimBP_Companion_C_AnimGraph");
static_assert(offsetof(Face_AnimBP_Companion_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'Face_AnimBP_Companion_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function Face_AnimBP_Companion.Face_AnimBP_Companion_C.ExecuteUbergraph_Face_AnimBP_Companion
// 0x0004 (0x0004 - 0x0000)
struct Face_AnimBP_Companion_C_ExecuteUbergraph_Face_AnimBP_Companion final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Face_AnimBP_Companion_C_ExecuteUbergraph_Face_AnimBP_Companion) == 0x000004, "Wrong alignment on Face_AnimBP_Companion_C_ExecuteUbergraph_Face_AnimBP_Companion");
static_assert(sizeof(Face_AnimBP_Companion_C_ExecuteUbergraph_Face_AnimBP_Companion) == 0x000004, "Wrong size on Face_AnimBP_Companion_C_ExecuteUbergraph_Face_AnimBP_Companion");
static_assert(offsetof(Face_AnimBP_Companion_C_ExecuteUbergraph_Face_AnimBP_Companion, EntryPoint) == 0x000000, "Member 'Face_AnimBP_Companion_C_ExecuteUbergraph_Face_AnimBP_Companion::EntryPoint' has a wrong offset!");

}

