#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Face_AnimBP_HumanNPC

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct Face_AnimBP_HumanNPC.Face_AnimBP_HumanNPC_C.AnimBlueprintGeneratedConstantData
// 0x1567 (0x1568 - 0x0001)
struct Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_874;                               // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_875;                               // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_876;                                // 0x000C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_877;                                // 0x0014(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_878;                                // 0x001C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 __ArrayProperty_879;                               // 0x0020(0x0010)(BlueprintVisible)
	class FName                                   __NameProperty_880;                                // 0x0030(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 __ArrayProperty_881;                               // 0x0038(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<int32>                                 __ArrayProperty_882;                               // 0x0048(0x0010)(BlueprintVisible)
	float                                         __FloatProperty_883;                               // 0x0058(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_884;                               // 0x005C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_885;                               // 0x0060(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_886;                               // 0x0064(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_887;                               // 0x0068(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_888;                               // 0x006C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_889;                               // 0x0070(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESequenceEvalReinit                           __ByteProperty_890;                                // 0x0074(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_891;                               // 0x0078(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      __AnimSequenceBase_892;                            // 0x0080(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	float                                         __FloatProperty_893;                               // 0x0088(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_894;                               // 0x008C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlendProfile*                          __BlendProfile_895;                                // 0x0090(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_896;                                  // 0x0098(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_897;                                // 0x00A0(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_898;                                // 0x00A1(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A2[0x6];                                       // 0x00A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_899;                               // 0x00A8(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_900;                                // 0x00B8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_901;                                // 0x00C0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_902;                                // 0x00C8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_903;                                 // 0x00D0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_904;                                // 0x00D4(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D5[0x3];                                       // 0x00D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_905;                               // 0x00D8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_906;                              // 0x00DC(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_907;                               // 0x0108(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_908;                                // 0x010C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_909;                                // 0x010D(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_910;                                // 0x010E(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10F[0x1];                                      // 0x010F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_911;                                // 0x0110(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_912;                                // 0x0118(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_913;                                // 0x0120(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_914;                                 // 0x0128(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12C[0x4];                                      // 0x012C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_915;                              // 0x0130(0x0020)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0150(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x01D0(0x0018)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_CopyPoseFromMesh;               // 0x01E8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LayeredBoneBlend;               // 0x0218(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot_1;                         // 0x0248(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_7;             // 0x0278(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_6;             // 0x02A8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_8;                  // 0x02D8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_41;              // 0x0308(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_40;              // 0x0338(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive_8;                // 0x0368(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_39;              // 0x0398(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive_7;                // 0x03C8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_7;                  // 0x03F8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine_4;                 // 0x0428(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot;                           // 0x0458(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive_6;                // 0x0488(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_5;             // 0x04B8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_4;             // 0x04E8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_6;                  // 0x0518(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_38;              // 0x0548(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_5;                  // 0x0578(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine_3;                 // 0x05A8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_37;              // 0x05D8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_36;              // 0x0608(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_35;              // 0x0638(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_34;              // 0x0668(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_33;              // 0x0698(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_32;              // 0x06C8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_31;              // 0x06F8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_30;              // 0x0728(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_29;              // 0x0758(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_28;              // 0x0788(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_27;              // 0x07B8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_26;              // 0x07E8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_25;              // 0x0818(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_24;              // 0x0848(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_23;              // 0x0878(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_22;              // 0x08A8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_21;              // 0x08D8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_20;              // 0x0908(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_19;              // 0x0938(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_18;              // 0x0968(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_17;              // 0x0998(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_16;              // 0x09C8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_15;              // 0x09F8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_14;              // 0x0A28(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_13;              // 0x0A58(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_12;              // 0x0A88(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_11;              // 0x0AB8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_10;              // 0x0AE8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_9;               // 0x0B18(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_8;               // 0x0B48(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_7;               // 0x0B78(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_6;               // 0x0BA8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum_1;              // 0x0BD8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_4;                  // 0x0C08(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine_2;                 // 0x0C38(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum;                // 0x0C68(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose_3;               // 0x0C98(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequenceEvaluator_7;            // 0x0CC8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequenceEvaluator_6;            // 0x0CF8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequenceEvaluator_5;            // 0x0D28(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequenceEvaluator_4;            // 0x0D58(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequenceEvaluator_3;            // 0x0D88(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequenceEvaluator_2;            // 0x0DB8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequenceEvaluator_1;            // 0x0DE8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequenceEvaluator;              // 0x0E18(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_CurveBlend_1;                   // 0x0E48(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_1;              // 0x0E78(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_5;               // 0x0EA8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive_5;                // 0x0ED8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_4;               // 0x0F08(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive_4;                // 0x0F38(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose_2;               // 0x0F68(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_7;                // 0x0F98(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_6;                // 0x0FC8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive_3;                // 0x0FF8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool;                // 0x1028(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose_1;               // 0x1058(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_5;                // 0x1088(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_4;                // 0x10B8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root;                           // 0x10E8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose;                 // 0x1118(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_3;                // 0x1148(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive_2;                // 0x1178(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_3;             // 0x11A8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_2;             // 0x11D8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_2;                // 0x1208(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_3;                  // 0x1238(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_3;               // 0x1268(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive_1;                // 0x1298(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_2;               // 0x12C8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_1;                // 0x12F8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive;                  // 0x1328(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_2;                  // 0x1358(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine_1;                 // 0x1388(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_CurveBlend;                     // 0x13B8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose;                  // 0x13E8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_1;             // 0x1418(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult;               // 0x1448(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_1;               // 0x1478(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_1;                  // 0x14A8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer;                 // 0x14D8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult;                    // 0x1508(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine;                   // 0x1538(0x0030)()
};
static_assert(alignof(Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData) == 0x001568, "Wrong size on Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData, __FloatProperty_874) == 0x000004, "Member 'Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData::__FloatProperty_874' has a wrong offset!");
static_assert(offsetof(Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData, __FloatProperty_875) == 0x000008, "Member 'Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData::__FloatProperty_875' has a wrong offset!");
static_assert(offsetof(Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData, __NameProperty_876) == 0x00000C, "Member 'Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData::__NameProperty_876' has a wrong offset!");
static_assert(offsetof(Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData, __NameProperty_877) == 0x000014, "Member 'Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData::__NameProperty_877' has a wrong offset!");
static_assert(offsetof(Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData, __EnumProperty_878) == 0x00001C, "Member 'Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData::__EnumProperty_878' has a wrong offset!");
static_assert(offsetof(Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData, __ArrayProperty_879) == 0x000020, "Member 'Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData::__ArrayProperty_879' has a wrong offset!");
static_assert(offsetof(Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData, __NameProperty_880) == 0x000030, "Member 'Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData::__NameProperty_880' has a wrong offset!");
static_assert(offsetof(Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData, __ArrayProperty_881) == 0x000038, "Member 'Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData::__ArrayProperty_881' has a wrong offset!");
static_assert(offsetof(Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData, __ArrayProperty_882) == 0x000048, "Member 'Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData::__ArrayProperty_882' has a wrong offset!");
static_assert(offsetof(Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData, __FloatProperty_883) == 0x000058, "Member 'Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData::__FloatProperty_883' has a wrong offset!");
static_assert(offsetof(Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData, __FloatProperty_884) == 0x00005C, "Member 'Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData::__FloatProperty_884' has a wrong offset!");
static_assert(offsetof(Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData, __FloatProperty_885) == 0x000060, "Member 'Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData::__FloatProperty_885' has a wrong offset!");
static_assert(offsetof(Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData, __FloatProperty_886) == 0x000064, "Member 'Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData::__FloatProperty_886' has a wrong offset!");
static_assert(offsetof(Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData, __FloatProperty_887) == 0x000068, "Member 'Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData::__FloatProperty_887' has a wrong offset!");
static_assert(offsetof(Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData, __FloatProperty_888) == 0x00006C, "Member 'Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData::__FloatProperty_888' has a wrong offset!");
static_assert(offsetof(Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData, __FloatProperty_889) == 0x000070, "Member 'Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData::__FloatProperty_889' has a wrong offset!");
static_assert(offsetof(Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData, __ByteProperty_890) == 0x000074, "Member 'Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData::__ByteProperty_890' has a wrong offset!");
static_assert(offsetof(Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData, __FloatProperty_891) == 0x000078, "Member 'Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData::__FloatProperty_891' has a wrong offset!");
static_assert(offsetof(Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_892) == 0x000080, "Member 'Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_892' has a wrong offset!");
static_assert(offsetof(Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData, __FloatProperty_893) == 0x000088, "Member 'Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData::__FloatProperty_893' has a wrong offset!");
static_assert(offsetof(Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData, __FloatProperty_894) == 0x00008C, "Member 'Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData::__FloatProperty_894' has a wrong offset!");
static_assert(offsetof(Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData, __BlendProfile_895) == 0x000090, "Member 'Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData::__BlendProfile_895' has a wrong offset!");
static_assert(offsetof(Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData, __CurveFloat_896) == 0x000098, "Member 'Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData::__CurveFloat_896' has a wrong offset!");
static_assert(offsetof(Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData, __EnumProperty_897) == 0x0000A0, "Member 'Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData::__EnumProperty_897' has a wrong offset!");
static_assert(offsetof(Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData, __EnumProperty_898) == 0x0000A1, "Member 'Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData::__EnumProperty_898' has a wrong offset!");
static_assert(offsetof(Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData, __ArrayProperty_899) == 0x0000A8, "Member 'Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData::__ArrayProperty_899' has a wrong offset!");
static_assert(offsetof(Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData, __NameProperty_900) == 0x0000B8, "Member 'Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData::__NameProperty_900' has a wrong offset!");
static_assert(offsetof(Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData, __NameProperty_901) == 0x0000C0, "Member 'Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData::__NameProperty_901' has a wrong offset!");
static_assert(offsetof(Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData, __NameProperty_902) == 0x0000C8, "Member 'Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData::__NameProperty_902' has a wrong offset!");
static_assert(offsetof(Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData, __IntProperty_903) == 0x0000D0, "Member 'Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData::__IntProperty_903' has a wrong offset!");
static_assert(offsetof(Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData, __BoolProperty_904) == 0x0000D4, "Member 'Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData::__BoolProperty_904' has a wrong offset!");
static_assert(offsetof(Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData, __FloatProperty_905) == 0x0000D8, "Member 'Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData::__FloatProperty_905' has a wrong offset!");
static_assert(offsetof(Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData, __StructProperty_906) == 0x0000DC, "Member 'Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData::__StructProperty_906' has a wrong offset!");
static_assert(offsetof(Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData, __FloatProperty_907) == 0x000108, "Member 'Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData::__FloatProperty_907' has a wrong offset!");
static_assert(offsetof(Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData, __BoolProperty_908) == 0x00010C, "Member 'Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData::__BoolProperty_908' has a wrong offset!");
static_assert(offsetof(Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData, __EnumProperty_909) == 0x00010D, "Member 'Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData::__EnumProperty_909' has a wrong offset!");
static_assert(offsetof(Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData, __ByteProperty_910) == 0x00010E, "Member 'Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData::__ByteProperty_910' has a wrong offset!");
static_assert(offsetof(Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData, __NameProperty_911) == 0x000110, "Member 'Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData::__NameProperty_911' has a wrong offset!");
static_assert(offsetof(Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData, __NameProperty_912) == 0x000118, "Member 'Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData::__NameProperty_912' has a wrong offset!");
static_assert(offsetof(Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData, __NameProperty_913) == 0x000120, "Member 'Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData::__NameProperty_913' has a wrong offset!");
static_assert(offsetof(Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData, __IntProperty_914) == 0x000128, "Member 'Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData::__IntProperty_914' has a wrong offset!");
static_assert(offsetof(Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData, __StructProperty_915) == 0x000130, "Member 'Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData::__StructProperty_915' has a wrong offset!");
static_assert(offsetof(Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000150, "Member 'Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x0001D0, "Member 'Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData, AnimGraphNode_CopyPoseFromMesh) == 0x0001E8, "Member 'Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData::AnimGraphNode_CopyPoseFromMesh' has a wrong offset!");
static_assert(offsetof(Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LayeredBoneBlend) == 0x000218, "Member 'Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LayeredBoneBlend' has a wrong offset!");
static_assert(offsetof(Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Slot_1) == 0x000248, "Member 'Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Slot_1' has a wrong offset!");
static_assert(offsetof(Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_7) == 0x000278, "Member 'Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_7' has a wrong offset!");
static_assert(offsetof(Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_6) == 0x0002A8, "Member 'Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_6' has a wrong offset!");
static_assert(offsetof(Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult_8) == 0x0002D8, "Member 'Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult_8' has a wrong offset!");
static_assert(offsetof(Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_41) == 0x000308, "Member 'Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_41' has a wrong offset!");
static_assert(offsetof(Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_40) == 0x000338, "Member 'Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_40' has a wrong offset!");
static_assert(offsetof(Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ApplyAdditive_8) == 0x000368, "Member 'Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ApplyAdditive_8' has a wrong offset!");
static_assert(offsetof(Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_39) == 0x000398, "Member 'Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_39' has a wrong offset!");
static_assert(offsetof(Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ApplyAdditive_7) == 0x0003C8, "Member 'Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ApplyAdditive_7' has a wrong offset!");
static_assert(offsetof(Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult_7) == 0x0003F8, "Member 'Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult_7' has a wrong offset!");
static_assert(offsetof(Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateMachine_4) == 0x000428, "Member 'Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateMachine_4' has a wrong offset!");
static_assert(offsetof(Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Slot) == 0x000458, "Member 'Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ApplyAdditive_6) == 0x000488, "Member 'Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ApplyAdditive_6' has a wrong offset!");
static_assert(offsetof(Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_5) == 0x0004B8, "Member 'Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_5' has a wrong offset!");
static_assert(offsetof(Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_4) == 0x0004E8, "Member 'Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_4' has a wrong offset!");
static_assert(offsetof(Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult_6) == 0x000518, "Member 'Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult_6' has a wrong offset!");
static_assert(offsetof(Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_38) == 0x000548, "Member 'Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_38' has a wrong offset!");
static_assert(offsetof(Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult_5) == 0x000578, "Member 'Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult_5' has a wrong offset!");
static_assert(offsetof(Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateMachine_3) == 0x0005A8, "Member 'Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateMachine_3' has a wrong offset!");
static_assert(offsetof(Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_37) == 0x0005D8, "Member 'Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_37' has a wrong offset!");
static_assert(offsetof(Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_36) == 0x000608, "Member 'Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_36' has a wrong offset!");
static_assert(offsetof(Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_35) == 0x000638, "Member 'Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_35' has a wrong offset!");
static_assert(offsetof(Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_34) == 0x000668, "Member 'Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_34' has a wrong offset!");
static_assert(offsetof(Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_33) == 0x000698, "Member 'Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_33' has a wrong offset!");
static_assert(offsetof(Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_32) == 0x0006C8, "Member 'Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_32' has a wrong offset!");
static_assert(offsetof(Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_31) == 0x0006F8, "Member 'Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_31' has a wrong offset!");
static_assert(offsetof(Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_30) == 0x000728, "Member 'Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_30' has a wrong offset!");
static_assert(offsetof(Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_29) == 0x000758, "Member 'Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_29' has a wrong offset!");
static_assert(offsetof(Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_28) == 0x000788, "Member 'Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_28' has a wrong offset!");
static_assert(offsetof(Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_27) == 0x0007B8, "Member 'Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_27' has a wrong offset!");
static_assert(offsetof(Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_26) == 0x0007E8, "Member 'Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_26' has a wrong offset!");
static_assert(offsetof(Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_25) == 0x000818, "Member 'Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_25' has a wrong offset!");
static_assert(offsetof(Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_24) == 0x000848, "Member 'Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_24' has a wrong offset!");
static_assert(offsetof(Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_23) == 0x000878, "Member 'Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_23' has a wrong offset!");
static_assert(offsetof(Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_22) == 0x0008A8, "Member 'Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_22' has a wrong offset!");
static_assert(offsetof(Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_21) == 0x0008D8, "Member 'Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_21' has a wrong offset!");
static_assert(offsetof(Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_20) == 0x000908, "Member 'Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_20' has a wrong offset!");
static_assert(offsetof(Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_19) == 0x000938, "Member 'Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_19' has a wrong offset!");
static_assert(offsetof(Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_18) == 0x000968, "Member 'Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_18' has a wrong offset!");
static_assert(offsetof(Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_17) == 0x000998, "Member 'Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_17' has a wrong offset!");
static_assert(offsetof(Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_16) == 0x0009C8, "Member 'Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_16' has a wrong offset!");
static_assert(offsetof(Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_15) == 0x0009F8, "Member 'Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_15' has a wrong offset!");
static_assert(offsetof(Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_14) == 0x000A28, "Member 'Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_14' has a wrong offset!");
static_assert(offsetof(Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_13) == 0x000A58, "Member 'Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_13' has a wrong offset!");
static_assert(offsetof(Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_12) == 0x000A88, "Member 'Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_12' has a wrong offset!");
static_assert(offsetof(Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_11) == 0x000AB8, "Member 'Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_11' has a wrong offset!");
static_assert(offsetof(Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_10) == 0x000AE8, "Member 'Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_10' has a wrong offset!");
static_assert(offsetof(Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_9) == 0x000B18, "Member 'Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_9' has a wrong offset!");
static_assert(offsetof(Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_8) == 0x000B48, "Member 'Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_8' has a wrong offset!");
static_assert(offsetof(Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_7) == 0x000B78, "Member 'Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_7' has a wrong offset!");
static_assert(offsetof(Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_6) == 0x000BA8, "Member 'Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_6' has a wrong offset!");
static_assert(offsetof(Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendListByEnum_1) == 0x000BD8, "Member 'Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendListByEnum_1' has a wrong offset!");
static_assert(offsetof(Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult_4) == 0x000C08, "Member 'Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult_4' has a wrong offset!");
static_assert(offsetof(Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateMachine_2) == 0x000C38, "Member 'Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateMachine_2' has a wrong offset!");
static_assert(offsetof(Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendListByEnum) == 0x000C68, "Member 'Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendListByEnum' has a wrong offset!");
static_assert(offsetof(Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SaveCachedPose_3) == 0x000C98, "Member 'Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SaveCachedPose_3' has a wrong offset!");
static_assert(offsetof(Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequenceEvaluator_7) == 0x000CC8, "Member 'Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequenceEvaluator_7' has a wrong offset!");
static_assert(offsetof(Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequenceEvaluator_6) == 0x000CF8, "Member 'Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequenceEvaluator_6' has a wrong offset!");
static_assert(offsetof(Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequenceEvaluator_5) == 0x000D28, "Member 'Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequenceEvaluator_5' has a wrong offset!");
static_assert(offsetof(Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequenceEvaluator_4) == 0x000D58, "Member 'Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequenceEvaluator_4' has a wrong offset!");
static_assert(offsetof(Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequenceEvaluator_3) == 0x000D88, "Member 'Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequenceEvaluator_3' has a wrong offset!");
static_assert(offsetof(Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequenceEvaluator_2) == 0x000DB8, "Member 'Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequenceEvaluator_2' has a wrong offset!");
static_assert(offsetof(Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequenceEvaluator_1) == 0x000DE8, "Member 'Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequenceEvaluator_1' has a wrong offset!");
static_assert(offsetof(Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequenceEvaluator) == 0x000E18, "Member 'Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequenceEvaluator' has a wrong offset!");
static_assert(offsetof(Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData, AnimGraphNode_CurveBlend_1) == 0x000E48, "Member 'Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData::AnimGraphNode_CurveBlend_1' has a wrong offset!");
static_assert(offsetof(Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendListByBool_1) == 0x000E78, "Member 'Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendListByBool_1' has a wrong offset!");
static_assert(offsetof(Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_5) == 0x000EA8, "Member 'Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_5' has a wrong offset!");
static_assert(offsetof(Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ApplyAdditive_5) == 0x000ED8, "Member 'Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ApplyAdditive_5' has a wrong offset!");
static_assert(offsetof(Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_4) == 0x000F08, "Member 'Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_4' has a wrong offset!");
static_assert(offsetof(Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ApplyAdditive_4) == 0x000F38, "Member 'Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ApplyAdditive_4' has a wrong offset!");
static_assert(offsetof(Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SaveCachedPose_2) == 0x000F68, "Member 'Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SaveCachedPose_2' has a wrong offset!");
static_assert(offsetof(Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData, AnimGraphNode_UseCachedPose_7) == 0x000F98, "Member 'Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData::AnimGraphNode_UseCachedPose_7' has a wrong offset!");
static_assert(offsetof(Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData, AnimGraphNode_UseCachedPose_6) == 0x000FC8, "Member 'Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData::AnimGraphNode_UseCachedPose_6' has a wrong offset!");
static_assert(offsetof(Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ApplyAdditive_3) == 0x000FF8, "Member 'Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ApplyAdditive_3' has a wrong offset!");
static_assert(offsetof(Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendListByBool) == 0x001028, "Member 'Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SaveCachedPose_1) == 0x001058, "Member 'Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SaveCachedPose_1' has a wrong offset!");
static_assert(offsetof(Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData, AnimGraphNode_UseCachedPose_5) == 0x001088, "Member 'Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData::AnimGraphNode_UseCachedPose_5' has a wrong offset!");
static_assert(offsetof(Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData, AnimGraphNode_UseCachedPose_4) == 0x0010B8, "Member 'Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData::AnimGraphNode_UseCachedPose_4' has a wrong offset!");
static_assert(offsetof(Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root) == 0x0010E8, "Member 'Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SaveCachedPose) == 0x001118, "Member 'Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData, AnimGraphNode_UseCachedPose_3) == 0x001148, "Member 'Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData::AnimGraphNode_UseCachedPose_3' has a wrong offset!");
static_assert(offsetof(Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ApplyAdditive_2) == 0x001178, "Member 'Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ApplyAdditive_2' has a wrong offset!");
static_assert(offsetof(Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_3) == 0x0011A8, "Member 'Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_3' has a wrong offset!");
static_assert(offsetof(Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_2) == 0x0011D8, "Member 'Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_2' has a wrong offset!");
static_assert(offsetof(Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData, AnimGraphNode_UseCachedPose_2) == 0x001208, "Member 'Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData::AnimGraphNode_UseCachedPose_2' has a wrong offset!");
static_assert(offsetof(Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult_3) == 0x001238, "Member 'Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult_3' has a wrong offset!");
static_assert(offsetof(Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_3) == 0x001268, "Member 'Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_3' has a wrong offset!");
static_assert(offsetof(Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ApplyAdditive_1) == 0x001298, "Member 'Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ApplyAdditive_1' has a wrong offset!");
static_assert(offsetof(Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_2) == 0x0012C8, "Member 'Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData, AnimGraphNode_UseCachedPose_1) == 0x0012F8, "Member 'Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData::AnimGraphNode_UseCachedPose_1' has a wrong offset!");
static_assert(offsetof(Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ApplyAdditive) == 0x001328, "Member 'Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ApplyAdditive' has a wrong offset!");
static_assert(offsetof(Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult_2) == 0x001358, "Member 'Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult_2' has a wrong offset!");
static_assert(offsetof(Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateMachine_1) == 0x001388, "Member 'Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateMachine_1' has a wrong offset!");
static_assert(offsetof(Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData, AnimGraphNode_CurveBlend) == 0x0013B8, "Member 'Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData::AnimGraphNode_CurveBlend' has a wrong offset!");
static_assert(offsetof(Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData, AnimGraphNode_UseCachedPose) == 0x0013E8, "Member 'Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_1) == 0x001418, "Member 'Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult) == 0x001448, "Member 'Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_1) == 0x001478, "Member 'Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult_1) == 0x0014A8, "Member 'Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer) == 0x0014D8, "Member 'Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult) == 0x001508, "Member 'Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateMachine) == 0x001538, "Member 'Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateMachine' has a wrong offset!");

// ScriptStruct Face_AnimBP_HumanNPC.Face_AnimBP_HumanNPC_C.AnimBlueprintGeneratedMutableData
// 0x001F (0x0020 - 0x0001)
struct Face_AnimBP_HumanNPC::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty;                                   // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 __ArrayProperty_0;                                 // 0x0008(0x0010)(BlueprintVisible, EditFixedSize)
	uint8                                         __ByteProperty_1;                                  // 0x0018(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __ByteProperty_2;                                  // 0x0019(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
