#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FAudioCharacter_Battle_DeathCommon

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct FAudioCharacter_Battle_DeathCommon.FAudioCharacter_Battle_DeathCommon
// 0x0020 (0x0020 - 0x0000)
struct FFAudioCharacter_Battle_DeathCommon final
{
public:
	class UMetaSoundSource*                       DeathSFX_4_42A8D0F9462BA131ECCC07AB5999173A;       // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMetaSoundSource*                       DeathVocal_5_FFE093F943CB98BF8045D8A452EBC2E8;     // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMetaSoundSource*                       DeathFoley_7_A9D261F84881EB0CD0FE95819CF1846E;     // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMetaSoundSource*                       DeathStep_9_4D32E787406EC5F38489D4AC13D1E5CF;      // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FFAudioCharacter_Battle_DeathCommon) == 0x000008, "Wrong alignment on FFAudioCharacter_Battle_DeathCommon");
static_assert(sizeof(FFAudioCharacter_Battle_DeathCommon) == 0x000020, "Wrong size on FFAudioCharacter_Battle_DeathCommon");
static_assert(offsetof(FFAudioCharacter_Battle_DeathCommon, DeathSFX_4_42A8D0F9462BA131ECCC07AB5999173A) == 0x000000, "Member 'FFAudioCharacter_Battle_DeathCommon::DeathSFX_4_42A8D0F9462BA131ECCC07AB5999173A' has a wrong offset!");
static_assert(offsetof(FFAudioCharacter_Battle_DeathCommon, DeathVocal_5_FFE093F943CB98BF8045D8A452EBC2E8) == 0x000008, "Member 'FFAudioCharacter_Battle_DeathCommon::DeathVocal_5_FFE093F943CB98BF8045D8A452EBC2E8' has a wrong offset!");
static_assert(offsetof(FFAudioCharacter_Battle_DeathCommon, DeathFoley_7_A9D261F84881EB0CD0FE95819CF1846E) == 0x000010, "Member 'FFAudioCharacter_Battle_DeathCommon::DeathFoley_7_A9D261F84881EB0CD0FE95819CF1846E' has a wrong offset!");
static_assert(offsetof(FFAudioCharacter_Battle_DeathCommon, DeathStep_9_4D32E787406EC5F38489D4AC13D1E5CF) == 0x000018, "Member 'FFAudioCharacter_Battle_DeathCommon::DeathStep_9_4D32E787406EC5F38489D4AC13D1E5CF' has a wrong offset!");

}

