#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FAudioCharacter_Battle_HitBy_AnimCommon

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct FAudioCharacter_Battle_HitBy_AnimCommon.FAudioCharacter_Battle_HitBy_AnimCommon
// 0x0040 (0x0040 - 0x0000)
struct FFAudioCharacter_Battle_HitBy_AnimCommon final
{
public:
	class UMetaSoundSource*                       HitBy_Shield_SFX_20_875CA4324DD90A8840F995A36810E0BE; // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMetaSoundSource*                       HitBy_ShieldVocal_21_8CFB2EEF4C13FC4278BBC08E68F4311C; // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMetaSoundSource*                       HitBy_ShieldFoleys_22_98DF739C4689A7198BFFB994C89A6F58; // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMetaSoundSource*                       HitBy_ShieldSteps_23_F4CB50FE4A1A6A535C141591352EEACA; // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMetaSoundSource*                       HitBy_ShieldBroken_SFX_28_4C76ECEB486CD3071381DEA9EE716CDA; // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMetaSoundSource*                       HitBy_ShieldBroken_Vocal_27_FA4A8B984AD7953BC9C45A91217A8753; // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMetaSoundSource*                       HitBy_ShieldBroken_Foleys_26_DBE6CA174F7D32C82A40DC9B4EBE0180; // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMetaSoundSource*                       HitBy__ShieldBroken_Steps_29_EBBDB3D24021604F23CBBE8532A74F7E; // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FFAudioCharacter_Battle_HitBy_AnimCommon) == 0x000008, "Wrong alignment on FFAudioCharacter_Battle_HitBy_AnimCommon");
static_assert(sizeof(FFAudioCharacter_Battle_HitBy_AnimCommon) == 0x000040, "Wrong size on FFAudioCharacter_Battle_HitBy_AnimCommon");
static_assert(offsetof(FFAudioCharacter_Battle_HitBy_AnimCommon, HitBy_Shield_SFX_20_875CA4324DD90A8840F995A36810E0BE) == 0x000000, "Member 'FFAudioCharacter_Battle_HitBy_AnimCommon::HitBy_Shield_SFX_20_875CA4324DD90A8840F995A36810E0BE' has a wrong offset!");
static_assert(offsetof(FFAudioCharacter_Battle_HitBy_AnimCommon, HitBy_ShieldVocal_21_8CFB2EEF4C13FC4278BBC08E68F4311C) == 0x000008, "Member 'FFAudioCharacter_Battle_HitBy_AnimCommon::HitBy_ShieldVocal_21_8CFB2EEF4C13FC4278BBC08E68F4311C' has a wrong offset!");
static_assert(offsetof(FFAudioCharacter_Battle_HitBy_AnimCommon, HitBy_ShieldFoleys_22_98DF739C4689A7198BFFB994C89A6F58) == 0x000010, "Member 'FFAudioCharacter_Battle_HitBy_AnimCommon::HitBy_ShieldFoleys_22_98DF739C4689A7198BFFB994C89A6F58' has a wrong offset!");
static_assert(offsetof(FFAudioCharacter_Battle_HitBy_AnimCommon, HitBy_ShieldSteps_23_F4CB50FE4A1A6A535C141591352EEACA) == 0x000018, "Member 'FFAudioCharacter_Battle_HitBy_AnimCommon::HitBy_ShieldSteps_23_F4CB50FE4A1A6A535C141591352EEACA' has a wrong offset!");
static_assert(offsetof(FFAudioCharacter_Battle_HitBy_AnimCommon, HitBy_ShieldBroken_SFX_28_4C76ECEB486CD3071381DEA9EE716CDA) == 0x000020, "Member 'FFAudioCharacter_Battle_HitBy_AnimCommon::HitBy_ShieldBroken_SFX_28_4C76ECEB486CD3071381DEA9EE716CDA' has a wrong offset!");
static_assert(offsetof(FFAudioCharacter_Battle_HitBy_AnimCommon, HitBy_ShieldBroken_Vocal_27_FA4A8B984AD7953BC9C45A91217A8753) == 0x000028, "Member 'FFAudioCharacter_Battle_HitBy_AnimCommon::HitBy_ShieldBroken_Vocal_27_FA4A8B984AD7953BC9C45A91217A8753' has a wrong offset!");
static_assert(offsetof(FFAudioCharacter_Battle_HitBy_AnimCommon, HitBy_ShieldBroken_Foleys_26_DBE6CA174F7D32C82A40DC9B4EBE0180) == 0x000030, "Member 'FFAudioCharacter_Battle_HitBy_AnimCommon::HitBy_ShieldBroken_Foleys_26_DBE6CA174F7D32C82A40DC9B4EBE0180' has a wrong offset!");
static_assert(offsetof(FFAudioCharacter_Battle_HitBy_AnimCommon, HitBy__ShieldBroken_Steps_29_EBBDB3D24021604F23CBBE8532A74F7E) == 0x000038, "Member 'FFAudioCharacter_Battle_HitBy_AnimCommon::HitBy__ShieldBroken_Steps_29_EBBDB3D24021604F23CBBE8532A74F7E' has a wrong offset!");

}

