#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FAudioCharacter_ExplorationSFXType

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct FAudioCharacter_ExplorationSFXType.FAudioCharacter_ExplorationSFXType
// 0x0038 (0x0038 - 0x0000)
struct FFAudioCharacter_ExplorationSFXType final
{
public:
	class UMetaSoundSource*                       FreeAimHit_6_CF7E093E43FD56C98E783D9B1E242DE6;     // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMetaSoundSource*                       FreeAimStart_7_4768304F45DD2E40557947B5B0AB7C69;   // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMetaSoundSource*                       FreeAimStop_8_8A05D864418955E24EBD649C92C90BAF;    // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMetaSoundSource*                       FreeAimShot_9_BFAC80A744264D0CD4E91E82890FA9F9;    // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMetaSoundSource*                       Teleport_10_7DBA12274D4B8A2C0009E9B62089D472;      // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMetaSoundSource*                       CharacterSwitch_12_A29C9EF34DF63FF46315E99A4A41EA90; // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMetaSoundSource*                       AttackExploration_15_3EB283224FB12372CFC02BA2E330CF39; // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FFAudioCharacter_ExplorationSFXType) == 0x000008, "Wrong alignment on FFAudioCharacter_ExplorationSFXType");
static_assert(sizeof(FFAudioCharacter_ExplorationSFXType) == 0x000038, "Wrong size on FFAudioCharacter_ExplorationSFXType");
static_assert(offsetof(FFAudioCharacter_ExplorationSFXType, FreeAimHit_6_CF7E093E43FD56C98E783D9B1E242DE6) == 0x000000, "Member 'FFAudioCharacter_ExplorationSFXType::FreeAimHit_6_CF7E093E43FD56C98E783D9B1E242DE6' has a wrong offset!");
static_assert(offsetof(FFAudioCharacter_ExplorationSFXType, FreeAimStart_7_4768304F45DD2E40557947B5B0AB7C69) == 0x000008, "Member 'FFAudioCharacter_ExplorationSFXType::FreeAimStart_7_4768304F45DD2E40557947B5B0AB7C69' has a wrong offset!");
static_assert(offsetof(FFAudioCharacter_ExplorationSFXType, FreeAimStop_8_8A05D864418955E24EBD649C92C90BAF) == 0x000010, "Member 'FFAudioCharacter_ExplorationSFXType::FreeAimStop_8_8A05D864418955E24EBD649C92C90BAF' has a wrong offset!");
static_assert(offsetof(FFAudioCharacter_ExplorationSFXType, FreeAimShot_9_BFAC80A744264D0CD4E91E82890FA9F9) == 0x000018, "Member 'FFAudioCharacter_ExplorationSFXType::FreeAimShot_9_BFAC80A744264D0CD4E91E82890FA9F9' has a wrong offset!");
static_assert(offsetof(FFAudioCharacter_ExplorationSFXType, Teleport_10_7DBA12274D4B8A2C0009E9B62089D472) == 0x000020, "Member 'FFAudioCharacter_ExplorationSFXType::Teleport_10_7DBA12274D4B8A2C0009E9B62089D472' has a wrong offset!");
static_assert(offsetof(FFAudioCharacter_ExplorationSFXType, CharacterSwitch_12_A29C9EF34DF63FF46315E99A4A41EA90) == 0x000028, "Member 'FFAudioCharacter_ExplorationSFXType::CharacterSwitch_12_A29C9EF34DF63FF46315E99A4A41EA90' has a wrong offset!");
static_assert(offsetof(FFAudioCharacter_ExplorationSFXType, AttackExploration_15_3EB283224FB12372CFC02BA2E330CF39) == 0x000030, "Member 'FFAudioCharacter_ExplorationSFXType::AttackExploration_15_3EB283224FB12372CFC02BA2E330CF39' has a wrong offset!");

}

