#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FAudioBattleCommonSFX

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct FAudioBattleCommonSFX.FAudioBattleCommonSFX
// 0x0058 (0x0058 - 0x0000)
struct FFAudioBattleCommonSFX final
{
public:
	class UMetaSoundSource*                       Dodge_2_0EA3E33248DE57C73621B581335FA430;          // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMetaSoundSource*                       FreeAimHit_A_7_DA5016CB4CE4880B3B24B0A5CB036F22;   // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMetaSoundSource*                       FreeAimHit_B_9_87EA659742ACC222E3A1219A6BA0757C;   // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMetaSoundSource*                       FreeAimHit_C_11_73355CA9471455CFC7AC49840228B7E9;  // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMetaSoundSource*                       FreeAimHit_D_13_95362C4B48F25232F540EDAED4B47338;  // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMetaSoundSource*                       Heal_16_6E0921574BD09E20FC8025A3078DD944;          // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMetaSoundSource*                       Buff_18_C64041874CF9ACF2C540568028DF2642;          // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMetaSoundSource*                       Powerfull_20_63D6597C4F5E7B8211E52EAD2DF0D8F3;     // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMetaSoundSource*                       FreeAimStart_23_B88ED9404BE526DE86953C98B93B4E23;  // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMetaSoundSource*                       FreeAimStop_25_E1EC9CE447087C645FC5ACBA99ABE2ED;   // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMetaSoundSource*                       ShieldBreak_28_4545CA1143D66762538EE1A166DC3DF0;   // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FFAudioBattleCommonSFX) == 0x000008, "Wrong alignment on FFAudioBattleCommonSFX");
static_assert(sizeof(FFAudioBattleCommonSFX) == 0x000058, "Wrong size on FFAudioBattleCommonSFX");
static_assert(offsetof(FFAudioBattleCommonSFX, Dodge_2_0EA3E33248DE57C73621B581335FA430) == 0x000000, "Member 'FFAudioBattleCommonSFX::Dodge_2_0EA3E33248DE57C73621B581335FA430' has a wrong offset!");
static_assert(offsetof(FFAudioBattleCommonSFX, FreeAimHit_A_7_DA5016CB4CE4880B3B24B0A5CB036F22) == 0x000008, "Member 'FFAudioBattleCommonSFX::FreeAimHit_A_7_DA5016CB4CE4880B3B24B0A5CB036F22' has a wrong offset!");
static_assert(offsetof(FFAudioBattleCommonSFX, FreeAimHit_B_9_87EA659742ACC222E3A1219A6BA0757C) == 0x000010, "Member 'FFAudioBattleCommonSFX::FreeAimHit_B_9_87EA659742ACC222E3A1219A6BA0757C' has a wrong offset!");
static_assert(offsetof(FFAudioBattleCommonSFX, FreeAimHit_C_11_73355CA9471455CFC7AC49840228B7E9) == 0x000018, "Member 'FFAudioBattleCommonSFX::FreeAimHit_C_11_73355CA9471455CFC7AC49840228B7E9' has a wrong offset!");
static_assert(offsetof(FFAudioBattleCommonSFX, FreeAimHit_D_13_95362C4B48F25232F540EDAED4B47338) == 0x000020, "Member 'FFAudioBattleCommonSFX::FreeAimHit_D_13_95362C4B48F25232F540EDAED4B47338' has a wrong offset!");
static_assert(offsetof(FFAudioBattleCommonSFX, Heal_16_6E0921574BD09E20FC8025A3078DD944) == 0x000028, "Member 'FFAudioBattleCommonSFX::Heal_16_6E0921574BD09E20FC8025A3078DD944' has a wrong offset!");
static_assert(offsetof(FFAudioBattleCommonSFX, Buff_18_C64041874CF9ACF2C540568028DF2642) == 0x000030, "Member 'FFAudioBattleCommonSFX::Buff_18_C64041874CF9ACF2C540568028DF2642' has a wrong offset!");
static_assert(offsetof(FFAudioBattleCommonSFX, Powerfull_20_63D6597C4F5E7B8211E52EAD2DF0D8F3) == 0x000038, "Member 'FFAudioBattleCommonSFX::Powerfull_20_63D6597C4F5E7B8211E52EAD2DF0D8F3' has a wrong offset!");
static_assert(offsetof(FFAudioBattleCommonSFX, FreeAimStart_23_B88ED9404BE526DE86953C98B93B4E23) == 0x000040, "Member 'FFAudioBattleCommonSFX::FreeAimStart_23_B88ED9404BE526DE86953C98B93B4E23' has a wrong offset!");
static_assert(offsetof(FFAudioBattleCommonSFX, FreeAimStop_25_E1EC9CE447087C645FC5ACBA99ABE2ED) == 0x000048, "Member 'FFAudioBattleCommonSFX::FreeAimStop_25_E1EC9CE447087C645FC5ACBA99ABE2ED' has a wrong offset!");
static_assert(offsetof(FFAudioBattleCommonSFX, ShieldBreak_28_4545CA1143D66762538EE1A166DC3DF0) == 0x000050, "Member 'FFAudioBattleCommonSFX::ShieldBreak_28_4545CA1143D66762538EE1A166DC3DF0' has a wrong offset!");

}

