#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FBattleStartParams

#include "Basic.hpp"

#include "SandFall_structs.hpp"
#include "S_MusicParameters_structs.hpp"
#include "Engine_structs.hpp"
#include "E_jRPG_EngageTypes_structs.hpp"
#include "EBattleTransitionType_structs.hpp"
#include "S_GameFlowTransitionRequest_structs.hpp"
#include "S_RangedAmbienceParameters_structs.hpp"
#include "S_jRPG_PartySlot_structs.hpp"
#include "S_BattleRewardParameters_structs.hpp"


namespace SDK
{

// UserDefinedStruct FBattleStartParams.FBattleStartParams
// 0x0158 (0x0158 - 0x0000)
struct FFBattleStartParams final
{
public:
	struct FDataTableRowHandle                    EncounterRow_25_76E166214BC95AA2A6A68DAD97A47C62;  // 0x0000(0x0010)(Edit, BlueprintVisible, NoDestructor)
	class FName                                   EnemyGlobalID_12_57EC6FC84879C6C042EC7BB68F507FE2; // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_jRPG_EngageTypes                            EngagementType_15_D00812C641AFF3AF663DC6B910763D7D; // 0x0018(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_BattleMap_C*                        BattleMapBP_18_E90DB870407FE894CA7200B075D98B4A;   // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class ABP_BattleMap_C>         BattleMapBPSoft_41_9D55F2484E1768C57CF31794DEDE717F; // 0x0028(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TArray<class UDataLayerAsset*>                BattleMapDataLayers_55_4664B50E490D09A9318C6E8B7DAE07BB; // 0x0050(0x0010)(Edit, BlueprintVisible)
	EBattleTransitionType                         TransitionType_31_74930912436832AA7F5A1C8F139A7E9A; // 0x0060(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          PlayCameraIntro_21_FE94DAD74E9218AB0C1D48A3DC163272; // 0x0061(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ForceFleeImpossible_28_67F4412A4BF319F3EFFE8C8110E1CBC5; // 0x0062(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_63[0x5];                                       // 0x0063(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_MusicParameters                     MusicParameters_58_3EF84D0A4944D7C4EF7BFCB46E28D32F; // 0x0068(0x0030)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FS_RangedAmbienceParameters            AmbienceParameters_70_3266EC90459D6B4160BC0C8BA9F793EC; // 0x0098(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameAction_Wrapper                    GameActionPostBattleWrapper_45_A2233C9E408877A1A0FE07B484DD564D; // 0x00A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class UBP_PDT_GameAction_C*                   GameActionPostBattle_35_61E2AECF4179AB60F99ABCB5EA5BB96F; // 0x00B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          BackToExplorationOnLost_38_6E7B04094D32F81767771FA52BAE96D1; // 0x00C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x3];                                       // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         EncounterLevelOffset_53_1CBE091C40F1DC0A4C5A0EAC44E28B8E; // 0x00C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FS_jRPG_PartySlot>              OverrideParty_63_56C3E35647CCE3DAC58BE292F8A3FFC0; // 0x00C8(0x0010)(Edit, BlueprintVisible)
	bool                                          AllowReserveTeam_67_D9994E8845C61EC655889197EAE92383; // 0x00D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_GameFlowTransitionRequest           PostBattleGameFlowTransitionRequest_73_C8BDFC0E4427AB7B19B5CC9366CE349E; // 0x00E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_BattleRewardParameters              BattleRewardParameters_76_45FD14DB462B63342F7B6189548E447A; // 0x00F0(0x0068)(Edit, BlueprintVisible, HasGetValueTypeHash)
};
static_assert(alignof(FFBattleStartParams) == 0x000008, "Wrong alignment on FFBattleStartParams");
static_assert(sizeof(FFBattleStartParams) == 0x000158, "Wrong size on FFBattleStartParams");
static_assert(offsetof(FFBattleStartParams, EncounterRow_25_76E166214BC95AA2A6A68DAD97A47C62) == 0x000000, "Member 'FFBattleStartParams::EncounterRow_25_76E166214BC95AA2A6A68DAD97A47C62' has a wrong offset!");
static_assert(offsetof(FFBattleStartParams, EnemyGlobalID_12_57EC6FC84879C6C042EC7BB68F507FE2) == 0x000010, "Member 'FFBattleStartParams::EnemyGlobalID_12_57EC6FC84879C6C042EC7BB68F507FE2' has a wrong offset!");
static_assert(offsetof(FFBattleStartParams, EngagementType_15_D00812C641AFF3AF663DC6B910763D7D) == 0x000018, "Member 'FFBattleStartParams::EngagementType_15_D00812C641AFF3AF663DC6B910763D7D' has a wrong offset!");
static_assert(offsetof(FFBattleStartParams, BattleMapBP_18_E90DB870407FE894CA7200B075D98B4A) == 0x000020, "Member 'FFBattleStartParams::BattleMapBP_18_E90DB870407FE894CA7200B075D98B4A' has a wrong offset!");
static_assert(offsetof(FFBattleStartParams, BattleMapBPSoft_41_9D55F2484E1768C57CF31794DEDE717F) == 0x000028, "Member 'FFBattleStartParams::BattleMapBPSoft_41_9D55F2484E1768C57CF31794DEDE717F' has a wrong offset!");
static_assert(offsetof(FFBattleStartParams, BattleMapDataLayers_55_4664B50E490D09A9318C6E8B7DAE07BB) == 0x000050, "Member 'FFBattleStartParams::BattleMapDataLayers_55_4664B50E490D09A9318C6E8B7DAE07BB' has a wrong offset!");
static_assert(offsetof(FFBattleStartParams, TransitionType_31_74930912436832AA7F5A1C8F139A7E9A) == 0x000060, "Member 'FFBattleStartParams::TransitionType_31_74930912436832AA7F5A1C8F139A7E9A' has a wrong offset!");
static_assert(offsetof(FFBattleStartParams, PlayCameraIntro_21_FE94DAD74E9218AB0C1D48A3DC163272) == 0x000061, "Member 'FFBattleStartParams::PlayCameraIntro_21_FE94DAD74E9218AB0C1D48A3DC163272' has a wrong offset!");
static_assert(offsetof(FFBattleStartParams, ForceFleeImpossible_28_67F4412A4BF319F3EFFE8C8110E1CBC5) == 0x000062, "Member 'FFBattleStartParams::ForceFleeImpossible_28_67F4412A4BF319F3EFFE8C8110E1CBC5' has a wrong offset!");
static_assert(offsetof(FFBattleStartParams, MusicParameters_58_3EF84D0A4944D7C4EF7BFCB46E28D32F) == 0x000068, "Member 'FFBattleStartParams::MusicParameters_58_3EF84D0A4944D7C4EF7BFCB46E28D32F' has a wrong offset!");
static_assert(offsetof(FFBattleStartParams, AmbienceParameters_70_3266EC90459D6B4160BC0C8BA9F793EC) == 0x000098, "Member 'FFBattleStartParams::AmbienceParameters_70_3266EC90459D6B4160BC0C8BA9F793EC' has a wrong offset!");
static_assert(offsetof(FFBattleStartParams, GameActionPostBattleWrapper_45_A2233C9E408877A1A0FE07B484DD564D) == 0x0000A8, "Member 'FFBattleStartParams::GameActionPostBattleWrapper_45_A2233C9E408877A1A0FE07B484DD564D' has a wrong offset!");
static_assert(offsetof(FFBattleStartParams, GameActionPostBattle_35_61E2AECF4179AB60F99ABCB5EA5BB96F) == 0x0000B8, "Member 'FFBattleStartParams::GameActionPostBattle_35_61E2AECF4179AB60F99ABCB5EA5BB96F' has a wrong offset!");
static_assert(offsetof(FFBattleStartParams, BackToExplorationOnLost_38_6E7B04094D32F81767771FA52BAE96D1) == 0x0000C0, "Member 'FFBattleStartParams::BackToExplorationOnLost_38_6E7B04094D32F81767771FA52BAE96D1' has a wrong offset!");
static_assert(offsetof(FFBattleStartParams, EncounterLevelOffset_53_1CBE091C40F1DC0A4C5A0EAC44E28B8E) == 0x0000C4, "Member 'FFBattleStartParams::EncounterLevelOffset_53_1CBE091C40F1DC0A4C5A0EAC44E28B8E' has a wrong offset!");
static_assert(offsetof(FFBattleStartParams, OverrideParty_63_56C3E35647CCE3DAC58BE292F8A3FFC0) == 0x0000C8, "Member 'FFBattleStartParams::OverrideParty_63_56C3E35647CCE3DAC58BE292F8A3FFC0' has a wrong offset!");
static_assert(offsetof(FFBattleStartParams, AllowReserveTeam_67_D9994E8845C61EC655889197EAE92383) == 0x0000D8, "Member 'FFBattleStartParams::AllowReserveTeam_67_D9994E8845C61EC655889197EAE92383' has a wrong offset!");
static_assert(offsetof(FFBattleStartParams, PostBattleGameFlowTransitionRequest_73_C8BDFC0E4427AB7B19B5CC9366CE349E) == 0x0000E0, "Member 'FFBattleStartParams::PostBattleGameFlowTransitionRequest_73_C8BDFC0E4427AB7B19B5CC9366CE349E' has a wrong offset!");
static_assert(offsetof(FFBattleStartParams, BattleRewardParameters_76_45FD14DB462B63342F7B6189548E447A) == 0x0000F0, "Member 'FFBattleStartParams::BattleRewardParameters_76_45FD14DB462B63342F7B6189548E447A' has a wrong offset!");

}

