#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FCharacterBattleAudioProfile

#include "Basic.hpp"

#include "FSoundEvent_structs.hpp"
#include "FPerCharacterReaction_structs.hpp"


namespace SDK
{

// UserDefinedStruct FCharacterBattleAudioProfile.FCharacterBattleAudioProfile
// 0x00D0 (0x00D0 - 0x0000)
struct FFCharacterBattleAudioProfile final
{
public:
	struct FFSoundEvent                           TurnStart_8_F4222A544F35ADE1444E8889333477B8;      // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	struct FFSoundEvent                           TurnStart_LowLife_33_B308E8AD40F8C62BAE1C1D885114FD1B; // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	struct FFSoundEvent                           Menu_OpenSkills_56_EF7411774C549F14BC4A6A94A8F17CD2; // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	struct FFSoundEvent                           Menu_OutOfAP_57_D4A6A2E140622DF0C821F4B32EA276CF;  // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	struct FFSoundEvent                           Menu_OutOfConsummables_59_81E33951426D15510A6590B857040C70; // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	struct FFSoundEvent                           FreeAim_Start_10_67F1F1464CB950E7CC9904B9D4F80CA0; // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	struct FFSoundEvent                           Attack_Regular_2_205DA6324107A6C73B1CDCB4C4F613D1; // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	struct FFSoundEvent                           HitEnemy_Weakpoint_35_D30A9B16448CA75B1DC36BB4CA4CAE8E; // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	struct FFSoundEvent                           BuffingOther_38_9106CDA64A8FC1BD31308F8AB78D23CD;  // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	struct FFSoundEvent                           BuffReceived_62_AA44586F4F0E3A2A376AD5BC55507836;  // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	struct FFSoundEvent                           IsRevived_42_ABA76DF845689CFC38A049A6D9C4E47C;     // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	struct FFSoundEvent                           RevivingOther_18_F0C3285649CCC62FA6F0638DD96C4BBC; // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	struct FFSoundEvent                           DamageReceived_44_15FCD5734A86BFB1753F18B9050D6952; // 0x0060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	struct FFSoundEvent                           DamageReceived_Lethal_46_7844F5864F29DEDD468AA08AEC6E3085; // 0x0068(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	struct FFSoundEvent                           OtherWasAttacked_29_5D8FD5444AE13DB928E630B4173DBCBD; // 0x0070(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	struct FFSoundEvent                           BattleEnd_4_312C230D44BB11C96021EAAEE2687F96;      // 0x0078(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	struct FFSoundEvent                           QTE_Fail_47_6DEE43A94E12D4A1282194B396107672;      // 0x0080(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	struct FFSoundEvent                           InflictedZeroDamage_48_ED101AE64F8FE60D24D0EB834C707EDE; // 0x0088(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	struct FFPerCharacterReaction                 React_Death_28_A7C920114C667C8A048138987499830D;   // 0x0090(0x0028)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	struct FFSoundEvent                           React_WarnIncomingAttack_50_365AA7CE4F7F21AABD0828A34CA9E94E; // 0x00B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	struct FFSoundEvent                           React_WarnIncomingAttackStrong_52_74C0A3C54063517FEAB34B88E8CBA6A9; // 0x00C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	struct FFSoundEvent                           Merde_54_F2C6C4A74730BBAFB38D5580A73CBA60;         // 0x00C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};
static_assert(alignof(FFCharacterBattleAudioProfile) == 0x000008, "Wrong alignment on FFCharacterBattleAudioProfile");
static_assert(sizeof(FFCharacterBattleAudioProfile) == 0x0000D0, "Wrong size on FFCharacterBattleAudioProfile");
static_assert(offsetof(FFCharacterBattleAudioProfile, TurnStart_8_F4222A544F35ADE1444E8889333477B8) == 0x000000, "Member 'FFCharacterBattleAudioProfile::TurnStart_8_F4222A544F35ADE1444E8889333477B8' has a wrong offset!");
static_assert(offsetof(FFCharacterBattleAudioProfile, TurnStart_LowLife_33_B308E8AD40F8C62BAE1C1D885114FD1B) == 0x000008, "Member 'FFCharacterBattleAudioProfile::TurnStart_LowLife_33_B308E8AD40F8C62BAE1C1D885114FD1B' has a wrong offset!");
static_assert(offsetof(FFCharacterBattleAudioProfile, Menu_OpenSkills_56_EF7411774C549F14BC4A6A94A8F17CD2) == 0x000010, "Member 'FFCharacterBattleAudioProfile::Menu_OpenSkills_56_EF7411774C549F14BC4A6A94A8F17CD2' has a wrong offset!");
static_assert(offsetof(FFCharacterBattleAudioProfile, Menu_OutOfAP_57_D4A6A2E140622DF0C821F4B32EA276CF) == 0x000018, "Member 'FFCharacterBattleAudioProfile::Menu_OutOfAP_57_D4A6A2E140622DF0C821F4B32EA276CF' has a wrong offset!");
static_assert(offsetof(FFCharacterBattleAudioProfile, Menu_OutOfConsummables_59_81E33951426D15510A6590B857040C70) == 0x000020, "Member 'FFCharacterBattleAudioProfile::Menu_OutOfConsummables_59_81E33951426D15510A6590B857040C70' has a wrong offset!");
static_assert(offsetof(FFCharacterBattleAudioProfile, FreeAim_Start_10_67F1F1464CB950E7CC9904B9D4F80CA0) == 0x000028, "Member 'FFCharacterBattleAudioProfile::FreeAim_Start_10_67F1F1464CB950E7CC9904B9D4F80CA0' has a wrong offset!");
static_assert(offsetof(FFCharacterBattleAudioProfile, Attack_Regular_2_205DA6324107A6C73B1CDCB4C4F613D1) == 0x000030, "Member 'FFCharacterBattleAudioProfile::Attack_Regular_2_205DA6324107A6C73B1CDCB4C4F613D1' has a wrong offset!");
static_assert(offsetof(FFCharacterBattleAudioProfile, HitEnemy_Weakpoint_35_D30A9B16448CA75B1DC36BB4CA4CAE8E) == 0x000038, "Member 'FFCharacterBattleAudioProfile::HitEnemy_Weakpoint_35_D30A9B16448CA75B1DC36BB4CA4CAE8E' has a wrong offset!");
static_assert(offsetof(FFCharacterBattleAudioProfile, BuffingOther_38_9106CDA64A8FC1BD31308F8AB78D23CD) == 0x000040, "Member 'FFCharacterBattleAudioProfile::BuffingOther_38_9106CDA64A8FC1BD31308F8AB78D23CD' has a wrong offset!");
static_assert(offsetof(FFCharacterBattleAudioProfile, BuffReceived_62_AA44586F4F0E3A2A376AD5BC55507836) == 0x000048, "Member 'FFCharacterBattleAudioProfile::BuffReceived_62_AA44586F4F0E3A2A376AD5BC55507836' has a wrong offset!");
static_assert(offsetof(FFCharacterBattleAudioProfile, IsRevived_42_ABA76DF845689CFC38A049A6D9C4E47C) == 0x000050, "Member 'FFCharacterBattleAudioProfile::IsRevived_42_ABA76DF845689CFC38A049A6D9C4E47C' has a wrong offset!");
static_assert(offsetof(FFCharacterBattleAudioProfile, RevivingOther_18_F0C3285649CCC62FA6F0638DD96C4BBC) == 0x000058, "Member 'FFCharacterBattleAudioProfile::RevivingOther_18_F0C3285649CCC62FA6F0638DD96C4BBC' has a wrong offset!");
static_assert(offsetof(FFCharacterBattleAudioProfile, DamageReceived_44_15FCD5734A86BFB1753F18B9050D6952) == 0x000060, "Member 'FFCharacterBattleAudioProfile::DamageReceived_44_15FCD5734A86BFB1753F18B9050D6952' has a wrong offset!");
static_assert(offsetof(FFCharacterBattleAudioProfile, DamageReceived_Lethal_46_7844F5864F29DEDD468AA08AEC6E3085) == 0x000068, "Member 'FFCharacterBattleAudioProfile::DamageReceived_Lethal_46_7844F5864F29DEDD468AA08AEC6E3085' has a wrong offset!");
static_assert(offsetof(FFCharacterBattleAudioProfile, OtherWasAttacked_29_5D8FD5444AE13DB928E630B4173DBCBD) == 0x000070, "Member 'FFCharacterBattleAudioProfile::OtherWasAttacked_29_5D8FD5444AE13DB928E630B4173DBCBD' has a wrong offset!");
static_assert(offsetof(FFCharacterBattleAudioProfile, BattleEnd_4_312C230D44BB11C96021EAAEE2687F96) == 0x000078, "Member 'FFCharacterBattleAudioProfile::BattleEnd_4_312C230D44BB11C96021EAAEE2687F96' has a wrong offset!");
static_assert(offsetof(FFCharacterBattleAudioProfile, QTE_Fail_47_6DEE43A94E12D4A1282194B396107672) == 0x000080, "Member 'FFCharacterBattleAudioProfile::QTE_Fail_47_6DEE43A94E12D4A1282194B396107672' has a wrong offset!");
static_assert(offsetof(FFCharacterBattleAudioProfile, InflictedZeroDamage_48_ED101AE64F8FE60D24D0EB834C707EDE) == 0x000088, "Member 'FFCharacterBattleAudioProfile::InflictedZeroDamage_48_ED101AE64F8FE60D24D0EB834C707EDE' has a wrong offset!");
static_assert(offsetof(FFCharacterBattleAudioProfile, React_Death_28_A7C920114C667C8A048138987499830D) == 0x000090, "Member 'FFCharacterBattleAudioProfile::React_Death_28_A7C920114C667C8A048138987499830D' has a wrong offset!");
static_assert(offsetof(FFCharacterBattleAudioProfile, React_WarnIncomingAttack_50_365AA7CE4F7F21AABD0828A34CA9E94E) == 0x0000B8, "Member 'FFCharacterBattleAudioProfile::React_WarnIncomingAttack_50_365AA7CE4F7F21AABD0828A34CA9E94E' has a wrong offset!");
static_assert(offsetof(FFCharacterBattleAudioProfile, React_WarnIncomingAttackStrong_52_74C0A3C54063517FEAB34B88E8CBA6A9) == 0x0000C0, "Member 'FFCharacterBattleAudioProfile::React_WarnIncomingAttackStrong_52_74C0A3C54063517FEAB34B88E8CBA6A9' has a wrong offset!");
static_assert(offsetof(FFCharacterBattleAudioProfile, Merde_54_F2C6C4A74730BBAFB38D5580A73CBA60) == 0x0000C8, "Member 'FFCharacterBattleAudioProfile::Merde_54_F2C6C4A74730BBAFB38D5580A73CBA60' has a wrong offset!");

}

