#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FCharacterStats

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct FCharacterStats.FCharacterStats
// 0x0030 (0x0030 - 0x0000)
struct FFCharacterStats final
{
public:
	double                                        BurnPercentage_2_81C46C094AB7C304452A6EB37773772B; // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        RegularDamageReductionMultiplier_8_8348AF974D9921C9268E93BE0284158D; // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        FreeAimDamageReductionMultiplier_9_248A0A824FA29346CE7A40A79099329B; // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         DEPRECATED_ShieldAmountAtSpawn_16_7EBF40CB4BBE8A5FF6C53EAED2230FD1; // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ShieldPointsAtSpawn_17_7C33A6DB40E55DF7A672D2BAA5CFCE14; // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ReceivedSkillDamageMultiplier_21_13627A1741A465D26AE518BA8D3FA731; // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ReceivedFreeAimDamageMultiplier_23_FCCDD66342086D44FF9197AA36895E0E; // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FFCharacterStats) == 0x000008, "Wrong alignment on FFCharacterStats");
static_assert(sizeof(FFCharacterStats) == 0x000030, "Wrong size on FFCharacterStats");
static_assert(offsetof(FFCharacterStats, BurnPercentage_2_81C46C094AB7C304452A6EB37773772B) == 0x000000, "Member 'FFCharacterStats::BurnPercentage_2_81C46C094AB7C304452A6EB37773772B' has a wrong offset!");
static_assert(offsetof(FFCharacterStats, RegularDamageReductionMultiplier_8_8348AF974D9921C9268E93BE0284158D) == 0x000008, "Member 'FFCharacterStats::RegularDamageReductionMultiplier_8_8348AF974D9921C9268E93BE0284158D' has a wrong offset!");
static_assert(offsetof(FFCharacterStats, FreeAimDamageReductionMultiplier_9_248A0A824FA29346CE7A40A79099329B) == 0x000010, "Member 'FFCharacterStats::FreeAimDamageReductionMultiplier_9_248A0A824FA29346CE7A40A79099329B' has a wrong offset!");
static_assert(offsetof(FFCharacterStats, DEPRECATED_ShieldAmountAtSpawn_16_7EBF40CB4BBE8A5FF6C53EAED2230FD1) == 0x000018, "Member 'FFCharacterStats::DEPRECATED_ShieldAmountAtSpawn_16_7EBF40CB4BBE8A5FF6C53EAED2230FD1' has a wrong offset!");
static_assert(offsetof(FFCharacterStats, ShieldPointsAtSpawn_17_7C33A6DB40E55DF7A672D2BAA5CFCE14) == 0x00001C, "Member 'FFCharacterStats::ShieldPointsAtSpawn_17_7C33A6DB40E55DF7A672D2BAA5CFCE14' has a wrong offset!");
static_assert(offsetof(FFCharacterStats, ReceivedSkillDamageMultiplier_21_13627A1741A465D26AE518BA8D3FA731) == 0x000020, "Member 'FFCharacterStats::ReceivedSkillDamageMultiplier_21_13627A1741A465D26AE518BA8D3FA731' has a wrong offset!");
static_assert(offsetof(FFCharacterStats, ReceivedFreeAimDamageMultiplier_23_FCCDD66342086D44FF9197AA36895E0E) == 0x000028, "Member 'FFCharacterStats::ReceivedFreeAimDamageMultiplier_23_FCCDD66342086D44FF9197AA36895E0E' has a wrong offset!");

}

