#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FCreditsParagraph

#include "Basic.hpp"

#include "ECreditsPositioning_structs.hpp"


namespace SDK
{

// UserDefinedStruct FCreditsParagraph.FCreditsParagraph
// 0x0030 (0x0030 - 0x0000)
struct FFCreditsParagraph final
{
public:
	class FText                                   Title_2_DB1CD6494755ABFA14CB51B0C350F7E9;          // 0x0000(0x0010)(Edit, BlueprintVisible)
	TArray<class FText>                           Names_5_5EE1642644E231B1AFB5C0B0105A7B00;          // 0x0010(0x0010)(Edit, BlueprintVisible)
	double                                        Duration_9_37760E2D47923A0E0D1FFA905BDB404A;       // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECreditsPositioning                           Positioning_16_343FABCA4CC8A7D05163A68460BCAB03;   // 0x0028(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FFCreditsParagraph) == 0x000008, "Wrong alignment on FFCreditsParagraph");
static_assert(sizeof(FFCreditsParagraph) == 0x000030, "Wrong size on FFCreditsParagraph");
static_assert(offsetof(FFCreditsParagraph, Title_2_DB1CD6494755ABFA14CB51B0C350F7E9) == 0x000000, "Member 'FFCreditsParagraph::Title_2_DB1CD6494755ABFA14CB51B0C350F7E9' has a wrong offset!");
static_assert(offsetof(FFCreditsParagraph, Names_5_5EE1642644E231B1AFB5C0B0105A7B00) == 0x000010, "Member 'FFCreditsParagraph::Names_5_5EE1642644E231B1AFB5C0B0105A7B00' has a wrong offset!");
static_assert(offsetof(FFCreditsParagraph, Duration_9_37760E2D47923A0E0D1FFA905BDB404A) == 0x000020, "Member 'FFCreditsParagraph::Duration_9_37760E2D47923A0E0D1FFA905BDB404A' has a wrong offset!");
static_assert(offsetof(FFCreditsParagraph, Positioning_16_343FABCA4CC8A7D05163A68460BCAB03) == 0x000028, "Member 'FFCreditsParagraph::Positioning_16_343FABCA4CC8A7D05163A68460BCAB03' has a wrong offset!");

}

