#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FEnemyBattleAudioProfile

#include "Basic.hpp"

#include "FSoundEvent_structs.hpp"


namespace SDK
{

// UserDefinedStruct FEnemyBattleAudioProfile.FEnemyBattleAudioProfile
// 0x0020 (0x0020 - 0x0000)
struct FFEnemyBattleAudioProfile final
{
public:
	struct FFSoundEvent                           DamageReceivedLight_3_ACC0A8B34658DFAA71C285BA78E5A48A; // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	struct FFSoundEvent                           DamageReceivedMedium_5_6024CBBC46DEDE7C5302AE84232398BA; // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	struct FFSoundEvent                           DamageReceivedHeavy_7_9A66595245B16E5487DB4E894FF445FB; // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	struct FFSoundEvent                           Death_9_7197439D4D846C79114318AF515C7AF7;          // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};
static_assert(alignof(FFEnemyBattleAudioProfile) == 0x000008, "Wrong alignment on FFEnemyBattleAudioProfile");
static_assert(sizeof(FFEnemyBattleAudioProfile) == 0x000020, "Wrong size on FFEnemyBattleAudioProfile");
static_assert(offsetof(FFEnemyBattleAudioProfile, DamageReceivedLight_3_ACC0A8B34658DFAA71C285BA78E5A48A) == 0x000000, "Member 'FFEnemyBattleAudioProfile::DamageReceivedLight_3_ACC0A8B34658DFAA71C285BA78E5A48A' has a wrong offset!");
static_assert(offsetof(FFEnemyBattleAudioProfile, DamageReceivedMedium_5_6024CBBC46DEDE7C5302AE84232398BA) == 0x000008, "Member 'FFEnemyBattleAudioProfile::DamageReceivedMedium_5_6024CBBC46DEDE7C5302AE84232398BA' has a wrong offset!");
static_assert(offsetof(FFEnemyBattleAudioProfile, DamageReceivedHeavy_7_9A66595245B16E5487DB4E894FF445FB) == 0x000010, "Member 'FFEnemyBattleAudioProfile::DamageReceivedHeavy_7_9A66595245B16E5487DB4E894FF445FB' has a wrong offset!");
static_assert(offsetof(FFEnemyBattleAudioProfile, Death_9_7197439D4D846C79114318AF515C7AF7) == 0x000018, "Member 'FFEnemyBattleAudioProfile::Death_9_7197439D4D846C79114318AF515C7AF7' has a wrong offset!");

}

