#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FExplorationProgression_SaveState

#include "Basic.hpp"

#include "E_ExplorationCapacity_structs.hpp"
#include "E_WorldMapExplorationCapacity_structs.hpp"


namespace SDK
{

// UserDefinedStruct FExplorationProgression_SaveState.FExplorationProgression_SaveState
// 0x0028 (0x0028 - 0x0000)
struct FFExplorationProgression_SaveState final
{
public:
	TArray<E_ExplorationCapacity>                 ExplorationCapacities_22_D278AAE341C821F118686B81FD83BBB0; // 0x0000(0x0010)(Edit, BlueprintVisible)
	int32                                         FreeAimDamageLevel_4_CE1A4941408FA32FC2731D9BF52F53EC; // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<E_WorldMapExplorationCapacity>         WorldMapCapacities_18_A3C2B46042CDC1AD2B027BB41415D062; // 0x0018(0x0010)(Edit, BlueprintVisible)
};
static_assert(alignof(FFExplorationProgression_SaveState) == 0x000008, "Wrong alignment on FFExplorationProgression_SaveState");
static_assert(sizeof(FFExplorationProgression_SaveState) == 0x000028, "Wrong size on FFExplorationProgression_SaveState");
static_assert(offsetof(FFExplorationProgression_SaveState, ExplorationCapacities_22_D278AAE341C821F118686B81FD83BBB0) == 0x000000, "Member 'FFExplorationProgression_SaveState::ExplorationCapacities_22_D278AAE341C821F118686B81FD83BBB0' has a wrong offset!");
static_assert(offsetof(FFExplorationProgression_SaveState, FreeAimDamageLevel_4_CE1A4941408FA32FC2731D9BF52F53EC) == 0x000010, "Member 'FFExplorationProgression_SaveState::FreeAimDamageLevel_4_CE1A4941408FA32FC2731D9BF52F53EC' has a wrong offset!");
static_assert(offsetof(FFExplorationProgression_SaveState, WorldMapCapacities_18_A3C2B46042CDC1AD2B027BB41415D062) == 0x000018, "Member 'FFExplorationProgression_SaveState::WorldMapCapacities_18_A3C2B46042CDC1AD2B027BB41415D062' has a wrong offset!");

}

