#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FGlobalFeedback

#include "Basic.hpp"

#include "FSoundEvent_structs.hpp"


namespace SDK
{

// UserDefinedStruct FGlobalFeedback.FGlobalFeedback
// 0x0018 (0x0018 - 0x0000)
struct FFGlobalFeedback final
{
public:
	class UClass*                                 CameraModifier_15_58273FFD43FDE93F8CB083B2D616877C; // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CameraShake_19_41721901446FAB7F5E5CF5899808CD3A;   // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFSoundEvent                           SoundEvent_24_19469444467C30AF1E0046B0989BED90;    // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};
static_assert(alignof(FFGlobalFeedback) == 0x000008, "Wrong alignment on FFGlobalFeedback");
static_assert(sizeof(FFGlobalFeedback) == 0x000018, "Wrong size on FFGlobalFeedback");
static_assert(offsetof(FFGlobalFeedback, CameraModifier_15_58273FFD43FDE93F8CB083B2D616877C) == 0x000000, "Member 'FFGlobalFeedback::CameraModifier_15_58273FFD43FDE93F8CB083B2D616877C' has a wrong offset!");
static_assert(offsetof(FFGlobalFeedback, CameraShake_19_41721901446FAB7F5E5CF5899808CD3A) == 0x000008, "Member 'FFGlobalFeedback::CameraShake_19_41721901446FAB7F5E5CF5899808CD3A' has a wrong offset!");
static_assert(offsetof(FFGlobalFeedback, SoundEvent_24_19469444467C30AF1E0046B0989BED90) == 0x000010, "Member 'FFGlobalFeedback::SoundEvent_24_19469444467C30AF1E0046B0989BED90' has a wrong offset!");

}

