#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FInWorldDialogue_CharacterProfile

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct FInWorldDialogue_CharacterProfile.FInWorldDialogue_CharacterProfile
// 0x0030 (0x0030 - 0x0000)
struct FFInWorldDialogue_CharacterProfile final
{
public:
	class UTexture*                               Portrait_Neutral_2_6FAF1DAB40A3054E95982395AD8D3762; // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               Portrait_Happy_8_4865AB7A48C80D0B71FDB5B5ED2FDA63; // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               Portrait_Angry_9_63A326624F7DF9BADB7DD1A4C8A4F1E6; // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               Portrait_Sad_10_7E33574C4F3B450D977BB3900C8213D9;  // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               Portrait_Surprised_11_72033A8A49E9EDE1573A40AC31154059; // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               Portrait_Damaged_13_190FAA9647D9139EF364A19E33B62BD9; // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FFInWorldDialogue_CharacterProfile) == 0x000008, "Wrong alignment on FFInWorldDialogue_CharacterProfile");
static_assert(sizeof(FFInWorldDialogue_CharacterProfile) == 0x000030, "Wrong size on FFInWorldDialogue_CharacterProfile");
static_assert(offsetof(FFInWorldDialogue_CharacterProfile, Portrait_Neutral_2_6FAF1DAB40A3054E95982395AD8D3762) == 0x000000, "Member 'FFInWorldDialogue_CharacterProfile::Portrait_Neutral_2_6FAF1DAB40A3054E95982395AD8D3762' has a wrong offset!");
static_assert(offsetof(FFInWorldDialogue_CharacterProfile, Portrait_Happy_8_4865AB7A48C80D0B71FDB5B5ED2FDA63) == 0x000008, "Member 'FFInWorldDialogue_CharacterProfile::Portrait_Happy_8_4865AB7A48C80D0B71FDB5B5ED2FDA63' has a wrong offset!");
static_assert(offsetof(FFInWorldDialogue_CharacterProfile, Portrait_Angry_9_63A326624F7DF9BADB7DD1A4C8A4F1E6) == 0x000010, "Member 'FFInWorldDialogue_CharacterProfile::Portrait_Angry_9_63A326624F7DF9BADB7DD1A4C8A4F1E6' has a wrong offset!");
static_assert(offsetof(FFInWorldDialogue_CharacterProfile, Portrait_Sad_10_7E33574C4F3B450D977BB3900C8213D9) == 0x000018, "Member 'FFInWorldDialogue_CharacterProfile::Portrait_Sad_10_7E33574C4F3B450D977BB3900C8213D9' has a wrong offset!");
static_assert(offsetof(FFInWorldDialogue_CharacterProfile, Portrait_Surprised_11_72033A8A49E9EDE1573A40AC31154059) == 0x000020, "Member 'FFInWorldDialogue_CharacterProfile::Portrait_Surprised_11_72033A8A49E9EDE1573A40AC31154059' has a wrong offset!");
static_assert(offsetof(FFInWorldDialogue_CharacterProfile, Portrait_Damaged_13_190FAA9647D9139EF364A19E33B62BD9) == 0x000028, "Member 'FFInWorldDialogue_CharacterProfile::Portrait_Damaged_13_190FAA9647D9139EF364A19E33B62BD9' has a wrong offset!");

}

