#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FKeyVisualInfo

#include "Basic.hpp"

#include "InputCore_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// UserDefinedStruct FKeyVisualInfo.FKeyVisualInfo
// 0x0030 (0x0030 - 0x0000)
struct FFKeyVisualInfo final
{
public:
	struct FKey                                   PlatformKey_12_8C963D1849814464CA1BDAAE318E1CCE;   // 0x0000(0x0018)(Edit, BlueprintVisible, HasGetValueTypeHash)
	class UTexture2D*                             ButtonTexture_5_DD906833408A2CE57C1A1A86B74D5E6D;  // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FDataTableRowHandle                    PlatformIconTagID_9_474E593543F1C785AD4A19A0F0447ACF; // 0x0020(0x0010)(Edit, BlueprintVisible, NoDestructor)
};
static_assert(alignof(FFKeyVisualInfo) == 0x000008, "Wrong alignment on FFKeyVisualInfo");
static_assert(sizeof(FFKeyVisualInfo) == 0x000030, "Wrong size on FFKeyVisualInfo");
static_assert(offsetof(FFKeyVisualInfo, PlatformKey_12_8C963D1849814464CA1BDAAE318E1CCE) == 0x000000, "Member 'FFKeyVisualInfo::PlatformKey_12_8C963D1849814464CA1BDAAE318E1CCE' has a wrong offset!");
static_assert(offsetof(FFKeyVisualInfo, ButtonTexture_5_DD906833408A2CE57C1A1A86B74D5E6D) == 0x000018, "Member 'FFKeyVisualInfo::ButtonTexture_5_DD906833408A2CE57C1A1A86B74D5E6D' has a wrong offset!");
static_assert(offsetof(FFKeyVisualInfo, PlatformIconTagID_9_474E593543F1C785AD4A19A0F0447ACF) == 0x000020, "Member 'FFKeyVisualInfo::PlatformIconTagID_9_474E593543F1C785AD4A19A0F0447ACF' has a wrong offset!");

}

