#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FL_BP_EntitlementHelpers

#include "Basic.hpp"


namespace SDK::Params
{

// Function FL_BP_EntitlementHelpers.FL_BP_EntitlementHelpers_C.GetEntitlementManager
// 0x0018 (0x0018 - 0x0000)
struct FL_BP_EntitlementHelpers_C_GetEntitlementManager final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_EntitlementManager_C*               ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash)
	class UBP_jRPG_GI_Custom_C*                   CallFunc_GetCustomGI_ReturnValue;                  // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FL_BP_EntitlementHelpers_C_GetEntitlementManager) == 0x000008, "Wrong alignment on FL_BP_EntitlementHelpers_C_GetEntitlementManager");
static_assert(sizeof(FL_BP_EntitlementHelpers_C_GetEntitlementManager) == 0x000018, "Wrong size on FL_BP_EntitlementHelpers_C_GetEntitlementManager");
static_assert(offsetof(FL_BP_EntitlementHelpers_C_GetEntitlementManager, __WorldContext) == 0x000000, "Member 'FL_BP_EntitlementHelpers_C_GetEntitlementManager::__WorldContext' has a wrong offset!");
static_assert(offsetof(FL_BP_EntitlementHelpers_C_GetEntitlementManager, ReturnValue) == 0x000008, "Member 'FL_BP_EntitlementHelpers_C_GetEntitlementManager::ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_BP_EntitlementHelpers_C_GetEntitlementManager, CallFunc_GetCustomGI_ReturnValue) == 0x000010, "Member 'FL_BP_EntitlementHelpers_C_GetEntitlementManager::CallFunc_GetCustomGI_ReturnValue' has a wrong offset!");

}

