#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FL_Debug_UMGDebuggerHelper

#include "Basic.hpp"


namespace SDK::Params
{

// Function FL_Debug_UMGDebuggerHelper.FL_Debug_UMGDebuggerHelper_C.DEBUG_GetUMGDebugger
// 0x0028 (0x0028 - 0x0000)
struct FL_Debug_UMGDebuggerHelper_C_DEBUG_GetUMGDebugger final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_Debug_UMG_AnimationDebugger_C*     ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ABP_Debug_UMGDebugger_C*                CallFunc_GetActorOfClass_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_Debug_UMG_AnimationDebugger_C*     CallFunc_GetUMGDebuggerInstance_UMGDebuggerInstance; // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FL_Debug_UMGDebuggerHelper_C_DEBUG_GetUMGDebugger) == 0x000008, "Wrong alignment on FL_Debug_UMGDebuggerHelper_C_DEBUG_GetUMGDebugger");
static_assert(sizeof(FL_Debug_UMGDebuggerHelper_C_DEBUG_GetUMGDebugger) == 0x000028, "Wrong size on FL_Debug_UMGDebuggerHelper_C_DEBUG_GetUMGDebugger");
static_assert(offsetof(FL_Debug_UMGDebuggerHelper_C_DEBUG_GetUMGDebugger, __WorldContext) == 0x000000, "Member 'FL_Debug_UMGDebuggerHelper_C_DEBUG_GetUMGDebugger::__WorldContext' has a wrong offset!");
static_assert(offsetof(FL_Debug_UMGDebuggerHelper_C_DEBUG_GetUMGDebugger, ReturnValue) == 0x000008, "Member 'FL_Debug_UMGDebuggerHelper_C_DEBUG_GetUMGDebugger::ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_Debug_UMGDebuggerHelper_C_DEBUG_GetUMGDebugger, CallFunc_GetActorOfClass_ReturnValue) == 0x000010, "Member 'FL_Debug_UMGDebuggerHelper_C_DEBUG_GetUMGDebugger::CallFunc_GetActorOfClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_Debug_UMGDebuggerHelper_C_DEBUG_GetUMGDebugger, CallFunc_GetUMGDebuggerInstance_UMGDebuggerInstance) == 0x000018, "Member 'FL_Debug_UMGDebuggerHelper_C_DEBUG_GetUMGDebugger::CallFunc_GetUMGDebuggerInstance_UMGDebuggerInstance' has a wrong offset!");
static_assert(offsetof(FL_Debug_UMGDebuggerHelper_C_DEBUG_GetUMGDebugger, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'FL_Debug_UMGDebuggerHelper_C_DEBUG_GetUMGDebugger::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

