#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FL_EnemyScalingHelpers

#include "Basic.hpp"

#include "S_EnemyScalingMultipliers_structs.hpp"
#include "S_EnemyScalingDataLevel_structs.hpp"
#include "Engine_structs.hpp"
#include "E_jRPG_StatType_structs.hpp"
#include "FLevelDataEntry_structs.hpp"
#include "S_NewGamePlusParameters_structs.hpp"
#include "S_jRPG_Encounter_structs.hpp"


namespace SDK::Params
{

// Function FL_EnemyScalingHelpers.FL_EnemyScalingHelpers_C.FindArchetypeEncounterLevelRow
// 0x0180 (0x0180 - 0x0000)
struct FL_EnemyScalingHelpers_C_FindArchetypeEncounterLevelRow final
{
public:
	class UDataTable*                             ArchetypeDT;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         EncounterLevel;                                    // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FS_EnemyScalingDataLevel               ScalingDataLevel;                                  // 0x0018(0x0038)(Parm, OutParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0068(0x0048)(HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x00B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_ObjectToText_ReturnValue;            // 0x00C0(0x0010)()
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00D8(0x0048)(HasGetValueTypeHash)
	struct FS_EnemyScalingDataLevel               CallFunc_GetDataTableRowFromName_OutRow;           // 0x0120(0x0038)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0160(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Format_ReturnValue;                       // 0x0170(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(FL_EnemyScalingHelpers_C_FindArchetypeEncounterLevelRow) == 0x000008, "Wrong alignment on FL_EnemyScalingHelpers_C_FindArchetypeEncounterLevelRow");
static_assert(sizeof(FL_EnemyScalingHelpers_C_FindArchetypeEncounterLevelRow) == 0x000180, "Wrong size on FL_EnemyScalingHelpers_C_FindArchetypeEncounterLevelRow");
static_assert(offsetof(FL_EnemyScalingHelpers_C_FindArchetypeEncounterLevelRow, ArchetypeDT) == 0x000000, "Member 'FL_EnemyScalingHelpers_C_FindArchetypeEncounterLevelRow::ArchetypeDT' has a wrong offset!");
static_assert(offsetof(FL_EnemyScalingHelpers_C_FindArchetypeEncounterLevelRow, EncounterLevel) == 0x000008, "Member 'FL_EnemyScalingHelpers_C_FindArchetypeEncounterLevelRow::EncounterLevel' has a wrong offset!");
static_assert(offsetof(FL_EnemyScalingHelpers_C_FindArchetypeEncounterLevelRow, __WorldContext) == 0x000010, "Member 'FL_EnemyScalingHelpers_C_FindArchetypeEncounterLevelRow::__WorldContext' has a wrong offset!");
static_assert(offsetof(FL_EnemyScalingHelpers_C_FindArchetypeEncounterLevelRow, ScalingDataLevel) == 0x000018, "Member 'FL_EnemyScalingHelpers_C_FindArchetypeEncounterLevelRow::ScalingDataLevel' has a wrong offset!");
static_assert(offsetof(FL_EnemyScalingHelpers_C_FindArchetypeEncounterLevelRow, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000050, "Member 'FL_EnemyScalingHelpers_C_FindArchetypeEncounterLevelRow::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_EnemyScalingHelpers_C_FindArchetypeEncounterLevelRow, CallFunc_Conv_IntToString_ReturnValue) == 0x000058, "Member 'FL_EnemyScalingHelpers_C_FindArchetypeEncounterLevelRow::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_EnemyScalingHelpers_C_FindArchetypeEncounterLevelRow, K2Node_MakeStruct_FormatArgumentData) == 0x000068, "Member 'FL_EnemyScalingHelpers_C_FindArchetypeEncounterLevelRow::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(FL_EnemyScalingHelpers_C_FindArchetypeEncounterLevelRow, CallFunc_Concat_StrStr_ReturnValue) == 0x0000B0, "Member 'FL_EnemyScalingHelpers_C_FindArchetypeEncounterLevelRow::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_EnemyScalingHelpers_C_FindArchetypeEncounterLevelRow, CallFunc_Conv_ObjectToText_ReturnValue) == 0x0000C0, "Member 'FL_EnemyScalingHelpers_C_FindArchetypeEncounterLevelRow::CallFunc_Conv_ObjectToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_EnemyScalingHelpers_C_FindArchetypeEncounterLevelRow, CallFunc_Conv_StringToName_ReturnValue) == 0x0000D0, "Member 'FL_EnemyScalingHelpers_C_FindArchetypeEncounterLevelRow::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_EnemyScalingHelpers_C_FindArchetypeEncounterLevelRow, K2Node_MakeStruct_FormatArgumentData_1) == 0x0000D8, "Member 'FL_EnemyScalingHelpers_C_FindArchetypeEncounterLevelRow::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(FL_EnemyScalingHelpers_C_FindArchetypeEncounterLevelRow, CallFunc_GetDataTableRowFromName_OutRow) == 0x000120, "Member 'FL_EnemyScalingHelpers_C_FindArchetypeEncounterLevelRow::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(FL_EnemyScalingHelpers_C_FindArchetypeEncounterLevelRow, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000158, "Member 'FL_EnemyScalingHelpers_C_FindArchetypeEncounterLevelRow::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_EnemyScalingHelpers_C_FindArchetypeEncounterLevelRow, K2Node_MakeArray_Array) == 0x000160, "Member 'FL_EnemyScalingHelpers_C_FindArchetypeEncounterLevelRow::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(FL_EnemyScalingHelpers_C_FindArchetypeEncounterLevelRow, CallFunc_Format_ReturnValue) == 0x000170, "Member 'FL_EnemyScalingHelpers_C_FindArchetypeEncounterLevelRow::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function FL_EnemyScalingHelpers.FL_EnemyScalingHelpers_C.ComputeCharacterStats
// 0x0290 (0x0290 - 0x0000)
struct FL_EnemyScalingHelpers_C_ComputeCharacterStats final
{
public:
	class UDataTable*                             ArchetypeDT;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         EncounterLevel;                                    // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_EnemyScalingMultipliers             StatMultipliers;                                   // 0x0010(0x0058)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0068(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TMap<E_jRPG_StatType, double>                 Stats;                                             // 0x0070(0x0050)(Parm, OutParm)
	int32                                         Chroma;                                            // 0x00C0(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Experience;                                        // 0x00C4(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_EnemyScalingDataLevel               CallFunc_FindArchetypeEncounterLevelRow_ScalingDataLevel; // 0x00C8(0x0038)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_1;           // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue;                        // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue_1;                      // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_2;           // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_3;           // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_3;      // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_4;      // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue_2;                      // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue_3;                      // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_4;           // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_5;           // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_5;      // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_6;           // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue_4;                      // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17C[0x4];                                      // 0x017C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_6;      // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_7;           // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue_5;                      // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_194[0x4];                                      // 0x0194(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_8;           // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_9;           // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_7;      // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_10;          // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue_6;                      // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1BC[0x4];                                      // 0x01BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_8;      // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_11;          // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue_7;                      // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D4[0x4];                                      // 0x01D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_12;          // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_13;          // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_9;      // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_14;          // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue_8;                      // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1FC[0x4];                                      // 0x01FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_10;     // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_15;          // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue_9;                      // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_214[0x4];                                      // 0x0214(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_16;          // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_17;          // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_11;     // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue_10;                     // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_234[0x4];                                      // 0x0234(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_18;          // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<E_jRPG_StatType, double>                 K2Node_MakeMap_Map;                                // 0x0240(0x0050)()
};
static_assert(alignof(FL_EnemyScalingHelpers_C_ComputeCharacterStats) == 0x000008, "Wrong alignment on FL_EnemyScalingHelpers_C_ComputeCharacterStats");
static_assert(sizeof(FL_EnemyScalingHelpers_C_ComputeCharacterStats) == 0x000290, "Wrong size on FL_EnemyScalingHelpers_C_ComputeCharacterStats");
static_assert(offsetof(FL_EnemyScalingHelpers_C_ComputeCharacterStats, ArchetypeDT) == 0x000000, "Member 'FL_EnemyScalingHelpers_C_ComputeCharacterStats::ArchetypeDT' has a wrong offset!");
static_assert(offsetof(FL_EnemyScalingHelpers_C_ComputeCharacterStats, EncounterLevel) == 0x000008, "Member 'FL_EnemyScalingHelpers_C_ComputeCharacterStats::EncounterLevel' has a wrong offset!");
static_assert(offsetof(FL_EnemyScalingHelpers_C_ComputeCharacterStats, StatMultipliers) == 0x000010, "Member 'FL_EnemyScalingHelpers_C_ComputeCharacterStats::StatMultipliers' has a wrong offset!");
static_assert(offsetof(FL_EnemyScalingHelpers_C_ComputeCharacterStats, __WorldContext) == 0x000068, "Member 'FL_EnemyScalingHelpers_C_ComputeCharacterStats::__WorldContext' has a wrong offset!");
static_assert(offsetof(FL_EnemyScalingHelpers_C_ComputeCharacterStats, Stats) == 0x000070, "Member 'FL_EnemyScalingHelpers_C_ComputeCharacterStats::Stats' has a wrong offset!");
static_assert(offsetof(FL_EnemyScalingHelpers_C_ComputeCharacterStats, Chroma) == 0x0000C0, "Member 'FL_EnemyScalingHelpers_C_ComputeCharacterStats::Chroma' has a wrong offset!");
static_assert(offsetof(FL_EnemyScalingHelpers_C_ComputeCharacterStats, Experience) == 0x0000C4, "Member 'FL_EnemyScalingHelpers_C_ComputeCharacterStats::Experience' has a wrong offset!");
static_assert(offsetof(FL_EnemyScalingHelpers_C_ComputeCharacterStats, CallFunc_FindArchetypeEncounterLevelRow_ScalingDataLevel) == 0x0000C8, "Member 'FL_EnemyScalingHelpers_C_ComputeCharacterStats::CallFunc_FindArchetypeEncounterLevelRow_ScalingDataLevel' has a wrong offset!");
static_assert(offsetof(FL_EnemyScalingHelpers_C_ComputeCharacterStats, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000100, "Member 'FL_EnemyScalingHelpers_C_ComputeCharacterStats::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_EnemyScalingHelpers_C_ComputeCharacterStats, CallFunc_Conv_IntToDouble_ReturnValue_1) == 0x000108, "Member 'FL_EnemyScalingHelpers_C_ComputeCharacterStats::CallFunc_Conv_IntToDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FL_EnemyScalingHelpers_C_ComputeCharacterStats, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000110, "Member 'FL_EnemyScalingHelpers_C_ComputeCharacterStats::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_EnemyScalingHelpers_C_ComputeCharacterStats, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000118, "Member 'FL_EnemyScalingHelpers_C_ComputeCharacterStats::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FL_EnemyScalingHelpers_C_ComputeCharacterStats, CallFunc_Round_ReturnValue) == 0x000120, "Member 'FL_EnemyScalingHelpers_C_ComputeCharacterStats::CallFunc_Round_ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_EnemyScalingHelpers_C_ComputeCharacterStats, CallFunc_Round_ReturnValue_1) == 0x000124, "Member 'FL_EnemyScalingHelpers_C_ComputeCharacterStats::CallFunc_Round_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FL_EnemyScalingHelpers_C_ComputeCharacterStats, CallFunc_Conv_IntToDouble_ReturnValue_2) == 0x000128, "Member 'FL_EnemyScalingHelpers_C_ComputeCharacterStats::CallFunc_Conv_IntToDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(FL_EnemyScalingHelpers_C_ComputeCharacterStats, CallFunc_Conv_IntToDouble_ReturnValue_3) == 0x000130, "Member 'FL_EnemyScalingHelpers_C_ComputeCharacterStats::CallFunc_Conv_IntToDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(FL_EnemyScalingHelpers_C_ComputeCharacterStats, CallFunc_Multiply_DoubleDouble_ReturnValue_2) == 0x000138, "Member 'FL_EnemyScalingHelpers_C_ComputeCharacterStats::CallFunc_Multiply_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(FL_EnemyScalingHelpers_C_ComputeCharacterStats, CallFunc_Multiply_DoubleDouble_ReturnValue_3) == 0x000140, "Member 'FL_EnemyScalingHelpers_C_ComputeCharacterStats::CallFunc_Multiply_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(FL_EnemyScalingHelpers_C_ComputeCharacterStats, CallFunc_Multiply_DoubleDouble_ReturnValue_4) == 0x000148, "Member 'FL_EnemyScalingHelpers_C_ComputeCharacterStats::CallFunc_Multiply_DoubleDouble_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(FL_EnemyScalingHelpers_C_ComputeCharacterStats, CallFunc_Round_ReturnValue_2) == 0x000150, "Member 'FL_EnemyScalingHelpers_C_ComputeCharacterStats::CallFunc_Round_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(FL_EnemyScalingHelpers_C_ComputeCharacterStats, CallFunc_Round_ReturnValue_3) == 0x000154, "Member 'FL_EnemyScalingHelpers_C_ComputeCharacterStats::CallFunc_Round_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(FL_EnemyScalingHelpers_C_ComputeCharacterStats, CallFunc_Conv_IntToDouble_ReturnValue_4) == 0x000158, "Member 'FL_EnemyScalingHelpers_C_ComputeCharacterStats::CallFunc_Conv_IntToDouble_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(FL_EnemyScalingHelpers_C_ComputeCharacterStats, CallFunc_Conv_IntToDouble_ReturnValue_5) == 0x000160, "Member 'FL_EnemyScalingHelpers_C_ComputeCharacterStats::CallFunc_Conv_IntToDouble_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(FL_EnemyScalingHelpers_C_ComputeCharacterStats, CallFunc_Multiply_DoubleDouble_ReturnValue_5) == 0x000168, "Member 'FL_EnemyScalingHelpers_C_ComputeCharacterStats::CallFunc_Multiply_DoubleDouble_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(FL_EnemyScalingHelpers_C_ComputeCharacterStats, CallFunc_Conv_IntToDouble_ReturnValue_6) == 0x000170, "Member 'FL_EnemyScalingHelpers_C_ComputeCharacterStats::CallFunc_Conv_IntToDouble_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(FL_EnemyScalingHelpers_C_ComputeCharacterStats, CallFunc_Round_ReturnValue_4) == 0x000178, "Member 'FL_EnemyScalingHelpers_C_ComputeCharacterStats::CallFunc_Round_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(FL_EnemyScalingHelpers_C_ComputeCharacterStats, CallFunc_Multiply_DoubleDouble_ReturnValue_6) == 0x000180, "Member 'FL_EnemyScalingHelpers_C_ComputeCharacterStats::CallFunc_Multiply_DoubleDouble_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(FL_EnemyScalingHelpers_C_ComputeCharacterStats, CallFunc_Conv_IntToDouble_ReturnValue_7) == 0x000188, "Member 'FL_EnemyScalingHelpers_C_ComputeCharacterStats::CallFunc_Conv_IntToDouble_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(FL_EnemyScalingHelpers_C_ComputeCharacterStats, CallFunc_Round_ReturnValue_5) == 0x000190, "Member 'FL_EnemyScalingHelpers_C_ComputeCharacterStats::CallFunc_Round_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(FL_EnemyScalingHelpers_C_ComputeCharacterStats, CallFunc_Conv_IntToDouble_ReturnValue_8) == 0x000198, "Member 'FL_EnemyScalingHelpers_C_ComputeCharacterStats::CallFunc_Conv_IntToDouble_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(FL_EnemyScalingHelpers_C_ComputeCharacterStats, CallFunc_Conv_IntToDouble_ReturnValue_9) == 0x0001A0, "Member 'FL_EnemyScalingHelpers_C_ComputeCharacterStats::CallFunc_Conv_IntToDouble_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(FL_EnemyScalingHelpers_C_ComputeCharacterStats, CallFunc_Multiply_DoubleDouble_ReturnValue_7) == 0x0001A8, "Member 'FL_EnemyScalingHelpers_C_ComputeCharacterStats::CallFunc_Multiply_DoubleDouble_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(FL_EnemyScalingHelpers_C_ComputeCharacterStats, CallFunc_Conv_IntToDouble_ReturnValue_10) == 0x0001B0, "Member 'FL_EnemyScalingHelpers_C_ComputeCharacterStats::CallFunc_Conv_IntToDouble_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(FL_EnemyScalingHelpers_C_ComputeCharacterStats, CallFunc_Round_ReturnValue_6) == 0x0001B8, "Member 'FL_EnemyScalingHelpers_C_ComputeCharacterStats::CallFunc_Round_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(FL_EnemyScalingHelpers_C_ComputeCharacterStats, CallFunc_Multiply_DoubleDouble_ReturnValue_8) == 0x0001C0, "Member 'FL_EnemyScalingHelpers_C_ComputeCharacterStats::CallFunc_Multiply_DoubleDouble_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(FL_EnemyScalingHelpers_C_ComputeCharacterStats, CallFunc_Conv_IntToDouble_ReturnValue_11) == 0x0001C8, "Member 'FL_EnemyScalingHelpers_C_ComputeCharacterStats::CallFunc_Conv_IntToDouble_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(FL_EnemyScalingHelpers_C_ComputeCharacterStats, CallFunc_Round_ReturnValue_7) == 0x0001D0, "Member 'FL_EnemyScalingHelpers_C_ComputeCharacterStats::CallFunc_Round_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(FL_EnemyScalingHelpers_C_ComputeCharacterStats, CallFunc_Conv_IntToDouble_ReturnValue_12) == 0x0001D8, "Member 'FL_EnemyScalingHelpers_C_ComputeCharacterStats::CallFunc_Conv_IntToDouble_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(FL_EnemyScalingHelpers_C_ComputeCharacterStats, CallFunc_Conv_IntToDouble_ReturnValue_13) == 0x0001E0, "Member 'FL_EnemyScalingHelpers_C_ComputeCharacterStats::CallFunc_Conv_IntToDouble_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(FL_EnemyScalingHelpers_C_ComputeCharacterStats, CallFunc_Multiply_DoubleDouble_ReturnValue_9) == 0x0001E8, "Member 'FL_EnemyScalingHelpers_C_ComputeCharacterStats::CallFunc_Multiply_DoubleDouble_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(FL_EnemyScalingHelpers_C_ComputeCharacterStats, CallFunc_Conv_IntToDouble_ReturnValue_14) == 0x0001F0, "Member 'FL_EnemyScalingHelpers_C_ComputeCharacterStats::CallFunc_Conv_IntToDouble_ReturnValue_14' has a wrong offset!");
static_assert(offsetof(FL_EnemyScalingHelpers_C_ComputeCharacterStats, CallFunc_Round_ReturnValue_8) == 0x0001F8, "Member 'FL_EnemyScalingHelpers_C_ComputeCharacterStats::CallFunc_Round_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(FL_EnemyScalingHelpers_C_ComputeCharacterStats, CallFunc_Multiply_DoubleDouble_ReturnValue_10) == 0x000200, "Member 'FL_EnemyScalingHelpers_C_ComputeCharacterStats::CallFunc_Multiply_DoubleDouble_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(FL_EnemyScalingHelpers_C_ComputeCharacterStats, CallFunc_Conv_IntToDouble_ReturnValue_15) == 0x000208, "Member 'FL_EnemyScalingHelpers_C_ComputeCharacterStats::CallFunc_Conv_IntToDouble_ReturnValue_15' has a wrong offset!");
static_assert(offsetof(FL_EnemyScalingHelpers_C_ComputeCharacterStats, CallFunc_Round_ReturnValue_9) == 0x000210, "Member 'FL_EnemyScalingHelpers_C_ComputeCharacterStats::CallFunc_Round_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(FL_EnemyScalingHelpers_C_ComputeCharacterStats, CallFunc_Conv_IntToDouble_ReturnValue_16) == 0x000218, "Member 'FL_EnemyScalingHelpers_C_ComputeCharacterStats::CallFunc_Conv_IntToDouble_ReturnValue_16' has a wrong offset!");
static_assert(offsetof(FL_EnemyScalingHelpers_C_ComputeCharacterStats, CallFunc_Conv_IntToDouble_ReturnValue_17) == 0x000220, "Member 'FL_EnemyScalingHelpers_C_ComputeCharacterStats::CallFunc_Conv_IntToDouble_ReturnValue_17' has a wrong offset!");
static_assert(offsetof(FL_EnemyScalingHelpers_C_ComputeCharacterStats, CallFunc_Multiply_DoubleDouble_ReturnValue_11) == 0x000228, "Member 'FL_EnemyScalingHelpers_C_ComputeCharacterStats::CallFunc_Multiply_DoubleDouble_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(FL_EnemyScalingHelpers_C_ComputeCharacterStats, CallFunc_Round_ReturnValue_10) == 0x000230, "Member 'FL_EnemyScalingHelpers_C_ComputeCharacterStats::CallFunc_Round_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(FL_EnemyScalingHelpers_C_ComputeCharacterStats, CallFunc_Conv_IntToDouble_ReturnValue_18) == 0x000238, "Member 'FL_EnemyScalingHelpers_C_ComputeCharacterStats::CallFunc_Conv_IntToDouble_ReturnValue_18' has a wrong offset!");
static_assert(offsetof(FL_EnemyScalingHelpers_C_ComputeCharacterStats, K2Node_MakeMap_Map) == 0x000240, "Member 'FL_EnemyScalingHelpers_C_ComputeCharacterStats::K2Node_MakeMap_Map' has a wrong offset!");

// Function FL_EnemyScalingHelpers.FL_EnemyScalingHelpers_C.GetEncounterLevelFromMap
// 0x02B0 (0x02B0 - 0x0000)
struct FL_EnemyScalingHelpers_C_GetEncounterLevelFromMap final
{
public:
	int32                                         EncounterLevelOverride;                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         local_AdditionalLevel;                             // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCurrentLevelProductionLevel_ReturnValue; // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x2];                                       // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetTeamLevel_MaxValue;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetTeamLevel_MaxValue_1;                  // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetCurrentLevelData_Found;                // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFLevelDataEntry                       CallFunc_GetCurrentLevelData_LevelData;            // 0x0028(0x01B0)(HasGetValueTypeHash)
	class FName                                   CallFunc_GetCurrentLevelData_RowName;              // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E1[0x7];                                      // 0x01E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x01F0(0x0048)(HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_239[0x3];                                      // 0x0239(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Clamp_ReturnValue;                        // 0x023C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue_1;            // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0248(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0290(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Format_ReturnValue;                       // 0x02A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(FL_EnemyScalingHelpers_C_GetEncounterLevelFromMap) == 0x000008, "Wrong alignment on FL_EnemyScalingHelpers_C_GetEncounterLevelFromMap");
static_assert(sizeof(FL_EnemyScalingHelpers_C_GetEncounterLevelFromMap) == 0x0002B0, "Wrong size on FL_EnemyScalingHelpers_C_GetEncounterLevelFromMap");
static_assert(offsetof(FL_EnemyScalingHelpers_C_GetEncounterLevelFromMap, EncounterLevelOverride) == 0x000000, "Member 'FL_EnemyScalingHelpers_C_GetEncounterLevelFromMap::EncounterLevelOverride' has a wrong offset!");
static_assert(offsetof(FL_EnemyScalingHelpers_C_GetEncounterLevelFromMap, __WorldContext) == 0x000008, "Member 'FL_EnemyScalingHelpers_C_GetEncounterLevelFromMap::__WorldContext' has a wrong offset!");
static_assert(offsetof(FL_EnemyScalingHelpers_C_GetEncounterLevelFromMap, ReturnValue) == 0x000010, "Member 'FL_EnemyScalingHelpers_C_GetEncounterLevelFromMap::ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_EnemyScalingHelpers_C_GetEncounterLevelFromMap, local_AdditionalLevel) == 0x000014, "Member 'FL_EnemyScalingHelpers_C_GetEncounterLevelFromMap::local_AdditionalLevel' has a wrong offset!");
static_assert(offsetof(FL_EnemyScalingHelpers_C_GetEncounterLevelFromMap, CallFunc_Greater_IntInt_ReturnValue) == 0x000018, "Member 'FL_EnemyScalingHelpers_C_GetEncounterLevelFromMap::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_EnemyScalingHelpers_C_GetEncounterLevelFromMap, CallFunc_IsCurrentLevelProductionLevel_ReturnValue) == 0x000019, "Member 'FL_EnemyScalingHelpers_C_GetEncounterLevelFromMap::CallFunc_IsCurrentLevelProductionLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_EnemyScalingHelpers_C_GetEncounterLevelFromMap, CallFunc_GetTeamLevel_MaxValue) == 0x00001C, "Member 'FL_EnemyScalingHelpers_C_GetEncounterLevelFromMap::CallFunc_GetTeamLevel_MaxValue' has a wrong offset!");
static_assert(offsetof(FL_EnemyScalingHelpers_C_GetEncounterLevelFromMap, CallFunc_GetTeamLevel_MaxValue_1) == 0x000020, "Member 'FL_EnemyScalingHelpers_C_GetEncounterLevelFromMap::CallFunc_GetTeamLevel_MaxValue_1' has a wrong offset!");
static_assert(offsetof(FL_EnemyScalingHelpers_C_GetEncounterLevelFromMap, CallFunc_GetCurrentLevelData_Found) == 0x000024, "Member 'FL_EnemyScalingHelpers_C_GetEncounterLevelFromMap::CallFunc_GetCurrentLevelData_Found' has a wrong offset!");
static_assert(offsetof(FL_EnemyScalingHelpers_C_GetEncounterLevelFromMap, CallFunc_GetCurrentLevelData_LevelData) == 0x000028, "Member 'FL_EnemyScalingHelpers_C_GetEncounterLevelFromMap::CallFunc_GetCurrentLevelData_LevelData' has a wrong offset!");
static_assert(offsetof(FL_EnemyScalingHelpers_C_GetEncounterLevelFromMap, CallFunc_GetCurrentLevelData_RowName) == 0x0001D8, "Member 'FL_EnemyScalingHelpers_C_GetEncounterLevelFromMap::CallFunc_GetCurrentLevelData_RowName' has a wrong offset!");
static_assert(offsetof(FL_EnemyScalingHelpers_C_GetEncounterLevelFromMap, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0001E0, "Member 'FL_EnemyScalingHelpers_C_GetEncounterLevelFromMap::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_EnemyScalingHelpers_C_GetEncounterLevelFromMap, CallFunc_Conv_IntToInt64_ReturnValue) == 0x0001E8, "Member 'FL_EnemyScalingHelpers_C_GetEncounterLevelFromMap::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_EnemyScalingHelpers_C_GetEncounterLevelFromMap, K2Node_MakeStruct_FormatArgumentData) == 0x0001F0, "Member 'FL_EnemyScalingHelpers_C_GetEncounterLevelFromMap::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(FL_EnemyScalingHelpers_C_GetEncounterLevelFromMap, CallFunc_Greater_IntInt_ReturnValue_1) == 0x000238, "Member 'FL_EnemyScalingHelpers_C_GetEncounterLevelFromMap::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FL_EnemyScalingHelpers_C_GetEncounterLevelFromMap, CallFunc_Clamp_ReturnValue) == 0x00023C, "Member 'FL_EnemyScalingHelpers_C_GetEncounterLevelFromMap::CallFunc_Clamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_EnemyScalingHelpers_C_GetEncounterLevelFromMap, CallFunc_Conv_IntToInt64_ReturnValue_1) == 0x000240, "Member 'FL_EnemyScalingHelpers_C_GetEncounterLevelFromMap::CallFunc_Conv_IntToInt64_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FL_EnemyScalingHelpers_C_GetEncounterLevelFromMap, K2Node_MakeStruct_FormatArgumentData_1) == 0x000248, "Member 'FL_EnemyScalingHelpers_C_GetEncounterLevelFromMap::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(FL_EnemyScalingHelpers_C_GetEncounterLevelFromMap, K2Node_MakeArray_Array) == 0x000290, "Member 'FL_EnemyScalingHelpers_C_GetEncounterLevelFromMap::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(FL_EnemyScalingHelpers_C_GetEncounterLevelFromMap, CallFunc_Format_ReturnValue) == 0x0002A0, "Member 'FL_EnemyScalingHelpers_C_GetEncounterLevelFromMap::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function FL_EnemyScalingHelpers.FL_EnemyScalingHelpers_C.GetAdditionalEncounterLevelWithNewGamePlus
// 0x0048 (0x0048 - 0x0000)
struct FL_EnemyScalingHelpers_C_GetAdditionalEncounterLevelWithNewGamePlus final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         local_RowIndex;                                    // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames;         // 0x0018(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetFinishedGameCount_FinishedGameCount;   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Min_ReturnValue;                          // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_NewGamePlusParameters               CallFunc_GetDataTableRowFromName_OutRow;           // 0x003C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FL_EnemyScalingHelpers_C_GetAdditionalEncounterLevelWithNewGamePlus) == 0x000008, "Wrong alignment on FL_EnemyScalingHelpers_C_GetAdditionalEncounterLevelWithNewGamePlus");
static_assert(sizeof(FL_EnemyScalingHelpers_C_GetAdditionalEncounterLevelWithNewGamePlus) == 0x000048, "Wrong size on FL_EnemyScalingHelpers_C_GetAdditionalEncounterLevelWithNewGamePlus");
static_assert(offsetof(FL_EnemyScalingHelpers_C_GetAdditionalEncounterLevelWithNewGamePlus, __WorldContext) == 0x000000, "Member 'FL_EnemyScalingHelpers_C_GetAdditionalEncounterLevelWithNewGamePlus::__WorldContext' has a wrong offset!");
static_assert(offsetof(FL_EnemyScalingHelpers_C_GetAdditionalEncounterLevelWithNewGamePlus, ReturnValue) == 0x000008, "Member 'FL_EnemyScalingHelpers_C_GetAdditionalEncounterLevelWithNewGamePlus::ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_EnemyScalingHelpers_C_GetAdditionalEncounterLevelWithNewGamePlus, local_RowIndex) == 0x00000C, "Member 'FL_EnemyScalingHelpers_C_GetAdditionalEncounterLevelWithNewGamePlus::local_RowIndex' has a wrong offset!");
static_assert(offsetof(FL_EnemyScalingHelpers_C_GetAdditionalEncounterLevelWithNewGamePlus, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000010, "Member 'FL_EnemyScalingHelpers_C_GetAdditionalEncounterLevelWithNewGamePlus::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_EnemyScalingHelpers_C_GetAdditionalEncounterLevelWithNewGamePlus, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'FL_EnemyScalingHelpers_C_GetAdditionalEncounterLevelWithNewGamePlus::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_EnemyScalingHelpers_C_GetAdditionalEncounterLevelWithNewGamePlus, CallFunc_GetDataTableRowNames_OutRowNames) == 0x000018, "Member 'FL_EnemyScalingHelpers_C_GetAdditionalEncounterLevelWithNewGamePlus::CallFunc_GetDataTableRowNames_OutRowNames' has a wrong offset!");
static_assert(offsetof(FL_EnemyScalingHelpers_C_GetAdditionalEncounterLevelWithNewGamePlus, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'FL_EnemyScalingHelpers_C_GetAdditionalEncounterLevelWithNewGamePlus::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_EnemyScalingHelpers_C_GetAdditionalEncounterLevelWithNewGamePlus, CallFunc_GetFinishedGameCount_FinishedGameCount) == 0x00002C, "Member 'FL_EnemyScalingHelpers_C_GetAdditionalEncounterLevelWithNewGamePlus::CallFunc_GetFinishedGameCount_FinishedGameCount' has a wrong offset!");
static_assert(offsetof(FL_EnemyScalingHelpers_C_GetAdditionalEncounterLevelWithNewGamePlus, CallFunc_Subtract_IntInt_ReturnValue) == 0x000030, "Member 'FL_EnemyScalingHelpers_C_GetAdditionalEncounterLevelWithNewGamePlus::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_EnemyScalingHelpers_C_GetAdditionalEncounterLevelWithNewGamePlus, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000034, "Member 'FL_EnemyScalingHelpers_C_GetAdditionalEncounterLevelWithNewGamePlus::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FL_EnemyScalingHelpers_C_GetAdditionalEncounterLevelWithNewGamePlus, CallFunc_Min_ReturnValue) == 0x000038, "Member 'FL_EnemyScalingHelpers_C_GetAdditionalEncounterLevelWithNewGamePlus::CallFunc_Min_ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_EnemyScalingHelpers_C_GetAdditionalEncounterLevelWithNewGamePlus, CallFunc_GetDataTableRowFromName_OutRow) == 0x00003C, "Member 'FL_EnemyScalingHelpers_C_GetAdditionalEncounterLevelWithNewGamePlus::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(FL_EnemyScalingHelpers_C_GetAdditionalEncounterLevelWithNewGamePlus, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000044, "Member 'FL_EnemyScalingHelpers_C_GetAdditionalEncounterLevelWithNewGamePlus::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_EnemyScalingHelpers_C_GetAdditionalEncounterLevelWithNewGamePlus, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000045, "Member 'FL_EnemyScalingHelpers_C_GetAdditionalEncounterLevelWithNewGamePlus::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");

// Function FL_EnemyScalingHelpers.FL_EnemyScalingHelpers_C.GetTeamLevel
// 0x0088 (0x0088 - 0x0000)
struct FL_EnemyScalingHelpers_C_GetTeamLevel final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         MaxValue;                                          // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 Temp_wildcard_We_need_a_second_array_to_store_the_result_and_be_able_to_wipe_the_first__buffer__array_Variable; // 0x0010(0x0010)(ConstParm, ReferenceParm)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MaxOfIntArray_IndexOfMaxValue;            // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MaxOfIntArray_MaxValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 Temp_wildcard_Temp_buffer_array_Variable;          // 0x0038(0x0010)(ConstParm, ReferenceParm)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_jRPG_GI_Custom_C*                   K2Node_DynamicCast_AsBP_J_RPG_GI_Custom;           // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UBP_CharacterData_C*>            CallFunc_Map_Values_Values;                        // 0x0060(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_CharacterData_C*                    CallFunc_Array_Get_Item;                           // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FL_EnemyScalingHelpers_C_GetTeamLevel) == 0x000008, "Wrong alignment on FL_EnemyScalingHelpers_C_GetTeamLevel");
static_assert(sizeof(FL_EnemyScalingHelpers_C_GetTeamLevel) == 0x000088, "Wrong size on FL_EnemyScalingHelpers_C_GetTeamLevel");
static_assert(offsetof(FL_EnemyScalingHelpers_C_GetTeamLevel, __WorldContext) == 0x000000, "Member 'FL_EnemyScalingHelpers_C_GetTeamLevel::__WorldContext' has a wrong offset!");
static_assert(offsetof(FL_EnemyScalingHelpers_C_GetTeamLevel, MaxValue) == 0x000008, "Member 'FL_EnemyScalingHelpers_C_GetTeamLevel::MaxValue' has a wrong offset!");
static_assert(offsetof(FL_EnemyScalingHelpers_C_GetTeamLevel, Temp_wildcard_We_need_a_second_array_to_store_the_result_and_be_able_to_wipe_the_first__buffer__array_Variable) == 0x000010, "Member 'FL_EnemyScalingHelpers_C_GetTeamLevel::Temp_wildcard_We_need_a_second_array_to_store_the_result_and_be_able_to_wipe_the_first__buffer__array_Variable' has a wrong offset!");
static_assert(offsetof(FL_EnemyScalingHelpers_C_GetTeamLevel, Temp_int_Loop_Counter_Variable) == 0x000020, "Member 'FL_EnemyScalingHelpers_C_GetTeamLevel::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(FL_EnemyScalingHelpers_C_GetTeamLevel, CallFunc_MaxOfIntArray_IndexOfMaxValue) == 0x000024, "Member 'FL_EnemyScalingHelpers_C_GetTeamLevel::CallFunc_MaxOfIntArray_IndexOfMaxValue' has a wrong offset!");
static_assert(offsetof(FL_EnemyScalingHelpers_C_GetTeamLevel, CallFunc_MaxOfIntArray_MaxValue) == 0x000028, "Member 'FL_EnemyScalingHelpers_C_GetTeamLevel::CallFunc_MaxOfIntArray_MaxValue' has a wrong offset!");
static_assert(offsetof(FL_EnemyScalingHelpers_C_GetTeamLevel, CallFunc_Add_IntInt_ReturnValue) == 0x00002C, "Member 'FL_EnemyScalingHelpers_C_GetTeamLevel::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_EnemyScalingHelpers_C_GetTeamLevel, Temp_int_Array_Index_Variable) == 0x000030, "Member 'FL_EnemyScalingHelpers_C_GetTeamLevel::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(FL_EnemyScalingHelpers_C_GetTeamLevel, Temp_wildcard_Temp_buffer_array_Variable) == 0x000038, "Member 'FL_EnemyScalingHelpers_C_GetTeamLevel::Temp_wildcard_Temp_buffer_array_Variable' has a wrong offset!");
static_assert(offsetof(FL_EnemyScalingHelpers_C_GetTeamLevel, CallFunc_GetGameInstance_ReturnValue) == 0x000048, "Member 'FL_EnemyScalingHelpers_C_GetTeamLevel::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_EnemyScalingHelpers_C_GetTeamLevel, K2Node_DynamicCast_AsBP_J_RPG_GI_Custom) == 0x000050, "Member 'FL_EnemyScalingHelpers_C_GetTeamLevel::K2Node_DynamicCast_AsBP_J_RPG_GI_Custom' has a wrong offset!");
static_assert(offsetof(FL_EnemyScalingHelpers_C_GetTeamLevel, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'FL_EnemyScalingHelpers_C_GetTeamLevel::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(FL_EnemyScalingHelpers_C_GetTeamLevel, CallFunc_Map_Values_Values) == 0x000060, "Member 'FL_EnemyScalingHelpers_C_GetTeamLevel::CallFunc_Map_Values_Values' has a wrong offset!");
static_assert(offsetof(FL_EnemyScalingHelpers_C_GetTeamLevel, CallFunc_Array_Length_ReturnValue) == 0x000070, "Member 'FL_EnemyScalingHelpers_C_GetTeamLevel::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_EnemyScalingHelpers_C_GetTeamLevel, CallFunc_Array_Get_Item) == 0x000078, "Member 'FL_EnemyScalingHelpers_C_GetTeamLevel::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(FL_EnemyScalingHelpers_C_GetTeamLevel, CallFunc_Less_IntInt_ReturnValue) == 0x000080, "Member 'FL_EnemyScalingHelpers_C_GetTeamLevel::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_EnemyScalingHelpers_C_GetTeamLevel, CallFunc_Array_Add_ReturnValue) == 0x000084, "Member 'FL_EnemyScalingHelpers_C_GetTeamLevel::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function FL_EnemyScalingHelpers.FL_EnemyScalingHelpers_C.GetEncounterLevel
// 0x0030 (0x0030 - 0x0000)
struct FL_EnemyScalingHelpers_C_GetEncounterLevel final
{
public:
	int32                                         EncounterLevelOverride;                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         local_AdditionalLevel;                             // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetIntCVar_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPackagedForDistribution_ReturnValue;    // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E[0x2];                                       // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetEncounterLevelFromMap_ReturnValue;     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetAdditionalEncounterLevelWithNewGamePlus_ReturnValue; // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FL_EnemyScalingHelpers_C_GetEncounterLevel) == 0x000008, "Wrong alignment on FL_EnemyScalingHelpers_C_GetEncounterLevel");
static_assert(sizeof(FL_EnemyScalingHelpers_C_GetEncounterLevel) == 0x000030, "Wrong size on FL_EnemyScalingHelpers_C_GetEncounterLevel");
static_assert(offsetof(FL_EnemyScalingHelpers_C_GetEncounterLevel, EncounterLevelOverride) == 0x000000, "Member 'FL_EnemyScalingHelpers_C_GetEncounterLevel::EncounterLevelOverride' has a wrong offset!");
static_assert(offsetof(FL_EnemyScalingHelpers_C_GetEncounterLevel, __WorldContext) == 0x000008, "Member 'FL_EnemyScalingHelpers_C_GetEncounterLevel::__WorldContext' has a wrong offset!");
static_assert(offsetof(FL_EnemyScalingHelpers_C_GetEncounterLevel, ReturnValue) == 0x000010, "Member 'FL_EnemyScalingHelpers_C_GetEncounterLevel::ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_EnemyScalingHelpers_C_GetEncounterLevel, local_AdditionalLevel) == 0x000014, "Member 'FL_EnemyScalingHelpers_C_GetEncounterLevel::local_AdditionalLevel' has a wrong offset!");
static_assert(offsetof(FL_EnemyScalingHelpers_C_GetEncounterLevel, CallFunc_GetIntCVar_ReturnValue) == 0x000018, "Member 'FL_EnemyScalingHelpers_C_GetEncounterLevel::CallFunc_GetIntCVar_ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_EnemyScalingHelpers_C_GetEncounterLevel, CallFunc_Greater_IntInt_ReturnValue) == 0x00001C, "Member 'FL_EnemyScalingHelpers_C_GetEncounterLevel::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_EnemyScalingHelpers_C_GetEncounterLevel, CallFunc_IsPackagedForDistribution_ReturnValue) == 0x00001D, "Member 'FL_EnemyScalingHelpers_C_GetEncounterLevel::CallFunc_IsPackagedForDistribution_ReturnValue' has a wrong offset!");
