#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FL_jRPG_CustomFunctionLibrary

#include "Basic.hpp"

#include "E_Perfection_Ranks_structs.hpp"
#include "FEquipmentSlot_structs.hpp"
#include "FLevelDataEntry_structs.hpp"
#include "E_CharacterList_structs.hpp"
#include "S_jRPG_CharacterSaveState_structs.hpp"
#include "E_StanceType_structs.hpp"
#include "ESkillElementOverride_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "E_jRPG_ItemSubtype_structs.hpp"
#include "EAttributeScalingGrade_structs.hpp"
#include "EWeaponQuality_structs.hpp"
#include "Engine_structs.hpp"
#include "E_Characters_structs.hpp"
#include "FPromptID_structs.hpp"
#include "S_WeaponScalingLevel_structs.hpp"
#include "S_jRPG_Enemy_structs.hpp"
#include "S_WeaponInstanceData_structs.hpp"
#include "S_jRPG_Item_StaticData_structs.hpp"
#include "S_WeaponDefinition_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "EAttackType_structs.hpp"
#include "BlueprintSorting_structs.hpp"
#include "S_jRPG_Item_DynamicData_structs.hpp"
#include "FCharacterAssignedEquipment_structs.hpp"
#include "E_jRPG_StatType_structs.hpp"
#include "ECharacterAttribute_structs.hpp"
#include "SandFall_structs.hpp"
#include "S_ScreenSpaceFogScatteringParameters_structs.hpp"
#include "FSoundEvent_structs.hpp"
#include "S_jRPG_Level_structs.hpp"
#include "EInputAction_structs.hpp"
#include "FKeyVisualInfo_structs.hpp"
#include "InputCore_structs.hpp"
#include "FPassiveEffect_structs.hpp"
#include "FPassiveEffectProgression_structs.hpp"
#include "FPromptParams_structs.hpp"
#include "EFaceActions_structs.hpp"
#include "E_jRPG_ActionType_structs.hpp"
#include "E_jRPG_ItemRarity_structs.hpp"
#include "E_jRPG_ItemType_structs.hpp"


namespace SDK::Params
{

// Function FL_jRPG_CustomFunctionLibrary.FL_jRPG_CustomFunctionLibrary_C.Change Map Internal
// 0x01E0 (0x01E0 - 0x0000)
struct FL_jRPG_CustomFunctionLibrary_C_Change_Map_Internal final
{
public:
	struct FFLevelDataEntry                       LevelData;                                         // 0x0000(0x01B0)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)
	struct FGameplayTag                           SpawnPointTag;                                     // 0x01B0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x01B8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x01C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGameplayTagValid_ReturnValue;           // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C9[0x7];                                      // 0x01C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_jRPG_GI_Custom_C*                   K2Node_DynamicCast_AsBP_J_RPG_GI_Custom;           // 0x01D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x01D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x01DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x01DB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FL_jRPG_CustomFunctionLibrary_C_Change_Map_Internal) == 0x000008, "Wrong alignment on FL_jRPG_CustomFunctionLibrary_C_Change_Map_Internal");
static_assert(sizeof(FL_jRPG_CustomFunctionLibrary_C_Change_Map_Internal) == 0x0001E0, "Wrong size on FL_jRPG_CustomFunctionLibrary_C_Change_Map_Internal");
static_assert(offsetof(FL_jRPG_CustomFunctionLibrary_C_Change_Map_Internal, LevelData) == 0x000000, "Member 'FL_jRPG_CustomFunctionLibrary_C_Change_Map_Internal::LevelData' has a wrong offset!");
static_assert(offsetof(FL_jRPG_CustomFunctionLibrary_C_Change_Map_Internal, SpawnPointTag) == 0x0001B0, "Member 'FL_jRPG_CustomFunctionLibrary_C_Change_Map_Internal::SpawnPointTag' has a wrong offset!");
static_assert(offsetof(FL_jRPG_CustomFunctionLibrary_C_Change_Map_Internal, __WorldContext) == 0x0001B8, "Member 'FL_jRPG_CustomFunctionLibrary_C_Change_Map_Internal::__WorldContext' has a wrong offset!");
static_assert(offsetof(FL_jRPG_CustomFunctionLibrary_C_Change_Map_Internal, CallFunc_GetGameInstance_ReturnValue) == 0x0001C0, "Member 'FL_jRPG_CustomFunctionLibrary_C_Change_Map_Internal::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_jRPG_CustomFunctionLibrary_C_Change_Map_Internal, CallFunc_IsGameplayTagValid_ReturnValue) == 0x0001C8, "Member 'FL_jRPG_CustomFunctionLibrary_C_Change_Map_Internal::CallFunc_IsGameplayTagValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_jRPG_CustomFunctionLibrary_C_Change_Map_Internal, K2Node_DynamicCast_AsBP_J_RPG_GI_Custom) == 0x0001D0, "Member 'FL_jRPG_CustomFunctionLibrary_C_Change_Map_Internal::K2Node_DynamicCast_AsBP_J_RPG_GI_Custom' has a wrong offset!");
static_assert(offsetof(FL_jRPG_CustomFunctionLibrary_C_Change_Map_Internal, K2Node_DynamicCast_bSuccess) == 0x0001D8, "Member 'FL_jRPG_CustomFunctionLibrary_C_Change_Map_Internal::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(FL_jRPG_CustomFunctionLibrary_C_Change_Map_Internal, CallFunc_Not_PreBool_ReturnValue) == 0x0001D9, "Member 'FL_jRPG_CustomFunctionLibrary_C_Change_Map_Internal::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_jRPG_CustomFunctionLibrary_C_Change_Map_Internal, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x0001DA, "Member 'FL_jRPG_CustomFunctionLibrary_C_Change_Map_Internal::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_jRPG_CustomFunctionLibrary_C_Change_Map_Internal, CallFunc_BooleanAND_ReturnValue) == 0x0001DB, "Member 'FL_jRPG_CustomFunctionLibrary_C_Change_Map_Internal::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function FL_jRPG_CustomFunctionLibrary.FL_jRPG_CustomFunctionLibrary_C.ChangeMapByAssetName
// 0x0250 (0x0250 - 0x0000)
struct FL_jRPG_CustomFunctionLibrary_C_ChangeMapByAssetName final
{
public:
	class FName                                   LevelAssetName;                                    // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           SpawnPointTag;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_NameToText_ReturnValue;              // 0x0018(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0028(0x0048)(HasGetValueTypeHash)
	bool                                          CallFunc_FindLevelDataByLevelFile_Found;           // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_FindLevelDataByLevelFile_RowName;         // 0x0074(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFLevelDataEntry                       CallFunc_FindLevelDataByLevelFile_LevelData;       // 0x0080(0x01B0)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0230(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Format_ReturnValue;                       // 0x0240(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(FL_jRPG_CustomFunctionLibrary_C_ChangeMapByAssetName) == 0x000008, "Wrong alignment on FL_jRPG_CustomFunctionLibrary_C_ChangeMapByAssetName");
static_assert(sizeof(FL_jRPG_CustomFunctionLibrary_C_ChangeMapByAssetName) == 0x000250, "Wrong size on FL_jRPG_CustomFunctionLibrary_C_ChangeMapByAssetName");
static_assert(offsetof(FL_jRPG_CustomFunctionLibrary_C_ChangeMapByAssetName, LevelAssetName) == 0x000000, "Member 'FL_jRPG_CustomFunctionLibrary_C_ChangeMapByAssetName::LevelAssetName' has a wrong offset!");
static_assert(offsetof(FL_jRPG_CustomFunctionLibrary_C_ChangeMapByAssetName, SpawnPointTag) == 0x000008, "Member 'FL_jRPG_CustomFunctionLibrary_C_ChangeMapByAssetName::SpawnPointTag' has a wrong offset!");
static_assert(offsetof(FL_jRPG_CustomFunctionLibrary_C_ChangeMapByAssetName, __WorldContext) == 0x000010, "Member 'FL_jRPG_CustomFunctionLibrary_C_ChangeMapByAssetName::__WorldContext' has a wrong offset!");
static_assert(offsetof(FL_jRPG_CustomFunctionLibrary_C_ChangeMapByAssetName, CallFunc_Conv_NameToText_ReturnValue) == 0x000018, "Member 'FL_jRPG_CustomFunctionLibrary_C_ChangeMapByAssetName::CallFunc_Conv_NameToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_jRPG_CustomFunctionLibrary_C_ChangeMapByAssetName, K2Node_MakeStruct_FormatArgumentData) == 0x000028, "Member 'FL_jRPG_CustomFunctionLibrary_C_ChangeMapByAssetName::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(FL_jRPG_CustomFunctionLibrary_C_ChangeMapByAssetName, CallFunc_FindLevelDataByLevelFile_Found) == 0x000070, "Member 'FL_jRPG_CustomFunctionLibrary_C_ChangeMapByAssetName::CallFunc_FindLevelDataByLevelFile_Found' has a wrong offset!");
static_assert(offsetof(FL_jRPG_CustomFunctionLibrary_C_ChangeMapByAssetName, CallFunc_FindLevelDataByLevelFile_RowName) == 0x000074, "Member 'FL_jRPG_CustomFunctionLibrary_C_ChangeMapByAssetName::CallFunc_FindLevelDataByLevelFile_RowName' has a wrong offset!");
static_assert(offsetof(FL_jRPG_CustomFunctionLibrary_C_ChangeMapByAssetName, CallFunc_FindLevelDataByLevelFile_LevelData) == 0x000080, "Member 'FL_jRPG_CustomFunctionLibrary_C_ChangeMapByAssetName::CallFunc_FindLevelDataByLevelFile_LevelData' has a wrong offset!");
static_assert(offsetof(FL_jRPG_CustomFunctionLibrary_C_ChangeMapByAssetName, K2Node_MakeArray_Array) == 0x000230, "Member 'FL_jRPG_CustomFunctionLibrary_C_ChangeMapByAssetName::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(FL_jRPG_CustomFunctionLibrary_C_ChangeMapByAssetName, CallFunc_Format_ReturnValue) == 0x000240, "Member 'FL_jRPG_CustomFunctionLibrary_C_ChangeMapByAssetName::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function FL_jRPG_CustomFunctionLibrary.FL_jRPG_CustomFunctionLibrary_C.GetAllLevelDataDTs
// 0x0060 (0x0060 - 0x0000)
struct FL_jRPG_CustomFunctionLibrary_C_GetAllLevelDataDTs final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UDataTable*>                     ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ReturnParm)
	TArray<class UDataTable*>                     local_dataTables;                                  // 0x0018(0x0010)(Edit, BlueprintVisible)
	bool                                          CallFunc_IsPackagedBuild_ReturnValue;              // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_DataAsset_ProjectConfiguration_C*   CallFunc_GetProjectConfiguration_ReturnValue;      // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             CallFunc_GetEditorOnlyLevelDataTable_ReturnValue;  // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             CallFunc_GetLevelDataDT_ReturnValue;               // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UDataTable*>                     K2Node_MakeArray_Array;                            // 0x0048(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FL_jRPG_CustomFunctionLibrary_C_GetAllLevelDataDTs) == 0x000008, "Wrong alignment on FL_jRPG_CustomFunctionLibrary_C_GetAllLevelDataDTs");
static_assert(sizeof(FL_jRPG_CustomFunctionLibrary_C_GetAllLevelDataDTs) == 0x000060, "Wrong size on FL_jRPG_CustomFunctionLibrary_C_GetAllLevelDataDTs");
static_assert(offsetof(FL_jRPG_CustomFunctionLibrary_C_GetAllLevelDataDTs, __WorldContext) == 0x000000, "Member 'FL_jRPG_CustomFunctionLibrary_C_GetAllLevelDataDTs::__WorldContext' has a wrong offset!");
static_assert(offsetof(FL_jRPG_CustomFunctionLibrary_C_GetAllLevelDataDTs, ReturnValue) == 0x000008, "Member 'FL_jRPG_CustomFunctionLibrary_C_GetAllLevelDataDTs::ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_jRPG_CustomFunctionLibrary_C_GetAllLevelDataDTs, local_dataTables) == 0x000018, "Member 'FL_jRPG_CustomFunctionLibrary_C_GetAllLevelDataDTs::local_dataTables' has a wrong offset!");
static_assert(offsetof(FL_jRPG_CustomFunctionLibrary_C_GetAllLevelDataDTs, CallFunc_IsPackagedBuild_ReturnValue) == 0x000028, "Member 'FL_jRPG_CustomFunctionLibrary_C_GetAllLevelDataDTs::CallFunc_IsPackagedBuild_ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_jRPG_CustomFunctionLibrary_C_GetAllLevelDataDTs, CallFunc_GetProjectConfiguration_ReturnValue) == 0x000030, "Member 'FL_jRPG_CustomFunctionLibrary_C_GetAllLevelDataDTs::CallFunc_GetProjectConfiguration_ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_jRPG_CustomFunctionLibrary_C_GetAllLevelDataDTs, CallFunc_GetEditorOnlyLevelDataTable_ReturnValue) == 0x000038, "Member 'FL_jRPG_CustomFunctionLibrary_C_GetAllLevelDataDTs::CallFunc_GetEditorOnlyLevelDataTable_ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_jRPG_CustomFunctionLibrary_C_GetAllLevelDataDTs, CallFunc_GetLevelDataDT_ReturnValue) == 0x000040, "Member 'FL_jRPG_CustomFunctionLibrary_C_GetAllLevelDataDTs::CallFunc_GetLevelDataDT_ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_jRPG_CustomFunctionLibrary_C_GetAllLevelDataDTs, K2Node_MakeArray_Array) == 0x000048, "Member 'FL_jRPG_CustomFunctionLibrary_C_GetAllLevelDataDTs::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(FL_jRPG_CustomFunctionLibrary_C_GetAllLevelDataDTs, CallFunc_Array_Add_ReturnValue) == 0x000058, "Member 'FL_jRPG_CustomFunctionLibrary_C_GetAllLevelDataDTs::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function FL_jRPG_CustomFunctionLibrary.FL_jRPG_CustomFunctionLibrary_C.GetCharacterListEnum_FromID
// 0x0098 (0x0098 - 0x0000)
struct FL_jRPG_CustomFunctionLibrary_C_GetCharacterListEnum_FromID final
{
public:
	class FName                                   HardcodedName;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	E_CharacterList                               ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_NameToText_ReturnValue;              // 0x0018(0x0010)()
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0030(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0078(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Format_ReturnValue;                       // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(FL_jRPG_CustomFunctionLibrary_C_GetCharacterListEnum_FromID) == 0x000008, "Wrong alignment on FL_jRPG_CustomFunctionLibrary_C_GetCharacterListEnum_FromID");
static_assert(sizeof(FL_jRPG_CustomFunctionLibrary_C_GetCharacterListEnum_FromID) == 0x000098, "Wrong size on FL_jRPG_CustomFunctionLibrary_C_GetCharacterListEnum_FromID");
static_assert(offsetof(FL_jRPG_CustomFunctionLibrary_C_GetCharacterListEnum_FromID, HardcodedName) == 0x000000, "Member 'FL_jRPG_CustomFunctionLibrary_C_GetCharacterListEnum_FromID::HardcodedName' has a wrong offset!");
static_assert(offsetof(FL_jRPG_CustomFunctionLibrary_C_GetCharacterListEnum_FromID, __WorldContext) == 0x000008, "Member 'FL_jRPG_CustomFunctionLibrary_C_GetCharacterListEnum_FromID::__WorldContext' has a wrong offset!");
static_assert(offsetof(FL_jRPG_CustomFunctionLibrary_C_GetCharacterListEnum_FromID, ReturnValue) == 0x000010, "Member 'FL_jRPG_CustomFunctionLibrary_C_GetCharacterListEnum_FromID::ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_jRPG_CustomFunctionLibrary_C_GetCharacterListEnum_FromID, CallFunc_Conv_NameToText_ReturnValue) == 0x000018, "Member 'FL_jRPG_CustomFunctionLibrary_C_GetCharacterListEnum_FromID::CallFunc_Conv_NameToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_jRPG_CustomFunctionLibrary_C_GetCharacterListEnum_FromID, K2Node_SwitchName_CmpSuccess) == 0x000028, "Member 'FL_jRPG_CustomFunctionLibrary_C_GetCharacterListEnum_FromID::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(FL_jRPG_CustomFunctionLibrary_C_GetCharacterListEnum_FromID, K2Node_MakeStruct_FormatArgumentData) == 0x000030, "Member 'FL_jRPG_CustomFunctionLibrary_C_GetCharacterListEnum_FromID::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(FL_jRPG_CustomFunctionLibrary_C_GetCharacterListEnum_FromID, K2Node_MakeArray_Array) == 0x000078, "Member 'FL_jRPG_CustomFunctionLibrary_C_GetCharacterListEnum_FromID::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(FL_jRPG_CustomFunctionLibrary_C_GetCharacterListEnum_FromID, CallFunc_Format_ReturnValue) == 0x000088, "Member 'FL_jRPG_CustomFunctionLibrary_C_GetCharacterListEnum_FromID::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function FL_jRPG_CustomFunctionLibrary.FL_jRPG_CustomFunctionLibrary_C.GetPerfectionRankDisplayName
// 0x0098 (0x0098 - 0x0000)
struct FL_jRPG_CustomFunctionLibrary_C_GetPerfectionRankDisplayName final
{
public:
	E_Perfection_Ranks                            PerfectionRank;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ReturnParm)
	E_Perfection_Ranks                            Temp_byte_Variable;                                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0028(0x0010)()
	class FText                                   Temp_text_Variable_1;                              // 0x0038(0x0010)()
	class FText                                   Temp_text_Variable_2;                              // 0x0048(0x0010)()
	class FText                                   Temp_text_Variable_3;                              // 0x0058(0x0010)()
	class FText                                   Temp_text_Variable_4;                              // 0x0068(0x0010)()
	class FText                                   Temp_text_Variable_5;                              // 0x0078(0x0010)()
	class FText                                   K2Node_Select_Default;                             // 0x0088(0x0010)()
};
static_assert(alignof(FL_jRPG_CustomFunctionLibrary_C_GetPerfectionRankDisplayName) == 0x000008, "Wrong alignment on FL_jRPG_CustomFunctionLibrary_C_GetPerfectionRankDisplayName");
static_assert(sizeof(FL_jRPG_CustomFunctionLibrary_C_GetPerfectionRankDisplayName) == 0x000098, "Wrong size on FL_jRPG_CustomFunctionLibrary_C_GetPerfectionRankDisplayName");
static_assert(offsetof(FL_jRPG_CustomFunctionLibrary_C_GetPerfectionRankDisplayName, PerfectionRank) == 0x000000, "Member 'FL_jRPG_CustomFunctionLibrary_C_GetPerfectionRankDisplayName::PerfectionRank' has a wrong offset!");
static_assert(offsetof(FL_jRPG_CustomFunctionLibrary_C_GetPerfectionRankDisplayName, __WorldContext) == 0x000008, "Member 'FL_jRPG_CustomFunctionLibrary_C_GetPerfectionRankDisplayName::__WorldContext' has a wrong offset!");
static_assert(offsetof(FL_jRPG_CustomFunctionLibrary_C_GetPerfectionRankDisplayName, ReturnValue) == 0x000010, "Member 'FL_jRPG_CustomFunctionLibrary_C_GetPerfectionRankDisplayName::ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_jRPG_CustomFunctionLibrary_C_GetPerfectionRankDisplayName, Temp_byte_Variable) == 0x000020, "Member 'FL_jRPG_CustomFunctionLibrary_C_GetPerfectionRankDisplayName::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(FL_jRPG_CustomFunctionLibrary_C_GetPerfectionRankDisplayName, Temp_text_Variable) == 0x000028, "Member 'FL_jRPG_CustomFunctionLibrary_C_GetPerfectionRankDisplayName::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(FL_jRPG_CustomFunctionLibrary_C_GetPerfectionRankDisplayName, Temp_text_Variable_1) == 0x000038, "Member 'FL_jRPG_CustomFunctionLibrary_C_GetPerfectionRankDisplayName::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(FL_jRPG_CustomFunctionLibrary_C_GetPerfectionRankDisplayName, Temp_text_Variable_2) == 0x000048, "Member 'FL_jRPG_CustomFunctionLibrary_C_GetPerfectionRankDisplayName::Temp_text_Variable_2' has a wrong offset!");
static_assert(offsetof(FL_jRPG_CustomFunctionLibrary_C_GetPerfectionRankDisplayName, Temp_text_Variable_3) == 0x000058, "Member 'FL_jRPG_CustomFunctionLibrary_C_GetPerfectionRankDisplayName::Temp_text_Variable_3' has a wrong offset!");
static_assert(offsetof(FL_jRPG_CustomFunctionLibrary_C_GetPerfectionRankDisplayName, Temp_text_Variable_4) == 0x000068, "Member 'FL_jRPG_CustomFunctionLibrary_C_GetPerfectionRankDisplayName::Temp_text_Variable_4' has a wrong offset!");
static_assert(offsetof(FL_jRPG_CustomFunctionLibrary_C_GetPerfectionRankDisplayName, Temp_text_Variable_5) == 0x000078, "Member 'FL_jRPG_CustomFunctionLibrary_C_GetPerfectionRankDisplayName::Temp_text_Variable_5' has a wrong offset!");
static_assert(offsetof(FL_jRPG_CustomFunctionLibrary_C_GetPerfectionRankDisplayName, K2Node_Select_Default) == 0x000088, "Member 'FL_jRPG_CustomFunctionLibrary_C_GetPerfectionRankDisplayName::K2Node_Select_Default' has a wrong offset!");

// Function FL_jRPG_CustomFunctionLibrary.FL_jRPG_CustomFunctionLibrary_C.GetStanceDisplayName
// 0x0078 (0x0078 - 0x0000)
struct FL_jRPG_CustomFunctionLibrary_C_GetStanceDisplayName final
{
public:
	E_StanceType                                  StanceType;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ReturnParm)
	E_StanceType                                  Temp_byte_Variable;                                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0028(0x0010)()
	class FText                                   Temp_text_Variable_1;                              // 0x0038(0x0010)()
	class FText                                   Temp_text_Variable_2;                              // 0x0048(0x0010)()
	class FText                                   Temp_text_Variable_3;                              // 0x0058(0x0010)()
	class FText                                   K2Node_Select_Default;                             // 0x0068(0x0010)()
};
static_assert(alignof(FL_jRPG_CustomFunctionLibrary_C_GetStanceDisplayName) == 0x000008, "Wrong alignment on FL_jRPG_CustomFunctionLibrary_C_GetStanceDisplayName");
static_assert(sizeof(FL_jRPG_CustomFunctionLibrary_C_GetStanceDisplayName) == 0x000078, "Wrong size on FL_jRPG_CustomFunctionLibrary_C_GetStanceDisplayName");
static_assert(offsetof(FL_jRPG_CustomFunctionLibrary_C_GetStanceDisplayName, StanceType) == 0x000000, "Member 'FL_jRPG_CustomFunctionLibrary_C_GetStanceDisplayName::StanceType' has a wrong offset!");
static_assert(offsetof(FL_jRPG_CustomFunctionLibrary_C_GetStanceDisplayName, __WorldContext) == 0x000008, "Member 'FL_jRPG_CustomFunctionLibrary_C_GetStanceDisplayName::__WorldContext' has a wrong offset!");
static_assert(offsetof(FL_jRPG_CustomFunctionLibrary_C_GetStanceDisplayName, ReturnValue) == 0x000010, "Member 'FL_jRPG_CustomFunctionLibrary_C_GetStanceDisplayName::ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_jRPG_CustomFunctionLibrary_C_GetStanceDisplayName, Temp_byte_Variable) == 0x000020, "Member 'FL_jRPG_CustomFunctionLibrary_C_GetStanceDisplayName::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(FL_jRPG_CustomFunctionLibrary_C_GetStanceDisplayName, Temp_text_Variable) == 0x000028, "Member 'FL_jRPG_CustomFunctionLibrary_C_GetStanceDisplayName::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(FL_jRPG_CustomFunctionLibrary_C_GetStanceDisplayName, Temp_text_Variable_1) == 0x000038, "Member 'FL_jRPG_CustomFunctionLibrary_C_GetStanceDisplayName::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(FL_jRPG_CustomFunctionLibrary_C_GetStanceDisplayName, Temp_text_Variable_2) == 0x000048, "Member 'FL_jRPG_CustomFunctionLibrary_C_GetStanceDisplayName::Temp_text_Variable_2' has a wrong offset!");
static_assert(offsetof(FL_jRPG_CustomFunctionLibrary_C_GetStanceDisplayName, Temp_text_Variable_3) == 0x000058, "Member 'FL_jRPG_CustomFunctionLibrary_C_GetStanceDisplayName::Temp_text_Variable_3' has a wrong offset!");
static_assert(offsetof(FL_jRPG_CustomFunctionLibrary_C_GetStanceDisplayName, K2Node_Select_Default) == 0x000068, "Member 'FL_jRPG_CustomFunctionLibrary_C_GetStanceDisplayName::K2Node_Select_Default' has a wrong offset!");

// Function FL_jRPG_CustomFunctionLibrary.FL_jRPG_CustomFunctionLibrary_C.GetCharacterEnum_FromID
// 0x0098 (0x0098 - 0x0000)
struct FL_jRPG_CustomFunctionLibrary_C_GetCharacterEnum_FromID final
{
public:
	class FName                                   HardcodedName;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	E_Characters                                  ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_NameToText_ReturnValue;              // 0x0018(0x0010)()
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0030(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0078(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Format_ReturnValue;                       // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(FL_jRPG_CustomFunctionLibrary_C_GetCharacterEnum_FromID) == 0x000008, "Wrong alignment on FL_jRPG_CustomFunctionLibrary_C_GetCharacterEnum_FromID");
static_assert(sizeof(FL_jRPG_CustomFunctionLibrary_C_GetCharacterEnum_FromID) == 0x000098, "Wrong size on FL_jRPG_CustomFunctionLibrary_C_GetCharacterEnum_FromID");
static_assert(offsetof(FL_jRPG_CustomFunctionLibrary_C_GetCharacterEnum_FromID, HardcodedName) == 0x000000, "Member 'FL_jRPG_CustomFunctionLibrary_C_GetCharacterEnum_FromID::HardcodedName' has a wrong offset!");
static_assert(offsetof(FL_jRPG_CustomFunctionLibrary_C_GetCharacterEnum_FromID, __WorldContext) == 0x000008, "Member 'FL_jRPG_CustomFunctionLibrary_C_GetCharacterEnum_FromID::__WorldContext' has a wrong offset!");
static_assert(offsetof(FL_jRPG_CustomFunctionLibrary_C_GetCharacterEnum_FromID, ReturnValue) == 0x000010, "Member 'FL_jRPG_CustomFunctionLibrary_C_GetCharacterEnum_FromID::ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_jRPG_CustomFunctionLibrary_C_GetCharacterEnum_FromID, CallFunc_Conv_NameToText_ReturnValue) == 0x000018, "Member 'FL_jRPG_CustomFunctionLibrary_C_GetCharacterEnum_FromID::CallFunc_Conv_NameToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_jRPG_CustomFunctionLibrary_C_GetCharacterEnum_FromID, K2Node_SwitchName_CmpSuccess) == 0x000028, "Member 'FL_jRPG_CustomFunctionLibrary_C_GetCharacterEnum_FromID::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(FL_jRPG_CustomFunctionLibrary_C_GetCharacterEnum_FromID, K2Node_MakeStruct_FormatArgumentData) == 0x000030, "Member 'FL_jRPG_CustomFunctionLibrary_C_GetCharacterEnum_FromID::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(FL_jRPG_CustomFunctionLibrary_C_GetCharacterEnum_FromID, K2Node_MakeArray_Array) == 0x000078, "Member 'FL_jRPG_CustomFunctionLibrary_C_GetCharacterEnum_FromID::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(FL_jRPG_CustomFunctionLibrary_C_GetCharacterEnum_FromID, CallFunc_Format_ReturnValue) == 0x000088, "Member 'FL_jRPG_CustomFunctionLibrary_C_GetCharacterEnum_FromID::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function FL_jRPG_CustomFunctionLibrary.FL_jRPG_CustomFunctionLibrary_C.ShowLootPopupFromGeneratedItem
// 0x0038 (0x0038 - 0x0000)
struct FL_jRPG_CustomFunctionLibrary_C_ShowLootPopupFromGeneratedItem final
{
public:
	const class UBP_GeneratedItemInfo_Base_C*     GeneratedItem;                                     // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UBP_GeneratedItemInfo_Base_C*>   K2Node_MakeArray_Array;                            // 0x0010(0x0010)(ConstParm, ReferenceParm)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_jRPG_Controller_World_C*            K2Node_DynamicCast_AsBP_J_RPG_Controller_World;    // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FL_jRPG_CustomFunctionLibrary_C_ShowLootPopupFromGeneratedItem) == 0x000008, "Wrong alignment on FL_jRPG_CustomFunctionLibrary_C_ShowLootPopupFromGeneratedItem");
static_assert(sizeof(FL_jRPG_CustomFunctionLibrary_C_ShowLootPopupFromGeneratedItem) == 0x000038, "Wrong size on FL_jRPG_CustomFunctionLibrary_C_ShowLootPopupFromGeneratedItem");
static_assert(offsetof(FL_jRPG_CustomFunctionLibrary_C_ShowLootPopupFromGeneratedItem, GeneratedItem) == 0x000000, "Member 'FL_jRPG_CustomFunctionLibrary_C_ShowLootPopupFromGeneratedItem::GeneratedItem' has a wrong offset!");
static_assert(offsetof(FL_jRPG_CustomFunctionLibrary_C_ShowLootPopupFromGeneratedItem, __WorldContext) == 0x000008, "Member 'FL_jRPG_CustomFunctionLibrary_C_ShowLootPopupFromGeneratedItem::__WorldContext' has a wrong offset!");
static_assert(offsetof(FL_jRPG_CustomFunctionLibrary_C_ShowLootPopupFromGeneratedItem, K2Node_MakeArray_Array) == 0x000010, "Member 'FL_jRPG_CustomFunctionLibrary_C_ShowLootPopupFromGeneratedItem::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(FL_jRPG_CustomFunctionLibrary_C_ShowLootPopupFromGeneratedItem, CallFunc_GetPlayerController_ReturnValue) == 0x000020, "Member 'FL_jRPG_CustomFunctionLibrary_C_ShowLootPopupFromGeneratedItem::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_jRPG_CustomFunctionLibrary_C_ShowLootPopupFromGeneratedItem, K2Node_DynamicCast_AsBP_J_RPG_Controller_World) == 0x000028, "Member 'FL_jRPG_CustomFunctionLibrary_C_ShowLootPopupFromGeneratedItem::K2Node_DynamicCast_AsBP_J_RPG_Controller_World' has a wrong offset!");
static_assert(offsetof(FL_jRPG_CustomFunctionLibrary_C_ShowLootPopupFromGeneratedItem, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'FL_jRPG_CustomFunctionLibrary_C_ShowLootPopupFromGeneratedItem::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function FL_jRPG_CustomFunctionLibrary.FL_jRPG_CustomFunctionLibrary_C.ShowLootPopupFromGeneratedItems
// 0x0030 (0x0030 - 0x0000)
struct FL_jRPG_CustomFunctionLibrary_C_ShowLootPopupFromGeneratedItems final
{
public:
	TArray<class UBP_GeneratedItemInfo_Base_C*>   GeneratedItems;                                    // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_jRPG_Controller_World_C*            K2Node_DynamicCast_AsBP_J_RPG_Controller_World;    // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FL_jRPG_CustomFunctionLibrary_C_ShowLootPopupFromGeneratedItems) == 0x000008, "Wrong alignment on FL_jRPG_CustomFunctionLibrary_C_ShowLootPopupFromGeneratedItems");
static_assert(sizeof(FL_jRPG_CustomFunctionLibrary_C_ShowLootPopupFromGeneratedItems) == 0x000030, "Wrong size on FL_jRPG_CustomFunctionLibrary_C_ShowLootPopupFromGeneratedItems");
static_assert(offsetof(FL_jRPG_CustomFunctionLibrary_C_ShowLootPopupFromGeneratedItems, GeneratedItems) == 0x000000, "Member 'FL_jRPG_CustomFunctionLibrary_C_ShowLootPopupFromGeneratedItems::GeneratedItems' has a wrong offset!");
static_assert(offsetof(FL_jRPG_CustomFunctionLibrary_C_ShowLootPopupFromGeneratedItems, __WorldContext) == 0x000010, "Member 'FL_jRPG_CustomFunctionLibrary_C_ShowLootPopupFromGeneratedItems::__WorldContext' has a wrong offset!");
static_assert(offsetof(FL_jRPG_CustomFunctionLibrary_C_ShowLootPopupFromGeneratedItems, CallFunc_GetPlayerController_ReturnValue) == 0x000018, "Member 'FL_jRPG_CustomFunctionLibrary_C_ShowLootPopupFromGeneratedItems::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_jRPG_CustomFunctionLibrary_C_ShowLootPopupFromGeneratedItems, K2Node_DynamicCast_AsBP_J_RPG_Controller_World) == 0x000020, "Member 'FL_jRPG_CustomFunctionLibrary_C_ShowLootPopupFromGeneratedItems::K2Node_DynamicCast_AsBP_J_RPG_Controller_World' has a wrong offset!");
static_assert(offsetof(FL_jRPG_CustomFunctionLibrary_C_ShowLootPopupFromGeneratedItems, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'FL_jRPG_CustomFunctionLibrary_C_ShowLootPopupFromGeneratedItems::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function FL_jRPG_CustomFunctionLibrary.FL_jRPG_CustomFunctionLibrary_C.GetMaximumLevel
// 0x0010 (0x0010 - 0x0000)
struct FL_jRPG_CustomFunctionLibrary_C_GetMaximumLevel final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Level;                                             // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue;               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FL_jRPG_CustomFunctionLibrary_C_GetMaximumLevel) == 0x000008, "Wrong alignment on FL_jRPG_CustomFunctionLibrary_C_GetMaximumLevel");
static_assert(sizeof(FL_jRPG_CustomFunctionLibrary_C_GetMaximumLevel) == 0x000010, "Wrong size on FL_jRPG_CustomFunctionLibrary_C_GetMaximumLevel");
static_assert(offsetof(FL_jRPG_CustomFunctionLibrary_C_GetMaximumLevel, __WorldContext) == 0x000000, "Member 'FL_jRPG_CustomFunctionLibrary_C_GetMaximumLevel::__WorldContext' has a wrong offset!");
static_assert(offsetof(FL_jRPG_CustomFunctionLibrary_C_GetMaximumLevel, Level) == 0x000008, "Member 'FL_jRPG_CustomFunctionLibrary_C_GetMaximumLevel::Level' has a wrong offset!");
static_assert(offsetof(FL_jRPG_CustomFunctionLibrary_C_GetMaximumLevel, CallFunc_MakeLiteralInt_ReturnValue) == 0x00000C, "Member 'FL_jRPG_CustomFunctionLibrary_C_GetMaximumLevel::CallFunc_MakeLiteralInt_ReturnValue' has a wrong offset!");

// Function FL_jRPG_CustomFunctionLibrary.FL_jRPG_CustomFunctionLibrary_C.GetWeaponScalingLevel
// 0x00F8 (0x00F8 - 0x0000)
struct FL_jRPG_CustomFunctionLibrary_C_GetWeaponScalingLevel final
{
public:
	int32                                         Level;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FS_WeaponScalingLevel                  ReturnValue;                                       // 0x0010(0x0020)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_WeaponScalingLevel                  CallFunc_GetDataTableRowFromName_OutRow;           // 0x0058(0x0020)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_NameToText_ReturnValue;              // 0x0080(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0090(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00D8(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Format_ReturnValue;                       // 0x00E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(FL_jRPG_CustomFunctionLibrary_C_GetWeaponScalingLevel) == 0x000008, "Wrong alignment on FL_jRPG_CustomFunctionLibrary_C_GetWeaponScalingLevel");
static_assert(sizeof(FL_jRPG_CustomFunctionLibrary_C_GetWeaponScalingLevel) == 0x0000F8, "Wrong size on FL_jRPG_CustomFunctionLibrary_C_GetWeaponScalingLevel");
static_assert(offsetof(FL_jRPG_CustomFunctionLibrary_C_GetWeaponScalingLevel, Level) == 0x000000, "Member 'FL_jRPG_CustomFunctionLibrary_C_GetWeaponScalingLevel::Level' has a wrong offset!");
static_assert(offsetof(FL_jRPG_CustomFunctionLibrary_C_GetWeaponScalingLevel, __WorldContext) == 0x000008, "Member 'FL_jRPG_CustomFunctionLibrary_C_GetWeaponScalingLevel::__WorldContext' has a wrong offset!");
static_assert(offsetof(FL_jRPG_CustomFunctionLibrary_C_GetWeaponScalingLevel, ReturnValue) == 0x000010, "Member 'FL_jRPG_CustomFunctionLibrary_C_GetWeaponScalingLevel::ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_jRPG_CustomFunctionLibrary_C_GetWeaponScalingLevel, CallFunc_Conv_IntToString_ReturnValue) == 0x000030, "Member 'FL_jRPG_CustomFunctionLibrary_C_GetWeaponScalingLevel::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_jRPG_CustomFunctionLibrary_C_GetWeaponScalingLevel, CallFunc_Concat_StrStr_ReturnValue) == 0x000040, "Member 'FL_jRPG_CustomFunctionLibrary_C_GetWeaponScalingLevel::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_jRPG_CustomFunctionLibrary_C_GetWeaponScalingLevel, CallFunc_Conv_StringToName_ReturnValue) == 0x000050, "Member 'FL_jRPG_CustomFunctionLibrary_C_GetWeaponScalingLevel::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_jRPG_CustomFunctionLibrary_C_GetWeaponScalingLevel, CallFunc_GetDataTableRowFromName_OutRow) == 0x000058, "Member 'FL_jRPG_CustomFunctionLibrary_C_GetWeaponScalingLevel::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(FL_jRPG_CustomFunctionLibrary_C_GetWeaponScalingLevel, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000078, "Member 'FL_jRPG_CustomFunctionLibrary_C_GetWeaponScalingLevel::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_jRPG_CustomFunctionLibrary_C_GetWeaponScalingLevel, CallFunc_Conv_NameToText_ReturnValue) == 0x000080, "Member 'FL_jRPG_CustomFunctionLibrary_C_GetWeaponScalingLevel::CallFunc_Conv_NameToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_jRPG_CustomFunctionLibrary_C_GetWeaponScalingLevel, K2Node_MakeStruct_FormatArgumentData) == 0x000090, "Member 'FL_jRPG_CustomFunctionLibrary_C_GetWeaponScalingLevel::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(FL_jRPG_CustomFunctionLibrary_C_GetWeaponScalingLevel, K2Node_MakeArray_Array) == 0x0000D8, "Member 'FL_jRPG_CustomFunctionLibrary_C_GetWeaponScalingLevel::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(FL_jRPG_CustomFunctionLibrary_C_GetWeaponScalingLevel, CallFunc_Format_ReturnValue) == 0x0000E8, "Member 'FL_jRPG_CustomFunctionLibrary_C_GetWeaponScalingLevel::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function FL_jRPG_CustomFunctionLibrary.FL_jRPG_CustomFunctionLibrary_C.GetEnemyArchetypeAsset
// 0x0270 (0x0270 - 0x0000)
struct FL_jRPG_CustomFunctionLibrary_C_GetEnemyArchetypeAsset final
{
public:
	struct FS_jRPG_Enemy                          EnemyData;                                         // 0x0000(0x0200)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0200(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_DataAsset_EnemyBattleArchetype_C*   ReturnValue;                                       // 0x0208(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash)
	TMap<class UDataTable*, class UBP_DataAsset_EnemyBattleArchetype_C*> K2Node_MakeMap_Map;         // 0x0210(0x0050)(ConstParm)
	class UBP_DataAsset_EnemyBattleArchetype_C*   CallFunc_Map_Find_Value;                           // 0x0260(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0269(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FL_jRPG_CustomFunctionLibrary_C_GetEnemyArchetypeAsset) == 0x000008, "Wrong alignment on FL_jRPG_CustomFunctionLibrary_C_GetEnemyArchetypeAsset");
static_assert(sizeof(FL_jRPG_CustomFunctionLibrary_C_GetEnemyArchetypeAsset) == 0x000270, "Wrong size on FL_jRPG_CustomFunctionLibrary_C_GetEnemyArchetypeAsset");
static_assert(offsetof(FL_jRPG_CustomFunctionLibrary_C_GetEnemyArchetypeAsset, EnemyData) == 0x000000, "Member 'FL_jRPG_CustomFunctionLibrary_C_GetEnemyArchetypeAsset::EnemyData' has a wrong offset!");
static_assert(offsetof(FL_jRPG_CustomFunctionLibrary_C_GetEnemyArchetypeAsset, __WorldContext) == 0x000200, "Member 'FL_jRPG_CustomFunctionLibrary_C_GetEnemyArchetypeAsset::__WorldContext' has a wrong offset!");
static_assert(offsetof(FL_jRPG_CustomFunctionLibrary_C_GetEnemyArchetypeAsset, ReturnValue) == 0x000208, "Member 'FL_jRPG_CustomFunctionLibrary_C_GetEnemyArchetypeAsset::ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_jRPG_CustomFunctionLibrary_C_GetEnemyArchetypeAsset, K2Node_MakeMap_Map) == 0x000210, "Member 'FL_jRPG_CustomFunctionLibrary_C_GetEnemyArchetypeAsset::K2Node_MakeMap_Map' has a wrong offset!");
static_assert(offsetof(FL_jRPG_CustomFunctionLibrary_C_GetEnemyArchetypeAsset, CallFunc_Map_Find_Value) == 0x000260, "Member 'FL_jRPG_CustomFunctionLibrary_C_GetEnemyArchetypeAsset::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(FL_jRPG_CustomFunctionLibrary_C_GetEnemyArchetypeAsset, CallFunc_Map_Find_ReturnValue) == 0x000268, "Member 'FL_jRPG_CustomFunctionLibrary_C_GetEnemyArchetypeAsset::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_jRPG_CustomFunctionLibrary_C_GetEnemyArchetypeAsset, CallFunc_IsValid_ReturnValue) == 0x000269, "Member 'FL_jRPG_CustomFunctionLibrary_C_GetEnemyArchetypeAsset::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function FL_jRPG_CustomFunctionLibrary.FL_jRPG_CustomFunctionLibrary_C.GetDynamicElementOverrideDisplayName
// 0x0068 (0x0068 - 0x0000)
struct FL_jRPG_CustomFunctionLibrary_C_GetDynamicElementOverrideDisplayName final
{
public:
	ESkillElementOverride                         DynamicElementOverride;                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ReturnParm)
	ESkillElementOverride                         Temp_byte_Variable;                                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0028(0x0010)()
	class FText                                   Temp_text_Variable_1;                              // 0x0038(0x0010)()
	class FText                                   Temp_text_Variable_2;                              // 0x0048(0x0010)()
	class FText                                   K2Node_Select_Default;                             // 0x0058(0x0010)()
};
static_assert(alignof(FL_jRPG_CustomFunctionLibrary_C_GetDynamicElementOverrideDisplayName) == 0x000008, "Wrong alignment on FL_jRPG_CustomFunctionLibrary_C_GetDynamicElementOverrideDisplayName");
static_assert(sizeof(FL_jRPG_CustomFunctionLibrary_C_GetDynamicElementOverrideDisplayName) == 0x000068, "Wrong size on FL_jRPG_CustomFunctionLibrary_C_GetDynamicElementOverrideDisplayName");
static_assert(offsetof(FL_jRPG_CustomFunctionLibrary_C_GetDynamicElementOverrideDisplayName, DynamicElementOverride) == 0x000000, "Member 'FL_jRPG_CustomFunctionLibrary_C_GetDynamicElementOverrideDisplayName::DynamicElementOverride' has a wrong offset!");
static_assert(offsetof(FL_jRPG_CustomFunctionLibrary_C_GetDynamicElementOverrideDisplayName, __WorldContext) == 0x000008, "Member 'FL_jRPG_CustomFunctionLibrary_C_GetDynamicElementOverrideDisplayName::__WorldContext' has a wrong offset!");
static_assert(offsetof(FL_jRPG_CustomFunctionLibrary_C_GetDynamicElementOverrideDisplayName, ReturnValue) == 0x000010, "Member 'FL_jRPG_CustomFunctionLibrary_C_GetDynamicElementOverrideDisplayName::ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_jRPG_CustomFunctionLibrary_C_GetDynamicElementOverrideDisplayName, Temp_byte_Variable) == 0x000020, "Member 'FL_jRPG_CustomFunctionLibrary_C_GetDynamicElementOverrideDisplayName::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(FL_jRPG_CustomFunctionLibrary_C_GetDynamicElementOverrideDisplayName, Temp_text_Variable) == 0x000028, "Member 'FL_jRPG_CustomFunctionLibrary_C_GetDynamicElementOverrideDisplayName::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(FL_jRPG_CustomFunctionLibrary_C_GetDynamicElementOverrideDisplayName, Temp_text_Variable_1) == 0x000038, "Member 'FL_jRPG_CustomFunctionLibrary_C_GetDynamicElementOverrideDisplayName::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(FL_jRPG_CustomFunctionLibrary_C_GetDynamicElementOverrideDisplayName, Temp_text_Variable_2) == 0x000048, "Member 'FL_jRPG_CustomFunctionLibrary_C_GetDynamicElementOverrideDisplayName::Temp_text_Variable_2' has a wrong offset!");
static_assert(offsetof(FL_jRPG_CustomFunctionLibrary_C_GetDynamicElementOverrideDisplayName, K2Node_Select_Default) == 0x000058, "Member 'FL_jRPG_CustomFunctionLibrary_C_GetDynamicElementOverrideDisplayName::K2Node_Select_Default' has a wrong offset!");

// Function FL_jRPG_CustomFunctionLibrary.FL_jRPG_CustomFunctionLibrary_C.GetWeaponInstanceFromID
// 0x0128 (0x0128 - 0x0000)
struct FL_jRPG_CustomFunctionLibrary_C_GetWeaponInstanceFromID final
{
public:
	class FName                                   WeaponID;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Found;                                             // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_WeaponInstanceData                  WeaponInstanceData;                                // 0x0018(0x0110)(Parm, OutParm, HasGetValueTypeHash)
};
static_assert(alignof(FL_jRPG_CustomFunctionLibrary_C_GetWeaponInstanceFromID) == 0x000008, "Wrong alignment on FL_jRPG_CustomFunctionLibrary_C_GetWeaponInstanceFromID");
static_assert(sizeof(FL_jRPG_CustomFunctionLibrary_C_GetWeaponInstanceFromID) == 0x000128, "Wrong size on FL_jRPG_CustomFunctionLibrary_C_GetWeaponInstanceFromID");
static_assert(offsetof(FL_jRPG_CustomFunctionLibrary_C_GetWeaponInstanceFromID, WeaponID) == 0x000000, "Member 'FL_jRPG_CustomFunctionLibrary_C_GetWeaponInstanceFromID::WeaponID' has a wrong offset!");
static_assert(offsetof(FL_jRPG_CustomFunctionLibrary_C_GetWeaponInstanceFromID, __WorldContext) == 0x000008, "Member 'FL_jRPG_CustomFunctionLibrary_C_GetWeaponInstanceFromID::__WorldContext' has a wrong offset!");
static_assert(offsetof(FL_jRPG_CustomFunctionLibrary_C_GetWeaponInstanceFromID, Found) == 0x000010, "Member 'FL_jRPG_CustomFunctionLibrary_C_GetWeaponInstanceFromID::Found' has a wrong offset!");
static_assert(offsetof(FL_jRPG_CustomFunctionLibrary_C_GetWeaponInstanceFromID, WeaponInstanceData) == 0x000018, "Member 'FL_jRPG_CustomFunctionLibrary_C_GetWeaponInstanceFromID::WeaponInstanceData' has a wrong offset!");

// Function FL_jRPG_CustomFunctionLibrary.FL_jRPG_CustomFunctionLibrary_C.GetItemID
// 0x0140 (0x0140 - 0x0000)
struct FL_jRPG_CustomFunctionLibrary_C_GetItemID final
{
public:
	struct FS_jRPG_Item_StaticData                ItemStaticData;                                    // 0x0000(0x0130)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0130(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   ItemId;                                            // 0x0138(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FL_jRPG_CustomFunctionLibrary_C_GetItemID) == 0x000008, "Wrong alignment on FL_jRPG_CustomFunctionLibrary_C_GetItemID");
static_assert(sizeof(FL_jRPG_CustomFunctionLibrary_C_GetItemID) == 0x000140, "Wrong size on FL_jRPG_CustomFunctionLibrary_C_GetItemID");
static_assert(offsetof(FL_jRPG_CustomFunctionLibrary_C_GetItemID, ItemStaticData) == 0x000000, "Member 'FL_jRPG_CustomFunctionLibrary_C_GetItemID::ItemStaticData' has a wrong offset!");
static_assert(offsetof(FL_jRPG_CustomFunctionLibrary_C_GetItemID, __WorldContext) == 0x000130, "Member 'FL_jRPG_CustomFunctionLibrary_C_GetItemID::__WorldContext' has a wrong offset!");
static_assert(offsetof(FL_jRPG_CustomFunctionLibrary_C_GetItemID, ItemId) == 0x000138, "Member 'FL_jRPG_CustomFunctionLibrary_C_GetItemID::ItemId' has a wrong offset!");

// Function FL_jRPG_CustomFunctionLibrary.FL_jRPG_CustomFunctionLibrary_C.GetWeaponDefinitionFromItem
// 0x03B0 (0x03B0 - 0x0000)
struct FL_jRPG_CustomFunctionLibrary_C_GetWeaponDefinitionFromItem final
{
public:
	struct FS_jRPG_Item_StaticData                WeaponStaticItem;                                  // 0x0000(0x0130)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0130(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Found;                                             // 0x0138(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_WeaponDefinition                    ReturnValue;                                       // 0x0140(0x00F0)(Parm, OutParm, ReturnParm, HasGetValueTypeHash)
	class FName                                   CallFunc_GetItemID_ItemID;                         // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_NameToText_ReturnValue;              // 0x0238(0x0010)()
	class FName                                   CallFunc_GetItemID_ItemID_1;                       // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
