#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FL_LootSystemHelpers

#include "Basic.hpp"

#include "S_LootContext_structs.hpp"
#include "S_ProgressionBalancingLevel_structs.hpp"
#include "Engine_structs.hpp"
#include "S_LootTableSection_structs.hpp"


namespace SDK::Params
{

// Function FL_LootSystemHelpers.FL_LootSystemHelpers_C.OffsetLootContext
// 0x0020 (0x0020 - 0x0000)
struct FL_LootSystemHelpers_C_OffsetLootContext final
{
public:
	struct FS_LootContext                         LootContext;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Offset;                                            // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FS_LootContext                         OffsetLootContext_0;                               // 0x0010(0x0004)(Parm, OutParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_LootContext                         K2Node_SetFieldsInStruct_StructOut;                // 0x0018(0x0004)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FL_LootSystemHelpers_C_OffsetLootContext) == 0x000008, "Wrong alignment on FL_LootSystemHelpers_C_OffsetLootContext");
static_assert(sizeof(FL_LootSystemHelpers_C_OffsetLootContext) == 0x000020, "Wrong size on FL_LootSystemHelpers_C_OffsetLootContext");
static_assert(offsetof(FL_LootSystemHelpers_C_OffsetLootContext, LootContext) == 0x000000, "Member 'FL_LootSystemHelpers_C_OffsetLootContext::LootContext' has a wrong offset!");
static_assert(offsetof(FL_LootSystemHelpers_C_OffsetLootContext, Offset) == 0x000004, "Member 'FL_LootSystemHelpers_C_OffsetLootContext::Offset' has a wrong offset!");
static_assert(offsetof(FL_LootSystemHelpers_C_OffsetLootContext, __WorldContext) == 0x000008, "Member 'FL_LootSystemHelpers_C_OffsetLootContext::__WorldContext' has a wrong offset!");
static_assert(offsetof(FL_LootSystemHelpers_C_OffsetLootContext, OffsetLootContext_0) == 0x000010, "Member 'FL_LootSystemHelpers_C_OffsetLootContext::OffsetLootContext_0' has a wrong offset!");
static_assert(offsetof(FL_LootSystemHelpers_C_OffsetLootContext, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'FL_LootSystemHelpers_C_OffsetLootContext::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_LootSystemHelpers_C_OffsetLootContext, K2Node_SetFieldsInStruct_StructOut) == 0x000018, "Member 'FL_LootSystemHelpers_C_OffsetLootContext::K2Node_SetFieldsInStruct_StructOut' has a wrong offset!");

// Function FL_LootSystemHelpers.FL_LootSystemHelpers_C.FindProgressionBalancingLevelRow
// 0x0108 (0x0108 - 0x0000)
struct FL_LootSystemHelpers_C_FindProgressionBalancingLevelRow final
{
public:
	int32                                         EncounterLevel;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FS_ProgressionBalancingLevel           ProgressionBalancingLevel;                         // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0030(0x0048)(HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0088(0x0048)(HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00D8(0x0010)(ReferenceParm)
	struct FS_ProgressionBalancingLevel           CallFunc_GetDataTableRowFromName_OutRow;           // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Format_ReturnValue;                       // 0x00F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(FL_LootSystemHelpers_C_FindProgressionBalancingLevelRow) == 0x000008, "Wrong alignment on FL_LootSystemHelpers_C_FindProgressionBalancingLevelRow");
static_assert(sizeof(FL_LootSystemHelpers_C_FindProgressionBalancingLevelRow) == 0x000108, "Wrong size on FL_LootSystemHelpers_C_FindProgressionBalancingLevelRow");
static_assert(offsetof(FL_LootSystemHelpers_C_FindProgressionBalancingLevelRow, EncounterLevel) == 0x000000, "Member 'FL_LootSystemHelpers_C_FindProgressionBalancingLevelRow::EncounterLevel' has a wrong offset!");
static_assert(offsetof(FL_LootSystemHelpers_C_FindProgressionBalancingLevelRow, __WorldContext) == 0x000008, "Member 'FL_LootSystemHelpers_C_FindProgressionBalancingLevelRow::__WorldContext' has a wrong offset!");
static_assert(offsetof(FL_LootSystemHelpers_C_FindProgressionBalancingLevelRow, ProgressionBalancingLevel) == 0x000010, "Member 'FL_LootSystemHelpers_C_FindProgressionBalancingLevelRow::ProgressionBalancingLevel' has a wrong offset!");
static_assert(offsetof(FL_LootSystemHelpers_C_FindProgressionBalancingLevelRow, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000018, "Member 'FL_LootSystemHelpers_C_FindProgressionBalancingLevelRow::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_LootSystemHelpers_C_FindProgressionBalancingLevelRow, CallFunc_Conv_IntToString_ReturnValue) == 0x000020, "Member 'FL_LootSystemHelpers_C_FindProgressionBalancingLevelRow::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_LootSystemHelpers_C_FindProgressionBalancingLevelRow, K2Node_MakeStruct_FormatArgumentData) == 0x000030, "Member 'FL_LootSystemHelpers_C_FindProgressionBalancingLevelRow::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(FL_LootSystemHelpers_C_FindProgressionBalancingLevelRow, CallFunc_Concat_StrStr_ReturnValue) == 0x000078, "Member 'FL_LootSystemHelpers_C_FindProgressionBalancingLevelRow::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_LootSystemHelpers_C_FindProgressionBalancingLevelRow, K2Node_MakeStruct_FormatArgumentData_1) == 0x000088, "Member 'FL_LootSystemHelpers_C_FindProgressionBalancingLevelRow::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(FL_LootSystemHelpers_C_FindProgressionBalancingLevelRow, CallFunc_Conv_StringToName_ReturnValue) == 0x0000D0, "Member 'FL_LootSystemHelpers_C_FindProgressionBalancingLevelRow::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_LootSystemHelpers_C_FindProgressionBalancingLevelRow, K2Node_MakeArray_Array) == 0x0000D8, "Member 'FL_LootSystemHelpers_C_FindProgressionBalancingLevelRow::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(FL_LootSystemHelpers_C_FindProgressionBalancingLevelRow, CallFunc_GetDataTableRowFromName_OutRow) == 0x0000E8, "Member 'FL_LootSystemHelpers_C_FindProgressionBalancingLevelRow::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(FL_LootSystemHelpers_C_FindProgressionBalancingLevelRow, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x0000F0, "Member 'FL_LootSystemHelpers_C_FindProgressionBalancingLevelRow::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_LootSystemHelpers_C_FindProgressionBalancingLevelRow, CallFunc_Format_ReturnValue) == 0x0000F8, "Member 'FL_LootSystemHelpers_C_FindProgressionBalancingLevelRow::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function FL_LootSystemHelpers.FL_LootSystemHelpers_C.GetLootSystem
// 0x0020 (0x0020 - 0x0000)
struct FL_LootSystemHelpers_C_GetLootSystem final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_LootSystemComponent_C*              ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_LootSystemComponent_C*              CallFunc_GetComponentByClass_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FL_LootSystemHelpers_C_GetLootSystem) == 0x000008, "Wrong alignment on FL_LootSystemHelpers_C_GetLootSystem");
static_assert(sizeof(FL_LootSystemHelpers_C_GetLootSystem) == 0x000020, "Wrong size on FL_LootSystemHelpers_C_GetLootSystem");
static_assert(offsetof(FL_LootSystemHelpers_C_GetLootSystem, __WorldContext) == 0x000000, "Member 'FL_LootSystemHelpers_C_GetLootSystem::__WorldContext' has a wrong offset!");
static_assert(offsetof(FL_LootSystemHelpers_C_GetLootSystem, ReturnValue) == 0x000008, "Member 'FL_LootSystemHelpers_C_GetLootSystem::ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_LootSystemHelpers_C_GetLootSystem, CallFunc_GetPlayerController_ReturnValue) == 0x000010, "Member 'FL_LootSystemHelpers_C_GetLootSystem::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_LootSystemHelpers_C_GetLootSystem, CallFunc_GetComponentByClass_ReturnValue) == 0x000018, "Member 'FL_LootSystemHelpers_C_GetLootSystem::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");

// Function FL_LootSystemHelpers.FL_LootSystemHelpers_C.LootSectionToString
// 0x0198 (0x0198 - 0x0000)
struct FL_LootSystemHelpers_C_LootSectionToString final
{
public:
	struct FS_LootTableSection                    LootSection;                                       // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 Result;                                            // 0x0028(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0048(0x0048)(HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue_1;            // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0098(0x0048)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x00E0(0x0048)(HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue_2;            // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x0130(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0178(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Format_ReturnValue;                       // 0x0188(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(FL_LootSystemHelpers_C_LootSectionToString) == 0x000008, "Wrong alignment on FL_LootSystemHelpers_C_LootSectionToString");
static_assert(sizeof(FL_LootSystemHelpers_C_LootSectionToString) == 0x000198, "Wrong size on FL_LootSystemHelpers_C_LootSectionToString");
static_assert(offsetof(FL_LootSystemHelpers_C_LootSectionToString, LootSection) == 0x000000, "Member 'FL_LootSystemHelpers_C_LootSectionToString::LootSection' has a wrong offset!");
static_assert(offsetof(FL_LootSystemHelpers_C_LootSectionToString, __WorldContext) == 0x000020, "Member 'FL_LootSystemHelpers_C_LootSectionToString::__WorldContext' has a wrong offset!");
static_assert(offsetof(FL_LootSystemHelpers_C_LootSectionToString, Result) == 0x000028, "Member 'FL_LootSystemHelpers_C_LootSectionToString::Result' has a wrong offset!");
static_assert(offsetof(FL_LootSystemHelpers_C_LootSectionToString, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000038, "Member 'FL_LootSystemHelpers_C_LootSectionToString::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_LootSystemHelpers_C_LootSectionToString, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'FL_LootSystemHelpers_C_LootSectionToString::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_LootSystemHelpers_C_LootSectionToString, K2Node_MakeStruct_FormatArgumentData) == 0x000048, "Member 'FL_LootSystemHelpers_C_LootSectionToString::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(FL_LootSystemHelpers_C_LootSectionToString, CallFunc_Conv_IntToInt64_ReturnValue_1) == 0x000090, "Member 'FL_LootSystemHelpers_C_LootSectionToString::CallFunc_Conv_IntToInt64_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FL_LootSystemHelpers_C_LootSectionToString, K2Node_MakeStruct_FormatArgumentData_1) == 0x000098, "Member 'FL_LootSystemHelpers_C_LootSectionToString::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(FL_LootSystemHelpers_C_LootSectionToString, K2Node_MakeStruct_FormatArgumentData_2) == 0x0000E0, "Member 'FL_LootSystemHelpers_C_LootSectionToString::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(FL_LootSystemHelpers_C_LootSectionToString, CallFunc_Conv_IntToInt64_ReturnValue_2) == 0x000128, "Member 'FL_LootSystemHelpers_C_LootSectionToString::CallFunc_Conv_IntToInt64_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(FL_LootSystemHelpers_C_LootSectionToString, K2Node_MakeStruct_FormatArgumentData_3) == 0x000130, "Member 'FL_LootSystemHelpers_C_LootSectionToString::K2Node_MakeStruct_FormatArgumentData_3' has a wrong offset!");
static_assert(offsetof(FL_LootSystemHelpers_C_LootSectionToString, K2Node_MakeArray_Array) == 0x000178, "Member 'FL_LootSystemHelpers_C_LootSectionToString::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(FL_LootSystemHelpers_C_LootSectionToString, CallFunc_Format_ReturnValue) == 0x000188, "Member 'FL_LootSystemHelpers_C_LootSectionToString::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function FL_LootSystemHelpers.FL_LootSystemHelpers_C.LootContextToString
// 0x0090 (0x0090 - 0x0000)
struct FL_LootSystemHelpers_C_LootContextToString final
{
public:
	struct FS_LootContext                         LootContext;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 Result;                                            // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0028(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0070(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Format_ReturnValue;                       // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(FL_LootSystemHelpers_C_LootContextToString) == 0x000008, "Wrong alignment on FL_LootSystemHelpers_C_LootContextToString");
static_assert(sizeof(FL_LootSystemHelpers_C_LootContextToString) == 0x000090, "Wrong size on FL_LootSystemHelpers_C_LootContextToString");
static_assert(offsetof(FL_LootSystemHelpers_C_LootContextToString, LootContext) == 0x000000, "Member 'FL_LootSystemHelpers_C_LootContextToString::LootContext' has a wrong offset!");
static_assert(offsetof(FL_LootSystemHelpers_C_LootContextToString, __WorldContext) == 0x000008, "Member 'FL_LootSystemHelpers_C_LootContextToString::__WorldContext' has a wrong offset!");
static_assert(offsetof(FL_LootSystemHelpers_C_LootContextToString, Result) == 0x000010, "Member 'FL_LootSystemHelpers_C_LootContextToString::Result' has a wrong offset!");
static_assert(offsetof(FL_LootSystemHelpers_C_LootContextToString, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000020, "Member 'FL_LootSystemHelpers_C_LootContextToString::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_LootSystemHelpers_C_LootContextToString, K2Node_MakeStruct_FormatArgumentData) == 0x000028, "Member 'FL_LootSystemHelpers_C_LootContextToString::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(FL_LootSystemHelpers_C_LootContextToString, K2Node_MakeArray_Array) == 0x000070, "Member 'FL_LootSystemHelpers_C_LootContextToString::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(FL_LootSystemHelpers_C_LootContextToString, CallFunc_Format_ReturnValue) == 0x000080, "Member 'FL_LootSystemHelpers_C_LootContextToString::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function FL_LootSystemHelpers.FL_LootSystemHelpers_C.IsLootContextValid
// 0x0018 (0x0018 - 0x0000)
struct FL_LootSystemHelpers_C_IsLootContextValid final
{
public:
	struct FS_LootContext                         LootContext;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FL_LootSystemHelpers_C_IsLootContextValid) == 0x000008, "Wrong alignment on FL_LootSystemHelpers_C_IsLootContextValid");
static_assert(sizeof(FL_LootSystemHelpers_C_IsLootContextValid) == 0x000018, "Wrong size on FL_LootSystemHelpers_C_IsLootContextValid");
static_assert(offsetof(FL_LootSystemHelpers_C_IsLootContextValid, LootContext) == 0x000000, "Member 'FL_LootSystemHelpers_C_IsLootContextValid::LootContext' has a wrong offset!");
static_assert(offsetof(FL_LootSystemHelpers_C_IsLootContextValid, __WorldContext) == 0x000008, "Member 'FL_LootSystemHelpers_C_IsLootContextValid::__WorldContext' has a wrong offset!");
static_assert(offsetof(FL_LootSystemHelpers_C_IsLootContextValid, ReturnValue) == 0x000010, "Member 'FL_LootSystemHelpers_C_IsLootContextValid::ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_LootSystemHelpers_C_IsLootContextValid, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000011, "Member 'FL_LootSystemHelpers_C_IsLootContextValid::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");

// Function FL_LootSystemHelpers.FL_LootSystemHelpers_C.GetItemLevelFromLootContext
// 0x0040 (0x0040 - 0x0000)
struct FL_LootSystemHelpers_C_GetItemLevelFromLootContext final
{
public:
	struct FS_LootContext                         S_LootContext;                                     // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_MakeLiteralDouble_ReturnValue;            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetGearMaxUpgradeLevel_ReturnValue;       // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FCeil_ReturnValue;                        // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue;                        // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FL_LootSystemHelpers_C_GetItemLevelFromLootContext) == 0x000008, "Wrong alignment on FL_LootSystemHelpers_C_GetItemLevelFromLootContext");
static_assert(sizeof(FL_LootSystemHelpers_C_GetItemLevelFromLootContext) == 0x000040, "Wrong size on FL_LootSystemHelpers_C_GetItemLevelFromLootContext");
static_assert(offsetof(FL_LootSystemHelpers_C_GetItemLevelFromLootContext, S_LootContext) == 0x000000, "Member 'FL_LootSystemHelpers_C_GetItemLevelFromLootContext::S_LootContext' has a wrong offset!");
static_assert(offsetof(FL_LootSystemHelpers_C_GetItemLevelFromLootContext, __WorldContext) == 0x000008, "Member 'FL_LootSystemHelpers_C_GetItemLevelFromLootContext::__WorldContext' has a wrong offset!");
static_assert(offsetof(FL_LootSystemHelpers_C_GetItemLevelFromLootContext, ReturnValue) == 0x000010, "Member 'FL_LootSystemHelpers_C_GetItemLevelFromLootContext::ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_LootSystemHelpers_C_GetItemLevelFromLootContext, CallFunc_MakeLiteralDouble_ReturnValue) == 0x000018, "Member 'FL_LootSystemHelpers_C_GetItemLevelFromLootContext::CallFunc_MakeLiteralDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_LootSystemHelpers_C_GetItemLevelFromLootContext, CallFunc_GetGearMaxUpgradeLevel_ReturnValue) == 0x000020, "Member 'FL_LootSystemHelpers_C_GetItemLevelFromLootContext::CallFunc_GetGearMaxUpgradeLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_LootSystemHelpers_C_GetItemLevelFromLootContext, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000028, "Member 'FL_LootSystemHelpers_C_GetItemLevelFromLootContext::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_LootSystemHelpers_C_GetItemLevelFromLootContext, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000030, "Member 'FL_LootSystemHelpers_C_GetItemLevelFromLootContext::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_LootSystemHelpers_C_GetItemLevelFromLootContext, CallFunc_FCeil_ReturnValue) == 0x000038, "Member 'FL_LootSystemHelpers_C_GetItemLevelFromLootContext::CallFunc_FCeil_ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_LootSystemHelpers_C_GetItemLevelFromLootContext, CallFunc_Clamp_ReturnValue) == 0x00003C, "Member 'FL_LootSystemHelpers_C_GetItemLevelFromLootContext::CallFunc_Clamp_ReturnValue' has a wrong offset!");

}

