#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FL_StatusEffectsHelpers

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "E_StatusEffects_structs.hpp"


namespace SDK::Params
{

// Function FL_StatusEffectsHelpers.FL_StatusEffectsHelpers_C.GetStatusEffectBuffClassSoft
// 0x0430 (0x0430 - 0x0000)
struct FL_StatusEffectsHelpers_C_GetStatusEffectBuffClassSoft final
{
public:
	E_StatusEffects                               StatusEffect;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   BP_Class;                                          // 0x0010(0x0028)(Parm, OutParm, HasGetValueTypeHash)
	E_StatusEffects                               Temp_byte_Variable;                                // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftClassPtr<class UClass>                   Temp_softclass_Variable;                           // 0x0040(0x0028)(HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   Temp_softclass_Variable_1;                         // 0x0068(0x0028)(HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   Temp_softclass_Variable_2;                         // 0x0090(0x0028)(HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   Temp_softclass_Variable_3;                         // 0x00B8(0x0028)(HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   Temp_softclass_Variable_4;                         // 0x00E0(0x0028)(HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   Temp_softclass_Variable_5;                         // 0x0108(0x0028)(HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   Temp_softclass_Variable_6;                         // 0x0130(0x0028)(HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   Temp_softclass_Variable_7;                         // 0x0158(0x0028)(HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   Temp_softclass_Variable_8;                         // 0x0180(0x0028)(HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   Temp_softclass_Variable_9;                         // 0x01A8(0x0028)(HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   Temp_softclass_Variable_10;                        // 0x01D0(0x0028)(HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   Temp_softclass_Variable_11;                        // 0x01F8(0x0028)(HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   Temp_softclass_Variable_12;                        // 0x0220(0x0028)(HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   Temp_softclass_Variable_13;                        // 0x0248(0x0028)(HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   Temp_softclass_Variable_14;                        // 0x0270(0x0028)(HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   Temp_softclass_Variable_15;                        // 0x0298(0x0028)(HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   Temp_softclass_Variable_16;                        // 0x02C0(0x0028)(HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   Temp_softclass_Variable_17;                        // 0x02E8(0x0028)(HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   Temp_softclass_Variable_18;                        // 0x0310(0x0028)(HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   Temp_softclass_Variable_19;                        // 0x0338(0x0028)(HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   Temp_softclass_Variable_20;                        // 0x0360(0x0028)(HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   Temp_softclass_Variable_21;                        // 0x0388(0x0028)(HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   Temp_softclass_Variable_22;                        // 0x03B0(0x0028)(HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   Temp_softclass_Variable_23;                        // 0x03D8(0x0028)(HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   K2Node_Select_Default;                             // 0x0400(0x0028)(HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftClassReference_ReturnValue;    // 0x0428(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FL_StatusEffectsHelpers_C_GetStatusEffectBuffClassSoft) == 0x000008, "Wrong alignment on FL_StatusEffectsHelpers_C_GetStatusEffectBuffClassSoft");
static_assert(sizeof(FL_StatusEffectsHelpers_C_GetStatusEffectBuffClassSoft) == 0x000430, "Wrong size on FL_StatusEffectsHelpers_C_GetStatusEffectBuffClassSoft");
static_assert(offsetof(FL_StatusEffectsHelpers_C_GetStatusEffectBuffClassSoft, StatusEffect) == 0x000000, "Member 'FL_StatusEffectsHelpers_C_GetStatusEffectBuffClassSoft::StatusEffect' has a wrong offset!");
static_assert(offsetof(FL_StatusEffectsHelpers_C_GetStatusEffectBuffClassSoft, __WorldContext) == 0x000008, "Member 'FL_StatusEffectsHelpers_C_GetStatusEffectBuffClassSoft::__WorldContext' has a wrong offset!");
static_assert(offsetof(FL_StatusEffectsHelpers_C_GetStatusEffectBuffClassSoft, BP_Class) == 0x000010, "Member 'FL_StatusEffectsHelpers_C_GetStatusEffectBuffClassSoft::BP_Class' has a wrong offset!");
static_assert(offsetof(FL_StatusEffectsHelpers_C_GetStatusEffectBuffClassSoft, Temp_byte_Variable) == 0x000038, "Member 'FL_StatusEffectsHelpers_C_GetStatusEffectBuffClassSoft::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(FL_StatusEffectsHelpers_C_GetStatusEffectBuffClassSoft, Temp_softclass_Variable) == 0x000040, "Member 'FL_StatusEffectsHelpers_C_GetStatusEffectBuffClassSoft::Temp_softclass_Variable' has a wrong offset!");
static_assert(offsetof(FL_StatusEffectsHelpers_C_GetStatusEffectBuffClassSoft, Temp_softclass_Variable_1) == 0x000068, "Member 'FL_StatusEffectsHelpers_C_GetStatusEffectBuffClassSoft::Temp_softclass_Variable_1' has a wrong offset!");
static_assert(offsetof(FL_StatusEffectsHelpers_C_GetStatusEffectBuffClassSoft, Temp_softclass_Variable_2) == 0x000090, "Member 'FL_StatusEffectsHelpers_C_GetStatusEffectBuffClassSoft::Temp_softclass_Variable_2' has a wrong offset!");
static_assert(offsetof(FL_StatusEffectsHelpers_C_GetStatusEffectBuffClassSoft, Temp_softclass_Variable_3) == 0x0000B8, "Member 'FL_StatusEffectsHelpers_C_GetStatusEffectBuffClassSoft::Temp_softclass_Variable_3' has a wrong offset!");
static_assert(offsetof(FL_StatusEffectsHelpers_C_GetStatusEffectBuffClassSoft, Temp_softclass_Variable_4) == 0x0000E0, "Member 'FL_StatusEffectsHelpers_C_GetStatusEffectBuffClassSoft::Temp_softclass_Variable_4' has a wrong offset!");
static_assert(offsetof(FL_StatusEffectsHelpers_C_GetStatusEffectBuffClassSoft, Temp_softclass_Variable_5) == 0x000108, "Member 'FL_StatusEffectsHelpers_C_GetStatusEffectBuffClassSoft::Temp_softclass_Variable_5' has a wrong offset!");
static_assert(offsetof(FL_StatusEffectsHelpers_C_GetStatusEffectBuffClassSoft, Temp_softclass_Variable_6) == 0x000130, "Member 'FL_StatusEffectsHelpers_C_GetStatusEffectBuffClassSoft::Temp_softclass_Variable_6' has a wrong offset!");
static_assert(offsetof(FL_StatusEffectsHelpers_C_GetStatusEffectBuffClassSoft, Temp_softclass_Variable_7) == 0x000158, "Member 'FL_StatusEffectsHelpers_C_GetStatusEffectBuffClassSoft::Temp_softclass_Variable_7' has a wrong offset!");
static_assert(offsetof(FL_StatusEffectsHelpers_C_GetStatusEffectBuffClassSoft, Temp_softclass_Variable_8) == 0x000180, "Member 'FL_StatusEffectsHelpers_C_GetStatusEffectBuffClassSoft::Temp_softclass_Variable_8' has a wrong offset!");
static_assert(offsetof(FL_StatusEffectsHelpers_C_GetStatusEffectBuffClassSoft, Temp_softclass_Variable_9) == 0x0001A8, "Member 'FL_StatusEffectsHelpers_C_GetStatusEffectBuffClassSoft::Temp_softclass_Variable_9' has a wrong offset!");
static_assert(offsetof(FL_StatusEffectsHelpers_C_GetStatusEffectBuffClassSoft, Temp_softclass_Variable_10) == 0x0001D0, "Member 'FL_StatusEffectsHelpers_C_GetStatusEffectBuffClassSoft::Temp_softclass_Variable_10' has a wrong offset!");
static_assert(offsetof(FL_StatusEffectsHelpers_C_GetStatusEffectBuffClassSoft, Temp_softclass_Variable_11) == 0x0001F8, "Member 'FL_StatusEffectsHelpers_C_GetStatusEffectBuffClassSoft::Temp_softclass_Variable_11' has a wrong offset!");
static_assert(offsetof(FL_StatusEffectsHelpers_C_GetStatusEffectBuffClassSoft, Temp_softclass_Variable_12) == 0x000220, "Member 'FL_StatusEffectsHelpers_C_GetStatusEffectBuffClassSoft::Temp_softclass_Variable_12' has a wrong offset!");
static_assert(offsetof(FL_StatusEffectsHelpers_C_GetStatusEffectBuffClassSoft, Temp_softclass_Variable_13) == 0x000248, "Member 'FL_StatusEffectsHelpers_C_GetStatusEffectBuffClassSoft::Temp_softclass_Variable_13' has a wrong offset!");
static_assert(offsetof(FL_StatusEffectsHelpers_C_GetStatusEffectBuffClassSoft, Temp_softclass_Variable_14) == 0x000270, "Member 'FL_StatusEffectsHelpers_C_GetStatusEffectBuffClassSoft::Temp_softclass_Variable_14' has a wrong offset!");
static_assert(offsetof(FL_StatusEffectsHelpers_C_GetStatusEffectBuffClassSoft, Temp_softclass_Variable_15) == 0x000298, "Member 'FL_StatusEffectsHelpers_C_GetStatusEffectBuffClassSoft::Temp_softclass_Variable_15' has a wrong offset!");
static_assert(offsetof(FL_StatusEffectsHelpers_C_GetStatusEffectBuffClassSoft, Temp_softclass_Variable_16) == 0x0002C0, "Member 'FL_StatusEffectsHelpers_C_GetStatusEffectBuffClassSoft::Temp_softclass_Variable_16' has a wrong offset!");
static_assert(offsetof(FL_StatusEffectsHelpers_C_GetStatusEffectBuffClassSoft, Temp_softclass_Variable_17) == 0x0002E8, "Member 'FL_StatusEffectsHelpers_C_GetStatusEffectBuffClassSoft::Temp_softclass_Variable_17' has a wrong offset!");
static_assert(offsetof(FL_StatusEffectsHelpers_C_GetStatusEffectBuffClassSoft, Temp_softclass_Variable_18) == 0x000310, "Member 'FL_StatusEffectsHelpers_C_GetStatusEffectBuffClassSoft::Temp_softclass_Variable_18' has a wrong offset!");
static_assert(offsetof(FL_StatusEffectsHelpers_C_GetStatusEffectBuffClassSoft, Temp_softclass_Variable_19) == 0x000338, "Member 'FL_StatusEffectsHelpers_C_GetStatusEffectBuffClassSoft::Temp_softclass_Variable_19' has a wrong offset!");
static_assert(offsetof(FL_StatusEffectsHelpers_C_GetStatusEffectBuffClassSoft, Temp_softclass_Variable_20) == 0x000360, "Member 'FL_StatusEffectsHelpers_C_GetStatusEffectBuffClassSoft::Temp_softclass_Variable_20' has a wrong offset!");
static_assert(offsetof(FL_StatusEffectsHelpers_C_GetStatusEffectBuffClassSoft, Temp_softclass_Variable_21) == 0x000388, "Member 'FL_StatusEffectsHelpers_C_GetStatusEffectBuffClassSoft::Temp_softclass_Variable_21' has a wrong offset!");
static_assert(offsetof(FL_StatusEffectsHelpers_C_GetStatusEffectBuffClassSoft, Temp_softclass_Variable_22) == 0x0003B0, "Member 'FL_StatusEffectsHelpers_C_GetStatusEffectBuffClassSoft::Temp_softclass_Variable_22' has a wrong offset!");
static_assert(offsetof(FL_StatusEffectsHelpers_C_GetStatusEffectBuffClassSoft, Temp_softclass_Variable_23) == 0x0003D8, "Member 'FL_StatusEffectsHelpers_C_GetStatusEffectBuffClassSoft::Temp_softclass_Variable_23' has a wrong offset!");
static_assert(offsetof(FL_StatusEffectsHelpers_C_GetStatusEffectBuffClassSoft, K2Node_Select_Default) == 0x000400, "Member 'FL_StatusEffectsHelpers_C_GetStatusEffectBuffClassSoft::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(FL_StatusEffectsHelpers_C_GetStatusEffectBuffClassSoft, CallFunc_IsValidSoftClassReference_ReturnValue) == 0x000428, "Member 'FL_StatusEffectsHelpers_C_GetStatusEffectBuffClassSoft::CallFunc_IsValidSoftClassReference_ReturnValue' has a wrong offset!");

// Function FL_StatusEffectsHelpers.FL_StatusEffectsHelpers_C.GetStatusEffectBuffClass
// 0x00E8 (0x00E8 - 0x0000)
struct FL_StatusEffectsHelpers_C_GetStatusEffectBuffClass final
{
public:
	E_StatusEffects                               Index_0;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 BP_Class;                                          // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   CallFunc_GetStatusEffectBuffClassSoft_BP_Class;    // 0x0028(0x0028)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0050(0x0010)()
	TSubclassOf<class UObject>                    CallFunc_Conv_SoftClassReferenceToClass_ReturnValue; // 0x0060(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0068(0x0048)(HasGetValueTypeHash)
	class UClass*                                 K2Node_ClassDynamicCast_AsBP_Battle_Buff_Instance; // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00C0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00D0(0x0010)()
	bool                                          CallFunc_IsValidSoftClassReference_ReturnValue;    // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FL_StatusEffectsHelpers_C_GetStatusEffectBuffClass) == 0x000008, "Wrong alignment on FL_StatusEffectsHelpers_C_GetStatusEffectBuffClass");
static_assert(sizeof(FL_StatusEffectsHelpers_C_GetStatusEffectBuffClass) == 0x0000E8, "Wrong size on FL_StatusEffectsHelpers_C_GetStatusEffectBuffClass");
static_assert(offsetof(FL_StatusEffectsHelpers_C_GetStatusEffectBuffClass, Index_0) == 0x000000, "Member 'FL_StatusEffectsHelpers_C_GetStatusEffectBuffClass::Index_0' has a wrong offset!");
static_assert(offsetof(FL_StatusEffectsHelpers_C_GetStatusEffectBuffClass, __WorldContext) == 0x000008, "Member 'FL_StatusEffectsHelpers_C_GetStatusEffectBuffClass::__WorldContext' has a wrong offset!");
static_assert(offsetof(FL_StatusEffectsHelpers_C_GetStatusEffectBuffClass, BP_Class) == 0x000010, "Member 'FL_StatusEffectsHelpers_C_GetStatusEffectBuffClass::BP_Class' has a wrong offset!");
static_assert(offsetof(FL_StatusEffectsHelpers_C_GetStatusEffectBuffClass, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x000018, "Member 'FL_StatusEffectsHelpers_C_GetStatusEffectBuffClass::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_StatusEffectsHelpers_C_GetStatusEffectBuffClass, CallFunc_GetStatusEffectBuffClassSoft_BP_Class) == 0x000028, "Member 'FL_StatusEffectsHelpers_C_GetStatusEffectBuffClass::CallFunc_GetStatusEffectBuffClassSoft_BP_Class' has a wrong offset!");
static_assert(offsetof(FL_StatusEffectsHelpers_C_GetStatusEffectBuffClass, CallFunc_Conv_StringToText_ReturnValue) == 0x000050, "Member 'FL_StatusEffectsHelpers_C_GetStatusEffectBuffClass::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_StatusEffectsHelpers_C_GetStatusEffectBuffClass, CallFunc_Conv_SoftClassReferenceToClass_ReturnValue) == 0x000060, "Member 'FL_StatusEffectsHelpers_C_GetStatusEffectBuffClass::CallFunc_Conv_SoftClassReferenceToClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_StatusEffectsHelpers_C_GetStatusEffectBuffClass, K2Node_MakeStruct_FormatArgumentData) == 0x000068, "Member 'FL_StatusEffectsHelpers_C_GetStatusEffectBuffClass::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(FL_StatusEffectsHelpers_C_GetStatusEffectBuffClass, K2Node_ClassDynamicCast_AsBP_Battle_Buff_Instance) == 0x0000B0, "Member 'FL_StatusEffectsHelpers_C_GetStatusEffectBuffClass::K2Node_ClassDynamicCast_AsBP_Battle_Buff_Instance' has a wrong offset!");
static_assert(offsetof(FL_StatusEffectsHelpers_C_GetStatusEffectBuffClass, K2Node_ClassDynamicCast_bSuccess) == 0x0000B8, "Member 'FL_StatusEffectsHelpers_C_GetStatusEffectBuffClass::K2Node_ClassDynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(FL_StatusEffectsHelpers_C_GetStatusEffectBuffClass, K2Node_MakeArray_Array) == 0x0000C0, "Member 'FL_StatusEffectsHelpers_C_GetStatusEffectBuffClass::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(FL_StatusEffectsHelpers_C_GetStatusEffectBuffClass, CallFunc_Format_ReturnValue) == 0x0000D0, "Member 'FL_StatusEffectsHelpers_C_GetStatusEffectBuffClass::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_StatusEffectsHelpers_C_GetStatusEffectBuffClass, CallFunc_IsValidSoftClassReference_ReturnValue) == 0x0000E0, "Member 'FL_StatusEffectsHelpers_C_GetStatusEffectBuffClass::CallFunc_IsValidSoftClassReference_ReturnValue' has a wrong offset!");

}

