#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FL_ToastNotificationHelpers

#include "Basic.hpp"

#include "EToastNotificationTheme_structs.hpp"


namespace SDK::Params
{

// Function FL_ToastNotificationHelpers.FL_ToastNotificationHelpers_C.ShowToastNotificationOnWidget
// 0x0030 (0x0030 - 0x0000)
struct FL_ToastNotificationHelpers_C_ShowToastNotificationOnWidget final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
	EToastNotificationTheme                       Theme;                                             // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            Widget;                                            // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_ToastCardFullscreenContainer_C*    CallFunc_SpawnObject_ReturnValue;                  // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FL_ToastNotificationHelpers_C_ShowToastNotificationOnWidget) == 0x000008, "Wrong alignment on FL_ToastNotificationHelpers_C_ShowToastNotificationOnWidget");
static_assert(sizeof(FL_ToastNotificationHelpers_C_ShowToastNotificationOnWidget) == 0x000030, "Wrong size on FL_ToastNotificationHelpers_C_ShowToastNotificationOnWidget");
static_assert(offsetof(FL_ToastNotificationHelpers_C_ShowToastNotificationOnWidget, Text) == 0x000000, "Member 'FL_ToastNotificationHelpers_C_ShowToastNotificationOnWidget::Text' has a wrong offset!");
static_assert(offsetof(FL_ToastNotificationHelpers_C_ShowToastNotificationOnWidget, Theme) == 0x000010, "Member 'FL_ToastNotificationHelpers_C_ShowToastNotificationOnWidget::Theme' has a wrong offset!");
static_assert(offsetof(FL_ToastNotificationHelpers_C_ShowToastNotificationOnWidget, Widget) == 0x000018, "Member 'FL_ToastNotificationHelpers_C_ShowToastNotificationOnWidget::Widget' has a wrong offset!");
static_assert(offsetof(FL_ToastNotificationHelpers_C_ShowToastNotificationOnWidget, __WorldContext) == 0x000020, "Member 'FL_ToastNotificationHelpers_C_ShowToastNotificationOnWidget::__WorldContext' has a wrong offset!");
static_assert(offsetof(FL_ToastNotificationHelpers_C_ShowToastNotificationOnWidget, CallFunc_SpawnObject_ReturnValue) == 0x000028, "Member 'FL_ToastNotificationHelpers_C_ShowToastNotificationOnWidget::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");

}

