#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FL_TargetingHelpers

#include "Basic.hpp"

#include "ECharacterTeamSelector_structs.hpp"
#include "Engine_structs.hpp"
#include "EAliveStatus_structs.hpp"
#include "ENumericValueQuery_structs.hpp"
#include "E_jRPG_StatType_structs.hpp"
#include "E_jRPG_TargetingType_structs.hpp"


namespace SDK::Params
{

// Function FL_TargetingHelpers.FL_TargetingHelpers_C.GetRandomCharacterByBuffCritera
// 0x0098 (0x0098 - 0x0000)
struct FL_TargetingHelpers_C_GetRandomCharacterByBuffCritera final
{
public:
	ECharacterTeamSelector                        Team;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 Buff;                                              // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EAliveStatus                                  AliveStatus;                                       // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_jRPG_Character_Battle_Base_C*       Character;                                         // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_jRPG_Character_Battle_Base_C*> Temp_wildcard_We_need_a_second_array_to_store_the_result_and_be_able_to_wipe_the_first__buffer__array_Variable; // 0x0028(0x0010)(ConstParm, ReferenceParm)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_jRPG_Character_Battle_Base_C*       CallFunc_Array_Random_OutItem;                     // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Random_OutIndex;                    // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsNotEmpty_ReturnValue;             // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_jRPG_Character_Battle_Base_C*> CallFunc_GetAllCharactersFromTeam_Characters;    // 0x0058(0x0010)(ReferenceParm)
	class ABP_jRPG_Character_Battle_Base_C*       CallFunc_Array_Get_Item;                           // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetActiveBuffCounts_ReturnValue;          // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7D[0x3];                                       // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_jRPG_Character_Battle_Base_C*> Temp_wildcard_Temp_buffer_array_Variable;        // 0x0080(0x0010)(ConstParm, ReferenceParm)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FL_TargetingHelpers_C_GetRandomCharacterByBuffCritera) == 0x000008, "Wrong alignment on FL_TargetingHelpers_C_GetRandomCharacterByBuffCritera");
static_assert(sizeof(FL_TargetingHelpers_C_GetRandomCharacterByBuffCritera) == 0x000098, "Wrong size on FL_TargetingHelpers_C_GetRandomCharacterByBuffCritera");
static_assert(offsetof(FL_TargetingHelpers_C_GetRandomCharacterByBuffCritera, Team) == 0x000000, "Member 'FL_TargetingHelpers_C_GetRandomCharacterByBuffCritera::Team' has a wrong offset!");
static_assert(offsetof(FL_TargetingHelpers_C_GetRandomCharacterByBuffCritera, Buff) == 0x000008, "Member 'FL_TargetingHelpers_C_GetRandomCharacterByBuffCritera::Buff' has a wrong offset!");
static_assert(offsetof(FL_TargetingHelpers_C_GetRandomCharacterByBuffCritera, AliveStatus) == 0x000010, "Member 'FL_TargetingHelpers_C_GetRandomCharacterByBuffCritera::AliveStatus' has a wrong offset!");
static_assert(offsetof(FL_TargetingHelpers_C_GetRandomCharacterByBuffCritera, __WorldContext) == 0x000018, "Member 'FL_TargetingHelpers_C_GetRandomCharacterByBuffCritera::__WorldContext' has a wrong offset!");
static_assert(offsetof(FL_TargetingHelpers_C_GetRandomCharacterByBuffCritera, Character) == 0x000020, "Member 'FL_TargetingHelpers_C_GetRandomCharacterByBuffCritera::Character' has a wrong offset!");
static_assert(offsetof(FL_TargetingHelpers_C_GetRandomCharacterByBuffCritera, Temp_wildcard_We_need_a_second_array_to_store_the_result_and_be_able_to_wipe_the_first__buffer__array_Variable) == 0x000028, "Member 'FL_TargetingHelpers_C_GetRandomCharacterByBuffCritera::Temp_wildcard_We_need_a_second_array_to_store_the_result_and_be_able_to_wipe_the_first__buffer__array_Variable' has a wrong offset!");
static_assert(offsetof(FL_TargetingHelpers_C_GetRandomCharacterByBuffCritera, Temp_int_Loop_Counter_Variable) == 0x000038, "Member 'FL_TargetingHelpers_C_GetRandomCharacterByBuffCritera::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(FL_TargetingHelpers_C_GetRandomCharacterByBuffCritera, CallFunc_Array_Random_OutItem) == 0x000040, "Member 'FL_TargetingHelpers_C_GetRandomCharacterByBuffCritera::CallFunc_Array_Random_OutItem' has a wrong offset!");
static_assert(offsetof(FL_TargetingHelpers_C_GetRandomCharacterByBuffCritera, CallFunc_Array_Random_OutIndex) == 0x000048, "Member 'FL_TargetingHelpers_C_GetRandomCharacterByBuffCritera::CallFunc_Array_Random_OutIndex' has a wrong offset!");
static_assert(offsetof(FL_TargetingHelpers_C_GetRandomCharacterByBuffCritera, CallFunc_Add_IntInt_ReturnValue) == 0x00004C, "Member 'FL_TargetingHelpers_C_GetRandomCharacterByBuffCritera::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_TargetingHelpers_C_GetRandomCharacterByBuffCritera, CallFunc_Array_IsNotEmpty_ReturnValue) == 0x000050, "Member 'FL_TargetingHelpers_C_GetRandomCharacterByBuffCritera::CallFunc_Array_IsNotEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_TargetingHelpers_C_GetRandomCharacterByBuffCritera, Temp_int_Array_Index_Variable) == 0x000054, "Member 'FL_TargetingHelpers_C_GetRandomCharacterByBuffCritera::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(FL_TargetingHelpers_C_GetRandomCharacterByBuffCritera, CallFunc_GetAllCharactersFromTeam_Characters) == 0x000058, "Member 'FL_TargetingHelpers_C_GetRandomCharacterByBuffCritera::CallFunc_GetAllCharactersFromTeam_Characters' has a wrong offset!");
static_assert(offsetof(FL_TargetingHelpers_C_GetRandomCharacterByBuffCritera, CallFunc_Array_Get_Item) == 0x000068, "Member 'FL_TargetingHelpers_C_GetRandomCharacterByBuffCritera::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(FL_TargetingHelpers_C_GetRandomCharacterByBuffCritera, CallFunc_Array_Length_ReturnValue) == 0x000070, "Member 'FL_TargetingHelpers_C_GetRandomCharacterByBuffCritera::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_TargetingHelpers_C_GetRandomCharacterByBuffCritera, CallFunc_Less_IntInt_ReturnValue) == 0x000074, "Member 'FL_TargetingHelpers_C_GetRandomCharacterByBuffCritera::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_TargetingHelpers_C_GetRandomCharacterByBuffCritera, CallFunc_GetActiveBuffCounts_ReturnValue) == 0x000078, "Member 'FL_TargetingHelpers_C_GetRandomCharacterByBuffCritera::CallFunc_GetActiveBuffCounts_ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_TargetingHelpers_C_GetRandomCharacterByBuffCritera, CallFunc_Greater_IntInt_ReturnValue) == 0x00007C, "Member 'FL_TargetingHelpers_C_GetRandomCharacterByBuffCritera::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_TargetingHelpers_C_GetRandomCharacterByBuffCritera, Temp_wildcard_Temp_buffer_array_Variable) == 0x000080, "Member 'FL_TargetingHelpers_C_GetRandomCharacterByBuffCritera::Temp_wildcard_Temp_buffer_array_Variable' has a wrong offset!");
static_assert(offsetof(FL_TargetingHelpers_C_GetRandomCharacterByBuffCritera, CallFunc_Array_Add_ReturnValue) == 0x000090, "Member 'FL_TargetingHelpers_C_GetRandomCharacterByBuffCritera::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function FL_TargetingHelpers.FL_TargetingHelpers_C.GetCharacterByAP
// 0x0088 (0x0088 - 0x0000)
struct FL_TargetingHelpers_C_GetCharacterByAP final
{
public:
	ECharacterTeamSelector                        Team;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENumericValueQuery                            ValueCriteria;                                     // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAliveStatus                                  AliveStatus;                                       // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_jRPG_Character_Battle_Base_C*       BestCharacter;                                     // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_jRPG_Character_Battle_Base_C*       local_bestCharacter;                               // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	double                                        local_bestValue;                                   // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<double>                                Temp_wildcard_We_need_a_second_array_to_store_the_result_and_be_able_to_wipe_the_first__buffer__array_Variable; // 0x0028(0x0010)(ConstParm, ReferenceParm)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_jRPG_Character_Battle_Base_C*> CallFunc_GetAllCharactersFromTeam_Characters;    // 0x0048(0x0010)(ReferenceParm)
	class ABP_jRPG_Character_Battle_Base_C*       CallFunc_Array_Get_Item;                           // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsNotEmpty_ReturnValue;             // 0x0065(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_66[0x2];                                       // 0x0066(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_jRPG_Character_Battle_Base_C*       CallFunc_GetCharacterByFloatCriteria_Character;    // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<double>                                Temp_wildcard_Temp_buffer_array_Variable;          // 0x0070(0x0010)(ConstParm, ReferenceParm)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FL_TargetingHelpers_C_GetCharacterByAP) == 0x000008, "Wrong alignment on FL_TargetingHelpers_C_GetCharacterByAP");
static_assert(sizeof(FL_TargetingHelpers_C_GetCharacterByAP) == 0x000088, "Wrong size on FL_TargetingHelpers_C_GetCharacterByAP");
static_assert(offsetof(FL_TargetingHelpers_C_GetCharacterByAP, Team) == 0x000000, "Member 'FL_TargetingHelpers_C_GetCharacterByAP::Team' has a wrong offset!");
static_assert(offsetof(FL_TargetingHelpers_C_GetCharacterByAP, ValueCriteria) == 0x000001, "Member 'FL_TargetingHelpers_C_GetCharacterByAP::ValueCriteria' has a wrong offset!");
static_assert(offsetof(FL_TargetingHelpers_C_GetCharacterByAP, AliveStatus) == 0x000002, "Member 'FL_TargetingHelpers_C_GetCharacterByAP::AliveStatus' has a wrong offset!");
static_assert(offsetof(FL_TargetingHelpers_C_GetCharacterByAP, __WorldContext) == 0x000008, "Member 'FL_TargetingHelpers_C_GetCharacterByAP::__WorldContext' has a wrong offset!");
static_assert(offsetof(FL_TargetingHelpers_C_GetCharacterByAP, BestCharacter) == 0x000010, "Member 'FL_TargetingHelpers_C_GetCharacterByAP::BestCharacter' has a wrong offset!");
static_assert(offsetof(FL_TargetingHelpers_C_GetCharacterByAP, local_bestCharacter) == 0x000018, "Member 'FL_TargetingHelpers_C_GetCharacterByAP::local_bestCharacter' has a wrong offset!");
static_assert(offsetof(FL_TargetingHelpers_C_GetCharacterByAP, local_bestValue) == 0x000020, "Member 'FL_TargetingHelpers_C_GetCharacterByAP::local_bestValue' has a wrong offset!");
static_assert(offsetof(FL_TargetingHelpers_C_GetCharacterByAP, Temp_wildcard_We_need_a_second_array_to_store_the_result_and_be_able_to_wipe_the_first__buffer__array_Variable) == 0x000028, "Member 'FL_TargetingHelpers_C_GetCharacterByAP::Temp_wildcard_We_need_a_second_array_to_store_the_result_and_be_able_to_wipe_the_first__buffer__array_Variable' has a wrong offset!");
static_assert(offsetof(FL_TargetingHelpers_C_GetCharacterByAP, Temp_int_Loop_Counter_Variable) == 0x000038, "Member 'FL_TargetingHelpers_C_GetCharacterByAP::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(FL_TargetingHelpers_C_GetCharacterByAP, CallFunc_Add_IntInt_ReturnValue) == 0x00003C, "Member 'FL_TargetingHelpers_C_GetCharacterByAP::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_TargetingHelpers_C_GetCharacterByAP, Temp_int_Array_Index_Variable) == 0x000040, "Member 'FL_TargetingHelpers_C_GetCharacterByAP::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(FL_TargetingHelpers_C_GetCharacterByAP, CallFunc_GetAllCharactersFromTeam_Characters) == 0x000048, "Member 'FL_TargetingHelpers_C_GetCharacterByAP::CallFunc_GetAllCharactersFromTeam_Characters' has a wrong offset!");
static_assert(offsetof(FL_TargetingHelpers_C_GetCharacterByAP, CallFunc_Array_Get_Item) == 0x000058, "Member 'FL_TargetingHelpers_C_GetCharacterByAP::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(FL_TargetingHelpers_C_GetCharacterByAP, CallFunc_Array_Length_ReturnValue) == 0x000060, "Member 'FL_TargetingHelpers_C_GetCharacterByAP::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_TargetingHelpers_C_GetCharacterByAP, CallFunc_Less_IntInt_ReturnValue) == 0x000064, "Member 'FL_TargetingHelpers_C_GetCharacterByAP::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_TargetingHelpers_C_GetCharacterByAP, CallFunc_Array_IsNotEmpty_ReturnValue) == 0x000065, "Member 'FL_TargetingHelpers_C_GetCharacterByAP::CallFunc_Array_IsNotEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_TargetingHelpers_C_GetCharacterByAP, CallFunc_GetCharacterByFloatCriteria_Character) == 0x000068, "Member 'FL_TargetingHelpers_C_GetCharacterByAP::CallFunc_GetCharacterByFloatCriteria_Character' has a wrong offset!");
static_assert(offsetof(FL_TargetingHelpers_C_GetCharacterByAP, Temp_wildcard_Temp_buffer_array_Variable) == 0x000070, "Member 'FL_TargetingHelpers_C_GetCharacterByAP::Temp_wildcard_Temp_buffer_array_Variable' has a wrong offset!");
static_assert(offsetof(FL_TargetingHelpers_C_GetCharacterByAP, CallFunc_Array_Add_ReturnValue) == 0x000080, "Member 'FL_TargetingHelpers_C_GetCharacterByAP::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function FL_TargetingHelpers.FL_TargetingHelpers_C.GetCharacterByHP
// 0x0088 (0x0088 - 0x0000)
struct FL_TargetingHelpers_C_GetCharacterByHP final
{
public:
	ECharacterTeamSelector                        Team;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENumericValueQuery                            ValueCriteria;                                     // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAliveStatus                                  AliveStatus;                                       // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_jRPG_Character_Battle_Base_C*       BestCharacter;                                     // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_jRPG_Character_Battle_Base_C*       local_bestCharacter;                               // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	double                                        local_bestValue;                                   // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<double>                                Temp_wildcard_We_need_a_second_array_to_store_the_result_and_be_able_to_wipe_the_first__buffer__array_Variable; // 0x0038(0x0010)(ConstParm, ReferenceParm)
	TArray<class ABP_jRPG_Character_Battle_Base_C*> CallFunc_GetAllCharactersFromTeam_Characters;    // 0x0048(0x0010)(ReferenceParm)
	TArray<double>                                Temp_wildcard_Temp_buffer_array_Variable;          // 0x0058(0x0010)(ConstParm, ReferenceParm)
	class ABP_jRPG_Character_Battle_Base_C*       CallFunc_Array_Get_Item;                           // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_jRPG_Character_Battle_Base_C*       CallFunc_GetCharacterByFloatCriteria_Character;    // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsNotEmpty_ReturnValue;             // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FL_TargetingHelpers_C_GetCharacterByHP) == 0x000008, "Wrong alignment on FL_TargetingHelpers_C_GetCharacterByHP");
static_assert(sizeof(FL_TargetingHelpers_C_GetCharacterByHP) == 0x000088, "Wrong size on FL_TargetingHelpers_C_GetCharacterByHP");
static_assert(offsetof(FL_TargetingHelpers_C_GetCharacterByHP, Team) == 0x000000, "Member 'FL_TargetingHelpers_C_GetCharacterByHP::Team' has a wrong offset!");
static_assert(offsetof(FL_TargetingHelpers_C_GetCharacterByHP, ValueCriteria) == 0x000001, "Member 'FL_TargetingHelpers_C_GetCharacterByHP::ValueCriteria' has a wrong offset!");
static_assert(offsetof(FL_TargetingHelpers_C_GetCharacterByHP, AliveStatus) == 0x000002, "Member 'FL_TargetingHelpers_C_GetCharacterByHP::AliveStatus' has a wrong offset!");
static_assert(offsetof(FL_TargetingHelpers_C_GetCharacterByHP, __WorldContext) == 0x000008, "Member 'FL_TargetingHelpers_C_GetCharacterByHP::__WorldContext' has a wrong offset!");
static_assert(offsetof(FL_TargetingHelpers_C_GetCharacterByHP, BestCharacter) == 0x000010, "Member 'FL_TargetingHelpers_C_GetCharacterByHP::BestCharacter' has a wrong offset!");
static_assert(offsetof(FL_TargetingHelpers_C_GetCharacterByHP, local_bestCharacter) == 0x000018, "Member 'FL_TargetingHelpers_C_GetCharacterByHP::local_bestCharacter' has a wrong offset!");
static_assert(offsetof(FL_TargetingHelpers_C_GetCharacterByHP, local_bestValue) == 0x000020, "Member 'FL_TargetingHelpers_C_GetCharacterByHP::local_bestValue' has a wrong offset!");
static_assert(offsetof(FL_TargetingHelpers_C_GetCharacterByHP, Temp_int_Loop_Counter_Variable) == 0x000028, "Member 'FL_TargetingHelpers_C_GetCharacterByHP::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(FL_TargetingHelpers_C_GetCharacterByHP, CallFunc_Add_IntInt_ReturnValue) == 0x00002C, "Member 'FL_TargetingHelpers_C_GetCharacterByHP::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_TargetingHelpers_C_GetCharacterByHP, Temp_int_Array_Index_Variable) == 0x000030, "Member 'FL_TargetingHelpers_C_GetCharacterByHP::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(FL_TargetingHelpers_C_GetCharacterByHP, Temp_wildcard_We_need_a_second_array_to_store_the_result_and_be_able_to_wipe_the_first__buffer__array_Variable) == 0x000038, "Member 'FL_TargetingHelpers_C_GetCharacterByHP::Temp_wildcard_We_need_a_second_array_to_store_the_result_and_be_able_to_wipe_the_first__buffer__array_Variable' has a wrong offset!");
static_assert(offsetof(FL_TargetingHelpers_C_GetCharacterByHP, CallFunc_GetAllCharactersFromTeam_Characters) == 0x000048, "Member 'FL_TargetingHelpers_C_GetCharacterByHP::CallFunc_GetAllCharactersFromTeam_Characters' has a wrong offset!");
static_assert(offsetof(FL_TargetingHelpers_C_GetCharacterByHP, Temp_wildcard_Temp_buffer_array_Variable) == 0x000058, "Member 'FL_TargetingHelpers_C_GetCharacterByHP::Temp_wildcard_Temp_buffer_array_Variable' has a wrong offset!");
static_assert(offsetof(FL_TargetingHelpers_C_GetCharacterByHP, CallFunc_Array_Get_Item) == 0x000068, "Member 'FL_TargetingHelpers_C_GetCharacterByHP::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(FL_TargetingHelpers_C_GetCharacterByHP, CallFunc_GetCharacterByFloatCriteria_Character) == 0x000070, "Member 'FL_TargetingHelpers_C_GetCharacterByHP::CallFunc_GetCharacterByFloatCriteria_Character' has a wrong offset!");
static_assert(offsetof(FL_TargetingHelpers_C_GetCharacterByHP, CallFunc_Array_Add_ReturnValue) == 0x000078, "Member 'FL_TargetingHelpers_C_GetCharacterByHP::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_TargetingHelpers_C_GetCharacterByHP, CallFunc_Array_Length_ReturnValue) == 0x00007C, "Member 'FL_TargetingHelpers_C_GetCharacterByHP::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_TargetingHelpers_C_GetCharacterByHP, CallFunc_Array_IsNotEmpty_ReturnValue) == 0x000080, "Member 'FL_TargetingHelpers_C_GetCharacterByHP::CallFunc_Array_IsNotEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_TargetingHelpers_C_GetCharacterByHP, CallFunc_Less_IntInt_ReturnValue) == 0x000081, "Member 'FL_TargetingHelpers_C_GetCharacterByHP::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function FL_TargetingHelpers.FL_TargetingHelpers_C.GetCharacterByFloatCriteria
// 0x0098 (0x0098 - 0x0000)
struct FL_TargetingHelpers_C_GetCharacterByFloatCriteria final
{
public:
	TArray<class ABP_jRPG_Character_Battle_Base_C*> Characters;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<double>                                Values;                                            // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	ENumericValueQuery                            ValueQuery;                                        // 0x0020(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_jRPG_Character_Battle_Base_C*       Character;                                         // 0x0030(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_jRPG_Character_Battle_Base_C*       local_bestCharacter;                               // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	double                                        local_bestValue;                                   // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_jRPG_Character_Battle_Base_C*       CallFunc_Array_Get_Item;                           // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsEmpty_ReturnValue;                // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_jRPG_Character_Battle_Base_C*       CallFunc_Array_Get_Item_1;                         // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Array_Get_Item_2;                         // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x008D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8E[0x2];                                       // 0x008E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENumericValueQuery                            Temp_byte_Variable;                                // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0095(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x0096(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Select_Default;                             // 0x0097(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FL_TargetingHelpers_C_GetCharacterByFloatCriteria) == 0x000008, "Wrong alignment on FL_TargetingHelpers_C_GetCharacterByFloatCriteria");
static_assert(sizeof(FL_TargetingHelpers_C_GetCharacterByFloatCriteria) == 0x000098, "Wrong size on FL_TargetingHelpers_C_GetCharacterByFloatCriteria");
static_assert(offsetof(FL_TargetingHelpers_C_GetCharacterByFloatCriteria, Characters) == 0x000000, "Member 'FL_TargetingHelpers_C_GetCharacterByFloatCriteria::Characters' has a wrong offset!");
static_assert(offsetof(FL_TargetingHelpers_C_GetCharacterByFloatCriteria, Values) == 0x000010, "Member 'FL_TargetingHelpers_C_GetCharacterByFloatCriteria::Values' has a wrong offset!");
static_assert(offsetof(FL_TargetingHelpers_C_GetCharacterByFloatCriteria, ValueQuery) == 0x000020, "Member 'FL_TargetingHelpers_C_GetCharacterByFloatCriteria::ValueQuery' has a wrong offset!");
static_assert(offsetof(FL_TargetingHelpers_C_GetCharacterByFloatCriteria, __WorldContext) == 0x000028, "Member 'FL_TargetingHelpers_C_GetCharacterByFloatCriteria::__WorldContext' has a wrong offset!");
static_assert(offsetof(FL_TargetingHelpers_C_GetCharacterByFloatCriteria, Character) == 0x000030, "Member 'FL_TargetingHelpers_C_GetCharacterByFloatCriteria::Character' has a wrong offset!");
static_assert(offsetof(FL_TargetingHelpers_C_GetCharacterByFloatCriteria, local_bestCharacter) == 0x000038, "Member 'FL_TargetingHelpers_C_GetCharacterByFloatCriteria::local_bestCharacter' has a wrong offset!");
static_assert(offsetof(FL_TargetingHelpers_C_GetCharacterByFloatCriteria, local_bestValue) == 0x000040, "Member 'FL_TargetingHelpers_C_GetCharacterByFloatCriteria::local_bestValue' has a wrong offset!");
static_assert(offsetof(FL_TargetingHelpers_C_GetCharacterByFloatCriteria, CallFunc_Array_Length_ReturnValue) == 0x000048, "Member 'FL_TargetingHelpers_C_GetCharacterByFloatCriteria::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_TargetingHelpers_C_GetCharacterByFloatCriteria, CallFunc_Array_Get_Item) == 0x000050, "Member 'FL_TargetingHelpers_C_GetCharacterByFloatCriteria::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(FL_TargetingHelpers_C_GetCharacterByFloatCriteria, CallFunc_Array_Length_ReturnValue_1) == 0x000058, "Member 'FL_TargetingHelpers_C_GetCharacterByFloatCriteria::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FL_TargetingHelpers_C_GetCharacterByFloatCriteria, CallFunc_Array_IsEmpty_ReturnValue) == 0x00005C, "Member 'FL_TargetingHelpers_C_GetCharacterByFloatCriteria::CallFunc_Array_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_TargetingHelpers_C_GetCharacterByFloatCriteria, CallFunc_Array_Length_ReturnValue_2) == 0x000060, "Member 'FL_TargetingHelpers_C_GetCharacterByFloatCriteria::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(FL_TargetingHelpers_C_GetCharacterByFloatCriteria, Temp_int_Array_Index_Variable) == 0x000064, "Member 'FL_TargetingHelpers_C_GetCharacterByFloatCriteria::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(FL_TargetingHelpers_C_GetCharacterByFloatCriteria, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000068, "Member 'FL_TargetingHelpers_C_GetCharacterByFloatCriteria::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_TargetingHelpers_C_GetCharacterByFloatCriteria, CallFunc_Array_Get_Item_1) == 0x000070, "Member 'FL_TargetingHelpers_C_GetCharacterByFloatCriteria::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(FL_TargetingHelpers_C_GetCharacterByFloatCriteria, CallFunc_BooleanOR_ReturnValue) == 0x000078, "Member 'FL_TargetingHelpers_C_GetCharacterByFloatCriteria::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_TargetingHelpers_C_GetCharacterByFloatCriteria, CallFunc_Array_Get_Item_2) == 0x000080, "Member 'FL_TargetingHelpers_C_GetCharacterByFloatCriteria::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(FL_TargetingHelpers_C_GetCharacterByFloatCriteria, Temp_int_Loop_Counter_Variable) == 0x000088, "Member 'FL_TargetingHelpers_C_GetCharacterByFloatCriteria::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(FL_TargetingHelpers_C_GetCharacterByFloatCriteria, Temp_bool_Variable) == 0x00008C, "Member 'FL_TargetingHelpers_C_GetCharacterByFloatCriteria::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(FL_TargetingHelpers_C_GetCharacterByFloatCriteria, CallFunc_Less_IntInt_ReturnValue) == 0x00008D, "Member 'FL_TargetingHelpers_C_GetCharacterByFloatCriteria::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_TargetingHelpers_C_GetCharacterByFloatCriteria, CallFunc_Add_IntInt_ReturnValue) == 0x000090, "Member 'FL_TargetingHelpers_C_GetCharacterByFloatCriteria::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_TargetingHelpers_C_GetCharacterByFloatCriteria, Temp_byte_Variable) == 0x000094, "Member 'FL_TargetingHelpers_C_GetCharacterByFloatCriteria::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(FL_TargetingHelpers_C_GetCharacterByFloatCriteria, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x000095, "Member 'FL_TargetingHelpers_C_GetCharacterByFloatCriteria::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_TargetingHelpers_C_GetCharacterByFloatCriteria, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x000096, "Member 'FL_TargetingHelpers_C_GetCharacterByFloatCriteria::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_TargetingHelpers_C_GetCharacterByFloatCriteria, K2Node_Select_Default) == 0x000097, "Member 'FL_TargetingHelpers_C_GetCharacterByFloatCriteria::K2Node_Select_Default' has a wrong offset!");

// Function FL_TargetingHelpers.FL_TargetingHelpers_C.GetAllCharactersFromTeam
// 0x0098 (0x0098 - 0x0000)
struct FL_TargetingHelpers_C_GetAllCharactersFromTeam final
{
public:
	ECharacterTeamSelector                        Team;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAliveStatus                                  AliveStatus;                                       // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_jRPG_Character_Battle_Base_C*> Characters;                                      // 0x0010(0x0010)(Parm, OutParm)
	TArray<class ABP_jRPG_Character_Battle_Base_C*> CallFunc_GetAllHeroesAliveAndDead_Target_Heroes; // 0x0020(0x0010)(ReferenceParm)
	TArray<class ABP_jRPG_Character_Battle_Base_C*> CallFunc_GetAllEnemies_Enemies;                  // 0x0030(0x0010)(ReferenceParm)
	TArray<class ABP_jRPG_Character_Battle_Base_C*> CallFunc_GetAllAliveEnemies_Target_Heroes;       // 0x0040(0x0010)(ReferenceParm)
	TArray<class ABP_jRPG_Character_Battle_Base_C*> CallFunc_GetAllAliveHeroes_Target_Heroes;        // 0x0050(0x0010)(ReferenceParm)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_2;                    // 0x0062(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_63[0x5];                                       // 0x0063(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_jRPG_Character_Battle_Base_C*> Temp_wildcard_Variable;                          // 0x0068(0x0010)(ReferenceParm)
	TArray<class ABP_jRPG_Character_Battle_Base_C*> CallFunc_GetAllCharactersFromTeam_Characters;    // 0x0078(0x0010)(ReferenceParm)
	TArray<class ABP_jRPG_Character_Battle_Base_C*> CallFunc_GetAllCharactersFromTeam_Characters_1;  // 0x0088(0x0010)(ReferenceParm)
};
static_assert(alignof(FL_TargetingHelpers_C_GetAllCharactersFromTeam) == 0x000008, "Wrong alignment on FL_TargetingHelpers_C_GetAllCharactersFromTeam");
static_assert(sizeof(FL_TargetingHelpers_C_GetAllCharactersFromTeam) == 0x000098, "Wrong size on FL_TargetingHelpers_C_GetAllCharactersFromTeam");
static_assert(offsetof(FL_TargetingHelpers_C_GetAllCharactersFromTeam, Team) == 0x000000, "Member 'FL_TargetingHelpers_C_GetAllCharactersFromTeam::Team' has a wrong offset!");
static_assert(offsetof(FL_TargetingHelpers_C_GetAllCharactersFromTeam, AliveStatus) == 0x000001, "Member 'FL_TargetingHelpers_C_GetAllCharactersFromTeam::AliveStatus' has a wrong offset!");
static_assert(offsetof(FL_TargetingHelpers_C_GetAllCharactersFromTeam, __WorldContext) == 0x000008, "Member 'FL_TargetingHelpers_C_GetAllCharactersFromTeam::__WorldContext' has a wrong offset!");
static_assert(offsetof(FL_TargetingHelpers_C_GetAllCharactersFromTeam, Characters) == 0x000010, "Member 'FL_TargetingHelpers_C_GetAllCharactersFromTeam::Characters' has a wrong offset!");
static_assert(offsetof(FL_TargetingHelpers_C_GetAllCharactersFromTeam, CallFunc_GetAllHeroesAliveAndDead_Target_Heroes) == 0x000020, "Member 'FL_TargetingHelpers_C_GetAllCharactersFromTeam::CallFunc_GetAllHeroesAliveAndDead_Target_Heroes' has a wrong offset!");
static_assert(offsetof(FL_TargetingHelpers_C_GetAllCharactersFromTeam, CallFunc_GetAllEnemies_Enemies) == 0x000030, "Member 'FL_TargetingHelpers_C_GetAllCharactersFromTeam::CallFunc_GetAllEnemies_Enemies' has a wrong offset!");
static_assert(offsetof(FL_TargetingHelpers_C_GetAllCharactersFromTeam, CallFunc_GetAllAliveEnemies_Target_Heroes) == 0x000040, "Member 'FL_TargetingHelpers_C_GetAllCharactersFromTeam::CallFunc_GetAllAliveEnemies_Target_Heroes' has a wrong offset!");
static_assert(offsetof(FL_TargetingHelpers_C_GetAllCharactersFromTeam, CallFunc_GetAllAliveHeroes_Target_Heroes) == 0x000050, "Member 'FL_TargetingHelpers_C_GetAllCharactersFromTeam::CallFunc_GetAllAliveHeroes_Target_Heroes' has a wrong offset!");
static_assert(offsetof(FL_TargetingHelpers_C_GetAllCharactersFromTeam, K2Node_SwitchEnum_CmpSuccess) == 0x000060, "Member 'FL_TargetingHelpers_C_GetAllCharactersFromTeam::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(FL_TargetingHelpers_C_GetAllCharactersFromTeam, K2Node_SwitchEnum_CmpSuccess_1) == 0x000061, "Member 'FL_TargetingHelpers_C_GetAllCharactersFromTeam::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(FL_TargetingHelpers_C_GetAllCharactersFromTeam, K2Node_SwitchEnum_CmpSuccess_2) == 0x000062, "Member 'FL_TargetingHelpers_C_GetAllCharactersFromTeam::K2Node_SwitchEnum_CmpSuccess_2' has a wrong offset!");
static_assert(offsetof(FL_TargetingHelpers_C_GetAllCharactersFromTeam, Temp_wildcard_Variable) == 0x000068, "Member 'FL_TargetingHelpers_C_GetAllCharactersFromTeam::Temp_wildcard_Variable' has a wrong offset!");
static_assert(offsetof(FL_TargetingHelpers_C_GetAllCharactersFromTeam, CallFunc_GetAllCharactersFromTeam_Characters) == 0x000078, "Member 'FL_TargetingHelpers_C_GetAllCharactersFromTeam::CallFunc_GetAllCharactersFromTeam_Characters' has a wrong offset!");
static_assert(offsetof(FL_TargetingHelpers_C_GetAllCharactersFromTeam, CallFunc_GetAllCharactersFromTeam_Characters_1) == 0x000088, "Member 'FL_TargetingHelpers_C_GetAllCharactersFromTeam::CallFunc_GetAllCharactersFromTeam_Characters_1' has a wrong offset!");

// Function FL_TargetingHelpers.FL_TargetingHelpers_C.GetCharacterByStatCriteria
// 0x04D0 (0x04D0 - 0x0000)
struct FL_TargetingHelpers_C_GetCharacterByStatCriteria final
{
public:
	ECharacterTeamSelector                        Team;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_jRPG_StatType                               StatType;                                          // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENumericValueQuery                            ValueCriteria;                                     // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAliveStatus                                  AliveStatus;                                       // 0x0003(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_jRPG_Character_Battle_Base_C*       BestCharacter;                                     // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_jRPG_Character_Battle_Base_C*       local_bestCharacter;                               // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	double                                        local_bestValue;                                   // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0048(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0058(0x0048)(HasGetValueTypeHash)
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_1; // 0x00A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x00B8(0x0010)()
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_2; // 0x00C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00D8(0x0048)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_2;          // 0x0120(0x0010)()
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_3; // 0x0130(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0140(0x0048)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_3;          // 0x0188(0x0010)()
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_199[0x7];                                      // 0x0199(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x01A0(0x0048)(HasGetValueTypeHash)
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_4; // 0x01E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_5; // 0x01F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_4;          // 0x0208(0x0010)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_5;          // 0x0218(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_4;            // 0x0228(0x0048)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_5;            // 0x0270(0x0048)(HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B9[0x7];                                      // 0x02B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_6; // 0x02C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_7; // 0x02D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_6;          // 0x02E0(0x0010)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_7;          // 0x02F0(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_6;            // 0x0300(0x0048)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_7;            // 0x0348(0x0048)(HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_3;        // 0x0390(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_391[0x7];                                      // 0x0391(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0398(0x0010)(ReferenceParm)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x03A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A9[0x7];                                      // 0x03A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x03B0(0x0010)()
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x03C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x03C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C2[0x2];                                      // 0x03C2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x03C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<double>                                Temp_wildcard_We_need_a_second_array_to_store_the_result_and_be_able_to_wipe_the_first__buffer__array_Variable; // 0x03C8(0x0010)(ConstParm, ReferenceParm)
	TArray<class ABP_jRPG_Character_Battle_Base_C*> CallFunc_GetAllCharactersFromTeam_Characters;    // 0x03D8(0x0010)(ReferenceParm)
	class ABP_jRPG_Character_Battle_Base_C*       CallFunc_Array_Get_Item;                           // 0x03E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_jRPG_Character_Battle_Base_C*       CallFunc_GetCharacterByFloatCriteria_Character;    // 0x03F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x03F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_8;          // 0x0408(0x0010)()
	double                                        CallFunc_Map_Find_Value;                           // 0x0418(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0420(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_421[0x7];                                      // 0x0421(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_8;            // 0x0428(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0470(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0480(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_484[0x4];                                      // 0x0484(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0488(0x0010)()
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0498(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_499[0x7];                                      // 0x0499(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x04A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsNotEmpty_ReturnValue;             // 0x04B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B1[0x7];                                      // 0x04B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<double>                                Temp_wildcard_Temp_buffer_array_Variable;          // 0x04B8(0x0010)(ConstParm, ReferenceParm)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x04C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FL_TargetingHelpers_C_GetCharacterByStatCriteria) == 0x000008, "Wrong alignment on FL_TargetingHelpers_C_GetCharacterByStatCriteria");
static_assert(sizeof(FL_TargetingHelpers_C_GetCharacterByStatCriteria) == 0x0004D0, "Wrong size on FL_TargetingHelpers_C_GetCharacterByStatCriteria");
static_assert(offsetof(FL_TargetingHelpers_C_GetCharacterByStatCriteria, Team) == 0x000000, "Member 'FL_TargetingHelpers_C_GetCharacterByStatCriteria::Team' has a wrong offset!");
static_assert(offsetof(FL_TargetingHelpers_C_GetCharacterByStatCriteria, StatType) == 0x000001, "Member 'FL_TargetingHelpers_C_GetCharacterByStatCriteria::StatType' has a wrong offset!");
static_assert(offsetof(FL_TargetingHelpers_C_GetCharacterByStatCriteria, ValueCriteria) == 0x000002, "Member 'FL_TargetingHelpers_C_GetCharacterByStatCriteria::ValueCriteria' has a wrong offset!");
static_assert(offsetof(FL_TargetingHelpers_C_GetCharacterByStatCriteria, AliveStatus) == 0x000003, "Member 'FL_TargetingHelpers_C_GetCharacterByStatCriteria::AliveStatus' has a wrong offset!");
static_assert(offsetof(FL_TargetingHelpers_C_GetCharacterByStatCriteria, __WorldContext) == 0x000008, "Member 'FL_TargetingHelpers_C_GetCharacterByStatCriteria::__WorldContext' has a wrong offset!");
static_assert(offsetof(FL_TargetingHelpers_C_GetCharacterByStatCriteria, BestCharacter) == 0x000010, "Member 'FL_TargetingHelpers_C_GetCharacterByStatCriteria::BestCharacter' has a wrong offset!");
static_assert(offsetof(FL_TargetingHelpers_C_GetCharacterByStatCriteria, local_bestCharacter) == 0x000018, "Member 'FL_TargetingHelpers_C_GetCharacterByStatCriteria::local_bestCharacter' has a wrong offset!");
static_assert(offsetof(FL_TargetingHelpers_C_GetCharacterByStatCriteria, local_bestValue) == 0x000020, "Member 'FL_TargetingHelpers_C_GetCharacterByStatCriteria::local_bestValue' has a wrong offset!");
static_assert(offsetof(FL_TargetingHelpers_C_GetCharacterByStatCriteria, Temp_int_Loop_Counter_Variable) == 0x000028, "Member 'FL_TargetingHelpers_C_GetCharacterByStatCriteria::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(FL_TargetingHelpers_C_GetCharacterByStatCriteria, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x000030, "Member 'FL_TargetingHelpers_C_GetCharacterByStatCriteria::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
