#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FLevelDataEntry

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "ELevelType_structs.hpp"
#include "S_LevelParameters_structs.hpp"


namespace SDK
{

// UserDefinedStruct FLevelDataEntry.FLevelDataEntry
// 0x01B0 (0x01B0 - 0x0000)
struct FFLevelDataEntry final
{
public:
	class FName                                   LevelAssetName_85_BF09694C41CC0444295731A40341A5F9; // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ELevelType                                    LevelType_37_EE4A371F4388B884A49327A9EEC1B9F0;     // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_LevelParameters                     LevelParameters_61_6A9E688E455B46E34C160DBD6B2455C6; // 0x0010(0x0028)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	class FText                                   DisplayName_10_D3213B974EE2CBDD44757B978CD84FD8;   // 0x0038(0x0010)(Edit, BlueprintVisible)
	TSoftObjectPtr<class UTexture2D>              LevelIcon_88_426A5B30471F251930103DA7BD1FE412;     // 0x0048(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              LevelMinimapIcon_91_2A0955C545BA24A90CDDB18BA434497A; // 0x0070(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FGameplayTag                           MainSpawnPoint_72_5C7B345E44E5B2867FCE0687BB65019F; // 0x0098(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	TMap<struct FGameplayTag, class FText>        SubAreas_73_B59A02D5470428064B9B03A1A3F5F82C;      // 0x00A0(0x0050)(Edit, BlueprintVisible)
	int32                                         ScalingMinLevel_46_24595A4C47B1576C3770CA98815E66DD; // 0x00F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ScalingMaxLevel_45_389D00474B3DAD3D274A2FB0BDA15EA9; // 0x00F4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           MainSpawnPointOnWorldMap_80_1975CCE74EA671FE2C7363A383672E31; // 0x00F8(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	double                                        LevelCompassYawOffset_94_8B89A37147BF981A110ACDA8120C46D2; // 0x0100(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UBP_DataAsset_DebugSaveGame_C> DEBUG_ReferenceProgressionSave_29_FBB4F74D449FAB2CD01E5C99A62FEF5E; // 0x0108(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	class UGameAction*                            LevelStartGameAction_49_B3E9B26C4EEC004EF86889BF5E3A8896; // 0x0130(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           DEBUG_StartSpawnPointTag_77_ADC69B8444CFACE5A732B9AC7D77851F; // 0x0138(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	class FString                                 DEBUG_DisplayName_53_9F413247464FAA247960E2ACE5B41200; // 0x0140(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FName                                   DEPRECATED_DEBUG_StartSpawnPointID_74_630DC61549C1B3613B9AEDBE922B51EF; // 0x0150(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   DEPRECATED_SpawnPointName_63_2B1DEABE4D325DD3BA50E480EC416AE9; // 0x0158(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<class FName, class FText>                DEPRECATED_SubAreaNames_62_1D27334B468095EEBEB4629136DB3E03; // 0x0160(0x0050)(Edit, BlueprintVisible)
};
static_assert(alignof(FFLevelDataEntry) == 0x000008, "Wrong alignment on FFLevelDataEntry");
static_assert(sizeof(FFLevelDataEntry) == 0x0001B0, "Wrong size on FFLevelDataEntry");
static_assert(offsetof(FFLevelDataEntry, LevelAssetName_85_BF09694C41CC0444295731A40341A5F9) == 0x000000, "Member 'FFLevelDataEntry::LevelAssetName_85_BF09694C41CC0444295731A40341A5F9' has a wrong offset!");
static_assert(offsetof(FFLevelDataEntry, LevelType_37_EE4A371F4388B884A49327A9EEC1B9F0) == 0x000008, "Member 'FFLevelDataEntry::LevelType_37_EE4A371F4388B884A49327A9EEC1B9F0' has a wrong offset!");
static_assert(offsetof(FFLevelDataEntry, LevelParameters_61_6A9E688E455B46E34C160DBD6B2455C6) == 0x000010, "Member 'FFLevelDataEntry::LevelParameters_61_6A9E688E455B46E34C160DBD6B2455C6' has a wrong offset!");
static_assert(offsetof(FFLevelDataEntry, DisplayName_10_D3213B974EE2CBDD44757B978CD84FD8) == 0x000038, "Member 'FFLevelDataEntry::DisplayName_10_D3213B974EE2CBDD44757B978CD84FD8' has a wrong offset!");
static_assert(offsetof(FFLevelDataEntry, LevelIcon_88_426A5B30471F251930103DA7BD1FE412) == 0x000048, "Member 'FFLevelDataEntry::LevelIcon_88_426A5B30471F251930103DA7BD1FE412' has a wrong offset!");
static_assert(offsetof(FFLevelDataEntry, LevelMinimapIcon_91_2A0955C545BA24A90CDDB18BA434497A) == 0x000070, "Member 'FFLevelDataEntry::LevelMinimapIcon_91_2A0955C545BA24A90CDDB18BA434497A' has a wrong offset!");
static_assert(offsetof(FFLevelDataEntry, MainSpawnPoint_72_5C7B345E44E5B2867FCE0687BB65019F) == 0x000098, "Member 'FFLevelDataEntry::MainSpawnPoint_72_5C7B345E44E5B2867FCE0687BB65019F' has a wrong offset!");
static_assert(offsetof(FFLevelDataEntry, SubAreas_73_B59A02D5470428064B9B03A1A3F5F82C) == 0x0000A0, "Member 'FFLevelDataEntry::SubAreas_73_B59A02D5470428064B9B03A1A3F5F82C' has a wrong offset!");
static_assert(offsetof(FFLevelDataEntry, ScalingMinLevel_46_24595A4C47B1576C3770CA98815E66DD) == 0x0000F0, "Member 'FFLevelDataEntry::ScalingMinLevel_46_24595A4C47B1576C3770CA98815E66DD' has a wrong offset!");
static_assert(offsetof(FFLevelDataEntry, ScalingMaxLevel_45_389D00474B3DAD3D274A2FB0BDA15EA9) == 0x0000F4, "Member 'FFLevelDataEntry::ScalingMaxLevel_45_389D00474B3DAD3D274A2FB0BDA15EA9' has a wrong offset!");
static_assert(offsetof(FFLevelDataEntry, MainSpawnPointOnWorldMap_80_1975CCE74EA671FE2C7363A383672E31) == 0x0000F8, "Member 'FFLevelDataEntry::MainSpawnPointOnWorldMap_80_1975CCE74EA671FE2C7363A383672E31' has a wrong offset!");
static_assert(offsetof(FFLevelDataEntry, LevelCompassYawOffset_94_8B89A37147BF981A110ACDA8120C46D2) == 0x000100, "Member 'FFLevelDataEntry::LevelCompassYawOffset_94_8B89A37147BF981A110ACDA8120C46D2' has a wrong offset!");
static_assert(offsetof(FFLevelDataEntry, DEBUG_ReferenceProgressionSave_29_FBB4F74D449FAB2CD01E5C99A62FEF5E) == 0x000108, "Member 'FFLevelDataEntry::DEBUG_ReferenceProgressionSave_29_FBB4F74D449FAB2CD01E5C99A62FEF5E' has a wrong offset!");
static_assert(offsetof(FFLevelDataEntry, LevelStartGameAction_49_B3E9B26C4EEC004EF86889BF5E3A8896) == 0x000130, "Member 'FFLevelDataEntry::LevelStartGameAction_49_B3E9B26C4EEC004EF86889BF5E3A8896' has a wrong offset!");
static_assert(offsetof(FFLevelDataEntry, DEBUG_StartSpawnPointTag_77_ADC69B8444CFACE5A732B9AC7D77851F) == 0x000138, "Member 'FFLevelDataEntry::DEBUG_StartSpawnPointTag_77_ADC69B8444CFACE5A732B9AC7D77851F' has a wrong offset!");
static_assert(offsetof(FFLevelDataEntry, DEBUG_DisplayName_53_9F413247464FAA247960E2ACE5B41200) == 0x000140, "Member 'FFLevelDataEntry::DEBUG_DisplayName_53_9F413247464FAA247960E2ACE5B41200' has a wrong offset!");
static_assert(offsetof(FFLevelDataEntry, DEPRECATED_DEBUG_StartSpawnPointID_74_630DC61549C1B3613B9AEDBE922B51EF) == 0x000150, "Member 'FFLevelDataEntry::DEPRECATED_DEBUG_StartSpawnPointID_74_630DC61549C1B3613B9AEDBE922B51EF' has a wrong offset!");
static_assert(offsetof(FFLevelDataEntry, DEPRECATED_SpawnPointName_63_2B1DEABE4D325DD3BA50E480EC416AE9) == 0x000158, "Member 'FFLevelDataEntry::DEPRECATED_SpawnPointName_63_2B1DEABE4D325DD3BA50E480EC416AE9' has a wrong offset!");
static_assert(offsetof(FFLevelDataEntry, DEPRECATED_SubAreaNames_62_1D27334B468095EEBEB4629136DB3E03) == 0x000160, "Member 'FFLevelDataEntry::DEPRECATED_SubAreaNames_62_1D27334B468095EEBEB4629136DB3E03' has a wrong offset!");

}

