#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FNavigationGridCreationInfo

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct FNavigationGridCreationInfo.FNavigationGridCreationInfo
// 0x0068 (0x0068 - 0x0000)
struct FFNavigationGridCreationInfo final
{
public:
	int32                                         ColumnCount_3_38FB06CC4838178C68A4D6B67D06324D;    // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         RowCount_5_5C12282E4480AF2F0DB1FDB0A5CDBCA9;       // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UObject*>                        NavigableObjectData_10_48175A204DC2E32B37FF4AA9FC9B1880; // 0x0008(0x0010)(Edit, BlueprintVisible)
	TMap<struct FIntVector, class UObject*>       NavigableObjectGrid_17_517E083447FE10FCD51EDF868AF34957; // 0x0018(0x0050)(Edit, BlueprintVisible)
};
static_assert(alignof(FFNavigationGridCreationInfo) == 0x000008, "Wrong alignment on FFNavigationGridCreationInfo");
static_assert(sizeof(FFNavigationGridCreationInfo) == 0x000068, "Wrong size on FFNavigationGridCreationInfo");
static_assert(offsetof(FFNavigationGridCreationInfo, ColumnCount_3_38FB06CC4838178C68A4D6B67D06324D) == 0x000000, "Member 'FFNavigationGridCreationInfo::ColumnCount_3_38FB06CC4838178C68A4D6B67D06324D' has a wrong offset!");
static_assert(offsetof(FFNavigationGridCreationInfo, RowCount_5_5C12282E4480AF2F0DB1FDB0A5CDBCA9) == 0x000004, "Member 'FFNavigationGridCreationInfo::RowCount_5_5C12282E4480AF2F0DB1FDB0A5CDBCA9' has a wrong offset!");
static_assert(offsetof(FFNavigationGridCreationInfo, NavigableObjectData_10_48175A204DC2E32B37FF4AA9FC9B1880) == 0x000008, "Member 'FFNavigationGridCreationInfo::NavigableObjectData_10_48175A204DC2E32B37FF4AA9FC9B1880' has a wrong offset!");
static_assert(offsetof(FFNavigationGridCreationInfo, NavigableObjectGrid_17_517E083447FE10FCD51EDF868AF34957) == 0x000018, "Member 'FFNavigationGridCreationInfo::NavigableObjectGrid_17_517E083447FE10FCD51EDF868AF34957' has a wrong offset!");

}

