#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FPassiveEffectProgression

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct FPassiveEffectProgression.FPassiveEffectProgression
// 0x0010 (0x0010 - 0x0000)
struct FFPassiveEffectProgression final
{
public:
	class FName                                   PassiveEffectName_3_A92DB6CC4549450728A867A714ADF6C5; // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsLearnt_9_2561000E49D90653437DE9A45BE2A86D;       // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         LearntSteps_6_A14D681549E830249C77BD95F2B4CF3F;    // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FFPassiveEffectProgression) == 0x000004, "Wrong alignment on FFPassiveEffectProgression");
static_assert(sizeof(FFPassiveEffectProgression) == 0x000010, "Wrong size on FFPassiveEffectProgression");
static_assert(offsetof(FFPassiveEffectProgression, PassiveEffectName_3_A92DB6CC4549450728A867A714ADF6C5) == 0x000000, "Member 'FFPassiveEffectProgression::PassiveEffectName_3_A92DB6CC4549450728A867A714ADF6C5' has a wrong offset!");
static_assert(offsetof(FFPassiveEffectProgression, IsLearnt_9_2561000E49D90653437DE9A45BE2A86D) == 0x000008, "Member 'FFPassiveEffectProgression::IsLearnt_9_2561000E49D90653437DE9A45BE2A86D' has a wrong offset!");
static_assert(offsetof(FFPassiveEffectProgression, LearntSteps_6_A14D681549E830249C77BD95F2B4CF3F) == 0x00000C, "Member 'FFPassiveEffectProgression::LearntSteps_6_A14D681549E830249C77BD95F2B4CF3F' has a wrong offset!");

}

