#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FSkillUnlockData

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK
{

// UserDefinedStruct FSkillUnlockData.FSkillUnlockData
// 0x0028 (0x0028 - 0x0000)
struct FFSkillUnlockData final
{
public:
	class UBP_DataAsset_Skill_C*                  Skill_2_9E4FC5804778258FBAA04BBF7F68F799;          // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         UnlockCost_5_E90ABE13467BBA2959E91AB582E679AF;     // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsStartingSkill_13_E1837512408188F4B7D355B6B67B8C1E; // 0x000C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    RequiresUnlockItem_18_D9EBC20F41097DD7517E428E4A57655E; // 0x0010(0x0010)(Edit, BlueprintVisible, NoDestructor)
	bool                                          IsSecret_11_8074DE284785FEC2841D2EBBB4749CF3;      // 0x0020(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FFSkillUnlockData) == 0x000008, "Wrong alignment on FFSkillUnlockData");
static_assert(sizeof(FFSkillUnlockData) == 0x000028, "Wrong size on FFSkillUnlockData");
static_assert(offsetof(FFSkillUnlockData, Skill_2_9E4FC5804778258FBAA04BBF7F68F799) == 0x000000, "Member 'FFSkillUnlockData::Skill_2_9E4FC5804778258FBAA04BBF7F68F799' has a wrong offset!");
static_assert(offsetof(FFSkillUnlockData, UnlockCost_5_E90ABE13467BBA2959E91AB582E679AF) == 0x000008, "Member 'FFSkillUnlockData::UnlockCost_5_E90ABE13467BBA2959E91AB582E679AF' has a wrong offset!");
static_assert(offsetof(FFSkillUnlockData, IsStartingSkill_13_E1837512408188F4B7D355B6B67B8C1E) == 0x00000C, "Member 'FFSkillUnlockData::IsStartingSkill_13_E1837512408188F4B7D355B6B67B8C1E' has a wrong offset!");
static_assert(offsetof(FFSkillUnlockData, RequiresUnlockItem_18_D9EBC20F41097DD7517E428E4A57655E) == 0x000010, "Member 'FFSkillUnlockData::RequiresUnlockItem_18_D9EBC20F41097DD7517E428E4A57655E' has a wrong offset!");
static_assert(offsetof(FFSkillUnlockData, IsSecret_11_8074DE284785FEC2841D2EBBB4749CF3) == 0x000020, "Member 'FFSkillUnlockData::IsSecret_11_8074DE284785FEC2841D2EBBB4749CF3' has a wrong offset!");

}

