#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FTeamMotivationData

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct FTeamMotivationData.FTeamMotivationData
// 0x0014 (0x0014 - 0x0000)
struct FFTeamMotivationData final
{
public:
	float                                         Sad_31_7A7B459D4A5B946F30633FB69683C5DC;           // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Normal_21_75FBC42D41E351A3512540B97168E9B6;        // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Motivated_26_17DE87D14C3AA49B9A08CA9F9A738AF4;     // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Frenzy_35_DCCAA6E74C7F07FB27B549A4E29AF15D;        // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Maximum_OnFire_34_496DD91C4536B1EA4B85EDA337DAADAA; // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FFTeamMotivationData) == 0x000004, "Wrong alignment on FFTeamMotivationData");
static_assert(sizeof(FFTeamMotivationData) == 0x000014, "Wrong size on FFTeamMotivationData");
static_assert(offsetof(FFTeamMotivationData, Sad_31_7A7B459D4A5B946F30633FB69683C5DC) == 0x000000, "Member 'FFTeamMotivationData::Sad_31_7A7B459D4A5B946F30633FB69683C5DC' has a wrong offset!");
static_assert(offsetof(FFTeamMotivationData, Normal_21_75FBC42D41E351A3512540B97168E9B6) == 0x000004, "Member 'FFTeamMotivationData::Normal_21_75FBC42D41E351A3512540B97168E9B6' has a wrong offset!");
static_assert(offsetof(FFTeamMotivationData, Motivated_26_17DE87D14C3AA49B9A08CA9F9A738AF4) == 0x000008, "Member 'FFTeamMotivationData::Motivated_26_17DE87D14C3AA49B9A08CA9F9A738AF4' has a wrong offset!");
static_assert(offsetof(FFTeamMotivationData, Frenzy_35_DCCAA6E74C7F07FB27B549A4E29AF15D) == 0x00000C, "Member 'FFTeamMotivationData::Frenzy_35_DCCAA6E74C7F07FB27B549A4E29AF15D' has a wrong offset!");
static_assert(offsetof(FFTeamMotivationData, Maximum_OnFire_34_496DD91C4536B1EA4B85EDA337DAADAA) == 0x000010, "Member 'FFTeamMotivationData::Maximum_OnFire_34_496DD91C4536B1EA4B85EDA337DAADAA' has a wrong offset!");

}

