#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FUINavigationNode

#include "Basic.hpp"

#include "EUINavigationLayer_structs.hpp"


namespace SDK
{

// UserDefinedStruct FUINavigationNode.FUINavigationNode
// 0x0040 (0x0040 - 0x0000)
struct FFUINavigationNode final
{
public:
	int32                                         NodeID_17_AB7984144EB4421550DBF89DA374165E;        // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_UINavigationElement_C> Element_11_189FC41B4761AC9E70A25597E4BB0943;  // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ParentNodeID_24_4601CDB44F973CB50E61AEBBE99DE5FC;  // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LeftTargetID_18_AD08C27045ECE8642BA556A70A99DA11;  // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         UpTargetID_19_30011D4345681EC25C52B3A98863F745;    // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         RightTargetID_20_9184D3C2437FA90B935DF18BBE32A38A; // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BottomTargetID_21_2B93F81549E4A22B58FD868EF29BBCD9; // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Outer_27_2C29CC9543CE2F720BA688A46849D0A4;         // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EUINavigationLayer                            NavigationLayer_30_13CC8C5A46873C6FEC7C179FA641A49F; // 0x0038(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FFUINavigationNode) == 0x000008, "Wrong alignment on FFUINavigationNode");
static_assert(sizeof(FFUINavigationNode) == 0x000040, "Wrong size on FFUINavigationNode");
static_assert(offsetof(FFUINavigationNode, NodeID_17_AB7984144EB4421550DBF89DA374165E) == 0x000000, "Member 'FFUINavigationNode::NodeID_17_AB7984144EB4421550DBF89DA374165E' has a wrong offset!");
static_assert(offsetof(FFUINavigationNode, Element_11_189FC41B4761AC9E70A25597E4BB0943) == 0x000008, "Member 'FFUINavigationNode::Element_11_189FC41B4761AC9E70A25597E4BB0943' has a wrong offset!");
static_assert(offsetof(FFUINavigationNode, ParentNodeID_24_4601CDB44F973CB50E61AEBBE99DE5FC) == 0x000018, "Member 'FFUINavigationNode::ParentNodeID_24_4601CDB44F973CB50E61AEBBE99DE5FC' has a wrong offset!");
static_assert(offsetof(FFUINavigationNode, LeftTargetID_18_AD08C27045ECE8642BA556A70A99DA11) == 0x00001C, "Member 'FFUINavigationNode::LeftTargetID_18_AD08C27045ECE8642BA556A70A99DA11' has a wrong offset!");
static_assert(offsetof(FFUINavigationNode, UpTargetID_19_30011D4345681EC25C52B3A98863F745) == 0x000020, "Member 'FFUINavigationNode::UpTargetID_19_30011D4345681EC25C52B3A98863F745' has a wrong offset!");
static_assert(offsetof(FFUINavigationNode, RightTargetID_20_9184D3C2437FA90B935DF18BBE32A38A) == 0x000024, "Member 'FFUINavigationNode::RightTargetID_20_9184D3C2437FA90B935DF18BBE32A38A' has a wrong offset!");
static_assert(offsetof(FFUINavigationNode, BottomTargetID_21_2B93F81549E4A22B58FD868EF29BBCD9) == 0x000028, "Member 'FFUINavigationNode::BottomTargetID_21_2B93F81549E4A22B58FD868EF29BBCD9' has a wrong offset!");
static_assert(offsetof(FFUINavigationNode, Outer_27_2C29CC9543CE2F720BA688A46849D0A4) == 0x000030, "Member 'FFUINavigationNode::Outer_27_2C29CC9543CE2F720BA688A46849D0A4' has a wrong offset!");
static_assert(offsetof(FFUINavigationNode, NavigationLayer_30_13CC8C5A46873C6FEC7C179FA641A49F) == 0x000038, "Member 'FFUINavigationNode::NavigationLayer_30_13CC8C5A46873C6FEC7C179FA641A49F' has a wrong offset!");

}

