#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GameFlowFunctionLibrary

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function GameFlowFunctionLibrary.GameFlowFunctionLibrary_C.FindMapSpawnPointWithTag
// 0x0058 (0x0058 - 0x0000)
struct GameFlowFunctionLibrary_C_FindMapSpawnPointWithTag final
{
public:
	struct FGameplayTag                           SpawnPointTag;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_jRPG_MapSpawnPoint_C*               SpawnPoint;                                        // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_jRPG_MapSpawnPoint_C*               local_SpawnPoint;                                  // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_jRPG_MapSpawnPoint_C*>       CallFunc_GetAllActorsOfClass_OutActors;            // 0x0028(0x0010)(ReferenceParm)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_jRPG_MapSpawnPoint_C*               CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MatchesTag_ReturnValue;                   // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GameFlowFunctionLibrary_C_FindMapSpawnPointWithTag) == 0x000008, "Wrong alignment on GameFlowFunctionLibrary_C_FindMapSpawnPointWithTag");
static_assert(sizeof(GameFlowFunctionLibrary_C_FindMapSpawnPointWithTag) == 0x000058, "Wrong size on GameFlowFunctionLibrary_C_FindMapSpawnPointWithTag");
static_assert(offsetof(GameFlowFunctionLibrary_C_FindMapSpawnPointWithTag, SpawnPointTag) == 0x000000, "Member 'GameFlowFunctionLibrary_C_FindMapSpawnPointWithTag::SpawnPointTag' has a wrong offset!");
static_assert(offsetof(GameFlowFunctionLibrary_C_FindMapSpawnPointWithTag, __WorldContext) == 0x000008, "Member 'GameFlowFunctionLibrary_C_FindMapSpawnPointWithTag::__WorldContext' has a wrong offset!");
static_assert(offsetof(GameFlowFunctionLibrary_C_FindMapSpawnPointWithTag, SpawnPoint) == 0x000010, "Member 'GameFlowFunctionLibrary_C_FindMapSpawnPointWithTag::SpawnPoint' has a wrong offset!");
static_assert(offsetof(GameFlowFunctionLibrary_C_FindMapSpawnPointWithTag, local_SpawnPoint) == 0x000018, "Member 'GameFlowFunctionLibrary_C_FindMapSpawnPointWithTag::local_SpawnPoint' has a wrong offset!");
static_assert(offsetof(GameFlowFunctionLibrary_C_FindMapSpawnPointWithTag, Temp_int_Array_Index_Variable) == 0x000020, "Member 'GameFlowFunctionLibrary_C_FindMapSpawnPointWithTag::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(GameFlowFunctionLibrary_C_FindMapSpawnPointWithTag, CallFunc_GetAllActorsOfClass_OutActors) == 0x000028, "Member 'GameFlowFunctionLibrary_C_FindMapSpawnPointWithTag::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(GameFlowFunctionLibrary_C_FindMapSpawnPointWithTag, Temp_int_Loop_Counter_Variable) == 0x000038, "Member 'GameFlowFunctionLibrary_C_FindMapSpawnPointWithTag::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(GameFlowFunctionLibrary_C_FindMapSpawnPointWithTag, CallFunc_Array_Get_Item) == 0x000040, "Member 'GameFlowFunctionLibrary_C_FindMapSpawnPointWithTag::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GameFlowFunctionLibrary_C_FindMapSpawnPointWithTag, CallFunc_Add_IntInt_ReturnValue) == 0x000048, "Member 'GameFlowFunctionLibrary_C_FindMapSpawnPointWithTag::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameFlowFunctionLibrary_C_FindMapSpawnPointWithTag, CallFunc_MatchesTag_ReturnValue) == 0x00004C, "Member 'GameFlowFunctionLibrary_C_FindMapSpawnPointWithTag::CallFunc_MatchesTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameFlowFunctionLibrary_C_FindMapSpawnPointWithTag, CallFunc_Array_Length_ReturnValue) == 0x000050, "Member 'GameFlowFunctionLibrary_C_FindMapSpawnPointWithTag::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameFlowFunctionLibrary_C_FindMapSpawnPointWithTag, CallFunc_Less_IntInt_ReturnValue) == 0x000054, "Member 'GameFlowFunctionLibrary_C_FindMapSpawnPointWithTag::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

}

