#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GenericFunctionLibrary

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "EUINavigationDirection_structs.hpp"
#include "FBattleSequenceTimelineKeyframe_structs.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Slate_structs.hpp"
#include "UMG_structs.hpp"
#include "EOptionalBoolean_structs.hpp"
#include "RigLogicModule_structs.hpp"


namespace SDK::Params
{

// Function GenericFunctionLibrary.GenericFunctionLibrary_C.ConcatenateSoftObjectDisplayNames
// 0x00C0 (0x00C0 - 0x0000)
struct GenericFunctionLibrary_C_ConcatenateSoftObjectDisplayNames final
{
public:
	TArray<TSoftObjectPtr<class UObject>>         Objects;                                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FString                                 Separator;                                         // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 Result;                                            // 0x0028(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	TArray<class FString>                         Temp_wildcard_We_need_a_second_array_to_store_the_result_and_be_able_to_wipe_the_first__buffer__array_Variable; // 0x0038(0x0010)(ConstParm, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_JoinStringArray_ReturnValue;              // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FString>                         Temp_wildcard_Temp_buffer_array_Variable;          // 0x0070(0x0010)(ConstParm, ReferenceParm)
	TSoftObjectPtr<class UObject>                 CallFunc_Array_Get_Item;                           // 0x0080(0x0028)(HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_SoftObjectReferenceToString_ReturnValue; // 0x00A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GenericFunctionLibrary_C_ConcatenateSoftObjectDisplayNames) == 0x000008, "Wrong alignment on GenericFunctionLibrary_C_ConcatenateSoftObjectDisplayNames");
static_assert(sizeof(GenericFunctionLibrary_C_ConcatenateSoftObjectDisplayNames) == 0x0000C0, "Wrong size on GenericFunctionLibrary_C_ConcatenateSoftObjectDisplayNames");
static_assert(offsetof(GenericFunctionLibrary_C_ConcatenateSoftObjectDisplayNames, Objects) == 0x000000, "Member 'GenericFunctionLibrary_C_ConcatenateSoftObjectDisplayNames::Objects' has a wrong offset!");
static_assert(offsetof(GenericFunctionLibrary_C_ConcatenateSoftObjectDisplayNames, Separator) == 0x000010, "Member 'GenericFunctionLibrary_C_ConcatenateSoftObjectDisplayNames::Separator' has a wrong offset!");
static_assert(offsetof(GenericFunctionLibrary_C_ConcatenateSoftObjectDisplayNames, __WorldContext) == 0x000020, "Member 'GenericFunctionLibrary_C_ConcatenateSoftObjectDisplayNames::__WorldContext' has a wrong offset!");
static_assert(offsetof(GenericFunctionLibrary_C_ConcatenateSoftObjectDisplayNames, Result) == 0x000028, "Member 'GenericFunctionLibrary_C_ConcatenateSoftObjectDisplayNames::Result' has a wrong offset!");
static_assert(offsetof(GenericFunctionLibrary_C_ConcatenateSoftObjectDisplayNames, Temp_wildcard_We_need_a_second_array_to_store_the_result_and_be_able_to_wipe_the_first__buffer__array_Variable) == 0x000038, "Member 'GenericFunctionLibrary_C_ConcatenateSoftObjectDisplayNames::Temp_wildcard_We_need_a_second_array_to_store_the_result_and_be_able_to_wipe_the_first__buffer__array_Variable' has a wrong offset!");
static_assert(offsetof(GenericFunctionLibrary_C_ConcatenateSoftObjectDisplayNames, CallFunc_Array_Length_ReturnValue) == 0x000048, "Member 'GenericFunctionLibrary_C_ConcatenateSoftObjectDisplayNames::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(GenericFunctionLibrary_C_ConcatenateSoftObjectDisplayNames, CallFunc_JoinStringArray_ReturnValue) == 0x000050, "Member 'GenericFunctionLibrary_C_ConcatenateSoftObjectDisplayNames::CallFunc_JoinStringArray_ReturnValue' has a wrong offset!");
static_assert(offsetof(GenericFunctionLibrary_C_ConcatenateSoftObjectDisplayNames, Temp_int_Loop_Counter_Variable) == 0x000060, "Member 'GenericFunctionLibrary_C_ConcatenateSoftObjectDisplayNames::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(GenericFunctionLibrary_C_ConcatenateSoftObjectDisplayNames, CallFunc_Less_IntInt_ReturnValue) == 0x000064, "Member 'GenericFunctionLibrary_C_ConcatenateSoftObjectDisplayNames::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GenericFunctionLibrary_C_ConcatenateSoftObjectDisplayNames, CallFunc_Add_IntInt_ReturnValue) == 0x000068, "Member 'GenericFunctionLibrary_C_ConcatenateSoftObjectDisplayNames::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GenericFunctionLibrary_C_ConcatenateSoftObjectDisplayNames, Temp_int_Array_Index_Variable) == 0x00006C, "Member 'GenericFunctionLibrary_C_ConcatenateSoftObjectDisplayNames::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(GenericFunctionLibrary_C_ConcatenateSoftObjectDisplayNames, Temp_wildcard_Temp_buffer_array_Variable) == 0x000070, "Member 'GenericFunctionLibrary_C_ConcatenateSoftObjectDisplayNames::Temp_wildcard_Temp_buffer_array_Variable' has a wrong offset!");
static_assert(offsetof(GenericFunctionLibrary_C_ConcatenateSoftObjectDisplayNames, CallFunc_Array_Get_Item) == 0x000080, "Member 'GenericFunctionLibrary_C_ConcatenateSoftObjectDisplayNames::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GenericFunctionLibrary_C_ConcatenateSoftObjectDisplayNames, CallFunc_Conv_SoftObjectReferenceToString_ReturnValue) == 0x0000A8, "Member 'GenericFunctionLibrary_C_ConcatenateSoftObjectDisplayNames::CallFunc_Conv_SoftObjectReferenceToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(GenericFunctionLibrary_C_ConcatenateSoftObjectDisplayNames, CallFunc_Array_Add_ReturnValue) == 0x0000B8, "Member 'GenericFunctionLibrary_C_ConcatenateSoftObjectDisplayNames::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function GenericFunctionLibrary.GenericFunctionLibrary_C.IsInEditorPreview
// 0x0010 (0x0010 - 0x0000)
struct GenericFunctionLibrary_C_IsInEditorPreview final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInPlayMode_ReturnValue;                 // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPackagedBuild_ReturnValue;              // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GenericFunctionLibrary_C_IsInEditorPreview) == 0x000008, "Wrong alignment on GenericFunctionLibrary_C_IsInEditorPreview");
static_assert(sizeof(GenericFunctionLibrary_C_IsInEditorPreview) == 0x000010, "Wrong size on GenericFunctionLibrary_C_IsInEditorPreview");
static_assert(offsetof(GenericFunctionLibrary_C_IsInEditorPreview, __WorldContext) == 0x000000, "Member 'GenericFunctionLibrary_C_IsInEditorPreview::__WorldContext' has a wrong offset!");
static_assert(offsetof(GenericFunctionLibrary_C_IsInEditorPreview, ReturnValue) == 0x000008, "Member 'GenericFunctionLibrary_C_IsInEditorPreview::ReturnValue' has a wrong offset!");
static_assert(offsetof(GenericFunctionLibrary_C_IsInEditorPreview, CallFunc_IsInPlayMode_ReturnValue) == 0x000009, "Member 'GenericFunctionLibrary_C_IsInEditorPreview::CallFunc_IsInPlayMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(GenericFunctionLibrary_C_IsInEditorPreview, CallFunc_IsPackagedBuild_ReturnValue) == 0x00000A, "Member 'GenericFunctionLibrary_C_IsInEditorPreview::CallFunc_IsPackagedBuild_ReturnValue' has a wrong offset!");
static_assert(offsetof(GenericFunctionLibrary_C_IsInEditorPreview, CallFunc_Not_PreBool_ReturnValue) == 0x00000B, "Member 'GenericFunctionLibrary_C_IsInEditorPreview::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(GenericFunctionLibrary_C_IsInEditorPreview, CallFunc_Not_PreBool_ReturnValue_1) == 0x00000C, "Member 'GenericFunctionLibrary_C_IsInEditorPreview::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GenericFunctionLibrary_C_IsInEditorPreview, CallFunc_BooleanAND_ReturnValue) == 0x00000D, "Member 'GenericFunctionLibrary_C_IsInEditorPreview::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function GenericFunctionLibrary.GenericFunctionLibrary_C.CompareIntegers
// 0x0030 (0x0030 - 0x0000)
struct GenericFunctionLibrary_C_CompareIntegers final
{
public:
	uint8                                         Comparison;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         A;                                                 // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         B;                                                 // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Local_B_Value;                                     // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Local_A_Value;                                     // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0027(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GenericFunctionLibrary_C_CompareIntegers) == 0x000008, "Wrong alignment on GenericFunctionLibrary_C_CompareIntegers");
static_assert(sizeof(GenericFunctionLibrary_C_CompareIntegers) == 0x000030, "Wrong size on GenericFunctionLibrary_C_CompareIntegers");
static_assert(offsetof(GenericFunctionLibrary_C_CompareIntegers, Comparison) == 0x000000, "Member 'GenericFunctionLibrary_C_CompareIntegers::Comparison' has a wrong offset!");
static_assert(offsetof(GenericFunctionLibrary_C_CompareIntegers, A) == 0x000004, "Member 'GenericFunctionLibrary_C_CompareIntegers::A' has a wrong offset!");
static_assert(offsetof(GenericFunctionLibrary_C_CompareIntegers, B) == 0x000008, "Member 'GenericFunctionLibrary_C_CompareIntegers::B' has a wrong offset!");
static_assert(offsetof(GenericFunctionLibrary_C_CompareIntegers, __WorldContext) == 0x000010, "Member 'GenericFunctionLibrary_C_CompareIntegers::__WorldContext' has a wrong offset!");
static_assert(offsetof(GenericFunctionLibrary_C_CompareIntegers, ReturnValue) == 0x000018, "Member 'GenericFunctionLibrary_C_CompareIntegers::ReturnValue' has a wrong offset!");
static_assert(offsetof(GenericFunctionLibrary_C_CompareIntegers, Local_B_Value) == 0x00001C, "Member 'GenericFunctionLibrary_C_CompareIntegers::Local_B_Value' has a wrong offset!");
static_assert(offsetof(GenericFunctionLibrary_C_CompareIntegers, Local_A_Value) == 0x000020, "Member 'GenericFunctionLibrary_C_CompareIntegers::Local_A_Value' has a wrong offset!");
static_assert(offsetof(GenericFunctionLibrary_C_CompareIntegers, K2Node_SwitchEnum_CmpSuccess) == 0x000024, "Member 'GenericFunctionLibrary_C_CompareIntegers::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(GenericFunctionLibrary_C_CompareIntegers, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000025, "Member 'GenericFunctionLibrary_C_CompareIntegers::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GenericFunctionLibrary_C_CompareIntegers, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000026, "Member 'GenericFunctionLibrary_C_CompareIntegers::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GenericFunctionLibrary_C_CompareIntegers, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000027, "Member 'GenericFunctionLibrary_C_CompareIntegers::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GenericFunctionLibrary_C_CompareIntegers, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000028, "Member 'GenericFunctionLibrary_C_CompareIntegers::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GenericFunctionLibrary_C_CompareIntegers, CallFunc_Greater_IntInt_ReturnValue) == 0x000029, "Member 'GenericFunctionLibrary_C_CompareIntegers::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GenericFunctionLibrary_C_CompareIntegers, CallFunc_Less_IntInt_ReturnValue) == 0x00002A, "Member 'GenericFunctionLibrary_C_CompareIntegers::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function GenericFunctionLibrary.GenericFunctionLibrary_C.IsCurrentPlatformConsole
// 0x0040 (0x0040 - 0x0000)
struct GenericFunctionLibrary_C_IsCurrentPlatformConsole final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CurrentPlatformIsConsole;                          // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_MakeLiteralGameplayTagContainer_ReturnValue; // 0x0010(0x0020)()
	struct FGameplayTag                           CallFunc_GetPlatformNameAsTag_ReturnValue;         // 0x0030(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GenericFunctionLibrary_C_IsCurrentPlatformConsole) == 0x000008, "Wrong alignment on GenericFunctionLibrary_C_IsCurrentPlatformConsole");
static_assert(sizeof(GenericFunctionLibrary_C_IsCurrentPlatformConsole) == 0x000040, "Wrong size on GenericFunctionLibrary_C_IsCurrentPlatformConsole");
static_assert(offsetof(GenericFunctionLibrary_C_IsCurrentPlatformConsole, __WorldContext) == 0x000000, "Member 'GenericFunctionLibrary_C_IsCurrentPlatformConsole::__WorldContext' has a wrong offset!");
static_assert(offsetof(GenericFunctionLibrary_C_IsCurrentPlatformConsole, CurrentPlatformIsConsole) == 0x000008, "Member 'GenericFunctionLibrary_C_IsCurrentPlatformConsole::CurrentPlatformIsConsole' has a wrong offset!");
static_assert(offsetof(GenericFunctionLibrary_C_IsCurrentPlatformConsole, CallFunc_MakeLiteralGameplayTagContainer_ReturnValue) == 0x000010, "Member 'GenericFunctionLibrary_C_IsCurrentPlatformConsole::CallFunc_MakeLiteralGameplayTagContainer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GenericFunctionLibrary_C_IsCurrentPlatformConsole, CallFunc_GetPlatformNameAsTag_ReturnValue) == 0x000030, "Member 'GenericFunctionLibrary_C_IsCurrentPlatformConsole::CallFunc_GetPlatformNameAsTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GenericFunctionLibrary_C_IsCurrentPlatformConsole, CallFunc_HasTag_ReturnValue) == 0x000038, "Member 'GenericFunctionLibrary_C_IsCurrentPlatformConsole::CallFunc_HasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GenericFunctionLibrary_C_IsCurrentPlatformConsole, CallFunc_Not_PreBool_ReturnValue) == 0x000039, "Member 'GenericFunctionLibrary_C_IsCurrentPlatformConsole::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function GenericFunctionLibrary.GenericFunctionLibrary_C.AddIfValid
// 0x0028 (0x0028 - 0x0000)
struct GenericFunctionLibrary_C_AddIfValid final
{
public:
	class UObject*                                Object;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UObject*>                        Array;                                             // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UObject*                                __WorldContext;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GenericFunctionLibrary_C_AddIfValid) == 0x000008, "Wrong alignment on GenericFunctionLibrary_C_AddIfValid");
static_assert(sizeof(GenericFunctionLibrary_C_AddIfValid) == 0x000028, "Wrong size on GenericFunctionLibrary_C_AddIfValid");
static_assert(offsetof(GenericFunctionLibrary_C_AddIfValid, Object) == 0x000000, "Member 'GenericFunctionLibrary_C_AddIfValid::Object' has a wrong offset!");
static_assert(offsetof(GenericFunctionLibrary_C_AddIfValid, Array) == 0x000008, "Member 'GenericFunctionLibrary_C_AddIfValid::Array' has a wrong offset!");
static_assert(offsetof(GenericFunctionLibrary_C_AddIfValid, __WorldContext) == 0x000018, "Member 'GenericFunctionLibrary_C_AddIfValid::__WorldContext' has a wrong offset!");
static_assert(offsetof(GenericFunctionLibrary_C_AddIfValid, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'GenericFunctionLibrary_C_AddIfValid::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GenericFunctionLibrary_C_AddIfValid, CallFunc_Array_Add_ReturnValue) == 0x000024, "Member 'GenericFunctionLibrary_C_AddIfValid::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function GenericFunctionLibrary.GenericFunctionLibrary_C.ToTextArray_(String)
// 0x0088 (0x0088 - 0x0000)
struct GenericFunctionLibrary_C_ToTextArray__String_ final
{
public:
	TArray<class FString>                         StringArray;                                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class FText>                           TextArray;                                         // 0x0018(0x0010)(Parm, OutParm)
	TArray<class FText>                           Temp_wildcard_We_need_a_second_array_to_store_the_result_and_be_able_to_wipe_the_first__buffer__array_Variable; // 0x0028(0x0010)(ConstParm, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FText>                           Temp_wildcard_Temp_buffer_array_Variable;          // 0x0050(0x0010)(ConstParm, ReferenceParm)
	class FString                                 CallFunc_Array_Get_Item;                           // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0070(0x0010)()
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GenericFunctionLibrary_C_ToTextArray__String_) == 0x000008, "Wrong alignment on GenericFunctionLibrary_C_ToTextArray__String_");
static_assert(sizeof(GenericFunctionLibrary_C_ToTextArray__String_) == 0x000088, "Wrong size on GenericFunctionLibrary_C_ToTextArray__String_");
static_assert(offsetof(GenericFunctionLibrary_C_ToTextArray__String_, StringArray) == 0x000000, "Member 'GenericFunctionLibrary_C_ToTextArray__String_::StringArray' has a wrong offset!");
static_assert(offsetof(GenericFunctionLibrary_C_ToTextArray__String_, __WorldContext) == 0x000010, "Member 'GenericFunctionLibrary_C_ToTextArray__String_::__WorldContext' has a wrong offset!");
static_assert(offsetof(GenericFunctionLibrary_C_ToTextArray__String_, TextArray) == 0x000018, "Member 'GenericFunctionLibrary_C_ToTextArray__String_::TextArray' has a wrong offset!");
static_assert(offsetof(GenericFunctionLibrary_C_ToTextArray__String_, Temp_wildcard_We_need_a_second_array_to_store_the_result_and_be_able_to_wipe_the_first__buffer__array_Variable) == 0x000028, "Member 'GenericFunctionLibrary_C_ToTextArray__String_::Temp_wildcard_We_need_a_second_array_to_store_the_result_and_be_able_to_wipe_the_first__buffer__array_Variable' has a wrong offset!");
static_assert(offsetof(GenericFunctionLibrary_C_ToTextArray__String_, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'GenericFunctionLibrary_C_ToTextArray__String_::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(GenericFunctionLibrary_C_ToTextArray__String_, Temp_int_Loop_Counter_Variable) == 0x00003C, "Member 'GenericFunctionLibrary_C_ToTextArray__String_::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(GenericFunctionLibrary_C_ToTextArray__String_, CallFunc_Less_IntInt_ReturnValue) == 0x000040, "Member 'GenericFunctionLibrary_C_ToTextArray__String_::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GenericFunctionLibrary_C_ToTextArray__String_, CallFunc_Add_IntInt_ReturnValue) == 0x000044, "Member 'GenericFunctionLibrary_C_ToTextArray__String_::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GenericFunctionLibrary_C_ToTextArray__String_, Temp_int_Array_Index_Variable) == 0x000048, "Member 'GenericFunctionLibrary_C_ToTextArray__String_::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(GenericFunctionLibrary_C_ToTextArray__String_, Temp_wildcard_Temp_buffer_array_Variable) == 0x000050, "Member 'GenericFunctionLibrary_C_ToTextArray__String_::Temp_wildcard_Temp_buffer_array_Variable' has a wrong offset!");
static_assert(offsetof(GenericFunctionLibrary_C_ToTextArray__String_, CallFunc_Array_Get_Item) == 0x000060, "Member 'GenericFunctionLibrary_C_ToTextArray__String_::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GenericFunctionLibrary_C_ToTextArray__String_, CallFunc_Conv_StringToText_ReturnValue) == 0x000070, "Member 'GenericFunctionLibrary_C_ToTextArray__String_::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(GenericFunctionLibrary_C_ToTextArray__String_, CallFunc_Array_Add_ReturnValue) == 0x000080, "Member 'GenericFunctionLibrary_C_ToTextArray__String_::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function GenericFunctionLibrary.GenericFunctionLibrary_C.ValidateObjectArray
// 0x01A0 (0x01A0 - 0x0000)
struct GenericFunctionLibrary_C_ValidateObjectArray final
{
public:
	TArray<class UObject*>                        Array;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FString                                 ArrayName;                                         // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          IsValid;                                           // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ErrorMessage;                                      // 0x0030(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0040(0x0010)()
	class FText                                   CallFunc_Conv_ObjectToText_ReturnValue;            // 0x0050(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0060(0x0048)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00A8(0x0048)(HasGetValueTypeHash)
	bool                                          CallFunc_ArrayContainsInvalid_Result;              // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 CallFunc_ArrayContainsInvalid_ArrayIndex;          // 0x00F8(0x0010)(ReferenceParm)
	TArray<class FString>                         CallFunc_ToStringArray__integer__StringArray;      // 0x0108(0x0010)(ReferenceParm)
	class FString                                 CallFunc_JoinStringArray_ReturnValue;              // 0x0118(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0128(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0138(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0180(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Format_ReturnValue;                       // 0x0190(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(GenericFunctionLibrary_C_ValidateObjectArray) == 0x000008, "Wrong alignment on GenericFunctionLibrary_C_ValidateObjectArray");
static_assert(sizeof(GenericFunctionLibrary_C_ValidateObjectArray) == 0x0001A0, "Wrong size on GenericFunctionLibrary_C_ValidateObjectArray");
static_assert(offsetof(GenericFunctionLibrary_C_ValidateObjectArray, Array) == 0x000000, "Member 'GenericFunctionLibrary_C_ValidateObjectArray::Array' has a wrong offset!");
static_assert(offsetof(GenericFunctionLibrary_C_ValidateObjectArray, ArrayName) == 0x000010, "Member 'GenericFunctionLibrary_C_ValidateObjectArray::ArrayName' has a wrong offset!");
static_assert(offsetof(GenericFunctionLibrary_C_ValidateObjectArray, __WorldContext) == 0x000020, "Member 'GenericFunctionLibrary_C_ValidateObjectArray::__WorldContext' has a wrong offset!");
static_assert(offsetof(GenericFunctionLibrary_C_ValidateObjectArray, IsValid) == 0x000028, "Member 'GenericFunctionLibrary_C_ValidateObjectArray::IsValid' has a wrong offset!");
static_assert(offsetof(GenericFunctionLibrary_C_ValidateObjectArray, ErrorMessage) == 0x000030, "Member 'GenericFunctionLibrary_C_ValidateObjectArray::ErrorMessage' has a wrong offset!");
static_assert(offsetof(GenericFunctionLibrary_C_ValidateObjectArray, CallFunc_Conv_StringToText_ReturnValue) == 0x000040, "Member 'GenericFunctionLibrary_C_ValidateObjectArray::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(GenericFunctionLibrary_C_ValidateObjectArray, CallFunc_Conv_ObjectToText_ReturnValue) == 0x000050, "Member 'GenericFunctionLibrary_C_ValidateObjectArray::CallFunc_Conv_ObjectToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(GenericFunctionLibrary_C_ValidateObjectArray, K2Node_MakeStruct_FormatArgumentData) == 0x000060, "Member 'GenericFunctionLibrary_C_ValidateObjectArray::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(GenericFunctionLibrary_C_ValidateObjectArray, K2Node_MakeStruct_FormatArgumentData_1) == 0x0000A8, "Member 'GenericFunctionLibrary_C_ValidateObjectArray::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(GenericFunctionLibrary_C_ValidateObjectArray, CallFunc_ArrayContainsInvalid_Result) == 0x0000F0, "Member 'GenericFunctionLibrary_C_ValidateObjectArray::CallFunc_ArrayContainsInvalid_Result' has a wrong offset!");
static_assert(offsetof(GenericFunctionLibrary_C_ValidateObjectArray, CallFunc_ArrayContainsInvalid_ArrayIndex) == 0x0000F8, "Member 'GenericFunctionLibrary_C_ValidateObjectArray::CallFunc_ArrayContainsInvalid_ArrayIndex' has a wrong offset!");
static_assert(offsetof(GenericFunctionLibrary_C_ValidateObjectArray, CallFunc_ToStringArray__integer__StringArray) == 0x000108, "Member 'GenericFunctionLibrary_C_ValidateObjectArray::CallFunc_ToStringArray__integer__StringArray' has a wrong offset!");
static_assert(offsetof(GenericFunctionLibrary_C_ValidateObjectArray, CallFunc_JoinStringArray_ReturnValue) == 0x000118, "Member 'GenericFunctionLibrary_C_ValidateObjectArray::CallFunc_JoinStringArray_ReturnValue' has a wrong offset!");
static_assert(offsetof(GenericFunctionLibrary_C_ValidateObjectArray, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000128, "Member 'GenericFunctionLibrary_C_ValidateObjectArray::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GenericFunctionLibrary_C_ValidateObjectArray, K2Node_MakeStruct_FormatArgumentData_2) == 0x000138, "Member 'GenericFunctionLibrary_C_ValidateObjectArray::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(GenericFunctionLibrary_C_ValidateObjectArray, K2Node_MakeArray_Array) == 0x000180, "Member 'GenericFunctionLibrary_C_ValidateObjectArray::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(GenericFunctionLibrary_C_ValidateObjectArray, CallFunc_Format_ReturnValue) == 0x000190, "Member 'GenericFunctionLibrary_C_ValidateObjectArray::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function GenericFunctionLibrary.GenericFunctionLibrary_C.CheckObjectArray
// 0x0048 (0x0048 - 0x0000)
struct GenericFunctionLibrary_C_CheckObjectArray final
{
public:
	TArray<class UObject*>                        Array;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FString                                 ArrayName;                                         // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ValidateObjectArray_IsValid;              // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_ValidateObjectArray_ErrorMessage;         // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GenericFunctionLibrary_C_CheckObjectArray) == 0x000008, "Wrong alignment on GenericFunctionLibrary_C_CheckObjectArray");
static_assert(sizeof(GenericFunctionLibrary_C_CheckObjectArray) == 0x000048, "Wrong size on GenericFunctionLibrary_C_CheckObjectArray");
static_assert(offsetof(GenericFunctionLibrary_C_CheckObjectArray, Array) == 0x000000, "Member 'GenericFunctionLibrary_C_CheckObjectArray::Array' has a wrong offset!");
static_assert(offsetof(GenericFunctionLibrary_C_CheckObjectArray, ArrayName) == 0x000010, "Member 'GenericFunctionLibrary_C_CheckObjectArray::ArrayName' has a wrong offset!");
static_assert(offsetof(GenericFunctionLibrary_C_CheckObjectArray, __WorldContext) == 0x000020, "Member 'GenericFunctionLibrary_C_CheckObjectArray::__WorldContext' has a wrong offset!");
static_assert(offsetof(GenericFunctionLibrary_C_CheckObjectArray, CallFunc_ValidateObjectArray_IsValid) == 0x000028, "Member 'GenericFunctionLibrary_C_CheckObjectArray::CallFunc_ValidateObjectArray_IsValid' has a wrong offset!");
static_assert(offsetof(GenericFunctionLibrary_C_CheckObjectArray, CallFunc_ValidateObjectArray_ErrorMessage) == 0x000030, "Member 'GenericFunctionLibrary_C_CheckObjectArray::CallFunc_ValidateObjectArray_ErrorMessage' has a wrong offset!");
static_assert(offsetof(GenericFunctionLibrary_C_CheckObjectArray, CallFunc_Not_PreBool_ReturnValue) == 0x000040, "Member 'GenericFunctionLibrary_C_CheckObjectArray::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function GenericFunctionLibrary.GenericFunctionLibrary_C.ToStringArray_(integer)
// 0x0080 (0x0080 - 0x0000)
struct GenericFunctionLibrary_C_ToStringArray__integer_ final
{
public:
	TArray<int32>                                 IntegerArray;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class FString>                         StringArray;                                       // 0x0018(0x0010)(Parm, OutParm)
	TArray<class FString>                         Temp_wildcard_We_need_a_second_array_to_store_the_result_and_be_able_to_wipe_the_first__buffer__array_Variable; // 0x0028(0x0010)(ConstParm, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         Temp_wildcard_Temp_buffer_array_Variable;          // 0x0050(0x0010)(ConstParm, ReferenceParm)
	int32                                         CallFunc_Array_Get_Item;                           // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GenericFunctionLibrary_C_ToStringArray__integer_) == 0x000008, "Wrong alignment on GenericFunctionLibrary_C_ToStringArray__integer_");
static_assert(sizeof(GenericFunctionLibrary_C_ToStringArray__integer_) == 0x000080, "Wrong size on GenericFunctionLibrary_C_ToStringArray__integer_");
static_assert(offsetof(GenericFunctionLibrary_C_ToStringArray__integer_, IntegerArray) == 0x000000, "Member 'GenericFunctionLibrary_C_ToStringArray__integer_::IntegerArray' has a wrong offset!");
static_assert(offsetof(GenericFunctionLibrary_C_ToStringArray__integer_, __WorldContext) == 0x000010, "Member 'GenericFunctionLibrary_C_ToStringArray__integer_::__WorldContext' has a wrong offset!");
static_assert(offsetof(GenericFunctionLibrary_C_ToStringArray__integer_, StringArray) == 0x000018, "Member 'GenericFunctionLibrary_C_ToStringArray__integer_::StringArray' has a wrong offset!");
static_assert(offsetof(GenericFunctionLibrary_C_ToStringArray__integer_, Temp_wildcard_We_need_a_second_array_to_store_the_result_and_be_able_to_wipe_the_first__buffer__array_Variable) == 0x000028, "Member 'GenericFunctionLibrary_C_ToStringArray__integer_::Temp_wildcard_We_need_a_second_array_to_store_the_result_and_be_able_to_wipe_the_first__buffer__array_Variable' has a wrong offset!");
static_assert(offsetof(GenericFunctionLibrary_C_ToStringArray__integer_, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'GenericFunctionLibrary_C_ToStringArray__integer_::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(GenericFunctionLibrary_C_ToStringArray__integer_, Temp_int_Loop_Counter_Variable) == 0x00003C, "Member 'GenericFunctionLibrary_C_ToStringArray__integer_::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(GenericFunctionLibrary_C_ToStringArray__integer_, CallFunc_Less_IntInt_ReturnValue) == 0x000040, "Member 'GenericFunctionLibrary_C_ToStringArray__integer_::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GenericFunctionLibrary_C_ToStringArray__integer_, CallFunc_Add_IntInt_ReturnValue) == 0x000044, "Member 'GenericFunctionLibrary_C_ToStringArray__integer_::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GenericFunctionLibrary_C_ToStringArray__integer_, Temp_int_Array_Index_Variable) == 0x000048, "Member 'GenericFunctionLibrary_C_ToStringArray__integer_::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(GenericFunctionLibrary_C_ToStringArray__integer_, Temp_wildcard_Temp_buffer_array_Variable) == 0x000050, "Member 'GenericFunctionLibrary_C_ToStringArray__integer_::Temp_wildcard_Temp_buffer_array_Variable' has a wrong offset!");
static_assert(offsetof(GenericFunctionLibrary_C_ToStringArray__integer_, CallFunc_Array_Get_Item) == 0x000060, "Member 'GenericFunctionLibrary_C_ToStringArray__integer_::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GenericFunctionLibrary_C_ToStringArray__integer_, CallFunc_Conv_IntToString_ReturnValue) == 0x000068, "Member 'GenericFunctionLibrary_C_ToStringArray__integer_::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(GenericFunctionLibrary_C_ToStringArray__integer_, CallFunc_Array_Add_ReturnValue) == 0x000078, "Member 'GenericFunctionLibrary_C_ToStringArray__integer_::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function GenericFunctionLibrary.GenericFunctionLibrary_C.SetCanvasSlotAsHorizontalFillPercentage
// 0x0080 (0x0080 - 0x0000)
struct GenericFunctionLibrary_C_SetCanvasSlotAsHorizontalFillPercentage final
{
public:
	class UCanvasPanelSlot*                       Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        FillAlpha;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnchors                               K2Node_MakeStruct_Anchors;                         // 0x0060(0x0020)(NoDestructor)
};
static_assert(alignof(GenericFunctionLibrary_C_SetCanvasSlotAsHorizontalFillPercentage) == 0x000008, "Wrong alignment on GenericFunctionLibrary_C_SetCanvasSlotAsHorizontalFillPercentage");
static_assert(sizeof(GenericFunctionLibrary_C_SetCanvasSlotAsHorizontalFillPercentage) == 0x000080, "Wrong size on GenericFunctionLibrary_C_SetCanvasSlotAsHorizontalFillPercentage");
static_assert(offsetof(GenericFunctionLibrary_C_SetCanvasSlotAsHorizontalFillPercentage, Target) == 0x000000, "Member 'GenericFunctionLibrary_C_SetCanvasSlotAsHorizontalFillPercentage::Target' has a wrong offset!");
static_assert(offsetof(GenericFunctionLibrary_C_SetCanvasSlotAsHorizontalFillPercentage, FillAlpha) == 0x000008, "Member 'GenericFunctionLibrary_C_SetCanvasSlotAsHorizontalFillPercentage::FillAlpha' has a wrong offset!");
static_assert(offsetof(GenericFunctionLibrary_C_SetCanvasSlotAsHorizontalFillPercentage, __WorldContext) == 0x000010, "Member 'GenericFunctionLibrary_C_SetCanvasSlotAsHorizontalFillPercentage::__WorldContext' has a wrong offset!");
static_assert(offsetof(GenericFunctionLibrary_C_SetCanvasSlotAsHorizontalFillPercentage, K2Node_MakeStruct_Margin) == 0x000018, "Member 'GenericFunctionLibrary_C_SetCanvasSlotAsHorizontalFillPercentage::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(GenericFunctionLibrary_C_SetCanvasSlotAsHorizontalFillPercentage, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000028, "Member 'GenericFunctionLibrary_C_SetCanvasSlotAsHorizontalFillPercentage::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GenericFunctionLibrary_C_SetCanvasSlotAsHorizontalFillPercentage, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000030, "Member 'GenericFunctionLibrary_C_SetCanvasSlotAsHorizontalFillPercentage::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GenericFunctionLibrary_C_SetCanvasSlotAsHorizontalFillPercentage, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000038, "Member 'GenericFunctionLibrary_C_SetCanvasSlotAsHorizontalFillPercentage::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GenericFunctionLibrary_C_SetCanvasSlotAsHorizontalFillPercentage, CallFunc_MakeVector2D_ReturnValue) == 0x000040, "Member 'GenericFunctionLibrary_C_SetCanvasSlotAsHorizontalFillPercentage::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(GenericFunctionLibrary_C_SetCanvasSlotAsHorizontalFillPercentage, CallFunc_MakeVector2D_ReturnValue_1) == 0x000050, "Member 'GenericFunctionLibrary_C_SetCanvasSlotAsHorizontalFillPercentage::CallFunc_MakeVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GenericFunctionLibrary_C_SetCanvasSlotAsHorizontalFillPercentage, K2Node_MakeStruct_Anchors) == 0x000060, "Member 'GenericFunctionLibrary_C_SetCanvasSlotAsHorizontalFillPercentage::K2Node_MakeStruct_Anchors' has a wrong offset!");

// Function GenericFunctionLibrary.GenericFunctionLibrary_C.ArrayOfFloatsToString
// 0x00B0 (0x00B0 - 0x0000)
struct GenericFunctionLibrary_C_ArrayOfFloatsToString final
{
public:
	TArray<double>                                In;                                                // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 OutString;                                         // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	int32                                         local_LastIndex;                                   // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 local_String;                                      // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         Temp_wildcard_We_need_a_second_array_to_store_the_result_and_be_able_to_wipe_the_first__buffer__array_Variable; // 0x0048(0x0010)(ConstParm, ReferenceParm)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_JoinStringArray_ReturnValue;              // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         Temp_wildcard_Temp_buffer_array_Variable;          // 0x0080(0x0010)(ConstParm, ReferenceParm)
	double                                        CallFunc_Array_Get_Item;                           // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_DoubleToString_ReturnValue;          // 0x0098(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GenericFunctionLibrary_C_ArrayOfFloatsToString) == 0x000008, "Wrong alignment on GenericFunctionLibrary_C_ArrayOfFloatsToString");
static_assert(sizeof(GenericFunctionLibrary_C_ArrayOfFloatsToString) == 0x0000B0, "Wrong size on GenericFunctionLibrary_C_ArrayOfFloatsToString");
static_assert(offsetof(GenericFunctionLibrary_C_ArrayOfFloatsToString, In) == 0x000000, "Member 'GenericFunctionLibrary_C_ArrayOfFloatsToString::In' has a wrong offset!");
static_assert(offsetof(GenericFunctionLibrary_C_ArrayOfFloatsToString, __WorldContext) == 0x000010, "Member 'GenericFunctionLibrary_C_ArrayOfFloatsToString::__WorldContext' has a wrong offset!");
static_assert(offsetof(GenericFunctionLibrary_C_ArrayOfFloatsToString, OutString) == 0x000018, "Member 'GenericFunctionLibrary_C_ArrayOfFloatsToString::OutString' has a wrong offset!");
static_assert(offsetof(GenericFunctionLibrary_C_ArrayOfFloatsToString, local_LastIndex) == 0x000028, "Member 'GenericFunctionLibrary_C_ArrayOfFloatsToString::local_LastIndex' has a wrong offset!");
static_assert(offsetof(GenericFunctionLibrary_C_ArrayOfFloatsToString, local_String) == 0x000030, "Member 'GenericFunctionLibrary_C_ArrayOfFloatsToString::local_String' has a wrong offset!");
static_assert(offsetof(GenericFunctionLibrary_C_ArrayOfFloatsToString, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'GenericFunctionLibrary_C_ArrayOfFloatsToString::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(GenericFunctionLibrary_C_ArrayOfFloatsToString, Temp_wildcard_We_need_a_second_array_to_store_the_result_and_be_able_to_wipe_the_first__buffer__array_Variable) == 0x000048, "Member 'GenericFunctionLibrary_C_ArrayOfFloatsToString::Temp_wildcard_We_need_a_second_array_to_store_the_result_and_be_able_to_wipe_the_first__buffer__array_Variable' has a wrong offset!");
static_assert(offsetof(GenericFunctionLibrary_C_ArrayOfFloatsToString, Temp_int_Loop_Counter_Variable) == 0x000058, "Member 'GenericFunctionLibrary_C_ArrayOfFloatsToString::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(GenericFunctionLibrary_C_ArrayOfFloatsToString, CallFunc_JoinStringArray_ReturnValue) == 0x000060, "Member 'GenericFunctionLibrary_C_ArrayOfFloatsToString::CallFunc_JoinStringArray_ReturnValue' has a wrong offset!");
static_assert(offsetof(GenericFunctionLibrary_C_ArrayOfFloatsToString, CallFunc_Less_IntInt_ReturnValue) == 0x000070, "Member 'GenericFunctionLibrary_C_ArrayOfFloatsToString::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GenericFunctionLibrary_C_ArrayOfFloatsToString, CallFunc_Add_IntInt_ReturnValue) == 0x000074, "Member 'GenericFunctionLibrary_C_ArrayOfFloatsToString::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GenericFunctionLibrary_C_ArrayOfFloatsToString, Temp_int_Array_Index_Variable) == 0x000078, "Member 'GenericFunctionLibrary_C_ArrayOfFloatsToString::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(GenericFunctionLibrary_C_ArrayOfFloatsToString, Temp_wildcard_Temp_buffer_array_Variable) == 0x000080, "Member 'GenericFunctionLibrary_C_ArrayOfFloatsToString::Temp_wildcard_Temp_buffer_array_Variable' has a wrong offset!");
static_assert(offsetof(GenericFunctionLibrary_C_ArrayOfFloatsToString, CallFunc_Array_Get_Item) == 0x000090, "Member 'GenericFunctionLibrary_C_ArrayOfFloatsToString::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GenericFunctionLibrary_C_ArrayOfFloatsToString, CallFunc_Conv_DoubleToString_ReturnValue) == 0x000098, "Member 'GenericFunctionLibrary_C_ArrayOfFloatsToString::CallFunc_Conv_DoubleToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(GenericFunctionLibrary_C_ArrayOfFloatsToString, CallFunc_Array_Add_ReturnValue) == 0x0000A8, "Member 'GenericFunctionLibrary_C_ArrayOfFloatsToString::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function GenericFunctionLibrary.GenericFunctionLibrary_C.IsDataRowHandleSet
// 0x0020 (0x0020 - 0x0000)
struct GenericFunctionLibrary_C_IsDataRowHandleSet final
{
public:
	struct FDataTableRowHandle                    RowHandle;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
