#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HumpbackWhale_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "HumpbackWhale_AnimBP_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass HumpbackWhale_AnimBP.HumpbackWhale_AnimBP_C
// 0x0220 (0x0590 - 0x0370)
class UHumpbackWhale_AnimBP_C final : public UAnimInstance
{
public:
	uint8                                         Pad_368[0x8];                                      // 0x0368(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0370(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct HumpbackWhale_AnimBP::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;         // 0x0378(0x0014)(HasGetValueTypeHash)
	uint8                                         Pad_38C[0x4];                                      // 0x038C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0390(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0398(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x03A0(0x0020)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer;                    // 0x03C0(0x0070)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend;                    // 0x0430(0x00F0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0520(0x0048)()
	double                                        Direction;                                         // 0x0568(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Animation_Blendspace;                              // 0x0570(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Swim_Anim_Play_Rate;                               // 0x0578(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        StartPosition;                                     // 0x0580(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Mouth;                                             // 0x0588(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_HumpbackWhale_AnimBP(int32 EntryPoint);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_HumpbackWhale_AnimBP_AnimGraphNode_BlendSpacePlayer_7FC69AA4401A31909D31A1989A903368();
	void AnimGraph(struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"HumpbackWhale_AnimBP_C">();
	}
	static class UHumpbackWhale_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHumpbackWhale_AnimBP_C>();
	}
};
static_assert(alignof(UHumpbackWhale_AnimBP_C) == 0x000010, "Wrong alignment on UHumpbackWhale_AnimBP_C");
static_assert(sizeof(UHumpbackWhale_AnimBP_C) == 0x000590, "Wrong size on UHumpbackWhale_AnimBP_C");
static_assert(offsetof(UHumpbackWhale_AnimBP_C, UberGraphFrame) == 0x000370, "Member 'UHumpbackWhale_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UHumpbackWhale_AnimBP_C, __AnimBlueprintMutables) == 0x000378, "Member 'UHumpbackWhale_AnimBP_C::__AnimBlueprintMutables' has a wrong offset!");
static_assert(offsetof(UHumpbackWhale_AnimBP_C, AnimBlueprintExtension_PropertyAccess) == 0x000390, "Member 'UHumpbackWhale_AnimBP_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UHumpbackWhale_AnimBP_C, AnimBlueprintExtension_Base) == 0x000398, "Member 'UHumpbackWhale_AnimBP_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UHumpbackWhale_AnimBP_C, AnimGraphNode_Root) == 0x0003A0, "Member 'UHumpbackWhale_AnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UHumpbackWhale_AnimBP_C, AnimGraphNode_BlendSpacePlayer) == 0x0003C0, "Member 'UHumpbackWhale_AnimBP_C::AnimGraphNode_BlendSpacePlayer' has a wrong offset!");
static_assert(offsetof(UHumpbackWhale_AnimBP_C, AnimGraphNode_LayeredBoneBlend) == 0x000430, "Member 'UHumpbackWhale_AnimBP_C::AnimGraphNode_LayeredBoneBlend' has a wrong offset!");
static_assert(offsetof(UHumpbackWhale_AnimBP_C, AnimGraphNode_SequencePlayer) == 0x000520, "Member 'UHumpbackWhale_AnimBP_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UHumpbackWhale_AnimBP_C, Direction) == 0x000568, "Member 'UHumpbackWhale_AnimBP_C::Direction' has a wrong offset!");
static_assert(offsetof(UHumpbackWhale_AnimBP_C, Animation_Blendspace) == 0x000570, "Member 'UHumpbackWhale_AnimBP_C::Animation_Blendspace' has a wrong offset!");
static_assert(offsetof(UHumpbackWhale_AnimBP_C, Swim_Anim_Play_Rate) == 0x000578, "Member 'UHumpbackWhale_AnimBP_C::Swim_Anim_Play_Rate' has a wrong offset!");
static_assert(offsetof(UHumpbackWhale_AnimBP_C, StartPosition) == 0x000580, "Member 'UHumpbackWhale_AnimBP_C::StartPosition' has a wrong offset!");
static_assert(offsetof(UHumpbackWhale_AnimBP_C, Mouth) == 0x000588, "Member 'UHumpbackWhale_AnimBP_C::Mouth' has a wrong offset!");

}

