#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LGUI

#include "Basic.hpp"

#include "MovieScene_structs.hpp"
#include "MovieScene_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "LGUI_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "UMG_structs.hpp"
#include "LTween_structs.hpp"
#include "SlateCore_structs.hpp"
#include "MovieSceneTracks_classes.hpp"
#include "InputCore_structs.hpp"
#include "Slate_structs.hpp"


namespace SDK
{

// Class LGUI.LGUICultureChangedInterface
// 0x0000 (0x0000 - 0x0000)
class ILGUICultureChangedInterface final
{
public:
	void OnCultureChanged();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LGUICultureChangedInterface">();
	}
	static class ILGUICultureChangedInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<ILGUICultureChangedInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
static_assert(alignof(ILGUICultureChangedInterface) == 0x000001, "Wrong alignment on ILGUICultureChangedInterface");
static_assert(sizeof(ILGUICultureChangedInterface) == 0x000001, "Wrong size on ILGUICultureChangedInterface");

// Class LGUI.UIEffectTextAnimation_Property
// 0x0000 (0x0028 - 0x0028)
class UUIEffectTextAnimation_Property : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UIEffectTextAnimation_Property">();
	}
	static class UUIEffectTextAnimation_Property* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIEffectTextAnimation_Property>();
	}
};
static_assert(alignof(UUIEffectTextAnimation_Property) == 0x000008, "Wrong alignment on UUIEffectTextAnimation_Property");
static_assert(sizeof(UUIEffectTextAnimation_Property) == 0x000028, "Wrong size on UUIEffectTextAnimation_Property");

// Class LGUI.UIEffectTextAnimation_PropertyWithEase
// 0x0020 (0x0048 - 0x0028)
class UUIEffectTextAnimation_PropertyWithEase : public UUIEffectTextAnimation_Property
{
public:
	ELTweenEase                                   easetype;                                          // 0x0028(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveFloat*                            easeCurve;                                         // 0x0030(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_38[0x10];                                      // 0x0038(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetEaseCurve(class UCurveFloat* Value);
	void SetEaseType(ELTweenEase Value);

	class UCurveFloat* GetCurveFloat() const;
	ELTweenEase GetEaseType() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UIEffectTextAnimation_PropertyWithEase">();
	}
	static class UUIEffectTextAnimation_PropertyWithEase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIEffectTextAnimation_PropertyWithEase>();
	}
};
static_assert(alignof(UUIEffectTextAnimation_PropertyWithEase) == 0x000008, "Wrong alignment on UUIEffectTextAnimation_PropertyWithEase");
static_assert(sizeof(UUIEffectTextAnimation_PropertyWithEase) == 0x000048, "Wrong size on UUIEffectTextAnimation_PropertyWithEase");
static_assert(offsetof(UUIEffectTextAnimation_PropertyWithEase, easetype) == 0x000028, "Member 'UUIEffectTextAnimation_PropertyWithEase::easetype' has a wrong offset!");
static_assert(offsetof(UUIEffectTextAnimation_PropertyWithEase, easeCurve) == 0x000030, "Member 'UUIEffectTextAnimation_PropertyWithEase::easeCurve' has a wrong offset!");

// Class LGUI.UIEffectTextAnimation_ColorRandomProperty
// 0x0010 (0x0058 - 0x0048)
class UUIEffectTextAnimation_ColorRandomProperty final : public UUIEffectTextAnimation_PropertyWithEase
{
public:
	int32                                         Seed;                                              // 0x0048(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FColor                                 min_0;                                             // 0x004C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FColor                                 max_0;                                             // 0x0050(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          useHSV;                                            // 0x0054(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetMax(const struct FColor& Value);
	void SetMin(const struct FColor& Value);
	void SetSeed(int32 Value);
	void SetUseHSV(bool Value);

	struct FColor GetMax() const;
	struct FColor GetMin() const;
	int32 GetSeed() const;
	bool GetUseHSV() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UIEffectTextAnimation_ColorRandomProperty">();
	}
	static class UUIEffectTextAnimation_ColorRandomProperty* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIEffectTextAnimation_ColorRandomProperty>();
	}
};
static_assert(alignof(UUIEffectTextAnimation_ColorRandomProperty) == 0x000008, "Wrong alignment on UUIEffectTextAnimation_ColorRandomProperty");
static_assert(sizeof(UUIEffectTextAnimation_ColorRandomProperty) == 0x000058, "Wrong size on UUIEffectTextAnimation_ColorRandomProperty");
static_assert(offsetof(UUIEffectTextAnimation_ColorRandomProperty, Seed) == 0x000048, "Member 'UUIEffectTextAnimation_ColorRandomProperty::Seed' has a wrong offset!");
static_assert(offsetof(UUIEffectTextAnimation_ColorRandomProperty, min_0) == 0x00004C, "Member 'UUIEffectTextAnimation_ColorRandomProperty::min_0' has a wrong offset!");
static_assert(offsetof(UUIEffectTextAnimation_ColorRandomProperty, max_0) == 0x000050, "Member 'UUIEffectTextAnimation_ColorRandomProperty::max_0' has a wrong offset!");
static_assert(offsetof(UUIEffectTextAnimation_ColorRandomProperty, useHSV) == 0x000054, "Member 'UUIEffectTextAnimation_ColorRandomProperty::useHSV' has a wrong offset!");

// Class LGUI.LGUILayoutElementInterface
// 0x0000 (0x0000 - 0x0000)
class ILGUILayoutElementInterface final
{
public:
	float GetConstantSize(ELayoutElementSizeType Type) const;
	ELayoutElementType GetLayoutType() const;
	float GetRatioSize(ELayoutElementSizeType Type) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LGUILayoutElementInterface">();
	}
	static class ILGUILayoutElementInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<ILGUILayoutElementInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
static_assert(alignof(ILGUILayoutElementInterface) == 0x000001, "Wrong alignment on ILGUILayoutElementInterface");
static_assert(sizeof(ILGUILayoutElementInterface) == 0x000001, "Wrong size on ILGUILayoutElementInterface");

// Class LGUI.LGUILayoutInterface
// 0x0000 (0x0000 - 0x0000)
class ILGUILayoutInterface final
{
public:
	void MarkRebuildLayout();
	void OnUpdateLayout();

	bool GetCanLayoutControlAnchor(class UUIItem* InUIItem, struct FLGUICanLayoutControlAnchor* OutResult) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LGUILayoutInterface">();
	}
	static class ILGUILayoutInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<ILGUILayoutInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
static_assert(alignof(ILGUILayoutInterface) == 0x000001, "Wrong alignment on ILGUILayoutInterface");
static_assert(sizeof(ILGUILayoutInterface) == 0x000001, "Wrong size on ILGUILayoutInterface");

// Class LGUI.LGUIPrefabInterface
// 0x0000 (0x0000 - 0x0000)
class ILGUIPrefabInterface final
{
public:
	void Awake();
	void EditorAwake();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LGUIPrefabInterface">();
	}
	static class ILGUIPrefabInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<ILGUIPrefabInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
static_assert(alignof(ILGUIPrefabInterface) == 0x000001, "Wrong alignment on ILGUIPrefabInterface");
static_assert(sizeof(ILGUIPrefabInterface) == 0x000001, "Wrong size on ILGUIPrefabInterface");

// Class LGUI.LGUIPrefabSequencePlayer
// 0x0000 (0x0460 - 0x0460)
class ULGUIPrefabSequencePlayer final : public UMovieSceneSequencePlayer
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LGUIPrefabSequencePlayer">();
	}
	static class ULGUIPrefabSequencePlayer* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULGUIPrefabSequencePlayer>();
	}
};
static_assert(alignof(ULGUIPrefabSequencePlayer) == 0x000008, "Wrong alignment on ULGUIPrefabSequencePlayer");
static_assert(sizeof(ULGUIPrefabSequencePlayer) == 0x000460, "Wrong size on ULGUIPrefabSequencePlayer");

// Class LGUI.UISpriteRenderableInterface
// 0x0000 (0x0000 - 0x0000)
class IUISpriteRenderableInterface final
{
public:
	void ApplyAtlasTextureChange();
	void ApplyAtlasTextureScaleUp();

	class ULGUISpriteData_BaseObject* SpriteRenderableGetSprite() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UISpriteRenderableInterface">();
	}
	static class IUISpriteRenderableInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IUISpriteRenderableInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
static_assert(alignof(IUISpriteRenderableInterface) == 0x000001, "Wrong alignment on IUISpriteRenderableInterface");
static_assert(sizeof(IUISpriteRenderableInterface) == 0x000001, "Wrong size on IUISpriteRenderableInterface");

// Class LGUI.LGUIBaseEventData
// 0x0010 (0x0038 - 0x0028)
class ULGUIBaseEventData : public UObject
{
public:
	class USceneComponent*                        SelectedComponent;                                 // 0x0028(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPointerEventType                             EventType;                                         // 0x0030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class FString ToString() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LGUIBaseEventData">();
	}
	static class ULGUIBaseEventData* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULGUIBaseEventData>();
	}
};
static_assert(alignof(ULGUIBaseEventData) == 0x000008, "Wrong alignment on ULGUIBaseEventData");
static_assert(sizeof(ULGUIBaseEventData) == 0x000038, "Wrong size on ULGUIBaseEventData");
static_assert(offsetof(ULGUIBaseEventData, SelectedComponent) == 0x000028, "Member 'ULGUIBaseEventData::SelectedComponent' has a wrong offset!");
static_assert(offsetof(ULGUIBaseEventData, EventType) == 0x000030, "Member 'ULGUIBaseEventData::EventType' has a wrong offset!");

// Class LGUI.LGUIPrefabHelperObject
// 0x00B0 (0x00D8 - 0x0028)
class ULGUIPrefabHelperObject final : public UObject
{
public:
	class ULGUIPrefab*                            PrefabAsset;                                       // 0x0028(0x0008)(Edit, ZeroConstructor, EditConst, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 LoadedRootActor;                                   // 0x0030(0x0008)(Edit, ZeroConstructor, EditConst, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<struct FGuid, class UObject*>            MapGuidToObject;                                   // 0x0038(0x0050)(Edit, EditConst, UObjectWrapper, NativeAccessSpecifierPublic)
	TMap<class AActor*, struct FLGUISubPrefabData> SubPrefabMap;                                     // 0x0088(0x0050)(Edit, EditConst, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LGUIPrefabHelperObject">();
	}
	static class ULGUIPrefabHelperObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULGUIPrefabHelperObject>();
	}
};
static_assert(alignof(ULGUIPrefabHelperObject) == 0x000008, "Wrong alignment on ULGUIPrefabHelperObject");
static_assert(sizeof(ULGUIPrefabHelperObject) == 0x0000D8, "Wrong size on ULGUIPrefabHelperObject");
static_assert(offsetof(ULGUIPrefabHelperObject, PrefabAsset) == 0x000028, "Member 'ULGUIPrefabHelperObject::PrefabAsset' has a wrong offset!");
static_assert(offsetof(ULGUIPrefabHelperObject, LoadedRootActor) == 0x000030, "Member 'ULGUIPrefabHelperObject::LoadedRootActor' has a wrong offset!");
static_assert(offsetof(ULGUIPrefabHelperObject, MapGuidToObject) == 0x000038, "Member 'ULGUIPrefabHelperObject::MapGuidToObject' has a wrong offset!");
static_assert(offsetof(ULGUIPrefabHelperObject, SubPrefabMap) == 0x000088, "Member 'ULGUIPrefabHelperObject::SubPrefabMap' has a wrong offset!");

// Class LGUI.LGUIBaseInputModule
// 0x0000 (0x00A0 - 0x00A0)
class ULGUIBaseInputModule : public UActorComponent
{
public:
	void ClearEvent();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LGUIBaseInputModule">();
	}
	static class ULGUIBaseInputModule* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULGUIBaseInputModule>();
	}
};
static_assert(alignof(ULGUIBaseInputModule) == 0x000008, "Wrong alignment on ULGUIBaseInputModule");
static_assert(sizeof(ULGUIBaseInputModule) == 0x0000A0, "Wrong size on ULGUIBaseInputModule");

// Class LGUI.UIEffectTextAnimation_AlphaProperty
// 0x0008 (0x0050 - 0x0048)
class UUIEffectTextAnimation_AlphaProperty final : public UUIEffectTextAnimation_PropertyWithEase
{
public:
	float                                         Alpha;                                             // 0x0048(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetAlpha(float Value);

	float GetAlpha() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UIEffectTextAnimation_AlphaProperty">();
	}
	static class UUIEffectTextAnimation_AlphaProperty* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIEffectTextAnimation_AlphaProperty>();
	}
};
static_assert(alignof(UUIEffectTextAnimation_AlphaProperty) == 0x000008, "Wrong alignment on UUIEffectTextAnimation_AlphaProperty");
static_assert(sizeof(UUIEffectTextAnimation_AlphaProperty) == 0x000050, "Wrong size on UUIEffectTextAnimation_AlphaProperty");
static_assert(offsetof(UUIEffectTextAnimation_AlphaProperty, Alpha) == 0x000048, "Member 'UUIEffectTextAnimation_AlphaProperty::Alpha' has a wrong offset!");

// Class LGUI.LGUIBaseRaycaster
// 0x0070 (0x02A0 - 0x0230)
class ULGUIBaseRaycaster : public USceneComponent
{
public:
	uint8                                         Pad_230[0x10];                                     // 0x0230(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         pointerID;                                         // 0x0240(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         Depth;                                             // 0x0244(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         rayLength;                                         // 0x0248(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ETraceTypeQuery                               TraceChannel;                                      // 0x024C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ELGUIEventFireType                            eventFireType;                                     // 0x024D(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_24E[0x2];                                      // 0x024E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         clickThreshold;                                    // 0x0250(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          holdToDrag;                                        // 0x0254(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_255[0x3];                                      // 0x0255(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         holdToDragTime;                                    // 0x0258(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_25C[0x44];                                     // 0x025C(0x0044)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ActivateRaycaster();
	void DeactivateRaycaster();
	void SetClickThreshold(float Value);
	void SetHoldToDrag(bool Value);
	void SetHoldToDragTime(float Value);

	bool GetAffectByGamePause() const;
	float GetClickThreshold() const;
	int32 GetDepth() const;
	ELGUIEventFireType GetEventFireType() const;
	bool GetHoldToDrag() const;
	float GetHoldToDragTime() const;
	int32 GetPointerID() const;
	struct FVector GetRayDirection() const;
	float GetRayLength() const;
	struct FVector GetRayOrigin() const;
	ETraceTypeQuery GetTraceChannel() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LGUIBaseRaycaster">();
	}
	static class ULGUIBaseRaycaster* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULGUIBaseRaycaster>();
	}
};
static_assert(alignof(ULGUIBaseRaycaster) == 0x000010, "Wrong alignment on ULGUIBaseRaycaster");
static_assert(sizeof(ULGUIBaseRaycaster) == 0x0002A0, "Wrong size on ULGUIBaseRaycaster");
static_assert(offsetof(ULGUIBaseRaycaster, pointerID) == 0x000240, "Member 'ULGUIBaseRaycaster::pointerID' has a wrong offset!");
static_assert(offsetof(ULGUIBaseRaycaster, Depth) == 0x000244, "Member 'ULGUIBaseRaycaster::Depth' has a wrong offset!");
static_assert(offsetof(ULGUIBaseRaycaster, rayLength) == 0x000248, "Member 'ULGUIBaseRaycaster::rayLength' has a wrong offset!");
static_assert(offsetof(ULGUIBaseRaycaster, TraceChannel) == 0x00024C, "Member 'ULGUIBaseRaycaster::TraceChannel' has a wrong offset!");
static_assert(offsetof(ULGUIBaseRaycaster, eventFireType) == 0x00024D, "Member 'ULGUIBaseRaycaster::eventFireType' has a wrong offset!");
static_assert(offsetof(ULGUIBaseRaycaster, clickThreshold) == 0x000250, "Member 'ULGUIBaseRaycaster::clickThreshold' has a wrong offset!");
static_assert(offsetof(ULGUIBaseRaycaster, holdToDrag) == 0x000254, "Member 'ULGUIBaseRaycaster::holdToDrag' has a wrong offset!");
static_assert(offsetof(ULGUIBaseRaycaster, holdToDragTime) == 0x000258, "Member 'ULGUIBaseRaycaster::holdToDragTime' has a wrong offset!");

// Class LGUI.LGUIBPLibrary
// 0x0000 (0x0028 - 0x0028)
class ULGUIBPLibrary final : public UBlueprintFunctionLibrary
{
public:
	static class ULTweener* AlphaFrom(class UUIBaseRenderable* Target, float StartValue, float Duration, float Delay, ELTweenEase Ease);
	static class ULTweener* AlphaTo(class UUIBaseRenderable* Target, float endValue, float Duration, float Delay, ELTweenEase Ease);
	static class ULTweener* AnchorBottomTo(class UUIItem* Target, float endValue, float Duration, float Delay, ELTweenEase Ease);
	static class ULTweener* AnchoredPositionTo(class UUIItem* Target, const struct FVector2D& endValue, float Duration, float Delay, ELTweenEase Ease);
	static class ULTweener* AnchorLeftTo(class UUIItem* Target, float endValue, float Duration, float Delay, ELTweenEase Ease);
	static class ULTweener* AnchorOffsetTo(class UUIItem* Target, const struct FVector2D& endValue, float Duration, float Delay, ELTweenEase Ease);
	static class ULTweener* AnchorOffsetXTo(class UUIItem* Target, float endValue, float Duration, float Delay, ELTweenEase Ease);
	static class ULTweener* AnchorOffsetYTo(class UUIItem* Target, float endValue, float Duration, float Delay, ELTweenEase Ease);
	static class ULTweener* AnchorRightTo(class UUIItem* Target, float endValue, float Duration, float Delay, ELTweenEase Ease);
	static class ULTweener* AnchorTopTo(class UUIItem* Target, float endValue, float Duration, float Delay, ELTweenEase Ease);
	static class ULTweener* ColorFrom(class UUIBaseRenderable* Target, const struct FColor& StartValue, float Duration, float Delay, ELTweenEase Ease);
	static class ULTweener* ColorTo(class UUIBaseRenderable* Target, const struct FColor& endValue, float Duration, float Delay, ELTweenEase Ease);
	static void DestroyActorWithHierarchy(class AActor* Target, bool WithHierarchy);
	static class AActor* DuplicateActor(class AActor* Target, class USceneComponent* Parent);
	static class AActor* DuplicateActorWithPreparedData(struct FLGUIDuplicateDataContainer& Data, class USceneComponent* Parent);
	static class UActorComponent* GetComponentInChildren(class AActor* InActor, TSubclassOf<class UActorComponent> ComponentClass, bool IncludeSelf, const TSet<class AActor*>& InExcludeNode);
	static class UActorComponent* GetComponentInParent(class AActor* InActor, TSubclassOf<class UActorComponent> ComponentClass, bool IncludeSelf, class AActor* InStopNode);
	static TArray<class UActorComponent*> GetComponentsInChildren(class AActor* InActor, TSubclassOf<class UActorComponent> ComponentClass, bool IncludeSelf, const TSet<class AActor*>& InExcludeNode);
	static void GetSpriteBorderSize(const struct FLGUISpriteInfo& SpriteInfo, int32* borderLeft, int32* borderRight, int32* borderTop, int32* borderBottom);
	static void GetSpriteBorderUV(const struct FLGUISpriteInfo& SpriteInfo, float* borderUV0X, float* borderUV0Y, float* borderUV3X, float* borderUV3Y);
	static void GetSpriteSize(const struct FLGUISpriteInfo& SpriteInfo, int32* Width, int32* Height);
	static void GetSpriteUV(const struct FLGUISpriteInfo& SpriteInfo, float* uv0X, float* uv0Y, float* uv3X, float* uv3Y);
	static class ULTweener* HeightTo(class UUIItem* Target, float endValue, float Duration, float Delay, ELTweenEase Ease);
	static class ULTweener* HorizontalAnchoredPositionTo(class UUIItem* Target, float endValue, float Duration, float Delay, ELTweenEase Ease);
	static void K2_LGUICompRef_GetComponent(const struct FLGUIComponentReference& InLGUICompRef, class UActorComponent** OutResult);
	static class AActor* LGUICompRef_GetActor(const struct FLGUIComponentReference& InLGUIComponentReference);
	static class UActorComponent* LGUICompRef_GetComponent(const struct FLGUIComponentReference& InLGUIComponentReference, TSubclassOf<class UActorComponent> InComponentType);
	static TSubclassOf<class UActorComponent> LGUICompRef_GetComponentClass(const struct FLGUIComponentReference& InLGUIComponentReference);
	static void LGUIEventDelegate_Actor_Execute(const struct FLGUIEventDelegate_Actor& InEvent, class AActor* InParameter);
	static struct FLGUIDelegateHandleWrapper LGUIEventDelegate_Actor_Register(const struct FLGUIEventDelegate_Actor& InEvent, TDelegate<void(class AActor* Value)> InDelegate);
	static void LGUIEventDelegate_Actor_Unregister(const struct FLGUIEventDelegate_Actor& InEvent, const struct FLGUIDelegateHandleWrapper& InDelegateHandle);
	static void LGUIEventDelegate_Bool_Execute(const struct FLGUIEventDelegate_Bool& InEvent, bool InParameter);
	static struct FLGUIDelegateHandleWrapper LGUIEventDelegate_Bool_Register(const struct FLGUIEventDelegate_Bool& InEvent, TDelegate<void(bool Value)> InDelegate);
	static void LGUIEventDelegate_Bool_Unregister(const struct FLGUIEventDelegate_Bool& InEvent, const struct FLGUIDelegateHandleWrapper& InDelegateHandle);
	static void LGUIEventDelegate_Class_Execute(const struct FLGUIEventDelegate_Class& InEvent, class UClass* InParameter);
	static struct FLGUIDelegateHandleWrapper LGUIEventDelegate_Class_Register(const struct FLGUIEventDelegate_Class& InEvent, TDelegate<void(class UClass* Value)> InDelegate);
	static void LGUIEventDelegate_Class_Unregister(const struct FLGUIEventDelegate_Class& InEvent, const struct FLGUIDelegateHandleWrapper& InDelegateHandle);
	static void LGUIEventDelegate_Color_Execute(const struct FLGUIEventDelegate_Color& InEvent, const struct FColor& InParameter);
	static struct FLGUIDelegateHandleWrapper LGUIEventDelegate_Color_Register(const struct FLGUIEventDelegate_Color& InEvent, TDelegate<void(const struct FColor& Value)> InDelegate);
	static void LGUIEventDelegate_Color_Unregister(const struct FLGUIEventDelegate_Color& InEvent, const struct FLGUIDelegateHandleWrapper& InDelegateHandle);
	static void LGUIEventDelegate_Double_Execute(const struct FLGUIEventDelegate_Double& InEvent, double InParameter);
	static struct FLGUIDelegateHandleWrapper LGUIEventDelegate_Double_Register(const struct FLGUIEventDelegate_Double& InEvent, TDelegate<void(double Value)> InDelegate);
	static void LGUIEventDelegate_Double_Unregister(const struct FLGUIEventDelegate_Double& InEvent, const struct FLGUIDelegateHandleWrapper& InDelegateHandle);
	static void LGUIEventDelegate_Empty_Execute(const struct FLGUIEventDelegate_Empty& InEvent);
	static struct FLGUIDelegateHandleWrapper LGUIEventDelegate_Empty_Register(const struct FLGUIEventDelegate_Empty& InEvent, TDelegate<void()> InDelegate);
	static void LGUIEventDelegate_Empty_Unregister(const struct FLGUIEventDelegate_Empty& InEvent, const struct FLGUIDelegateHandleWrapper& InDelegateHandle);
	static void LGUIEventDelegate_Float_Execute(const struct FLGUIEventDelegate_Float& InEvent, float InParameter);
	static struct FLGUIDelegateHandleWrapper LGUIEventDelegate_Float_Register(const struct FLGUIEventDelegate_Float& InEvent, TDelegate<void(float Value)> InDelegate);
	static void LGUIEventDelegate_Float_Unregister(const struct FLGUIEventDelegate_Float& InEvent, const struct FLGUIDelegateHandleWrapper& InDelegateHandle);
	static void LGUIEventDelegate_Int32_Execute(const struct FLGUIEventDelegate_Int32& InEvent, int32 InParameter);
	static struct FLGUIDelegateHandleWrapper LGUIEventDelegate_Int32_Register(const struct FLGUIEventDelegate_Int32& InEvent, TDelegate<void(int32 Value)> InDelegate);
	static void LGUIEventDelegate_Int32_Unregister(const struct FLGUIEventDelegate_Int32& InEvent, const struct FLGUIDelegateHandleWrapper& InDelegateHandle);
	static void LGUIEventDelegate_Int64_Execute(const struct FLGUIEventDelegate_Int64& InEvent, int64 InParameter);
	static struct FLGUIDelegateHandleWrapper LGUIEventDelegate_Int64_Register(const struct FLGUIEventDelegate_Int64& InEvent, TDelegate<void(int64 Value)> InDelegate);
	static void LGUIEventDelegate_Int64_Unregister(const struct FLGUIEventDelegate_Int64& InEvent, const struct FLGUIDelegateHandleWrapper& InDelegateHandle);
	static void LGUIEventDelegate_LinearColor_Execute(const struct FLGUIEventDelegate_LinearColor& InEvent, const struct FLinearColor& InParameter);
	static struct FLGUIDelegateHandleWrapper LGUIEventDelegate_LinearColor_Register(const struct FLGUIEventDelegate_LinearColor& InEvent, TDelegate<void(const struct FLinearColor& Value)> InDelegate);
	static void LGUIEventDelegate_LinearColor_Unregister(const struct FLGUIEventDelegate_LinearColor& InEvent, const struct FLGUIDelegateHandleWrapper& InDelegateHandle);
	static void LGUIEventDelegate_Name_Execute(const struct FLGUIEventDelegate_Name& InEvent, class FName InParameter);
	static struct FLGUIDelegateHandleWrapper LGUIEventDelegate_Name_Register(const struct FLGUIEventDelegate_Name& InEvent, TDelegate<void(class FName Value)> InDelegate);
	static void LGUIEventDelegate_Name_Unregister(const struct FLGUIEventDelegate_Name& InEvent, const struct FLGUIDelegateHandleWrapper& InDelegateHandle);
	static void LGUIEventDelegate_Object_Execute(const struct FLGUIEventDelegate_Object& InEvent, class UObject* InParameter);
	static struct FLGUIDelegateHandleWrapper LGUIEventDelegate_Object_Register(const struct FLGUIEventDelegate_Object& InEvent, TDelegate<void(class UObject* Value)> InDelegate);
	static void LGUIEventDelegate_Object_Unregister(const struct FLGUIEventDelegate_Object& InEvent, const struct FLGUIDelegateHandleWrapper& InDelegateHandle);
	static void LGUIEventDelegate_PointerEvent_Execute(const struct FLGUIEventDelegate_PointerEvent& InEvent, class ULGUIPointerEventData* InParameter);
	static struct FLGUIDelegateHandleWrapper LGUIEventDelegate_PointerEvent_Register(const struct FLGUIEventDelegate_PointerEvent& InEvent, TDelegate<void(class ULGUIPointerEventData* Value)> InDelegate);
	static void LGUIEventDelegate_PointerEvent_Unregister(const struct FLGUIEventDelegate_PointerEvent& InEvent, const struct FLGUIDelegateHandleWrapper& InDelegateHandle);
	static void LGUIEventDelegate_Quaternion_Execute(const struct FLGUIEventDelegate_Quaternion& InEvent, const struct FQuat& InParameter);
	static struct FLGUIDelegateHandleWrapper LGUIEventDelegate_Quaternion_Register(const struct FLGUIEventDelegate_Quaternion& InEvent, TDelegate<void(const struct FQuat& Value)> InDelegate);
	static void LGUIEventDelegate_Quaternion_Unregister(const struct FLGUIEventDelegate_Quaternion& InEvent, const struct FLGUIDelegateHandleWrapper& InDelegateHandle);
	static void LGUIEventDelegate_Rotator_Execute(const struct FLGUIEventDelegate_Rotator& InEvent, const struct FRotator& InParameter);
	static struct FLGUIDelegateHandleWrapper LGUIEventDelegate_Rotator_Register(const struct FLGUIEventDelegate_Rotator& InEvent, TDelegate<void(const struct FRotator& Value)> InDelegate);
	static void LGUIEventDelegate_Rotator_Unregister(const struct FLGUIEventDelegate_Rotator& InEvent, const struct FLGUIDelegateHandleWrapper& InDelegateHandle);
	static void LGUIEventDelegate_String_Execute(const struct FLGUIEventDelegate_String& InEvent, const class FString& InParameter);
	static struct FLGUIDelegateHandleWrapper LGUIEventDelegate_String_Register(const struct FLGUIEventDelegate_String& InEvent, TDelegate<void(const class FString& Value)> InDelegate);
	static void LGUIEventDelegate_String_Unregister(const struct FLGUIEventDelegate_String& InEvent, const struct FLGUIDelegateHandleWrapper& InDelegateHandle);
	static void LGUIEventDelegate_Text_Execute(const struct FLGUIEventDelegate_Text& InEvent, const class FText& InParameter);
	static struct FLGUIDelegateHandleWrapper LGUIEventDelegate_Text_Register(const struct FLGUIEventDelegate_Text& InEvent, TDelegate<void(class FText Value)> InDelegate);
	static void LGUIEventDelegate_Text_Unregister(const struct FLGUIEventDelegate_Text& InEvent, const struct FLGUIDelegateHandleWrapper& InDelegateHandle);
	static void LGUIEventDelegate_UInt8_Execute(const struct FLGUIEventDelegate_UInt8& InEvent, uint8 InParameter);
	static struct FLGUIDelegateHandleWrapper LGUIEventDelegate_UInt8_Register(const struct FLGUIEventDelegate_UInt8& InEvent, TDelegate<void(uint8 Value)> InDelegate);
	static void LGUIEventDelegate_UInt8_Unregister(const struct FLGUIEventDelegate_UInt8& InEvent, const struct FLGUIDelegateHandleWrapper& InDelegateHandle);
	static void LGUIEventDelegate_Vector2_Execute(const struct FLGUIEventDelegate_Vector2& InEvent, const struct FVector2D& InParameter);
	static struct FLGUIDelegateHandleWrapper LGUIEventDelegate_Vector2_Register(const struct FLGUIEventDelegate_Vector2& InEvent, TDelegate<void(const struct FVector2D& Value)> InDelegate);
	static void LGUIEventDelegate_Vector2_Unregister(const struct FLGUIEventDelegate_Vector2& InEvent, const struct FLGUIDelegateHandleWrapper& InDelegateHandle);
	static void LGUIEventDelegate_Vector3_Execute(const struct FLGUIEventDelegate_Vector3& InEvent, const struct FVector& InParameter);
	static struct FLGUIDelegateHandleWrapper LGUIEventDelegate_Vector3_Register(const struct FLGUIEventDelegate_Vector3& InEvent, TDelegate<void(const struct FVector& Value)> InDelegate);
	static void LGUIEventDelegate_Vector3_Unregister(const struct FLGUIEventDelegate_Vector3& InEvent, const struct FLGUIDelegateHandleWrapper& InDelegateHandle);
	static void LGUIEventDelegate_Vector4_Execute(const struct FLGUIEventDelegate_Vector4& InEvent, const struct FVector4& InParameter);
	static struct FLGUIDelegateHandleWrapper LGUIEventDelegate_Vector4_Register(const struct FLGUIEventDelegate_Vector4& InEvent, TDelegate<void(const struct FVector4& Value)> InDelegate);
	static void LGUIEventDelegate_Vector4_Unregister(const struct FLGUIEventDelegate_Vector4& InEvent, const struct FLGUIDelegateHandleWrapper& InDelegateHandle);
	static void LGUIEventDelegateExecuteActor(const struct FLGUIEventDelegate& InEvent, class AActor* InParameter);
	static void LGUIEventDelegateExecuteBool(const struct FLGUIEventDelegate& InEvent, const bool& InParameter);
	static void LGUIEventDelegateExecuteClass(const struct FLGUIEventDelegate& InEvent, class UClass* InParameter);
	static void LGUIEventDelegateExecuteColor(const struct FLGUIEventDelegate& InEvent, const struct FColor& InParameter);
	static void LGUIEventDelegateExecuteEmpty(const struct FLGUIEventDelegate& InEvent);
	static void LGUIEventDelegateExecuteFloat(const struct FLGUIEventDelegate& InEvent, const float& InParameter);
	static void LGUIEventDelegateExecuteInt32(const struct FLGUIEventDelegate& InEvent, const int32& InParameter);
	static void LGUIEventDelegateExecuteLinearColor(const struct FLGUIEventDelegate& InEvent, const struct FLinearColor& InParameter);
	static void LGUIEventDelegateExecuteName(const struct FLGUIEventDelegate& InEvent, const class FName& InParameter);
	static void LGUIEventDelegateExecuteObject(const struct FLGUIEventDelegate& InEvent, class UObject* InParameter);
	static void LGUIEventDelegateExecutePointerEvent(const struct FLGUIEventDelegate& InEvent, class ULGUIPointerEventData* InParameter);
	static void LGUIEventDelegateExecuteQuaternion(const struct FLGUIEventDelegate& InEvent, const struct FQuat& InParameter);
	static void LGUIEventDelegateExecuteRotator(const struct FLGUIEventDelegate& InEvent, const struct FRotator& InParameter);
	static void LGUIEventDelegateExecuteString(const struct FLGUIEventDelegate& InEvent, const class FString& InParameter);
	static void LGUIEventDelegateExecuteText(const struct FLGUIEventDelegate& InEvent, const class FText& InParameter);
	static void LGUIEventDelegateExecuteUInt8(const struct FLGUIEventDelegate& InEvent, const uint8& InParameter);
	static void LGUIEventDelegateExecuteVector2(const struct FLGUIEventDelegate& InEvent, const struct FVector2D& InParameter);
	static void LGUIEventDelegateExecuteVector3(const struct FLGUIEventDelegate& InEvent, const struct FVector& InParameter);
	static void LGUIEventDelegateExecuteVector4(const struct FLGUIEventDelegate& InEvent, const struct FVector4& InParameter);
	static void LGUIExecuteControllerInputAction(const struct FKey& InputKey, bool pressOrRelease);
	static void LGUIExecuteControllerInputAxis(const struct FKey& InputKey, float Value);
	static void LGUIExecuteInputAction(const struct FKey& InputKey, bool pressOrRelease);
	static void LGUIExecuteInputAxis(const struct FKey& InputKey, float Value);
	static class AActor* LoadPrefab(class UObject* WorldContextObject, class ULGUIPrefab* InPrefab, class USceneComponent* InParent, const TDelegate<void(class AActor* LoadedRootActor)>& InCallbackBeforeAwake, bool SetRelativeTransformToIdentity);
	static class AActor* LoadPrefabWithReplacement(class UObject* WorldContextObject, class ULGUIPrefab* InPrefab, class USceneComponent* InParent, const TMap<class UObject*, class UObject*>& InReplaceAssetMap, const TMap<class UClass*, class UClass*>& InReplaceClassMap, const TDelegate<void(class AActor* LoadedRootActor)>& InCallbackBeforeAwake);
	static class AActor* LoadPrefabWithTransform(class UObject* WorldContextObject, class ULGUIPrefab* InPrefab, class USceneComponent* InParent, const struct FVector& Location, const struct FRotator& Rotation, const struct FVector& Scale, const TDelegate<void(class AActor* LoadedRootActor)>& InCallbackBeforeAwake);
	static class ULTweener* PivotTo(class UUIItem* Target, const struct FVector2D& endValue, float Duration, float Delay, ELTweenEase Ease);
	static void PrepareDuplicateData(class AActor* Target, struct FLGUIDuplicateDataContainer* Data);
	static class ULTweener* StretchBottomTo(class UUIItem* Target, float endValue, float Duration, float Delay, ELTweenEase Ease);
	static class ULTweener* StretchLeftTo(class UUIItem* Target, float endValue, float Duration, float Delay, ELTweenEase Ease);
	static class ULTweener* StretchRightTo(class UUIItem* Target, float endValue, float Duration, float Delay, ELTweenEase Ease);
	static class ULTweener* StretchTopTo(class UUIItem* Target, float endValue, float Duration, float Delay, ELTweenEase Ease);
	static class ULTweener* UILocalPositionTo(class UUIItem* Target, const struct FVector& endValue, float Duration, float Delay, ELTweenEase Ease);
	static class ULTweener* VerticalAnchoredPositionTo(class UUIItem* Target, float endValue, float Duration, float Delay, ELTweenEase Ease);
	static class ULTweener* WidthTo(class UUIItem* Target, float endValue, float Duration, float Delay, ELTweenEase Ease);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LGUIBPLibrary">();
	}
	static class ULGUIBPLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULGUIBPLibrary>();
	}
};
static_assert(alignof(ULGUIBPLibrary) == 0x000008, "Wrong alignment on ULGUIBPLibrary");
static_assert(sizeof(ULGUIBPLibrary) == 0x000028, "Wrong size on ULGUIBPLibrary");

// Class LGUI.UIEventBlockerComponent
// 0x0040 (0x00E0 - 0x00A0)
class UUIEventBlockerComponent final : public UActorComponent
{
public:
	uint8                                         Pad_A0[0x38];                                      // 0x00A0(0x0038)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          AllowEventBubbleUp;                                // 0x00D8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UIEventBlockerComponent">();
	}
	static class UUIEventBlockerComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIEventBlockerComponent>();
	}
};
static_assert(alignof(UUIEventBlockerComponent) == 0x000008, "Wrong alignment on UUIEventBlockerComponent");
static_assert(sizeof(UUIEventBlockerComponent) == 0x0000E0, "Wrong size on UUIEventBlockerComponent");
static_assert(offsetof(UUIEventBlockerComponent, AllowEventBubbleUp) == 0x0000D8, "Member 'UUIEventBlockerComponent::AllowEventBubbleUp' has a wrong offset!");

// Class LGUI.LGUICanvas
// 0x0350 (0x03F0 - 0x00A0)
class alignas(0x10) ULGUICanvas final : public UActorComponent
{
public:
	uint8                                         Pad_A0[0x40];                                      // 0x00A0(0x0040)(Fixing Size After Last Property [ Dumper-7 ])
	TWeakObjectPtr<class ULGUICanvas>             RootCanvas;                                        // 0x00E0(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class ULGUICanvas>             ParentCanvas;                                      // 0x00E8(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class UUIItem>                 UIItem;                                            // 0x00F0(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_F8[0x10];                                      // 0x00F8(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	ELGUIRenderMode                               renderMode;                                        // 0x0108(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTextureRenderTarget2D*                 RenderTarget;                                      // 0x0110(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ELGUICanvasRenderTargetUpdateMode             RenderTargetUpdateMode;                            // 0x0118(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ELGUICanvasRenderTargetSizeMode               RenderTargetSizeMode;                              // 0x0119(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_11A[0x2];                                      // 0x011A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RenderTargetResolutionScale;                       // 0x011C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          pixelPerfect;                                      // 0x0120(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bOverrideSorting;                                  // 0x0121(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int16                                         SortOrder;                                         // 0x0122(0x0002)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ELGUICanvasClipType                           clipType;                                          // 0x0124(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_125[0x3];                                      // 0x0125(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              clipFeather;                                       // 0x0128(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FMargin                                clipRectOffset;                                    // 0x0138(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	class UTexture2D*                             ClipTexture;                                       // 0x0148(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         clipTextureHitTestThreshold;                       // 0x0150(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          inheritRectClip;                                   // 0x0154(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_155[0x3];                                      // 0x0155(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ULGUICanvasCustomClip*                  customClip;                                        // 0x0158(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         dynamicPixelsPerUnit;                              // 0x0160(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int8                                          additionalShaderChannels;                          // 0x0164(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_165[0x3];                                      // 0x0165(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     DefaultMaterials[0x3];                             // 0x0168(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         BlendDepth;                                        // 0x0180(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         depthFade;                                         // 0x0184(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bEnableDepthTest;                                  // 0x0188(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int8                                          OverrideParameters;                                // 0x0189(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_18A[0x6];                                      // 0x018A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class ULGUIMeshComponent>         DefaultMeshType;                                   // 0x0190(0x0008)(Edit, ZeroConstructor, NoDestructor, AdvancedDisplay, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_198[0x168];                                    // 0x0198(0x0168)(Fixing Size After Last Property [ Dumper-7 ])
	TWeakObjectPtr<class ULGUIMeshComponent>      UIMesh;                                            // 0x0300(0x0008)(Edit, ExportObject, ZeroConstructor, Transient, EditConst, InstancedReference, IsPlainOldData, NoDestructor, AdvancedDisplay, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<struct FLGUIMaterialArrayContainer>    PooledUIMaterialList;                              // 0x0308(0x0010)(Edit, ZeroConstructor, Transient, EditConst, AdvancedDisplay, NativeAccessSpecifierPrivate)
	uint8                                         Pad_318[0x20];                                     // 0x0318(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UUIItem*>                        UIRenderableList;                                  // 0x0338(0x0010)(Edit, ExportObject, ZeroConstructor, Transient, EditConst, ContainsInstancedReference, AdvancedDisplay, UObjectWrapper, NativeAccessSpecifierPrivate)
	TArray<class UUIItem*>                        UIItemList;                                        // 0x0348(0x0010)(Edit, ExportObject, ZeroConstructor, Transient, EditConst, ContainsInstancedReference, AdvancedDisplay, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_358[0x80];                                     // 0x0358(0x0080)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TWeakObjectPtr<class ULGUICanvas>>     ChildrenCanvasArray;                               // 0x03D8(0x0010)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3E8[0x8];                                      // 0x03E8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void RequestUpdateForRenderTarget();
	void SetBlendDepth(float Value);
	void SetClipTexture(class UTexture2D* newTexture);
	void SetClipType(ELGUICanvasClipType newClipType);
	void SetCustomClip(class ULGUICanvasCustomClip* Value);
	void SetDefaultMaterials(const TArray<class UMaterialInterface*>& InMaterialArray);
	void SetDefaultMeshType(TSubclassOf<class ULGUIMeshComponent> InValue);
	void SetDepthFade(int32 Value);
	void SetDynamicPixelsPerUnit(float NewValue);
	void SetEnableDepthTest(bool Value);
	void SetInheriRectClip(bool newBool);
	void SetOverrideFovAngle(bool InOverride, float InValue);
	void SetOverrideProjectionMatrix(bool InOverride, const struct FMatrix& InValue);
	void SetOverrideSorting(bool Value);
	void SetOverrideViewLoation(bool InOverride, const struct FVector& InValue);
	void SetOverrideViewRotation(bool InOverride, const struct FRotator& InValue);
	void SetPixelPerfect(bool Value);
	void SetProjectionParameters(ECameraProjectionMode InProjectionType, float InFovAngle, float InNearClipPlane, float InFarClipPlane);
	void SetRectClipFeather(const struct FVector2D& newFeather);
	void SetRectClipOffset(const struct FMargin& newOffset);
	void SetRenderMode(ELGUIRenderMode Value);
	void SetRenderTarget(class UTextureRenderTarget2D* Value);
	void SetRenderTargetResolutionScale(float Value);
	void SetRenderTargetSizeMode(ELGUICanvasRenderTargetSizeMode Value);
	void SetRenderTargetUpdateMode(ELGUICanvasRenderTargetUpdateMode Value);
	void SetSortOrder(int32 NewValue, bool propagateToChildrenCanvas);
	void SetSortOrderToHighestOfHierarchy(bool propagateToChildrenCanvas);
	void SetSortOrderToLowestOfHierarchy(bool propagateToChildrenCanvas);

	float GetActualBlendDepth() const;
	ELGUICanvasClipType GetActualClipType() const;
	class ULGUICanvasCustomClip* GetActualCustomClip() const;
	int32 GetActualDepthFade() const;
	float GetActualDynamicPixelsPerUnit() const;
	bool GetActualPixelPerfect() const;
	ELGUIRenderMode GetActualRenderMode() const;
	class UTextureRenderTarget2D* GetActualRenderTarget() const;
	float GetActualRenderTargetResolutionScale() const;
	ELGUICanvasRenderTargetSizeMode GetActualRenderTargetSizeMode() const;
	ELGUICanvasRenderTargetUpdateMode GetActualRenderTargetUpdateMode() const;
	int32 GetActualSortOrder() const;
	float GetBlendDepth() const;
	struct FVector2D GetClipFeather() const;
	class UTexture2D* GetClipTexture() const;
	ELGUICanvasClipType GetClipType() const;
	class ULGUICanvasCustomClip* GetCustomClip() const;
	TArray<class UMaterialInterface*> GetDefaultMaterials() const;
	TSubclassOf<class ULGUIMeshComponent> GetDefaultMeshType() const;
	int32 GetDepthFade() const;
	float GetDynamicPixelsPerUnit() const;
	bool GetEnableDepthTest() const;
	bool GetInheritRectClip() const;
	bool GetOverrideSorting() const;
	bool GetPixelPerfect() const;
	ELGUIRenderMode GetRenderMode() const;
	class UTextureRenderTarget2D* GetRenderTarget() const;
	float GetRenderTargetResolutionScale() const;
	ELGUICanvasRenderTargetSizeMode GetRenderTargetSizeMode() const;
	ELGUICanvasRenderTargetUpdateMode GetRenderTargetUpdateMode() const;
	bool GetRequireNormal() const;
	bool GetRequireTangent() const;
	bool GetRequireUV1() const;
	bool GetRequireUV2() const;
	bool GetRequireUV3() const;
	class ULGUICanvas* GetRootCanvas() const;
	int32 GetSortOrder() const;
	class UUIItem* GetUIItem() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LGUICanvas">();
	}
	static class ULGUICanvas* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULGUICanvas>();
	}
};
static_assert(alignof(ULGUICanvas) == 0x000010, "Wrong alignment on ULGUICanvas");
static_assert(sizeof(ULGUICanvas) == 0x0003F0, "Wrong size on ULGUICanvas");
static_assert(offsetof(ULGUICanvas, RootCanvas) == 0x0000E0, "Member 'ULGUICanvas::RootCanvas' has a wrong offset!");
static_assert(offsetof(ULGUICanvas, ParentCanvas) == 0x0000E8, "Member 'ULGUICanvas::ParentCanvas' has a wrong offset!");
static_assert(offsetof(ULGUICanvas, UIItem) == 0x0000F0, "Member 'ULGUICanvas::UIItem' has a wrong offset!");
static_assert(offsetof(ULGUICanvas, renderMode) == 0x000108, "Member 'ULGUICanvas::renderMode' has a wrong offset!");
static_assert(offsetof(ULGUICanvas, RenderTarget) == 0x000110, "Member 'ULGUICanvas::RenderTarget' has a wrong offset!");
static_assert(offsetof(ULGUICanvas, RenderTargetUpdateMode) == 0x000118, "Member 'ULGUICanvas::RenderTargetUpdateMode' has a wrong offset!");
static_assert(offsetof(ULGUICanvas, RenderTargetSizeMode) == 0x000119, "Member 'ULGUICanvas::RenderTargetSizeMode' has a wrong offset!");
static_assert(offsetof(ULGUICanvas, RenderTargetResolutionScale) == 0x00011C, "Member 'ULGUICanvas::RenderTargetResolutionScale' has a wrong offset!");
static_assert(offsetof(ULGUICanvas, pixelPerfect) == 0x000120, "Member 'ULGUICanvas::pixelPerfect' has a wrong offset!");
static_assert(offsetof(ULGUICanvas, bOverrideSorting) == 0x000121, "Member 'ULGUICanvas::bOverrideSorting' has a wrong offset!");
static_assert(offsetof(ULGUICanvas, SortOrder) == 0x000122, "Member 'ULGUICanvas::SortOrder' has a wrong offset!");
static_assert(offsetof(ULGUICanvas, clipType) == 0x000124, "Member 'ULGUICanvas::clipType' has a wrong offset!");
static_assert(offsetof(ULGUICanvas, clipFeather) == 0x000128, "Member 'ULGUICanvas::clipFeather' has a wrong offset!");
static_assert(offsetof(ULGUICanvas, clipRectOffset) == 0x000138, "Member 'ULGUICanvas::clipRectOffset' has a wrong offset!");
static_assert(offsetof(ULGUICanvas, ClipTexture) == 0x000148, "Member 'ULGUICanvas::ClipTexture' has a wrong offset!");
static_assert(offsetof(ULGUICanvas, clipTextureHitTestThreshold) == 0x000150, "Member 'ULGUICanvas::clipTextureHitTestThreshold' has a wrong offset!");
static_assert(offsetof(ULGUICanvas, inheritRectClip) == 0x000154, "Member 'ULGUICanvas::inheritRectClip' has a wrong offset!");
static_assert(offsetof(ULGUICanvas, customClip) == 0x000158, "Member 'ULGUICanvas::customClip' has a wrong offset!");
static_assert(offsetof(ULGUICanvas, dynamicPixelsPerUnit) == 0x000160, "Member 'ULGUICanvas::dynamicPixelsPerUnit' has a wrong offset!");
static_assert(offsetof(ULGUICanvas, additionalShaderChannels) == 0x000164, "Member 'ULGUICanvas::additionalShaderChannels' has a wrong offset!");
static_assert(offsetof(ULGUICanvas, DefaultMaterials) == 0x000168, "Member 'ULGUICanvas::DefaultMaterials' has a wrong offset!");
static_assert(offsetof(ULGUICanvas, BlendDepth) == 0x000180, "Member 'ULGUICanvas::BlendDepth' has a wrong offset!");
static_assert(offsetof(ULGUICanvas, depthFade) == 0x000184, "Member 'ULGUICanvas::depthFade' has a wrong offset!");
static_assert(offsetof(ULGUICanvas, bEnableDepthTest) == 0x000188, "Member 'ULGUICanvas::bEnableDepthTest' has a wrong offset!");
static_assert(offsetof(ULGUICanvas, OverrideParameters) == 0x000189, "Member 'ULGUICanvas::OverrideParameters' has a wrong offset!");
static_assert(offsetof(ULGUICanvas, DefaultMeshType) == 0x000190, "Member 'ULGUICanvas::DefaultMeshType' has a wrong offset!");
static_assert(offsetof(ULGUICanvas, UIMesh) == 0x000300, "Member 'ULGUICanvas::UIMesh' has a wrong offset!");
static_assert(offsetof(ULGUICanvas, PooledUIMaterialList) == 0x000308, "Member 'ULGUICanvas::PooledUIMaterialList' has a wrong offset!");
static_assert(offsetof(ULGUICanvas, UIRenderableList) == 0x000338, "Member 'ULGUICanvas::UIRenderableList' has a wrong offset!");
static_assert(offsetof(ULGUICanvas, UIItemList) == 0x000348, "Member 'ULGUICanvas::UIItemList' has a wrong offset!");
static_assert(offsetof(ULGUICanvas, ChildrenCanvasArray) == 0x0003D8, "Member 'ULGUICanvas::ChildrenCanvasArray' has a wrong offset!");

// Class LGUI.LGUICanvasCustomClip
// 0x0058 (0x0080 - 0x0028)
class ULGUICanvasCustomClip : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class UMaterialInterface*, class UMaterialInterface*> replaceMaterialMap;                   // 0x0030(0x0050)(Edit, Protected, UObjectWrapper, NativeAccessSpecifierProtected)

public:
	void ReceiveApplyMaterialParameter(class UMaterialInstanceDynamic* InMaterial, class ULGUICanvas* InCanvas, class UUIItem* InUIItem);
	bool ReceiveCheckPointVisible(const struct FVector& InWorldPoint, class ULGUICanvas* InCanvas, class UUIItem* InUIItem);
	void ReceiveInit();
	bool ReceiveMaterialContainsClipParameter(class UMaterialInterface* InMaterial);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LGUICanvasCustomClip">();
	}
	static class ULGUICanvasCustomClip* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULGUICanvasCustomClip>();
	}
};
static_assert(alignof(ULGUICanvasCustomClip) == 0x000008, "Wrong alignment on ULGUICanvasCustomClip");
static_assert(sizeof(ULGUICanvasCustomClip) == 0x000080, "Wrong size on ULGUICanvasCustomClip");
static_assert(offsetof(ULGUICanvasCustomClip, replaceMaterialMap) == 0x000030, "Member 'ULGUICanvasCustomClip::replaceMaterialMap' has a wrong offset!");

// Class LGUI.UIEffectTextAnimation_PropertyWithWave
// 0x0020 (0x0048 - 0x0028)
class UUIEffectTextAnimation_PropertyWithWave : public UUIEffectTextAnimation_Property
{
public:
	float                                         Frequency;                                         // 0x0028(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         Speed;                                             // 0x002C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
