#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LGUI

#include "Basic.hpp"

#include "InputCore_structs.hpp"
#include "LGUI_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"
#include "LTween_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Slate_structs.hpp"


namespace SDK::Params
{

// Function LGUI.UIEffectTextAnimation_PropertyWithEase.SetEaseCurve
// 0x0008 (0x0008 - 0x0000)
struct UIEffectTextAnimation_PropertyWithEase_SetEaseCurve final
{
public:
	class UCurveFloat*                            Value;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(UIEffectTextAnimation_PropertyWithEase_SetEaseCurve) == 0x000008, "Wrong alignment on UIEffectTextAnimation_PropertyWithEase_SetEaseCurve");
static_assert(sizeof(UIEffectTextAnimation_PropertyWithEase_SetEaseCurve) == 0x000008, "Wrong size on UIEffectTextAnimation_PropertyWithEase_SetEaseCurve");
static_assert(offsetof(UIEffectTextAnimation_PropertyWithEase_SetEaseCurve, Value) == 0x000000, "Member 'UIEffectTextAnimation_PropertyWithEase_SetEaseCurve::Value' has a wrong offset!");

// Function LGUI.UIEffectTextAnimation_PropertyWithEase.SetEaseType
// 0x0001 (0x0001 - 0x0000)
struct UIEffectTextAnimation_PropertyWithEase_SetEaseType final
{
public:
	ELTweenEase                                   Value;                                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(UIEffectTextAnimation_PropertyWithEase_SetEaseType) == 0x000001, "Wrong alignment on UIEffectTextAnimation_PropertyWithEase_SetEaseType");
static_assert(sizeof(UIEffectTextAnimation_PropertyWithEase_SetEaseType) == 0x000001, "Wrong size on UIEffectTextAnimation_PropertyWithEase_SetEaseType");
static_assert(offsetof(UIEffectTextAnimation_PropertyWithEase_SetEaseType, Value) == 0x000000, "Member 'UIEffectTextAnimation_PropertyWithEase_SetEaseType::Value' has a wrong offset!");

// Function LGUI.UIEffectTextAnimation_PropertyWithEase.GetCurveFloat
// 0x0008 (0x0008 - 0x0000)
struct UIEffectTextAnimation_PropertyWithEase_GetCurveFloat final
{
public:
	class UCurveFloat*                            ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(UIEffectTextAnimation_PropertyWithEase_GetCurveFloat) == 0x000008, "Wrong alignment on UIEffectTextAnimation_PropertyWithEase_GetCurveFloat");
static_assert(sizeof(UIEffectTextAnimation_PropertyWithEase_GetCurveFloat) == 0x000008, "Wrong size on UIEffectTextAnimation_PropertyWithEase_GetCurveFloat");
static_assert(offsetof(UIEffectTextAnimation_PropertyWithEase_GetCurveFloat, ReturnValue) == 0x000000, "Member 'UIEffectTextAnimation_PropertyWithEase_GetCurveFloat::ReturnValue' has a wrong offset!");

// Function LGUI.UIEffectTextAnimation_PropertyWithEase.GetEaseType
// 0x0001 (0x0001 - 0x0000)
struct UIEffectTextAnimation_PropertyWithEase_GetEaseType final
{
public:
	ELTweenEase                                   ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(UIEffectTextAnimation_PropertyWithEase_GetEaseType) == 0x000001, "Wrong alignment on UIEffectTextAnimation_PropertyWithEase_GetEaseType");
static_assert(sizeof(UIEffectTextAnimation_PropertyWithEase_GetEaseType) == 0x000001, "Wrong size on UIEffectTextAnimation_PropertyWithEase_GetEaseType");
static_assert(offsetof(UIEffectTextAnimation_PropertyWithEase_GetEaseType, ReturnValue) == 0x000000, "Member 'UIEffectTextAnimation_PropertyWithEase_GetEaseType::ReturnValue' has a wrong offset!");

// Function LGUI.UIEffectTextAnimation_ColorRandomProperty.SetMax
// 0x0004 (0x0004 - 0x0000)
struct UIEffectTextAnimation_ColorRandomProperty_SetMax final
{
public:
	struct FColor                                 Value;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(UIEffectTextAnimation_ColorRandomProperty_SetMax) == 0x000004, "Wrong alignment on UIEffectTextAnimation_ColorRandomProperty_SetMax");
static_assert(sizeof(UIEffectTextAnimation_ColorRandomProperty_SetMax) == 0x000004, "Wrong size on UIEffectTextAnimation_ColorRandomProperty_SetMax");
static_assert(offsetof(UIEffectTextAnimation_ColorRandomProperty_SetMax, Value) == 0x000000, "Member 'UIEffectTextAnimation_ColorRandomProperty_SetMax::Value' has a wrong offset!");

// Function LGUI.UIEffectTextAnimation_ColorRandomProperty.SetMin
// 0x0004 (0x0004 - 0x0000)
struct UIEffectTextAnimation_ColorRandomProperty_SetMin final
{
public:
	struct FColor                                 Value;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(UIEffectTextAnimation_ColorRandomProperty_SetMin) == 0x000004, "Wrong alignment on UIEffectTextAnimation_ColorRandomProperty_SetMin");
static_assert(sizeof(UIEffectTextAnimation_ColorRandomProperty_SetMin) == 0x000004, "Wrong size on UIEffectTextAnimation_ColorRandomProperty_SetMin");
static_assert(offsetof(UIEffectTextAnimation_ColorRandomProperty_SetMin, Value) == 0x000000, "Member 'UIEffectTextAnimation_ColorRandomProperty_SetMin::Value' has a wrong offset!");

// Function LGUI.UIEffectTextAnimation_ColorRandomProperty.SetSeed
// 0x0004 (0x0004 - 0x0000)
struct UIEffectTextAnimation_ColorRandomProperty_SetSeed final
{
public:
	int32                                         Value;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(UIEffectTextAnimation_ColorRandomProperty_SetSeed) == 0x000004, "Wrong alignment on UIEffectTextAnimation_ColorRandomProperty_SetSeed");
static_assert(sizeof(UIEffectTextAnimation_ColorRandomProperty_SetSeed) == 0x000004, "Wrong size on UIEffectTextAnimation_ColorRandomProperty_SetSeed");
static_assert(offsetof(UIEffectTextAnimation_ColorRandomProperty_SetSeed, Value) == 0x000000, "Member 'UIEffectTextAnimation_ColorRandomProperty_SetSeed::Value' has a wrong offset!");

// Function LGUI.UIEffectTextAnimation_ColorRandomProperty.SetUseHSV
// 0x0001 (0x0001 - 0x0000)
struct UIEffectTextAnimation_ColorRandomProperty_SetUseHSV final
{
public:
	bool                                          Value;                                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(UIEffectTextAnimation_ColorRandomProperty_SetUseHSV) == 0x000001, "Wrong alignment on UIEffectTextAnimation_ColorRandomProperty_SetUseHSV");
static_assert(sizeof(UIEffectTextAnimation_ColorRandomProperty_SetUseHSV) == 0x000001, "Wrong size on UIEffectTextAnimation_ColorRandomProperty_SetUseHSV");
static_assert(offsetof(UIEffectTextAnimation_ColorRandomProperty_SetUseHSV, Value) == 0x000000, "Member 'UIEffectTextAnimation_ColorRandomProperty_SetUseHSV::Value' has a wrong offset!");

// Function LGUI.UIEffectTextAnimation_ColorRandomProperty.GetMax
// 0x0004 (0x0004 - 0x0000)
struct UIEffectTextAnimation_ColorRandomProperty_GetMax final
{
public:
	struct FColor                                 ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(UIEffectTextAnimation_ColorRandomProperty_GetMax) == 0x000004, "Wrong alignment on UIEffectTextAnimation_ColorRandomProperty_GetMax");
static_assert(sizeof(UIEffectTextAnimation_ColorRandomProperty_GetMax) == 0x000004, "Wrong size on UIEffectTextAnimation_ColorRandomProperty_GetMax");
static_assert(offsetof(UIEffectTextAnimation_ColorRandomProperty_GetMax, ReturnValue) == 0x000000, "Member 'UIEffectTextAnimation_ColorRandomProperty_GetMax::ReturnValue' has a wrong offset!");

// Function LGUI.UIEffectTextAnimation_ColorRandomProperty.GetMin
// 0x0004 (0x0004 - 0x0000)
struct UIEffectTextAnimation_ColorRandomProperty_GetMin final
{
public:
	struct FColor                                 ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(UIEffectTextAnimation_ColorRandomProperty_GetMin) == 0x000004, "Wrong alignment on UIEffectTextAnimation_ColorRandomProperty_GetMin");
static_assert(sizeof(UIEffectTextAnimation_ColorRandomProperty_GetMin) == 0x000004, "Wrong size on UIEffectTextAnimation_ColorRandomProperty_GetMin");
static_assert(offsetof(UIEffectTextAnimation_ColorRandomProperty_GetMin, ReturnValue) == 0x000000, "Member 'UIEffectTextAnimation_ColorRandomProperty_GetMin::ReturnValue' has a wrong offset!");

// Function LGUI.UIEffectTextAnimation_ColorRandomProperty.GetSeed
// 0x0004 (0x0004 - 0x0000)
struct UIEffectTextAnimation_ColorRandomProperty_GetSeed final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(UIEffectTextAnimation_ColorRandomProperty_GetSeed) == 0x000004, "Wrong alignment on UIEffectTextAnimation_ColorRandomProperty_GetSeed");
static_assert(sizeof(UIEffectTextAnimation_ColorRandomProperty_GetSeed) == 0x000004, "Wrong size on UIEffectTextAnimation_ColorRandomProperty_GetSeed");
static_assert(offsetof(UIEffectTextAnimation_ColorRandomProperty_GetSeed, ReturnValue) == 0x000000, "Member 'UIEffectTextAnimation_ColorRandomProperty_GetSeed::ReturnValue' has a wrong offset!");

// Function LGUI.UIEffectTextAnimation_ColorRandomProperty.GetUseHSV
// 0x0001 (0x0001 - 0x0000)
struct UIEffectTextAnimation_ColorRandomProperty_GetUseHSV final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(UIEffectTextAnimation_ColorRandomProperty_GetUseHSV) == 0x000001, "Wrong alignment on UIEffectTextAnimation_ColorRandomProperty_GetUseHSV");
static_assert(sizeof(UIEffectTextAnimation_ColorRandomProperty_GetUseHSV) == 0x000001, "Wrong size on UIEffectTextAnimation_ColorRandomProperty_GetUseHSV");
static_assert(offsetof(UIEffectTextAnimation_ColorRandomProperty_GetUseHSV, ReturnValue) == 0x000000, "Member 'UIEffectTextAnimation_ColorRandomProperty_GetUseHSV::ReturnValue' has a wrong offset!");

// Function LGUI.LGUILayoutElementInterface.GetConstantSize
// 0x0008 (0x0008 - 0x0000)
struct LGUILayoutElementInterface_GetConstantSize final
{
public:
	ELayoutElementSizeType                        Type;                                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LGUILayoutElementInterface_GetConstantSize) == 0x000004, "Wrong alignment on LGUILayoutElementInterface_GetConstantSize");
static_assert(sizeof(LGUILayoutElementInterface_GetConstantSize) == 0x000008, "Wrong size on LGUILayoutElementInterface_GetConstantSize");
static_assert(offsetof(LGUILayoutElementInterface_GetConstantSize, Type) == 0x000000, "Member 'LGUILayoutElementInterface_GetConstantSize::Type' has a wrong offset!");
static_assert(offsetof(LGUILayoutElementInterface_GetConstantSize, ReturnValue) == 0x000004, "Member 'LGUILayoutElementInterface_GetConstantSize::ReturnValue' has a wrong offset!");

// Function LGUI.LGUILayoutElementInterface.GetLayoutType
// 0x0001 (0x0001 - 0x0000)
struct LGUILayoutElementInterface_GetLayoutType final
{
public:
	ELayoutElementType                            ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LGUILayoutElementInterface_GetLayoutType) == 0x000001, "Wrong alignment on LGUILayoutElementInterface_GetLayoutType");
static_assert(sizeof(LGUILayoutElementInterface_GetLayoutType) == 0x000001, "Wrong size on LGUILayoutElementInterface_GetLayoutType");
static_assert(offsetof(LGUILayoutElementInterface_GetLayoutType, ReturnValue) == 0x000000, "Member 'LGUILayoutElementInterface_GetLayoutType::ReturnValue' has a wrong offset!");

// Function LGUI.LGUILayoutElementInterface.GetRatioSize
// 0x0008 (0x0008 - 0x0000)
struct LGUILayoutElementInterface_GetRatioSize final
{
public:
	ELayoutElementSizeType                        Type;                                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LGUILayoutElementInterface_GetRatioSize) == 0x000004, "Wrong alignment on LGUILayoutElementInterface_GetRatioSize");
static_assert(sizeof(LGUILayoutElementInterface_GetRatioSize) == 0x000008, "Wrong size on LGUILayoutElementInterface_GetRatioSize");
static_assert(offsetof(LGUILayoutElementInterface_GetRatioSize, Type) == 0x000000, "Member 'LGUILayoutElementInterface_GetRatioSize::Type' has a wrong offset!");
static_assert(offsetof(LGUILayoutElementInterface_GetRatioSize, ReturnValue) == 0x000004, "Member 'LGUILayoutElementInterface_GetRatioSize::ReturnValue' has a wrong offset!");

// Function LGUI.LGUILayoutInterface.GetCanLayoutControlAnchor
// 0x0010 (0x0010 - 0x0000)
struct LGUILayoutInterface_GetCanLayoutControlAnchor final
{
public:
	class UUIItem*                                InUIItem;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLGUICanLayoutControlAnchor            OutResult;                                         // 0x0008(0x0006)(Parm, OutParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x000E(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F[0x1];                                        // 0x000F(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(LGUILayoutInterface_GetCanLayoutControlAnchor) == 0x000008, "Wrong alignment on LGUILayoutInterface_GetCanLayoutControlAnchor");
static_assert(sizeof(LGUILayoutInterface_GetCanLayoutControlAnchor) == 0x000010, "Wrong size on LGUILayoutInterface_GetCanLayoutControlAnchor");
static_assert(offsetof(LGUILayoutInterface_GetCanLayoutControlAnchor, InUIItem) == 0x000000, "Member 'LGUILayoutInterface_GetCanLayoutControlAnchor::InUIItem' has a wrong offset!");
static_assert(offsetof(LGUILayoutInterface_GetCanLayoutControlAnchor, OutResult) == 0x000008, "Member 'LGUILayoutInterface_GetCanLayoutControlAnchor::OutResult' has a wrong offset!");
static_assert(offsetof(LGUILayoutInterface_GetCanLayoutControlAnchor, ReturnValue) == 0x00000E, "Member 'LGUILayoutInterface_GetCanLayoutControlAnchor::ReturnValue' has a wrong offset!");

// Function LGUI.UISpriteRenderableInterface.SpriteRenderableGetSprite
// 0x0008 (0x0008 - 0x0000)
struct UISpriteRenderableInterface_SpriteRenderableGetSprite final
{
public:
	class ULGUISpriteData_BaseObject*             ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(UISpriteRenderableInterface_SpriteRenderableGetSprite) == 0x000008, "Wrong alignment on UISpriteRenderableInterface_SpriteRenderableGetSprite");
static_assert(sizeof(UISpriteRenderableInterface_SpriteRenderableGetSprite) == 0x000008, "Wrong size on UISpriteRenderableInterface_SpriteRenderableGetSprite");
static_assert(offsetof(UISpriteRenderableInterface_SpriteRenderableGetSprite, ReturnValue) == 0x000000, "Member 'UISpriteRenderableInterface_SpriteRenderableGetSprite::ReturnValue' has a wrong offset!");

// Function LGUI.LGUIBaseEventData.ToString
// 0x0010 (0x0010 - 0x0000)
struct LGUIBaseEventData_ToString final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LGUIBaseEventData_ToString) == 0x000008, "Wrong alignment on LGUIBaseEventData_ToString");
static_assert(sizeof(LGUIBaseEventData_ToString) == 0x000010, "Wrong size on LGUIBaseEventData_ToString");
static_assert(offsetof(LGUIBaseEventData_ToString, ReturnValue) == 0x000000, "Member 'LGUIBaseEventData_ToString::ReturnValue' has a wrong offset!");

// Function LGUI.UIEffectTextAnimation_AlphaProperty.SetAlpha
// 0x0004 (0x0004 - 0x0000)
struct UIEffectTextAnimation_AlphaProperty_SetAlpha final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(UIEffectTextAnimation_AlphaProperty_SetAlpha) == 0x000004, "Wrong alignment on UIEffectTextAnimation_AlphaProperty_SetAlpha");
static_assert(sizeof(UIEffectTextAnimation_AlphaProperty_SetAlpha) == 0x000004, "Wrong size on UIEffectTextAnimation_AlphaProperty_SetAlpha");
static_assert(offsetof(UIEffectTextAnimation_AlphaProperty_SetAlpha, Value) == 0x000000, "Member 'UIEffectTextAnimation_AlphaProperty_SetAlpha::Value' has a wrong offset!");

// Function LGUI.UIEffectTextAnimation_AlphaProperty.GetAlpha
// 0x0004 (0x0004 - 0x0000)
struct UIEffectTextAnimation_AlphaProperty_GetAlpha final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(UIEffectTextAnimation_AlphaProperty_GetAlpha) == 0x000004, "Wrong alignment on UIEffectTextAnimation_AlphaProperty_GetAlpha");
static_assert(sizeof(UIEffectTextAnimation_AlphaProperty_GetAlpha) == 0x000004, "Wrong size on UIEffectTextAnimation_AlphaProperty_GetAlpha");
static_assert(offsetof(UIEffectTextAnimation_AlphaProperty_GetAlpha, ReturnValue) == 0x000000, "Member 'UIEffectTextAnimation_AlphaProperty_GetAlpha::ReturnValue' has a wrong offset!");

// Function LGUI.LGUIBaseRaycaster.SetClickThreshold
// 0x0004 (0x0004 - 0x0000)
struct LGUIBaseRaycaster_SetClickThreshold final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LGUIBaseRaycaster_SetClickThreshold) == 0x000004, "Wrong alignment on LGUIBaseRaycaster_SetClickThreshold");
static_assert(sizeof(LGUIBaseRaycaster_SetClickThreshold) == 0x000004, "Wrong size on LGUIBaseRaycaster_SetClickThreshold");
static_assert(offsetof(LGUIBaseRaycaster_SetClickThreshold, Value) == 0x000000, "Member 'LGUIBaseRaycaster_SetClickThreshold::Value' has a wrong offset!");

// Function LGUI.LGUIBaseRaycaster.SetHoldToDrag
// 0x0001 (0x0001 - 0x0000)
struct LGUIBaseRaycaster_SetHoldToDrag final
{
public:
	bool                                          Value;                                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LGUIBaseRaycaster_SetHoldToDrag) == 0x000001, "Wrong alignment on LGUIBaseRaycaster_SetHoldToDrag");
static_assert(sizeof(LGUIBaseRaycaster_SetHoldToDrag) == 0x000001, "Wrong size on LGUIBaseRaycaster_SetHoldToDrag");
static_assert(offsetof(LGUIBaseRaycaster_SetHoldToDrag, Value) == 0x000000, "Member 'LGUIBaseRaycaster_SetHoldToDrag::Value' has a wrong offset!");

// Function LGUI.LGUIBaseRaycaster.SetHoldToDragTime
// 0x0004 (0x0004 - 0x0000)
struct LGUIBaseRaycaster_SetHoldToDragTime final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LGUIBaseRaycaster_SetHoldToDragTime) == 0x000004, "Wrong alignment on LGUIBaseRaycaster_SetHoldToDragTime");
static_assert(sizeof(LGUIBaseRaycaster_SetHoldToDragTime) == 0x000004, "Wrong size on LGUIBaseRaycaster_SetHoldToDragTime");
static_assert(offsetof(LGUIBaseRaycaster_SetHoldToDragTime, Value) == 0x000000, "Member 'LGUIBaseRaycaster_SetHoldToDragTime::Value' has a wrong offset!");

// Function LGUI.LGUIBaseRaycaster.GetAffectByGamePause
// 0x0001 (0x0001 - 0x0000)
struct LGUIBaseRaycaster_GetAffectByGamePause final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LGUIBaseRaycaster_GetAffectByGamePause) == 0x000001, "Wrong alignment on LGUIBaseRaycaster_GetAffectByGamePause");
static_assert(sizeof(LGUIBaseRaycaster_GetAffectByGamePause) == 0x000001, "Wrong size on LGUIBaseRaycaster_GetAffectByGamePause");
static_assert(offsetof(LGUIBaseRaycaster_GetAffectByGamePause, ReturnValue) == 0x000000, "Member 'LGUIBaseRaycaster_GetAffectByGamePause::ReturnValue' has a wrong offset!");

// Function LGUI.LGUIBaseRaycaster.GetClickThreshold
// 0x0004 (0x0004 - 0x0000)
struct LGUIBaseRaycaster_GetClickThreshold final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LGUIBaseRaycaster_GetClickThreshold) == 0x000004, "Wrong alignment on LGUIBaseRaycaster_GetClickThreshold");
static_assert(sizeof(LGUIBaseRaycaster_GetClickThreshold) == 0x000004, "Wrong size on LGUIBaseRaycaster_GetClickThreshold");
static_assert(offsetof(LGUIBaseRaycaster_GetClickThreshold, ReturnValue) == 0x000000, "Member 'LGUIBaseRaycaster_GetClickThreshold::ReturnValue' has a wrong offset!");

// Function LGUI.LGUIBaseRaycaster.GetDepth
// 0x0004 (0x0004 - 0x0000)
struct LGUIBaseRaycaster_GetDepth final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LGUIBaseRaycaster_GetDepth) == 0x000004, "Wrong alignment on LGUIBaseRaycaster_GetDepth");
static_assert(sizeof(LGUIBaseRaycaster_GetDepth) == 0x000004, "Wrong size on LGUIBaseRaycaster_GetDepth");
static_assert(offsetof(LGUIBaseRaycaster_GetDepth, ReturnValue) == 0x000000, "Member 'LGUIBaseRaycaster_GetDepth::ReturnValue' has a wrong offset!");

// Function LGUI.LGUIBaseRaycaster.GetEventFireType
// 0x0001 (0x0001 - 0x0000)
struct LGUIBaseRaycaster_GetEventFireType final
{
public:
	ELGUIEventFireType                            ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LGUIBaseRaycaster_GetEventFireType) == 0x000001, "Wrong alignment on LGUIBaseRaycaster_GetEventFireType");
static_assert(sizeof(LGUIBaseRaycaster_GetEventFireType) == 0x000001, "Wrong size on LGUIBaseRaycaster_GetEventFireType");
static_assert(offsetof(LGUIBaseRaycaster_GetEventFireType, ReturnValue) == 0x000000, "Member 'LGUIBaseRaycaster_GetEventFireType::ReturnValue' has a wrong offset!");

// Function LGUI.LGUIBaseRaycaster.GetHoldToDrag
// 0x0001 (0x0001 - 0x0000)
struct LGUIBaseRaycaster_GetHoldToDrag final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LGUIBaseRaycaster_GetHoldToDrag) == 0x000001, "Wrong alignment on LGUIBaseRaycaster_GetHoldToDrag");
static_assert(sizeof(LGUIBaseRaycaster_GetHoldToDrag) == 0x000001, "Wrong size on LGUIBaseRaycaster_GetHoldToDrag");
static_assert(offsetof(LGUIBaseRaycaster_GetHoldToDrag, ReturnValue) == 0x000000, "Member 'LGUIBaseRaycaster_GetHoldToDrag::ReturnValue' has a wrong offset!");

// Function LGUI.LGUIBaseRaycaster.GetHoldToDragTime
// 0x0004 (0x0004 - 0x0000)
struct LGUIBaseRaycaster_GetHoldToDragTime final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LGUIBaseRaycaster_GetHoldToDragTime) == 0x000004, "Wrong alignment on LGUIBaseRaycaster_GetHoldToDragTime");
static_assert(sizeof(LGUIBaseRaycaster_GetHoldToDragTime) == 0x000004, "Wrong size on LGUIBaseRaycaster_GetHoldToDragTime");
static_assert(offsetof(LGUIBaseRaycaster_GetHoldToDragTime, ReturnValue) == 0x000000, "Member 'LGUIBaseRaycaster_GetHoldToDragTime::ReturnValue' has a wrong offset!");

// Function LGUI.LGUIBaseRaycaster.GetPointerID
// 0x0004 (0x0004 - 0x0000)
struct LGUIBaseRaycaster_GetPointerID final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LGUIBaseRaycaster_GetPointerID) == 0x000004, "Wrong alignment on LGUIBaseRaycaster_GetPointerID");
static_assert(sizeof(LGUIBaseRaycaster_GetPointerID) == 0x000004, "Wrong size on LGUIBaseRaycaster_GetPointerID");
static_assert(offsetof(LGUIBaseRaycaster_GetPointerID, ReturnValue) == 0x000000, "Member 'LGUIBaseRaycaster_GetPointerID::ReturnValue' has a wrong offset!");

// Function LGUI.LGUIBaseRaycaster.GetRayDirection
// 0x0018 (0x0018 - 0x0000)
struct LGUIBaseRaycaster_GetRayDirection final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LGUIBaseRaycaster_GetRayDirection) == 0x000008, "Wrong alignment on LGUIBaseRaycaster_GetRayDirection");
static_assert(sizeof(LGUIBaseRaycaster_GetRayDirection) == 0x000018, "Wrong size on LGUIBaseRaycaster_GetRayDirection");
static_assert(offsetof(LGUIBaseRaycaster_GetRayDirection, ReturnValue) == 0x000000, "Member 'LGUIBaseRaycaster_GetRayDirection::ReturnValue' has a wrong offset!");

// Function LGUI.LGUIBaseRaycaster.GetRayLength
// 0x0004 (0x0004 - 0x0000)
struct LGUIBaseRaycaster_GetRayLength final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LGUIBaseRaycaster_GetRayLength) == 0x000004, "Wrong alignment on LGUIBaseRaycaster_GetRayLength");
static_assert(sizeof(LGUIBaseRaycaster_GetRayLength) == 0x000004, "Wrong size on LGUIBaseRaycaster_GetRayLength");
static_assert(offsetof(LGUIBaseRaycaster_GetRayLength, ReturnValue) == 0x000000, "Member 'LGUIBaseRaycaster_GetRayLength::ReturnValue' has a wrong offset!");

// Function LGUI.LGUIBaseRaycaster.GetRayOrigin
// 0x0018 (0x0018 - 0x0000)
struct LGUIBaseRaycaster_GetRayOrigin final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LGUIBaseRaycaster_GetRayOrigin) == 0x000008, "Wrong alignment on LGUIBaseRaycaster_GetRayOrigin");
static_assert(sizeof(LGUIBaseRaycaster_GetRayOrigin) == 0x000018, "Wrong size on LGUIBaseRaycaster_GetRayOrigin");
static_assert(offsetof(LGUIBaseRaycaster_GetRayOrigin, ReturnValue) == 0x000000, "Member 'LGUIBaseRaycaster_GetRayOrigin::ReturnValue' has a wrong offset!");

// Function LGUI.LGUIBaseRaycaster.GetTraceChannel
// 0x0001 (0x0001 - 0x0000)
struct LGUIBaseRaycaster_GetTraceChannel final
{
public:
	ETraceTypeQuery                               ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LGUIBaseRaycaster_GetTraceChannel) == 0x000001, "Wrong alignment on LGUIBaseRaycaster_GetTraceChannel");
static_assert(sizeof(LGUIBaseRaycaster_GetTraceChannel) == 0x000001, "Wrong size on LGUIBaseRaycaster_GetTraceChannel");
static_assert(offsetof(LGUIBaseRaycaster_GetTraceChannel, ReturnValue) == 0x000000, "Member 'LGUIBaseRaycaster_GetTraceChannel::ReturnValue' has a wrong offset!");

// Function LGUI.LGUIBPLibrary.AlphaFrom
// 0x0020 (0x0020 - 0x0000)
struct LGUIBPLibrary_AlphaFrom final
{
public:
	class UUIBaseRenderable*                      Target;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StartValue;                                        // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Duration;                                          // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Delay;                                             // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ELTweenEase                                   Ease;                                              // 0x0014(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ULTweener*                              ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LGUIBPLibrary_AlphaFrom) == 0x000008, "Wrong alignment on LGUIBPLibrary_AlphaFrom");
static_assert(sizeof(LGUIBPLibrary_AlphaFrom) == 0x000020, "Wrong size on LGUIBPLibrary_AlphaFrom");
static_assert(offsetof(LGUIBPLibrary_AlphaFrom, Target) == 0x000000, "Member 'LGUIBPLibrary_AlphaFrom::Target' has a wrong offset!");
static_assert(offsetof(LGUIBPLibrary_AlphaFrom, StartValue) == 0x000008, "Member 'LGUIBPLibrary_AlphaFrom::StartValue' has a wrong offset!");
static_assert(offsetof(LGUIBPLibrary_AlphaFrom, Duration) == 0x00000C, "Member 'LGUIBPLibrary_AlphaFrom::Duration' has a wrong offset!");
static_assert(offsetof(LGUIBPLibrary_AlphaFrom, Delay) == 0x000010, "Member 'LGUIBPLibrary_AlphaFrom::Delay' has a wrong offset!");
static_assert(offsetof(LGUIBPLibrary_AlphaFrom, Ease) == 0x000014, "Member 'LGUIBPLibrary_AlphaFrom::Ease' has a wrong offset!");
static_assert(offsetof(LGUIBPLibrary_AlphaFrom, ReturnValue) == 0x000018, "Member 'LGUIBPLibrary_AlphaFrom::ReturnValue' has a wrong offset!");

// Function LGUI.LGUIBPLibrary.AlphaTo
// 0x0020 (0x0020 - 0x0000)
struct LGUIBPLibrary_AlphaTo final
{
public:
	class UUIBaseRenderable*                      Target;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         endValue;                                          // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Duration;                                          // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Delay;                                             // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ELTweenEase                                   Ease;                                              // 0x0014(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ULTweener*                              ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LGUIBPLibrary_AlphaTo) == 0x000008, "Wrong alignment on LGUIBPLibrary_AlphaTo");
static_assert(sizeof(LGUIBPLibrary_AlphaTo) == 0x000020, "Wrong size on LGUIBPLibrary_AlphaTo");
static_assert(offsetof(LGUIBPLibrary_AlphaTo, Target) == 0x000000, "Member 'LGUIBPLibrary_AlphaTo::Target' has a wrong offset!");
static_assert(offsetof(LGUIBPLibrary_AlphaTo, endValue) == 0x000008, "Member 'LGUIBPLibrary_AlphaTo::endValue' has a wrong offset!");
static_assert(offsetof(LGUIBPLibrary_AlphaTo, Duration) == 0x00000C, "Member 'LGUIBPLibrary_AlphaTo::Duration' has a wrong offset!");
static_assert(offsetof(LGUIBPLibrary_AlphaTo, Delay) == 0x000010, "Member 'LGUIBPLibrary_AlphaTo::Delay' has a wrong offset!");
static_assert(offsetof(LGUIBPLibrary_AlphaTo, Ease) == 0x000014, "Member 'LGUIBPLibrary_AlphaTo::Ease' has a wrong offset!");
static_assert(offsetof(LGUIBPLibrary_AlphaTo, ReturnValue) == 0x000018, "Member 'LGUIBPLibrary_AlphaTo::ReturnValue' has a wrong offset!");

// Function LGUI.LGUIBPLibrary.AnchorBottomTo
// 0x0020 (0x0020 - 0x0000)
struct LGUIBPLibrary_AnchorBottomTo final
{
public:
	class UUIItem*                                Target;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         endValue;                                          // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Duration;                                          // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Delay;                                             // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ELTweenEase                                   Ease;                                              // 0x0014(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ULTweener*                              ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LGUIBPLibrary_AnchorBottomTo) == 0x000008, "Wrong alignment on LGUIBPLibrary_AnchorBottomTo");
static_assert(sizeof(LGUIBPLibrary_AnchorBottomTo) == 0x000020, "Wrong size on LGUIBPLibrary_AnchorBottomTo");
static_assert(offsetof(LGUIBPLibrary_AnchorBottomTo, Target) == 0x000000, "Member 'LGUIBPLibrary_AnchorBottomTo::Target' has a wrong offset!");
static_assert(offsetof(LGUIBPLibrary_AnchorBottomTo, endValue) == 0x000008, "Member 'LGUIBPLibrary_AnchorBottomTo::endValue' has a wrong offset!");
static_assert(offsetof(LGUIBPLibrary_AnchorBottomTo, Duration) == 0x00000C, "Member 'LGUIBPLibrary_AnchorBottomTo::Duration' has a wrong offset!");
static_assert(offsetof(LGUIBPLibrary_AnchorBottomTo, Delay) == 0x000010, "Member 'LGUIBPLibrary_AnchorBottomTo::Delay' has a wrong offset!");
static_assert(offsetof(LGUIBPLibrary_AnchorBottomTo, Ease) == 0x000014, "Member 'LGUIBPLibrary_AnchorBottomTo::Ease' has a wrong offset!");
static_assert(offsetof(LGUIBPLibrary_AnchorBottomTo, ReturnValue) == 0x000018, "Member 'LGUIBPLibrary_AnchorBottomTo::ReturnValue' has a wrong offset!");

// Function LGUI.LGUIBPLibrary.AnchoredPositionTo
// 0x0030 (0x0030 - 0x0000)
struct LGUIBPLibrary_AnchoredPositionTo final
{
public:
	class UUIItem*                                Target;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              endValue;                                          // 0x0008(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Duration;                                          // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Delay;                                             // 0x001C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ELTweenEase                                   Ease;                                              // 0x0020(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULTweener*                              ReturnValue;                                       // 0x0028(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LGUIBPLibrary_AnchoredPositionTo) == 0x000008, "Wrong alignment on LGUIBPLibrary_AnchoredPositionTo");
static_assert(sizeof(LGUIBPLibrary_AnchoredPositionTo) == 0x000030, "Wrong size on LGUIBPLibrary_AnchoredPositionTo");
static_assert(offsetof(LGUIBPLibrary_AnchoredPositionTo, Target) == 0x000000, "Member 'LGUIBPLibrary_AnchoredPositionTo::Target' has a wrong offset!");
static_assert(offsetof(LGUIBPLibrary_AnchoredPositionTo, endValue) == 0x000008, "Member 'LGUIBPLibrary_AnchoredPositionTo::endValue' has a wrong offset!");
static_assert(offsetof(LGUIBPLibrary_AnchoredPositionTo, Duration) == 0x000018, "Member 'LGUIBPLibrary_AnchoredPositionTo::Duration' has a wrong offset!");
static_assert(offsetof(LGUIBPLibrary_AnchoredPositionTo, Delay) == 0x00001C, "Member 'LGUIBPLibrary_AnchoredPositionTo::Delay' has a wrong offset!");
static_assert(offsetof(LGUIBPLibrary_AnchoredPositionTo, Ease) == 0x000020, "Member 'LGUIBPLibrary_AnchoredPositionTo::Ease' has a wrong offset!");
static_assert(offsetof(LGUIBPLibrary_AnchoredPositionTo, ReturnValue) == 0x000028, "Member 'LGUIBPLibrary_AnchoredPositionTo::ReturnValue' has a wrong offset!");

// Function LGUI.LGUIBPLibrary.AnchorLeftTo
// 0x0020 (0x0020 - 0x0000)
struct LGUIBPLibrary_AnchorLeftTo final
{
public:
	class UUIItem*                                Target;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         endValue;                                          // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Duration;                                          // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Delay;                                             // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ELTweenEase                                   Ease;                                              // 0x0014(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ULTweener*                              ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LGUIBPLibrary_AnchorLeftTo) == 0x000008, "Wrong alignment on LGUIBPLibrary_AnchorLeftTo");
static_assert(sizeof(LGUIBPLibrary_AnchorLeftTo) == 0x000020, "Wrong size on LGUIBPLibrary_AnchorLeftTo");
static_assert(offsetof(LGUIBPLibrary_AnchorLeftTo, Target) == 0x000000, "Member 'LGUIBPLibrary_AnchorLeftTo::Target' has a wrong offset!");
static_assert(offsetof(LGUIBPLibrary_AnchorLeftTo, endValue) == 0x000008, "Member 'LGUIBPLibrary_AnchorLeftTo::endValue' has a wrong offset!");
static_assert(offsetof(LGUIBPLibrary_AnchorLeftTo, Duration) == 0x00000C, "Member 'LGUIBPLibrary_AnchorLeftTo::Duration' has a wrong offset!");
static_assert(offsetof(LGUIBPLibrary_AnchorLeftTo, Delay) == 0x000010, "Member 'LGUIBPLibrary_AnchorLeftTo::Delay' has a wrong offset!");
static_assert(offsetof(LGUIBPLibrary_AnchorLeftTo, Ease) == 0x000014, "Member 'LGUIBPLibrary_AnchorLeftTo::Ease' has a wrong offset!");
static_assert(offsetof(LGUIBPLibrary_AnchorLeftTo, ReturnValue) == 0x000018, "Member 'LGUIBPLibrary_AnchorLeftTo::ReturnValue' has a wrong offset!");

// Function LGUI.LGUIBPLibrary.AnchorOffsetTo
// 0x0030 (0x0030 - 0x0000)
struct LGUIBPLibrary_AnchorOffsetTo final
{
public:
	class UUIItem*                                Target;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              endValue;                                          // 0x0008(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Duration;                                          // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Delay;                                             // 0x001C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ELTweenEase                                   Ease;                                              // 0x0020(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULTweener*                              ReturnValue;                                       // 0x0028(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LGUIBPLibrary_AnchorOffsetTo) == 0x000008, "Wrong alignment on LGUIBPLibrary_AnchorOffsetTo");
static_assert(sizeof(LGUIBPLibrary_AnchorOffsetTo) == 0x000030, "Wrong size on LGUIBPLibrary_AnchorOffsetTo");
static_assert(offsetof(LGUIBPLibrary_AnchorOffsetTo, Target) == 0x000000, "Member 'LGUIBPLibrary_AnchorOffsetTo::Target' has a wrong offset!");
static_assert(offsetof(LGUIBPLibrary_AnchorOffsetTo, endValue) == 0x000008, "Member 'LGUIBPLibrary_AnchorOffsetTo::endValue' has a wrong offset!");
static_assert(offsetof(LGUIBPLibrary_AnchorOffsetTo, Duration) == 0x000018, "Member 'LGUIBPLibrary_AnchorOffsetTo::Duration' has a wrong offset!");
static_assert(offsetof(LGUIBPLibrary_AnchorOffsetTo, Delay) == 0x00001C, "Member 'LGUIBPLibrary_AnchorOffsetTo::Delay' has a wrong offset!");
static_assert(offsetof(LGUIBPLibrary_AnchorOffsetTo, Ease) == 0x000020, "Member 'LGUIBPLibrary_AnchorOffsetTo::Ease' has a wrong offset!");
static_assert(offsetof(LGUIBPLibrary_AnchorOffsetTo, ReturnValue) == 0x000028, "Member 'LGUIBPLibrary_AnchorOffsetTo::ReturnValue' has a wrong offset!");

// Function LGUI.LGUIBPLibrary.AnchorOffsetXTo
// 0x0020 (0x0020 - 0x0000)
struct LGUIBPLibrary_AnchorOffsetXTo final
{
public:
	class UUIItem*                                Target;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         endValue;                                          // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Duration;                                          // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Delay;                                             // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ELTweenEase                                   Ease;                                              // 0x0014(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ULTweener*                              ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LGUIBPLibrary_AnchorOffsetXTo) == 0x000008, "Wrong alignment on LGUIBPLibrary_AnchorOffsetXTo");
static_assert(sizeof(LGUIBPLibrary_AnchorOffsetXTo) == 0x000020, "Wrong size on LGUIBPLibrary_AnchorOffsetXTo");
static_assert(offsetof(LGUIBPLibrary_AnchorOffsetXTo, Target) == 0x000000, "Member 'LGUIBPLibrary_AnchorOffsetXTo::Target' has a wrong offset!");
static_assert(offsetof(LGUIBPLibrary_AnchorOffsetXTo, endValue) == 0x000008, "Member 'LGUIBPLibrary_AnchorOffsetXTo::endValue' has a wrong offset!");
static_assert(offsetof(LGUIBPLibrary_AnchorOffsetXTo, Duration) == 0x00000C, "Member 'LGUIBPLibrary_AnchorOffsetXTo::Duration' has a wrong offset!");
static_assert(offsetof(LGUIBPLibrary_AnchorOffsetXTo, Delay) == 0x000010, "Member 'LGUIBPLibrary_AnchorOffsetXTo::Delay' has a wrong offset!");
static_assert(offsetof(LGUIBPLibrary_AnchorOffsetXTo, Ease) == 0x000014, "Member 'LGUIBPLibrary_AnchorOffsetXTo::Ease' has a wrong offset!");
static_assert(offsetof(LGUIBPLibrary_AnchorOffsetXTo, ReturnValue) == 0x000018, "Member 'LGUIBPLibrary_AnchorOffsetXTo::ReturnValue' has a wrong offset!");

// Function LGUI.LGUIBPLibrary.AnchorOffsetYTo
// 0x0020 (0x0020 - 0x0000)
struct LGUIBPLibrary_AnchorOffsetYTo final
{
public:
	class UUIItem*                                Target;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         endValue;                                          // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Duration;                                          // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Delay;                                             // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ELTweenEase                                   Ease;                                              // 0x0014(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ULTweener*                              ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LGUIBPLibrary_AnchorOffsetYTo) == 0x000008, "Wrong alignment on LGUIBPLibrary_AnchorOffsetYTo");
static_assert(sizeof(LGUIBPLibrary_AnchorOffsetYTo) == 0x000020, "Wrong size on LGUIBPLibrary_AnchorOffsetYTo");
static_assert(offsetof(LGUIBPLibrary_AnchorOffsetYTo, Target) == 0x000000, "Member 'LGUIBPLibrary_AnchorOffsetYTo::Target' has a wrong offset!");
static_assert(offsetof(LGUIBPLibrary_AnchorOffsetYTo, endValue) == 0x000008, "Member 'LGUIBPLibrary_AnchorOffsetYTo::endValue' has a wrong offset!");
static_assert(offsetof(LGUIBPLibrary_AnchorOffsetYTo, Duration) == 0x00000C, "Member 'LGUIBPLibrary_AnchorOffsetYTo::Duration' has a wrong offset!");
static_assert(offsetof(LGUIBPLibrary_AnchorOffsetYTo, Delay) == 0x000010, "Member 'LGUIBPLibrary_AnchorOffsetYTo::Delay' has a wrong offset!");
static_assert(offsetof(LGUIBPLibrary_AnchorOffsetYTo, Ease) == 0x000014, "Member 'LGUIBPLibrary_AnchorOffsetYTo::Ease' has a wrong offset!");
static_assert(offsetof(LGUIBPLibrary_AnchorOffsetYTo, ReturnValue) == 0x000018, "Member 'LGUIBPLibrary_AnchorOffsetYTo::ReturnValue' has a wrong offset!");

// Function LGUI.LGUIBPLibrary.AnchorRightTo
// 0x0020 (0x0020 - 0x0000)
struct LGUIBPLibrary_AnchorRightTo final
{
public:
	class UUIItem*                                Target;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         endValue;                                          // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Duration;                                          // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Delay;                                             // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ELTweenEase                                   Ease;                                              // 0x0014(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ULTweener*                              ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LGUIBPLibrary_AnchorRightTo) == 0x000008, "Wrong alignment on LGUIBPLibrary_AnchorRightTo");
static_assert(sizeof(LGUIBPLibrary_AnchorRightTo) == 0x000020, "Wrong size on LGUIBPLibrary_AnchorRightTo");
static_assert(offsetof(LGUIBPLibrary_AnchorRightTo, Target) == 0x000000, "Member 'LGUIBPLibrary_AnchorRightTo::Target' has a wrong offset!");
static_assert(offsetof(LGUIBPLibrary_AnchorRightTo, endValue) == 0x000008, "Member 'LGUIBPLibrary_AnchorRightTo::endValue' has a wrong offset!");
static_assert(offsetof(LGUIBPLibrary_AnchorRightTo, Duration) == 0x00000C, "Member 'LGUIBPLibrary_AnchorRightTo::Duration' has a wrong offset!");
static_assert(offsetof(LGUIBPLibrary_AnchorRightTo, Delay) == 0x000010, "Member 'LGUIBPLibrary_AnchorRightTo::Delay' has a wrong offset!");
static_assert(offsetof(LGUIBPLibrary_AnchorRightTo, Ease) == 0x000014, "Member 'LGUIBPLibrary_AnchorRightTo::Ease' has a wrong offset!");
static_assert(offsetof(LGUIBPLibrary_AnchorRightTo, ReturnValue) == 0x000018, "Member 'LGUIBPLibrary_AnchorRightTo::ReturnValue' has a wrong offset!");

// Function LGUI.LGUIBPLibrary.AnchorTopTo
// 0x0020 (0x0020 - 0x0000)
struct LGUIBPLibrary_AnchorTopTo final
{
public:
	class UUIItem*                                Target;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         endValue;                                          // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Duration;                                          // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Delay;                                             // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ELTweenEase                                   Ease;                                              // 0x0014(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ULTweener*                              ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LGUIBPLibrary_AnchorTopTo) == 0x000008, "Wrong alignment on LGUIBPLibrary_AnchorTopTo");
static_assert(sizeof(LGUIBPLibrary_AnchorTopTo) == 0x000020, "Wrong size on LGUIBPLibrary_AnchorTopTo");
static_assert(offsetof(LGUIBPLibrary_AnchorTopTo, Target) == 0x000000, "Member 'LGUIBPLibrary_AnchorTopTo::Target' has a wrong offset!");
static_assert(offsetof(LGUIBPLibrary_AnchorTopTo, endValue) == 0x000008, "Member 'LGUIBPLibrary_AnchorTopTo::endValue' has a wrong offset!");
static_assert(offsetof(LGUIBPLibrary_AnchorTopTo, Duration) == 0x00000C, "Member 'LGUIBPLibrary_AnchorTopTo::Duration' has a wrong offset!");
static_assert(offsetof(LGUIBPLibrary_AnchorTopTo, Delay) == 0x000010, "Member 'LGUIBPLibrary_AnchorTopTo::Delay' has a wrong offset!");
static_assert(offsetof(LGUIBPLibrary_AnchorTopTo, Ease) == 0x000014, "Member 'LGUIBPLibrary_AnchorTopTo::Ease' has a wrong offset!");
static_assert(offsetof(LGUIBPLibrary_AnchorTopTo, ReturnValue) == 0x000018, "Member 'LGUIBPLibrary_AnchorTopTo::ReturnValue' has a wrong offset!");

// Function LGUI.LGUIBPLibrary.ColorFrom
// 0x0020 (0x0020 - 0x0000)
struct LGUIBPLibrary_ColorFrom final
{
public:
	class UUIBaseRenderable*                      Target;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FColor                                 StartValue;                                        // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Duration;                                          // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Delay;                                             // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ELTweenEase                                   Ease;                                              // 0x0014(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ULTweener*                              ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
