#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LTween

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "LTween_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function LTween.LTweenBPLibrary.ArrayKillIfIsTweening
// 0x0020 (0x0020 - 0x0000)
struct LTweenBPLibrary_ArrayKillIfIsTweening final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class ULTweener*>                      inTweenerArray;                                    // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          callComplete;                                      // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(LTweenBPLibrary_ArrayKillIfIsTweening) == 0x000008, "Wrong alignment on LTweenBPLibrary_ArrayKillIfIsTweening");
static_assert(sizeof(LTweenBPLibrary_ArrayKillIfIsTweening) == 0x000020, "Wrong size on LTweenBPLibrary_ArrayKillIfIsTweening");
static_assert(offsetof(LTweenBPLibrary_ArrayKillIfIsTweening, WorldContextObject) == 0x000000, "Member 'LTweenBPLibrary_ArrayKillIfIsTweening::WorldContextObject' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_ArrayKillIfIsTweening, inTweenerArray) == 0x000008, "Member 'LTweenBPLibrary_ArrayKillIfIsTweening::inTweenerArray' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_ArrayKillIfIsTweening, callComplete) == 0x000018, "Member 'LTweenBPLibrary_ArrayKillIfIsTweening::callComplete' has a wrong offset!");

// Function LTween.LTweenBPLibrary.ColorTo
// 0x0038 (0x0038 - 0x0000)
struct LTweenBPLibrary_ColorTo final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FColor& Value)>   setter;                                            // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FColor                                 StartValue;                                        // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FColor                                 endValue;                                          // 0x001C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Duration;                                          // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Delay;                                             // 0x0024(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ELTweenEase                                   Ease;                                              // 0x0028(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULTweener*                              ReturnValue;                                       // 0x0030(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LTweenBPLibrary_ColorTo) == 0x000008, "Wrong alignment on LTweenBPLibrary_ColorTo");
static_assert(sizeof(LTweenBPLibrary_ColorTo) == 0x000038, "Wrong size on LTweenBPLibrary_ColorTo");
static_assert(offsetof(LTweenBPLibrary_ColorTo, WorldContextObject) == 0x000000, "Member 'LTweenBPLibrary_ColorTo::WorldContextObject' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_ColorTo, setter) == 0x000008, "Member 'LTweenBPLibrary_ColorTo::setter' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_ColorTo, StartValue) == 0x000018, "Member 'LTweenBPLibrary_ColorTo::StartValue' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_ColorTo, endValue) == 0x00001C, "Member 'LTweenBPLibrary_ColorTo::endValue' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_ColorTo, Duration) == 0x000020, "Member 'LTweenBPLibrary_ColorTo::Duration' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_ColorTo, Delay) == 0x000024, "Member 'LTweenBPLibrary_ColorTo::Delay' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_ColorTo, Ease) == 0x000028, "Member 'LTweenBPLibrary_ColorTo::Ease' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_ColorTo, ReturnValue) == 0x000030, "Member 'LTweenBPLibrary_ColorTo::ReturnValue' has a wrong offset!");

// Function LTween.LTweenBPLibrary.CreateSequence
// 0x0010 (0x0010 - 0x0000)
struct LTweenBPLibrary_CreateSequence final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ULTweenerSequence*                      ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LTweenBPLibrary_CreateSequence) == 0x000008, "Wrong alignment on LTweenBPLibrary_CreateSequence");
static_assert(sizeof(LTweenBPLibrary_CreateSequence) == 0x000010, "Wrong size on LTweenBPLibrary_CreateSequence");
static_assert(offsetof(LTweenBPLibrary_CreateSequence, WorldContextObject) == 0x000000, "Member 'LTweenBPLibrary_CreateSequence::WorldContextObject' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_CreateSequence, ReturnValue) == 0x000008, "Member 'LTweenBPLibrary_CreateSequence::ReturnValue' has a wrong offset!");

// Function LTween.LTweenBPLibrary.DelayCall
// 0x0028 (0x0028 - 0x0000)
struct LTweenBPLibrary_DelayCall final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DelayTime;                                         // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void()>                             delayComplete;                                     // 0x000C(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          affectByGamePause;                                 // 0x001C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          affectByTimeDilation;                              // 0x001D(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1E[0x2];                                       // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class ULTweener*                              ReturnValue;                                       // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LTweenBPLibrary_DelayCall) == 0x000008, "Wrong alignment on LTweenBPLibrary_DelayCall");
static_assert(sizeof(LTweenBPLibrary_DelayCall) == 0x000028, "Wrong size on LTweenBPLibrary_DelayCall");
static_assert(offsetof(LTweenBPLibrary_DelayCall, WorldContextObject) == 0x000000, "Member 'LTweenBPLibrary_DelayCall::WorldContextObject' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_DelayCall, DelayTime) == 0x000008, "Member 'LTweenBPLibrary_DelayCall::DelayTime' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_DelayCall, delayComplete) == 0x00000C, "Member 'LTweenBPLibrary_DelayCall::delayComplete' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_DelayCall, affectByGamePause) == 0x00001C, "Member 'LTweenBPLibrary_DelayCall::affectByGamePause' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_DelayCall, affectByTimeDilation) == 0x00001D, "Member 'LTweenBPLibrary_DelayCall::affectByTimeDilation' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_DelayCall, ReturnValue) == 0x000020, "Member 'LTweenBPLibrary_DelayCall::ReturnValue' has a wrong offset!");

// Function LTween.LTweenBPLibrary.DelayFrameCall
// 0x0028 (0x0028 - 0x0000)
struct LTweenBPLibrary_DelayFrameCall final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         FrameCount;                                        // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void()>                             delayComplete;                                     // 0x000C(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          affectByGamePause;                                 // 0x001C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ULTweener*                              ReturnValue;                                       // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LTweenBPLibrary_DelayFrameCall) == 0x000008, "Wrong alignment on LTweenBPLibrary_DelayFrameCall");
static_assert(sizeof(LTweenBPLibrary_DelayFrameCall) == 0x000028, "Wrong size on LTweenBPLibrary_DelayFrameCall");
static_assert(offsetof(LTweenBPLibrary_DelayFrameCall, WorldContextObject) == 0x000000, "Member 'LTweenBPLibrary_DelayFrameCall::WorldContextObject' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_DelayFrameCall, FrameCount) == 0x000008, "Member 'LTweenBPLibrary_DelayFrameCall::FrameCount' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_DelayFrameCall, delayComplete) == 0x00000C, "Member 'LTweenBPLibrary_DelayFrameCall::delayComplete' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_DelayFrameCall, affectByGamePause) == 0x00001C, "Member 'LTweenBPLibrary_DelayFrameCall::affectByGamePause' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_DelayFrameCall, ReturnValue) == 0x000020, "Member 'LTweenBPLibrary_DelayFrameCall::ReturnValue' has a wrong offset!");

// Function LTween.LTweenBPLibrary.DoubleTo
// 0x0040 (0x0040 - 0x0000)
struct LTweenBPLibrary_DoubleTo final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(double Value)>                 setter;                                            // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        StartValue;                                        // 0x0018(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        endValue;                                          // 0x0020(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Duration;                                          // 0x0028(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Delay;                                             // 0x002C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ELTweenEase                                   Ease;                                              // 0x0030(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULTweener*                              ReturnValue;                                       // 0x0038(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LTweenBPLibrary_DoubleTo) == 0x000008, "Wrong alignment on LTweenBPLibrary_DoubleTo");
static_assert(sizeof(LTweenBPLibrary_DoubleTo) == 0x000040, "Wrong size on LTweenBPLibrary_DoubleTo");
static_assert(offsetof(LTweenBPLibrary_DoubleTo, WorldContextObject) == 0x000000, "Member 'LTweenBPLibrary_DoubleTo::WorldContextObject' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_DoubleTo, setter) == 0x000008, "Member 'LTweenBPLibrary_DoubleTo::setter' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_DoubleTo, StartValue) == 0x000018, "Member 'LTweenBPLibrary_DoubleTo::StartValue' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_DoubleTo, endValue) == 0x000020, "Member 'LTweenBPLibrary_DoubleTo::endValue' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_DoubleTo, Duration) == 0x000028, "Member 'LTweenBPLibrary_DoubleTo::Duration' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_DoubleTo, Delay) == 0x00002C, "Member 'LTweenBPLibrary_DoubleTo::Delay' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_DoubleTo, Ease) == 0x000030, "Member 'LTweenBPLibrary_DoubleTo::Ease' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_DoubleTo, ReturnValue) == 0x000038, "Member 'LTweenBPLibrary_DoubleTo::ReturnValue' has a wrong offset!");

// Function LTween.LTweenBPLibrary.FloatTo
// 0x0038 (0x0038 - 0x0000)
struct LTweenBPLibrary_FloatTo final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(float Value)>                  setter;                                            // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StartValue;                                        // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         endValue;                                          // 0x001C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Duration;                                          // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Delay;                                             // 0x0024(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ELTweenEase                                   Ease;                                              // 0x0028(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULTweener*                              ReturnValue;                                       // 0x0030(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LTweenBPLibrary_FloatTo) == 0x000008, "Wrong alignment on LTweenBPLibrary_FloatTo");
static_assert(sizeof(LTweenBPLibrary_FloatTo) == 0x000038, "Wrong size on LTweenBPLibrary_FloatTo");
static_assert(offsetof(LTweenBPLibrary_FloatTo, WorldContextObject) == 0x000000, "Member 'LTweenBPLibrary_FloatTo::WorldContextObject' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_FloatTo, setter) == 0x000008, "Member 'LTweenBPLibrary_FloatTo::setter' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_FloatTo, StartValue) == 0x000018, "Member 'LTweenBPLibrary_FloatTo::StartValue' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_FloatTo, endValue) == 0x00001C, "Member 'LTweenBPLibrary_FloatTo::endValue' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_FloatTo, Duration) == 0x000020, "Member 'LTweenBPLibrary_FloatTo::Duration' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_FloatTo, Delay) == 0x000024, "Member 'LTweenBPLibrary_FloatTo::Delay' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_FloatTo, Ease) == 0x000028, "Member 'LTweenBPLibrary_FloatTo::Ease' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_FloatTo, ReturnValue) == 0x000030, "Member 'LTweenBPLibrary_FloatTo::ReturnValue' has a wrong offset!");

// Function LTween.LTweenBPLibrary.IntTo
// 0x0038 (0x0038 - 0x0000)
struct LTweenBPLibrary_IntTo final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(int32 Value)>                  setter;                                            // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         StartValue;                                        // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         endValue;                                          // 0x001C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Duration;                                          // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Delay;                                             // 0x0024(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ELTweenEase                                   Ease;                                              // 0x0028(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULTweener*                              ReturnValue;                                       // 0x0030(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LTweenBPLibrary_IntTo) == 0x000008, "Wrong alignment on LTweenBPLibrary_IntTo");
static_assert(sizeof(LTweenBPLibrary_IntTo) == 0x000038, "Wrong size on LTweenBPLibrary_IntTo");
static_assert(offsetof(LTweenBPLibrary_IntTo, WorldContextObject) == 0x000000, "Member 'LTweenBPLibrary_IntTo::WorldContextObject' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_IntTo, setter) == 0x000008, "Member 'LTweenBPLibrary_IntTo::setter' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_IntTo, StartValue) == 0x000018, "Member 'LTweenBPLibrary_IntTo::StartValue' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_IntTo, endValue) == 0x00001C, "Member 'LTweenBPLibrary_IntTo::endValue' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_IntTo, Duration) == 0x000020, "Member 'LTweenBPLibrary_IntTo::Duration' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_IntTo, Delay) == 0x000024, "Member 'LTweenBPLibrary_IntTo::Delay' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_IntTo, Ease) == 0x000028, "Member 'LTweenBPLibrary_IntTo::Ease' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_IntTo, ReturnValue) == 0x000030, "Member 'LTweenBPLibrary_IntTo::ReturnValue' has a wrong offset!");

// Function LTween.LTweenBPLibrary.IsTweening
// 0x0018 (0x0018 - 0x0000)
struct LTweenBPLibrary_IsTweening final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ULTweener*                              inTweener;                                         // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(LTweenBPLibrary_IsTweening) == 0x000008, "Wrong alignment on LTweenBPLibrary_IsTweening");
static_assert(sizeof(LTweenBPLibrary_IsTweening) == 0x000018, "Wrong size on LTweenBPLibrary_IsTweening");
static_assert(offsetof(LTweenBPLibrary_IsTweening, WorldContextObject) == 0x000000, "Member 'LTweenBPLibrary_IsTweening::WorldContextObject' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_IsTweening, inTweener) == 0x000008, "Member 'LTweenBPLibrary_IsTweening::inTweener' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_IsTweening, ReturnValue) == 0x000010, "Member 'LTweenBPLibrary_IsTweening::ReturnValue' has a wrong offset!");

// Function LTween.LTweenBPLibrary.KillIfIsTweening
// 0x0018 (0x0018 - 0x0000)
struct LTweenBPLibrary_KillIfIsTweening final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ULTweener*                              inTweener;                                         // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          callComplete;                                      // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(LTweenBPLibrary_KillIfIsTweening) == 0x000008, "Wrong alignment on LTweenBPLibrary_KillIfIsTweening");
static_assert(sizeof(LTweenBPLibrary_KillIfIsTweening) == 0x000018, "Wrong size on LTweenBPLibrary_KillIfIsTweening");
static_assert(offsetof(LTweenBPLibrary_KillIfIsTweening, WorldContextObject) == 0x000000, "Member 'LTweenBPLibrary_KillIfIsTweening::WorldContextObject' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_KillIfIsTweening, inTweener) == 0x000008, "Member 'LTweenBPLibrary_KillIfIsTweening::inTweener' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_KillIfIsTweening, callComplete) == 0x000010, "Member 'LTweenBPLibrary_KillIfIsTweening::callComplete' has a wrong offset!");

// Function LTween.LTweenBPLibrary.LinearColorTo
// 0x0050 (0x0050 - 0x0000)
struct LTweenBPLibrary_LinearColorTo final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FLinearColor& Value)> setter;                                        // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           StartValue;                                        // 0x0018(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           endValue;                                          // 0x0028(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Duration;                                          // 0x0038(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Delay;                                             // 0x003C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ELTweenEase                                   Ease;                                              // 0x0040(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULTweener*                              ReturnValue;                                       // 0x0048(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LTweenBPLibrary_LinearColorTo) == 0x000008, "Wrong alignment on LTweenBPLibrary_LinearColorTo");
static_assert(sizeof(LTweenBPLibrary_LinearColorTo) == 0x000050, "Wrong size on LTweenBPLibrary_LinearColorTo");
static_assert(offsetof(LTweenBPLibrary_LinearColorTo, WorldContextObject) == 0x000000, "Member 'LTweenBPLibrary_LinearColorTo::WorldContextObject' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_LinearColorTo, setter) == 0x000008, "Member 'LTweenBPLibrary_LinearColorTo::setter' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_LinearColorTo, StartValue) == 0x000018, "Member 'LTweenBPLibrary_LinearColorTo::StartValue' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_LinearColorTo, endValue) == 0x000028, "Member 'LTweenBPLibrary_LinearColorTo::endValue' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_LinearColorTo, Duration) == 0x000038, "Member 'LTweenBPLibrary_LinearColorTo::Duration' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_LinearColorTo, Delay) == 0x00003C, "Member 'LTweenBPLibrary_LinearColorTo::Delay' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_LinearColorTo, Ease) == 0x000040, "Member 'LTweenBPLibrary_LinearColorTo::Ease' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_LinearColorTo, ReturnValue) == 0x000048, "Member 'LTweenBPLibrary_LinearColorTo::ReturnValue' has a wrong offset!");

// Function LTween.LTweenBPLibrary.LocalPositionTo
// 0x0038 (0x0038 - 0x0000)
struct LTweenBPLibrary_LocalPositionTo final
{
public:
	class USceneComponent*                        Target;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                endValue;                                          // 0x0008(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Duration;                                          // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Delay;                                             // 0x0024(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ELTweenEase                                   Ease;                                              // 0x0028(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULTweener*                              ReturnValue;                                       // 0x0030(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LTweenBPLibrary_LocalPositionTo) == 0x000008, "Wrong alignment on LTweenBPLibrary_LocalPositionTo");
static_assert(sizeof(LTweenBPLibrary_LocalPositionTo) == 0x000038, "Wrong size on LTweenBPLibrary_LocalPositionTo");
static_assert(offsetof(LTweenBPLibrary_LocalPositionTo, Target) == 0x000000, "Member 'LTweenBPLibrary_LocalPositionTo::Target' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_LocalPositionTo, endValue) == 0x000008, "Member 'LTweenBPLibrary_LocalPositionTo::endValue' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_LocalPositionTo, Duration) == 0x000020, "Member 'LTweenBPLibrary_LocalPositionTo::Duration' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_LocalPositionTo, Delay) == 0x000024, "Member 'LTweenBPLibrary_LocalPositionTo::Delay' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_LocalPositionTo, Ease) == 0x000028, "Member 'LTweenBPLibrary_LocalPositionTo::Ease' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_LocalPositionTo, ReturnValue) == 0x000030, "Member 'LTweenBPLibrary_LocalPositionTo::ReturnValue' has a wrong offset!");

// Function LTween.LTweenBPLibrary.LocalPositionTo_Sweep
// 0x0130 (0x0130 - 0x0000)
struct LTweenBPLibrary_LocalPositionTo_Sweep final
{
public:
	class USceneComponent*                        Target;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                endValue;                                          // 0x0008(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FHitResult                             SweepHitResult;                                    // 0x0020(0x00F8)(Parm, OutParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	bool                                          sweep;                                             // 0x0118(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Teleport;                                          // 0x0119(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11A[0x2];                                      // 0x011A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Duration;                                          // 0x011C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Delay;                                             // 0x0120(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ELTweenEase                                   Ease;                                              // 0x0124(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_125[0x3];                                      // 0x0125(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ULTweener*                              ReturnValue;                                       // 0x0128(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LTweenBPLibrary_LocalPositionTo_Sweep) == 0x000008, "Wrong alignment on LTweenBPLibrary_LocalPositionTo_Sweep");
static_assert(sizeof(LTweenBPLibrary_LocalPositionTo_Sweep) == 0x000130, "Wrong size on LTweenBPLibrary_LocalPositionTo_Sweep");
static_assert(offsetof(LTweenBPLibrary_LocalPositionTo_Sweep, Target) == 0x000000, "Member 'LTweenBPLibrary_LocalPositionTo_Sweep::Target' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_LocalPositionTo_Sweep, endValue) == 0x000008, "Member 'LTweenBPLibrary_LocalPositionTo_Sweep::endValue' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_LocalPositionTo_Sweep, SweepHitResult) == 0x000020, "Member 'LTweenBPLibrary_LocalPositionTo_Sweep::SweepHitResult' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_LocalPositionTo_Sweep, sweep) == 0x000118, "Member 'LTweenBPLibrary_LocalPositionTo_Sweep::sweep' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_LocalPositionTo_Sweep, Teleport) == 0x000119, "Member 'LTweenBPLibrary_LocalPositionTo_Sweep::Teleport' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_LocalPositionTo_Sweep, Duration) == 0x00011C, "Member 'LTweenBPLibrary_LocalPositionTo_Sweep::Duration' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_LocalPositionTo_Sweep, Delay) == 0x000120, "Member 'LTweenBPLibrary_LocalPositionTo_Sweep::Delay' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_LocalPositionTo_Sweep, Ease) == 0x000124, "Member 'LTweenBPLibrary_LocalPositionTo_Sweep::Ease' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_LocalPositionTo_Sweep, ReturnValue) == 0x000128, "Member 'LTweenBPLibrary_LocalPositionTo_Sweep::ReturnValue' has a wrong offset!");

// Function LTween.LTweenBPLibrary.LocalPositionXTo
// 0x0028 (0x0028 - 0x0000)
struct LTweenBPLibrary_LocalPositionXTo final
{
public:
	class USceneComponent*                        Target;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        endValue;                                          // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Duration;                                          // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Delay;                                             // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ELTweenEase                                   Ease;                                              // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULTweener*                              ReturnValue;                                       // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LTweenBPLibrary_LocalPositionXTo) == 0x000008, "Wrong alignment on LTweenBPLibrary_LocalPositionXTo");
static_assert(sizeof(LTweenBPLibrary_LocalPositionXTo) == 0x000028, "Wrong size on LTweenBPLibrary_LocalPositionXTo");
static_assert(offsetof(LTweenBPLibrary_LocalPositionXTo, Target) == 0x000000, "Member 'LTweenBPLibrary_LocalPositionXTo::Target' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_LocalPositionXTo, endValue) == 0x000008, "Member 'LTweenBPLibrary_LocalPositionXTo::endValue' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_LocalPositionXTo, Duration) == 0x000010, "Member 'LTweenBPLibrary_LocalPositionXTo::Duration' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_LocalPositionXTo, Delay) == 0x000014, "Member 'LTweenBPLibrary_LocalPositionXTo::Delay' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_LocalPositionXTo, Ease) == 0x000018, "Member 'LTweenBPLibrary_LocalPositionXTo::Ease' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_LocalPositionXTo, ReturnValue) == 0x000020, "Member 'LTweenBPLibrary_LocalPositionXTo::ReturnValue' has a wrong offset!");

// Function LTween.LTweenBPLibrary.LocalPositionXTo_Sweep
// 0x0120 (0x0120 - 0x0000)
struct LTweenBPLibrary_LocalPositionXTo_Sweep final
{
public:
	class USceneComponent*                        Target;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        endValue;                                          // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FHitResult                             SweepHitResult;                                    // 0x0010(0x00F8)(Parm, OutParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	bool                                          sweep;                                             // 0x0108(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Teleport;                                          // 0x0109(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_10A[0x2];                                      // 0x010A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Duration;                                          // 0x010C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Delay;                                             // 0x0110(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ELTweenEase                                   Ease;                                              // 0x0114(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_115[0x3];                                      // 0x0115(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ULTweener*                              ReturnValue;                                       // 0x0118(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LTweenBPLibrary_LocalPositionXTo_Sweep) == 0x000008, "Wrong alignment on LTweenBPLibrary_LocalPositionXTo_Sweep");
static_assert(sizeof(LTweenBPLibrary_LocalPositionXTo_Sweep) == 0x000120, "Wrong size on LTweenBPLibrary_LocalPositionXTo_Sweep");
static_assert(offsetof(LTweenBPLibrary_LocalPositionXTo_Sweep, Target) == 0x000000, "Member 'LTweenBPLibrary_LocalPositionXTo_Sweep::Target' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_LocalPositionXTo_Sweep, endValue) == 0x000008, "Member 'LTweenBPLibrary_LocalPositionXTo_Sweep::endValue' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_LocalPositionXTo_Sweep, SweepHitResult) == 0x000010, "Member 'LTweenBPLibrary_LocalPositionXTo_Sweep::SweepHitResult' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_LocalPositionXTo_Sweep, sweep) == 0x000108, "Member 'LTweenBPLibrary_LocalPositionXTo_Sweep::sweep' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_LocalPositionXTo_Sweep, Teleport) == 0x000109, "Member 'LTweenBPLibrary_LocalPositionXTo_Sweep::Teleport' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_LocalPositionXTo_Sweep, Duration) == 0x00010C, "Member 'LTweenBPLibrary_LocalPositionXTo_Sweep::Duration' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_LocalPositionXTo_Sweep, Delay) == 0x000110, "Member 'LTweenBPLibrary_LocalPositionXTo_Sweep::Delay' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_LocalPositionXTo_Sweep, Ease) == 0x000114, "Member 'LTweenBPLibrary_LocalPositionXTo_Sweep::Ease' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_LocalPositionXTo_Sweep, ReturnValue) == 0x000118, "Member 'LTweenBPLibrary_LocalPositionXTo_Sweep::ReturnValue' has a wrong offset!");

// Function LTween.LTweenBPLibrary.LocalPositionYTo
// 0x0028 (0x0028 - 0x0000)
struct LTweenBPLibrary_LocalPositionYTo final
{
public:
	class USceneComponent*                        Target;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        endValue;                                          // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Duration;                                          // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Delay;                                             // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ELTweenEase                                   Ease;                                              // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULTweener*                              ReturnValue;                                       // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LTweenBPLibrary_LocalPositionYTo) == 0x000008, "Wrong alignment on LTweenBPLibrary_LocalPositionYTo");
static_assert(sizeof(LTweenBPLibrary_LocalPositionYTo) == 0x000028, "Wrong size on LTweenBPLibrary_LocalPositionYTo");
static_assert(offsetof(LTweenBPLibrary_LocalPositionYTo, Target) == 0x000000, "Member 'LTweenBPLibrary_LocalPositionYTo::Target' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_LocalPositionYTo, endValue) == 0x000008, "Member 'LTweenBPLibrary_LocalPositionYTo::endValue' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_LocalPositionYTo, Duration) == 0x000010, "Member 'LTweenBPLibrary_LocalPositionYTo::Duration' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_LocalPositionYTo, Delay) == 0x000014, "Member 'LTweenBPLibrary_LocalPositionYTo::Delay' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_LocalPositionYTo, Ease) == 0x000018, "Member 'LTweenBPLibrary_LocalPositionYTo::Ease' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_LocalPositionYTo, ReturnValue) == 0x000020, "Member 'LTweenBPLibrary_LocalPositionYTo::ReturnValue' has a wrong offset!");

// Function LTween.LTweenBPLibrary.LocalPositionYTo_Sweep
// 0x0120 (0x0120 - 0x0000)
struct LTweenBPLibrary_LocalPositionYTo_Sweep final
{
public:
	class USceneComponent*                        Target;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        endValue;                                          // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FHitResult                             SweepHitResult;                                    // 0x0010(0x00F8)(Parm, OutParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	bool                                          sweep;                                             // 0x0108(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Teleport;                                          // 0x0109(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_10A[0x2];                                      // 0x010A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Duration;                                          // 0x010C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Delay;                                             // 0x0110(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ELTweenEase                                   Ease;                                              // 0x0114(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_115[0x3];                                      // 0x0115(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ULTweener*                              ReturnValue;                                       // 0x0118(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LTweenBPLibrary_LocalPositionYTo_Sweep) == 0x000008, "Wrong alignment on LTweenBPLibrary_LocalPositionYTo_Sweep");
static_assert(sizeof(LTweenBPLibrary_LocalPositionYTo_Sweep) == 0x000120, "Wrong size on LTweenBPLibrary_LocalPositionYTo_Sweep");
static_assert(offsetof(LTweenBPLibrary_LocalPositionYTo_Sweep, Target) == 0x000000, "Member 'LTweenBPLibrary_LocalPositionYTo_Sweep::Target' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_LocalPositionYTo_Sweep, endValue) == 0x000008, "Member 'LTweenBPLibrary_LocalPositionYTo_Sweep::endValue' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_LocalPositionYTo_Sweep, SweepHitResult) == 0x000010, "Member 'LTweenBPLibrary_LocalPositionYTo_Sweep::SweepHitResult' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_LocalPositionYTo_Sweep, sweep) == 0x000108, "Member 'LTweenBPLibrary_LocalPositionYTo_Sweep::sweep' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_LocalPositionYTo_Sweep, Teleport) == 0x000109, "Member 'LTweenBPLibrary_LocalPositionYTo_Sweep::Teleport' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_LocalPositionYTo_Sweep, Duration) == 0x00010C, "Member 'LTweenBPLibrary_LocalPositionYTo_Sweep::Duration' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_LocalPositionYTo_Sweep, Delay) == 0x000110, "Member 'LTweenBPLibrary_LocalPositionYTo_Sweep::Delay' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_LocalPositionYTo_Sweep, Ease) == 0x000114, "Member 'LTweenBPLibrary_LocalPositionYTo_Sweep::Ease' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_LocalPositionYTo_Sweep, ReturnValue) == 0x000118, "Member 'LTweenBPLibrary_LocalPositionYTo_Sweep::ReturnValue' has a wrong offset!");

// Function LTween.LTweenBPLibrary.LocalPositionZTo
// 0x0028 (0x0028 - 0x0000)
struct LTweenBPLibrary_LocalPositionZTo final
{
public:
	class USceneComponent*                        Target;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        endValue;                                          // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Duration;                                          // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Delay;                                             // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ELTweenEase                                   Ease;                                              // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULTweener*                              ReturnValue;                                       // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LTweenBPLibrary_LocalPositionZTo) == 0x000008, "Wrong alignment on LTweenBPLibrary_LocalPositionZTo");
static_assert(sizeof(LTweenBPLibrary_LocalPositionZTo) == 0x000028, "Wrong size on LTweenBPLibrary_LocalPositionZTo");
static_assert(offsetof(LTweenBPLibrary_LocalPositionZTo, Target) == 0x000000, "Member 'LTweenBPLibrary_LocalPositionZTo::Target' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_LocalPositionZTo, endValue) == 0x000008, "Member 'LTweenBPLibrary_LocalPositionZTo::endValue' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_LocalPositionZTo, Duration) == 0x000010, "Member 'LTweenBPLibrary_LocalPositionZTo::Duration' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_LocalPositionZTo, Delay) == 0x000014, "Member 'LTweenBPLibrary_LocalPositionZTo::Delay' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_LocalPositionZTo, Ease) == 0x000018, "Member 'LTweenBPLibrary_LocalPositionZTo::Ease' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_LocalPositionZTo, ReturnValue) == 0x000020, "Member 'LTweenBPLibrary_LocalPositionZTo::ReturnValue' has a wrong offset!");

// Function LTween.LTweenBPLibrary.LocalPositionZTo_Sweep
// 0x0120 (0x0120 - 0x0000)
struct LTweenBPLibrary_LocalPositionZTo_Sweep final
{
public:
	class USceneComponent*                        Target;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        endValue;                                          // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FHitResult                             SweepHitResult;                                    // 0x0010(0x00F8)(Parm, OutParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	bool                                          sweep;                                             // 0x0108(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Teleport;                                          // 0x0109(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_10A[0x2];                                      // 0x010A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Duration;                                          // 0x010C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Delay;                                             // 0x0110(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ELTweenEase                                   Ease;                                              // 0x0114(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_115[0x3];                                      // 0x0115(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ULTweener*                              ReturnValue;                                       // 0x0118(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LTweenBPLibrary_LocalPositionZTo_Sweep) == 0x000008, "Wrong alignment on LTweenBPLibrary_LocalPositionZTo_Sweep");
static_assert(sizeof(LTweenBPLibrary_LocalPositionZTo_Sweep) == 0x000120, "Wrong size on LTweenBPLibrary_LocalPositionZTo_Sweep");
static_assert(offsetof(LTweenBPLibrary_LocalPositionZTo_Sweep, Target) == 0x000000, "Member 'LTweenBPLibrary_LocalPositionZTo_Sweep::Target' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_LocalPositionZTo_Sweep, endValue) == 0x000008, "Member 'LTweenBPLibrary_LocalPositionZTo_Sweep::endValue' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_LocalPositionZTo_Sweep, SweepHitResult) == 0x000010, "Member 'LTweenBPLibrary_LocalPositionZTo_Sweep::SweepHitResult' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_LocalPositionZTo_Sweep, sweep) == 0x000108, "Member 'LTweenBPLibrary_LocalPositionZTo_Sweep::sweep' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_LocalPositionZTo_Sweep, Teleport) == 0x000109, "Member 'LTweenBPLibrary_LocalPositionZTo_Sweep::Teleport' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_LocalPositionZTo_Sweep, Duration) == 0x00010C, "Member 'LTweenBPLibrary_LocalPositionZTo_Sweep::Duration' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_LocalPositionZTo_Sweep, Delay) == 0x000110, "Member 'LTweenBPLibrary_LocalPositionZTo_Sweep::Delay' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_LocalPositionZTo_Sweep, Ease) == 0x000114, "Member 'LTweenBPLibrary_LocalPositionZTo_Sweep::Ease' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_LocalPositionZTo_Sweep, ReturnValue) == 0x000118, "Member 'LTweenBPLibrary_LocalPositionZTo_Sweep::ReturnValue' has a wrong offset!");

// Function LTween.LTweenBPLibrary.LocalRotateEulerAngleTo
// 0x0038 (0x0038 - 0x0000)
struct LTweenBPLibrary_LocalRotateEulerAngleTo final
{
public:
	class USceneComponent*                        Target;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                eulerAngle;                                        // 0x0008(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Duration;                                          // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Delay;                                             // 0x0024(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ELTweenEase                                   Ease;                                              // 0x0028(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULTweener*                              ReturnValue;                                       // 0x0030(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LTweenBPLibrary_LocalRotateEulerAngleTo) == 0x000008, "Wrong alignment on LTweenBPLibrary_LocalRotateEulerAngleTo");
static_assert(sizeof(LTweenBPLibrary_LocalRotateEulerAngleTo) == 0x000038, "Wrong size on LTweenBPLibrary_LocalRotateEulerAngleTo");
static_assert(offsetof(LTweenBPLibrary_LocalRotateEulerAngleTo, Target) == 0x000000, "Member 'LTweenBPLibrary_LocalRotateEulerAngleTo::Target' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_LocalRotateEulerAngleTo, eulerAngle) == 0x000008, "Member 'LTweenBPLibrary_LocalRotateEulerAngleTo::eulerAngle' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_LocalRotateEulerAngleTo, Duration) == 0x000020, "Member 'LTweenBPLibrary_LocalRotateEulerAngleTo::Duration' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_LocalRotateEulerAngleTo, Delay) == 0x000024, "Member 'LTweenBPLibrary_LocalRotateEulerAngleTo::Delay' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_LocalRotateEulerAngleTo, Ease) == 0x000028, "Member 'LTweenBPLibrary_LocalRotateEulerAngleTo::Ease' has a wrong offset!");
