#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MantaRay_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function MantaRay_AnimBP.MantaRay_AnimBP_C.ExecuteUbergraph_MantaRay_AnimBP
// 0x0004 (0x0004 - 0x0000)
struct MantaRay_AnimBP_C_ExecuteUbergraph_MantaRay_AnimBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MantaRay_AnimBP_C_ExecuteUbergraph_MantaRay_AnimBP) == 0x000004, "Wrong alignment on MantaRay_AnimBP_C_ExecuteUbergraph_MantaRay_AnimBP");
static_assert(sizeof(MantaRay_AnimBP_C_ExecuteUbergraph_MantaRay_AnimBP) == 0x000004, "Wrong size on MantaRay_AnimBP_C_ExecuteUbergraph_MantaRay_AnimBP");
static_assert(offsetof(MantaRay_AnimBP_C_ExecuteUbergraph_MantaRay_AnimBP, EntryPoint) == 0x000000, "Member 'MantaRay_AnimBP_C_ExecuteUbergraph_MantaRay_AnimBP::EntryPoint' has a wrong offset!");

// Function MantaRay_AnimBP.MantaRay_AnimBP_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct MantaRay_AnimBP_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(MantaRay_AnimBP_C_AnimGraph) == 0x000008, "Wrong alignment on MantaRay_AnimBP_C_AnimGraph");
static_assert(sizeof(MantaRay_AnimBP_C_AnimGraph) == 0x000010, "Wrong size on MantaRay_AnimBP_C_AnimGraph");
static_assert(offsetof(MantaRay_AnimBP_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'MantaRay_AnimBP_C_AnimGraph::AnimGraph_0' has a wrong offset!");

}

