#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MantaRay_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "MantaRay_AnimBP_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass MantaRay_AnimBP.MantaRay_AnimBP_C
// 0x0A20 (0x0D90 - 0x0370)
class UMantaRay_AnimBP_C final : public UAnimInstance
{
public:
	uint8                                         Pad_368[0x8];                                      // 0x0368(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0370(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct MantaRay_AnimBP::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;              // 0x0378(0x0010)(HasGetValueTypeHash)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0388(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0390(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0398(0x0020)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer;                    // 0x03B8(0x0070)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x0428(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_6;                        // 0x0448(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_5;                        // 0x0570(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_4;                        // 0x0698(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_3;                        // 0x07C0(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_2;                        // 0x08E8(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x0A10(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x0B38(0x0128)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0C60(0x0020)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x0C80(0x0048)()
	double                                        Animation_Blendspace;                              // 0x0CC8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Swim_Anim_Play_Rate;                               // 0x0CD0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        StartPosition;                                     // 0x0CD8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               Tail_0_Rotation;                                   // 0x0CE0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FRotator                               Tail_1_Rotation;                                   // 0x0CF8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FRotator                               Tail_2_Rotation;                                   // 0x0D10(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FRotator                               Tail_3_Rotation;                                   // 0x0D28(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FRotator                               Tail_4_Rotation;                                   // 0x0D40(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FRotator                               Tail_5_Rotation;                                   // 0x0D58(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FRotator                               Tail_6_Rotation;                                   // 0x0D70(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_MantaRay_AnimBP(int32 EntryPoint);
	void AnimGraph(struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MantaRay_AnimBP_C">();
	}
	static class UMantaRay_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMantaRay_AnimBP_C>();
	}
};
static_assert(alignof(UMantaRay_AnimBP_C) == 0x000010, "Wrong alignment on UMantaRay_AnimBP_C");
static_assert(sizeof(UMantaRay_AnimBP_C) == 0x000D90, "Wrong size on UMantaRay_AnimBP_C");
static_assert(offsetof(UMantaRay_AnimBP_C, UberGraphFrame) == 0x000370, "Member 'UMantaRay_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMantaRay_AnimBP_C, __AnimBlueprintMutables) == 0x000378, "Member 'UMantaRay_AnimBP_C::__AnimBlueprintMutables' has a wrong offset!");
static_assert(offsetof(UMantaRay_AnimBP_C, AnimBlueprintExtension_PropertyAccess) == 0x000388, "Member 'UMantaRay_AnimBP_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UMantaRay_AnimBP_C, AnimBlueprintExtension_Base) == 0x000390, "Member 'UMantaRay_AnimBP_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UMantaRay_AnimBP_C, AnimGraphNode_Root) == 0x000398, "Member 'UMantaRay_AnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UMantaRay_AnimBP_C, AnimGraphNode_BlendSpacePlayer) == 0x0003B8, "Member 'UMantaRay_AnimBP_C::AnimGraphNode_BlendSpacePlayer' has a wrong offset!");
static_assert(offsetof(UMantaRay_AnimBP_C, AnimGraphNode_LocalToComponentSpace) == 0x000428, "Member 'UMantaRay_AnimBP_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UMantaRay_AnimBP_C, AnimGraphNode_ModifyBone_6) == 0x000448, "Member 'UMantaRay_AnimBP_C::AnimGraphNode_ModifyBone_6' has a wrong offset!");
static_assert(offsetof(UMantaRay_AnimBP_C, AnimGraphNode_ModifyBone_5) == 0x000570, "Member 'UMantaRay_AnimBP_C::AnimGraphNode_ModifyBone_5' has a wrong offset!");
static_assert(offsetof(UMantaRay_AnimBP_C, AnimGraphNode_ModifyBone_4) == 0x000698, "Member 'UMantaRay_AnimBP_C::AnimGraphNode_ModifyBone_4' has a wrong offset!");
static_assert(offsetof(UMantaRay_AnimBP_C, AnimGraphNode_ModifyBone_3) == 0x0007C0, "Member 'UMantaRay_AnimBP_C::AnimGraphNode_ModifyBone_3' has a wrong offset!");
static_assert(offsetof(UMantaRay_AnimBP_C, AnimGraphNode_ModifyBone_2) == 0x0008E8, "Member 'UMantaRay_AnimBP_C::AnimGraphNode_ModifyBone_2' has a wrong offset!");
static_assert(offsetof(UMantaRay_AnimBP_C, AnimGraphNode_ModifyBone_1) == 0x000A10, "Member 'UMantaRay_AnimBP_C::AnimGraphNode_ModifyBone_1' has a wrong offset!");
static_assert(offsetof(UMantaRay_AnimBP_C, AnimGraphNode_ModifyBone) == 0x000B38, "Member 'UMantaRay_AnimBP_C::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(UMantaRay_AnimBP_C, AnimGraphNode_ComponentToLocalSpace) == 0x000C60, "Member 'UMantaRay_AnimBP_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UMantaRay_AnimBP_C, AnimGraphNode_Slot) == 0x000C80, "Member 'UMantaRay_AnimBP_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(UMantaRay_AnimBP_C, Animation_Blendspace) == 0x000CC8, "Member 'UMantaRay_AnimBP_C::Animation_Blendspace' has a wrong offset!");
static_assert(offsetof(UMantaRay_AnimBP_C, Swim_Anim_Play_Rate) == 0x000CD0, "Member 'UMantaRay_AnimBP_C::Swim_Anim_Play_Rate' has a wrong offset!");
static_assert(offsetof(UMantaRay_AnimBP_C, StartPosition) == 0x000CD8, "Member 'UMantaRay_AnimBP_C::StartPosition' has a wrong offset!");
static_assert(offsetof(UMantaRay_AnimBP_C, Tail_0_Rotation) == 0x000CE0, "Member 'UMantaRay_AnimBP_C::Tail_0_Rotation' has a wrong offset!");
static_assert(offsetof(UMantaRay_AnimBP_C, Tail_1_Rotation) == 0x000CF8, "Member 'UMantaRay_AnimBP_C::Tail_1_Rotation' has a wrong offset!");
static_assert(offsetof(UMantaRay_AnimBP_C, Tail_2_Rotation) == 0x000D10, "Member 'UMantaRay_AnimBP_C::Tail_2_Rotation' has a wrong offset!");
static_assert(offsetof(UMantaRay_AnimBP_C, Tail_3_Rotation) == 0x000D28, "Member 'UMantaRay_AnimBP_C::Tail_3_Rotation' has a wrong offset!");
static_assert(offsetof(UMantaRay_AnimBP_C, Tail_4_Rotation) == 0x000D40, "Member 'UMantaRay_AnimBP_C::Tail_4_Rotation' has a wrong offset!");
static_assert(offsetof(UMantaRay_AnimBP_C, Tail_5_Rotation) == 0x000D58, "Member 'UMantaRay_AnimBP_C::Tail_5_Rotation' has a wrong offset!");
static_assert(offsetof(UMantaRay_AnimBP_C, Tail_6_Rotation) == 0x000D70, "Member 'UMantaRay_AnimBP_C::Tail_6_Rotation' has a wrong offset!");

}

