#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MantleComponent

#include "Basic.hpp"

#include "ALSV4_CPP_structs.hpp"
#include "ALSV4_CPP_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass MantleComponent.MantleComponent_C
// 0x0180 (0x0470 - 0x02F0)
class UMantleComponent_C final : public UALSMantleComponent
{
public:
	struct FALSMantleAsset                        Mantle_2m_Default;                                 // 0x02F0(0x0040)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FALSMantleAsset                        Mantle_1m_Default;                                 // 0x0330(0x0040)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FALSMantleAsset                        Mantle_1m_LH;                                      // 0x0370(0x0040)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FALSMantleAsset                        Mantle_1m_2H;                                      // 0x03B0(0x0040)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FALSMantleAsset                        Mantle_1m_RH;                                      // 0x03F0(0x0040)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FALSMantleAsset                        Mantle_1m_Box;                                     // 0x0430(0x0040)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)

public:
	struct FALSMantleAsset GetMantleAsset(EALSMantleType MantleType, EALSOverlayState CurrentOverlayState);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MantleComponent_C">();
	}
	static class UMantleComponent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMantleComponent_C>();
	}
};
static_assert(alignof(UMantleComponent_C) == 0x000010, "Wrong alignment on UMantleComponent_C");
static_assert(sizeof(UMantleComponent_C) == 0x000470, "Wrong size on UMantleComponent_C");
static_assert(offsetof(UMantleComponent_C, Mantle_2m_Default) == 0x0002F0, "Member 'UMantleComponent_C::Mantle_2m_Default' has a wrong offset!");
static_assert(offsetof(UMantleComponent_C, Mantle_1m_Default) == 0x000330, "Member 'UMantleComponent_C::Mantle_1m_Default' has a wrong offset!");
static_assert(offsetof(UMantleComponent_C, Mantle_1m_LH) == 0x000370, "Member 'UMantleComponent_C::Mantle_1m_LH' has a wrong offset!");
static_assert(offsetof(UMantleComponent_C, Mantle_1m_2H) == 0x0003B0, "Member 'UMantleComponent_C::Mantle_1m_2H' has a wrong offset!");
static_assert(offsetof(UMantleComponent_C, Mantle_1m_RH) == 0x0003F0, "Member 'UMantleComponent_C::Mantle_1m_RH' has a wrong offset!");
static_assert(offsetof(UMantleComponent_C, Mantle_1m_Box) == 0x000430, "Member 'UMantleComponent_C::Mantle_1m_Box' has a wrong offset!");

}

