#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NPC_Base

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_jRPG_NPC_Dialog_classes.hpp"
#include "InputCore_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass NPC_Base.NPC_Base_C
// 0x0020 (0x0B90 - 0x0B70)
class ANPC_Base_C final : public ABP_jRPG_NPC_Dialog_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_NPC_Base_C;                         // 0x0B70(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBP_DialogSystem_C*                     DialogSystem;                                      // 0x0B78(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        BaseTurnRate;                                      // 0x0B80(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        BaseLookUpRate;                                    // 0x0B88(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Dialog(class FName EventId, int32 SwitchID, const class FText& DialogText);
	void ExecuteUbergraph_NPC_Base(int32 EntryPoint);
	void InpActEvt_ResetVR_K2Node_InputActionEvent_0(const struct FKey& Key);
	void InpTchEvt_Pressed(ETouchIndex FingerIndex, const struct FVector& Location);
	void InpTchEvt_Released(ETouchIndex FingerIndex, const struct FVector& Location);
	void Talk();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"NPC_Base_C">();
	}
	static class ANPC_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ANPC_Base_C>();
	}
};
static_assert(alignof(ANPC_Base_C) == 0x000010, "Wrong alignment on ANPC_Base_C");
static_assert(sizeof(ANPC_Base_C) == 0x000B90, "Wrong size on ANPC_Base_C");
static_assert(offsetof(ANPC_Base_C, UberGraphFrame_NPC_Base_C) == 0x000B70, "Member 'ANPC_Base_C::UberGraphFrame_NPC_Base_C' has a wrong offset!");
static_assert(offsetof(ANPC_Base_C, DialogSystem) == 0x000B78, "Member 'ANPC_Base_C::DialogSystem' has a wrong offset!");
static_assert(offsetof(ANPC_Base_C, BaseTurnRate) == 0x000B80, "Member 'ANPC_Base_C::BaseTurnRate' has a wrong offset!");
static_assert(offsetof(ANPC_Base_C, BaseLookUpRate) == 0x000B88, "Member 'ANPC_Base_C::BaseLookUpRate' has a wrong offset!");

}

