#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: QAHelpers_FunctionLibrary

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function QAHelpers_FunctionLibrary.QAHelpers_FunctionLibrary_C.AppendStack_(Content)
// 0x0108 (0x0108 - 0x0000)
struct QAHelpers_FunctionLibrary_C_AppendStack__Content_ final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   Result;                                            // 0x0018(0x0010)(Parm, OutParm)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0028(0x0048)(HasGetValueTypeHash)
	class FString                                 CallFunc_GetGameContentAssetFromCallStackDebugString_DebugString; // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0080(0x0010)()
	bool                                          CallFunc_IsPackagedForDistribution_ReturnValue;    // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0098(0x0048)(HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00E8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00F8(0x0010)()
};
static_assert(alignof(QAHelpers_FunctionLibrary_C_AppendStack__Content_) == 0x000008, "Wrong alignment on QAHelpers_FunctionLibrary_C_AppendStack__Content_");
static_assert(sizeof(QAHelpers_FunctionLibrary_C_AppendStack__Content_) == 0x000108, "Wrong size on QAHelpers_FunctionLibrary_C_AppendStack__Content_");
static_assert(offsetof(QAHelpers_FunctionLibrary_C_AppendStack__Content_, Text) == 0x000000, "Member 'QAHelpers_FunctionLibrary_C_AppendStack__Content_::Text' has a wrong offset!");
static_assert(offsetof(QAHelpers_FunctionLibrary_C_AppendStack__Content_, __WorldContext) == 0x000010, "Member 'QAHelpers_FunctionLibrary_C_AppendStack__Content_::__WorldContext' has a wrong offset!");
static_assert(offsetof(QAHelpers_FunctionLibrary_C_AppendStack__Content_, Result) == 0x000018, "Member 'QAHelpers_FunctionLibrary_C_AppendStack__Content_::Result' has a wrong offset!");
static_assert(offsetof(QAHelpers_FunctionLibrary_C_AppendStack__Content_, K2Node_MakeStruct_FormatArgumentData) == 0x000028, "Member 'QAHelpers_FunctionLibrary_C_AppendStack__Content_::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(QAHelpers_FunctionLibrary_C_AppendStack__Content_, CallFunc_GetGameContentAssetFromCallStackDebugString_DebugString) == 0x000070, "Member 'QAHelpers_FunctionLibrary_C_AppendStack__Content_::CallFunc_GetGameContentAssetFromCallStackDebugString_DebugString' has a wrong offset!");
static_assert(offsetof(QAHelpers_FunctionLibrary_C_AppendStack__Content_, CallFunc_Conv_StringToText_ReturnValue) == 0x000080, "Member 'QAHelpers_FunctionLibrary_C_AppendStack__Content_::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(QAHelpers_FunctionLibrary_C_AppendStack__Content_, CallFunc_IsPackagedForDistribution_ReturnValue) == 0x000090, "Member 'QAHelpers_FunctionLibrary_C_AppendStack__Content_::CallFunc_IsPackagedForDistribution_ReturnValue' has a wrong offset!");
static_assert(offsetof(QAHelpers_FunctionLibrary_C_AppendStack__Content_, K2Node_MakeStruct_FormatArgumentData_1) == 0x000098, "Member 'QAHelpers_FunctionLibrary_C_AppendStack__Content_::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(QAHelpers_FunctionLibrary_C_AppendStack__Content_, CallFunc_Not_PreBool_ReturnValue) == 0x0000E0, "Member 'QAHelpers_FunctionLibrary_C_AppendStack__Content_::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(QAHelpers_FunctionLibrary_C_AppendStack__Content_, K2Node_MakeArray_Array) == 0x0000E8, "Member 'QAHelpers_FunctionLibrary_C_AppendStack__Content_::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(QAHelpers_FunctionLibrary_C_AppendStack__Content_, CallFunc_Format_ReturnValue) == 0x0000F8, "Member 'QAHelpers_FunctionLibrary_C_AppendStack__Content_::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function QAHelpers_FunctionLibrary.QAHelpers_FunctionLibrary_C.FindContentAssetFromCallStack
// 0x02C0 (0x02C0 - 0x0000)
struct QAHelpers_FunctionLibrary_C_FindContentAssetFromCallStack final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Found;                                             // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 AssetName;                                         // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Callstack;                                         // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	TArray<class FString>                         local_stack;                                       // 0x0030(0x0010)(Edit, BlueprintVisible)
	int32                                         local_remainingFrames;                             // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         local_parts;                                       // 0x0048(0x0010)(Edit, BlueprintVisible)
	TSet<class FString>                           local_gameSystemPaths_0;                           // 0x0058(0x0050)(Edit, BlueprintVisible)
	TArray<class FString>                         Temp_wildcard_Temp_buffer_array_Variable;          // 0x00A8(0x0010)(ConstParm, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSet<class FString>                           K2Node_MakeVariable_MakeVariableOutput;            // 0x00C8(0x0050)()
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11C[0x4];                                      // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Array_Get_Item;                           // 0x0120(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue;                     // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_131[0x3];                                      // 0x0131(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_139[0x3];                                      // 0x0139(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_141[0x3];                                      // 0x0141(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_149[0x3];                                      // 0x0149(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0154(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_155[0x3];                                      // 0x0155(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15C[0x4];                                      // 0x015C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Array_Get_Item_1;                         // 0x0160(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Array_Get_Item_2;                         // 0x0170(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetCleanFilename_ReturnValue;             // 0x0180(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetBaseFilename_ReturnValue;              // 0x0190(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Trim_ReturnValue;                         // 0x01A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B4[0x4];                                      // 0x01B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x01B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C9[0x3];                                      // 0x01C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x01CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D1[0x3];                                      // 0x01D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x01D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1DA[0x6];                                      // 0x01DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         Temp_wildcard_We_need_a_second_array_to_store_the_result_and_be_able_to_wipe_the_first__buffer__array_Variable; // 0x01E0(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_IsPackagedForDistribution_ReturnValue;    // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F1[0x3];                                      // 0x01F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_MakeLiteralInt_ReturnValue;               // 0x01F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x01F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1FA[0x2];                                      // 0x01FA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x01FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_201[0x7];                                      // 0x0201(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0208(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<class FString>                         Temp_wildcard_Temp_buffer_array_Variable_1;        // 0x0218(0x0010)(ConstParm, ReferenceParm)
	class FString                                 CallFunc_JoinStringArray_ReturnValue;              // 0x0228(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0238(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0248(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0258(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25C[0x4];                                      // 0x025C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x0260(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_Select_Default;                             // 0x0270(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<class FString>                         CallFunc_Set_ToArray_Result;                       // 0x0280(0x0010)(ReferenceParm)
	bool                                          CallFunc_StringContainsAnyPartInList_Result;       // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_291[0x7];                                      // 0x0291(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         Temp_wildcard_We_need_a_second_array_to_store_the_result_and_be_able_to_wipe_the_first__buffer__array_Variable_1; // 0x0298(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A9[0x7];                                      // 0x02A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         CallFunc_GetStackTrace_ReturnValue;                // 0x02B0(0x0010)(ReferenceParm)
};
static_assert(alignof(QAHelpers_FunctionLibrary_C_FindContentAssetFromCallStack) == 0x000008, "Wrong alignment on QAHelpers_FunctionLibrary_C_FindContentAssetFromCallStack");
static_assert(sizeof(QAHelpers_FunctionLibrary_C_FindContentAssetFromCallStack) == 0x0002C0, "Wrong size on QAHelpers_FunctionLibrary_C_FindContentAssetFromCallStack");
static_assert(offsetof(QAHelpers_FunctionLibrary_C_FindContentAssetFromCallStack, __WorldContext) == 0x000000, "Member 'QAHelpers_FunctionLibrary_C_FindContentAssetFromCallStack::__WorldContext' has a wrong offset!");
static_assert(offsetof(QAHelpers_FunctionLibrary_C_FindContentAssetFromCallStack, Found) == 0x000008, "Member 'QAHelpers_FunctionLibrary_C_FindContentAssetFromCallStack::Found' has a wrong offset!");
static_assert(offsetof(QAHelpers_FunctionLibrary_C_FindContentAssetFromCallStack, AssetName) == 0x000010, "Member 'QAHelpers_FunctionLibrary_C_FindContentAssetFromCallStack::AssetName' has a wrong offset!");
static_assert(offsetof(QAHelpers_FunctionLibrary_C_FindContentAssetFromCallStack, Callstack) == 0x000020, "Member 'QAHelpers_FunctionLibrary_C_FindContentAssetFromCallStack::Callstack' has a wrong offset!");
static_assert(offsetof(QAHelpers_FunctionLibrary_C_FindContentAssetFromCallStack, local_stack) == 0x000030, "Member 'QAHelpers_FunctionLibrary_C_FindContentAssetFromCallStack::local_stack' has a wrong offset!");
static_assert(offsetof(QAHelpers_FunctionLibrary_C_FindContentAssetFromCallStack, local_remainingFrames) == 0x000040, "Member 'QAHelpers_FunctionLibrary_C_FindContentAssetFromCallStack::local_remainingFrames' has a wrong offset!");
static_assert(offsetof(QAHelpers_FunctionLibrary_C_FindContentAssetFromCallStack, local_parts) == 0x000048, "Member 'QAHelpers_FunctionLibrary_C_FindContentAssetFromCallStack::local_parts' has a wrong offset!");
static_assert(offsetof(QAHelpers_FunctionLibrary_C_FindContentAssetFromCallStack, local_gameSystemPaths_0) == 0x000058, "Member 'QAHelpers_FunctionLibrary_C_FindContentAssetFromCallStack::local_gameSystemPaths_0' has a wrong offset!");
static_assert(offsetof(QAHelpers_FunctionLibrary_C_FindContentAssetFromCallStack, Temp_wildcard_Temp_buffer_array_Variable) == 0x0000A8, "Member 'QAHelpers_FunctionLibrary_C_FindContentAssetFromCallStack::Temp_wildcard_Temp_buffer_array_Variable' has a wrong offset!");
static_assert(offsetof(QAHelpers_FunctionLibrary_C_FindContentAssetFromCallStack, CallFunc_Array_Length_ReturnValue) == 0x0000B8, "Member 'QAHelpers_FunctionLibrary_C_FindContentAssetFromCallStack::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(QAHelpers_FunctionLibrary_C_FindContentAssetFromCallStack, Temp_int_Loop_Counter_Variable) == 0x0000BC, "Member 'QAHelpers_FunctionLibrary_C_FindContentAssetFromCallStack::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(QAHelpers_FunctionLibrary_C_FindContentAssetFromCallStack, CallFunc_Add_IntInt_ReturnValue) == 0x0000C0, "Member 'QAHelpers_FunctionLibrary_C_FindContentAssetFromCallStack::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(QAHelpers_FunctionLibrary_C_FindContentAssetFromCallStack, Temp_int_Array_Index_Variable) == 0x0000C4, "Member 'QAHelpers_FunctionLibrary_C_FindContentAssetFromCallStack::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(QAHelpers_FunctionLibrary_C_FindContentAssetFromCallStack, K2Node_MakeVariable_MakeVariableOutput) == 0x0000C8, "Member 'QAHelpers_FunctionLibrary_C_FindContentAssetFromCallStack::K2Node_MakeVariable_MakeVariableOutput' has a wrong offset!");
static_assert(offsetof(QAHelpers_FunctionLibrary_C_FindContentAssetFromCallStack, Temp_int_Array_Index_Variable_1) == 0x000118, "Member 'QAHelpers_FunctionLibrary_C_FindContentAssetFromCallStack::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(QAHelpers_FunctionLibrary_C_FindContentAssetFromCallStack, CallFunc_Array_Get_Item) == 0x000120, "Member 'QAHelpers_FunctionLibrary_C_FindContentAssetFromCallStack::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(QAHelpers_FunctionLibrary_C_FindContentAssetFromCallStack, CallFunc_Contains_ReturnValue) == 0x000130, "Member 'QAHelpers_FunctionLibrary_C_FindContentAssetFromCallStack::CallFunc_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(QAHelpers_FunctionLibrary_C_FindContentAssetFromCallStack, Temp_int_Loop_Counter_Variable_1) == 0x000134, "Member 'QAHelpers_FunctionLibrary_C_FindContentAssetFromCallStack::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(QAHelpers_FunctionLibrary_C_FindContentAssetFromCallStack, CallFunc_Not_PreBool_ReturnValue) == 0x000138, "Member 'QAHelpers_FunctionLibrary_C_FindContentAssetFromCallStack::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(QAHelpers_FunctionLibrary_C_FindContentAssetFromCallStack, CallFunc_Add_IntInt_ReturnValue_1) == 0x00013C, "Member 'QAHelpers_FunctionLibrary_C_FindContentAssetFromCallStack::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(QAHelpers_FunctionLibrary_C_FindContentAssetFromCallStack, Temp_bool_True_if_break_was_hit_Variable) == 0x000140, "Member 'QAHelpers_FunctionLibrary_C_FindContentAssetFromCallStack::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(QAHelpers_FunctionLibrary_C_FindContentAssetFromCallStack, Temp_int_Array_Index_Variable_2) == 0x000144, "Member 'QAHelpers_FunctionLibrary_C_FindContentAssetFromCallStack::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(QAHelpers_FunctionLibrary_C_FindContentAssetFromCallStack, CallFunc_Not_PreBool_ReturnValue_1) == 0x000148, "Member 'QAHelpers_FunctionLibrary_C_FindContentAssetFromCallStack::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(QAHelpers_FunctionLibrary_C_FindContentAssetFromCallStack, Temp_int_Loop_Counter_Variable_2) == 0x00014C, "Member 'QAHelpers_FunctionLibrary_C_FindContentAssetFromCallStack::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(QAHelpers_FunctionLibrary_C_FindContentAssetFromCallStack, CallFunc_Array_Length_ReturnValue_1) == 0x000150, "Member 'QAHelpers_FunctionLibrary_C_FindContentAssetFromCallStack::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(QAHelpers_FunctionLibrary_C_FindContentAssetFromCallStack, CallFunc_Less_IntInt_ReturnValue) == 0x000154, "Member 'QAHelpers_FunctionLibrary_C_FindContentAssetFromCallStack::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(QAHelpers_FunctionLibrary_C_FindContentAssetFromCallStack, CallFunc_Add_IntInt_ReturnValue_2) == 0x000158, "Member 'QAHelpers_FunctionLibrary_C_FindContentAssetFromCallStack::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(QAHelpers_FunctionLibrary_C_FindContentAssetFromCallStack, CallFunc_Array_Get_Item_1) == 0x000160, "Member 'QAHelpers_FunctionLibrary_C_FindContentAssetFromCallStack::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(QAHelpers_FunctionLibrary_C_FindContentAssetFromCallStack, CallFunc_Array_Get_Item_2) == 0x000170, "Member 'QAHelpers_FunctionLibrary_C_FindContentAssetFromCallStack::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(QAHelpers_FunctionLibrary_C_FindContentAssetFromCallStack, CallFunc_GetCleanFilename_ReturnValue) == 0x000180, "Member 'QAHelpers_FunctionLibrary_C_FindContentAssetFromCallStack::CallFunc_GetCleanFilename_ReturnValue' has a wrong offset!");
static_assert(offsetof(QAHelpers_FunctionLibrary_C_FindContentAssetFromCallStack, CallFunc_GetBaseFilename_ReturnValue) == 0x000190, "Member 'QAHelpers_FunctionLibrary_C_FindContentAssetFromCallStack::CallFunc_GetBaseFilename_ReturnValue' has a wrong offset!");
static_assert(offsetof(QAHelpers_FunctionLibrary_C_FindContentAssetFromCallStack, CallFunc_Trim_ReturnValue) == 0x0001A0, "Member 'QAHelpers_FunctionLibrary_C_FindContentAssetFromCallStack::CallFunc_Trim_ReturnValue' has a wrong offset!");
static_assert(offsetof(QAHelpers_FunctionLibrary_C_FindContentAssetFromCallStack, CallFunc_Array_Length_ReturnValue_2) == 0x0001B0, "Member 'QAHelpers_FunctionLibrary_C_FindContentAssetFromCallStack::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(QAHelpers_FunctionLibrary_C_FindContentAssetFromCallStack, CallFunc_Concat_StrStr_ReturnValue) == 0x0001B8, "Member 'QAHelpers_FunctionLibrary_C_FindContentAssetFromCallStack::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(QAHelpers_FunctionLibrary_C_FindContentAssetFromCallStack, CallFunc_Less_IntInt_ReturnValue_1) == 0x0001C8, "Member 'QAHelpers_FunctionLibrary_C_FindContentAssetFromCallStack::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(QAHelpers_FunctionLibrary_C_FindContentAssetFromCallStack, CallFunc_Array_Add_ReturnValue) == 0x0001CC, "Member 'QAHelpers_FunctionLibrary_C_FindContentAssetFromCallStack::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(QAHelpers_FunctionLibrary_C_FindContentAssetFromCallStack, CallFunc_BooleanAND_ReturnValue) == 0x0001D0, "Member 'QAHelpers_FunctionLibrary_C_FindContentAssetFromCallStack::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(QAHelpers_FunctionLibrary_C_FindContentAssetFromCallStack, CallFunc_Array_Length_ReturnValue_3) == 0x0001D4, "Member 'QAHelpers_FunctionLibrary_C_FindContentAssetFromCallStack::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(QAHelpers_FunctionLibrary_C_FindContentAssetFromCallStack, CallFunc_Less_IntInt_ReturnValue_2) == 0x0001D8, "Member 'QAHelpers_FunctionLibrary_C_FindContentAssetFromCallStack::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(QAHelpers_FunctionLibrary_C_FindContentAssetFromCallStack, Temp_bool_Variable) == 0x0001D9, "Member 'QAHelpers_FunctionLibrary_C_FindContentAssetFromCallStack::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(QAHelpers_FunctionLibrary_C_FindContentAssetFromCallStack, Temp_wildcard_We_need_a_second_array_to_store_the_result_and_be_able_to_wipe_the_first__buffer__array_Variable) == 0x0001E0, "Member 'QAHelpers_FunctionLibrary_C_FindContentAssetFromCallStack::Temp_wildcard_We_need_a_second_array_to_store_the_result_and_be_able_to_wipe_the_first__buffer__array_Variable' has a wrong offset!");
static_assert(offsetof(QAHelpers_FunctionLibrary_C_FindContentAssetFromCallStack, CallFunc_IsPackagedForDistribution_ReturnValue) == 0x0001F0, "Member 'QAHelpers_FunctionLibrary_C_FindContentAssetFromCallStack::CallFunc_IsPackagedForDistribution_ReturnValue' has a wrong offset!");
static_assert(offsetof(QAHelpers_FunctionLibrary_C_FindContentAssetFromCallStack, CallFunc_MakeLiteralInt_ReturnValue) == 0x0001F4, "Member 'QAHelpers_FunctionLibrary_C_FindContentAssetFromCallStack::CallFunc_MakeLiteralInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(QAHelpers_FunctionLibrary_C_FindContentAssetFromCallStack, CallFunc_Not_PreBool_ReturnValue_2) == 0x0001F8, "Member 'QAHelpers_FunctionLibrary_C_FindContentAssetFromCallStack::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(QAHelpers_FunctionLibrary_C_FindContentAssetFromCallStack, CallFunc_Greater_IntInt_ReturnValue) == 0x0001F9, "Member 'QAHelpers_FunctionLibrary_C_FindContentAssetFromCallStack::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(QAHelpers_FunctionLibrary_C_FindContentAssetFromCallStack, CallFunc_Subtract_IntInt_ReturnValue) == 0x0001FC, "Member 'QAHelpers_FunctionLibrary_C_FindContentAssetFromCallStack::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(QAHelpers_FunctionLibrary_C_FindContentAssetFromCallStack, CallFunc_Less_IntInt_ReturnValue_3) == 0x000200, "Member 'QAHelpers_FunctionLibrary_C_FindContentAssetFromCallStack::CallFunc_Less_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(QAHelpers_FunctionLibrary_C_FindContentAssetFromCallStack, CallFunc_Conv_IntToString_ReturnValue) == 0x000208, "Member 'QAHelpers_FunctionLibrary_C_FindContentAssetFromCallStack::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(QAHelpers_FunctionLibrary_C_FindContentAssetFromCallStack, Temp_wildcard_Temp_buffer_array_Variable_1) == 0x000218, "Member 'QAHelpers_FunctionLibrary_C_FindContentAssetFromCallStack::Temp_wildcard_Temp_buffer_array_Variable_1' has a wrong offset!");
static_assert(offsetof(QAHelpers_FunctionLibrary_C_FindContentAssetFromCallStack, CallFunc_JoinStringArray_ReturnValue) == 0x000228, "Member 'QAHelpers_FunctionLibrary_C_FindContentAssetFromCallStack::CallFunc_JoinStringArray_ReturnValue' has a wrong offset!");
static_assert(offsetof(QAHelpers_FunctionLibrary_C_FindContentAssetFromCallStack, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000238, "Member 'QAHelpers_FunctionLibrary_C_FindContentAssetFromCallStack::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(QAHelpers_FunctionLibrary_C_FindContentAssetFromCallStack, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000248, "Member 'QAHelpers_FunctionLibrary_C_FindContentAssetFromCallStack::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(QAHelpers_FunctionLibrary_C_FindContentAssetFromCallStack, CallFunc_Array_Add_ReturnValue_1) == 0x000258, "Member 'QAHelpers_FunctionLibrary_C_FindContentAssetFromCallStack::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(QAHelpers_FunctionLibrary_C_FindContentAssetFromCallStack, CallFunc_Concat_StrStr_ReturnValue_3) == 0x000260, "Member 'QAHelpers_FunctionLibrary_C_FindContentAssetFromCallStack::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(QAHelpers_FunctionLibrary_C_FindContentAssetFromCallStack, K2Node_Select_Default) == 0x000270, "Member 'QAHelpers_FunctionLibrary_C_FindContentAssetFromCallStack::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(QAHelpers_FunctionLibrary_C_FindContentAssetFromCallStack, CallFunc_Set_ToArray_Result) == 0x000280, "Member 'QAHelpers_FunctionLibrary_C_FindContentAssetFromCallStack::CallFunc_Set_ToArray_Result' has a wrong offset!");
static_assert(offsetof(QAHelpers_FunctionLibrary_C_FindContentAssetFromCallStack, CallFunc_StringContainsAnyPartInList_Result) == 0x000290, "Member 'QAHelpers_FunctionLibrary_C_FindContentAssetFromCallStack::CallFunc_StringContainsAnyPartInList_Result' has a wrong offset!");
static_assert(offsetof(QAHelpers_FunctionLibrary_C_FindContentAssetFromCallStack, Temp_wildcard_We_need_a_second_array_to_store_the_result_and_be_able_to_wipe_the_first__buffer__array_Variable_1) == 0x000298, "Member 'QAHelpers_FunctionLibrary_C_FindContentAssetFromCallStack::Temp_wildcard_We_need_a_second_array_to_store_the_result_and_be_able_to_wipe_the_first__buffer__array_Variable_1' has a wrong offset!");
static_assert(offsetof(QAHelpers_FunctionLibrary_C_FindContentAssetFromCallStack, CallFunc_Not_PreBool_ReturnValue_3) == 0x0002A8, "Member 'QAHelpers_FunctionLibrary_C_FindContentAssetFromCallStack::CallFunc_Not_PreBool_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(QAHelpers_FunctionLibrary_C_FindContentAssetFromCallStack, CallFunc_GetStackTrace_ReturnValue) == 0x0002B0, "Member 'QAHelpers_FunctionLibrary_C_FindContentAssetFromCallStack::CallFunc_GetStackTrace_ReturnValue' has a wrong offset!");

// Function QAHelpers_FunctionLibrary.QAHelpers_FunctionLibrary_C.GetGameContentAssetFromCallStackDebugString
// 0x0138 (0x0138 - 0x0000)
struct QAHelpers_FunctionLibrary_C_GetGameContentAssetFromCallStackDebugString final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 DebugString;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Temp_string_Variable;                              // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_FindContentAssetFromCallStack_Found;      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_FindContentAssetFromCallStack_AssetName;  // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_FindContentAssetFromCallStack_CallStack;  // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0058(0x0010)()
	class FString                                 K2Node_Select_Default;                             // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0078(0x0048)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x00C0(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00D0(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0118(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Format_ReturnValue;                       // 0x0128(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(QAHelpers_FunctionLibrary_C_GetGameContentAssetFromCallStackDebugString) == 0x000008, "Wrong alignment on QAHelpers_FunctionLibrary_C_GetGameContentAssetFromCallStackDebugString");
static_assert(sizeof(QAHelpers_FunctionLibrary_C_GetGameContentAssetFromCallStackDebugString) == 0x000138, "Wrong size on QAHelpers_FunctionLibrary_C_GetGameContentAssetFromCallStackDebugString");
static_assert(offsetof(QAHelpers_FunctionLibrary_C_GetGameContentAssetFromCallStackDebugString, __WorldContext) == 0x000000, "Member 'QAHelpers_FunctionLibrary_C_GetGameContentAssetFromCallStackDebugString::__WorldContext' has a wrong offset!");
static_assert(offsetof(QAHelpers_FunctionLibrary_C_GetGameContentAssetFromCallStackDebugString, DebugString) == 0x000008, "Member 'QAHelpers_FunctionLibrary_C_GetGameContentAssetFromCallStackDebugString::DebugString' has a wrong offset!");
static_assert(offsetof(QAHelpers_FunctionLibrary_C_GetGameContentAssetFromCallStackDebugString, Temp_bool_Variable) == 0x000018, "Member 'QAHelpers_FunctionLibrary_C_GetGameContentAssetFromCallStackDebugString::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(QAHelpers_FunctionLibrary_C_GetGameContentAssetFromCallStackDebugString, Temp_string_Variable) == 0x000020, "Member 'QAHelpers_FunctionLibrary_C_GetGameContentAssetFromCallStackDebugString::Temp_string_Variable' has a wrong offset!");
static_assert(offsetof(QAHelpers_FunctionLibrary_C_GetGameContentAssetFromCallStackDebugString, CallFunc_FindContentAssetFromCallStack_Found) == 0x000030, "Member 'QAHelpers_FunctionLibrary_C_GetGameContentAssetFromCallStackDebugString::CallFunc_FindContentAssetFromCallStack_Found' has a wrong offset!");
static_assert(offsetof(QAHelpers_FunctionLibrary_C_GetGameContentAssetFromCallStackDebugString, CallFunc_FindContentAssetFromCallStack_AssetName) == 0x000038, "Member 'QAHelpers_FunctionLibrary_C_GetGameContentAssetFromCallStackDebugString::CallFunc_FindContentAssetFromCallStack_AssetName' has a wrong offset!");
static_assert(offsetof(QAHelpers_FunctionLibrary_C_GetGameContentAssetFromCallStackDebugString, CallFunc_FindContentAssetFromCallStack_CallStack) == 0x000048, "Member 'QAHelpers_FunctionLibrary_C_GetGameContentAssetFromCallStackDebugString::CallFunc_FindContentAssetFromCallStack_CallStack' has a wrong offset!");
static_assert(offsetof(QAHelpers_FunctionLibrary_C_GetGameContentAssetFromCallStackDebugString, CallFunc_Conv_StringToText_ReturnValue) == 0x000058, "Member 'QAHelpers_FunctionLibrary_C_GetGameContentAssetFromCallStackDebugString::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(QAHelpers_FunctionLibrary_C_GetGameContentAssetFromCallStackDebugString, K2Node_Select_Default) == 0x000068, "Member 'QAHelpers_FunctionLibrary_C_GetGameContentAssetFromCallStackDebugString::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(QAHelpers_FunctionLibrary_C_GetGameContentAssetFromCallStackDebugString, K2Node_MakeStruct_FormatArgumentData) == 0x000078, "Member 'QAHelpers_FunctionLibrary_C_GetGameContentAssetFromCallStackDebugString::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(QAHelpers_FunctionLibrary_C_GetGameContentAssetFromCallStackDebugString, CallFunc_Conv_StringToText_ReturnValue_1) == 0x0000C0, "Member 'QAHelpers_FunctionLibrary_C_GetGameContentAssetFromCallStackDebugString::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(QAHelpers_FunctionLibrary_C_GetGameContentAssetFromCallStackDebugString, K2Node_MakeStruct_FormatArgumentData_1) == 0x0000D0, "Member 'QAHelpers_FunctionLibrary_C_GetGameContentAssetFromCallStackDebugString::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(QAHelpers_FunctionLibrary_C_GetGameContentAssetFromCallStackDebugString, K2Node_MakeArray_Array) == 0x000118, "Member 'QAHelpers_FunctionLibrary_C_GetGameContentAssetFromCallStackDebugString::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(QAHelpers_FunctionLibrary_C_GetGameContentAssetFromCallStackDebugString, CallFunc_Format_ReturnValue) == 0x000128, "Member 'QAHelpers_FunctionLibrary_C_GetGameContentAssetFromCallStackDebugString::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function QAHelpers_FunctionLibrary.QAHelpers_FunctionLibrary_C.GetQAWidgetCVarName
// 0x0068 (0x0068 - 0x0000)
struct QAHelpers_FunctionLibrary_C_GetQAWidgetCVarName final
{
public:
	const class UObject*                          Object;                                            // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
	class FString                                 CallFunc_GetPathName_ReturnValue;                  // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Split_LeftS;                              // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Split_RightS;                             // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Split_ReturnValue;                        // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(QAHelpers_FunctionLibrary_C_GetQAWidgetCVarName) == 0x000008, "Wrong alignment on QAHelpers_FunctionLibrary_C_GetQAWidgetCVarName");
static_assert(sizeof(QAHelpers_FunctionLibrary_C_GetQAWidgetCVarName) == 0x000068, "Wrong size on QAHelpers_FunctionLibrary_C_GetQAWidgetCVarName");
static_assert(offsetof(QAHelpers_FunctionLibrary_C_GetQAWidgetCVarName, Object) == 0x000000, "Member 'QAHelpers_FunctionLibrary_C_GetQAWidgetCVarName::Object' has a wrong offset!");
static_assert(offsetof(QAHelpers_FunctionLibrary_C_GetQAWidgetCVarName, __WorldContext) == 0x000008, "Member 'QAHelpers_FunctionLibrary_C_GetQAWidgetCVarName::__WorldContext' has a wrong offset!");
static_assert(offsetof(QAHelpers_FunctionLibrary_C_GetQAWidgetCVarName, ReturnValue) == 0x000010, "Member 'QAHelpers_FunctionLibrary_C_GetQAWidgetCVarName::ReturnValue' has a wrong offset!");
static_assert(offsetof(QAHelpers_FunctionLibrary_C_GetQAWidgetCVarName, CallFunc_GetPathName_ReturnValue) == 0x000020, "Member 'QAHelpers_FunctionLibrary_C_GetQAWidgetCVarName::CallFunc_GetPathName_ReturnValue' has a wrong offset!");
static_assert(offsetof(QAHelpers_FunctionLibrary_C_GetQAWidgetCVarName, CallFunc_Split_LeftS) == 0x000030, "Member 'QAHelpers_FunctionLibrary_C_GetQAWidgetCVarName::CallFunc_Split_LeftS' has a wrong offset!");
static_assert(offsetof(QAHelpers_FunctionLibrary_C_GetQAWidgetCVarName, CallFunc_Split_RightS) == 0x000040, "Member 'QAHelpers_FunctionLibrary_C_GetQAWidgetCVarName::CallFunc_Split_RightS' has a wrong offset!");
static_assert(offsetof(QAHelpers_FunctionLibrary_C_GetQAWidgetCVarName, CallFunc_Split_ReturnValue) == 0x000050, "Member 'QAHelpers_FunctionLibrary_C_GetQAWidgetCVarName::CallFunc_Split_ReturnValue' has a wrong offset!");
static_assert(offsetof(QAHelpers_FunctionLibrary_C_GetQAWidgetCVarName, CallFunc_Concat_StrStr_ReturnValue) == 0x000058, "Member 'QAHelpers_FunctionLibrary_C_GetQAWidgetCVarName::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");

// Function QAHelpers_FunctionLibrary.QAHelpers_FunctionLibrary_C.IsDemoMode
// 0x0010 (0x0010 - 0x0000)
struct QAHelpers_FunctionLibrary_C_IsDemoMode final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Enabled;                                           // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetBoolCVar_ReturnValue;                  // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(QAHelpers_FunctionLibrary_C_IsDemoMode) == 0x000008, "Wrong alignment on QAHelpers_FunctionLibrary_C_IsDemoMode");
static_assert(sizeof(QAHelpers_FunctionLibrary_C_IsDemoMode) == 0x000010, "Wrong size on QAHelpers_FunctionLibrary_C_IsDemoMode");
static_assert(offsetof(QAHelpers_FunctionLibrary_C_IsDemoMode, __WorldContext) == 0x000000, "Member 'QAHelpers_FunctionLibrary_C_IsDemoMode::__WorldContext' has a wrong offset!");
static_assert(offsetof(QAHelpers_FunctionLibrary_C_IsDemoMode, Enabled) == 0x000008, "Member 'QAHelpers_FunctionLibrary_C_IsDemoMode::Enabled' has a wrong offset!");
static_assert(offsetof(QAHelpers_FunctionLibrary_C_IsDemoMode, CallFunc_GetBoolCVar_ReturnValue) == 0x000009, "Member 'QAHelpers_FunctionLibrary_C_IsDemoMode::CallFunc_GetBoolCVar_ReturnValue' has a wrong offset!");

// Function QAHelpers_FunctionLibrary.QAHelpers_FunctionLibrary_C.StringContainsAnyPartInList
// 0x0058 (0x0058 - 0x0000)
struct QAHelpers_FunctionLibrary_C_StringContainsAnyPartInList final
{
public:
	class FString                                 TargetSearch;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	TArray<class FString>                         Parts;                                             // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          bUseCase;                                          // 0x0020(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0030(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Array_Get_Item;                           // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52[0x2];                                       // 0x0052(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(QAHelpers_FunctionLibrary_C_StringContainsAnyPartInList) == 0x000008, "Wrong alignment on QAHelpers_FunctionLibrary_C_StringContainsAnyPartInList");
static_assert(sizeof(QAHelpers_FunctionLibrary_C_StringContainsAnyPartInList) == 0x000058, "Wrong size on QAHelpers_FunctionLibrary_C_StringContainsAnyPartInList");
static_assert(offsetof(QAHelpers_FunctionLibrary_C_StringContainsAnyPartInList, TargetSearch) == 0x000000, "Member 'QAHelpers_FunctionLibrary_C_StringContainsAnyPartInList::TargetSearch' has a wrong offset!");
static_assert(offsetof(QAHelpers_FunctionLibrary_C_StringContainsAnyPartInList, Parts) == 0x000010, "Member 'QAHelpers_FunctionLibrary_C_StringContainsAnyPartInList::Parts' has a wrong offset!");
static_assert(offsetof(QAHelpers_FunctionLibrary_C_StringContainsAnyPartInList, bUseCase) == 0x000020, "Member 'QAHelpers_FunctionLibrary_C_StringContainsAnyPartInList::bUseCase' has a wrong offset!");
static_assert(offsetof(QAHelpers_FunctionLibrary_C_StringContainsAnyPartInList, __WorldContext) == 0x000028, "Member 'QAHelpers_FunctionLibrary_C_StringContainsAnyPartInList::__WorldContext' has a wrong offset!");
static_assert(offsetof(QAHelpers_FunctionLibrary_C_StringContainsAnyPartInList, Result) == 0x000030, "Member 'QAHelpers_FunctionLibrary_C_StringContainsAnyPartInList::Result' has a wrong offset!");
static_assert(offsetof(QAHelpers_FunctionLibrary_C_StringContainsAnyPartInList, CallFunc_Array_Length_ReturnValue) == 0x000034, "Member 'QAHelpers_FunctionLibrary_C_StringContainsAnyPartInList::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(QAHelpers_FunctionLibrary_C_StringContainsAnyPartInList, Temp_int_Array_Index_Variable) == 0x000038, "Member 'QAHelpers_FunctionLibrary_C_StringContainsAnyPartInList::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(QAHelpers_FunctionLibrary_C_StringContainsAnyPartInList, Temp_int_Loop_Counter_Variable) == 0x00003C, "Member 'QAHelpers_FunctionLibrary_C_StringContainsAnyPartInList::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(QAHelpers_FunctionLibrary_C_StringContainsAnyPartInList, CallFunc_Array_Get_Item) == 0x000040, "Member 'QAHelpers_FunctionLibrary_C_StringContainsAnyPartInList::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(QAHelpers_FunctionLibrary_C_StringContainsAnyPartInList, CallFunc_Contains_ReturnValue) == 0x000050, "Member 'QAHelpers_FunctionLibrary_C_StringContainsAnyPartInList::CallFunc_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(QAHelpers_FunctionLibrary_C_StringContainsAnyPartInList, CallFunc_Less_IntInt_ReturnValue) == 0x000051, "Member 'QAHelpers_FunctionLibrary_C_StringContainsAnyPartInList::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(QAHelpers_FunctionLibrary_C_StringContainsAnyPartInList, CallFunc_Add_IntInt_ReturnValue) == 0x000054, "Member 'QAHelpers_FunctionLibrary_C_StringContainsAnyPartInList::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function QAHelpers_FunctionLibrary.QAHelpers_FunctionLibrary_C.TEST_FUNCTION_TOM
// 0x0008 (0x0008 - 0x0000)
struct QAHelpers_FunctionLibrary_C_TEST_FUNCTION_TOM final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(QAHelpers_FunctionLibrary_C_TEST_FUNCTION_TOM) == 0x000008, "Wrong alignment on QAHelpers_FunctionLibrary_C_TEST_FUNCTION_TOM");
static_assert(sizeof(QAHelpers_FunctionLibrary_C_TEST_FUNCTION_TOM) == 0x000008, "Wrong size on QAHelpers_FunctionLibrary_C_TEST_FUNCTION_TOM");
static_assert(offsetof(QAHelpers_FunctionLibrary_C_TEST_FUNCTION_TOM, __WorldContext) == 0x000000, "Member 'QAHelpers_FunctionLibrary_C_TEST_FUNCTION_TOM::__WorldContext' has a wrong offset!");

// Function QAHelpers_FunctionLibrary.QAHelpers_FunctionLibrary_C.ApplyQACheckboxCVar
// 0x0030 (0x0030 - 0x0000)
struct QAHelpers_FunctionLibrary_C_ApplyQACheckboxCVar final
{
public:
	class UCheckBox*                              Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetQAWidgetCVarName_ReturnValue;          // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetBoolCVar_ReturnValue;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(QAHelpers_FunctionLibrary_C_ApplyQACheckboxCVar) == 0x000008, "Wrong alignment on QAHelpers_FunctionLibrary_C_ApplyQACheckboxCVar");
static_assert(sizeof(QAHelpers_FunctionLibrary_C_ApplyQACheckboxCVar) == 0x000030, "Wrong size on QAHelpers_FunctionLibrary_C_ApplyQACheckboxCVar");
static_assert(offsetof(QAHelpers_FunctionLibrary_C_ApplyQACheckboxCVar, Widget) == 0x000000, "Member 'QAHelpers_FunctionLibrary_C_ApplyQACheckboxCVar::Widget' has a wrong offset!");
static_assert(offsetof(QAHelpers_FunctionLibrary_C_ApplyQACheckboxCVar, __WorldContext) == 0x000008, "Member 'QAHelpers_FunctionLibrary_C_ApplyQACheckboxCVar::__WorldContext' has a wrong offset!");
static_assert(offsetof(QAHelpers_FunctionLibrary_C_ApplyQACheckboxCVar, CallFunc_GetQAWidgetCVarName_ReturnValue) == 0x000010, "Member 'QAHelpers_FunctionLibrary_C_ApplyQACheckboxCVar::CallFunc_GetQAWidgetCVarName_ReturnValue' has a wrong offset!");
static_assert(offsetof(QAHelpers_FunctionLibrary_C_ApplyQACheckboxCVar, CallFunc_Conv_StringToName_ReturnValue) == 0x000020, "Member 'QAHelpers_FunctionLibrary_C_ApplyQACheckboxCVar::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(QAHelpers_FunctionLibrary_C_ApplyQACheckboxCVar, CallFunc_GetBoolCVar_ReturnValue) == 0x000028, "Member 'QAHelpers_FunctionLibrary_C_ApplyQACheckboxCVar::CallFunc_GetBoolCVar_ReturnValue' has a wrong offset!");

// Function QAHelpers_FunctionLibrary.QAHelpers_FunctionLibrary_C.ApplyQAComboBoxCVar
// 0x0038 (0x0038 - 0x0000)
struct QAHelpers_FunctionLibrary_C_ApplyQAComboBoxCVar final
{
public:
	class UComboBoxString*                        Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetQAWidgetCVarName_ReturnValue;          // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetStringCVar_ReturnValue;                // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(QAHelpers_FunctionLibrary_C_ApplyQAComboBoxCVar) == 0x000008, "Wrong alignment on QAHelpers_FunctionLibrary_C_ApplyQAComboBoxCVar");
static_assert(sizeof(QAHelpers_FunctionLibrary_C_ApplyQAComboBoxCVar) == 0x000038, "Wrong size on QAHelpers_FunctionLibrary_C_ApplyQAComboBoxCVar");
static_assert(offsetof(QAHelpers_FunctionLibrary_C_ApplyQAComboBoxCVar, Widget) == 0x000000, "Member 'QAHelpers_FunctionLibrary_C_ApplyQAComboBoxCVar::Widget' has a wrong offset!");
static_assert(offsetof(QAHelpers_FunctionLibrary_C_ApplyQAComboBoxCVar, __WorldContext) == 0x000008, "Member 'QAHelpers_FunctionLibrary_C_ApplyQAComboBoxCVar::__WorldContext' has a wrong offset!");
static_assert(offsetof(QAHelpers_FunctionLibrary_C_ApplyQAComboBoxCVar, CallFunc_GetQAWidgetCVarName_ReturnValue) == 0x000010, "Member 'QAHelpers_FunctionLibrary_C_ApplyQAComboBoxCVar::CallFunc_GetQAWidgetCVarName_ReturnValue' has a wrong offset!");
static_assert(offsetof(QAHelpers_FunctionLibrary_C_ApplyQAComboBoxCVar, CallFunc_Conv_StringToName_ReturnValue) == 0x000020, "Member 'QAHelpers_FunctionLibrary_C_ApplyQAComboBoxCVar::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(QAHelpers_FunctionLibrary_C_ApplyQAComboBoxCVar, CallFunc_GetStringCVar_ReturnValue) == 0x000028, "Member 'QAHelpers_FunctionLibrary_C_ApplyQAComboBoxCVar::CallFunc_GetStringCVar_ReturnValue' has a wrong offset!");

// Function QAHelpers_FunctionLibrary.QAHelpers_FunctionLibrary_C.RegisterQACheckBoxCVar
// 0x0030 (0x0030 - 0x0000)
struct QAHelpers_FunctionLibrary_C_RegisterQACheckBoxCVar final
{
public:
	class UCheckBox*                              Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetQAWidgetCVarName_ReturnValue;          // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
