#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_AchievementPlatformData

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct S_AchievementPlatformData.S_AchievementPlatformData
// 0x0020 (0x0020 - 0x0000)
struct FS_AchievementPlatformData final
{
public:
	class FName                                   SteamID_2_7FCAF3CB47ECBF59D33E549F9FB80C96;        // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   EpicGamesID_8_751E02C44C6562477B4914B9EDC2E90B;    // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   PlaystationID_4_EFC4F63B4168E7BA95E21BA18AA52B9C;  // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   MicrosoftGameDevelopmentKitID_9_4A2D9C6C4B4FAE1910EA8EA546887EB2; // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FS_AchievementPlatformData) == 0x000004, "Wrong alignment on FS_AchievementPlatformData");
static_assert(sizeof(FS_AchievementPlatformData) == 0x000020, "Wrong size on FS_AchievementPlatformData");
static_assert(offsetof(FS_AchievementPlatformData, SteamID_2_7FCAF3CB47ECBF59D33E549F9FB80C96) == 0x000000, "Member 'FS_AchievementPlatformData::SteamID_2_7FCAF3CB47ECBF59D33E549F9FB80C96' has a wrong offset!");
static_assert(offsetof(FS_AchievementPlatformData, EpicGamesID_8_751E02C44C6562477B4914B9EDC2E90B) == 0x000008, "Member 'FS_AchievementPlatformData::EpicGamesID_8_751E02C44C6562477B4914B9EDC2E90B' has a wrong offset!");
static_assert(offsetof(FS_AchievementPlatformData, PlaystationID_4_EFC4F63B4168E7BA95E21BA18AA52B9C) == 0x000010, "Member 'FS_AchievementPlatformData::PlaystationID_4_EFC4F63B4168E7BA95E21BA18AA52B9C' has a wrong offset!");
static_assert(offsetof(FS_AchievementPlatformData, MicrosoftGameDevelopmentKitID_9_4A2D9C6C4B4FAE1910EA8EA546887EB2) == 0x000018, "Member 'FS_AchievementPlatformData::MicrosoftGameDevelopmentKitID_9_4A2D9C6C4B4FAE1910EA8EA546887EB2' has a wrong offset!");

}

