#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_AchievementDefinition

#include "Basic.hpp"

#include "S_AchievementPlatformData_structs.hpp"


namespace SDK
{

// UserDefinedStruct S_AchievementDefinition.S_AchievementDefinition
// 0x0048 (0x0048 - 0x0000)
struct FS_AchievementDefinition final
{
public:
	class UBP_AchievementValidator_C*             Validator_12_CB4100C04692770F209A48A3A66B15A0;     // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FS_AchievementPlatformData             PlatformIDs_8_3B6A4062414F158451DE098F66BF78DD;    // 0x0008(0x0020)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 DebugName_3_C2FC7CDE46F34AEA24E3988A43B21D79;      // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 DebugDescription_5_9DB0DFC740E40090D4DB26A9A52D07EE; // 0x0038(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(FS_AchievementDefinition) == 0x000008, "Wrong alignment on FS_AchievementDefinition");
static_assert(sizeof(FS_AchievementDefinition) == 0x000048, "Wrong size on FS_AchievementDefinition");
static_assert(offsetof(FS_AchievementDefinition, Validator_12_CB4100C04692770F209A48A3A66B15A0) == 0x000000, "Member 'FS_AchievementDefinition::Validator_12_CB4100C04692770F209A48A3A66B15A0' has a wrong offset!");
static_assert(offsetof(FS_AchievementDefinition, PlatformIDs_8_3B6A4062414F158451DE098F66BF78DD) == 0x000008, "Member 'FS_AchievementDefinition::PlatformIDs_8_3B6A4062414F158451DE098F66BF78DD' has a wrong offset!");
static_assert(offsetof(FS_AchievementDefinition, DebugName_3_C2FC7CDE46F34AEA24E3988A43B21D79) == 0x000028, "Member 'FS_AchievementDefinition::DebugName_3_C2FC7CDE46F34AEA24E3988A43B21D79' has a wrong offset!");
static_assert(offsetof(FS_AchievementDefinition, DebugDescription_5_9DB0DFC740E40090D4DB26A9A52D07EE) == 0x000038, "Member 'FS_AchievementDefinition::DebugDescription_5_9DB0DFC740E40090D4DB26A9A52D07EE' has a wrong offset!");

}

