#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_BattleLineCandidate

#include "Basic.hpp"

#include "S_BattleLine_structs.hpp"


namespace SDK
{

// UserDefinedStruct S_BattleLineCandidate.S_BattleLineCandidate
// 0x0028 (0x0028 - 0x0000)
struct FS_BattleLineCandidate final
{
public:
	struct FS_BattleLine                          BattleLine_9_23F384E045F8BF30BFC966B058367DA2;     // 0x0000(0x0010)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	class UBP_BattleLinesModel_Base_C*            SourceModel_7_0CB56EB44B2F5758E220B1979F29A674;    // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 DebugReason_12_B63110744F5BFD028972919CAA0B7FEA;   // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(FS_BattleLineCandidate) == 0x000008, "Wrong alignment on FS_BattleLineCandidate");
static_assert(sizeof(FS_BattleLineCandidate) == 0x000028, "Wrong size on FS_BattleLineCandidate");
static_assert(offsetof(FS_BattleLineCandidate, BattleLine_9_23F384E045F8BF30BFC966B058367DA2) == 0x000000, "Member 'FS_BattleLineCandidate::BattleLine_9_23F384E045F8BF30BFC966B058367DA2' has a wrong offset!");
static_assert(offsetof(FS_BattleLineCandidate, SourceModel_7_0CB56EB44B2F5758E220B1979F29A674) == 0x000010, "Member 'FS_BattleLineCandidate::SourceModel_7_0CB56EB44B2F5758E220B1979F29A674' has a wrong offset!");
static_assert(offsetof(FS_BattleLineCandidate, DebugReason_12_B63110744F5BFD028972919CAA0B7FEA) == 0x000018, "Member 'FS_BattleLineCandidate::DebugReason_12_B63110744F5BFD028972919CAA0B7FEA' has a wrong offset!");

}

