#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_BattleTowerStageData

#include "Basic.hpp"

#include "S_MusicParameters_structs.hpp"
#include "Engine_structs.hpp"
#include "S_Loot_structs.hpp"


namespace SDK
{

// UserDefinedStruct S_BattleTowerStageData.S_BattleTowerStageData
// 0x0098 (0x0098 - 0x0000)
struct FS_BattleTowerStageData final
{
public:
	class FName                                   StageHardcodedID_27_8DF1068F4D78F3DF27C2F2BAFA4CEECF; // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   StageName_22_0B1978654FE8038BEFD63AA0BCC116B3;     // 0x0008(0x0010)(Edit, BlueprintVisible)
	struct FDataTableRowHandle                    EncounterRow_11_AB66F1FE40B945189105B39824AF39BA;  // 0x0018(0x0010)(Edit, BlueprintVisible, NoDestructor)
	TSoftObjectPtr<class ABP_BattleMap_C>         BattleMap_21_6D9CCBBB4E43F134AA083A86630BA99A;     // 0x0028(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TArray<struct FS_Loot>                        Reward_15_2A07F6274B8D79CDE8ABF2A66C6D0F78;        // 0x0050(0x0010)(Edit, BlueprintVisible)
	bool                                          OverrideDefaultReward_19_7754281F4349D1F4700680B8D787948D; // 0x0060(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_MusicParameters                     BattleMusic_30_341F06D443AC58DC562D758BFB987B64;   // 0x0068(0x0030)(Edit, BlueprintVisible, HasGetValueTypeHash)
};
static_assert(alignof(FS_BattleTowerStageData) == 0x000008, "Wrong alignment on FS_BattleTowerStageData");
static_assert(sizeof(FS_BattleTowerStageData) == 0x000098, "Wrong size on FS_BattleTowerStageData");
static_assert(offsetof(FS_BattleTowerStageData, StageHardcodedID_27_8DF1068F4D78F3DF27C2F2BAFA4CEECF) == 0x000000, "Member 'FS_BattleTowerStageData::StageHardcodedID_27_8DF1068F4D78F3DF27C2F2BAFA4CEECF' has a wrong offset!");
static_assert(offsetof(FS_BattleTowerStageData, StageName_22_0B1978654FE8038BEFD63AA0BCC116B3) == 0x000008, "Member 'FS_BattleTowerStageData::StageName_22_0B1978654FE8038BEFD63AA0BCC116B3' has a wrong offset!");
static_assert(offsetof(FS_BattleTowerStageData, EncounterRow_11_AB66F1FE40B945189105B39824AF39BA) == 0x000018, "Member 'FS_BattleTowerStageData::EncounterRow_11_AB66F1FE40B945189105B39824AF39BA' has a wrong offset!");
static_assert(offsetof(FS_BattleTowerStageData, BattleMap_21_6D9CCBBB4E43F134AA083A86630BA99A) == 0x000028, "Member 'FS_BattleTowerStageData::BattleMap_21_6D9CCBBB4E43F134AA083A86630BA99A' has a wrong offset!");
static_assert(offsetof(FS_BattleTowerStageData, Reward_15_2A07F6274B8D79CDE8ABF2A66C6D0F78) == 0x000050, "Member 'FS_BattleTowerStageData::Reward_15_2A07F6274B8D79CDE8ABF2A66C6D0F78' has a wrong offset!");
static_assert(offsetof(FS_BattleTowerStageData, OverrideDefaultReward_19_7754281F4349D1F4700680B8D787948D) == 0x000060, "Member 'FS_BattleTowerStageData::OverrideDefaultReward_19_7754281F4349D1F4700680B8D787948D' has a wrong offset!");
static_assert(offsetof(FS_BattleTowerStageData, BattleMusic_30_341F06D443AC58DC562D758BFB987B64) == 0x000068, "Member 'FS_BattleTowerStageData::BattleMusic_30_341F06D443AC58DC562D758BFB987B64' has a wrong offset!");

}

