#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_BattleRewardParameters

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct S_BattleRewardParameters.S_BattleRewardParameters
// 0x0068 (0x0068 - 0x0000)
struct FS_BattleRewardParameters final
{
public:
	double                                        ExperienceMultiplier_18_1E89E3064028B5F598B33C90855DC88D; // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        GoldMultiplier_20_465B27F2426EF03D5CDECAB763FE6B77; // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ProgressEquippedLuminas_16_6057D8B44483C557F06B3DAD1EE61BE5; // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          OverrideLootItems_7_BF1C0C3F4AC3F143902F2CB6B39B58F1; // 0x0011(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FName, int32>                      AdditionalLootItems_10_3BECA35644A636E3453F2FB026946BA0; // 0x0018(0x0050)(Edit, BlueprintVisible)
};
static_assert(alignof(FS_BattleRewardParameters) == 0x000008, "Wrong alignment on FS_BattleRewardParameters");
static_assert(sizeof(FS_BattleRewardParameters) == 0x000068, "Wrong size on FS_BattleRewardParameters");
static_assert(offsetof(FS_BattleRewardParameters, ExperienceMultiplier_18_1E89E3064028B5F598B33C90855DC88D) == 0x000000, "Member 'FS_BattleRewardParameters::ExperienceMultiplier_18_1E89E3064028B5F598B33C90855DC88D' has a wrong offset!");
static_assert(offsetof(FS_BattleRewardParameters, GoldMultiplier_20_465B27F2426EF03D5CDECAB763FE6B77) == 0x000008, "Member 'FS_BattleRewardParameters::GoldMultiplier_20_465B27F2426EF03D5CDECAB763FE6B77' has a wrong offset!");
static_assert(offsetof(FS_BattleRewardParameters, ProgressEquippedLuminas_16_6057D8B44483C557F06B3DAD1EE61BE5) == 0x000010, "Member 'FS_BattleRewardParameters::ProgressEquippedLuminas_16_6057D8B44483C557F06B3DAD1EE61BE5' has a wrong offset!");
static_assert(offsetof(FS_BattleRewardParameters, OverrideLootItems_7_BF1C0C3F4AC3F143902F2CB6B39B58F1) == 0x000011, "Member 'FS_BattleRewardParameters::OverrideLootItems_7_BF1C0C3F4AC3F143902F2CB6B39B58F1' has a wrong offset!");
static_assert(offsetof(FS_BattleRewardParameters, AdditionalLootItems_10_3BECA35644A636E3453F2FB026946BA0) == 0x000018, "Member 'FS_BattleRewardParameters::AdditionalLootItems_10_3BECA35644A636E3453F2FB026946BA0' has a wrong offset!");

}

