#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_BattleRewards

#include "Basic.hpp"

#include "S_RolledLootEntry_structs.hpp"


namespace SDK
{

// UserDefinedStruct S_BattleRewards.S_BattleRewards
// 0x0018 (0x0018 - 0x0000)
struct FS_BattleRewards final
{
public:
	int32                                         ExperienceGained_2_9AE2AB5A49976A49198F5D955D679CB2; // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         GoldAcquired_4_73DF911B4B475A41BF741BB2F41F2DCC;   // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FS_RolledLootEntry>             RolledLootEntries_12_64C7AB394C92E36998E1CAB6944CA883; // 0x0008(0x0010)(Edit, BlueprintVisible)
};
static_assert(alignof(FS_BattleRewards) == 0x000008, "Wrong alignment on FS_BattleRewards");
static_assert(sizeof(FS_BattleRewards) == 0x000018, "Wrong size on FS_BattleRewards");
static_assert(offsetof(FS_BattleRewards, ExperienceGained_2_9AE2AB5A49976A49198F5D955D679CB2) == 0x000000, "Member 'FS_BattleRewards::ExperienceGained_2_9AE2AB5A49976A49198F5D955D679CB2' has a wrong offset!");
static_assert(offsetof(FS_BattleRewards, GoldAcquired_4_73DF911B4B475A41BF741BB2F41F2DCC) == 0x000004, "Member 'FS_BattleRewards::GoldAcquired_4_73DF911B4B475A41BF741BB2F41F2DCC' has a wrong offset!");
static_assert(offsetof(FS_BattleRewards, RolledLootEntries_12_64C7AB394C92E36998E1CAB6944CA883) == 0x000008, "Member 'FS_BattleRewards::RolledLootEntries_12_64C7AB394C92E36998E1CAB6944CA883' has a wrong offset!");

}

