#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_CleasTowerBattle

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct S_CleasTowerBattle.S_CleasTowerBattle
// 0x001C (0x001C - 0x0000)
struct FS_CleasTowerBattle final
{
public:
	class FName                                   BattleName_2_9DF807C14B32580258C4259D07901AD1;     // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Battle_EncounterRow_4_5152DA91472277550160E9B4927DF512; // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   LevelToLoad_15_51340D2C44CCEE20D3C56A86773B101A;   // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BattleIndex_23_6F5193734EC8977357AFC6B3E9715B2E;   // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FS_CleasTowerBattle) == 0x000004, "Wrong alignment on FS_CleasTowerBattle");
static_assert(sizeof(FS_CleasTowerBattle) == 0x00001C, "Wrong size on FS_CleasTowerBattle");
static_assert(offsetof(FS_CleasTowerBattle, BattleName_2_9DF807C14B32580258C4259D07901AD1) == 0x000000, "Member 'FS_CleasTowerBattle::BattleName_2_9DF807C14B32580258C4259D07901AD1' has a wrong offset!");
static_assert(offsetof(FS_CleasTowerBattle, Battle_EncounterRow_4_5152DA91472277550160E9B4927DF512) == 0x000008, "Member 'FS_CleasTowerBattle::Battle_EncounterRow_4_5152DA91472277550160E9B4927DF512' has a wrong offset!");
static_assert(offsetof(FS_CleasTowerBattle, LevelToLoad_15_51340D2C44CCEE20D3C56A86773B101A) == 0x000010, "Member 'FS_CleasTowerBattle::LevelToLoad_15_51340D2C44CCEE20D3C56A86773B101A' has a wrong offset!");
static_assert(offsetof(FS_CleasTowerBattle, BattleIndex_23_6F5193734EC8977357AFC6B3E9715B2E) == 0x000018, "Member 'FS_CleasTowerBattle::BattleIndex_23_6F5193734EC8977357AFC6B3E9715B2E' has a wrong offset!");

}

