#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_DialogueParameters

#include "Basic.hpp"

#include "E_CharacterList_structs.hpp"


namespace SDK
{

// UserDefinedStruct S_DialogueParameters.S_DialogueParameters
// 0x0008 (0x0008 - 0x0000)
struct FS_DialogueParameters final
{
public:
	int32                                         ForcedDialogueStage_10_B89CD7564A8FB456779FB384B09D300D; // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShouldTeleportCharacter_16_E223CDEA41F36AE8D9A83688653D4AAD; // 0x0004(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseDialogCameras_15_D88B2D884849450BB31F7583511E80B5; // 0x0005(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_CharacterList                               ForceCharacterWorld_19_44D0D9B0478E0DA302912AA3E4A325ED; // 0x0006(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FS_DialogueParameters) == 0x000004, "Wrong alignment on FS_DialogueParameters");
static_assert(sizeof(FS_DialogueParameters) == 0x000008, "Wrong size on FS_DialogueParameters");
static_assert(offsetof(FS_DialogueParameters, ForcedDialogueStage_10_B89CD7564A8FB456779FB384B09D300D) == 0x000000, "Member 'FS_DialogueParameters::ForcedDialogueStage_10_B89CD7564A8FB456779FB384B09D300D' has a wrong offset!");
static_assert(offsetof(FS_DialogueParameters, ShouldTeleportCharacter_16_E223CDEA41F36AE8D9A83688653D4AAD) == 0x000004, "Member 'FS_DialogueParameters::ShouldTeleportCharacter_16_E223CDEA41F36AE8D9A83688653D4AAD' has a wrong offset!");
static_assert(offsetof(FS_DialogueParameters, UseDialogCameras_15_D88B2D884849450BB31F7583511E80B5) == 0x000005, "Member 'FS_DialogueParameters::UseDialogCameras_15_D88B2D884849450BB31F7583511E80B5' has a wrong offset!");
static_assert(offsetof(FS_DialogueParameters, ForceCharacterWorld_19_44D0D9B0478E0DA302912AA3E4A325ED) == 0x000006, "Member 'FS_DialogueParameters::ForceCharacterWorld_19_44D0D9B0478E0DA302912AA3E4A325ED' has a wrong offset!");

}

