#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_EnemyScalingMultipliers

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct S_EnemyScalingMultipliers.S_EnemyScalingMultipliers
// 0x0058 (0x0058 - 0x0000)
struct FS_EnemyScalingMultipliers final
{
public:
	double                                        HP_2_9B8F0EF14EBC6DBDE30E86A7FFE48646;             // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        PhysicalAttack_4_82A69E334B7A1E723084829AFCCEAA25; // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        PhysicalDefense_6_F610675445A2768C30612FBAB57F46DE; // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MagicalAttack_8_653EB84143B61538EFE2F1BE21539BC7;  // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MagicalDefense_10_5972F1F24C89F844C3B6DEBF6AE09DD0; // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Mastery_12_6E8B50B847CAA10796C547931DA5B71F;       // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Accuracy_14_75BBC9AE40CCAAD4B40F23983475A0D8;      // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Speed_16_FC80E04941CF184AEFA369950419F557;         // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CriticalChance_18_29F8B957479C0D953C447E95FF3492E4; // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Chroma_21_6C260F8F48BCE6E6C43C568C38941012;        // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Experience_23_BEE8A0DD4ED59C6C6782B88443AB9AE8;    // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FS_EnemyScalingMultipliers) == 0x000008, "Wrong alignment on FS_EnemyScalingMultipliers");
static_assert(sizeof(FS_EnemyScalingMultipliers) == 0x000058, "Wrong size on FS_EnemyScalingMultipliers");
static_assert(offsetof(FS_EnemyScalingMultipliers, HP_2_9B8F0EF14EBC6DBDE30E86A7FFE48646) == 0x000000, "Member 'FS_EnemyScalingMultipliers::HP_2_9B8F0EF14EBC6DBDE30E86A7FFE48646' has a wrong offset!");
static_assert(offsetof(FS_EnemyScalingMultipliers, PhysicalAttack_4_82A69E334B7A1E723084829AFCCEAA25) == 0x000008, "Member 'FS_EnemyScalingMultipliers::PhysicalAttack_4_82A69E334B7A1E723084829AFCCEAA25' has a wrong offset!");
static_assert(offsetof(FS_EnemyScalingMultipliers, PhysicalDefense_6_F610675445A2768C30612FBAB57F46DE) == 0x000010, "Member 'FS_EnemyScalingMultipliers::PhysicalDefense_6_F610675445A2768C30612FBAB57F46DE' has a wrong offset!");
static_assert(offsetof(FS_EnemyScalingMultipliers, MagicalAttack_8_653EB84143B61538EFE2F1BE21539BC7) == 0x000018, "Member 'FS_EnemyScalingMultipliers::MagicalAttack_8_653EB84143B61538EFE2F1BE21539BC7' has a wrong offset!");
static_assert(offsetof(FS_EnemyScalingMultipliers, MagicalDefense_10_5972F1F24C89F844C3B6DEBF6AE09DD0) == 0x000020, "Member 'FS_EnemyScalingMultipliers::MagicalDefense_10_5972F1F24C89F844C3B6DEBF6AE09DD0' has a wrong offset!");
static_assert(offsetof(FS_EnemyScalingMultipliers, Mastery_12_6E8B50B847CAA10796C547931DA5B71F) == 0x000028, "Member 'FS_EnemyScalingMultipliers::Mastery_12_6E8B50B847CAA10796C547931DA5B71F' has a wrong offset!");
static_assert(offsetof(FS_EnemyScalingMultipliers, Accuracy_14_75BBC9AE40CCAAD4B40F23983475A0D8) == 0x000030, "Member 'FS_EnemyScalingMultipliers::Accuracy_14_75BBC9AE40CCAAD4B40F23983475A0D8' has a wrong offset!");
static_assert(offsetof(FS_EnemyScalingMultipliers, Speed_16_FC80E04941CF184AEFA369950419F557) == 0x000038, "Member 'FS_EnemyScalingMultipliers::Speed_16_FC80E04941CF184AEFA369950419F557' has a wrong offset!");
static_assert(offsetof(FS_EnemyScalingMultipliers, CriticalChance_18_29F8B957479C0D953C447E95FF3492E4) == 0x000040, "Member 'FS_EnemyScalingMultipliers::CriticalChance_18_29F8B957479C0D953C447E95FF3492E4' has a wrong offset!");
static_assert(offsetof(FS_EnemyScalingMultipliers, Chroma_21_6C260F8F48BCE6E6C43C568C38941012) == 0x000048, "Member 'FS_EnemyScalingMultipliers::Chroma_21_6C260F8F48BCE6E6C43C568C38941012' has a wrong offset!");
static_assert(offsetof(FS_EnemyScalingMultipliers, Experience_23_BEE8A0DD4ED59C6C6782B88443AB9AE8) == 0x000050, "Member 'FS_EnemyScalingMultipliers::Experience_23_BEE8A0DD4ED59C6C6782B88443AB9AE8' has a wrong offset!");

}

