#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_GameFlowTransitionState

#include "Basic.hpp"

#include "S_GameFlowTransitionType_structs.hpp"
#include "E_GameFlowTransitionPhase_structs.hpp"


namespace SDK
{

// UserDefinedStruct S_GameFlowTransitionState.S_GameFlowTransitionState
// 0x0030 (0x0030 - 0x0000)
struct FS_GameFlowTransitionState final
{
public:
	ES_GameFlowTransitionType                     TransitionType_2_2B0A572C41FBB219ED2CBFA795CED2BC; // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        ElapsedTime_5_C0EF032345B376A5849FE3B27236DB96;    // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_GameFlowTransitionPhase                     Phase_15_1C16545047643ACAA5FA408FAAC6C153;         // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        FadeInDuration_20_38ACF1074D7D6A248ECAA3AC7196FD79; // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        FadeOutDuration_18_0DC2BFA2413FC26ACCA4A0B0319137AE; // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsHoldManually_10_7EBEF13D410C76D8C85F5B8E08FF9802; // 0x0028(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FS_GameFlowTransitionState) == 0x000008, "Wrong alignment on FS_GameFlowTransitionState");
static_assert(sizeof(FS_GameFlowTransitionState) == 0x000030, "Wrong size on FS_GameFlowTransitionState");
static_assert(offsetof(FS_GameFlowTransitionState, TransitionType_2_2B0A572C41FBB219ED2CBFA795CED2BC) == 0x000000, "Member 'FS_GameFlowTransitionState::TransitionType_2_2B0A572C41FBB219ED2CBFA795CED2BC' has a wrong offset!");
static_assert(offsetof(FS_GameFlowTransitionState, ElapsedTime_5_C0EF032345B376A5849FE3B27236DB96) == 0x000008, "Member 'FS_GameFlowTransitionState::ElapsedTime_5_C0EF032345B376A5849FE3B27236DB96' has a wrong offset!");
static_assert(offsetof(FS_GameFlowTransitionState, Phase_15_1C16545047643ACAA5FA408FAAC6C153) == 0x000010, "Member 'FS_GameFlowTransitionState::Phase_15_1C16545047643ACAA5FA408FAAC6C153' has a wrong offset!");
static_assert(offsetof(FS_GameFlowTransitionState, FadeInDuration_20_38ACF1074D7D6A248ECAA3AC7196FD79) == 0x000018, "Member 'FS_GameFlowTransitionState::FadeInDuration_20_38ACF1074D7D6A248ECAA3AC7196FD79' has a wrong offset!");
static_assert(offsetof(FS_GameFlowTransitionState, FadeOutDuration_18_0DC2BFA2413FC26ACCA4A0B0319137AE) == 0x000020, "Member 'FS_GameFlowTransitionState::FadeOutDuration_18_0DC2BFA2413FC26ACCA4A0B0319137AE' has a wrong offset!");
static_assert(offsetof(FS_GameFlowTransitionState, IsHoldManually_10_7EBEF13D410C76D8C85F5B8E08FF9802) == 0x000028, "Member 'FS_GameFlowTransitionState::IsHoldManually_10_7EBEF13D410C76D8C85F5B8E08FF9802' has a wrong offset!");

}

