#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_GearScalingLevel

#include "Basic.hpp"

#include "E_jRPG_StatType_structs.hpp"


namespace SDK
{

// UserDefinedStruct S_GearScalingLevel.S_GearScalingLevel
// 0x0060 (0x0060 - 0x0000)
struct FS_GearScalingLevel final
{
public:
	int32                                         Level_2_90763A154CD780355ABBC89C3E42BD18;          // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<E_jRPG_StatType, double>                 Stats_19_14AC0B3B43D586575C5433A630321A61;         // 0x0008(0x0050)(Edit, BlueprintVisible)
	int32                                         ChromaValue_4_4072CA3C43CB6F0444C1DA8A5430C960;    // 0x0058(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FS_GearScalingLevel) == 0x000008, "Wrong alignment on FS_GearScalingLevel");
static_assert(sizeof(FS_GearScalingLevel) == 0x000060, "Wrong size on FS_GearScalingLevel");
static_assert(offsetof(FS_GearScalingLevel, Level_2_90763A154CD780355ABBC89C3E42BD18) == 0x000000, "Member 'FS_GearScalingLevel::Level_2_90763A154CD780355ABBC89C3E42BD18' has a wrong offset!");
static_assert(offsetof(FS_GearScalingLevel, Stats_19_14AC0B3B43D586575C5433A630321A61) == 0x000008, "Member 'FS_GearScalingLevel::Stats_19_14AC0B3B43D586575C5433A630321A61' has a wrong offset!");
static_assert(offsetof(FS_GearScalingLevel, ChromaValue_4_4072CA3C43CB6F0444C1DA8A5430C960) == 0x000058, "Member 'FS_GearScalingLevel::ChromaValue_4_4072CA3C43CB6F0444C1DA8A5430C960' has a wrong offset!");

}

