#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_InputBindingParameters

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK
{

// UserDefinedStruct S_InputBindingParameters.S_InputBindingParameters
// 0x0028 (0x0028 - 0x0000)
struct FS_InputBindingParameters final
{
public:
	class UInputMappingContext*                   InputMappingContext_11_8CB4B38544DB3A6147906DAB059CBEFF; // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInputAction*                           EnhancedInputAction_2_8E702A284A9A046F8E0F83A9C4B8D059; // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FDataTableRowHandle                    CommonUIInputAction_5_5399585D4044F846087A589ED8B1E439; // 0x0010(0x0010)(Edit, BlueprintVisible, NoDestructor)
	class FName                                   LegacyInputAction_8_0EE949AF4A77F0B673FA8190DBBD6AB2; // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FS_InputBindingParameters) == 0x000008, "Wrong alignment on FS_InputBindingParameters");
static_assert(sizeof(FS_InputBindingParameters) == 0x000028, "Wrong size on FS_InputBindingParameters");
static_assert(offsetof(FS_InputBindingParameters, InputMappingContext_11_8CB4B38544DB3A6147906DAB059CBEFF) == 0x000000, "Member 'FS_InputBindingParameters::InputMappingContext_11_8CB4B38544DB3A6147906DAB059CBEFF' has a wrong offset!");
static_assert(offsetof(FS_InputBindingParameters, EnhancedInputAction_2_8E702A284A9A046F8E0F83A9C4B8D059) == 0x000008, "Member 'FS_InputBindingParameters::EnhancedInputAction_2_8E702A284A9A046F8E0F83A9C4B8D059' has a wrong offset!");
static_assert(offsetof(FS_InputBindingParameters, CommonUIInputAction_5_5399585D4044F846087A589ED8B1E439) == 0x000010, "Member 'FS_InputBindingParameters::CommonUIInputAction_5_5399585D4044F846087A589ED8B1E439' has a wrong offset!");
static_assert(offsetof(FS_InputBindingParameters, LegacyInputAction_8_0EE949AF4A77F0B673FA8190DBBD6AB2) == 0x000020, "Member 'FS_InputBindingParameters::LegacyInputAction_8_0EE949AF4A77F0B673FA8190DBBD6AB2' has a wrong offset!");

}

