#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_jRPG_CharacterSaveState

#include "Basic.hpp"

#include "S_CharacterCustomizationItemData_structs.hpp"
#include "FEquipmentSlot_structs.hpp"
#include "FPassiveEffectProgression_structs.hpp"
#include "ECharacterAttribute_structs.hpp"


namespace SDK
{

// UserDefinedStruct S_jRPG_CharacterSaveState.S_jRPG_CharacterSaveState
// 0x01C0 (0x01C0 - 0x0000)
struct FS_jRPG_CharacterSaveState final
{
public:
	class FName                                   CharacterHardcodedName_36_FB9BA9294D02CFB5AD3668B0C4FD85A5; // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentLevel_49_97AB711D48E18088A93C8DADFD96F854;  // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentExperience_9_F9C772C9454408DBD6E1269409F37747; // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AvailableActionPoints_103_25B963504066FA8FD1210890DD45C001; // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CurrentHP_56_2DE67B0A46F5E28BCD6D3CB6D6A88B32;     // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CurrentMP_57_41D543664CC0A23407A2D4B4D32029F6;     // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<class FName, int32>                      CharacterActions_113_D080F16E432739A28E50959EABF1EEB0; // 0x0028(0x0050)(Edit, BlueprintVisible)
	TArray<class FName>                           CharacterActionsOrder_151_4F0BD1CF4D6D664017CE0CAAF2C1F1FC; // 0x0078(0x0010)(Edit, BlueprintVisible)
	TMap<class FName, struct FFPassiveEffectProgression> PassiveEffectProgressions_179_EB0DD7D2437EFED3D549E5BB92A5FF4E; // 0x0088(0x0050)(Edit, BlueprintVisible)
	TArray<class FName>                           EquippedPassiveEffects_176_BE669BB547A1E730FDBF5AB2F0675853; // 0x00D8(0x0010)(Edit, BlueprintVisible)
	TMap<struct FFEquipmentSlot, class FName>     EquippedItemsPerSlot_183_3B9D37B549426C770DB5E5BE821896E9; // 0x00E8(0x0050)(Edit, BlueprintVisible)
	TMap<ECharacterAttribute, int32>              AssignedAttributePoints_190_4E4BA51441F1E8D8E07ECA95442E0B7E; // 0x0138(0x0050)(Edit, BlueprintVisible)
	TArray<class FName>                           UnlockedSkills_197_FAA1BD934F68CFC542FB048E3C0F3592; // 0x0188(0x0010)(Edit, BlueprintVisible)
	TArray<class FName>                           EquippedSkills_201_05B6B5E9490E2586B23751B11CDA521F; // 0x0198(0x0010)(Edit, BlueprintVisible)
	struct FS_CharacterCustomizationItemData      CharacterCustomization_204_6208BA0E4E743356022DAEB14D88C37C; // 0x01A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsExcluded_206_5D433A504D71F6A2FC9057945C23DDFB;   // 0x01B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B9[0x3];                                      // 0x01B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         LuminaFromConsumables_210_7CAC193144F82258C6A89BB09BB1D226; // 0x01BC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FS_jRPG_CharacterSaveState) == 0x000008, "Wrong alignment on FS_jRPG_CharacterSaveState");
static_assert(sizeof(FS_jRPG_CharacterSaveState) == 0x0001C0, "Wrong size on FS_jRPG_CharacterSaveState");
static_assert(offsetof(FS_jRPG_CharacterSaveState, CharacterHardcodedName_36_FB9BA9294D02CFB5AD3668B0C4FD85A5) == 0x000000, "Member 'FS_jRPG_CharacterSaveState::CharacterHardcodedName_36_FB9BA9294D02CFB5AD3668B0C4FD85A5' has a wrong offset!");
static_assert(offsetof(FS_jRPG_CharacterSaveState, CurrentLevel_49_97AB711D48E18088A93C8DADFD96F854) == 0x000008, "Member 'FS_jRPG_CharacterSaveState::CurrentLevel_49_97AB711D48E18088A93C8DADFD96F854' has a wrong offset!");
static_assert(offsetof(FS_jRPG_CharacterSaveState, CurrentExperience_9_F9C772C9454408DBD6E1269409F37747) == 0x00000C, "Member 'FS_jRPG_CharacterSaveState::CurrentExperience_9_F9C772C9454408DBD6E1269409F37747' has a wrong offset!");
static_assert(offsetof(FS_jRPG_CharacterSaveState, AvailableActionPoints_103_25B963504066FA8FD1210890DD45C001) == 0x000010, "Member 'FS_jRPG_CharacterSaveState::AvailableActionPoints_103_25B963504066FA8FD1210890DD45C001' has a wrong offset!");
static_assert(offsetof(FS_jRPG_CharacterSaveState, CurrentHP_56_2DE67B0A46F5E28BCD6D3CB6D6A88B32) == 0x000018, "Member 'FS_jRPG_CharacterSaveState::CurrentHP_56_2DE67B0A46F5E28BCD6D3CB6D6A88B32' has a wrong offset!");
static_assert(offsetof(FS_jRPG_CharacterSaveState, CurrentMP_57_41D543664CC0A23407A2D4B4D32029F6) == 0x000020, "Member 'FS_jRPG_CharacterSaveState::CurrentMP_57_41D543664CC0A23407A2D4B4D32029F6' has a wrong offset!");
static_assert(offsetof(FS_jRPG_CharacterSaveState, CharacterActions_113_D080F16E432739A28E50959EABF1EEB0) == 0x000028, "Member 'FS_jRPG_CharacterSaveState::CharacterActions_113_D080F16E432739A28E50959EABF1EEB0' has a wrong offset!");
static_assert(offsetof(FS_jRPG_CharacterSaveState, CharacterActionsOrder_151_4F0BD1CF4D6D664017CE0CAAF2C1F1FC) == 0x000078, "Member 'FS_jRPG_CharacterSaveState::CharacterActionsOrder_151_4F0BD1CF4D6D664017CE0CAAF2C1F1FC' has a wrong offset!");
static_assert(offsetof(FS_jRPG_CharacterSaveState, PassiveEffectProgressions_179_EB0DD7D2437EFED3D549E5BB92A5FF4E) == 0x000088, "Member 'FS_jRPG_CharacterSaveState::PassiveEffectProgressions_179_EB0DD7D2437EFED3D549E5BB92A5FF4E' has a wrong offset!");
static_assert(offsetof(FS_jRPG_CharacterSaveState, EquippedPassiveEffects_176_BE669BB547A1E730FDBF5AB2F0675853) == 0x0000D8, "Member 'FS_jRPG_CharacterSaveState::EquippedPassiveEffects_176_BE669BB547A1E730FDBF5AB2F0675853' has a wrong offset!");
static_assert(offsetof(FS_jRPG_CharacterSaveState, EquippedItemsPerSlot_183_3B9D37B549426C770DB5E5BE821896E9) == 0x0000E8, "Member 'FS_jRPG_CharacterSaveState::EquippedItemsPerSlot_183_3B9D37B549426C770DB5E5BE821896E9' has a wrong offset!");
static_assert(offsetof(FS_jRPG_CharacterSaveState, AssignedAttributePoints_190_4E4BA51441F1E8D8E07ECA95442E0B7E) == 0x000138, "Member 'FS_jRPG_CharacterSaveState::AssignedAttributePoints_190_4E4BA51441F1E8D8E07ECA95442E0B7E' has a wrong offset!");
static_assert(offsetof(FS_jRPG_CharacterSaveState, UnlockedSkills_197_FAA1BD934F68CFC542FB048E3C0F3592) == 0x000188, "Member 'FS_jRPG_CharacterSaveState::UnlockedSkills_197_FAA1BD934F68CFC542FB048E3C0F3592' has a wrong offset!");
static_assert(offsetof(FS_jRPG_CharacterSaveState, EquippedSkills_201_05B6B5E9490E2586B23751B11CDA521F) == 0x000198, "Member 'FS_jRPG_CharacterSaveState::EquippedSkills_201_05B6B5E9490E2586B23751B11CDA521F' has a wrong offset!");
static_assert(offsetof(FS_jRPG_CharacterSaveState, CharacterCustomization_204_6208BA0E4E743356022DAEB14D88C37C) == 0x0001A8, "Member 'FS_jRPG_CharacterSaveState::CharacterCustomization_204_6208BA0E4E743356022DAEB14D88C37C' has a wrong offset!");
static_assert(offsetof(FS_jRPG_CharacterSaveState, IsExcluded_206_5D433A504D71F6A2FC9057945C23DDFB) == 0x0001B8, "Member 'FS_jRPG_CharacterSaveState::IsExcluded_206_5D433A504D71F6A2FC9057945C23DDFB' has a wrong offset!");
static_assert(offsetof(FS_jRPG_CharacterSaveState, LuminaFromConsumables_210_7CAC193144F82258C6A89BB09BB1D226) == 0x0001BC, "Member 'FS_jRPG_CharacterSaveState::LuminaFromConsumables_210_7CAC193144F82258C6A89BB09BB1D226' has a wrong offset!");

}

