#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_jRPG_OverdriveSource

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct S_jRPG_OverdriveSource.S_jRPG_OverdriveSource
// 0x0010 (0x0010 - 0x0000)
struct FS_jRPG_OverdriveSource final
{
public:
	float                                         OverdrivePerHitGiven_5_BEE65AFB4E807F6754B01BA1F72E5131; // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OverdrivePerHitReceived_6_C7FEA6EB4E449D131893659EE3DE697B; // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OverdriveOnOtherCharacterDeath_8_7F1BE3DF4FAB55B4DBD35A97929C6A2C; // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OverdriveOnEnemyKilled_10_B089EE8642C0B232D83FA0A80D31BBEA; // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FS_jRPG_OverdriveSource) == 0x000004, "Wrong alignment on FS_jRPG_OverdriveSource");
static_assert(sizeof(FS_jRPG_OverdriveSource) == 0x000010, "Wrong size on FS_jRPG_OverdriveSource");
static_assert(offsetof(FS_jRPG_OverdriveSource, OverdrivePerHitGiven_5_BEE65AFB4E807F6754B01BA1F72E5131) == 0x000000, "Member 'FS_jRPG_OverdriveSource::OverdrivePerHitGiven_5_BEE65AFB4E807F6754B01BA1F72E5131' has a wrong offset!");
static_assert(offsetof(FS_jRPG_OverdriveSource, OverdrivePerHitReceived_6_C7FEA6EB4E449D131893659EE3DE697B) == 0x000004, "Member 'FS_jRPG_OverdriveSource::OverdrivePerHitReceived_6_C7FEA6EB4E449D131893659EE3DE697B' has a wrong offset!");
static_assert(offsetof(FS_jRPG_OverdriveSource, OverdriveOnOtherCharacterDeath_8_7F1BE3DF4FAB55B4DBD35A97929C6A2C) == 0x000008, "Member 'FS_jRPG_OverdriveSource::OverdriveOnOtherCharacterDeath_8_7F1BE3DF4FAB55B4DBD35A97929C6A2C' has a wrong offset!");
static_assert(offsetof(FS_jRPG_OverdriveSource, OverdriveOnEnemyKilled_10_B089EE8642C0B232D83FA0A80D31BBEA) == 0x00000C, "Member 'FS_jRPG_OverdriveSource::OverdriveOnEnemyKilled_10_B089EE8642C0B232D83FA0A80D31BBEA' has a wrong offset!");

}

