#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_jRPG_Character_PortraitData

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct S_jRPG_Character_PortraitData.S_jRPG_Character_PortraitData
// 0x0028 (0x0028 - 0x0000)
struct FS_jRPG_Character_PortraitData final
{
public:
	class UTexture2D*                             Battle_Selected_7_057204594B825903F22566AC6B4D8C1A; // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Battle_Timeline_11_03BFEFC44C90CCBD5163AB9205FB8A81; // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      Battle_Dead_Material_17_BB8870D549AB296CE9FA3AB689CCC869; // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Battle_Hit_Texture_24_942830B74E79B1EA7AE078AE6B723E53; // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Battle_Low_Life_Texture_28_C1FF64624623728BD1ED09AA5DCD6A05; // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FS_jRPG_Character_PortraitData) == 0x000008, "Wrong alignment on FS_jRPG_Character_PortraitData");
static_assert(sizeof(FS_jRPG_Character_PortraitData) == 0x000028, "Wrong size on FS_jRPG_Character_PortraitData");
static_assert(offsetof(FS_jRPG_Character_PortraitData, Battle_Selected_7_057204594B825903F22566AC6B4D8C1A) == 0x000000, "Member 'FS_jRPG_Character_PortraitData::Battle_Selected_7_057204594B825903F22566AC6B4D8C1A' has a wrong offset!");
static_assert(offsetof(FS_jRPG_Character_PortraitData, Battle_Timeline_11_03BFEFC44C90CCBD5163AB9205FB8A81) == 0x000008, "Member 'FS_jRPG_Character_PortraitData::Battle_Timeline_11_03BFEFC44C90CCBD5163AB9205FB8A81' has a wrong offset!");
static_assert(offsetof(FS_jRPG_Character_PortraitData, Battle_Dead_Material_17_BB8870D549AB296CE9FA3AB689CCC869) == 0x000010, "Member 'FS_jRPG_Character_PortraitData::Battle_Dead_Material_17_BB8870D549AB296CE9FA3AB689CCC869' has a wrong offset!");
static_assert(offsetof(FS_jRPG_Character_PortraitData, Battle_Hit_Texture_24_942830B74E79B1EA7AE078AE6B723E53) == 0x000018, "Member 'FS_jRPG_Character_PortraitData::Battle_Hit_Texture_24_942830B74E79B1EA7AE078AE6B723E53' has a wrong offset!");
static_assert(offsetof(FS_jRPG_Character_PortraitData, Battle_Low_Life_Texture_28_C1FF64624623728BD1ED09AA5DCD6A05) == 0x000020, "Member 'FS_jRPG_Character_PortraitData::Battle_Low_Life_Texture_28_C1FF64624623728BD1ED09AA5DCD6A05' has a wrong offset!");

}

