#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_jRPG_Encounter

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK
{

// UserDefinedStruct S_jRPG_Encounter.S_jRPG_Encounter
// 0x0060 (0x0060 - 0x0000)
struct FS_jRPG_Encounter final
{
public:
	TMap<int32, struct FDataTableRowHandle>       Enemies_14_3D2609EC487DFDF67CB27FAC3F632728;       // 0x0000(0x0050)(Edit, BlueprintVisible)
	bool                                          FleeImpossible_13_2764B2B94142E1FC99C8A182A4BC0B06; // 0x0050(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         EncounterLevelOverride_17_FF0AA3B94D98F48F0541B8B7F8EC5A57; // 0x0054(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DisableCameraEndMovement_19_508A8A1D45CCD8697AD9F5A5C7444229; // 0x0058(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DisableReactionBattleLines_21_FB0F2FB047481CC64738E1A9C0D75BC4; // 0x0059(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsNarrativeBattle_23_C3BA36324CC3DEC332F6E4B049A535C9; // 0x005A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FS_jRPG_Encounter) == 0x000008, "Wrong alignment on FS_jRPG_Encounter");
static_assert(sizeof(FS_jRPG_Encounter) == 0x000060, "Wrong size on FS_jRPG_Encounter");
static_assert(offsetof(FS_jRPG_Encounter, Enemies_14_3D2609EC487DFDF67CB27FAC3F632728) == 0x000000, "Member 'FS_jRPG_Encounter::Enemies_14_3D2609EC487DFDF67CB27FAC3F632728' has a wrong offset!");
static_assert(offsetof(FS_jRPG_Encounter, FleeImpossible_13_2764B2B94142E1FC99C8A182A4BC0B06) == 0x000050, "Member 'FS_jRPG_Encounter::FleeImpossible_13_2764B2B94142E1FC99C8A182A4BC0B06' has a wrong offset!");
static_assert(offsetof(FS_jRPG_Encounter, EncounterLevelOverride_17_FF0AA3B94D98F48F0541B8B7F8EC5A57) == 0x000054, "Member 'FS_jRPG_Encounter::EncounterLevelOverride_17_FF0AA3B94D98F48F0541B8B7F8EC5A57' has a wrong offset!");
static_assert(offsetof(FS_jRPG_Encounter, DisableCameraEndMovement_19_508A8A1D45CCD8697AD9F5A5C7444229) == 0x000058, "Member 'FS_jRPG_Encounter::DisableCameraEndMovement_19_508A8A1D45CCD8697AD9F5A5C7444229' has a wrong offset!");
static_assert(offsetof(FS_jRPG_Encounter, DisableReactionBattleLines_21_FB0F2FB047481CC64738E1A9C0D75BC4) == 0x000059, "Member 'FS_jRPG_Encounter::DisableReactionBattleLines_21_FB0F2FB047481CC64738E1A9C0D75BC4' has a wrong offset!");
static_assert(offsetof(FS_jRPG_Encounter, IsNarrativeBattle_23_C3BA36324CC3DEC332F6E4B049A535C9) == 0x00005A, "Member 'FS_jRPG_Encounter::IsNarrativeBattle_23_C3BA36324CC3DEC332F6E4B049A535C9' has a wrong offset!");

}

