#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_jRPG_Action

#include "Basic.hpp"

#include "E_jRPG_SpeedModifier_structs.hpp"
#include "E_jRPG_ActionType_structs.hpp"
#include "S_jRPG_WeaponUnlock_structs.hpp"
#include "E_jRPG_TargetingType_structs.hpp"


namespace SDK
{

// UserDefinedStruct S_jRPG_Action.S_jRPG_Action
// 0x0100 (0x0100 - 0x0000)
struct FS_jRPG_Action final
{
public:
	E_jRPG_ActionType                             ActionType_25_9C90134C434928F9E93F85BC6A22CD1E;    // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsSecondaryAction_28_2D69363142666982FEA87CAE1257CE91; // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   HardcodedName_4_0F310C1849AE79B80236E89B24F90803;  // 0x0004(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   DisplayName_5_625DFD5A419E4C6CC34A148337F3099D;    // 0x0010(0x0010)(Edit, BlueprintVisible)
	class FText                                   Description_12_2565638845A7B077F1BAD3B22D427B93;   // 0x0020(0x0010)(Edit, BlueprintVisible)
	class FText                                   ShortDescription_57_D4FBAAA344332D80F1971FAE78267B80; // 0x0030(0x0010)(Edit, BlueprintVisible)
	int32                                         MaxLevel_8_320EEEE84F089F005EA777B6B085A91A;       // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        BaseCostMP_14_8BC6BCB847EDD6F5BEBB59983D6C49DF;    // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        BaseCostHP_16_F7E9DCAB45527F7E11F72BAA08A1446F;    // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        PerLevelCostMP_18_9619CEBE40DD71ACBFAA01AA81A20412; // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        PerLevelCostHP_22_BD1F284B4D7417072C0F9F8DDE9F30A8; // 0x0060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_jRPG_WeaponUnlock                   UnlockSkillWithWeapon_31_154D6DB440DB5A28EB8BD28A6F879A14; // 0x0068(0x0050)(Edit, BlueprintVisible, HasGetValueTypeHash)
	E_jRPG_SpeedModifier                          TargetSpeedModifier_34_5AB3CC8147E40A0B8FA8BCB56DAF1C05; // 0x00B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         TargetSpeedModifierDuration_41_DD9D45804C305783F5C71888257D8C6C; // 0x00BC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         StunTurnsDuration_38_BE8B355146F527B4536985A86012150A; // 0x00C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_jRPG_TargetingType                          TargetingType_44_F63AD57046A0E412316800B110CCC900; // 0x00C4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C5[0x3];                                       // 0x00C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UBP_BattleAction_DataAsset_C*>   ActionData_50_14ACFCE64359635814ABA2930F303E9B;    // 0x00C8(0x0010)(Edit, BlueprintVisible)
	TSoftClassPtr<class UClass>                   SkillDefinition_54_0455375146D6D4B16646399E7C6BB64C; // 0x00D8(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
};
static_assert(alignof(FS_jRPG_Action) == 0x000008, "Wrong alignment on FS_jRPG_Action");
static_assert(sizeof(FS_jRPG_Action) == 0x000100, "Wrong size on FS_jRPG_Action");
static_assert(offsetof(FS_jRPG_Action, ActionType_25_9C90134C434928F9E93F85BC6A22CD1E) == 0x000000, "Member 'FS_jRPG_Action::ActionType_25_9C90134C434928F9E93F85BC6A22CD1E' has a wrong offset!");
static_assert(offsetof(FS_jRPG_Action, IsSecondaryAction_28_2D69363142666982FEA87CAE1257CE91) == 0x000001, "Member 'FS_jRPG_Action::IsSecondaryAction_28_2D69363142666982FEA87CAE1257CE91' has a wrong offset!");
static_assert(offsetof(FS_jRPG_Action, HardcodedName_4_0F310C1849AE79B80236E89B24F90803) == 0x000004, "Member 'FS_jRPG_Action::HardcodedName_4_0F310C1849AE79B80236E89B24F90803' has a wrong offset!");
static_assert(offsetof(FS_jRPG_Action, DisplayName_5_625DFD5A419E4C6CC34A148337F3099D) == 0x000010, "Member 'FS_jRPG_Action::DisplayName_5_625DFD5A419E4C6CC34A148337F3099D' has a wrong offset!");
static_assert(offsetof(FS_jRPG_Action, Description_12_2565638845A7B077F1BAD3B22D427B93) == 0x000020, "Member 'FS_jRPG_Action::Description_12_2565638845A7B077F1BAD3B22D427B93' has a wrong offset!");
static_assert(offsetof(FS_jRPG_Action, ShortDescription_57_D4FBAAA344332D80F1971FAE78267B80) == 0x000030, "Member 'FS_jRPG_Action::ShortDescription_57_D4FBAAA344332D80F1971FAE78267B80' has a wrong offset!");
static_assert(offsetof(FS_jRPG_Action, MaxLevel_8_320EEEE84F089F005EA777B6B085A91A) == 0x000040, "Member 'FS_jRPG_Action::MaxLevel_8_320EEEE84F089F005EA777B6B085A91A' has a wrong offset!");
static_assert(offsetof(FS_jRPG_Action, BaseCostMP_14_8BC6BCB847EDD6F5BEBB59983D6C49DF) == 0x000048, "Member 'FS_jRPG_Action::BaseCostMP_14_8BC6BCB847EDD6F5BEBB59983D6C49DF' has a wrong offset!");
static_assert(offsetof(FS_jRPG_Action, BaseCostHP_16_F7E9DCAB45527F7E11F72BAA08A1446F) == 0x000050, "Member 'FS_jRPG_Action::BaseCostHP_16_F7E9DCAB45527F7E11F72BAA08A1446F' has a wrong offset!");
static_assert(offsetof(FS_jRPG_Action, PerLevelCostMP_18_9619CEBE40DD71ACBFAA01AA81A20412) == 0x000058, "Member 'FS_jRPG_Action::PerLevelCostMP_18_9619CEBE40DD71ACBFAA01AA81A20412' has a wrong offset!");
static_assert(offsetof(FS_jRPG_Action, PerLevelCostHP_22_BD1F284B4D7417072C0F9F8DDE9F30A8) == 0x000060, "Member 'FS_jRPG_Action::PerLevelCostHP_22_BD1F284B4D7417072C0F9F8DDE9F30A8' has a wrong offset!");
static_assert(offsetof(FS_jRPG_Action, UnlockSkillWithWeapon_31_154D6DB440DB5A28EB8BD28A6F879A14) == 0x000068, "Member 'FS_jRPG_Action::UnlockSkillWithWeapon_31_154D6DB440DB5A28EB8BD28A6F879A14' has a wrong offset!");
static_assert(offsetof(FS_jRPG_Action, TargetSpeedModifier_34_5AB3CC8147E40A0B8FA8BCB56DAF1C05) == 0x0000B8, "Member 'FS_jRPG_Action::TargetSpeedModifier_34_5AB3CC8147E40A0B8FA8BCB56DAF1C05' has a wrong offset!");
static_assert(offsetof(FS_jRPG_Action, TargetSpeedModifierDuration_41_DD9D45804C305783F5C71888257D8C6C) == 0x0000BC, "Member 'FS_jRPG_Action::TargetSpeedModifierDuration_41_DD9D45804C305783F5C71888257D8C6C' has a wrong offset!");
static_assert(offsetof(FS_jRPG_Action, StunTurnsDuration_38_BE8B355146F527B4536985A86012150A) == 0x0000C0, "Member 'FS_jRPG_Action::StunTurnsDuration_38_BE8B355146F527B4536985A86012150A' has a wrong offset!");
static_assert(offsetof(FS_jRPG_Action, TargetingType_44_F63AD57046A0E412316800B110CCC900) == 0x0000C4, "Member 'FS_jRPG_Action::TargetingType_44_F63AD57046A0E412316800B110CCC900' has a wrong offset!");
static_assert(offsetof(FS_jRPG_Action, ActionData_50_14ACFCE64359635814ABA2930F303E9B) == 0x0000C8, "Member 'FS_jRPG_Action::ActionData_50_14ACFCE64359635814ABA2930F303E9B' has a wrong offset!");
static_assert(offsetof(FS_jRPG_Action, SkillDefinition_54_0455375146D6D4B16646399E7C6BB64C) == 0x0000D8, "Member 'FS_jRPG_Action::SkillDefinition_54_0455375146D6D4B16646399E7C6BB64C' has a wrong offset!");

}

