#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_LoadGameRequest

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct S_LoadGameRequest.S_LoadGameRequest
// 0x0020 (0x0020 - 0x0000)
struct FS_LoadGameRequest final
{
public:
	class FString                                 SlotName_8_25B121D2426F67EB5FBFD692AE35F65A;       // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class UBP_SaveGameData_C*                     SaveGameData_14_A35060D4494EBBD3C09F299D189719AA;  // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_LatentAction_LoadGame_C*            LoadLatentAction_12_38B5189B4B6755BE8C10DE9B57C4EA2F; // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FS_LoadGameRequest) == 0x000008, "Wrong alignment on FS_LoadGameRequest");
static_assert(sizeof(FS_LoadGameRequest) == 0x000020, "Wrong size on FS_LoadGameRequest");
static_assert(offsetof(FS_LoadGameRequest, SlotName_8_25B121D2426F67EB5FBFD692AE35F65A) == 0x000000, "Member 'FS_LoadGameRequest::SlotName_8_25B121D2426F67EB5FBFD692AE35F65A' has a wrong offset!");
static_assert(offsetof(FS_LoadGameRequest, SaveGameData_14_A35060D4494EBBD3C09F299D189719AA) == 0x000010, "Member 'FS_LoadGameRequest::SaveGameData_14_A35060D4494EBBD3C09F299D189719AA' has a wrong offset!");
static_assert(offsetof(FS_LoadGameRequest, LoadLatentAction_12_38B5189B4B6755BE8C10DE9B57C4EA2F) == 0x000018, "Member 'FS_LoadGameRequest::LoadLatentAction_12_38B5189B4B6755BE8C10DE9B57C4EA2F' has a wrong offset!");

}

