#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_LookAtCameraParameters

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct S_LookAtCameraParameters.S_LookAtCameraParameters
// 0x0028 (0x0028 - 0x0000)
struct FS_LookAtCameraParameters final
{
public:
	double                                        SpringArmLength_2_420985EA4F7696CF4BF027A66736A5E3; // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SpringArmTargetOffset_5_18627D2243DFBEF3959D4AAB36F83961; // 0x0008(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        FieldOfView_8_5E1634D347F8258545020480100C80B1;    // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FS_LookAtCameraParameters) == 0x000008, "Wrong alignment on FS_LookAtCameraParameters");
static_assert(sizeof(FS_LookAtCameraParameters) == 0x000028, "Wrong size on FS_LookAtCameraParameters");
static_assert(offsetof(FS_LookAtCameraParameters, SpringArmLength_2_420985EA4F7696CF4BF027A66736A5E3) == 0x000000, "Member 'FS_LookAtCameraParameters::SpringArmLength_2_420985EA4F7696CF4BF027A66736A5E3' has a wrong offset!");
static_assert(offsetof(FS_LookAtCameraParameters, SpringArmTargetOffset_5_18627D2243DFBEF3959D4AAB36F83961) == 0x000008, "Member 'FS_LookAtCameraParameters::SpringArmTargetOffset_5_18627D2243DFBEF3959D4AAB36F83961' has a wrong offset!");
static_assert(offsetof(FS_LookAtCameraParameters, FieldOfView_8_5E1634D347F8258545020480100C80B1) == 0x000020, "Member 'FS_LookAtCameraParameters::FieldOfView_8_5E1634D347F8258545020480100C80B1' has a wrong offset!");

}

