#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_LootTableSection

#include "Basic.hpp"

#include "S_LootTableEntry_structs.hpp"


namespace SDK
{

// UserDefinedStruct S_LootTableSection.S_LootTableSection
// 0x0020 (0x0020 - 0x0000)
struct FS_LootTableSection final
{
public:
	int32                                         LevelRangeMin_4_B29308774CD00C1A52F8D79BA86F477B;  // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LevelRangeMax_5_F72AF1DC4BF48572B21360B7ADC22C17;  // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ChancePercent_10_D60438D64925BB0788FBFCB605B0518A; // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FS_LootTableEntry>              LootEntries_14_4A650E0F4C998FBA66B50DAEE60C253A;   // 0x0010(0x0010)(Edit, BlueprintVisible)
};
static_assert(alignof(FS_LootTableSection) == 0x000008, "Wrong alignment on FS_LootTableSection");
static_assert(sizeof(FS_LootTableSection) == 0x000020, "Wrong size on FS_LootTableSection");
static_assert(offsetof(FS_LootTableSection, LevelRangeMin_4_B29308774CD00C1A52F8D79BA86F477B) == 0x000000, "Member 'FS_LootTableSection::LevelRangeMin_4_B29308774CD00C1A52F8D79BA86F477B' has a wrong offset!");
static_assert(offsetof(FS_LootTableSection, LevelRangeMax_5_F72AF1DC4BF48572B21360B7ADC22C17) == 0x000004, "Member 'FS_LootTableSection::LevelRangeMax_5_F72AF1DC4BF48572B21360B7ADC22C17' has a wrong offset!");
static_assert(offsetof(FS_LootTableSection, ChancePercent_10_D60438D64925BB0788FBFCB605B0518A) == 0x000008, "Member 'FS_LootTableSection::ChancePercent_10_D60438D64925BB0788FBFCB605B0518A' has a wrong offset!");
static_assert(offsetof(FS_LootTableSection, LootEntries_14_4A650E0F4C998FBA66B50DAEE60C253A) == 0x000010, "Member 'FS_LootTableSection::LootEntries_14_4A650E0F4C998FBA66B50DAEE60C253A' has a wrong offset!");

}

