#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_MainQuestData

#include "Basic.hpp"

#include "E_MainQuest_Step_structs.hpp"
#include "SandFall_structs.hpp"
#include "E_CurrentAct_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// UserDefinedStruct S_MainQuestData.S_MainQuestData
// 0x0028 (0x0028 - 0x0000)
struct FS_MainQuestData final
{
public:
	struct FQuestObjectiveIdentifier              MainQuestObjective_2_F6AEC0DC46CDB378FF31C3960F32E89D; // 0x0000(0x0010)(Edit, BlueprintVisible, NoDestructor)
	E_CurrentAct                                  ActOnCompleted_7_4F98B8D84D9437A9E602C18F57EFAB3B; // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_MainQuest_Step                              StepOnCompleted_11_FA7125BF42F23381D620469E9E568C87; // 0x0011(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FGameplayTag>                   LevelIdentifiers_20_657D4CEF406F4F1EB2070CBEFC2C76AE; // 0x0018(0x0010)(Edit, BlueprintVisible)
};
static_assert(alignof(FS_MainQuestData) == 0x000008, "Wrong alignment on FS_MainQuestData");
static_assert(sizeof(FS_MainQuestData) == 0x000028, "Wrong size on FS_MainQuestData");
static_assert(offsetof(FS_MainQuestData, MainQuestObjective_2_F6AEC0DC46CDB378FF31C3960F32E89D) == 0x000000, "Member 'FS_MainQuestData::MainQuestObjective_2_F6AEC0DC46CDB378FF31C3960F32E89D' has a wrong offset!");
static_assert(offsetof(FS_MainQuestData, ActOnCompleted_7_4F98B8D84D9437A9E602C18F57EFAB3B) == 0x000010, "Member 'FS_MainQuestData::ActOnCompleted_7_4F98B8D84D9437A9E602C18F57EFAB3B' has a wrong offset!");
static_assert(offsetof(FS_MainQuestData, StepOnCompleted_11_FA7125BF42F23381D620469E9E568C87) == 0x000011, "Member 'FS_MainQuestData::StepOnCompleted_11_FA7125BF42F23381D620469E9E568C87' has a wrong offset!");
static_assert(offsetof(FS_MainQuestData, LevelIdentifiers_20_657D4CEF406F4F1EB2070CBEFC2C76AE) == 0x000018, "Member 'FS_MainQuestData::LevelIdentifiers_20_657D4CEF406F4F1EB2070CBEFC2C76AE' has a wrong offset!");

}

