#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_MerchantItemData

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct S_MerchantItemData.S_MerchantItemData
// 0x0020 (0x0020 - 0x0000)
struct FS_MerchantItemData final
{
public:
	class FName                                   ItemRowName_18_22FD2F5E42C1473FBA6AB9BF09E4890C;   // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PriceOverride_6_7DE9A0224D826DBF8CF033AD6077A4EE;  // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LevelOverride_8_A53457704B4D0037ECA806A29C727EF4;  // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Quantity_10_A62DFEDB41EF5DA12CE979AB3F742758;      // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UConditionCheckerDataAsset*             Condition_16_9C558A4A432BE6E507E838B0A75842DE;     // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FS_MerchantItemData) == 0x000008, "Wrong alignment on FS_MerchantItemData");
static_assert(sizeof(FS_MerchantItemData) == 0x000020, "Wrong size on FS_MerchantItemData");
static_assert(offsetof(FS_MerchantItemData, ItemRowName_18_22FD2F5E42C1473FBA6AB9BF09E4890C) == 0x000000, "Member 'FS_MerchantItemData::ItemRowName_18_22FD2F5E42C1473FBA6AB9BF09E4890C' has a wrong offset!");
static_assert(offsetof(FS_MerchantItemData, PriceOverride_6_7DE9A0224D826DBF8CF033AD6077A4EE) == 0x000008, "Member 'FS_MerchantItemData::PriceOverride_6_7DE9A0224D826DBF8CF033AD6077A4EE' has a wrong offset!");
static_assert(offsetof(FS_MerchantItemData, LevelOverride_8_A53457704B4D0037ECA806A29C727EF4) == 0x00000C, "Member 'FS_MerchantItemData::LevelOverride_8_A53457704B4D0037ECA806A29C727EF4' has a wrong offset!");
static_assert(offsetof(FS_MerchantItemData, Quantity_10_A62DFEDB41EF5DA12CE979AB3F742758) == 0x000010, "Member 'FS_MerchantItemData::Quantity_10_A62DFEDB41EF5DA12CE979AB3F742758' has a wrong offset!");
static_assert(offsetof(FS_MerchantItemData, Condition_16_9C558A4A432BE6E507E838B0A75842DE) == 0x000018, "Member 'FS_MerchantItemData::Condition_16_9C558A4A432BE6E507E838B0A75842DE' has a wrong offset!");

}

