#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_MerchantItemQueueData

#include "Basic.hpp"

#include "S_jRPG_Item_StaticData_structs.hpp"


namespace SDK
{

// UserDefinedStruct S_MerchantItemQueueData.S_MerchantItemQueueData
// 0x0138 (0x0138 - 0x0000)
struct FS_MerchantItemQueueData final
{
public:
	struct FS_jRPG_Item_StaticData                ItemStaticData_9_EBE61CEB4558A546CEC502AEC5DAEE39; // 0x0000(0x0130)(Edit, BlueprintVisible, ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         PreviousLevel_11_1B5902F943425760899336AC966140BF; // 0x0130(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentLevel_12_C06C71914956514107615C920F8A350D;  // 0x0134(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FS_MerchantItemQueueData) == 0x000008, "Wrong alignment on FS_MerchantItemQueueData");
static_assert(sizeof(FS_MerchantItemQueueData) == 0x000138, "Wrong size on FS_MerchantItemQueueData");
static_assert(offsetof(FS_MerchantItemQueueData, ItemStaticData_9_EBE61CEB4558A546CEC502AEC5DAEE39) == 0x000000, "Member 'FS_MerchantItemQueueData::ItemStaticData_9_EBE61CEB4558A546CEC502AEC5DAEE39' has a wrong offset!");
static_assert(offsetof(FS_MerchantItemQueueData, PreviousLevel_11_1B5902F943425760899336AC966140BF) == 0x000130, "Member 'FS_MerchantItemQueueData::PreviousLevel_11_1B5902F943425760899336AC966140BF' has a wrong offset!");
static_assert(offsetof(FS_MerchantItemQueueData, CurrentLevel_12_C06C71914956514107615C920F8A350D) == 0x000134, "Member 'FS_MerchantItemQueueData::CurrentLevel_12_C06C71914956514107615C920F8A350D' has a wrong offset!");

}

