#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_NPC_IdleListAndReaction

#include "Basic.hpp"

#include "E_NPC_Body_IdleType_structs.hpp"


namespace SDK
{

// UserDefinedStruct S_NPC_IdleListAndReaction.S_NPC_IdleListAndReaction
// 0x0038 (0x0038 - 0x0000)
struct FS_NPC_IdleListAndReaction final
{
public:
	E_NPC_Body_IdleType                           IdleStatus_6_A33A8D79412C1F7CEFD51F89BF764086;     // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequence*                          IdleAnim_19_5BECF48441CA1D2A64F31287D72D023B;      // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UAnimSequence*>                  RandomIdleTalkReaction_20_C6CE65754D18CD5521E02E87AC6AD5F2; // 0x0010(0x0010)(Edit, BlueprintVisible)
	TArray<class UAnimSequence*>                  RandomIdleVariation_21_B941400A425D7C3ADF30049071E4C0E3; // 0x0020(0x0010)(Edit, BlueprintVisible)
	double                                        BreathingAdditiveAlpha_18_02B6C356478BE42E5E3A98BCD9B95F95; // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FS_NPC_IdleListAndReaction) == 0x000008, "Wrong alignment on FS_NPC_IdleListAndReaction");
static_assert(sizeof(FS_NPC_IdleListAndReaction) == 0x000038, "Wrong size on FS_NPC_IdleListAndReaction");
static_assert(offsetof(FS_NPC_IdleListAndReaction, IdleStatus_6_A33A8D79412C1F7CEFD51F89BF764086) == 0x000000, "Member 'FS_NPC_IdleListAndReaction::IdleStatus_6_A33A8D79412C1F7CEFD51F89BF764086' has a wrong offset!");
static_assert(offsetof(FS_NPC_IdleListAndReaction, IdleAnim_19_5BECF48441CA1D2A64F31287D72D023B) == 0x000008, "Member 'FS_NPC_IdleListAndReaction::IdleAnim_19_5BECF48441CA1D2A64F31287D72D023B' has a wrong offset!");
static_assert(offsetof(FS_NPC_IdleListAndReaction, RandomIdleTalkReaction_20_C6CE65754D18CD5521E02E87AC6AD5F2) == 0x000010, "Member 'FS_NPC_IdleListAndReaction::RandomIdleTalkReaction_20_C6CE65754D18CD5521E02E87AC6AD5F2' has a wrong offset!");
static_assert(offsetof(FS_NPC_IdleListAndReaction, RandomIdleVariation_21_B941400A425D7C3ADF30049071E4C0E3) == 0x000020, "Member 'FS_NPC_IdleListAndReaction::RandomIdleVariation_21_B941400A425D7C3ADF30049071E4C0E3' has a wrong offset!");
static_assert(offsetof(FS_NPC_IdleListAndReaction, BreathingAdditiveAlpha_18_02B6C356478BE42E5E3A98BCD9B95F95) == 0x000030, "Member 'FS_NPC_IdleListAndReaction::BreathingAdditiveAlpha_18_02B6C356478BE42E5E3A98BCD9B95F95' has a wrong offset!");

}

