#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_NPCAnimations

#include "Basic.hpp"

#include "S_NPC_IdleListAndReaction_structs.hpp"
#include "E_SecondaryMotionBreathingType_structs.hpp"


namespace SDK
{

// UserDefinedStruct S_NPCAnimations.S_NPCAnimations
// 0x0058 (0x0058 - 0x0000)
struct FS_NPCAnimations final
{
public:
	class UAnimSequence*                          IdleBase_16_BD9D3B8C46E0BF4EA0F1B7B01D8A13DC;      // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          IdleTalking_15_F4A7FDEB4A364DB171F192AFF3060580;   // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          IdleToIdleTalking_10_C8ED6C76429BB1AACBFCF3AED5ACAB86; // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          IdleTalkingToIdle_11_E385050E41658BE5721C67AB834CFD79; // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBlendSpace1D*                          MovementBlendspace_14_5EE0A95B44D80F37883A699BBD2FC405; // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        IdlePlayRate_22_07EFDFE04D5D6F23B55F2B84A7E0E345;  // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DisableIK_24_AE5E52984BBFC470EE4B8DBADC992FB2;     // 0x0030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FS_NPC_IdleListAndReaction>     IdleListAndVariation_28_72DF959D446FB67694BD3FB43DC5F4CC; // 0x0038(0x0010)(Edit, BlueprintVisible)
	E_SecondaryMotionBreathingType                BreathingAdditive_31_F0F059F643BEC7D766A13581321BB0A8; // 0x0048(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        BreathingAlpha_34_4330071043ECD4CFE588A08AE6FA0C7A; // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FS_NPCAnimations) == 0x000008, "Wrong alignment on FS_NPCAnimations");
static_assert(sizeof(FS_NPCAnimations) == 0x000058, "Wrong size on FS_NPCAnimations");
static_assert(offsetof(FS_NPCAnimations, IdleBase_16_BD9D3B8C46E0BF4EA0F1B7B01D8A13DC) == 0x000000, "Member 'FS_NPCAnimations::IdleBase_16_BD9D3B8C46E0BF4EA0F1B7B01D8A13DC' has a wrong offset!");
static_assert(offsetof(FS_NPCAnimations, IdleTalking_15_F4A7FDEB4A364DB171F192AFF3060580) == 0x000008, "Member 'FS_NPCAnimations::IdleTalking_15_F4A7FDEB4A364DB171F192AFF3060580' has a wrong offset!");
static_assert(offsetof(FS_NPCAnimations, IdleToIdleTalking_10_C8ED6C76429BB1AACBFCF3AED5ACAB86) == 0x000010, "Member 'FS_NPCAnimations::IdleToIdleTalking_10_C8ED6C76429BB1AACBFCF3AED5ACAB86' has a wrong offset!");
static_assert(offsetof(FS_NPCAnimations, IdleTalkingToIdle_11_E385050E41658BE5721C67AB834CFD79) == 0x000018, "Member 'FS_NPCAnimations::IdleTalkingToIdle_11_E385050E41658BE5721C67AB834CFD79' has a wrong offset!");
static_assert(offsetof(FS_NPCAnimations, MovementBlendspace_14_5EE0A95B44D80F37883A699BBD2FC405) == 0x000020, "Member 'FS_NPCAnimations::MovementBlendspace_14_5EE0A95B44D80F37883A699BBD2FC405' has a wrong offset!");
static_assert(offsetof(FS_NPCAnimations, IdlePlayRate_22_07EFDFE04D5D6F23B55F2B84A7E0E345) == 0x000028, "Member 'FS_NPCAnimations::IdlePlayRate_22_07EFDFE04D5D6F23B55F2B84A7E0E345' has a wrong offset!");
static_assert(offsetof(FS_NPCAnimations, DisableIK_24_AE5E52984BBFC470EE4B8DBADC992FB2) == 0x000030, "Member 'FS_NPCAnimations::DisableIK_24_AE5E52984BBFC470EE4B8DBADC992FB2' has a wrong offset!");
static_assert(offsetof(FS_NPCAnimations, IdleListAndVariation_28_72DF959D446FB67694BD3FB43DC5F4CC) == 0x000038, "Member 'FS_NPCAnimations::IdleListAndVariation_28_72DF959D446FB67694BD3FB43DC5F4CC' has a wrong offset!");
static_assert(offsetof(FS_NPCAnimations, BreathingAdditive_31_F0F059F643BEC7D766A13581321BB0A8) == 0x000048, "Member 'FS_NPCAnimations::BreathingAdditive_31_F0F059F643BEC7D766A13581321BB0A8' has a wrong offset!");
static_assert(offsetof(FS_NPCAnimations, BreathingAlpha_34_4330071043ECD4CFE588A08AE6FA0C7A) == 0x000050, "Member 'FS_NPCAnimations::BreathingAlpha_34_4330071043ECD4CFE588A08AE6FA0C7A' has a wrong offset!");

}

