#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_PlaySoundParameters

#include "Basic.hpp"

#include "E_PlaySoundType_structs.hpp"
#include "S_SpawnSoundParameters_structs.hpp"


namespace SDK
{

// UserDefinedStruct S_PlaySoundParameters.S_PlaySoundParameters
// 0x0098 (0x0098 - 0x0000)
struct FS_PlaySoundParameters final
{
public:
	E_PlaySoundType                               SoundType_35_14E10792438285BA5CD761AB9CA0DE40;     // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             Sound_2_EC3526904159F8796012CBA99C07CA07;          // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        VolumeMultiplier_13_B4E0B8B345655E6D253295A2530A391E; // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        PitchMultiplier_15_9A1CE27344EC0E4ABEDA7F90CCC9A82A; // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        StartTime_17_1A8DE0F44E9234411E3EBD85CB80B27B;     // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundConcurrency*                      ConcurrencySettings_20_3CAC6AA1461F0A29E2A9DCB8B6D63134; // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FS_SpawnSoundParameters                SpawnParameters_34_FC89565F4B5E3A66F4F775B4052F57A7; // 0x0030(0x0060)(Edit, BlueprintVisible, HasGetValueTypeHash)
	bool                                          WaitForAudioToFinishGameAction_39_6C82685D47A0D6A6FB16DBA5FCC35F90; // 0x0090(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FS_PlaySoundParameters) == 0x000008, "Wrong alignment on FS_PlaySoundParameters");
static_assert(sizeof(FS_PlaySoundParameters) == 0x000098, "Wrong size on FS_PlaySoundParameters");
static_assert(offsetof(FS_PlaySoundParameters, SoundType_35_14E10792438285BA5CD761AB9CA0DE40) == 0x000000, "Member 'FS_PlaySoundParameters::SoundType_35_14E10792438285BA5CD761AB9CA0DE40' has a wrong offset!");
static_assert(offsetof(FS_PlaySoundParameters, Sound_2_EC3526904159F8796012CBA99C07CA07) == 0x000008, "Member 'FS_PlaySoundParameters::Sound_2_EC3526904159F8796012CBA99C07CA07' has a wrong offset!");
static_assert(offsetof(FS_PlaySoundParameters, VolumeMultiplier_13_B4E0B8B345655E6D253295A2530A391E) == 0x000010, "Member 'FS_PlaySoundParameters::VolumeMultiplier_13_B4E0B8B345655E6D253295A2530A391E' has a wrong offset!");
static_assert(offsetof(FS_PlaySoundParameters, PitchMultiplier_15_9A1CE27344EC0E4ABEDA7F90CCC9A82A) == 0x000018, "Member 'FS_PlaySoundParameters::PitchMultiplier_15_9A1CE27344EC0E4ABEDA7F90CCC9A82A' has a wrong offset!");
static_assert(offsetof(FS_PlaySoundParameters, StartTime_17_1A8DE0F44E9234411E3EBD85CB80B27B) == 0x000020, "Member 'FS_PlaySoundParameters::StartTime_17_1A8DE0F44E9234411E3EBD85CB80B27B' has a wrong offset!");
static_assert(offsetof(FS_PlaySoundParameters, ConcurrencySettings_20_3CAC6AA1461F0A29E2A9DCB8B6D63134) == 0x000028, "Member 'FS_PlaySoundParameters::ConcurrencySettings_20_3CAC6AA1461F0A29E2A9DCB8B6D63134' has a wrong offset!");
static_assert(offsetof(FS_PlaySoundParameters, SpawnParameters_34_FC89565F4B5E3A66F4F775B4052F57A7) == 0x000030, "Member 'FS_PlaySoundParameters::SpawnParameters_34_FC89565F4B5E3A66F4F775B4052F57A7' has a wrong offset!");
static_assert(offsetof(FS_PlaySoundParameters, WaitForAudioToFinishGameAction_39_6C82685D47A0D6A6FB16DBA5FCC35F90) == 0x000090, "Member 'FS_PlaySoundParameters::WaitForAudioToFinishGameAction_39_6C82685D47A0D6A6FB16DBA5FCC35F90' has a wrong offset!");

}

