#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_PostCinematicParameters

#include "Basic.hpp"

#include "S_CharacterCustomizationItemData_structs.hpp"
#include "S_GameFlowTransitionRequest_structs.hpp"
#include "SandFall_structs.hpp"


namespace SDK
{

// UserDefinedStruct S_PostCinematicParameters.S_PostCinematicParameters
// 0x0060 (0x0060 - 0x0000)
struct FS_PostCinematicParameters final
{
public:
	TSoftObjectPtr<class ABP_Cine_ExitPoint_C>    BPCineExitPoint_8_13BA735A4441863B0C464BA0F256DB99; // 0x0000(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	class FName                                   OverriddenCharacterForTransition_12_5A70859A43D73523730B12BF1525CEAF; // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_CharacterCustomizationItemData      CharacterCustomizationForTransition_24_EA2C188C40239E160579C9AC80C7A6A1; // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_GameFlowTransitionRequest           GameFlowTransitionRequest_17_3BFAF7304CD3C917583A4D890EF4F1E2; // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameAction_Wrapper                    GameActionToExecute_27_35BF81E14544677D8546E39913CF1DEF; // 0x0050(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(FS_PostCinematicParameters) == 0x000008, "Wrong alignment on FS_PostCinematicParameters");
static_assert(sizeof(FS_PostCinematicParameters) == 0x000060, "Wrong size on FS_PostCinematicParameters");
static_assert(offsetof(FS_PostCinematicParameters, BPCineExitPoint_8_13BA735A4441863B0C464BA0F256DB99) == 0x000000, "Member 'FS_PostCinematicParameters::BPCineExitPoint_8_13BA735A4441863B0C464BA0F256DB99' has a wrong offset!");
static_assert(offsetof(FS_PostCinematicParameters, OverriddenCharacterForTransition_12_5A70859A43D73523730B12BF1525CEAF) == 0x000028, "Member 'FS_PostCinematicParameters::OverriddenCharacterForTransition_12_5A70859A43D73523730B12BF1525CEAF' has a wrong offset!");
static_assert(offsetof(FS_PostCinematicParameters, CharacterCustomizationForTransition_24_EA2C188C40239E160579C9AC80C7A6A1) == 0x000030, "Member 'FS_PostCinematicParameters::CharacterCustomizationForTransition_24_EA2C188C40239E160579C9AC80C7A6A1' has a wrong offset!");
static_assert(offsetof(FS_PostCinematicParameters, GameFlowTransitionRequest_17_3BFAF7304CD3C917583A4D890EF4F1E2) == 0x000040, "Member 'FS_PostCinematicParameters::GameFlowTransitionRequest_17_3BFAF7304CD3C917583A4D890EF4F1E2' has a wrong offset!");
static_assert(offsetof(FS_PostCinematicParameters, GameActionToExecute_27_35BF81E14544677D8546E39913CF1DEF) == 0x000050, "Member 'FS_PostCinematicParameters::GameActionToExecute_27_35BF81E14544677D8546E39913CF1DEF' has a wrong offset!");

}

