#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_QuestObjectiveToDialogue

#include "Basic.hpp"

#include "SandFall_structs.hpp"
#include "S_Loot_structs.hpp"


namespace SDK
{

// UserDefinedStruct S_QuestObjectiveToDialogue.S_QuestObjectiveToDialogue
// 0x0060 (0x0060 - 0x0000)
struct FS_QuestObjectiveToDialogue final
{
public:
	struct FQuestObjectiveIdentifier              QuestObjective_6_9BA7DC9E4CCA097F81314CB5A2108A22; // 0x0000(0x0010)(Edit, BlueprintVisible, NoDestructor)
	TSoftClassPtr<class UClass>                   Dialogue_7_D6FA3E024FF67F40EACBE784BC54ED26;       // 0x0010(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FS_Loot                                IntermediateQuestLoot_13_93179ED442656D71C94CFAB21B7F1D8A; // 0x0038(0x0028)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FS_QuestObjectiveToDialogue) == 0x000008, "Wrong alignment on FS_QuestObjectiveToDialogue");
static_assert(sizeof(FS_QuestObjectiveToDialogue) == 0x000060, "Wrong size on FS_QuestObjectiveToDialogue");
static_assert(offsetof(FS_QuestObjectiveToDialogue, QuestObjective_6_9BA7DC9E4CCA097F81314CB5A2108A22) == 0x000000, "Member 'FS_QuestObjectiveToDialogue::QuestObjective_6_9BA7DC9E4CCA097F81314CB5A2108A22' has a wrong offset!");
static_assert(offsetof(FS_QuestObjectiveToDialogue, Dialogue_7_D6FA3E024FF67F40EACBE784BC54ED26) == 0x000010, "Member 'FS_QuestObjectiveToDialogue::Dialogue_7_D6FA3E024FF67F40EACBE784BC54ED26' has a wrong offset!");
static_assert(offsetof(FS_QuestObjectiveToDialogue, IntermediateQuestLoot_13_93179ED442656D71C94CFAB21B7F1D8A) == 0x000038, "Member 'FS_QuestObjectiveToDialogue::IntermediateQuestLoot_13_93179ED442656D71C94CFAB21B7F1D8A' has a wrong offset!");

}

