#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_ReplaceCharacterParameters

#include "Basic.hpp"

#include "E_Characters_structs.hpp"


namespace SDK
{

// UserDefinedStruct S_ReplaceCharacterParameters.S_ReplaceCharacterParameters
// 0x0009 (0x0009 - 0x0000)
struct FS_ReplaceCharacterParameters final
{
public:
	E_Characters                                  OldCharacter_2_76B268A34EDC34B4823397BC5C8FA5E2;   // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_Characters                                  NewCharacter_4_7AD35D254B3EE7F97626C3931279DBF8;   // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          TransferLumina_7_347621E5466692025EF4B2A21AA8E631; // 0x0002(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          TransferLevel_11_1EDF1E544B7806EACF12E8968EE240CA; // 0x0003(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          TransferPictos_16_F3ADFDAC4F0D8D09C20CB9B1B6415108; // 0x0004(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          TransferWeapon_18_3B0D73CF4D925EE41C43C3A35B759EE7; // 0x0005(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          TransferAttributePoints_13_005710C0425DE39B3D97B78BAE5C34E6; // 0x0006(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          TransferLuminaPoints_20_CEC573C6457F89F28E882595C5D73A5D; // 0x0007(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          AddToParty_15_0D66206E42612DF17AEBBA84C1DF8B2F;    // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FS_ReplaceCharacterParameters) == 0x000001, "Wrong alignment on FS_ReplaceCharacterParameters");
static_assert(sizeof(FS_ReplaceCharacterParameters) == 0x000009, "Wrong size on FS_ReplaceCharacterParameters");
static_assert(offsetof(FS_ReplaceCharacterParameters, OldCharacter_2_76B268A34EDC34B4823397BC5C8FA5E2) == 0x000000, "Member 'FS_ReplaceCharacterParameters::OldCharacter_2_76B268A34EDC34B4823397BC5C8FA5E2' has a wrong offset!");
static_assert(offsetof(FS_ReplaceCharacterParameters, NewCharacter_4_7AD35D254B3EE7F97626C3931279DBF8) == 0x000001, "Member 'FS_ReplaceCharacterParameters::NewCharacter_4_7AD35D254B3EE7F97626C3931279DBF8' has a wrong offset!");
static_assert(offsetof(FS_ReplaceCharacterParameters, TransferLumina_7_347621E5466692025EF4B2A21AA8E631) == 0x000002, "Member 'FS_ReplaceCharacterParameters::TransferLumina_7_347621E5466692025EF4B2A21AA8E631' has a wrong offset!");
static_assert(offsetof(FS_ReplaceCharacterParameters, TransferLevel_11_1EDF1E544B7806EACF12E8968EE240CA) == 0x000003, "Member 'FS_ReplaceCharacterParameters::TransferLevel_11_1EDF1E544B7806EACF12E8968EE240CA' has a wrong offset!");
static_assert(offsetof(FS_ReplaceCharacterParameters, TransferPictos_16_F3ADFDAC4F0D8D09C20CB9B1B6415108) == 0x000004, "Member 'FS_ReplaceCharacterParameters::TransferPictos_16_F3ADFDAC4F0D8D09C20CB9B1B6415108' has a wrong offset!");
static_assert(offsetof(FS_ReplaceCharacterParameters, TransferWeapon_18_3B0D73CF4D925EE41C43C3A35B759EE7) == 0x000005, "Member 'FS_ReplaceCharacterParameters::TransferWeapon_18_3B0D73CF4D925EE41C43C3A35B759EE7' has a wrong offset!");
static_assert(offsetof(FS_ReplaceCharacterParameters, TransferAttributePoints_13_005710C0425DE39B3D97B78BAE5C34E6) == 0x000006, "Member 'FS_ReplaceCharacterParameters::TransferAttributePoints_13_005710C0425DE39B3D97B78BAE5C34E6' has a wrong offset!");
static_assert(offsetof(FS_ReplaceCharacterParameters, TransferLuminaPoints_20_CEC573C6457F89F28E882595C5D73A5D) == 0x000007, "Member 'FS_ReplaceCharacterParameters::TransferLuminaPoints_20_CEC573C6457F89F28E882595C5D73A5D' has a wrong offset!");
static_assert(offsetof(FS_ReplaceCharacterParameters, AddToParty_15_0D66206E42612DF17AEBBA84C1DF8B2F) == 0x000008, "Member 'FS_ReplaceCharacterParameters::AddToParty_15_0D66206E42612DF17AEBBA84C1DF8B2F' has a wrong offset!");

}

