#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_RolledLootEntry

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct S_RolledLootEntry.S_RolledLootEntry
// 0x0010 (0x0010 - 0x0000)
struct FS_RolledLootEntry final
{
public:
	class FName                                   ItemID_2_FDDBE5744EC164155E4C959474052581;         // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Quantity_5_6316FB3244212C5481CB6E8C09995EF0;       // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LootContextLevelOffset_9_8DB3D2484651317AEF2735A9049799C7; // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FS_RolledLootEntry) == 0x000004, "Wrong alignment on FS_RolledLootEntry");
static_assert(sizeof(FS_RolledLootEntry) == 0x000010, "Wrong size on FS_RolledLootEntry");
static_assert(offsetof(FS_RolledLootEntry, ItemID_2_FDDBE5744EC164155E4C959474052581) == 0x000000, "Member 'FS_RolledLootEntry::ItemID_2_FDDBE5744EC164155E4C959474052581' has a wrong offset!");
static_assert(offsetof(FS_RolledLootEntry, Quantity_5_6316FB3244212C5481CB6E8C09995EF0) == 0x000008, "Member 'FS_RolledLootEntry::Quantity_5_6316FB3244212C5481CB6E8C09995EF0' has a wrong offset!");
static_assert(offsetof(FS_RolledLootEntry, LootContextLevelOffset_9_8DB3D2484651317AEF2735A9049799C7) == 0x00000C, "Member 'FS_RolledLootEntry::LootContextLevelOffset_9_8DB3D2484651317AEF2735A9049799C7' has a wrong offset!");

}

