#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_SaveSlotMetaData

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "S_jRPG_PartySlot_structs.hpp"


namespace SDK
{

// UserDefinedStruct S_SaveSlotMetaData.S_SaveSlotMetaData
// 0x0030 (0x0030 - 0x0000)
struct FS_SaveSlotMetaData final
{
public:
	struct FDateTime                              SaveDateTime_19_E1A0380D4016F1F87AE4F1B01B724E41;  // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        TimePlayed_6_37712C2447FFCEA1BCF1B6AAD59EA130;     // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   LastMap_3_C6EC466D4499E9E35F97088B929675EA;        // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FS_jRPG_PartySlot>              CurrentParty_18_DEB67ADC4AF742D198E6E981BADE3FDF;  // 0x0018(0x0010)(Edit, BlueprintVisible)
	int32                                         FinishedGameCount_21_BEA879764C8337FE19948D938B36545C; // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FS_SaveSlotMetaData) == 0x000008, "Wrong alignment on FS_SaveSlotMetaData");
static_assert(sizeof(FS_SaveSlotMetaData) == 0x000030, "Wrong size on FS_SaveSlotMetaData");
static_assert(offsetof(FS_SaveSlotMetaData, SaveDateTime_19_E1A0380D4016F1F87AE4F1B01B724E41) == 0x000000, "Member 'FS_SaveSlotMetaData::SaveDateTime_19_E1A0380D4016F1F87AE4F1B01B724E41' has a wrong offset!");
static_assert(offsetof(FS_SaveSlotMetaData, TimePlayed_6_37712C2447FFCEA1BCF1B6AAD59EA130) == 0x000008, "Member 'FS_SaveSlotMetaData::TimePlayed_6_37712C2447FFCEA1BCF1B6AAD59EA130' has a wrong offset!");
static_assert(offsetof(FS_SaveSlotMetaData, LastMap_3_C6EC466D4499E9E35F97088B929675EA) == 0x000010, "Member 'FS_SaveSlotMetaData::LastMap_3_C6EC466D4499E9E35F97088B929675EA' has a wrong offset!");
static_assert(offsetof(FS_SaveSlotMetaData, CurrentParty_18_DEB67ADC4AF742D198E6E981BADE3FDF) == 0x000018, "Member 'FS_SaveSlotMetaData::CurrentParty_18_DEB67ADC4AF742D198E6E981BADE3FDF' has a wrong offset!");
static_assert(offsetof(FS_SaveSlotMetaData, FinishedGameCount_21_BEA879764C8337FE19948D938B36545C) == 0x000028, "Member 'FS_SaveSlotMetaData::FinishedGameCount_21_BEA879764C8337FE19948D938B36545C' has a wrong offset!");

}

