#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_ScreenSpaceFogScatteringParameters

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct S_ScreenSpaceFogScatteringParameters.S_ScreenSpaceFogScatteringParameters
// 0x0018 (0x0018 - 0x0000)
struct FS_ScreenSpaceFogScatteringParameters final
{
public:
	bool                                          Enabled_2_1B608E084F7F4792E5EFAA9052E60875;        // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         PassAmount_8_AF7A0B9C4F8F7D95425FA188AC22E404;     // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Radius_10_E2EAECF246BBAA7AC6A676BF6EBF078D;        // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Intensity_12_2074BABF48A2D3BE5B73A78213B57EBD;     // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FS_ScreenSpaceFogScatteringParameters) == 0x000008, "Wrong alignment on FS_ScreenSpaceFogScatteringParameters");
static_assert(sizeof(FS_ScreenSpaceFogScatteringParameters) == 0x000018, "Wrong size on FS_ScreenSpaceFogScatteringParameters");
static_assert(offsetof(FS_ScreenSpaceFogScatteringParameters, Enabled_2_1B608E084F7F4792E5EFAA9052E60875) == 0x000000, "Member 'FS_ScreenSpaceFogScatteringParameters::Enabled_2_1B608E084F7F4792E5EFAA9052E60875' has a wrong offset!");
static_assert(offsetof(FS_ScreenSpaceFogScatteringParameters, PassAmount_8_AF7A0B9C4F8F7D95425FA188AC22E404) == 0x000004, "Member 'FS_ScreenSpaceFogScatteringParameters::PassAmount_8_AF7A0B9C4F8F7D95425FA188AC22E404' has a wrong offset!");
static_assert(offsetof(FS_ScreenSpaceFogScatteringParameters, Radius_10_E2EAECF246BBAA7AC6A676BF6EBF078D) == 0x000008, "Member 'FS_ScreenSpaceFogScatteringParameters::Radius_10_E2EAECF246BBAA7AC6A676BF6EBF078D' has a wrong offset!");
static_assert(offsetof(FS_ScreenSpaceFogScatteringParameters, Intensity_12_2074BABF48A2D3BE5B73A78213B57EBD) == 0x000010, "Member 'FS_ScreenSpaceFogScatteringParameters::Intensity_12_2074BABF48A2D3BE5B73A78213B57EBD' has a wrong offset!");

}

