#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_SpringArmComponentConfig

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct S_SpringArmComponentConfig.S_SpringArmComponentConfig
// 0x0068 (0x0068 - 0x0000)
struct FS_SpringArmComponentConfig final
{
public:
	struct FVector                                RelativeLocation_3_0F5819FF4DA3ADA24B6F18ACA410B137; // 0x0000(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          EnableCameraLag_7_570B093D4F264833135503B8DDF9DEFC; // 0x0018(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CameraLagMaxDistance_10_426F1EF9477DD9FFA74A8C8BA8DEA88B; // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CameraLagSpeed_12_8EE7C82A454A47330FE7728AA4B59C9D; // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        TargetArmLength_14_76D67053435033948248BBB4FC60F60E; // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SocketOffset_17_9BAACD024092A2D0EFFCFC905C84D333;  // 0x0038(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                TargetOffset_19_CDE647904CFFF472FFBDDA9BBDFD37E7;  // 0x0050(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FS_SpringArmComponentConfig) == 0x000008, "Wrong alignment on FS_SpringArmComponentConfig");
static_assert(sizeof(FS_SpringArmComponentConfig) == 0x000068, "Wrong size on FS_SpringArmComponentConfig");
static_assert(offsetof(FS_SpringArmComponentConfig, RelativeLocation_3_0F5819FF4DA3ADA24B6F18ACA410B137) == 0x000000, "Member 'FS_SpringArmComponentConfig::RelativeLocation_3_0F5819FF4DA3ADA24B6F18ACA410B137' has a wrong offset!");
static_assert(offsetof(FS_SpringArmComponentConfig, EnableCameraLag_7_570B093D4F264833135503B8DDF9DEFC) == 0x000018, "Member 'FS_SpringArmComponentConfig::EnableCameraLag_7_570B093D4F264833135503B8DDF9DEFC' has a wrong offset!");
static_assert(offsetof(FS_SpringArmComponentConfig, CameraLagMaxDistance_10_426F1EF9477DD9FFA74A8C8BA8DEA88B) == 0x000020, "Member 'FS_SpringArmComponentConfig::CameraLagMaxDistance_10_426F1EF9477DD9FFA74A8C8BA8DEA88B' has a wrong offset!");
static_assert(offsetof(FS_SpringArmComponentConfig, CameraLagSpeed_12_8EE7C82A454A47330FE7728AA4B59C9D) == 0x000028, "Member 'FS_SpringArmComponentConfig::CameraLagSpeed_12_8EE7C82A454A47330FE7728AA4B59C9D' has a wrong offset!");
static_assert(offsetof(FS_SpringArmComponentConfig, TargetArmLength_14_76D67053435033948248BBB4FC60F60E) == 0x000030, "Member 'FS_SpringArmComponentConfig::TargetArmLength_14_76D67053435033948248BBB4FC60F60E' has a wrong offset!");
static_assert(offsetof(FS_SpringArmComponentConfig, SocketOffset_17_9BAACD024092A2D0EFFCFC905C84D333) == 0x000038, "Member 'FS_SpringArmComponentConfig::SocketOffset_17_9BAACD024092A2D0EFFCFC905C84D333' has a wrong offset!");
static_assert(offsetof(FS_SpringArmComponentConfig, TargetOffset_19_CDE647904CFFF472FFBDDA9BBDFD37E7) == 0x000050, "Member 'FS_SpringArmComponentConfig::TargetOffset_19_CDE647904CFFF472FFBDDA9BBDFD37E7' has a wrong offset!");

}

