#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_TutorialCardContentData

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct S_TutorialCardContentData.S_TutorialCardContentData
// 0x0058 (0x0058 - 0x0000)
struct FS_TutorialCardContentData final
{
public:
	class FText                                   Title_2_4C516A0E45F6D53FB34BBE9F51E213CF;          // 0x0000(0x0010)(Edit, BlueprintVisible)
	class FText                                   Description_4_FE2E88D54D4A001F30E97FA5DBF4D3B7;    // 0x0010(0x0010)(Edit, BlueprintVisible)
	TSoftObjectPtr<class UTexture2D>              Media_19_94387612475E84B8D4305CA02DF2643F;         // 0x0020(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	double                                        MediaHeight_28_8F48BB9341775B10F1CF99B89781AC00;   // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShowInMenu_24_4493AFE04A548121812B3183CC748D29;    // 0x0050(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          AlwaysDisplayInMenu_25_A58D0FE849885DDCC0BBC8A9A0774416; // 0x0051(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FS_TutorialCardContentData) == 0x000008, "Wrong alignment on FS_TutorialCardContentData");
static_assert(sizeof(FS_TutorialCardContentData) == 0x000058, "Wrong size on FS_TutorialCardContentData");
static_assert(offsetof(FS_TutorialCardContentData, Title_2_4C516A0E45F6D53FB34BBE9F51E213CF) == 0x000000, "Member 'FS_TutorialCardContentData::Title_2_4C516A0E45F6D53FB34BBE9F51E213CF' has a wrong offset!");
static_assert(offsetof(FS_TutorialCardContentData, Description_4_FE2E88D54D4A001F30E97FA5DBF4D3B7) == 0x000010, "Member 'FS_TutorialCardContentData::Description_4_FE2E88D54D4A001F30E97FA5DBF4D3B7' has a wrong offset!");
static_assert(offsetof(FS_TutorialCardContentData, Media_19_94387612475E84B8D4305CA02DF2643F) == 0x000020, "Member 'FS_TutorialCardContentData::Media_19_94387612475E84B8D4305CA02DF2643F' has a wrong offset!");
static_assert(offsetof(FS_TutorialCardContentData, MediaHeight_28_8F48BB9341775B10F1CF99B89781AC00) == 0x000048, "Member 'FS_TutorialCardContentData::MediaHeight_28_8F48BB9341775B10F1CF99B89781AC00' has a wrong offset!");
static_assert(offsetof(FS_TutorialCardContentData, ShowInMenu_24_4493AFE04A548121812B3183CC748D29) == 0x000050, "Member 'FS_TutorialCardContentData::ShowInMenu_24_4493AFE04A548121812B3183CC748D29' has a wrong offset!");
static_assert(offsetof(FS_TutorialCardContentData, AlwaysDisplayInMenu_25_A58D0FE849885DDCC0BBC8A9A0774416) == 0x000051, "Member 'FS_TutorialCardContentData::AlwaysDisplayInMenu_25_A58D0FE849885DDCC0BBC8A9A0774416' has a wrong offset!");

}

