#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_WeaponIconsDataRow

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK
{

// UserDefinedStruct S_WeaponIconsDataRow.S_WeaponIconsDataRow
// 0x0088 (0x0088 - 0x0000)
struct FS_WeaponIconsDataRow final
{
public:
	TSoftObjectPtr<class UTexture2D>              WeaponIcon_6_C2B893194F2A3AB688720BAB2A52EF04;     // 0x0000(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct FWidgetTransform                       IconTransform_9_F96EE3B6444BC64C1BB27BA67CDFC912;  // 0x0028(0x0038)(Edit, BlueprintVisible, NoDestructor)
	TSoftObjectPtr<class UTexture2D>              BackgroundTexture_16_541CAE07430A3761491112998A1DB88E; // 0x0060(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
};
static_assert(alignof(FS_WeaponIconsDataRow) == 0x000008, "Wrong alignment on FS_WeaponIconsDataRow");
static_assert(sizeof(FS_WeaponIconsDataRow) == 0x000088, "Wrong size on FS_WeaponIconsDataRow");
static_assert(offsetof(FS_WeaponIconsDataRow, WeaponIcon_6_C2B893194F2A3AB688720BAB2A52EF04) == 0x000000, "Member 'FS_WeaponIconsDataRow::WeaponIcon_6_C2B893194F2A3AB688720BAB2A52EF04' has a wrong offset!");
static_assert(offsetof(FS_WeaponIconsDataRow, IconTransform_9_F96EE3B6444BC64C1BB27BA67CDFC912) == 0x000028, "Member 'FS_WeaponIconsDataRow::IconTransform_9_F96EE3B6444BC64C1BB27BA67CDFC912' has a wrong offset!");
static_assert(offsetof(FS_WeaponIconsDataRow, BackgroundTexture_16_541CAE07430A3761491112998A1DB88E) == 0x000060, "Member 'FS_WeaponIconsDataRow::BackgroundTexture_16_541CAE07430A3761491112998A1DB88E' has a wrong offset!");

}

