#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SandFall

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SandFall_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "MovieScene_structs.hpp"
#include "InputCore_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CommonInput_structs.hpp"
#include "StateTreeModule_structs.hpp"


namespace SDK::Params
{

// Function SandFall.AsyncActionHandlePlatformsSaveData.AsyncSaveLatestGameSaveLoaded
// 0x0020 (0x0020 - 0x0000)
struct AsyncActionHandlePlatformsSaveData_AsyncSaveLatestGameSaveLoaded final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 SaveName;                                          // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAsyncActionHandlePlatformsSaveData*    ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AsyncActionHandlePlatformsSaveData_AsyncSaveLatestGameSaveLoaded) == 0x000008, "Wrong alignment on AsyncActionHandlePlatformsSaveData_AsyncSaveLatestGameSaveLoaded");
static_assert(sizeof(AsyncActionHandlePlatformsSaveData_AsyncSaveLatestGameSaveLoaded) == 0x000020, "Wrong size on AsyncActionHandlePlatformsSaveData_AsyncSaveLatestGameSaveLoaded");
static_assert(offsetof(AsyncActionHandlePlatformsSaveData_AsyncSaveLatestGameSaveLoaded, WorldContextObject) == 0x000000, "Member 'AsyncActionHandlePlatformsSaveData_AsyncSaveLatestGameSaveLoaded::WorldContextObject' has a wrong offset!");
static_assert(offsetof(AsyncActionHandlePlatformsSaveData_AsyncSaveLatestGameSaveLoaded, SaveName) == 0x000008, "Member 'AsyncActionHandlePlatformsSaveData_AsyncSaveLatestGameSaveLoaded::SaveName' has a wrong offset!");
static_assert(offsetof(AsyncActionHandlePlatformsSaveData_AsyncSaveLatestGameSaveLoaded, ReturnValue) == 0x000018, "Member 'AsyncActionHandlePlatformsSaveData_AsyncSaveLatestGameSaveLoaded::ReturnValue' has a wrong offset!");

// Function SandFall.CameraModifier_CameraShake_BP.BlueprintAddedToCamera
// 0x0008 (0x0008 - 0x0000)
struct CameraModifier_CameraShake_BP_BlueprintAddedToCamera final
{
public:
	class APlayerCameraManager*                   Camera;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CameraModifier_CameraShake_BP_BlueprintAddedToCamera) == 0x000008, "Wrong alignment on CameraModifier_CameraShake_BP_BlueprintAddedToCamera");
static_assert(sizeof(CameraModifier_CameraShake_BP_BlueprintAddedToCamera) == 0x000008, "Wrong size on CameraModifier_CameraShake_BP_BlueprintAddedToCamera");
static_assert(offsetof(CameraModifier_CameraShake_BP_BlueprintAddedToCamera, Camera) == 0x000000, "Member 'CameraModifier_CameraShake_BP_BlueprintAddedToCamera::Camera' has a wrong offset!");

// Function SandFall.CameraModifier_Meta.GetCameraMetaModifier
// 0x0010 (0x0010 - 0x0000)
struct CameraModifier_Meta_GetCameraMetaModifier final
{
public:
	struct FCameraModifier_MetaWrapper            _wrapper;                                          // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	class UCameraModifier_Meta*                   OutMetaModifier;                                   // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CameraModifier_Meta_GetCameraMetaModifier) == 0x000008, "Wrong alignment on CameraModifier_Meta_GetCameraMetaModifier");
static_assert(sizeof(CameraModifier_Meta_GetCameraMetaModifier) == 0x000010, "Wrong size on CameraModifier_Meta_GetCameraMetaModifier");
static_assert(offsetof(CameraModifier_Meta_GetCameraMetaModifier, _wrapper) == 0x000000, "Member 'CameraModifier_Meta_GetCameraMetaModifier::_wrapper' has a wrong offset!");
static_assert(offsetof(CameraModifier_Meta_GetCameraMetaModifier, OutMetaModifier) == 0x000008, "Member 'CameraModifier_Meta_GetCameraMetaModifier::OutMetaModifier' has a wrong offset!");

// Function SandFall.CameraModifier_Meta.SetTargetCameraModifier
// 0x0008 (0x0008 - 0x0000)
struct CameraModifier_Meta_SetTargetCameraModifier final
{
public:
	class UCameraModifier*                        _cameraModifier;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CameraModifier_Meta_SetTargetCameraModifier) == 0x000008, "Wrong alignment on CameraModifier_Meta_SetTargetCameraModifier");
static_assert(sizeof(CameraModifier_Meta_SetTargetCameraModifier) == 0x000008, "Wrong size on CameraModifier_Meta_SetTargetCameraModifier");
static_assert(offsetof(CameraModifier_Meta_SetTargetCameraModifier, _cameraModifier) == 0x000000, "Member 'CameraModifier_Meta_SetTargetCameraModifier::_cameraModifier' has a wrong offset!");

// Function SandFall.CharacterSkinAssignPolicy.AssignBodyAndFaceSkin
// 0x0020 (0x0020 - 0x0000)
struct CharacterSkinAssignPolicy_AssignBodyAndFaceSkin final
{
public:
	class AActor*                                 Owner;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   CharacterName;                                     // 0x0008(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class AActor>                     BodySkinClass;                                     // 0x0010(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class AActor>                     FaceSkinClass;                                     // 0x0018(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CharacterSkinAssignPolicy_AssignBodyAndFaceSkin) == 0x000008, "Wrong alignment on CharacterSkinAssignPolicy_AssignBodyAndFaceSkin");
static_assert(sizeof(CharacterSkinAssignPolicy_AssignBodyAndFaceSkin) == 0x000020, "Wrong size on CharacterSkinAssignPolicy_AssignBodyAndFaceSkin");
static_assert(offsetof(CharacterSkinAssignPolicy_AssignBodyAndFaceSkin, Owner) == 0x000000, "Member 'CharacterSkinAssignPolicy_AssignBodyAndFaceSkin::Owner' has a wrong offset!");
static_assert(offsetof(CharacterSkinAssignPolicy_AssignBodyAndFaceSkin, CharacterName) == 0x000008, "Member 'CharacterSkinAssignPolicy_AssignBodyAndFaceSkin::CharacterName' has a wrong offset!");
static_assert(offsetof(CharacterSkinAssignPolicy_AssignBodyAndFaceSkin, BodySkinClass) == 0x000010, "Member 'CharacterSkinAssignPolicy_AssignBodyAndFaceSkin::BodySkinClass' has a wrong offset!");
static_assert(offsetof(CharacterSkinAssignPolicy_AssignBodyAndFaceSkin, FaceSkinClass) == 0x000018, "Member 'CharacterSkinAssignPolicy_AssignBodyAndFaceSkin::FaceSkinClass' has a wrong offset!");

// Function SandFall.CharacterSkinAssignPolicy.AssignBodyAndFaceSkinAsync
// 0x0060 (0x0060 - 0x0000)
struct CharacterSkinAssignPolicy_AssignBodyAndFaceSkinAsync final
{
public:
	class AActor*                                 Owner;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   CharacterName;                                     // 0x0008(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UClass>                   BodySkinClass;                                     // 0x0010(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UClass>                   FaceSkinClass;                                     // 0x0038(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CharacterSkinAssignPolicy_AssignBodyAndFaceSkinAsync) == 0x000008, "Wrong alignment on CharacterSkinAssignPolicy_AssignBodyAndFaceSkinAsync");
static_assert(sizeof(CharacterSkinAssignPolicy_AssignBodyAndFaceSkinAsync) == 0x000060, "Wrong size on CharacterSkinAssignPolicy_AssignBodyAndFaceSkinAsync");
static_assert(offsetof(CharacterSkinAssignPolicy_AssignBodyAndFaceSkinAsync, Owner) == 0x000000, "Member 'CharacterSkinAssignPolicy_AssignBodyAndFaceSkinAsync::Owner' has a wrong offset!");
static_assert(offsetof(CharacterSkinAssignPolicy_AssignBodyAndFaceSkinAsync, CharacterName) == 0x000008, "Member 'CharacterSkinAssignPolicy_AssignBodyAndFaceSkinAsync::CharacterName' has a wrong offset!");
static_assert(offsetof(CharacterSkinAssignPolicy_AssignBodyAndFaceSkinAsync, BodySkinClass) == 0x000010, "Member 'CharacterSkinAssignPolicy_AssignBodyAndFaceSkinAsync::BodySkinClass' has a wrong offset!");
static_assert(offsetof(CharacterSkinAssignPolicy_AssignBodyAndFaceSkinAsync, FaceSkinClass) == 0x000038, "Member 'CharacterSkinAssignPolicy_AssignBodyAndFaceSkinAsync::FaceSkinClass' has a wrong offset!");

// Function SandFall.CharacterSkinAssignPolicy.AssignBodySkin
// 0x0018 (0x0018 - 0x0000)
struct CharacterSkinAssignPolicy_AssignBodySkin final
{
public:
	class AActor*                                 Owner;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   CharacterName;                                     // 0x0008(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class AActor>                     BodySkinClass;                                     // 0x0010(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CharacterSkinAssignPolicy_AssignBodySkin) == 0x000008, "Wrong alignment on CharacterSkinAssignPolicy_AssignBodySkin");
static_assert(sizeof(CharacterSkinAssignPolicy_AssignBodySkin) == 0x000018, "Wrong size on CharacterSkinAssignPolicy_AssignBodySkin");
static_assert(offsetof(CharacterSkinAssignPolicy_AssignBodySkin, Owner) == 0x000000, "Member 'CharacterSkinAssignPolicy_AssignBodySkin::Owner' has a wrong offset!");
static_assert(offsetof(CharacterSkinAssignPolicy_AssignBodySkin, CharacterName) == 0x000008, "Member 'CharacterSkinAssignPolicy_AssignBodySkin::CharacterName' has a wrong offset!");
static_assert(offsetof(CharacterSkinAssignPolicy_AssignBodySkin, BodySkinClass) == 0x000010, "Member 'CharacterSkinAssignPolicy_AssignBodySkin::BodySkinClass' has a wrong offset!");

// Function SandFall.CharacterSkinAssignPolicy.AssignBodySkinAsync
// 0x0038 (0x0038 - 0x0000)
struct CharacterSkinAssignPolicy_AssignBodySkinAsync final
{
public:
	class AActor*                                 Owner;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   CharacterName;                                     // 0x0008(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UClass>                   BodySkinClass;                                     // 0x0010(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CharacterSkinAssignPolicy_AssignBodySkinAsync) == 0x000008, "Wrong alignment on CharacterSkinAssignPolicy_AssignBodySkinAsync");
static_assert(sizeof(CharacterSkinAssignPolicy_AssignBodySkinAsync) == 0x000038, "Wrong size on CharacterSkinAssignPolicy_AssignBodySkinAsync");
static_assert(offsetof(CharacterSkinAssignPolicy_AssignBodySkinAsync, Owner) == 0x000000, "Member 'CharacterSkinAssignPolicy_AssignBodySkinAsync::Owner' has a wrong offset!");
static_assert(offsetof(CharacterSkinAssignPolicy_AssignBodySkinAsync, CharacterName) == 0x000008, "Member 'CharacterSkinAssignPolicy_AssignBodySkinAsync::CharacterName' has a wrong offset!");
static_assert(offsetof(CharacterSkinAssignPolicy_AssignBodySkinAsync, BodySkinClass) == 0x000010, "Member 'CharacterSkinAssignPolicy_AssignBodySkinAsync::BodySkinClass' has a wrong offset!");

// Function SandFall.CharacterSkinAssignPolicy.AssignFaceSkin
// 0x0018 (0x0018 - 0x0000)
struct CharacterSkinAssignPolicy_AssignFaceSkin final
{
public:
	class AActor*                                 Owner;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   CharacterName;                                     // 0x0008(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class AActor>                     FaceSkinClass;                                     // 0x0010(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CharacterSkinAssignPolicy_AssignFaceSkin) == 0x000008, "Wrong alignment on CharacterSkinAssignPolicy_AssignFaceSkin");
static_assert(sizeof(CharacterSkinAssignPolicy_AssignFaceSkin) == 0x000018, "Wrong size on CharacterSkinAssignPolicy_AssignFaceSkin");
static_assert(offsetof(CharacterSkinAssignPolicy_AssignFaceSkin, Owner) == 0x000000, "Member 'CharacterSkinAssignPolicy_AssignFaceSkin::Owner' has a wrong offset!");
static_assert(offsetof(CharacterSkinAssignPolicy_AssignFaceSkin, CharacterName) == 0x000008, "Member 'CharacterSkinAssignPolicy_AssignFaceSkin::CharacterName' has a wrong offset!");
static_assert(offsetof(CharacterSkinAssignPolicy_AssignFaceSkin, FaceSkinClass) == 0x000010, "Member 'CharacterSkinAssignPolicy_AssignFaceSkin::FaceSkinClass' has a wrong offset!");

// Function SandFall.CharacterSkinAssignPolicy.AssignFaceSkinAsync
// 0x0038 (0x0038 - 0x0000)
struct CharacterSkinAssignPolicy_AssignFaceSkinAsync final
{
public:
	class AActor*                                 Owner;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   CharacterName;                                     // 0x0008(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UClass>                   FaceSkinClass;                                     // 0x0010(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CharacterSkinAssignPolicy_AssignFaceSkinAsync) == 0x000008, "Wrong alignment on CharacterSkinAssignPolicy_AssignFaceSkinAsync");
static_assert(sizeof(CharacterSkinAssignPolicy_AssignFaceSkinAsync) == 0x000038, "Wrong size on CharacterSkinAssignPolicy_AssignFaceSkinAsync");
static_assert(offsetof(CharacterSkinAssignPolicy_AssignFaceSkinAsync, Owner) == 0x000000, "Member 'CharacterSkinAssignPolicy_AssignFaceSkinAsync::Owner' has a wrong offset!");
static_assert(offsetof(CharacterSkinAssignPolicy_AssignFaceSkinAsync, CharacterName) == 0x000008, "Member 'CharacterSkinAssignPolicy_AssignFaceSkinAsync::CharacterName' has a wrong offset!");
static_assert(offsetof(CharacterSkinAssignPolicy_AssignFaceSkinAsync, FaceSkinClass) == 0x000010, "Member 'CharacterSkinAssignPolicy_AssignFaceSkinAsync::FaceSkinClass' has a wrong offset!");

// Function SandFall.ConsoleUtils.GetBoolCVar
// 0x000C (0x000C - 0x0000)
struct ConsoleUtils_GetBoolCVar final
{
public:
	class FName                                   Name_0;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ConsoleUtils_GetBoolCVar) == 0x000004, "Wrong alignment on ConsoleUtils_GetBoolCVar");
static_assert(sizeof(ConsoleUtils_GetBoolCVar) == 0x00000C, "Wrong size on ConsoleUtils_GetBoolCVar");
static_assert(offsetof(ConsoleUtils_GetBoolCVar, Name_0) == 0x000000, "Member 'ConsoleUtils_GetBoolCVar::Name_0' has a wrong offset!");
static_assert(offsetof(ConsoleUtils_GetBoolCVar, ReturnValue) == 0x000008, "Member 'ConsoleUtils_GetBoolCVar::ReturnValue' has a wrong offset!");

// Function SandFall.ConsoleUtils.GetFloatCVar
// 0x000C (0x000C - 0x0000)
struct ConsoleUtils_GetFloatCVar final
{
public:
	class FName                                   Name_0;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ConsoleUtils_GetFloatCVar) == 0x000004, "Wrong alignment on ConsoleUtils_GetFloatCVar");
static_assert(sizeof(ConsoleUtils_GetFloatCVar) == 0x00000C, "Wrong size on ConsoleUtils_GetFloatCVar");
static_assert(offsetof(ConsoleUtils_GetFloatCVar, Name_0) == 0x000000, "Member 'ConsoleUtils_GetFloatCVar::Name_0' has a wrong offset!");
static_assert(offsetof(ConsoleUtils_GetFloatCVar, ReturnValue) == 0x000008, "Member 'ConsoleUtils_GetFloatCVar::ReturnValue' has a wrong offset!");

// Function SandFall.ConsoleUtils.GetIntCVar
// 0x000C (0x000C - 0x0000)
struct ConsoleUtils_GetIntCVar final
{
public:
	class FName                                   Name_0;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ConsoleUtils_GetIntCVar) == 0x000004, "Wrong alignment on ConsoleUtils_GetIntCVar");
static_assert(sizeof(ConsoleUtils_GetIntCVar) == 0x00000C, "Wrong size on ConsoleUtils_GetIntCVar");
static_assert(offsetof(ConsoleUtils_GetIntCVar, Name_0) == 0x000000, "Member 'ConsoleUtils_GetIntCVar::Name_0' has a wrong offset!");
static_assert(offsetof(ConsoleUtils_GetIntCVar, ReturnValue) == 0x000008, "Member 'ConsoleUtils_GetIntCVar::ReturnValue' has a wrong offset!");

// Function SandFall.ConsoleUtils.GetStringCVar
// 0x0018 (0x0018 - 0x0000)
struct ConsoleUtils_GetStringCVar final
{
public:
	class FName                                   Name_0;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ConsoleUtils_GetStringCVar) == 0x000008, "Wrong alignment on ConsoleUtils_GetStringCVar");
static_assert(sizeof(ConsoleUtils_GetStringCVar) == 0x000018, "Wrong size on ConsoleUtils_GetStringCVar");
static_assert(offsetof(ConsoleUtils_GetStringCVar, Name_0) == 0x000000, "Member 'ConsoleUtils_GetStringCVar::Name_0' has a wrong offset!");
static_assert(offsetof(ConsoleUtils_GetStringCVar, ReturnValue) == 0x000008, "Member 'ConsoleUtils_GetStringCVar::ReturnValue' has a wrong offset!");

// Function SandFall.ConsoleUtils.IsCVarRegistered
// 0x000C (0x000C - 0x0000)
struct ConsoleUtils_IsCVarRegistered final
{
public:
	class FName                                   Name_0;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ConsoleUtils_IsCVarRegistered) == 0x000004, "Wrong alignment on ConsoleUtils_IsCVarRegistered");
static_assert(sizeof(ConsoleUtils_IsCVarRegistered) == 0x00000C, "Wrong size on ConsoleUtils_IsCVarRegistered");
static_assert(offsetof(ConsoleUtils_IsCVarRegistered, Name_0) == 0x000000, "Member 'ConsoleUtils_IsCVarRegistered::Name_0' has a wrong offset!");
static_assert(offsetof(ConsoleUtils_IsCVarRegistered, ReturnValue) == 0x000008, "Member 'ConsoleUtils_IsCVarRegistered::ReturnValue' has a wrong offset!");

// Function SandFall.ConsoleUtils.SetBoolCVar
// 0x000C (0x000C - 0x0000)
struct ConsoleUtils_SetBoolCVar final
{
public:
	class FName                                   Name_0;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Value;                                             // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ConsoleUtils_SetBoolCVar) == 0x000004, "Wrong alignment on ConsoleUtils_SetBoolCVar");
static_assert(sizeof(ConsoleUtils_SetBoolCVar) == 0x00000C, "Wrong size on ConsoleUtils_SetBoolCVar");
static_assert(offsetof(ConsoleUtils_SetBoolCVar, Name_0) == 0x000000, "Member 'ConsoleUtils_SetBoolCVar::Name_0' has a wrong offset!");
static_assert(offsetof(ConsoleUtils_SetBoolCVar, Value) == 0x000008, "Member 'ConsoleUtils_SetBoolCVar::Value' has a wrong offset!");

// Function SandFall.ConsoleUtils.SetFloatCVar
// 0x000C (0x000C - 0x0000)
struct ConsoleUtils_SetFloatCVar final
{
public:
	class FName                                   Name_0;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Value;                                             // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ConsoleUtils_SetFloatCVar) == 0x000004, "Wrong alignment on ConsoleUtils_SetFloatCVar");
static_assert(sizeof(ConsoleUtils_SetFloatCVar) == 0x00000C, "Wrong size on ConsoleUtils_SetFloatCVar");
static_assert(offsetof(ConsoleUtils_SetFloatCVar, Name_0) == 0x000000, "Member 'ConsoleUtils_SetFloatCVar::Name_0' has a wrong offset!");
static_assert(offsetof(ConsoleUtils_SetFloatCVar, Value) == 0x000008, "Member 'ConsoleUtils_SetFloatCVar::Value' has a wrong offset!");

// Function SandFall.ConsoleUtils.SetIntCVar
// 0x000C (0x000C - 0x0000)
struct ConsoleUtils_SetIntCVar final
{
public:
	class FName                                   Name_0;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Value;                                             // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ConsoleUtils_SetIntCVar) == 0x000004, "Wrong alignment on ConsoleUtils_SetIntCVar");
static_assert(sizeof(ConsoleUtils_SetIntCVar) == 0x00000C, "Wrong size on ConsoleUtils_SetIntCVar");
static_assert(offsetof(ConsoleUtils_SetIntCVar, Name_0) == 0x000000, "Member 'ConsoleUtils_SetIntCVar::Name_0' has a wrong offset!");
static_assert(offsetof(ConsoleUtils_SetIntCVar, Value) == 0x000008, "Member 'ConsoleUtils_SetIntCVar::Value' has a wrong offset!");

// Function SandFall.ConsoleUtils.SetStringCVar
// 0x0018 (0x0018 - 0x0000)
struct ConsoleUtils_SetStringCVar final
{
public:
	class FName                                   Name_0;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Value;                                             // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ConsoleUtils_SetStringCVar) == 0x000008, "Wrong alignment on ConsoleUtils_SetStringCVar");
static_assert(sizeof(ConsoleUtils_SetStringCVar) == 0x000018, "Wrong size on ConsoleUtils_SetStringCVar");
static_assert(offsetof(ConsoleUtils_SetStringCVar, Name_0) == 0x000000, "Member 'ConsoleUtils_SetStringCVar::Name_0' has a wrong offset!");
static_assert(offsetof(ConsoleUtils_SetStringCVar, Value) == 0x000008, "Member 'ConsoleUtils_SetStringCVar::Value' has a wrong offset!");

// Function SandFall.CSAP_SwapAssign.OnSettingsChanged
// 0x0008 (0x0008 - 0x0000)
struct CSAP_SwapAssign_OnSettingsChanged final
{
public:
	const class UConfigurableGameUserSettings*    UserGameConfig;                                    // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CSAP_SwapAssign_OnSettingsChanged) == 0x000008, "Wrong alignment on CSAP_SwapAssign_OnSettingsChanged");
static_assert(sizeof(CSAP_SwapAssign_OnSettingsChanged) == 0x000008, "Wrong size on CSAP_SwapAssign_OnSettingsChanged");
static_assert(offsetof(CSAP_SwapAssign_OnSettingsChanged, UserGameConfig) == 0x000000, "Member 'CSAP_SwapAssign_OnSettingsChanged::UserGameConfig' has a wrong offset!");

// Function SandFall.CVarChangeListenerManager.AddBoolCVarCallbackStatic
// 0x001C (0x001C - 0x0000)
struct CVarChangeListenerManager_AddBoolCVarCallbackStatic final
{
public:
	class FName                                   Name_0;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(bool NewValue)>                ChangedCallback;                                   // 0x0008(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          CallbackImmediately;                               // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(CVarChangeListenerManager_AddBoolCVarCallbackStatic) == 0x000004, "Wrong alignment on CVarChangeListenerManager_AddBoolCVarCallbackStatic");
static_assert(sizeof(CVarChangeListenerManager_AddBoolCVarCallbackStatic) == 0x00001C, "Wrong size on CVarChangeListenerManager_AddBoolCVarCallbackStatic");
static_assert(offsetof(CVarChangeListenerManager_AddBoolCVarCallbackStatic, Name_0) == 0x000000, "Member 'CVarChangeListenerManager_AddBoolCVarCallbackStatic::Name_0' has a wrong offset!");
static_assert(offsetof(CVarChangeListenerManager_AddBoolCVarCallbackStatic, ChangedCallback) == 0x000008, "Member 'CVarChangeListenerManager_AddBoolCVarCallbackStatic::ChangedCallback' has a wrong offset!");
static_assert(offsetof(CVarChangeListenerManager_AddBoolCVarCallbackStatic, CallbackImmediately) == 0x000018, "Member 'CVarChangeListenerManager_AddBoolCVarCallbackStatic::CallbackImmediately' has a wrong offset!");

// Function SandFall.CVarChangeListenerManager.AddFloatCVarCallbackStatic
// 0x001C (0x001C - 0x0000)
struct CVarChangeListenerManager_AddFloatCVarCallbackStatic final
{
public:
	class FName                                   Name_0;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(float NewValue)>               ChangedCallback;                                   // 0x0008(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          CallbackImmediately;                               // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(CVarChangeListenerManager_AddFloatCVarCallbackStatic) == 0x000004, "Wrong alignment on CVarChangeListenerManager_AddFloatCVarCallbackStatic");
static_assert(sizeof(CVarChangeListenerManager_AddFloatCVarCallbackStatic) == 0x00001C, "Wrong size on CVarChangeListenerManager_AddFloatCVarCallbackStatic");
static_assert(offsetof(CVarChangeListenerManager_AddFloatCVarCallbackStatic, Name_0) == 0x000000, "Member 'CVarChangeListenerManager_AddFloatCVarCallbackStatic::Name_0' has a wrong offset!");
static_assert(offsetof(CVarChangeListenerManager_AddFloatCVarCallbackStatic, ChangedCallback) == 0x000008, "Member 'CVarChangeListenerManager_AddFloatCVarCallbackStatic::ChangedCallback' has a wrong offset!");
static_assert(offsetof(CVarChangeListenerManager_AddFloatCVarCallbackStatic, CallbackImmediately) == 0x000018, "Member 'CVarChangeListenerManager_AddFloatCVarCallbackStatic::CallbackImmediately' has a wrong offset!");

// Function SandFall.CVarChangeListenerManager.AddIntCVarCallbackStatic
// 0x001C (0x001C - 0x0000)
struct CVarChangeListenerManager_AddIntCVarCallbackStatic final
{
public:
	class FName                                   Name_0;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(int32 NewValue)>               ChangedCallback;                                   // 0x0008(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          CallbackImmediately;                               // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(CVarChangeListenerManager_AddIntCVarCallbackStatic) == 0x000004, "Wrong alignment on CVarChangeListenerManager_AddIntCVarCallbackStatic");
static_assert(sizeof(CVarChangeListenerManager_AddIntCVarCallbackStatic) == 0x00001C, "Wrong size on CVarChangeListenerManager_AddIntCVarCallbackStatic");
static_assert(offsetof(CVarChangeListenerManager_AddIntCVarCallbackStatic, Name_0) == 0x000000, "Member 'CVarChangeListenerManager_AddIntCVarCallbackStatic::Name_0' has a wrong offset!");
static_assert(offsetof(CVarChangeListenerManager_AddIntCVarCallbackStatic, ChangedCallback) == 0x000008, "Member 'CVarChangeListenerManager_AddIntCVarCallbackStatic::ChangedCallback' has a wrong offset!");
static_assert(offsetof(CVarChangeListenerManager_AddIntCVarCallbackStatic, CallbackImmediately) == 0x000018, "Member 'CVarChangeListenerManager_AddIntCVarCallbackStatic::CallbackImmediately' has a wrong offset!");

// Function SandFall.CVarChangeListenerManager.AddStringCVarCallbackStatic
// 0x001C (0x001C - 0x0000)
struct CVarChangeListenerManager_AddStringCVarCallbackStatic final
{
public:
	class FName                                   Name_0;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const class FString& NewValue)> ChangedCallback;                                  // 0x0008(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          CallbackImmediately;                               // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(CVarChangeListenerManager_AddStringCVarCallbackStatic) == 0x000004, "Wrong alignment on CVarChangeListenerManager_AddStringCVarCallbackStatic");
static_assert(sizeof(CVarChangeListenerManager_AddStringCVarCallbackStatic) == 0x00001C, "Wrong size on CVarChangeListenerManager_AddStringCVarCallbackStatic");
static_assert(offsetof(CVarChangeListenerManager_AddStringCVarCallbackStatic, Name_0) == 0x000000, "Member 'CVarChangeListenerManager_AddStringCVarCallbackStatic::Name_0' has a wrong offset!");
static_assert(offsetof(CVarChangeListenerManager_AddStringCVarCallbackStatic, ChangedCallback) == 0x000008, "Member 'CVarChangeListenerManager_AddStringCVarCallbackStatic::ChangedCallback' has a wrong offset!");
static_assert(offsetof(CVarChangeListenerManager_AddStringCVarCallbackStatic, CallbackImmediately) == 0x000018, "Member 'CVarChangeListenerManager_AddStringCVarCallbackStatic::CallbackImmediately' has a wrong offset!");

// Function SandFall.EpicCamerasFunctionLibrary.FindAllBattleKeyframesInSequence
// 0x00A8 (0x00A8 - 0x0000)
struct EpicCamerasFunctionLibrary_FindAllBattleKeyframesInSequence final
{
public:
	class ULevelSequence*                         _sequence;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMovieSceneObjectBindingID             _actorBindingID;                                   // 0x0008(0x0018)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<float>                                 _skillEffectWithQTETimes;                          // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<float>                                 _skillEffectNoQTETimes;                            // 0x0030(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<float>                                 _explicitComboPromptTimes;                         // 0x0040(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<float>                                 _comboSectionStartTimes;                           // 0x0050(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	float                                         _lastComboSectionEnd;                              // 0x0060(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 _comboFailSectionStartTimes;                       // 0x0068(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<float>                                 _comboFailSectionEndTimes;                         // 0x0078(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<float>                                 _snapToTargetTimes;                                // 0x0088(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<float>                                 _snapToSourceTimes;                                // 0x0098(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(EpicCamerasFunctionLibrary_FindAllBattleKeyframesInSequence) == 0x000008, "Wrong alignment on EpicCamerasFunctionLibrary_FindAllBattleKeyframesInSequence");
static_assert(sizeof(EpicCamerasFunctionLibrary_FindAllBattleKeyframesInSequence) == 0x0000A8, "Wrong size on EpicCamerasFunctionLibrary_FindAllBattleKeyframesInSequence");
static_assert(offsetof(EpicCamerasFunctionLibrary_FindAllBattleKeyframesInSequence, _sequence) == 0x000000, "Member 'EpicCamerasFunctionLibrary_FindAllBattleKeyframesInSequence::_sequence' has a wrong offset!");
static_assert(offsetof(EpicCamerasFunctionLibrary_FindAllBattleKeyframesInSequence, _actorBindingID) == 0x000008, "Member 'EpicCamerasFunctionLibrary_FindAllBattleKeyframesInSequence::_actorBindingID' has a wrong offset!");
static_assert(offsetof(EpicCamerasFunctionLibrary_FindAllBattleKeyframesInSequence, _skillEffectWithQTETimes) == 0x000020, "Member 'EpicCamerasFunctionLibrary_FindAllBattleKeyframesInSequence::_skillEffectWithQTETimes' has a wrong offset!");
static_assert(offsetof(EpicCamerasFunctionLibrary_FindAllBattleKeyframesInSequence, _skillEffectNoQTETimes) == 0x000030, "Member 'EpicCamerasFunctionLibrary_FindAllBattleKeyframesInSequence::_skillEffectNoQTETimes' has a wrong offset!");
static_assert(offsetof(EpicCamerasFunctionLibrary_FindAllBattleKeyframesInSequence, _explicitComboPromptTimes) == 0x000040, "Member 'EpicCamerasFunctionLibrary_FindAllBattleKeyframesInSequence::_explicitComboPromptTimes' has a wrong offset!");
static_assert(offsetof(EpicCamerasFunctionLibrary_FindAllBattleKeyframesInSequence, _comboSectionStartTimes) == 0x000050, "Member 'EpicCamerasFunctionLibrary_FindAllBattleKeyframesInSequence::_comboSectionStartTimes' has a wrong offset!");
static_assert(offsetof(EpicCamerasFunctionLibrary_FindAllBattleKeyframesInSequence, _lastComboSectionEnd) == 0x000060, "Member 'EpicCamerasFunctionLibrary_FindAllBattleKeyframesInSequence::_lastComboSectionEnd' has a wrong offset!");
static_assert(offsetof(EpicCamerasFunctionLibrary_FindAllBattleKeyframesInSequence, _comboFailSectionStartTimes) == 0x000068, "Member 'EpicCamerasFunctionLibrary_FindAllBattleKeyframesInSequence::_comboFailSectionStartTimes' has a wrong offset!");
static_assert(offsetof(EpicCamerasFunctionLibrary_FindAllBattleKeyframesInSequence, _comboFailSectionEndTimes) == 0x000078, "Member 'EpicCamerasFunctionLibrary_FindAllBattleKeyframesInSequence::_comboFailSectionEndTimes' has a wrong offset!");
static_assert(offsetof(EpicCamerasFunctionLibrary_FindAllBattleKeyframesInSequence, _snapToTargetTimes) == 0x000088, "Member 'EpicCamerasFunctionLibrary_FindAllBattleKeyframesInSequence::_snapToTargetTimes' has a wrong offset!");
static_assert(offsetof(EpicCamerasFunctionLibrary_FindAllBattleKeyframesInSequence, _snapToSourceTimes) == 0x000098, "Member 'EpicCamerasFunctionLibrary_FindAllBattleKeyframesInSequence::_snapToSourceTimes' has a wrong offset!");

// Function SandFall.EpicCamerasFunctionLibrary.FindAllBattleKeyframesInSequenceAsList
// 0x0038 (0x0038 - 0x0000)
struct EpicCamerasFunctionLibrary_FindAllBattleKeyframesInSequenceAsList final
{
public:
	class ULevelSequence*                         _sequence;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMovieSceneObjectBindingID             _actorBindingID;                                   // 0x0008(0x0018)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FBattleSequenceKeyframe>        _keyframes;                                        // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                         _trackIndex;                                       // 0x0030(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(EpicCamerasFunctionLibrary_FindAllBattleKeyframesInSequenceAsList) == 0x000008, "Wrong alignment on EpicCamerasFunctionLibrary_FindAllBattleKeyframesInSequenceAsList");
static_assert(sizeof(EpicCamerasFunctionLibrary_FindAllBattleKeyframesInSequenceAsList) == 0x000038, "Wrong size on EpicCamerasFunctionLibrary_FindAllBattleKeyframesInSequenceAsList");
static_assert(offsetof(EpicCamerasFunctionLibrary_FindAllBattleKeyframesInSequenceAsList, _sequence) == 0x000000, "Member 'EpicCamerasFunctionLibrary_FindAllBattleKeyframesInSequenceAsList::_sequence' has a wrong offset!");
static_assert(offsetof(EpicCamerasFunctionLibrary_FindAllBattleKeyframesInSequenceAsList, _actorBindingID) == 0x000008, "Member 'EpicCamerasFunctionLibrary_FindAllBattleKeyframesInSequenceAsList::_actorBindingID' has a wrong offset!");
static_assert(offsetof(EpicCamerasFunctionLibrary_FindAllBattleKeyframesInSequenceAsList, _keyframes) == 0x000020, "Member 'EpicCamerasFunctionLibrary_FindAllBattleKeyframesInSequenceAsList::_keyframes' has a wrong offset!");
static_assert(offsetof(EpicCamerasFunctionLibrary_FindAllBattleKeyframesInSequenceAsList, _trackIndex) == 0x000030, "Member 'EpicCamerasFunctionLibrary_FindAllBattleKeyframesInSequenceAsList::_trackIndex' has a wrong offset!");

// Function SandFall.EpicCamerasFunctionLibrary.FindAllBattleKeyframesInSequenceAsListFromTrackName
// 0x0038 (0x0038 - 0x0000)
struct EpicCamerasFunctionLibrary_FindAllBattleKeyframesInSequenceAsListFromTrackName final
{
public:
	class ULevelSequence*                         _sequence;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMovieSceneObjectBindingID             _actorBindingID;                                   // 0x0008(0x0018)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FBattleSequenceKeyframe>        _keyframes;                                        // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	class FName                                   _trackName;                                        // 0x0030(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(EpicCamerasFunctionLibrary_FindAllBattleKeyframesInSequenceAsListFromTrackName) == 0x000008, "Wrong alignment on EpicCamerasFunctionLibrary_FindAllBattleKeyframesInSequenceAsListFromTrackName");
static_assert(sizeof(EpicCamerasFunctionLibrary_FindAllBattleKeyframesInSequenceAsListFromTrackName) == 0x000038, "Wrong size on EpicCamerasFunctionLibrary_FindAllBattleKeyframesInSequenceAsListFromTrackName");
static_assert(offsetof(EpicCamerasFunctionLibrary_FindAllBattleKeyframesInSequenceAsListFromTrackName, _sequence) == 0x000000, "Member 'EpicCamerasFunctionLibrary_FindAllBattleKeyframesInSequenceAsListFromTrackName::_sequence' has a wrong offset!");
static_assert(offsetof(EpicCamerasFunctionLibrary_FindAllBattleKeyframesInSequenceAsListFromTrackName, _actorBindingID) == 0x000008, "Member 'EpicCamerasFunctionLibrary_FindAllBattleKeyframesInSequenceAsListFromTrackName::_actorBindingID' has a wrong offset!");
static_assert(offsetof(EpicCamerasFunctionLibrary_FindAllBattleKeyframesInSequenceAsListFromTrackName, _keyframes) == 0x000020, "Member 'EpicCamerasFunctionLibrary_FindAllBattleKeyframesInSequenceAsListFromTrackName::_keyframes' has a wrong offset!");
static_assert(offsetof(EpicCamerasFunctionLibrary_FindAllBattleKeyframesInSequenceAsListFromTrackName, _trackName) == 0x000030, "Member 'EpicCamerasFunctionLibrary_FindAllBattleKeyframesInSequenceAsListFromTrackName::_trackName' has a wrong offset!");

// Function SandFall.EpicCamerasFunctionLibrary.FindAllBattleKeyframesInSequenceAsMap
// 0x0078 (0x0078 - 0x0000)
struct EpicCamerasFunctionLibrary_FindAllBattleKeyframesInSequenceAsMap final
{
public:
	class ULevelSequence*                         _sequence;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMovieSceneObjectBindingID             _actorBindingID;                                   // 0x0008(0x0018)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<float, EBattleSequenceKeyframeType>      _keyframes;                                        // 0x0020(0x0050)(Parm, OutParm, NativeAccessSpecifierPublic)
	int32                                         _trackIndex;                                       // 0x0070(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(EpicCamerasFunctionLibrary_FindAllBattleKeyframesInSequenceAsMap) == 0x000008, "Wrong alignment on EpicCamerasFunctionLibrary_FindAllBattleKeyframesInSequenceAsMap");
static_assert(sizeof(EpicCamerasFunctionLibrary_FindAllBattleKeyframesInSequenceAsMap) == 0x000078, "Wrong size on EpicCamerasFunctionLibrary_FindAllBattleKeyframesInSequenceAsMap");
static_assert(offsetof(EpicCamerasFunctionLibrary_FindAllBattleKeyframesInSequenceAsMap, _sequence) == 0x000000, "Member 'EpicCamerasFunctionLibrary_FindAllBattleKeyframesInSequenceAsMap::_sequence' has a wrong offset!");
static_assert(offsetof(EpicCamerasFunctionLibrary_FindAllBattleKeyframesInSequenceAsMap, _actorBindingID) == 0x000008, "Member 'EpicCamerasFunctionLibrary_FindAllBattleKeyframesInSequenceAsMap::_actorBindingID' has a wrong offset!");
static_assert(offsetof(EpicCamerasFunctionLibrary_FindAllBattleKeyframesInSequenceAsMap, _keyframes) == 0x000020, "Member 'EpicCamerasFunctionLibrary_FindAllBattleKeyframesInSequenceAsMap::_keyframes' has a wrong offset!");
static_assert(offsetof(EpicCamerasFunctionLibrary_FindAllBattleKeyframesInSequenceAsMap, _trackIndex) == 0x000070, "Member 'EpicCamerasFunctionLibrary_FindAllBattleKeyframesInSequenceAsMap::_trackIndex' has a wrong offset!");

// Function SandFall.EpicCamerasFunctionLibrary.FindBattleCameraKeyframesInSequenceAsMap
// 0x0078 (0x0078 - 0x0000)
struct EpicCamerasFunctionLibrary_FindBattleCameraKeyframesInSequenceAsMap final
{
public:
	class ULevelSequence*                         _sequence;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMovieSceneObjectBindingID             _actorBindingID;                                   // 0x0008(0x0018)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<float, EBattleSequenceCameraType>        _keyframes;                                        // 0x0020(0x0050)(Parm, OutParm, NativeAccessSpecifierPublic)
	int32                                         _trackIndex;                                       // 0x0070(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(EpicCamerasFunctionLibrary_FindBattleCameraKeyframesInSequenceAsMap) == 0x000008, "Wrong alignment on EpicCamerasFunctionLibrary_FindBattleCameraKeyframesInSequenceAsMap");
static_assert(sizeof(EpicCamerasFunctionLibrary_FindBattleCameraKeyframesInSequenceAsMap) == 0x000078, "Wrong size on EpicCamerasFunctionLibrary_FindBattleCameraKeyframesInSequenceAsMap");
static_assert(offsetof(EpicCamerasFunctionLibrary_FindBattleCameraKeyframesInSequenceAsMap, _sequence) == 0x000000, "Member 'EpicCamerasFunctionLibrary_FindBattleCameraKeyframesInSequenceAsMap::_sequence' has a wrong offset!");
static_assert(offsetof(EpicCamerasFunctionLibrary_FindBattleCameraKeyframesInSequenceAsMap, _actorBindingID) == 0x000008, "Member 'EpicCamerasFunctionLibrary_FindBattleCameraKeyframesInSequenceAsMap::_actorBindingID' has a wrong offset!");
static_assert(offsetof(EpicCamerasFunctionLibrary_FindBattleCameraKeyframesInSequenceAsMap, _keyframes) == 0x000020, "Member 'EpicCamerasFunctionLibrary_FindBattleCameraKeyframesInSequenceAsMap::_keyframes' has a wrong offset!");
static_assert(offsetof(EpicCamerasFunctionLibrary_FindBattleCameraKeyframesInSequenceAsMap, _trackIndex) == 0x000070, "Member 'EpicCamerasFunctionLibrary_FindBattleCameraKeyframesInSequenceAsMap::_trackIndex' has a wrong offset!");

// Function SandFall.EpicCamerasFunctionLibrary.FindBattleCameraKeyframesInSequenceAsMapFromTrackName
// 0x0078 (0x0078 - 0x0000)
struct EpicCamerasFunctionLibrary_FindBattleCameraKeyframesInSequenceAsMapFromTrackName final
{
public:
	class ULevelSequence*                         _sequence;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMovieSceneObjectBindingID             _actorBindingID;                                   // 0x0008(0x0018)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<float, EBattleSequenceCameraType>        _keyframes;                                        // 0x0020(0x0050)(Parm, OutParm, NativeAccessSpecifierPublic)
	class FName                                   _trackName;                                        // 0x0070(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(EpicCamerasFunctionLibrary_FindBattleCameraKeyframesInSequenceAsMapFromTrackName) == 0x000008, "Wrong alignment on EpicCamerasFunctionLibrary_FindBattleCameraKeyframesInSequenceAsMapFromTrackName");
static_assert(sizeof(EpicCamerasFunctionLibrary_FindBattleCameraKeyframesInSequenceAsMapFromTrackName) == 0x000078, "Wrong size on EpicCamerasFunctionLibrary_FindBattleCameraKeyframesInSequenceAsMapFromTrackName");
static_assert(offsetof(EpicCamerasFunctionLibrary_FindBattleCameraKeyframesInSequenceAsMapFromTrackName, _sequence) == 0x000000, "Member 'EpicCamerasFunctionLibrary_FindBattleCameraKeyframesInSequenceAsMapFromTrackName::_sequence' has a wrong offset!");
static_assert(offsetof(EpicCamerasFunctionLibrary_FindBattleCameraKeyframesInSequenceAsMapFromTrackName, _actorBindingID) == 0x000008, "Member 'EpicCamerasFunctionLibrary_FindBattleCameraKeyframesInSequenceAsMapFromTrackName::_actorBindingID' has a wrong offset!");
static_assert(offsetof(EpicCamerasFunctionLibrary_FindBattleCameraKeyframesInSequenceAsMapFromTrackName, _keyframes) == 0x000020, "Member 'EpicCamerasFunctionLibrary_FindBattleCameraKeyframesInSequenceAsMapFromTrackName::_keyframes' has a wrong offset!");
static_assert(offsetof(EpicCamerasFunctionLibrary_FindBattleCameraKeyframesInSequenceAsMapFromTrackName, _trackName) == 0x000070, "Member 'EpicCamerasFunctionLibrary_FindBattleCameraKeyframesInSequenceAsMapFromTrackName::_trackName' has a wrong offset!");

// Function SandFall.EpicCamerasFunctionLibrary.FindBattleKeyframesInSequence
// 0x0038 (0x0038 - 0x0000)
struct EpicCamerasFunctionLibrary_FindBattleKeyframesInSequence final
{
public:
	EBattleSequenceKeyframeType                   _keyframeType;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULevelSequence*                         _sequence;                                         // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMovieSceneObjectBindingID             _actorBindingID;                                   // 0x0010(0x0018)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<float>                                 _times;                                            // 0x0028(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(EpicCamerasFunctionLibrary_FindBattleKeyframesInSequence) == 0x000008, "Wrong alignment on EpicCamerasFunctionLibrary_FindBattleKeyframesInSequence");
static_assert(sizeof(EpicCamerasFunctionLibrary_FindBattleKeyframesInSequence) == 0x000038, "Wrong size on EpicCamerasFunctionLibrary_FindBattleKeyframesInSequence");
static_assert(offsetof(EpicCamerasFunctionLibrary_FindBattleKeyframesInSequence, _keyframeType) == 0x000000, "Member 'EpicCamerasFunctionLibrary_FindBattleKeyframesInSequence::_keyframeType' has a wrong offset!");
static_assert(offsetof(EpicCamerasFunctionLibrary_FindBattleKeyframesInSequence, _sequence) == 0x000008, "Member 'EpicCamerasFunctionLibrary_FindBattleKeyframesInSequence::_sequence' has a wrong offset!");
static_assert(offsetof(EpicCamerasFunctionLibrary_FindBattleKeyframesInSequence, _actorBindingID) == 0x000010, "Member 'EpicCamerasFunctionLibrary_FindBattleKeyframesInSequence::_actorBindingID' has a wrong offset!");
static_assert(offsetof(EpicCamerasFunctionLibrary_FindBattleKeyframesInSequence, _times) == 0x000028, "Member 'EpicCamerasFunctionLibrary_FindBattleKeyframesInSequence::_times' has a wrong offset!");

// Function SandFall.EpicCamerasFunctionLibrary.FindQTEKeyframes
// 0x0030 (0x0030 - 0x0000)
struct EpicCamerasFunctionLibrary_FindQTEKeyframes final
{
public:
	class ULevelSequence*                         _sequence;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMovieSceneObjectBindingID             _actorBindingID;                                   // 0x0008(0x0018)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<float>                                 ImpactTimes;                                       // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(EpicCamerasFunctionLibrary_FindQTEKeyframes) == 0x000008, "Wrong alignment on EpicCamerasFunctionLibrary_FindQTEKeyframes");
static_assert(sizeof(EpicCamerasFunctionLibrary_FindQTEKeyframes) == 0x000030, "Wrong size on EpicCamerasFunctionLibrary_FindQTEKeyframes");
static_assert(offsetof(EpicCamerasFunctionLibrary_FindQTEKeyframes, _sequence) == 0x000000, "Member 'EpicCamerasFunctionLibrary_FindQTEKeyframes::_sequence' has a wrong offset!");
static_assert(offsetof(EpicCamerasFunctionLibrary_FindQTEKeyframes, _actorBindingID) == 0x000008, "Member 'EpicCamerasFunctionLibrary_FindQTEKeyframes::_actorBindingID' has a wrong offset!");
static_assert(offsetof(EpicCamerasFunctionLibrary_FindQTEKeyframes, ImpactTimes) == 0x000020, "Member 'EpicCamerasFunctionLibrary_FindQTEKeyframes::ImpactTimes' has a wrong offset!");

// Function SandFall.EpicCamerasFunctionLibrary.GetCinematicTimeDilation
// 0x0010 (0x0010 - 0x0000)
struct EpicCamerasFunctionLibrary_GetCinematicTimeDilation final
{
public:
	class UObject*                                _WorldContextObject;                               // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(EpicCamerasFunctionLibrary_GetCinematicTimeDilation) == 0x000008, "Wrong alignment on EpicCamerasFunctionLibrary_GetCinematicTimeDilation");
static_assert(sizeof(EpicCamerasFunctionLibrary_GetCinematicTimeDilation) == 0x000010, "Wrong size on EpicCamerasFunctionLibrary_GetCinematicTimeDilation");
static_assert(offsetof(EpicCamerasFunctionLibrary_GetCinematicTimeDilation, _WorldContextObject) == 0x000000, "Member 'EpicCamerasFunctionLibrary_GetCinematicTimeDilation::_WorldContextObject' has a wrong offset!");
static_assert(offsetof(EpicCamerasFunctionLibrary_GetCinematicTimeDilation, ReturnValue) == 0x000008, "Member 'EpicCamerasFunctionLibrary_GetCinematicTimeDilation::ReturnValue' has a wrong offset!");

// Function SandFall.EpicCamerasFunctionLibrary.GetInitialActorPositionInSequence
// 0x0080 (0x0080 - 0x0000)
struct EpicCamerasFunctionLibrary_GetInitialActorPositionInSequence final
{
public:
	class ULevelSequence*                         _sequence;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMovieSceneObjectBindingID             _bindingID;                                        // 0x0008(0x0018)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTransform                             ReturnValue;                                       // 0x0020(0x0060)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(EpicCamerasFunctionLibrary_GetInitialActorPositionInSequence) == 0x000010, "Wrong alignment on EpicCamerasFunctionLibrary_GetInitialActorPositionInSequence");
static_assert(sizeof(EpicCamerasFunctionLibrary_GetInitialActorPositionInSequence) == 0x000080, "Wrong size on EpicCamerasFunctionLibrary_GetInitialActorPositionInSequence");
static_assert(offsetof(EpicCamerasFunctionLibrary_GetInitialActorPositionInSequence, _sequence) == 0x000000, "Member 'EpicCamerasFunctionLibrary_GetInitialActorPositionInSequence::_sequence' has a wrong offset!");
static_assert(offsetof(EpicCamerasFunctionLibrary_GetInitialActorPositionInSequence, _bindingID) == 0x000008, "Member 'EpicCamerasFunctionLibrary_GetInitialActorPositionInSequence::_bindingID' has a wrong offset!");
