#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SandFall

#include "Basic.hpp"

#include "SandFall_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "NavigationSystem_classes.hpp"
#include "CommonUI_classes.hpp"
#include "SlateCore_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "DeveloperSettings_classes.hpp"
#include "UMG_classes.hpp"
#include "CommonInput_structs.hpp"
#include "StateTreeModule_structs.hpp"
#include "StateTreeModule_classes.hpp"


namespace SDK
{

// Class SandFall.AsyncActionHandlePlatformsSaveData
// 0x0020 (0x0050 - 0x0030)
class UAsyncActionHandlePlatformsSaveData final : public UBlueprintAsyncActionBase
{
public:
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(bool bSuccess)> OnCompleted;                                       // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)

public:
	static class UAsyncActionHandlePlatformsSaveData* AsyncSaveLatestGameSaveLoaded(class UObject* WorldContextObject, const class FString& SaveName);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AsyncActionHandlePlatformsSaveData">();
	}
	static class UAsyncActionHandlePlatformsSaveData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAsyncActionHandlePlatformsSaveData>();
	}
};
static_assert(alignof(UAsyncActionHandlePlatformsSaveData) == 0x000008, "Wrong alignment on UAsyncActionHandlePlatformsSaveData");
static_assert(sizeof(UAsyncActionHandlePlatformsSaveData) == 0x000050, "Wrong size on UAsyncActionHandlePlatformsSaveData");
static_assert(offsetof(UAsyncActionHandlePlatformsSaveData, OnCompleted) == 0x000040, "Member 'UAsyncActionHandlePlatformsSaveData::OnCompleted' has a wrong offset!");

// Class SandFall.CameraModifier_CameraShake_BP
// 0x0020 (0x00D0 - 0x00B0)
class UCameraModifier_CameraShake_BP final : public UCameraModifier_CameraShake
{
public:
	class UCameraModifier_Meta*                   Modifier;                                          // 0x00B0(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          StopModifierAfterShake;                            // 0x00B8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ShakeDuration;                                     // 0x00BC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UCameraShakeBase>           ShakeAtStart;                                      // 0x00C0(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C8[0x8];                                       // 0x00C8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BlueprintAddedToCamera(class APlayerCameraManager* Camera);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CameraModifier_CameraShake_BP">();
	}
	static class UCameraModifier_CameraShake_BP* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCameraModifier_CameraShake_BP>();
	}
};
static_assert(alignof(UCameraModifier_CameraShake_BP) == 0x000008, "Wrong alignment on UCameraModifier_CameraShake_BP");
static_assert(sizeof(UCameraModifier_CameraShake_BP) == 0x0000D0, "Wrong size on UCameraModifier_CameraShake_BP");
static_assert(offsetof(UCameraModifier_CameraShake_BP, Modifier) == 0x0000B0, "Member 'UCameraModifier_CameraShake_BP::Modifier' has a wrong offset!");
static_assert(offsetof(UCameraModifier_CameraShake_BP, StopModifierAfterShake) == 0x0000B8, "Member 'UCameraModifier_CameraShake_BP::StopModifierAfterShake' has a wrong offset!");
static_assert(offsetof(UCameraModifier_CameraShake_BP, ShakeDuration) == 0x0000BC, "Member 'UCameraModifier_CameraShake_BP::ShakeDuration' has a wrong offset!");
static_assert(offsetof(UCameraModifier_CameraShake_BP, ShakeAtStart) == 0x0000C0, "Member 'UCameraModifier_CameraShake_BP::ShakeAtStart' has a wrong offset!");

// Class SandFall.CameraModifier_Meta
// 0x0008 (0x0030 - 0x0028)
class UCameraModifier_Meta : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static void GetCameraMetaModifier(const struct FCameraModifier_MetaWrapper& _wrapper, class UCameraModifier_Meta** OutMetaModifier);

	void SetTargetCameraModifier(class UCameraModifier* _cameraModifier);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CameraModifier_Meta">();
	}
	static class UCameraModifier_Meta* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCameraModifier_Meta>();
	}
};
static_assert(alignof(UCameraModifier_Meta) == 0x000008, "Wrong alignment on UCameraModifier_Meta");
static_assert(sizeof(UCameraModifier_Meta) == 0x000030, "Wrong size on UCameraModifier_Meta");

// Class SandFall.CameraModifier_Meta_Expiration
// 0x0010 (0x0040 - 0x0030)
class UCameraModifier_Meta_Expiration final : public UCameraModifier_Meta
{
public:
	float                                         m_expirationDuration;                              // 0x0030(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0xC];                                       // 0x0034(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CameraModifier_Meta_Expiration">();
	}
	static class UCameraModifier_Meta_Expiration* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCameraModifier_Meta_Expiration>();
	}
};
static_assert(alignof(UCameraModifier_Meta_Expiration) == 0x000008, "Wrong alignment on UCameraModifier_Meta_Expiration");
static_assert(sizeof(UCameraModifier_Meta_Expiration) == 0x000040, "Wrong size on UCameraModifier_Meta_Expiration");
static_assert(offsetof(UCameraModifier_Meta_Expiration, m_expirationDuration) == 0x000030, "Member 'UCameraModifier_Meta_Expiration::m_expirationDuration' has a wrong offset!");

// Class SandFall.CameraModifier_RotationLimiter
// 0x0018 (0x0060 - 0x0048)
class UCameraModifier_RotationLimiter : public UCameraModifier
{
public:
	float                                         PitchMin;                                          // 0x0048(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PitchMax;                                          // 0x004C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         YawMin;                                            // 0x0050(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         YaxMax;                                            // 0x0054(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RollMin;                                           // 0x0058(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RollMax;                                           // 0x005C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CameraModifier_RotationLimiter">();
	}
	static class UCameraModifier_RotationLimiter* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCameraModifier_RotationLimiter>();
	}
};
static_assert(alignof(UCameraModifier_RotationLimiter) == 0x000008, "Wrong alignment on UCameraModifier_RotationLimiter");
static_assert(sizeof(UCameraModifier_RotationLimiter) == 0x000060, "Wrong size on UCameraModifier_RotationLimiter");
static_assert(offsetof(UCameraModifier_RotationLimiter, PitchMin) == 0x000048, "Member 'UCameraModifier_RotationLimiter::PitchMin' has a wrong offset!");
static_assert(offsetof(UCameraModifier_RotationLimiter, PitchMax) == 0x00004C, "Member 'UCameraModifier_RotationLimiter::PitchMax' has a wrong offset!");
static_assert(offsetof(UCameraModifier_RotationLimiter, YawMin) == 0x000050, "Member 'UCameraModifier_RotationLimiter::YawMin' has a wrong offset!");
static_assert(offsetof(UCameraModifier_RotationLimiter, YaxMax) == 0x000054, "Member 'UCameraModifier_RotationLimiter::YaxMax' has a wrong offset!");
static_assert(offsetof(UCameraModifier_RotationLimiter, RollMin) == 0x000058, "Member 'UCameraModifier_RotationLimiter::RollMin' has a wrong offset!");
static_assert(offsetof(UCameraModifier_RotationLimiter, RollMax) == 0x00005C, "Member 'UCameraModifier_RotationLimiter::RollMax' has a wrong offset!");

// Class SandFall.CharacterSkinAssignPolicy
// 0x00A0 (0x00C8 - 0x0028)
class UCharacterSkinAssignPolicy : public UObject
{
public:
	TMulticastInlineDelegate<void(class AActor* NewBodySkinObject)> OnBodySkinAssigned;              // 0x0028(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class AActor* NewFaceSkinObject)> OnFaceSkinAssigned;              // 0x0038(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class AActor* NewBodySkinObject, class AActor* NewFaceSkinObject)> OnSkinAssignCompleted; // 0x0048(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	uint8                                         Pad_58[0x70];                                      // 0x0058(0x0070)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AssignBodyAndFaceSkin(class AActor* Owner, const class FName& CharacterName, const TSubclassOf<class AActor>& BodySkinClass, const TSubclassOf<class AActor>& FaceSkinClass);
	void AssignBodyAndFaceSkinAsync(class AActor* Owner, const class FName& CharacterName, const TSoftClassPtr<class UClass>& BodySkinClass, const TSoftClassPtr<class UClass>& FaceSkinClass);
	void AssignBodySkin(class AActor* Owner, const class FName& CharacterName, const TSubclassOf<class AActor>& BodySkinClass);
	void AssignBodySkinAsync(class AActor* Owner, const class FName& CharacterName, const TSoftClassPtr<class UClass>& BodySkinClass);
	void AssignFaceSkin(class AActor* Owner, const class FName& CharacterName, const TSubclassOf<class AActor>& FaceSkinClass);
	void AssignFaceSkinAsync(class AActor* Owner, const class FName& CharacterName, const TSoftClassPtr<class UClass>& FaceSkinClass);
	void InitSkinAssignPolicy();
	void OnSkinAssignPolicyDestroyed();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CharacterSkinAssignPolicy">();
	}
	static class UCharacterSkinAssignPolicy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCharacterSkinAssignPolicy>();
	}
};
static_assert(alignof(UCharacterSkinAssignPolicy) == 0x000008, "Wrong alignment on UCharacterSkinAssignPolicy");
static_assert(sizeof(UCharacterSkinAssignPolicy) == 0x0000C8, "Wrong size on UCharacterSkinAssignPolicy");
static_assert(offsetof(UCharacterSkinAssignPolicy, OnBodySkinAssigned) == 0x000028, "Member 'UCharacterSkinAssignPolicy::OnBodySkinAssigned' has a wrong offset!");
static_assert(offsetof(UCharacterSkinAssignPolicy, OnFaceSkinAssigned) == 0x000038, "Member 'UCharacterSkinAssignPolicy::OnFaceSkinAssigned' has a wrong offset!");
static_assert(offsetof(UCharacterSkinAssignPolicy, OnSkinAssignCompleted) == 0x000048, "Member 'UCharacterSkinAssignPolicy::OnSkinAssignCompleted' has a wrong offset!");

// Class SandFall.ConsoleUtils
// 0x0000 (0x0028 - 0x0028)
class UConsoleUtils final : public UBlueprintFunctionLibrary
{
public:
	static bool GetBoolCVar(class FName Name_0);
	static float GetFloatCVar(class FName Name_0);
	static int32 GetIntCVar(class FName Name_0);
	static class FString GetStringCVar(class FName Name_0);
	static bool IsCVarRegistered(class FName Name_0);
	static void SetBoolCVar(class FName Name_0, bool Value);
	static void SetFloatCVar(class FName Name_0, float Value);
	static void SetIntCVar(class FName Name_0, int32 Value);
	static void SetStringCVar(class FName Name_0, const class FString& Value);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ConsoleUtils">();
	}
	static class UConsoleUtils* GetDefaultObj()
	{
		return GetDefaultObjImpl<UConsoleUtils>();
	}
};
static_assert(alignof(UConsoleUtils) == 0x000008, "Wrong alignment on UConsoleUtils");
static_assert(sizeof(UConsoleUtils) == 0x000028, "Wrong size on UConsoleUtils");

// Class SandFall.CSAP_AssetAssign
// 0x0010 (0x00D8 - 0x00C8)
class UCSAP_AssetAssign final : public UCharacterSkinAssignPolicy
{
public:
	TSubclassOf<class AActor>                     m_ActiveBodySkinClass;                             // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class AActor>                     m_ActiveFaceSkinClass;                             // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CSAP_AssetAssign">();
	}
	static class UCSAP_AssetAssign* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCSAP_AssetAssign>();
	}
};
static_assert(alignof(UCSAP_AssetAssign) == 0x000008, "Wrong alignment on UCSAP_AssetAssign");
static_assert(sizeof(UCSAP_AssetAssign) == 0x0000D8, "Wrong size on UCSAP_AssetAssign");
static_assert(offsetof(UCSAP_AssetAssign, m_ActiveBodySkinClass) == 0x0000C8, "Member 'UCSAP_AssetAssign::m_ActiveBodySkinClass' has a wrong offset!");
static_assert(offsetof(UCSAP_AssetAssign, m_ActiveFaceSkinClass) == 0x0000D0, "Member 'UCSAP_AssetAssign::m_ActiveFaceSkinClass' has a wrong offset!");

// Class SandFall.CSAP_SwapAssign
// 0x0128 (0x01F0 - 0x00C8)
class UCSAP_SwapAssign final : public UCharacterSkinAssignPolicy
{
public:
	int32                                         CachePoolSize;                                     // 0x00C8(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class AActor>                     m_ActiveBodySkinClass;                             // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class AActor>                     m_ActiveFaceSkinClass;                             // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_E0[0xB0];                                      // 0x00E0(0x00B0)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USceneComponent*>                m_MainBodyChildrenComponents;                      // 0x0190(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	TMap<class USceneComponent*, bool>            m_MainBodyChildrenComponentVisibility;             // 0x01A0(0x0050)(ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)

public:
	void OnSettingsChanged(const class UConfigurableGameUserSettings* UserGameConfig);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CSAP_SwapAssign">();
	}
	static class UCSAP_SwapAssign* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCSAP_SwapAssign>();
	}
};
static_assert(alignof(UCSAP_SwapAssign) == 0x000008, "Wrong alignment on UCSAP_SwapAssign");
static_assert(sizeof(UCSAP_SwapAssign) == 0x0001F0, "Wrong size on UCSAP_SwapAssign");
static_assert(offsetof(UCSAP_SwapAssign, CachePoolSize) == 0x0000C8, "Member 'UCSAP_SwapAssign::CachePoolSize' has a wrong offset!");
static_assert(offsetof(UCSAP_SwapAssign, m_ActiveBodySkinClass) == 0x0000D0, "Member 'UCSAP_SwapAssign::m_ActiveBodySkinClass' has a wrong offset!");
static_assert(offsetof(UCSAP_SwapAssign, m_ActiveFaceSkinClass) == 0x0000D8, "Member 'UCSAP_SwapAssign::m_ActiveFaceSkinClass' has a wrong offset!");
static_assert(offsetof(UCSAP_SwapAssign, m_MainBodyChildrenComponents) == 0x000190, "Member 'UCSAP_SwapAssign::m_MainBodyChildrenComponents' has a wrong offset!");
static_assert(offsetof(UCSAP_SwapAssign, m_MainBodyChildrenComponentVisibility) == 0x0001A0, "Member 'UCSAP_SwapAssign::m_MainBodyChildrenComponentVisibility' has a wrong offset!");

// Class SandFall.CurveBlendingProfile
// 0x0050 (0x0080 - 0x0030)
class UCurveBlendingProfile final : public UPrimaryDataAsset
{
public:
	TMap<class FName, float>                      Profiles;                                          // 0x0030(0x0050)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CurveBlendingProfile">();
	}
	static class UCurveBlendingProfile* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCurveBlendingProfile>();
	}
};
static_assert(alignof(UCurveBlendingProfile) == 0x000008, "Wrong alignment on UCurveBlendingProfile");
static_assert(sizeof(UCurveBlendingProfile) == 0x000080, "Wrong size on UCurveBlendingProfile");
static_assert(offsetof(UCurveBlendingProfile, Profiles) == 0x000030, "Member 'UCurveBlendingProfile::Profiles' has a wrong offset!");

// Class SandFall.CurveModifyIntensityProfile
// 0x0050 (0x0080 - 0x0030)
class UCurveModifyIntensityProfile final : public UPrimaryDataAsset
{
public:
	TMap<class FName, struct FCurveIntensityData> Profiles;                                          // 0x0030(0x0050)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CurveModifyIntensityProfile">();
	}
	static class UCurveModifyIntensityProfile* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCurveModifyIntensityProfile>();
	}
};
static_assert(alignof(UCurveModifyIntensityProfile) == 0x000008, "Wrong alignment on UCurveModifyIntensityProfile");
static_assert(sizeof(UCurveModifyIntensityProfile) == 0x000080, "Wrong size on UCurveModifyIntensityProfile");
static_assert(offsetof(UCurveModifyIntensityProfile, Profiles) == 0x000030, "Member 'UCurveModifyIntensityProfile::Profiles' has a wrong offset!");

// Class SandFall.CVarChangeListener
// 0x0058 (0x0080 - 0x0028)
class UCVarChangeListener final : public UObject
{
public:
	uint8                                         Pad_28[0x58];                                      // 0x0028(0x0058)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CVarChangeListener">();
	}
	static class UCVarChangeListener* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCVarChangeListener>();
	}
};
static_assert(alignof(UCVarChangeListener) == 0x000008, "Wrong alignment on UCVarChangeListener");
static_assert(sizeof(UCVarChangeListener) == 0x000080, "Wrong size on UCVarChangeListener");

// Class SandFall.CVarChangeListenerManager
// 0x0050 (0x0078 - 0x0028)
class UCVarChangeListenerManager final : public UObject
{
public:
	TMap<class FName, class UCVarChangeListener*> Listeners;                                         // 0x0028(0x0050)(NativeAccessSpecifierPrivate)

public:
	static void AddBoolCVarCallbackStatic(class FName Name_0, TDelegate<void(bool NewValue)> ChangedCallback, bool CallbackImmediately);
	static void AddFloatCVarCallbackStatic(class FName Name_0, TDelegate<void(float NewValue)> ChangedCallback, bool CallbackImmediately);
	static void AddIntCVarCallbackStatic(class FName Name_0, TDelegate<void(int32 NewValue)> ChangedCallback, bool CallbackImmediately);
	static void AddStringCVarCallbackStatic(class FName Name_0, TDelegate<void(const class FString& NewValue)> ChangedCallback, bool CallbackImmediately);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CVarChangeListenerManager">();
	}
	static class UCVarChangeListenerManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCVarChangeListenerManager>();
	}
};
static_assert(alignof(UCVarChangeListenerManager) == 0x000008, "Wrong alignment on UCVarChangeListenerManager");
static_assert(sizeof(UCVarChangeListenerManager) == 0x000078, "Wrong size on UCVarChangeListenerManager");
static_assert(offsetof(UCVarChangeListenerManager, Listeners) == 0x000028, "Member 'UCVarChangeListenerManager::Listeners' has a wrong offset!");

// Class SandFall.EpicCamerasFunctionLibrary
// 0x0000 (0x0028 - 0x0028)
class UEpicCamerasFunctionLibrary final : public UBlueprintFunctionLibrary
{
public:
	static void FindAllBattleKeyframesInSequence(class ULevelSequence* _sequence, const struct FMovieSceneObjectBindingID& _actorBindingID, TArray<float>* _skillEffectWithQTETimes, TArray<float>* _skillEffectNoQTETimes, TArray<float>* _explicitComboPromptTimes, TArray<float>* _comboSectionStartTimes, float* _lastComboSectionEnd, TArray<float>* _comboFailSectionStartTimes, TArray<float>* _comboFailSectionEndTimes, TArray<float>* _snapToTargetTimes, TArray<float>* _snapToSourceTimes);
	static void FindAllBattleKeyframesInSequenceAsList(class ULevelSequence* _sequence, const struct FMovieSceneObjectBindingID& _actorBindingID, TArray<struct FBattleSequenceKeyframe>* _keyframes, int32 _trackIndex);
	static void FindAllBattleKeyframesInSequenceAsListFromTrackName(class ULevelSequence* _sequence, const struct FMovieSceneObjectBindingID& _actorBindingID, TArray<struct FBattleSequenceKeyframe>* _keyframes, const class FName _trackName);
	static void FindAllBattleKeyframesInSequenceAsMap(class ULevelSequence* _sequence, const struct FMovieSceneObjectBindingID& _actorBindingID, TMap<float, EBattleSequenceKeyframeType>* _keyframes, int32 _trackIndex);
	static void FindBattleCameraKeyframesInSequenceAsMap(class ULevelSequence* _sequence, const struct FMovieSceneObjectBindingID& _actorBindingID, TMap<float, EBattleSequenceCameraType>* _keyframes, int32 _trackIndex);
	static void FindBattleCameraKeyframesInSequenceAsMapFromTrackName(class ULevelSequence* _sequence, const struct FMovieSceneObjectBindingID& _actorBindingID, TMap<float, EBattleSequenceCameraType>* _keyframes, const class FName _trackName);
	static void FindBattleKeyframesInSequence(EBattleSequenceKeyframeType _keyframeType, class ULevelSequence* _sequence, const struct FMovieSceneObjectBindingID& _actorBindingID, TArray<float>* _times);
	static void FindQTEKeyframes(class ULevelSequence* _sequence, const struct FMovieSceneObjectBindingID& _actorBindingID, TArray<float>* ImpactTimes);
	static float GetCinematicTimeDilation(class UObject* _WorldContextObject);
	static struct FTransform GetInitialActorPositionInSequence(class ULevelSequence* _sequence, const struct FMovieSceneObjectBindingID& _bindingID);
	static void GetLinearTimeMapFromSequence(class ULevelSequence* _sequence, TMap<int32, float>* _linearTimeMap);
	static float GetRealTimeDilation(class UObject* _WorldContextObject);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EpicCamerasFunctionLibrary">();
	}
	static class UEpicCamerasFunctionLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEpicCamerasFunctionLibrary>();
	}
};
static_assert(alignof(UEpicCamerasFunctionLibrary) == 0x000008, "Wrong alignment on UEpicCamerasFunctionLibrary");
static_assert(sizeof(UEpicCamerasFunctionLibrary) == 0x000028, "Wrong size on UEpicCamerasFunctionLibrary");

// Class SandFall.SF_GameConfigurationSettings
// 0x0298 (0x02D0 - 0x0038)
class USF_GameConfigurationSettings final : public UDeveloperSettings
{
public:
	TSoftObjectPtr<class UPrimaryDataAsset>       ProjectConfiguration;                              // 0x0038(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UClass>                   DefaultLoadingScreenWidget;                        // 0x0060(0x0028)(Edit, Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UClass>                   DefaultSubtitlesWidget;                            // 0x0088(0x0028)(Edit, Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SubtitleMinDisplayTime;                            // 0x00B0(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class USF_DialogueSubtitleSpeakersData> SubtitleSpeakerData;                      // 0x00B8(0x0028)(Edit, Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSet<EDialogueTextSceneType>                  ForcedSubtitleDisplayScene;                        // 0x00E0(0x0050)(Edit, Config, NativeAccessSpecifierPublic)
	struct FSF_SettingsData                       DefaultSettingsValue;                              // 0x0130(0x0054)(Edit, Config, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_184[0x4];                                      // 0x0184(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FConsoleVariablesOverrideProfile       CvarOverrideDuringLevelLoading;                    // 0x0188(0x0140)(Edit, Config, NativeAccessSpecifierPublic)
	float                                         SizeAudioStreamingCacheTrimRequest;                // 0x02C8(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2CC[0x4];                                      // 0x02CC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SF_GameConfigurationSettings">();
	}
	static class USF_GameConfigurationSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<USF_GameConfigurationSettings>();
	}
};
static_assert(alignof(USF_GameConfigurationSettings) == 0x000008, "Wrong alignment on USF_GameConfigurationSettings");
static_assert(sizeof(USF_GameConfigurationSettings) == 0x0002D0, "Wrong size on USF_GameConfigurationSettings");
static_assert(offsetof(USF_GameConfigurationSettings, ProjectConfiguration) == 0x000038, "Member 'USF_GameConfigurationSettings::ProjectConfiguration' has a wrong offset!");
static_assert(offsetof(USF_GameConfigurationSettings, DefaultLoadingScreenWidget) == 0x000060, "Member 'USF_GameConfigurationSettings::DefaultLoadingScreenWidget' has a wrong offset!");
static_assert(offsetof(USF_GameConfigurationSettings, DefaultSubtitlesWidget) == 0x000088, "Member 'USF_GameConfigurationSettings::DefaultSubtitlesWidget' has a wrong offset!");
static_assert(offsetof(USF_GameConfigurationSettings, SubtitleMinDisplayTime) == 0x0000B0, "Member 'USF_GameConfigurationSettings::SubtitleMinDisplayTime' has a wrong offset!");
static_assert(offsetof(USF_GameConfigurationSettings, SubtitleSpeakerData) == 0x0000B8, "Member 'USF_GameConfigurationSettings::SubtitleSpeakerData' has a wrong offset!");
static_assert(offsetof(USF_GameConfigurationSettings, ForcedSubtitleDisplayScene) == 0x0000E0, "Member 'USF_GameConfigurationSettings::ForcedSubtitleDisplayScene' has a wrong offset!");
static_assert(offsetof(USF_GameConfigurationSettings, DefaultSettingsValue) == 0x000130, "Member 'USF_GameConfigurationSettings::DefaultSettingsValue' has a wrong offset!");
static_assert(offsetof(USF_GameConfigurationSettings, CvarOverrideDuringLevelLoading) == 0x000188, "Member 'USF_GameConfigurationSettings::CvarOverrideDuringLevelLoading' has a wrong offset!");
static_assert(offsetof(USF_GameConfigurationSettings, SizeAudioStreamingCacheTrimRequest) == 0x0002C8, "Member 'USF_GameConfigurationSettings::SizeAudioStreamingCacheTrimRequest' has a wrong offset!");

// Class SandFall.VariableWatcher_bool
// 0x0018 (0x0040 - 0x0028)
class UVariableWatcher_bool final : public UObject
{
public:
	TMulticastInlineDelegate<void(bool NewValue)> OnValueChangedEvent;                               // 0x0028(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	bool                                          Value;                                             // 0x0038(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool GetValue();
	void SetValue(bool _newValue);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VariableWatcher_bool">();
	}
	static class UVariableWatcher_bool* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVariableWatcher_bool>();
	}
};
static_assert(alignof(UVariableWatcher_bool) == 0x000008, "Wrong alignment on UVariableWatcher_bool");
static_assert(sizeof(UVariableWatcher_bool) == 0x000040, "Wrong size on UVariableWatcher_bool");
static_assert(offsetof(UVariableWatcher_bool, OnValueChangedEvent) == 0x000028, "Member 'UVariableWatcher_bool::OnValueChangedEvent' has a wrong offset!");
static_assert(offsetof(UVariableWatcher_bool, Value) == 0x000038, "Member 'UVariableWatcher_bool::Value' has a wrong offset!");

// Class SandFall.GlobalPostProcessActor
// 0x0000 (0x0290 - 0x0290)
class AGlobalPostProcessActor : public AActor
{
public:
	void UpdatePostProcessSaturation(float RGBMultiplier, float LuminanceMultiplier);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GlobalPostProcessActor">();
	}
	static class AGlobalPostProcessActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGlobalPostProcessActor>();
	}
};
static_assert(alignof(AGlobalPostProcessActor) == 0x000008, "Wrong alignment on AGlobalPostProcessActor");
static_assert(sizeof(AGlobalPostProcessActor) == 0x000290, "Wrong size on AGlobalPostProcessActor");

// Class SandFall.MyInterface
// 0x0000 (0x0000 - 0x0000)
class IMyInterface final
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MyInterface">();
	}
	static class IMyInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IMyInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
static_assert(alignof(IMyInterface) == 0x000001, "Wrong alignment on IMyInterface");
static_assert(sizeof(IMyInterface) == 0x000001, "Wrong size on IMyInterface");

// Class SandFall.MyObject
// 0x0000 (0x0028 - 0x0028)
class UMyObject final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MyObject">();
	}
	static class UMyObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMyObject>();
	}
};
static_assert(alignof(UMyObject) == 0x000008, "Wrong alignment on UMyObject");
static_assert(sizeof(UMyObject) == 0x000028, "Wrong size on UMyObject");

// Class SandFall.PlatformsSaveData
// 0x0068 (0x0090 - 0x0028)
class UPlatformsSaveData final : public USaveGame
{
public:
	TMap<class FName, float>                      FailedAchievementsMap;                             // 0x0028(0x0050)(NativeAccessSpecifierPrivate)
	class FString                                 LatestSaveGameLoaded;                              // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_88[0x8];                                       // 0x0088(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PlatformsSaveData">();
	}
	static class UPlatformsSaveData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlatformsSaveData>();
	}
};
static_assert(alignof(UPlatformsSaveData) == 0x000008, "Wrong alignment on UPlatformsSaveData");
static_assert(sizeof(UPlatformsSaveData) == 0x000090, "Wrong size on UPlatformsSaveData");
static_assert(offsetof(UPlatformsSaveData, FailedAchievementsMap) == 0x000028, "Member 'UPlatformsSaveData::FailedAchievementsMap' has a wrong offset!");
static_assert(offsetof(UPlatformsSaveData, LatestSaveGameLoaded) == 0x000078, "Member 'UPlatformsSaveData::LatestSaveGameLoaded' has a wrong offset!");

// Class SandFall.PlatformsSubsystem
// 0x0110 (0x0140 - 0x0030)
class UPlatformsSubsystem final : public UGameInstanceSubsystem
{
public:
	TMulticastInlineDelegate<void()>              OnControllerConfirmed;                             // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(bool bIsConnected)> OnControllerConnectionChanged;                 // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(bool bShouldPause)> OnPlatformPauseEvent;                          // 0x0050(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnLoggedInUserEvent;                               // 0x0060(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_70[0x90];                                      // 0x0070(0x0090)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TDelegate<void()>>                     GameStartedFromActivtyDelegatesContainer;          // 0x0100(0x0010)(ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	uint8                                         Pad_110[0x30];                                     // 0x0110(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool AttemptToLoginTheUser();
	void BindToGameStartedFromActivity(TDelegate<void()> Delegate);
	void ClearAllBindedEventToGameStartedFromActivity();
	bool ClearAllCloudSaves();
	TMap<class FName, float> GetAchievementsFromCurrentWriteRequest();
	const class FString GetCurrentUserNickname();
	class FString GetLatestGameSaveLoaded();
	bool IsGameStartedFromActivity();
	void LoadAndTriggerFailedAchievments();
	void OnExternalUIChange(bool Value);
	void OnUserIsLoggedIn(bool bIsUserLoggedIn);
	void OnUserIsSelected(bool bIsSellectedUserLoggedIn);
	void QueryAchievements();
	void QueryEntitlements();
	void RegisterLatestGameSaveLoaded(const class FString& SaveName);
	bool ResetAllAchievements();
	void ResetAllActivities();
	void SetActivityStatus(const class FString& ActivityID, EActivityStatus AcitivityStatus);
	void SetPS5ControllerLightColor(const struct FColor& Color, bool Enable);
	void SetRichPresence(const class FString& InRichPresenceStatus);
	void TriggerAchievement(TDelegate<void(const struct FAchievementsMap& AchievementsMap, const bool bSuccess)> TriggeredDelegate, const class FName& ID);
	void TriggerMultipleAchievements(TDelegate<void(const struct FAchievementsMap& AchievementsMap, const bool bSuccess)> TriggeredDelegate, const TMap<class FName, float>& AchievementsMap);

	class FString ComputeSaveNameWithPath(const class FString& SaveName) const;
	class FString GetCurrentUserID() const;
	struct FGameplayTag GetStoreNameAsTag() const;
	bool HasAllEntitlements(const TArray<class FName>& Entitlements) const;
	bool HasAnyEntitlement(const TArray<class FName>& Entitlements) const;
	bool IsChunkInstalled(int32 ChunkId) const;
	bool IsUserLoggedIn() const;
	bool IsUsingCloudSave() const;
	bool IsUsingSteam() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PlatformsSubsystem">();
	}
	static class UPlatformsSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlatformsSubsystem>();
	}
};
static_assert(alignof(UPlatformsSubsystem) == 0x000008, "Wrong alignment on UPlatformsSubsystem");
static_assert(sizeof(UPlatformsSubsystem) == 0x000140, "Wrong size on UPlatformsSubsystem");
static_assert(offsetof(UPlatformsSubsystem, OnControllerConfirmed) == 0x000030, "Member 'UPlatformsSubsystem::OnControllerConfirmed' has a wrong offset!");
static_assert(offsetof(UPlatformsSubsystem, OnControllerConnectionChanged) == 0x000040, "Member 'UPlatformsSubsystem::OnControllerConnectionChanged' has a wrong offset!");
static_assert(offsetof(UPlatformsSubsystem, OnPlatformPauseEvent) == 0x000050, "Member 'UPlatformsSubsystem::OnPlatformPauseEvent' has a wrong offset!");
static_assert(offsetof(UPlatformsSubsystem, OnLoggedInUserEvent) == 0x000060, "Member 'UPlatformsSubsystem::OnLoggedInUserEvent' has a wrong offset!");
static_assert(offsetof(UPlatformsSubsystem, GameStartedFromActivtyDelegatesContainer) == 0x000100, "Member 'UPlatformsSubsystem::GameStartedFromActivtyDelegatesContainer' has a wrong offset!");

// Class SandFall.ReloadConfigActor
// 0x0008 (0x0298 - 0x0290)
class AReloadConfigActor final : public AActor
{
public:
	bool                                          ReloadConfig;                                      // 0x0290(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_291[0x7];                                      // 0x0291(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ReloadConfigActor">();
	}
	static class AReloadConfigActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AReloadConfigActor>();
	}
};
static_assert(alignof(AReloadConfigActor) == 0x000008, "Wrong alignment on AReloadConfigActor");
static_assert(sizeof(AReloadConfigActor) == 0x000298, "Wrong size on AReloadConfigActor");
static_assert(offsetof(AReloadConfigActor, ReloadConfig) == 0x000290, "Member 'AReloadConfigActor::ReloadConfig' has a wrong offset!");

// Class SandFall.SF_ActivityWrapper
// 0x0068 (0x0098 - 0x0030)
class USF_ActivityWrapper final : public UPrimaryDataAsset
{
public:
	class FString                                 ActivityID;                                        // 0x0030(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   MappedToQuestID;                                   // 0x0040(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TMap<class FString, struct FActivityTask>     ActivityTasks;                                     // 0x0048(0x0050)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)

public:
	class FString GetActivityID();
	TArray<class FString> GetAllTasks();
	class FString GetSubTaskID(class FName TaskName);
	bool IsMappedToActivity(class FName QuestID);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SF_ActivityWrapper">();
	}
	static class USF_ActivityWrapper* GetDefaultObj()
	{
		return GetDefaultObjImpl<USF_ActivityWrapper>();
	}
};
static_assert(alignof(USF_ActivityWrapper) == 0x000008, "Wrong alignment on USF_ActivityWrapper");
static_assert(sizeof(USF_ActivityWrapper) == 0x000098, "Wrong size on USF_ActivityWrapper");
static_assert(offsetof(USF_ActivityWrapper, ActivityID) == 0x000030, "Member 'USF_ActivityWrapper::ActivityID' has a wrong offset!");
static_assert(offsetof(USF_ActivityWrapper, MappedToQuestID) == 0x000040, "Member 'USF_ActivityWrapper::MappedToQuestID' has a wrong offset!");
static_assert(offsetof(USF_ActivityWrapper, ActivityTasks) == 0x000048, "Member 'USF_ActivityWrapper::ActivityTasks' has a wrong offset!");

// Class SandFall.ActorComoponentHelpers
// 0x0000 (0x0028 - 0x0028)
class UActorComoponentHelpers final : public UBlueprintFunctionLibrary
{
public:
	static bool ChangeOwner(class UActorComponent* Component, class AActor* NewOwner);
	static void DestroyComponentExternally(class UActorComponent* ComponentToDestroy);
	static bool HasComponentBegunPlay(class UActorComponent* Component);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ActorComoponentHelpers">();
	}
	static class UActorComoponentHelpers* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActorComoponentHelpers>();
	}
};
static_assert(alignof(UActorComoponentHelpers) == 0x000008, "Wrong alignment on UActorComoponentHelpers");
static_assert(sizeof(UActorComoponentHelpers) == 0x000028, "Wrong size on UActorComoponentHelpers");

// Class SandFall.ActorSpawnWatcherInterface
// 0x0000 (0x0000 - 0x0000)
class IActorSpawnWatcherInterface final
{
public:
	bool OnInstigatedActorSpawned(class AActor* SpawnedActor);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ActorSpawnWatcherInterface">();
	}
	static class IActorSpawnWatcherInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IActorSpawnWatcherInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
static_assert(alignof(IActorSpawnWatcherInterface) == 0x000001, "Wrong alignment on IActorSpawnWatcherInterface");
static_assert(sizeof(IActorSpawnWatcherInterface) == 0x000001, "Wrong size on IActorSpawnWatcherInterface");

// Class SandFall.SF_ActorWatcherSubSystem
// 0x0008 (0x0038 - 0x0030)
class USF_ActorWatcherSubSystem final : public UWorldSubsystem
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SF_ActorWatcherSubSystem">();
	}
	static class USF_ActorWatcherSubSystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<USF_ActorWatcherSubSystem>();
	}
};
static_assert(alignof(USF_ActorWatcherSubSystem) == 0x000008, "Wrong alignment on USF_ActorWatcherSubSystem");
static_assert(sizeof(USF_ActorWatcherSubSystem) == 0x000038, "Wrong size on USF_ActorWatcherSubSystem");

// Class SandFall.AIHelpers
// 0x0000 (0x0028 - 0x0028)
class UAIHelpers final : public UBlueprintFunctionLibrary
{
public:
	static void PauseLogic(class UBrainComponent* BrainComponent, const class FString& DebugReason);
	static void ResumeLogic(class UBrainComponent* BrainComponent, const class FString& Reason);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AIHelpers">();
	}
	static class UAIHelpers* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAIHelpers>();
	}
};
static_assert(alignof(UAIHelpers) == 0x000008, "Wrong alignment on UAIHelpers");
static_assert(sizeof(UAIHelpers) == 0x000028, "Wrong size on UAIHelpers");

// Class SandFall.SF_AnimationBlueprintHelpers
// 0x0000 (0x0028 - 0x0028)
class USF_AnimationBlueprintHelpers final : public UBlueprintFunctionLibrary
{
public:
	static TArray<class UAnimMontage*> GetAllActiveMontages(class UAnimInstance* AnimInstance);
	static void GetAnimDataModelBoneTrackData(const TScriptInterface<class IAnimationDataModel> DataModel, const class FName TrackName, TArray<struct FVector>* PositionKeys, TArray<struct FQuat>* RotationKeys, TArray<struct FVector>* ScalingKeys);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SF_AnimationBlueprintHelpers">();
	}
	static class USF_AnimationBlueprintHelpers* GetDefaultObj()
	{
		return GetDefaultObjImpl<USF_AnimationBlueprintHelpers>();
	}
};
static_assert(alignof(USF_AnimationBlueprintHelpers) == 0x000008, "Wrong alignment on USF_AnimationBlueprintHelpers");
static_assert(sizeof(USF_AnimationBlueprintHelpers) == 0x000028, "Wrong size on USF_AnimationBlueprintHelpers");

// Class SandFall.SF_AsyncActionDeleteSaveGame
// 0x0028 (0x0058 - 0x0030)
class USF_AsyncActionDeleteSaveGame final : public UBlueprintAsyncActionBase
{
public:
	TMulticastInlineDelegate<void(bool bSuccess)> Completed;                                         // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_40[0x18];                                      // 0x0040(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class USF_AsyncActionDeleteSaveGame* AsyncDeleteGameFromSlot(class UObject* WorldContextObject, const class FString& SlotName, const int32 UserIndex);
	static class USF_AsyncActionDeleteSaveGame* AsyncDeleteGamesFromSlot(class UObject* WorldContextObject, const TArray<class FString>& SlotNames, const int32 UserIndex);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SF_AsyncActionDeleteSaveGame">();
	}
	static class USF_AsyncActionDeleteSaveGame* GetDefaultObj()
	{
		return GetDefaultObjImpl<USF_AsyncActionDeleteSaveGame>();
	}
};
static_assert(alignof(USF_AsyncActionDeleteSaveGame) == 0x000008, "Wrong alignment on USF_AsyncActionDeleteSaveGame");
static_assert(sizeof(USF_AsyncActionDeleteSaveGame) == 0x000058, "Wrong size on USF_AsyncActionDeleteSaveGame");
static_assert(offsetof(USF_AsyncActionDeleteSaveGame, Completed) == 0x000030, "Member 'USF_AsyncActionDeleteSaveGame::Completed' has a wrong offset!");

// Class SandFall.BakedActors
// 0x0010 (0x02A0 - 0x0290)
class ABakedActors final : public AActor
{
public:
	TArray<TSoftObjectPtr<class AActor>>          BakedActors;                                       // 0x0290(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, Protected, UObjectWrapper, NativeAccessSpecifierProtected)

public:
	bool BakeActors();
	TSubclassOf<class AActor> GetActorClassToSpawn();
	class FString GetBakedActorsFolderName();
	const TArray<struct FTransform> GetBakedActorTransforms();
	void TryDestroyAllBakedActors();

	bool HasAnyBakedActor() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BakedActors">();
	}
	static class ABakedActors* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABakedActors>();
	}
};
static_assert(alignof(ABakedActors) == 0x000008, "Wrong alignment on ABakedActors");
static_assert(sizeof(ABakedActors) == 0x0002A0, "Wrong size on ABakedActors");
static_assert(offsetof(ABakedActors, BakedActors) == 0x000290, "Member 'ABakedActors::BakedActors' has a wrong offset!");

// Class SandFall.SandfallBlueprintHelpers
// 0x0000 (0x0028 - 0x0028)
class USandfallBlueprintHelpers final : public UBlueprintFunctionLibrary
{
public:
	static void Array_Remap(const TArray<int32>& TargetArray, const TMap<int32, int32>& RemapTable, TArray<int32>* ResultArray);
	static void Assert(const bool _check, const class FText& _message, const bool _breakpoint);
	static void AssertMessage(const class FString& _message, const bool _breakpoint);
	static class AActor* BeginDeferredActorSpawnFromClass(const class UObject* WorldContextObject, TSubclassOf<class AActor> ActorClass, const struct FTransform& SpawnTransform, ESpawnActorCollisionHandlingMethod CollisionHandlingOverride, class AActor* Owner, ESpawnActorScaleMethod TransformScaleMethod);
	static void BlockTillLevelStreamingCompleted(class UObject* WorldContextObject);
	static void CallFunctionByName(class UObject* _object, const class FString& _functionName, bool* _IsFailed);
	static void CancelLatentActions(class UObject* WorldContextObject, class UObject* Object);
	static bool CheckEntitlement(class UWorld* _worldContext);
	static int32 CompareStrings(const class FString& A, const class FString& B);
	static void ConvertSoftRefToWorldSoftRef(const TSoftObjectPtr<class UObject>& _InObject, TSoftObjectPtr<class UWorld>* _OutWorldSoftRef);
	static void CopyAllProperties(class UObject* FromObject, class UObject* ToObject, bool bIncludeComponents);
	static class UObject* DebugConstructFromClass(class UClass* _class, class UObject* _owner);
	static void DebugCppBreakpoint();
	static class UClass* DebugFindClassByName(const class FString& _className);
	static void DebugMe(class UObject* _objectToDebug);
	static void DrawDebugCircleArc(const class UObject* WorldContextObject, const struct FVector& Center, float Radius, const struct FVector& Direction, float AngleWidth, int32 Segments, const struct FLinearColor& Color, float Lifetime, float Thickness);
	static bool Editor_FileDelete(const class FString& Filename);
	static bool Editor_FileLoadString(const class FString& Filename, class FString* Content);
	static bool Editor_FileLoadStringReal(const class FString& Filename, class FString* Content);
	static bool Editor_FileSaveString(const class FString& Content, const class FString& Filename);
	static bool Editor_GetShaderCompilationState(int32* jobCount, int32* workerCount);
	static bool Editor_GetStatValue(const class FName _StatGroup, const class FName _StatName, bool _isMemory, class FString* _OutValue);
	static bool Editor_MoveScreenshots(const class FString& _sourceFile, const class FString& _destination);
	static void Editor_PushJSONToMongoDB(const class FString& Json);
	static void Editor_TakeScreenshot(const class FString& _filename, bool _showUI);
	static void EditorAlert(const class FText& _text);
	static bool EqualsObjects(const class UObject* A, const class UObject* B);
	static class FString EscapeJson(const class FString& Input);
	static void ExecuteDelegate(TDelegate<void()> Delegate);
	static class AActor* FinishSpawningActor(class AActor* Actor, const struct FTransform& SpawnTransform, ESpawnActorScaleMethod TransformScaleMethod);
	static void FlushInputs(class APlayerController* PlayerController);
	static class FString Format(const class FString& InPattern, const TArray<struct FFormatArgumentData>& InArgs);
	static class FString FormatDateTime(const struct FDateTime& DateTime);
	static class FString FormatDateTimeWithPattern(const struct FDateTime& DateTime, const class FString& FormatString);
	static class FString FormatTimespan(const struct FTimespan& Timespan);
	static class FString FormatTimespanWithPattern(const struct FTimespan& Timespan, const class FString& FormatString);
	static void GetAllComponentsByClass(class UWorld* World, TSubclassOf<class UActorComponent> Class_0, TArray<class UActorComponent*>* Components);
	static void GetAllLightComponents(class UWorld* World, TArray<class ULightComponent*>* LightComponents);
	static void GetBuildInfo(class UObject* WorldContextObject, class FString* Changelist, class FString* CurrentPersistentLevel);
	static void GetCameraCutTrackSettings(const class UMovieSceneCameraCutTrack* CameraCutTrack, bool* SectionFound, bool* CanBlend, bool* HasEasing, bool* IsPreviousCameraLocked);
	static class UObject* GetClassDefaultObject(class UClass* Object);
	static class UActorComponent* GetComponentFromReference(const struct FComponentReference& ComponentReference, class AActor* OwningActor);
	static void GetDataTableRowFromName(class UDataTable* Table, class FName RowName, struct FTableRowBase* OutRow);
	static class FString GetDebugInfo();
	static struct FTransform GetEditorViewportTransform();
	static float GetLastRenderTimeOnScreen(const class UPrimitiveComponent* Primitive);
	static float GetMaxDistanceAttenuation(class USoundBase* Sound);
	static struct FGameplayTag GetPlatformNameAsTag();
	static TArray<class FName> GetSamplingRegionNames(class USkeletalMesh* SkeletalMeshAsset);
	static TArray<class FString> GetStackTrace();
	static class FString GetUpscalerInfo();
	static void GetVendorBuildInfo(class UObject* WorldContextObject, class FString* OwnerInfo, class FString* BuildInfo);
	static bool HasActorBegunPlay(const class AActor* Actor);
	static bool IsActorSpatiallyLoaded(const class AActor* Actor);
	static bool isCollisionProfileValid(class FName ProfileName);
	static bool IsCurrentConsoleTypeLockheart();
	static bool IsEventDispatcherConnected(class UObject* Object, class FName EventDispatcherName);
	static bool IsInPlayMode();
	static bool IsInSimulateMode();
	static bool IsPackagedBuild();
	static bool IsPawnInputEnabled(const class APawn* _actor);
	static bool IsRunningAutomationTest();
	static bool IsRunningOnSteamDeck();
	static class UOutputDeviceWrapper* MakeLogOutputCapture();
	static void Map_Remap(const TMap<int32, int32>& TargetMap, const TMap<int32, int32>& RemapTable, TMap<int32, int32>* ResultMap);
	static void Map_ToString(const TMap<int32, int32>& TargetMap, TArray<class FString>* OutStringList);
	static void MemTraceUserMark(const class FString& userMark);
	static struct FTransform OffsetTransform(const struct FTransform& StartTransform, float ForwardOffset, float UpOffset);
	static void OverrideBoolCVar(const class FName _name, bool _value);
	static TArray<class FString> ParseIntoArrayLines(const class FString& In, bool CullEmpty);
	static void PrintStringInLog(const class UObject* WorldContextObject, const class FString& InString);
	static void Refresh3DEditorViewport();
	static void RegisterBoolCVar(const class FName _name, bool _defaultValue, const class FText& _description);
	static void RegisterInputAction(class UObject* WorldContextObject, class FName InputAction, TDelegate<void()> OnPressed);
	static void RegisterIntegerCVar(const class FName _name, const int32 _defaultValue, const class FText& _description);
	static void RegisterStringCVar(const class FName _name, const class FString& _defaultValue, const class FText& _description);
	static void ReloadActor(class AActor* Actor);
	static bool RemoveMaterialInstanceParameterOverride(class UMaterialInstanceConstant* _MaterialInstance, const class FName& _ParameterName);
	static bool RemoveMaterialInstanceStaticSwitchOverride(class UMaterialInstanceConstant* _MaterialInstance, const class FName& _ParameterName);
	static void RequestToTrimAudioStreamingCache();
	static void ResetAllProperties(class UObject* Object, bool bIncludeComponents);
	static void ResetMaterialInstanceTextureStreamingData(class UMaterialInstanceConstant* _MaterialInstance);
	static void SetActorIsEditorOnly(class AActor* Actor, bool bIsEditorOnly);
	static void SetActorIsSpatiallyLoaded(class AActor* Actor, bool bIsSpatiallyLoaded);
	static void SetComponentIsEditorOnly(class UActorComponent* ActorComponent, bool bIsEditorOnly);
	static void SetTimeDilationEnabledForSequencePlayer(const class UMovieSceneSequencePlayer* SequencePlayer, bool Enabled);
	static struct FTimerHandle SetTimerDelegate(TDelegate<void()> Delegate, float Time, bool bLooping, float InitialStartDelay, float InitialStartDelayVariance);
	static void StartMemTrace(const class FString& ip, int32 Port);
	static void StopMemTrace();
	static void TestMemTrace(const class FString& ip, int32 Port);
	static void TriggerMouseLMBDown(const struct FVector2D& CursorPosition);
	static void TriggerMouseLMBUp(const struct FVector2D& CursorPosition);
	static class UClass* TryGetBlueprintClass(class UObject* Object);
	static void UpdateFloatingObjectsTransform(const class UObject* WorldContextObject, const TArray<class USceneComponent*>& Objects, const TArray<struct FVector>& SpeedVectors, const TArray<struct FVector>& RandomLocations, const TArray<double>& RotatorSpeeds, const TArray<double>& MovingDistances, const TArray<int32>& MultiplierRemapArray);
	static void UpdateWPRuntimeHashSetRuntimeStreamingDataLoadingRange(const class UObject* WorldContextObject, class FName RuntimeStreamingDataName, int32 NewLoadingRange);
	static void WaitForLatentAction(const class UObject* WorldContextObject, const struct FLatentActionInfo& LatentInfo, class USF_BlueprintLatentAction* LatentBlueprintAction);
	static void WaitTillLevelStreamingCompleted(class UObject* WorldContextObject, const struct FLatentActionInfo& LatentInfo, const TArray<class UWorldPartitionStreamingSourceComponent*>& SourceComponents, bool AddPlayerControllerSource);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SandfallBlueprintHelpers">();
	}
	static class USandfallBlueprintHelpers* GetDefaultObj()
	{
		return GetDefaultObjImpl<USandfallBlueprintHelpers>();
	}
};
static_assert(alignof(USandfallBlueprintHelpers) == 0x000008, "Wrong alignment on USandfallBlueprintHelpers");
static_assert(sizeof(USandfallBlueprintHelpers) == 0x000028, "Wrong size on USandfallBlueprintHelpers");

// Class SandFall.LZAsyncAction_RequestHttpMessage
// 0x0020 (0x0050 - 0x0030)
class ULZAsyncAction_RequestHttpMessage final : public UBlueprintAsyncActionBase
{
public:
	TMulticastInlineDelegate<void(const class FString& _content, bool bSuccess)> Completed;          // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_40[0x10];                                      // 0x0040(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class ULZAsyncAction_RequestHttpMessage* AsyncRequestHTTP(class UObject* WorldContextObject, const class FString& URL);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LZAsyncAction_RequestHttpMessage">();
	}
	static class ULZAsyncAction_RequestHttpMessage* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULZAsyncAction_RequestHttpMessage>();
	}
};
static_assert(alignof(ULZAsyncAction_RequestHttpMessage) == 0x000008, "Wrong alignment on ULZAsyncAction_RequestHttpMessage");
static_assert(sizeof(ULZAsyncAction_RequestHttpMessage) == 0x000050, "Wrong size on ULZAsyncAction_RequestHttpMessage");
static_assert(offsetof(ULZAsyncAction_RequestHttpMessage, Completed) == 0x000030, "Member 'ULZAsyncAction_RequestHttpMessage::Completed' has a wrong offset!");

// Class SandFall.OutputDeviceWrapper
// 0x0050 (0x0078 - 0x0028)
class UOutputDeviceWrapper final : public UObject
{
public:
	uint8                                         Pad_28[0x50];                                      // 0x0028(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class FString Flush();
	void Unregister();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OutputDeviceWrapper">();
	}
	static class UOutputDeviceWrapper* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOutputDeviceWrapper>();
	}
};
static_assert(alignof(UOutputDeviceWrapper) == 0x000008, "Wrong alignment on UOutputDeviceWrapper");
static_assert(sizeof(UOutputDeviceWrapper) == 0x000078, "Wrong size on UOutputDeviceWrapper");

// Class SandFall.SF_ReferenceCounterWrapper
// 0x0020 (0x0048 - 0x0028)
class USF_ReferenceCounterWrapper final : public UObject
{
public:
	struct FSF_ReferenceCounter                   ReferenceCounter;                                  // 0x0028(0x0020)(BlueprintVisible, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
