#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SEQ_SkillNoah_RangeCounter1

#include "Basic.hpp"

#include "EOnoType_structs.hpp"


namespace SDK::Params
{

// Function SEQ_SkillNoah_RangeCounter1.SEQ_SkillNoah_RangeCounter1_DirectorBP_C.BP_AudioCharacter_BattleManager_Event
// 0x0010 (0x0010 - 0x0000)
struct SEQ_SkillNoah_RangeCounter1_DirectorBP_C_BP_AudioCharacter_BattleManager_Event final
{
public:
	class UBP_AudioCharacter_BattleManager_C*     BP_AudioCharacter_BattleManager;                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Battle_PlaySeqFoley;                               // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SEQ_SkillNoah_RangeCounter1_DirectorBP_C_BP_AudioCharacter_BattleManager_Event) == 0x000008, "Wrong alignment on SEQ_SkillNoah_RangeCounter1_DirectorBP_C_BP_AudioCharacter_BattleManager_Event");
static_assert(sizeof(SEQ_SkillNoah_RangeCounter1_DirectorBP_C_BP_AudioCharacter_BattleManager_Event) == 0x000010, "Wrong size on SEQ_SkillNoah_RangeCounter1_DirectorBP_C_BP_AudioCharacter_BattleManager_Event");
static_assert(offsetof(SEQ_SkillNoah_RangeCounter1_DirectorBP_C_BP_AudioCharacter_BattleManager_Event, BP_AudioCharacter_BattleManager) == 0x000000, "Member 'SEQ_SkillNoah_RangeCounter1_DirectorBP_C_BP_AudioCharacter_BattleManager_Event::BP_AudioCharacter_BattleManager' has a wrong offset!");
static_assert(offsetof(SEQ_SkillNoah_RangeCounter1_DirectorBP_C_BP_AudioCharacter_BattleManager_Event, Battle_PlaySeqFoley) == 0x000008, "Member 'SEQ_SkillNoah_RangeCounter1_DirectorBP_C_BP_AudioCharacter_BattleManager_Event::Battle_PlaySeqFoley' has a wrong offset!");

// Function SEQ_SkillNoah_RangeCounter1.SEQ_SkillNoah_RangeCounter1_DirectorBP_C.BP_AudioCharacter_BattleManager_Event_0
// 0x0010 (0x0010 - 0x0000)
struct SEQ_SkillNoah_RangeCounter1_DirectorBP_C_BP_AudioCharacter_BattleManager_Event_0 final
{
public:
	class UBP_AudioCharacter_BattleManager_C*     BP_AudioCharacter_BattleManager;                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Battle_PlaySeqFoley;                               // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SEQ_SkillNoah_RangeCounter1_DirectorBP_C_BP_AudioCharacter_BattleManager_Event_0) == 0x000008, "Wrong alignment on SEQ_SkillNoah_RangeCounter1_DirectorBP_C_BP_AudioCharacter_BattleManager_Event_0");
static_assert(sizeof(SEQ_SkillNoah_RangeCounter1_DirectorBP_C_BP_AudioCharacter_BattleManager_Event_0) == 0x000010, "Wrong size on SEQ_SkillNoah_RangeCounter1_DirectorBP_C_BP_AudioCharacter_BattleManager_Event_0");
static_assert(offsetof(SEQ_SkillNoah_RangeCounter1_DirectorBP_C_BP_AudioCharacter_BattleManager_Event_0, BP_AudioCharacter_BattleManager) == 0x000000, "Member 'SEQ_SkillNoah_RangeCounter1_DirectorBP_C_BP_AudioCharacter_BattleManager_Event_0::BP_AudioCharacter_BattleManager' has a wrong offset!");
static_assert(offsetof(SEQ_SkillNoah_RangeCounter1_DirectorBP_C_BP_AudioCharacter_BattleManager_Event_0, Battle_PlaySeqFoley) == 0x000008, "Member 'SEQ_SkillNoah_RangeCounter1_DirectorBP_C_BP_AudioCharacter_BattleManager_Event_0::Battle_PlaySeqFoley' has a wrong offset!");

// Function SEQ_SkillNoah_RangeCounter1.SEQ_SkillNoah_RangeCounter1_DirectorBP_C.BP_AudioCharacter_BattleManager_Event_1
// 0x0010 (0x0010 - 0x0000)
struct SEQ_SkillNoah_RangeCounter1_DirectorBP_C_BP_AudioCharacter_BattleManager_Event_1 final
{
public:
	class UBP_AudioCharacter_BattleManager_C*     BP_AudioCharacter_BattleManager;                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Battle_PlaySeqSFX;                                 // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SEQ_SkillNoah_RangeCounter1_DirectorBP_C_BP_AudioCharacter_BattleManager_Event_1) == 0x000008, "Wrong alignment on SEQ_SkillNoah_RangeCounter1_DirectorBP_C_BP_AudioCharacter_BattleManager_Event_1");
static_assert(sizeof(SEQ_SkillNoah_RangeCounter1_DirectorBP_C_BP_AudioCharacter_BattleManager_Event_1) == 0x000010, "Wrong size on SEQ_SkillNoah_RangeCounter1_DirectorBP_C_BP_AudioCharacter_BattleManager_Event_1");
static_assert(offsetof(SEQ_SkillNoah_RangeCounter1_DirectorBP_C_BP_AudioCharacter_BattleManager_Event_1, BP_AudioCharacter_BattleManager) == 0x000000, "Member 'SEQ_SkillNoah_RangeCounter1_DirectorBP_C_BP_AudioCharacter_BattleManager_Event_1::BP_AudioCharacter_BattleManager' has a wrong offset!");
static_assert(offsetof(SEQ_SkillNoah_RangeCounter1_DirectorBP_C_BP_AudioCharacter_BattleManager_Event_1, Battle_PlaySeqSFX) == 0x000008, "Member 'SEQ_SkillNoah_RangeCounter1_DirectorBP_C_BP_AudioCharacter_BattleManager_Event_1::Battle_PlaySeqSFX' has a wrong offset!");

// Function SEQ_SkillNoah_RangeCounter1.SEQ_SkillNoah_RangeCounter1_DirectorBP_C.BP_AudioCharacter_BattleManager_Event_2
// 0x0010 (0x0010 - 0x0000)
struct SEQ_SkillNoah_RangeCounter1_DirectorBP_C_BP_AudioCharacter_BattleManager_Event_2 final
{
public:
	class UBP_AudioCharacter_BattleManager_C*     BP_AudioCharacter_BattleManager;                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Battle_PlaySeqFoley;                               // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SEQ_SkillNoah_RangeCounter1_DirectorBP_C_BP_AudioCharacter_BattleManager_Event_2) == 0x000008, "Wrong alignment on SEQ_SkillNoah_RangeCounter1_DirectorBP_C_BP_AudioCharacter_BattleManager_Event_2");
static_assert(sizeof(SEQ_SkillNoah_RangeCounter1_DirectorBP_C_BP_AudioCharacter_BattleManager_Event_2) == 0x000010, "Wrong size on SEQ_SkillNoah_RangeCounter1_DirectorBP_C_BP_AudioCharacter_BattleManager_Event_2");
static_assert(offsetof(SEQ_SkillNoah_RangeCounter1_DirectorBP_C_BP_AudioCharacter_BattleManager_Event_2, BP_AudioCharacter_BattleManager) == 0x000000, "Member 'SEQ_SkillNoah_RangeCounter1_DirectorBP_C_BP_AudioCharacter_BattleManager_Event_2::BP_AudioCharacter_BattleManager' has a wrong offset!");
static_assert(offsetof(SEQ_SkillNoah_RangeCounter1_DirectorBP_C_BP_AudioCharacter_BattleManager_Event_2, Battle_PlaySeqFoley) == 0x000008, "Member 'SEQ_SkillNoah_RangeCounter1_DirectorBP_C_BP_AudioCharacter_BattleManager_Event_2::Battle_PlaySeqFoley' has a wrong offset!");

// Function SEQ_SkillNoah_RangeCounter1.SEQ_SkillNoah_RangeCounter1_DirectorBP_C.BP_AudioCharacter_BattleManager_Event_3
// 0x0010 (0x0010 - 0x0000)
struct SEQ_SkillNoah_RangeCounter1_DirectorBP_C_BP_AudioCharacter_BattleManager_Event_3 final
{
public:
	class UBP_AudioCharacter_BattleManager_C*     BP_AudioCharacter_BattleManager;                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USoundControlBusMix*                    Activate_ControlBusMix;                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SEQ_SkillNoah_RangeCounter1_DirectorBP_C_BP_AudioCharacter_BattleManager_Event_3) == 0x000008, "Wrong alignment on SEQ_SkillNoah_RangeCounter1_DirectorBP_C_BP_AudioCharacter_BattleManager_Event_3");
static_assert(sizeof(SEQ_SkillNoah_RangeCounter1_DirectorBP_C_BP_AudioCharacter_BattleManager_Event_3) == 0x000010, "Wrong size on SEQ_SkillNoah_RangeCounter1_DirectorBP_C_BP_AudioCharacter_BattleManager_Event_3");
static_assert(offsetof(SEQ_SkillNoah_RangeCounter1_DirectorBP_C_BP_AudioCharacter_BattleManager_Event_3, BP_AudioCharacter_BattleManager) == 0x000000, "Member 'SEQ_SkillNoah_RangeCounter1_DirectorBP_C_BP_AudioCharacter_BattleManager_Event_3::BP_AudioCharacter_BattleManager' has a wrong offset!");
static_assert(offsetof(SEQ_SkillNoah_RangeCounter1_DirectorBP_C_BP_AudioCharacter_BattleManager_Event_3, Activate_ControlBusMix) == 0x000008, "Member 'SEQ_SkillNoah_RangeCounter1_DirectorBP_C_BP_AudioCharacter_BattleManager_Event_3::Activate_ControlBusMix' has a wrong offset!");

// Function SEQ_SkillNoah_RangeCounter1.SEQ_SkillNoah_RangeCounter1_DirectorBP_C.BP_AudioCharacter_BattleManager_Event_4
// 0x0010 (0x0010 - 0x0000)
struct SEQ_SkillNoah_RangeCounter1_DirectorBP_C_BP_AudioCharacter_BattleManager_Event_4 final
{
public:
	class UBP_AudioCharacter_BattleManager_C*     BP_AudioCharacter_BattleManager;                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USoundControlBusMix*                    Deactivate_ControlBusMix;                          // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SEQ_SkillNoah_RangeCounter1_DirectorBP_C_BP_AudioCharacter_BattleManager_Event_4) == 0x000008, "Wrong alignment on SEQ_SkillNoah_RangeCounter1_DirectorBP_C_BP_AudioCharacter_BattleManager_Event_4");
static_assert(sizeof(SEQ_SkillNoah_RangeCounter1_DirectorBP_C_BP_AudioCharacter_BattleManager_Event_4) == 0x000010, "Wrong size on SEQ_SkillNoah_RangeCounter1_DirectorBP_C_BP_AudioCharacter_BattleManager_Event_4");
static_assert(offsetof(SEQ_SkillNoah_RangeCounter1_DirectorBP_C_BP_AudioCharacter_BattleManager_Event_4, BP_AudioCharacter_BattleManager) == 0x000000, "Member 'SEQ_SkillNoah_RangeCounter1_DirectorBP_C_BP_AudioCharacter_BattleManager_Event_4::BP_AudioCharacter_BattleManager' has a wrong offset!");
static_assert(offsetof(SEQ_SkillNoah_RangeCounter1_DirectorBP_C_BP_AudioCharacter_BattleManager_Event_4, Deactivate_ControlBusMix) == 0x000008, "Member 'SEQ_SkillNoah_RangeCounter1_DirectorBP_C_BP_AudioCharacter_BattleManager_Event_4::Deactivate_ControlBusMix' has a wrong offset!");

// Function SEQ_SkillNoah_RangeCounter1.SEQ_SkillNoah_RangeCounter1_DirectorBP_C.BP_AudioCharacter_BattleManager_Event_5
// 0x0010 (0x0010 - 0x0000)
struct SEQ_SkillNoah_RangeCounter1_DirectorBP_C_BP_AudioCharacter_BattleManager_Event_5 final
{
public:
	class UBP_AudioCharacter_BattleManager_C*     BP_AudioCharacter_BattleManager;                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USoundControlBusMix*                    Activate_ControlBusMix;                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SEQ_SkillNoah_RangeCounter1_DirectorBP_C_BP_AudioCharacter_BattleManager_Event_5) == 0x000008, "Wrong alignment on SEQ_SkillNoah_RangeCounter1_DirectorBP_C_BP_AudioCharacter_BattleManager_Event_5");
static_assert(sizeof(SEQ_SkillNoah_RangeCounter1_DirectorBP_C_BP_AudioCharacter_BattleManager_Event_5) == 0x000010, "Wrong size on SEQ_SkillNoah_RangeCounter1_DirectorBP_C_BP_AudioCharacter_BattleManager_Event_5");
static_assert(offsetof(SEQ_SkillNoah_RangeCounter1_DirectorBP_C_BP_AudioCharacter_BattleManager_Event_5, BP_AudioCharacter_BattleManager) == 0x000000, "Member 'SEQ_SkillNoah_RangeCounter1_DirectorBP_C_BP_AudioCharacter_BattleManager_Event_5::BP_AudioCharacter_BattleManager' has a wrong offset!");
static_assert(offsetof(SEQ_SkillNoah_RangeCounter1_DirectorBP_C_BP_AudioCharacter_BattleManager_Event_5, Activate_ControlBusMix) == 0x000008, "Member 'SEQ_SkillNoah_RangeCounter1_DirectorBP_C_BP_AudioCharacter_BattleManager_Event_5::Activate_ControlBusMix' has a wrong offset!");

// Function SEQ_SkillNoah_RangeCounter1.SEQ_SkillNoah_RangeCounter1_DirectorBP_C.BP_AudioCharacter_BattleManager_Event_6
// 0x0010 (0x0010 - 0x0000)
struct SEQ_SkillNoah_RangeCounter1_DirectorBP_C_BP_AudioCharacter_BattleManager_Event_6 final
{
public:
	class UBP_AudioCharacter_BattleManager_C*     BP_AudioCharacter_BattleManager;                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USoundControlBusMix*                    Deactivate_ControlBusMix;                          // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SEQ_SkillNoah_RangeCounter1_DirectorBP_C_BP_AudioCharacter_BattleManager_Event_6) == 0x000008, "Wrong alignment on SEQ_SkillNoah_RangeCounter1_DirectorBP_C_BP_AudioCharacter_BattleManager_Event_6");
static_assert(sizeof(SEQ_SkillNoah_RangeCounter1_DirectorBP_C_BP_AudioCharacter_BattleManager_Event_6) == 0x000010, "Wrong size on SEQ_SkillNoah_RangeCounter1_DirectorBP_C_BP_AudioCharacter_BattleManager_Event_6");
static_assert(offsetof(SEQ_SkillNoah_RangeCounter1_DirectorBP_C_BP_AudioCharacter_BattleManager_Event_6, BP_AudioCharacter_BattleManager) == 0x000000, "Member 'SEQ_SkillNoah_RangeCounter1_DirectorBP_C_BP_AudioCharacter_BattleManager_Event_6::BP_AudioCharacter_BattleManager' has a wrong offset!");
static_assert(offsetof(SEQ_SkillNoah_RangeCounter1_DirectorBP_C_BP_AudioCharacter_BattleManager_Event_6, Deactivate_ControlBusMix) == 0x000008, "Member 'SEQ_SkillNoah_RangeCounter1_DirectorBP_C_BP_AudioCharacter_BattleManager_Event_6::Deactivate_ControlBusMix' has a wrong offset!");

// Function SEQ_SkillNoah_RangeCounter1.SEQ_SkillNoah_RangeCounter1_DirectorBP_C.BP_AudioCharacter_BattleManager_Event_7
// 0x0010 (0x0010 - 0x0000)
struct SEQ_SkillNoah_RangeCounter1_DirectorBP_C_BP_AudioCharacter_BattleManager_Event_7 final
{
public:
	class UBP_AudioCharacter_BattleManager_C*     BP_AudioCharacter_BattleManager;                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USoundControlBusMix*                    Activate_ControlBusMix;                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SEQ_SkillNoah_RangeCounter1_DirectorBP_C_BP_AudioCharacter_BattleManager_Event_7) == 0x000008, "Wrong alignment on SEQ_SkillNoah_RangeCounter1_DirectorBP_C_BP_AudioCharacter_BattleManager_Event_7");
static_assert(sizeof(SEQ_SkillNoah_RangeCounter1_DirectorBP_C_BP_AudioCharacter_BattleManager_Event_7) == 0x000010, "Wrong size on SEQ_SkillNoah_RangeCounter1_DirectorBP_C_BP_AudioCharacter_BattleManager_Event_7");
static_assert(offsetof(SEQ_SkillNoah_RangeCounter1_DirectorBP_C_BP_AudioCharacter_BattleManager_Event_7, BP_AudioCharacter_BattleManager) == 0x000000, "Member 'SEQ_SkillNoah_RangeCounter1_DirectorBP_C_BP_AudioCharacter_BattleManager_Event_7::BP_AudioCharacter_BattleManager' has a wrong offset!");
static_assert(offsetof(SEQ_SkillNoah_RangeCounter1_DirectorBP_C_BP_AudioCharacter_BattleManager_Event_7, Activate_ControlBusMix) == 0x000008, "Member 'SEQ_SkillNoah_RangeCounter1_DirectorBP_C_BP_AudioCharacter_BattleManager_Event_7::Activate_ControlBusMix' has a wrong offset!");

// Function SEQ_SkillNoah_RangeCounter1.SEQ_SkillNoah_RangeCounter1_DirectorBP_C.BP_AudioCharacter_BattleManager_Event_8
// 0x0010 (0x0010 - 0x0000)
struct SEQ_SkillNoah_RangeCounter1_DirectorBP_C_BP_AudioCharacter_BattleManager_Event_8 final
{
public:
	class UBP_AudioCharacter_BattleManager_C*     BP_AudioCharacter_BattleManager;                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USoundControlBusMix*                    Deactivate_ControlBusMix;                          // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SEQ_SkillNoah_RangeCounter1_DirectorBP_C_BP_AudioCharacter_BattleManager_Event_8) == 0x000008, "Wrong alignment on SEQ_SkillNoah_RangeCounter1_DirectorBP_C_BP_AudioCharacter_BattleManager_Event_8");
static_assert(sizeof(SEQ_SkillNoah_RangeCounter1_DirectorBP_C_BP_AudioCharacter_BattleManager_Event_8) == 0x000010, "Wrong size on SEQ_SkillNoah_RangeCounter1_DirectorBP_C_BP_AudioCharacter_BattleManager_Event_8");
static_assert(offsetof(SEQ_SkillNoah_RangeCounter1_DirectorBP_C_BP_AudioCharacter_BattleManager_Event_8, BP_AudioCharacter_BattleManager) == 0x000000, "Member 'SEQ_SkillNoah_RangeCounter1_DirectorBP_C_BP_AudioCharacter_BattleManager_Event_8::BP_AudioCharacter_BattleManager' has a wrong offset!");
static_assert(offsetof(SEQ_SkillNoah_RangeCounter1_DirectorBP_C_BP_AudioCharacter_BattleManager_Event_8, Deactivate_ControlBusMix) == 0x000008, "Member 'SEQ_SkillNoah_RangeCounter1_DirectorBP_C_BP_AudioCharacter_BattleManager_Event_8::Deactivate_ControlBusMix' has a wrong offset!");

// Function SEQ_SkillNoah_RangeCounter1.SEQ_SkillNoah_RangeCounter1_DirectorBP_C.BP_AudioCharacter_BattleManager_Event_9
// 0x0010 (0x0010 - 0x0000)
struct SEQ_SkillNoah_RangeCounter1_DirectorBP_C_BP_AudioCharacter_BattleManager_Event_9 final
{
public:
	class UBP_AudioCharacter_BattleManager_C*     BP_AudioCharacter_BattleManager;                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EOnoType                                      OnoType;                                           // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SEQ_SkillNoah_RangeCounter1_DirectorBP_C_BP_AudioCharacter_BattleManager_Event_9) == 0x000008, "Wrong alignment on SEQ_SkillNoah_RangeCounter1_DirectorBP_C_BP_AudioCharacter_BattleManager_Event_9");
static_assert(sizeof(SEQ_SkillNoah_RangeCounter1_DirectorBP_C_BP_AudioCharacter_BattleManager_Event_9) == 0x000010, "Wrong size on SEQ_SkillNoah_RangeCounter1_DirectorBP_C_BP_AudioCharacter_BattleManager_Event_9");
static_assert(offsetof(SEQ_SkillNoah_RangeCounter1_DirectorBP_C_BP_AudioCharacter_BattleManager_Event_9, BP_AudioCharacter_BattleManager) == 0x000000, "Member 'SEQ_SkillNoah_RangeCounter1_DirectorBP_C_BP_AudioCharacter_BattleManager_Event_9::BP_AudioCharacter_BattleManager' has a wrong offset!");
static_assert(offsetof(SEQ_SkillNoah_RangeCounter1_DirectorBP_C_BP_AudioCharacter_BattleManager_Event_9, OnoType) == 0x000008, "Member 'SEQ_SkillNoah_RangeCounter1_DirectorBP_C_BP_AudioCharacter_BattleManager_Event_9::OnoType' has a wrong offset!");

// Function SEQ_SkillNoah_RangeCounter1.SEQ_SkillNoah_RangeCounter1_DirectorBP_C.ExecuteUbergraph_SEQ_SkillNoah_RangeCounter1_DirectorBP
// 0x00B8 (0x00B8 - 0x0000)
struct SEQ_SkillNoah_RangeCounter1_DirectorBP_C_ExecuteUbergraph_SEQ_SkillNoah_RangeCounter1_DirectorBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AudioCharacter_BattleManager_C*     K2Node_CustomEvent_BP_AudioCharacter_BattleManager; // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EOnoType                                      K2Node_CustomEvent_OnoType;                        // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AudioCharacter_BattleManager_C*     K2Node_CustomEvent_BP_AudioCharacter_BattleManager_10; // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             K2Node_CustomEvent_Battle_PlaySeqFoley_2;          // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_AudioCharacter_BattleManager_C*     K2Node_CustomEvent_BP_AudioCharacter_BattleManager_9; // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             K2Node_CustomEvent_Battle_PlaySeqSFX;              // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_AudioCharacter_BattleManager_C*     K2Node_CustomEvent_BP_AudioCharacter_BattleManager_8; // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             K2Node_CustomEvent_Battle_PlaySeqFoley_1;          // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_AudioCharacter_BattleManager_C*     K2Node_CustomEvent_BP_AudioCharacter_BattleManager_7; // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             K2Node_CustomEvent_Battle_PlaySeqFoley;            // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_AudioCharacter_BattleManager_C*     K2Node_CustomEvent_BP_AudioCharacter_BattleManager_6; // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USoundControlBusMix*                    K2Node_CustomEvent_Activate_ControlBusMix_2;       // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_AudioCharacter_BattleManager_C*     K2Node_CustomEvent_BP_AudioCharacter_BattleManager_5; // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USoundControlBusMix*                    K2Node_CustomEvent_Deactivate_ControlBusMix_2;     // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_AudioCharacter_BattleManager_C*     K2Node_CustomEvent_BP_AudioCharacter_BattleManager_4; // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USoundControlBusMix*                    K2Node_CustomEvent_Activate_ControlBusMix_1;       // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_AudioCharacter_BattleManager_C*     K2Node_CustomEvent_BP_AudioCharacter_BattleManager_3; // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USoundControlBusMix*                    K2Node_CustomEvent_Deactivate_ControlBusMix_1;     // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_AudioCharacter_BattleManager_C*     K2Node_CustomEvent_BP_AudioCharacter_BattleManager_2; // 0x0098(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USoundControlBusMix*                    K2Node_CustomEvent_Activate_ControlBusMix;         // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_AudioCharacter_BattleManager_C*     K2Node_CustomEvent_BP_AudioCharacter_BattleManager_1; // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USoundControlBusMix*                    K2Node_CustomEvent_Deactivate_ControlBusMix;       // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SEQ_SkillNoah_RangeCounter1_DirectorBP_C_ExecuteUbergraph_SEQ_SkillNoah_RangeCounter1_DirectorBP) == 0x000008, "Wrong alignment on SEQ_SkillNoah_RangeCounter1_DirectorBP_C_ExecuteUbergraph_SEQ_SkillNoah_RangeCounter1_DirectorBP");
static_assert(sizeof(SEQ_SkillNoah_RangeCounter1_DirectorBP_C_ExecuteUbergraph_SEQ_SkillNoah_RangeCounter1_DirectorBP) == 0x0000B8, "Wrong size on SEQ_SkillNoah_RangeCounter1_DirectorBP_C_ExecuteUbergraph_SEQ_SkillNoah_RangeCounter1_DirectorBP");
static_assert(offsetof(SEQ_SkillNoah_RangeCounter1_DirectorBP_C_ExecuteUbergraph_SEQ_SkillNoah_RangeCounter1_DirectorBP, EntryPoint) == 0x000000, "Member 'SEQ_SkillNoah_RangeCounter1_DirectorBP_C_ExecuteUbergraph_SEQ_SkillNoah_RangeCounter1_DirectorBP::EntryPoint' has a wrong offset!");
static_assert(offsetof(SEQ_SkillNoah_RangeCounter1_DirectorBP_C_ExecuteUbergraph_SEQ_SkillNoah_RangeCounter1_DirectorBP, K2Node_CustomEvent_BP_AudioCharacter_BattleManager) == 0x000008, "Member 'SEQ_SkillNoah_RangeCounter1_DirectorBP_C_ExecuteUbergraph_SEQ_SkillNoah_RangeCounter1_DirectorBP::K2Node_CustomEvent_BP_AudioCharacter_BattleManager' has a wrong offset!");
static_assert(offsetof(SEQ_SkillNoah_RangeCounter1_DirectorBP_C_ExecuteUbergraph_SEQ_SkillNoah_RangeCounter1_DirectorBP, K2Node_CustomEvent_OnoType) == 0x000010, "Member 'SEQ_SkillNoah_RangeCounter1_DirectorBP_C_ExecuteUbergraph_SEQ_SkillNoah_RangeCounter1_DirectorBP::K2Node_CustomEvent_OnoType' has a wrong offset!");
static_assert(offsetof(SEQ_SkillNoah_RangeCounter1_DirectorBP_C_ExecuteUbergraph_SEQ_SkillNoah_RangeCounter1_DirectorBP, K2Node_CustomEvent_BP_AudioCharacter_BattleManager_10) == 0x000018, "Member 'SEQ_SkillNoah_RangeCounter1_DirectorBP_C_ExecuteUbergraph_SEQ_SkillNoah_RangeCounter1_DirectorBP::K2Node_CustomEvent_BP_AudioCharacter_BattleManager_10' has a wrong offset!");
static_assert(offsetof(SEQ_SkillNoah_RangeCounter1_DirectorBP_C_ExecuteUbergraph_SEQ_SkillNoah_RangeCounter1_DirectorBP, K2Node_CustomEvent_Battle_PlaySeqFoley_2) == 0x000020, "Member 'SEQ_SkillNoah_RangeCounter1_DirectorBP_C_ExecuteUbergraph_SEQ_SkillNoah_RangeCounter1_DirectorBP::K2Node_CustomEvent_Battle_PlaySeqFoley_2' has a wrong offset!");
static_assert(offsetof(SEQ_SkillNoah_RangeCounter1_DirectorBP_C_ExecuteUbergraph_SEQ_SkillNoah_RangeCounter1_DirectorBP, K2Node_CustomEvent_BP_AudioCharacter_BattleManager_9) == 0x000028, "Member 'SEQ_SkillNoah_RangeCounter1_DirectorBP_C_ExecuteUbergraph_SEQ_SkillNoah_RangeCounter1_DirectorBP::K2Node_CustomEvent_BP_AudioCharacter_BattleManager_9' has a wrong offset!");
static_assert(offsetof(SEQ_SkillNoah_RangeCounter1_DirectorBP_C_ExecuteUbergraph_SEQ_SkillNoah_RangeCounter1_DirectorBP, K2Node_CustomEvent_Battle_PlaySeqSFX) == 0x000030, "Member 'SEQ_SkillNoah_RangeCounter1_DirectorBP_C_ExecuteUbergraph_SEQ_SkillNoah_RangeCounter1_DirectorBP::K2Node_CustomEvent_Battle_PlaySeqSFX' has a wrong offset!");
static_assert(offsetof(SEQ_SkillNoah_RangeCounter1_DirectorBP_C_ExecuteUbergraph_SEQ_SkillNoah_RangeCounter1_DirectorBP, K2Node_CustomEvent_BP_AudioCharacter_BattleManager_8) == 0x000038, "Member 'SEQ_SkillNoah_RangeCounter1_DirectorBP_C_ExecuteUbergraph_SEQ_SkillNoah_RangeCounter1_DirectorBP::K2Node_CustomEvent_BP_AudioCharacter_BattleManager_8' has a wrong offset!");
static_assert(offsetof(SEQ_SkillNoah_RangeCounter1_DirectorBP_C_ExecuteUbergraph_SEQ_SkillNoah_RangeCounter1_DirectorBP, K2Node_CustomEvent_Battle_PlaySeqFoley_1) == 0x000040, "Member 'SEQ_SkillNoah_RangeCounter1_DirectorBP_C_ExecuteUbergraph_SEQ_SkillNoah_RangeCounter1_DirectorBP::K2Node_CustomEvent_Battle_PlaySeqFoley_1' has a wrong offset!");
static_assert(offsetof(SEQ_SkillNoah_RangeCounter1_DirectorBP_C_ExecuteUbergraph_SEQ_SkillNoah_RangeCounter1_DirectorBP, K2Node_CustomEvent_BP_AudioCharacter_BattleManager_7) == 0x000048, "Member 'SEQ_SkillNoah_RangeCounter1_DirectorBP_C_ExecuteUbergraph_SEQ_SkillNoah_RangeCounter1_DirectorBP::K2Node_CustomEvent_BP_AudioCharacter_BattleManager_7' has a wrong offset!");
static_assert(offsetof(SEQ_SkillNoah_RangeCounter1_DirectorBP_C_ExecuteUbergraph_SEQ_SkillNoah_RangeCounter1_DirectorBP, K2Node_CustomEvent_Battle_PlaySeqFoley) == 0x000050, "Member 'SEQ_SkillNoah_RangeCounter1_DirectorBP_C_ExecuteUbergraph_SEQ_SkillNoah_RangeCounter1_DirectorBP::K2Node_CustomEvent_Battle_PlaySeqFoley' has a wrong offset!");
static_assert(offsetof(SEQ_SkillNoah_RangeCounter1_DirectorBP_C_ExecuteUbergraph_SEQ_SkillNoah_RangeCounter1_DirectorBP, K2Node_CustomEvent_BP_AudioCharacter_BattleManager_6) == 0x000058, "Member 'SEQ_SkillNoah_RangeCounter1_DirectorBP_C_ExecuteUbergraph_SEQ_SkillNoah_RangeCounter1_DirectorBP::K2Node_CustomEvent_BP_AudioCharacter_BattleManager_6' has a wrong offset!");
static_assert(offsetof(SEQ_SkillNoah_RangeCounter1_DirectorBP_C_ExecuteUbergraph_SEQ_SkillNoah_RangeCounter1_DirectorBP, K2Node_CustomEvent_Activate_ControlBusMix_2) == 0x000060, "Member 'SEQ_SkillNoah_RangeCounter1_DirectorBP_C_ExecuteUbergraph_SEQ_SkillNoah_RangeCounter1_DirectorBP::K2Node_CustomEvent_Activate_ControlBusMix_2' has a wrong offset!");
static_assert(offsetof(SEQ_SkillNoah_RangeCounter1_DirectorBP_C_ExecuteUbergraph_SEQ_SkillNoah_RangeCounter1_DirectorBP, K2Node_CustomEvent_BP_AudioCharacter_BattleManager_5) == 0x000068, "Member 'SEQ_SkillNoah_RangeCounter1_DirectorBP_C_ExecuteUbergraph_SEQ_SkillNoah_RangeCounter1_DirectorBP::K2Node_CustomEvent_BP_AudioCharacter_BattleManager_5' has a wrong offset!");
static_assert(offsetof(SEQ_SkillNoah_RangeCounter1_DirectorBP_C_ExecuteUbergraph_SEQ_SkillNoah_RangeCounter1_DirectorBP, K2Node_CustomEvent_Deactivate_ControlBusMix_2) == 0x000070, "Member 'SEQ_SkillNoah_RangeCounter1_DirectorBP_C_ExecuteUbergraph_SEQ_SkillNoah_RangeCounter1_DirectorBP::K2Node_CustomEvent_Deactivate_ControlBusMix_2' has a wrong offset!");
static_assert(offsetof(SEQ_SkillNoah_RangeCounter1_DirectorBP_C_ExecuteUbergraph_SEQ_SkillNoah_RangeCounter1_DirectorBP, K2Node_CustomEvent_BP_AudioCharacter_BattleManager_4) == 0x000078, "Member 'SEQ_SkillNoah_RangeCounter1_DirectorBP_C_ExecuteUbergraph_SEQ_SkillNoah_RangeCounter1_DirectorBP::K2Node_CustomEvent_BP_AudioCharacter_BattleManager_4' has a wrong offset!");
static_assert(offsetof(SEQ_SkillNoah_RangeCounter1_DirectorBP_C_ExecuteUbergraph_SEQ_SkillNoah_RangeCounter1_DirectorBP, K2Node_CustomEvent_Activate_ControlBusMix_1) == 0x000080, "Member 'SEQ_SkillNoah_RangeCounter1_DirectorBP_C_ExecuteUbergraph_SEQ_SkillNoah_RangeCounter1_DirectorBP::K2Node_CustomEvent_Activate_ControlBusMix_1' has a wrong offset!");
static_assert(offsetof(SEQ_SkillNoah_RangeCounter1_DirectorBP_C_ExecuteUbergraph_SEQ_SkillNoah_RangeCounter1_DirectorBP, K2Node_CustomEvent_BP_AudioCharacter_BattleManager_3) == 0x000088, "Member 'SEQ_SkillNoah_RangeCounter1_DirectorBP_C_ExecuteUbergraph_SEQ_SkillNoah_RangeCounter1_DirectorBP::K2Node_CustomEvent_BP_AudioCharacter_BattleManager_3' has a wrong offset!");
static_assert(offsetof(SEQ_SkillNoah_RangeCounter1_DirectorBP_C_ExecuteUbergraph_SEQ_SkillNoah_RangeCounter1_DirectorBP, K2Node_CustomEvent_Deactivate_ControlBusMix_1) == 0x000090, "Member 'SEQ_SkillNoah_RangeCounter1_DirectorBP_C_ExecuteUbergraph_SEQ_SkillNoah_RangeCounter1_DirectorBP::K2Node_CustomEvent_Deactivate_ControlBusMix_1' has a wrong offset!");
static_assert(offsetof(SEQ_SkillNoah_RangeCounter1_DirectorBP_C_ExecuteUbergraph_SEQ_SkillNoah_RangeCounter1_DirectorBP, K2Node_CustomEvent_BP_AudioCharacter_BattleManager_2) == 0x000098, "Member 'SEQ_SkillNoah_RangeCounter1_DirectorBP_C_ExecuteUbergraph_SEQ_SkillNoah_RangeCounter1_DirectorBP::K2Node_CustomEvent_BP_AudioCharacter_BattleManager_2' has a wrong offset!");
static_assert(offsetof(SEQ_SkillNoah_RangeCounter1_DirectorBP_C_ExecuteUbergraph_SEQ_SkillNoah_RangeCounter1_DirectorBP, K2Node_CustomEvent_Activate_ControlBusMix) == 0x0000A0, "Member 'SEQ_SkillNoah_RangeCounter1_DirectorBP_C_ExecuteUbergraph_SEQ_SkillNoah_RangeCounter1_DirectorBP::K2Node_CustomEvent_Activate_ControlBusMix' has a wrong offset!");
static_assert(offsetof(SEQ_SkillNoah_RangeCounter1_DirectorBP_C_ExecuteUbergraph_SEQ_SkillNoah_RangeCounter1_DirectorBP, K2Node_CustomEvent_BP_AudioCharacter_BattleManager_1) == 0x0000A8, "Member 'SEQ_SkillNoah_RangeCounter1_DirectorBP_C_ExecuteUbergraph_SEQ_SkillNoah_RangeCounter1_DirectorBP::K2Node_CustomEvent_BP_AudioCharacter_BattleManager_1' has a wrong offset!");
static_assert(offsetof(SEQ_SkillNoah_RangeCounter1_DirectorBP_C_ExecuteUbergraph_SEQ_SkillNoah_RangeCounter1_DirectorBP, K2Node_CustomEvent_Deactivate_ControlBusMix) == 0x0000B0, "Member 'SEQ_SkillNoah_RangeCounter1_DirectorBP_C_ExecuteUbergraph_SEQ_SkillNoah_RangeCounter1_DirectorBP::K2Node_CustomEvent_Deactivate_ControlBusMix' has a wrong offset!");

// Function SEQ_SkillNoah_RangeCounter1.SEQ_SkillNoah_RangeCounter1_DirectorBP_C.SequenceEvent__ENTRYPOINTSEQ_SkillNoah_RangeCounter1_DirectorBP
// 0x0008 (0x0008 - 0x0000)
struct SEQ_SkillNoah_RangeCounter1_DirectorBP_C_SequenceEvent__ENTRYPOINTSEQ_SkillNoah_RangeCounter1_DirectorBP final
{
public:
	class UBP_AudioCharacter_BattleManager_C*     BP_AudioCharacter_BattleManager;                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SEQ_SkillNoah_RangeCounter1_DirectorBP_C_SequenceEvent__ENTRYPOINTSEQ_SkillNoah_RangeCounter1_DirectorBP) == 0x000008, "Wrong alignment on SEQ_SkillNoah_RangeCounter1_DirectorBP_C_SequenceEvent__ENTRYPOINTSEQ_SkillNoah_RangeCounter1_DirectorBP");
static_assert(sizeof(SEQ_SkillNoah_RangeCounter1_DirectorBP_C_SequenceEvent__ENTRYPOINTSEQ_SkillNoah_RangeCounter1_DirectorBP) == 0x000008, "Wrong size on SEQ_SkillNoah_RangeCounter1_DirectorBP_C_SequenceEvent__ENTRYPOINTSEQ_SkillNoah_RangeCounter1_DirectorBP");
static_assert(offsetof(SEQ_SkillNoah_RangeCounter1_DirectorBP_C_SequenceEvent__ENTRYPOINTSEQ_SkillNoah_RangeCounter1_DirectorBP, BP_AudioCharacter_BattleManager) == 0x000000, "Member 'SEQ_SkillNoah_RangeCounter1_DirectorBP_C_SequenceEvent__ENTRYPOINTSEQ_SkillNoah_RangeCounter1_DirectorBP::BP_AudioCharacter_BattleManager' has a wrong offset!");

// Function SEQ_SkillNoah_RangeCounter1.SEQ_SkillNoah_RangeCounter1_DirectorBP_C.SequenceEvent__ENTRYPOINTSEQ_SkillNoah_RangeCounter1_DirectorBP_0
// 0x0008 (0x0008 - 0x0000)
struct SEQ_SkillNoah_RangeCounter1_DirectorBP_C_SequenceEvent__ENTRYPOINTSEQ_SkillNoah_RangeCounter1_DirectorBP_0 final
{
public:
	class UBP_AudioCharacter_BattleManager_C*     BP_AudioCharacter_BattleManager;                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SEQ_SkillNoah_RangeCounter1_DirectorBP_C_SequenceEvent__ENTRYPOINTSEQ_SkillNoah_RangeCounter1_DirectorBP_0) == 0x000008, "Wrong alignment on SEQ_SkillNoah_RangeCounter1_DirectorBP_C_SequenceEvent__ENTRYPOINTSEQ_SkillNoah_RangeCounter1_DirectorBP_0");
static_assert(sizeof(SEQ_SkillNoah_RangeCounter1_DirectorBP_C_SequenceEvent__ENTRYPOINTSEQ_SkillNoah_RangeCounter1_DirectorBP_0) == 0x000008, "Wrong size on SEQ_SkillNoah_RangeCounter1_DirectorBP_C_SequenceEvent__ENTRYPOINTSEQ_SkillNoah_RangeCounter1_DirectorBP_0");
static_assert(offsetof(SEQ_SkillNoah_RangeCounter1_DirectorBP_C_SequenceEvent__ENTRYPOINTSEQ_SkillNoah_RangeCounter1_DirectorBP_0, BP_AudioCharacter_BattleManager) == 0x000000, "Member 'SEQ_SkillNoah_RangeCounter1_DirectorBP_C_SequenceEvent__ENTRYPOINTSEQ_SkillNoah_RangeCounter1_DirectorBP_0::BP_AudioCharacter_BattleManager' has a wrong offset!");

// Function SEQ_SkillNoah_RangeCounter1.SEQ_SkillNoah_RangeCounter1_DirectorBP_C.SequenceEvent__ENTRYPOINTSEQ_SkillNoah_RangeCounter1_DirectorBP_1
// 0x0008 (0x0008 - 0x0000)
struct SEQ_SkillNoah_RangeCounter1_DirectorBP_C_SequenceEvent__ENTRYPOINTSEQ_SkillNoah_RangeCounter1_DirectorBP_1 final
{
public:
	class UBP_AudioCharacter_BattleManager_C*     BP_AudioCharacter_BattleManager;                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SEQ_SkillNoah_RangeCounter1_DirectorBP_C_SequenceEvent__ENTRYPOINTSEQ_SkillNoah_RangeCounter1_DirectorBP_1) == 0x000008, "Wrong alignment on SEQ_SkillNoah_RangeCounter1_DirectorBP_C_SequenceEvent__ENTRYPOINTSEQ_SkillNoah_RangeCounter1_DirectorBP_1");
static_assert(sizeof(SEQ_SkillNoah_RangeCounter1_DirectorBP_C_SequenceEvent__ENTRYPOINTSEQ_SkillNoah_RangeCounter1_DirectorBP_1) == 0x000008, "Wrong size on SEQ_SkillNoah_RangeCounter1_DirectorBP_C_SequenceEvent__ENTRYPOINTSEQ_SkillNoah_RangeCounter1_DirectorBP_1");
static_assert(offsetof(SEQ_SkillNoah_RangeCounter1_DirectorBP_C_SequenceEvent__ENTRYPOINTSEQ_SkillNoah_RangeCounter1_DirectorBP_1, BP_AudioCharacter_BattleManager) == 0x000000, "Member 'SEQ_SkillNoah_RangeCounter1_DirectorBP_C_SequenceEvent__ENTRYPOINTSEQ_SkillNoah_RangeCounter1_DirectorBP_1::BP_AudioCharacter_BattleManager' has a wrong offset!");

// Function SEQ_SkillNoah_RangeCounter1.SEQ_SkillNoah_RangeCounter1_DirectorBP_C.SequenceEvent__ENTRYPOINTSEQ_SkillNoah_RangeCounter1_DirectorBP_2
// 0x0008 (0x0008 - 0x0000)
struct SEQ_SkillNoah_RangeCounter1_DirectorBP_C_SequenceEvent__ENTRYPOINTSEQ_SkillNoah_RangeCounter1_DirectorBP_2 final
{
public:
	class UBP_AudioCharacter_BattleManager_C*     BP_AudioCharacter_BattleManager;                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SEQ_SkillNoah_RangeCounter1_DirectorBP_C_SequenceEvent__ENTRYPOINTSEQ_SkillNoah_RangeCounter1_DirectorBP_2) == 0x000008, "Wrong alignment on SEQ_SkillNoah_RangeCounter1_DirectorBP_C_SequenceEvent__ENTRYPOINTSEQ_SkillNoah_RangeCounter1_DirectorBP_2");
static_assert(sizeof(SEQ_SkillNoah_RangeCounter1_DirectorBP_C_SequenceEvent__ENTRYPOINTSEQ_SkillNoah_RangeCounter1_DirectorBP_2) == 0x000008, "Wrong size on SEQ_SkillNoah_RangeCounter1_DirectorBP_C_SequenceEvent__ENTRYPOINTSEQ_SkillNoah_RangeCounter1_DirectorBP_2");
static_assert(offsetof(SEQ_SkillNoah_RangeCounter1_DirectorBP_C_SequenceEvent__ENTRYPOINTSEQ_SkillNoah_RangeCounter1_DirectorBP_2, BP_AudioCharacter_BattleManager) == 0x000000, "Member 'SEQ_SkillNoah_RangeCounter1_DirectorBP_C_SequenceEvent__ENTRYPOINTSEQ_SkillNoah_RangeCounter1_DirectorBP_2::BP_AudioCharacter_BattleManager' has a wrong offset!");

// Function SEQ_SkillNoah_RangeCounter1.SEQ_SkillNoah_RangeCounter1_DirectorBP_C.SequenceEvent__ENTRYPOINTSEQ_SkillNoah_RangeCounter1_DirectorBP_3
// 0x0008 (0x0008 - 0x0000)
struct SEQ_SkillNoah_RangeCounter1_DirectorBP_C_SequenceEvent__ENTRYPOINTSEQ_SkillNoah_RangeCounter1_DirectorBP_3 final
{
public:
	class UBP_AudioCharacter_BattleManager_C*     BP_AudioCharacter_BattleManager;                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SEQ_SkillNoah_RangeCounter1_DirectorBP_C_SequenceEvent__ENTRYPOINTSEQ_SkillNoah_RangeCounter1_DirectorBP_3) == 0x000008, "Wrong alignment on SEQ_SkillNoah_RangeCounter1_DirectorBP_C_SequenceEvent__ENTRYPOINTSEQ_SkillNoah_RangeCounter1_DirectorBP_3");
static_assert(sizeof(SEQ_SkillNoah_RangeCounter1_DirectorBP_C_SequenceEvent__ENTRYPOINTSEQ_SkillNoah_RangeCounter1_DirectorBP_3) == 0x000008, "Wrong size on SEQ_SkillNoah_RangeCounter1_DirectorBP_C_SequenceEvent__ENTRYPOINTSEQ_SkillNoah_RangeCounter1_DirectorBP_3");
static_assert(offsetof(SEQ_SkillNoah_RangeCounter1_DirectorBP_C_SequenceEvent__ENTRYPOINTSEQ_SkillNoah_RangeCounter1_DirectorBP_3, BP_AudioCharacter_BattleManager) == 0x000000, "Member 'SEQ_SkillNoah_RangeCounter1_DirectorBP_C_SequenceEvent__ENTRYPOINTSEQ_SkillNoah_RangeCounter1_DirectorBP_3::BP_AudioCharacter_BattleManager' has a wrong offset!");

// Function SEQ_SkillNoah_RangeCounter1.SEQ_SkillNoah_RangeCounter1_DirectorBP_C.SequenceEvent__ENTRYPOINTSEQ_SkillNoah_RangeCounter1_DirectorBP_4
// 0x0008 (0x0008 - 0x0000)
struct SEQ_SkillNoah_RangeCounter1_DirectorBP_C_SequenceEvent__ENTRYPOINTSEQ_SkillNoah_RangeCounter1_DirectorBP_4 final
{
public:
	class UBP_AudioCharacter_BattleManager_C*     BP_AudioCharacter_BattleManager;                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SEQ_SkillNoah_RangeCounter1_DirectorBP_C_SequenceEvent__ENTRYPOINTSEQ_SkillNoah_RangeCounter1_DirectorBP_4) == 0x000008, "Wrong alignment on SEQ_SkillNoah_RangeCounter1_DirectorBP_C_SequenceEvent__ENTRYPOINTSEQ_SkillNoah_RangeCounter1_DirectorBP_4");
static_assert(sizeof(SEQ_SkillNoah_RangeCounter1_DirectorBP_C_SequenceEvent__ENTRYPOINTSEQ_SkillNoah_RangeCounter1_DirectorBP_4) == 0x000008, "Wrong size on SEQ_SkillNoah_RangeCounter1_DirectorBP_C_SequenceEvent__ENTRYPOINTSEQ_SkillNoah_RangeCounter1_DirectorBP_4");
static_assert(offsetof(SEQ_SkillNoah_RangeCounter1_DirectorBP_C_SequenceEvent__ENTRYPOINTSEQ_SkillNoah_RangeCounter1_DirectorBP_4, BP_AudioCharacter_BattleManager) == 0x000000, "Member 'SEQ_SkillNoah_RangeCounter1_DirectorBP_C_SequenceEvent__ENTRYPOINTSEQ_SkillNoah_RangeCounter1_DirectorBP_4::BP_AudioCharacter_BattleManager' has a wrong offset!");

// Function SEQ_SkillNoah_RangeCounter1.SEQ_SkillNoah_RangeCounter1_DirectorBP_C.SequenceEvent__ENTRYPOINTSEQ_SkillNoah_RangeCounter1_DirectorBP_5
// 0x0008 (0x0008 - 0x0000)
struct SEQ_SkillNoah_RangeCounter1_DirectorBP_C_SequenceEvent__ENTRYPOINTSEQ_SkillNoah_RangeCounter1_DirectorBP_5 final
{
public:
	class UBP_AudioCharacter_BattleManager_C*     BP_AudioCharacter_BattleManager;                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SEQ_SkillNoah_RangeCounter1_DirectorBP_C_SequenceEvent__ENTRYPOINTSEQ_SkillNoah_RangeCounter1_DirectorBP_5) == 0x000008, "Wrong alignment on SEQ_SkillNoah_RangeCounter1_DirectorBP_C_SequenceEvent__ENTRYPOINTSEQ_SkillNoah_RangeCounter1_DirectorBP_5");
static_assert(sizeof(SEQ_SkillNoah_RangeCounter1_DirectorBP_C_SequenceEvent__ENTRYPOINTSEQ_SkillNoah_RangeCounter1_DirectorBP_5) == 0x000008, "Wrong size on SEQ_SkillNoah_RangeCounter1_DirectorBP_C_SequenceEvent__ENTRYPOINTSEQ_SkillNoah_RangeCounter1_DirectorBP_5");
static_assert(offsetof(SEQ_SkillNoah_RangeCounter1_DirectorBP_C_SequenceEvent__ENTRYPOINTSEQ_SkillNoah_RangeCounter1_DirectorBP_5, BP_AudioCharacter_BattleManager) == 0x000000, "Member 'SEQ_SkillNoah_RangeCounter1_DirectorBP_C_SequenceEvent__ENTRYPOINTSEQ_SkillNoah_RangeCounter1_DirectorBP_5::BP_AudioCharacter_BattleManager' has a wrong offset!");

// Function SEQ_SkillNoah_RangeCounter1.SEQ_SkillNoah_RangeCounter1_DirectorBP_C.SequenceEvent__ENTRYPOINTSEQ_SkillNoah_RangeCounter1_DirectorBP_6
// 0x0008 (0x0008 - 0x0000)
struct SEQ_SkillNoah_RangeCounter1_DirectorBP_C_SequenceEvent__ENTRYPOINTSEQ_SkillNoah_RangeCounter1_DirectorBP_6 final
{
public:
	class UBP_AudioCharacter_BattleManager_C*     BP_AudioCharacter_BattleManager;                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SEQ_SkillNoah_RangeCounter1_DirectorBP_C_SequenceEvent__ENTRYPOINTSEQ_SkillNoah_RangeCounter1_DirectorBP_6) == 0x000008, "Wrong alignment on SEQ_SkillNoah_RangeCounter1_DirectorBP_C_SequenceEvent__ENTRYPOINTSEQ_SkillNoah_RangeCounter1_DirectorBP_6");
static_assert(sizeof(SEQ_SkillNoah_RangeCounter1_DirectorBP_C_SequenceEvent__ENTRYPOINTSEQ_SkillNoah_RangeCounter1_DirectorBP_6) == 0x000008, "Wrong size on SEQ_SkillNoah_RangeCounter1_DirectorBP_C_SequenceEvent__ENTRYPOINTSEQ_SkillNoah_RangeCounter1_DirectorBP_6");
static_assert(offsetof(SEQ_SkillNoah_RangeCounter1_DirectorBP_C_SequenceEvent__ENTRYPOINTSEQ_SkillNoah_RangeCounter1_DirectorBP_6, BP_AudioCharacter_BattleManager) == 0x000000, "Member 'SEQ_SkillNoah_RangeCounter1_DirectorBP_C_SequenceEvent__ENTRYPOINTSEQ_SkillNoah_RangeCounter1_DirectorBP_6::BP_AudioCharacter_BattleManager' has a wrong offset!");

// Function SEQ_SkillNoah_RangeCounter1.SEQ_SkillNoah_RangeCounter1_DirectorBP_C.SequenceEvent__ENTRYPOINTSEQ_SkillNoah_RangeCounter1_DirectorBP_7
// 0x0008 (0x0008 - 0x0000)
struct SEQ_SkillNoah_RangeCounter1_DirectorBP_C_SequenceEvent__ENTRYPOINTSEQ_SkillNoah_RangeCounter1_DirectorBP_7 final
{
public:
	class UBP_AudioCharacter_BattleManager_C*     BP_AudioCharacter_BattleManager;                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SEQ_SkillNoah_RangeCounter1_DirectorBP_C_SequenceEvent__ENTRYPOINTSEQ_SkillNoah_RangeCounter1_DirectorBP_7) == 0x000008, "Wrong alignment on SEQ_SkillNoah_RangeCounter1_DirectorBP_C_SequenceEvent__ENTRYPOINTSEQ_SkillNoah_RangeCounter1_DirectorBP_7");
static_assert(sizeof(SEQ_SkillNoah_RangeCounter1_DirectorBP_C_SequenceEvent__ENTRYPOINTSEQ_SkillNoah_RangeCounter1_DirectorBP_7) == 0x000008, "Wrong size on SEQ_SkillNoah_RangeCounter1_DirectorBP_C_SequenceEvent__ENTRYPOINTSEQ_SkillNoah_RangeCounter1_DirectorBP_7");
static_assert(offsetof(SEQ_SkillNoah_RangeCounter1_DirectorBP_C_SequenceEvent__ENTRYPOINTSEQ_SkillNoah_RangeCounter1_DirectorBP_7, BP_AudioCharacter_BattleManager) == 0x000000, "Member 'SEQ_SkillNoah_RangeCounter1_DirectorBP_C_SequenceEvent__ENTRYPOINTSEQ_SkillNoah_RangeCounter1_DirectorBP_7::BP_AudioCharacter_BattleManager' has a wrong offset!");

// Function SEQ_SkillNoah_RangeCounter1.SEQ_SkillNoah_RangeCounter1_DirectorBP_C.SequenceEvent__ENTRYPOINTSEQ_SkillNoah_RangeCounter1_DirectorBP_8
// 0x0008 (0x0008 - 0x0000)
struct SEQ_SkillNoah_RangeCounter1_DirectorBP_C_SequenceEvent__ENTRYPOINTSEQ_SkillNoah_RangeCounter1_DirectorBP_8 final
{
public:
	class UBP_AudioCharacter_BattleManager_C*     BP_AudioCharacter_BattleManager;                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SEQ_SkillNoah_RangeCounter1_DirectorBP_C_SequenceEvent__ENTRYPOINTSEQ_SkillNoah_RangeCounter1_DirectorBP_8) == 0x000008, "Wrong alignment on SEQ_SkillNoah_RangeCounter1_DirectorBP_C_SequenceEvent__ENTRYPOINTSEQ_SkillNoah_RangeCounter1_DirectorBP_8");
static_assert(sizeof(SEQ_SkillNoah_RangeCounter1_DirectorBP_C_SequenceEvent__ENTRYPOINTSEQ_SkillNoah_RangeCounter1_DirectorBP_8) == 0x000008, "Wrong size on SEQ_SkillNoah_RangeCounter1_DirectorBP_C_SequenceEvent__ENTRYPOINTSEQ_SkillNoah_RangeCounter1_DirectorBP_8");
static_assert(offsetof(SEQ_SkillNoah_RangeCounter1_DirectorBP_C_SequenceEvent__ENTRYPOINTSEQ_SkillNoah_RangeCounter1_DirectorBP_8, BP_AudioCharacter_BattleManager) == 0x000000, "Member 'SEQ_SkillNoah_RangeCounter1_DirectorBP_C_SequenceEvent__ENTRYPOINTSEQ_SkillNoah_RangeCounter1_DirectorBP_8::BP_AudioCharacter_BattleManager' has a wrong offset!");

// Function SEQ_SkillNoah_RangeCounter1.SEQ_SkillNoah_RangeCounter1_DirectorBP_C.SequenceEvent__ENTRYPOINTSEQ_SkillNoah_RangeCounter1_DirectorBP_9
// 0x0008 (0x0008 - 0x0000)
struct SEQ_SkillNoah_RangeCounter1_DirectorBP_C_SequenceEvent__ENTRYPOINTSEQ_SkillNoah_RangeCounter1_DirectorBP_9 final
{
public:
	class UBP_AudioCharacter_BattleManager_C*     BP_AudioCharacter_BattleManager;                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SEQ_SkillNoah_RangeCounter1_DirectorBP_C_SequenceEvent__ENTRYPOINTSEQ_SkillNoah_RangeCounter1_DirectorBP_9) == 0x000008, "Wrong alignment on SEQ_SkillNoah_RangeCounter1_DirectorBP_C_SequenceEvent__ENTRYPOINTSEQ_SkillNoah_RangeCounter1_DirectorBP_9");
static_assert(sizeof(SEQ_SkillNoah_RangeCounter1_DirectorBP_C_SequenceEvent__ENTRYPOINTSEQ_SkillNoah_RangeCounter1_DirectorBP_9) == 0x000008, "Wrong size on SEQ_SkillNoah_RangeCounter1_DirectorBP_C_SequenceEvent__ENTRYPOINTSEQ_SkillNoah_RangeCounter1_DirectorBP_9");
