#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SEQ_SkillNoah_Attackx1_2

#include "Basic.hpp"

#include "MovieScene_structs.hpp"
#include "EOnoType_structs.hpp"
#include "EAttackType_structs.hpp"


namespace SDK::Params
{

// Function SEQ_SkillNoah_Attackx1_2.SEQ_SkillNoah_Attackx1_2_DirectorBP_C.SequenceEvent__ENTRYPOINTSEQ_SkillNoah_Attackx1_2_DirectorBP_1
// 0x0008 (0x0008 - 0x0000)
struct SEQ_SkillNoah_Attackx1_2_DirectorBP_C_SequenceEvent__ENTRYPOINTSEQ_SkillNoah_Attackx1_2_DirectorBP_1 final
{
public:
	class UBP_AudioCharacter_BattleManager_C*     BP_AudioCharacter_BattleManager;                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SEQ_SkillNoah_Attackx1_2_DirectorBP_C_SequenceEvent__ENTRYPOINTSEQ_SkillNoah_Attackx1_2_DirectorBP_1) == 0x000008, "Wrong alignment on SEQ_SkillNoah_Attackx1_2_DirectorBP_C_SequenceEvent__ENTRYPOINTSEQ_SkillNoah_Attackx1_2_DirectorBP_1");
static_assert(sizeof(SEQ_SkillNoah_Attackx1_2_DirectorBP_C_SequenceEvent__ENTRYPOINTSEQ_SkillNoah_Attackx1_2_DirectorBP_1) == 0x000008, "Wrong size on SEQ_SkillNoah_Attackx1_2_DirectorBP_C_SequenceEvent__ENTRYPOINTSEQ_SkillNoah_Attackx1_2_DirectorBP_1");
static_assert(offsetof(SEQ_SkillNoah_Attackx1_2_DirectorBP_C_SequenceEvent__ENTRYPOINTSEQ_SkillNoah_Attackx1_2_DirectorBP_1, BP_AudioCharacter_BattleManager) == 0x000000, "Member 'SEQ_SkillNoah_Attackx1_2_DirectorBP_C_SequenceEvent__ENTRYPOINTSEQ_SkillNoah_Attackx1_2_DirectorBP_1::BP_AudioCharacter_BattleManager' has a wrong offset!");

// Function SEQ_SkillNoah_Attackx1_2.SEQ_SkillNoah_Attackx1_2_DirectorBP_C.SequenceEvent__ENTRYPOINTSEQ_SkillNoah_Attackx1_2_DirectorBP_0
// 0x0008 (0x0008 - 0x0000)
struct SEQ_SkillNoah_Attackx1_2_DirectorBP_C_SequenceEvent__ENTRYPOINTSEQ_SkillNoah_Attackx1_2_DirectorBP_0 final
{
public:
	class UBP_AudioCharacter_BattleManager_C*     BP_AudioCharacter_BattleManager;                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SEQ_SkillNoah_Attackx1_2_DirectorBP_C_SequenceEvent__ENTRYPOINTSEQ_SkillNoah_Attackx1_2_DirectorBP_0) == 0x000008, "Wrong alignment on SEQ_SkillNoah_Attackx1_2_DirectorBP_C_SequenceEvent__ENTRYPOINTSEQ_SkillNoah_Attackx1_2_DirectorBP_0");
static_assert(sizeof(SEQ_SkillNoah_Attackx1_2_DirectorBP_C_SequenceEvent__ENTRYPOINTSEQ_SkillNoah_Attackx1_2_DirectorBP_0) == 0x000008, "Wrong size on SEQ_SkillNoah_Attackx1_2_DirectorBP_C_SequenceEvent__ENTRYPOINTSEQ_SkillNoah_Attackx1_2_DirectorBP_0");
static_assert(offsetof(SEQ_SkillNoah_Attackx1_2_DirectorBP_C_SequenceEvent__ENTRYPOINTSEQ_SkillNoah_Attackx1_2_DirectorBP_0, BP_AudioCharacter_BattleManager) == 0x000000, "Member 'SEQ_SkillNoah_Attackx1_2_DirectorBP_C_SequenceEvent__ENTRYPOINTSEQ_SkillNoah_Attackx1_2_DirectorBP_0::BP_AudioCharacter_BattleManager' has a wrong offset!");

// Function SEQ_SkillNoah_Attackx1_2.SEQ_SkillNoah_Attackx1_2_DirectorBP_C.SequenceEvent__ENTRYPOINTSEQ_SkillNoah_Attackx1_2_DirectorBP
// 0x0008 (0x0008 - 0x0000)
struct SEQ_SkillNoah_Attackx1_2_DirectorBP_C_SequenceEvent__ENTRYPOINTSEQ_SkillNoah_Attackx1_2_DirectorBP final
{
public:
	class ABP_Noah_Battle_C*                      BP_Lucien_Battle;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SEQ_SkillNoah_Attackx1_2_DirectorBP_C_SequenceEvent__ENTRYPOINTSEQ_SkillNoah_Attackx1_2_DirectorBP) == 0x000008, "Wrong alignment on SEQ_SkillNoah_Attackx1_2_DirectorBP_C_SequenceEvent__ENTRYPOINTSEQ_SkillNoah_Attackx1_2_DirectorBP");
static_assert(sizeof(SEQ_SkillNoah_Attackx1_2_DirectorBP_C_SequenceEvent__ENTRYPOINTSEQ_SkillNoah_Attackx1_2_DirectorBP) == 0x000008, "Wrong size on SEQ_SkillNoah_Attackx1_2_DirectorBP_C_SequenceEvent__ENTRYPOINTSEQ_SkillNoah_Attackx1_2_DirectorBP");
static_assert(offsetof(SEQ_SkillNoah_Attackx1_2_DirectorBP_C_SequenceEvent__ENTRYPOINTSEQ_SkillNoah_Attackx1_2_DirectorBP, BP_Lucien_Battle) == 0x000000, "Member 'SEQ_SkillNoah_Attackx1_2_DirectorBP_C_SequenceEvent__ENTRYPOINTSEQ_SkillNoah_Attackx1_2_DirectorBP::BP_Lucien_Battle' has a wrong offset!");

// Function SEQ_SkillNoah_Attackx1_2.SEQ_SkillNoah_Attackx1_2_DirectorBP_C.ExecuteUbergraph_SEQ_SkillNoah_Attackx1_2_DirectorBP
// 0x00C0 (0x00C0 - 0x0000)
struct SEQ_SkillNoah_Attackx1_2_DirectorBP_C_ExecuteUbergraph_SEQ_SkillNoah_Attackx1_2_DirectorBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AudioCharacter_BattleManager_C*     K2Node_CustomEvent_BP_AudioCharacter_BattleManager; // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EOnoType                                      K2Node_CustomEvent_OnoType;                        // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAttackType                                   Temp_byte_Variable;                                // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraSystem*                         Temp_object_Variable;                              // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         Temp_object_Variable_1;                            // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         Temp_object_Variable_2;                            // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         Temp_object_Variable_3;                            // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         Temp_object_Variable_4;                            // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         Temp_object_Variable_5;                            // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         Temp_object_Variable_6;                            // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         Temp_object_Variable_7;                            // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         Temp_object_Variable_8;                            // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_Noah_Battle_C*                      K2Node_CustomEvent_BP_Lucien_Battle;               // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FMovieSceneObjectBindingID             K2Node_CustomEvent_AddElemental;                   // 0x0068(0x0018)(NoDestructor, HasGetValueTypeHash)
	class UBP_AudioCharacter_BattleManager_C*     K2Node_CustomEvent_BP_AudioCharacter_BattleManager_1; // 0x0080(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             K2Node_CustomEvent_Battle_PlaySeqSFX;              // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundAttenuation*                      K2Node_CustomEvent_AttenuationOverride;            // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_SoundShouldFollow_;             // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetBoundActor_ReturnValue;                // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ANiagaraActor*                          K2Node_DynamicCast_AsNiagara_Actor;                // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAttackType                                   CallFunc_GetBaseDamageType_ReturnValue;            // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B2[0x6];                                       // 0x00B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraSystem*                         K2Node_Select_Default;                             // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SEQ_SkillNoah_Attackx1_2_DirectorBP_C_ExecuteUbergraph_SEQ_SkillNoah_Attackx1_2_DirectorBP) == 0x000008, "Wrong alignment on SEQ_SkillNoah_Attackx1_2_DirectorBP_C_ExecuteUbergraph_SEQ_SkillNoah_Attackx1_2_DirectorBP");
static_assert(sizeof(SEQ_SkillNoah_Attackx1_2_DirectorBP_C_ExecuteUbergraph_SEQ_SkillNoah_Attackx1_2_DirectorBP) == 0x0000C0, "Wrong size on SEQ_SkillNoah_Attackx1_2_DirectorBP_C_ExecuteUbergraph_SEQ_SkillNoah_Attackx1_2_DirectorBP");
static_assert(offsetof(SEQ_SkillNoah_Attackx1_2_DirectorBP_C_ExecuteUbergraph_SEQ_SkillNoah_Attackx1_2_DirectorBP, EntryPoint) == 0x000000, "Member 'SEQ_SkillNoah_Attackx1_2_DirectorBP_C_ExecuteUbergraph_SEQ_SkillNoah_Attackx1_2_DirectorBP::EntryPoint' has a wrong offset!");
static_assert(offsetof(SEQ_SkillNoah_Attackx1_2_DirectorBP_C_ExecuteUbergraph_SEQ_SkillNoah_Attackx1_2_DirectorBP, K2Node_CustomEvent_BP_AudioCharacter_BattleManager) == 0x000008, "Member 'SEQ_SkillNoah_Attackx1_2_DirectorBP_C_ExecuteUbergraph_SEQ_SkillNoah_Attackx1_2_DirectorBP::K2Node_CustomEvent_BP_AudioCharacter_BattleManager' has a wrong offset!");
static_assert(offsetof(SEQ_SkillNoah_Attackx1_2_DirectorBP_C_ExecuteUbergraph_SEQ_SkillNoah_Attackx1_2_DirectorBP, K2Node_CustomEvent_OnoType) == 0x000010, "Member 'SEQ_SkillNoah_Attackx1_2_DirectorBP_C_ExecuteUbergraph_SEQ_SkillNoah_Attackx1_2_DirectorBP::K2Node_CustomEvent_OnoType' has a wrong offset!");
static_assert(offsetof(SEQ_SkillNoah_Attackx1_2_DirectorBP_C_ExecuteUbergraph_SEQ_SkillNoah_Attackx1_2_DirectorBP, Temp_byte_Variable) == 0x000011, "Member 'SEQ_SkillNoah_Attackx1_2_DirectorBP_C_ExecuteUbergraph_SEQ_SkillNoah_Attackx1_2_DirectorBP::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(SEQ_SkillNoah_Attackx1_2_DirectorBP_C_ExecuteUbergraph_SEQ_SkillNoah_Attackx1_2_DirectorBP, Temp_object_Variable) == 0x000018, "Member 'SEQ_SkillNoah_Attackx1_2_DirectorBP_C_ExecuteUbergraph_SEQ_SkillNoah_Attackx1_2_DirectorBP::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(SEQ_SkillNoah_Attackx1_2_DirectorBP_C_ExecuteUbergraph_SEQ_SkillNoah_Attackx1_2_DirectorBP, Temp_object_Variable_1) == 0x000020, "Member 'SEQ_SkillNoah_Attackx1_2_DirectorBP_C_ExecuteUbergraph_SEQ_SkillNoah_Attackx1_2_DirectorBP::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(SEQ_SkillNoah_Attackx1_2_DirectorBP_C_ExecuteUbergraph_SEQ_SkillNoah_Attackx1_2_DirectorBP, Temp_object_Variable_2) == 0x000028, "Member 'SEQ_SkillNoah_Attackx1_2_DirectorBP_C_ExecuteUbergraph_SEQ_SkillNoah_Attackx1_2_DirectorBP::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(SEQ_SkillNoah_Attackx1_2_DirectorBP_C_ExecuteUbergraph_SEQ_SkillNoah_Attackx1_2_DirectorBP, Temp_object_Variable_3) == 0x000030, "Member 'SEQ_SkillNoah_Attackx1_2_DirectorBP_C_ExecuteUbergraph_SEQ_SkillNoah_Attackx1_2_DirectorBP::Temp_object_Variable_3' has a wrong offset!");
static_assert(offsetof(SEQ_SkillNoah_Attackx1_2_DirectorBP_C_ExecuteUbergraph_SEQ_SkillNoah_Attackx1_2_DirectorBP, Temp_object_Variable_4) == 0x000038, "Member 'SEQ_SkillNoah_Attackx1_2_DirectorBP_C_ExecuteUbergraph_SEQ_SkillNoah_Attackx1_2_DirectorBP::Temp_object_Variable_4' has a wrong offset!");
static_assert(offsetof(SEQ_SkillNoah_Attackx1_2_DirectorBP_C_ExecuteUbergraph_SEQ_SkillNoah_Attackx1_2_DirectorBP, Temp_object_Variable_5) == 0x000040, "Member 'SEQ_SkillNoah_Attackx1_2_DirectorBP_C_ExecuteUbergraph_SEQ_SkillNoah_Attackx1_2_DirectorBP::Temp_object_Variable_5' has a wrong offset!");
static_assert(offsetof(SEQ_SkillNoah_Attackx1_2_DirectorBP_C_ExecuteUbergraph_SEQ_SkillNoah_Attackx1_2_DirectorBP, Temp_object_Variable_6) == 0x000048, "Member 'SEQ_SkillNoah_Attackx1_2_DirectorBP_C_ExecuteUbergraph_SEQ_SkillNoah_Attackx1_2_DirectorBP::Temp_object_Variable_6' has a wrong offset!");
static_assert(offsetof(SEQ_SkillNoah_Attackx1_2_DirectorBP_C_ExecuteUbergraph_SEQ_SkillNoah_Attackx1_2_DirectorBP, Temp_object_Variable_7) == 0x000050, "Member 'SEQ_SkillNoah_Attackx1_2_DirectorBP_C_ExecuteUbergraph_SEQ_SkillNoah_Attackx1_2_DirectorBP::Temp_object_Variable_7' has a wrong offset!");
static_assert(offsetof(SEQ_SkillNoah_Attackx1_2_DirectorBP_C_ExecuteUbergraph_SEQ_SkillNoah_Attackx1_2_DirectorBP, Temp_object_Variable_8) == 0x000058, "Member 'SEQ_SkillNoah_Attackx1_2_DirectorBP_C_ExecuteUbergraph_SEQ_SkillNoah_Attackx1_2_DirectorBP::Temp_object_Variable_8' has a wrong offset!");
static_assert(offsetof(SEQ_SkillNoah_Attackx1_2_DirectorBP_C_ExecuteUbergraph_SEQ_SkillNoah_Attackx1_2_DirectorBP, K2Node_CustomEvent_BP_Lucien_Battle) == 0x000060, "Member 'SEQ_SkillNoah_Attackx1_2_DirectorBP_C_ExecuteUbergraph_SEQ_SkillNoah_Attackx1_2_DirectorBP::K2Node_CustomEvent_BP_Lucien_Battle' has a wrong offset!");
static_assert(offsetof(SEQ_SkillNoah_Attackx1_2_DirectorBP_C_ExecuteUbergraph_SEQ_SkillNoah_Attackx1_2_DirectorBP, K2Node_CustomEvent_AddElemental) == 0x000068, "Member 'SEQ_SkillNoah_Attackx1_2_DirectorBP_C_ExecuteUbergraph_SEQ_SkillNoah_Attackx1_2_DirectorBP::K2Node_CustomEvent_AddElemental' has a wrong offset!");
static_assert(offsetof(SEQ_SkillNoah_Attackx1_2_DirectorBP_C_ExecuteUbergraph_SEQ_SkillNoah_Attackx1_2_DirectorBP, K2Node_CustomEvent_BP_AudioCharacter_BattleManager_1) == 0x000080, "Member 'SEQ_SkillNoah_Attackx1_2_DirectorBP_C_ExecuteUbergraph_SEQ_SkillNoah_Attackx1_2_DirectorBP::K2Node_CustomEvent_BP_AudioCharacter_BattleManager_1' has a wrong offset!");
static_assert(offsetof(SEQ_SkillNoah_Attackx1_2_DirectorBP_C_ExecuteUbergraph_SEQ_SkillNoah_Attackx1_2_DirectorBP, K2Node_CustomEvent_Battle_PlaySeqSFX) == 0x000088, "Member 'SEQ_SkillNoah_Attackx1_2_DirectorBP_C_ExecuteUbergraph_SEQ_SkillNoah_Attackx1_2_DirectorBP::K2Node_CustomEvent_Battle_PlaySeqSFX' has a wrong offset!");
static_assert(offsetof(SEQ_SkillNoah_Attackx1_2_DirectorBP_C_ExecuteUbergraph_SEQ_SkillNoah_Attackx1_2_DirectorBP, K2Node_CustomEvent_AttenuationOverride) == 0x000090, "Member 'SEQ_SkillNoah_Attackx1_2_DirectorBP_C_ExecuteUbergraph_SEQ_SkillNoah_Attackx1_2_DirectorBP::K2Node_CustomEvent_AttenuationOverride' has a wrong offset!");
static_assert(offsetof(SEQ_SkillNoah_Attackx1_2_DirectorBP_C_ExecuteUbergraph_SEQ_SkillNoah_Attackx1_2_DirectorBP, K2Node_CustomEvent_SoundShouldFollow_) == 0x000098, "Member 'SEQ_SkillNoah_Attackx1_2_DirectorBP_C_ExecuteUbergraph_SEQ_SkillNoah_Attackx1_2_DirectorBP::K2Node_CustomEvent_SoundShouldFollow_' has a wrong offset!");
static_assert(offsetof(SEQ_SkillNoah_Attackx1_2_DirectorBP_C_ExecuteUbergraph_SEQ_SkillNoah_Attackx1_2_DirectorBP, CallFunc_GetBoundActor_ReturnValue) == 0x0000A0, "Member 'SEQ_SkillNoah_Attackx1_2_DirectorBP_C_ExecuteUbergraph_SEQ_SkillNoah_Attackx1_2_DirectorBP::CallFunc_GetBoundActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(SEQ_SkillNoah_Attackx1_2_DirectorBP_C_ExecuteUbergraph_SEQ_SkillNoah_Attackx1_2_DirectorBP, K2Node_DynamicCast_AsNiagara_Actor) == 0x0000A8, "Member 'SEQ_SkillNoah_Attackx1_2_DirectorBP_C_ExecuteUbergraph_SEQ_SkillNoah_Attackx1_2_DirectorBP::K2Node_DynamicCast_AsNiagara_Actor' has a wrong offset!");
static_assert(offsetof(SEQ_SkillNoah_Attackx1_2_DirectorBP_C_ExecuteUbergraph_SEQ_SkillNoah_Attackx1_2_DirectorBP, K2Node_DynamicCast_bSuccess) == 0x0000B0, "Member 'SEQ_SkillNoah_Attackx1_2_DirectorBP_C_ExecuteUbergraph_SEQ_SkillNoah_Attackx1_2_DirectorBP::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(SEQ_SkillNoah_Attackx1_2_DirectorBP_C_ExecuteUbergraph_SEQ_SkillNoah_Attackx1_2_DirectorBP, CallFunc_GetBaseDamageType_ReturnValue) == 0x0000B1, "Member 'SEQ_SkillNoah_Attackx1_2_DirectorBP_C_ExecuteUbergraph_SEQ_SkillNoah_Attackx1_2_DirectorBP::CallFunc_GetBaseDamageType_ReturnValue' has a wrong offset!");
static_assert(offsetof(SEQ_SkillNoah_Attackx1_2_DirectorBP_C_ExecuteUbergraph_SEQ_SkillNoah_Attackx1_2_DirectorBP, K2Node_Select_Default) == 0x0000B8, "Member 'SEQ_SkillNoah_Attackx1_2_DirectorBP_C_ExecuteUbergraph_SEQ_SkillNoah_Attackx1_2_DirectorBP::K2Node_Select_Default' has a wrong offset!");

// Function SEQ_SkillNoah_Attackx1_2.SEQ_SkillNoah_Attackx1_2_DirectorBP_C.BP_Lucien_Battle_Event
// 0x0020 (0x0020 - 0x0000)
struct SEQ_SkillNoah_Attackx1_2_DirectorBP_C_BP_Lucien_Battle_Event final
{
public:
	class ABP_Noah_Battle_C*                      BP_Lucien_Battle;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FMovieSceneObjectBindingID             AddElemental;                                      // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SEQ_SkillNoah_Attackx1_2_DirectorBP_C_BP_Lucien_Battle_Event) == 0x000008, "Wrong alignment on SEQ_SkillNoah_Attackx1_2_DirectorBP_C_BP_Lucien_Battle_Event");
static_assert(sizeof(SEQ_SkillNoah_Attackx1_2_DirectorBP_C_BP_Lucien_Battle_Event) == 0x000020, "Wrong size on SEQ_SkillNoah_Attackx1_2_DirectorBP_C_BP_Lucien_Battle_Event");
static_assert(offsetof(SEQ_SkillNoah_Attackx1_2_DirectorBP_C_BP_Lucien_Battle_Event, BP_Lucien_Battle) == 0x000000, "Member 'SEQ_SkillNoah_Attackx1_2_DirectorBP_C_BP_Lucien_Battle_Event::BP_Lucien_Battle' has a wrong offset!");
static_assert(offsetof(SEQ_SkillNoah_Attackx1_2_DirectorBP_C_BP_Lucien_Battle_Event, AddElemental) == 0x000008, "Member 'SEQ_SkillNoah_Attackx1_2_DirectorBP_C_BP_Lucien_Battle_Event::AddElemental' has a wrong offset!");

// Function SEQ_SkillNoah_Attackx1_2.SEQ_SkillNoah_Attackx1_2_DirectorBP_C.BP_AudioCharacter_BattleManager_Event_5
// 0x0020 (0x0020 - 0x0000)
struct SEQ_SkillNoah_Attackx1_2_DirectorBP_C_BP_AudioCharacter_BattleManager_Event_5 final
{
public:
	class UBP_AudioCharacter_BattleManager_C*     BP_AudioCharacter_BattleManager;                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Battle_PlaySeqSFX;                                 // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundAttenuation*                      AttenuationOverride;                               // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          SoundShouldFollow_;                                // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SEQ_SkillNoah_Attackx1_2_DirectorBP_C_BP_AudioCharacter_BattleManager_Event_5) == 0x000008, "Wrong alignment on SEQ_SkillNoah_Attackx1_2_DirectorBP_C_BP_AudioCharacter_BattleManager_Event_5");
static_assert(sizeof(SEQ_SkillNoah_Attackx1_2_DirectorBP_C_BP_AudioCharacter_BattleManager_Event_5) == 0x000020, "Wrong size on SEQ_SkillNoah_Attackx1_2_DirectorBP_C_BP_AudioCharacter_BattleManager_Event_5");
static_assert(offsetof(SEQ_SkillNoah_Attackx1_2_DirectorBP_C_BP_AudioCharacter_BattleManager_Event_5, BP_AudioCharacter_BattleManager) == 0x000000, "Member 'SEQ_SkillNoah_Attackx1_2_DirectorBP_C_BP_AudioCharacter_BattleManager_Event_5::BP_AudioCharacter_BattleManager' has a wrong offset!");
static_assert(offsetof(SEQ_SkillNoah_Attackx1_2_DirectorBP_C_BP_AudioCharacter_BattleManager_Event_5, Battle_PlaySeqSFX) == 0x000008, "Member 'SEQ_SkillNoah_Attackx1_2_DirectorBP_C_BP_AudioCharacter_BattleManager_Event_5::Battle_PlaySeqSFX' has a wrong offset!");
static_assert(offsetof(SEQ_SkillNoah_Attackx1_2_DirectorBP_C_BP_AudioCharacter_BattleManager_Event_5, AttenuationOverride) == 0x000010, "Member 'SEQ_SkillNoah_Attackx1_2_DirectorBP_C_BP_AudioCharacter_BattleManager_Event_5::AttenuationOverride' has a wrong offset!");
static_assert(offsetof(SEQ_SkillNoah_Attackx1_2_DirectorBP_C_BP_AudioCharacter_BattleManager_Event_5, SoundShouldFollow_) == 0x000018, "Member 'SEQ_SkillNoah_Attackx1_2_DirectorBP_C_BP_AudioCharacter_BattleManager_Event_5::SoundShouldFollow_' has a wrong offset!");

// Function SEQ_SkillNoah_Attackx1_2.SEQ_SkillNoah_Attackx1_2_DirectorBP_C.BP_AudioCharacter_BattleManager_Event_0
// 0x0010 (0x0010 - 0x0000)
struct SEQ_SkillNoah_Attackx1_2_DirectorBP_C_BP_AudioCharacter_BattleManager_Event_0 final
{
public:
	class UBP_AudioCharacter_BattleManager_C*     BP_AudioCharacter_BattleManager;                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EOnoType                                      OnoType;                                           // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SEQ_SkillNoah_Attackx1_2_DirectorBP_C_BP_AudioCharacter_BattleManager_Event_0) == 0x000008, "Wrong alignment on SEQ_SkillNoah_Attackx1_2_DirectorBP_C_BP_AudioCharacter_BattleManager_Event_0");
static_assert(sizeof(SEQ_SkillNoah_Attackx1_2_DirectorBP_C_BP_AudioCharacter_BattleManager_Event_0) == 0x000010, "Wrong size on SEQ_SkillNoah_Attackx1_2_DirectorBP_C_BP_AudioCharacter_BattleManager_Event_0");
static_assert(offsetof(SEQ_SkillNoah_Attackx1_2_DirectorBP_C_BP_AudioCharacter_BattleManager_Event_0, BP_AudioCharacter_BattleManager) == 0x000000, "Member 'SEQ_SkillNoah_Attackx1_2_DirectorBP_C_BP_AudioCharacter_BattleManager_Event_0::BP_AudioCharacter_BattleManager' has a wrong offset!");
static_assert(offsetof(SEQ_SkillNoah_Attackx1_2_DirectorBP_C_BP_AudioCharacter_BattleManager_Event_0, OnoType) == 0x000008, "Member 'SEQ_SkillNoah_Attackx1_2_DirectorBP_C_BP_AudioCharacter_BattleManager_Event_0::OnoType' has a wrong offset!");

}

