#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Skill_AOECounter_V1

#include "Basic.hpp"

#include "MovieScene_structs.hpp"


namespace SDK::Params
{

// Function Skill_AOECounter_V1.Skill_AOECounter_V1_DirectorBP_C.ExecuteUbergraph_Skill_AOECounter_V1_DirectorBP
// 0x0150 (0x0150 - 0x0000)
struct Skill_AOECounter_V1_DirectorBP_C_ExecuteUbergraph_Skill_AOECounter_V1_DirectorBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_3;                   // 0x000C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_2;                   // 0x0014(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate;              // 0x001C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_1;                   // 0x002C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_1;            // 0x0034(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName;                     // 0x0044(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_2;            // 0x004C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable;                                // 0x005C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_3;            // 0x0070(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAC_jRPG_BattleManager_C*               CallFunc_GetBattleManager_ReturnValue;             // 0x0080(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UAC_jRPG_CharacterBattleStats_C*> CallFunc_GetCurrentlyCounteringCharacters_ReturnValue; // 0x0088(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9D[0x3];                                       // 0x009D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAC_jRPG_BattleManager_C*               CallFunc_GetBattleManager_ReturnValue_1;           // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UAC_jRPG_CharacterBattleStats_C*> CallFunc_GetCurrentlyCounteringCharacters_ReturnValue_1; // 0x00B0(0x0010)(ReferenceParm, ContainsInstancedReference)
	struct FMovieSceneObjectBindingID             K2Node_Select_Default;                             // 0x00C0(0x0018)(NoDestructor, HasGetValueTypeHash)
	class UAC_jRPG_CharacterBattleStats_C*        CallFunc_Array_Get_Item;                           // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetBoundActor_ReturnValue;                // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_jRPG_Character_Battle_Base_C*       CallFunc_GetCharacterBattleBase_jRPG_CharacterBattleBase; // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetCharacterBattleBase_IsValid;           // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsNotEmpty_ReturnValue;             // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F2[0x2];                                       // 0x00F2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAC_jRPG_CharacterBattleStats_C*        CallFunc_Array_Get_Item_1;                         // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_jRPG_Character_Battle_Base_C*       CallFunc_GetCharacterBattleBase_jRPG_CharacterBattleBase_1; // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetCharacterBattleBase_IsValid_1;         // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToActor_ReturnValue;             // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_112[0x6];                                      // 0x0112(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           CallFunc_Array_Random_OutItem;                     // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Random_OutIndex;                    // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_124[0x4];                                      // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue; // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_131[0x3];                                      // 0x0131(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_NotifyName_4;                   // 0x0134(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_4;            // 0x013C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Skill_AOECounter_V1_DirectorBP_C_ExecuteUbergraph_Skill_AOECounter_V1_DirectorBP) == 0x000008, "Wrong alignment on Skill_AOECounter_V1_DirectorBP_C_ExecuteUbergraph_Skill_AOECounter_V1_DirectorBP");
static_assert(sizeof(Skill_AOECounter_V1_DirectorBP_C_ExecuteUbergraph_Skill_AOECounter_V1_DirectorBP) == 0x000150, "Wrong size on Skill_AOECounter_V1_DirectorBP_C_ExecuteUbergraph_Skill_AOECounter_V1_DirectorBP");
static_assert(offsetof(Skill_AOECounter_V1_DirectorBP_C_ExecuteUbergraph_Skill_AOECounter_V1_DirectorBP, EntryPoint) == 0x000000, "Member 'Skill_AOECounter_V1_DirectorBP_C_ExecuteUbergraph_Skill_AOECounter_V1_DirectorBP::EntryPoint' has a wrong offset!");
static_assert(offsetof(Skill_AOECounter_V1_DirectorBP_C_ExecuteUbergraph_Skill_AOECounter_V1_DirectorBP, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'Skill_AOECounter_V1_DirectorBP_C_ExecuteUbergraph_Skill_AOECounter_V1_DirectorBP::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Skill_AOECounter_V1_DirectorBP_C_ExecuteUbergraph_Skill_AOECounter_V1_DirectorBP, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'Skill_AOECounter_V1_DirectorBP_C_ExecuteUbergraph_Skill_AOECounter_V1_DirectorBP::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Skill_AOECounter_V1_DirectorBP_C_ExecuteUbergraph_Skill_AOECounter_V1_DirectorBP, K2Node_CustomEvent_NotifyName_3) == 0x00000C, "Member 'Skill_AOECounter_V1_DirectorBP_C_ExecuteUbergraph_Skill_AOECounter_V1_DirectorBP::K2Node_CustomEvent_NotifyName_3' has a wrong offset!");
static_assert(offsetof(Skill_AOECounter_V1_DirectorBP_C_ExecuteUbergraph_Skill_AOECounter_V1_DirectorBP, K2Node_CustomEvent_NotifyName_2) == 0x000014, "Member 'Skill_AOECounter_V1_DirectorBP_C_ExecuteUbergraph_Skill_AOECounter_V1_DirectorBP::K2Node_CustomEvent_NotifyName_2' has a wrong offset!");
static_assert(offsetof(Skill_AOECounter_V1_DirectorBP_C_ExecuteUbergraph_Skill_AOECounter_V1_DirectorBP, K2Node_CreateDelegate_OutputDelegate) == 0x00001C, "Member 'Skill_AOECounter_V1_DirectorBP_C_ExecuteUbergraph_Skill_AOECounter_V1_DirectorBP::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Skill_AOECounter_V1_DirectorBP_C_ExecuteUbergraph_Skill_AOECounter_V1_DirectorBP, K2Node_CustomEvent_NotifyName_1) == 0x00002C, "Member 'Skill_AOECounter_V1_DirectorBP_C_ExecuteUbergraph_Skill_AOECounter_V1_DirectorBP::K2Node_CustomEvent_NotifyName_1' has a wrong offset!");
static_assert(offsetof(Skill_AOECounter_V1_DirectorBP_C_ExecuteUbergraph_Skill_AOECounter_V1_DirectorBP, K2Node_CreateDelegate_OutputDelegate_1) == 0x000034, "Member 'Skill_AOECounter_V1_DirectorBP_C_ExecuteUbergraph_Skill_AOECounter_V1_DirectorBP::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(Skill_AOECounter_V1_DirectorBP_C_ExecuteUbergraph_Skill_AOECounter_V1_DirectorBP, K2Node_CustomEvent_NotifyName) == 0x000044, "Member 'Skill_AOECounter_V1_DirectorBP_C_ExecuteUbergraph_Skill_AOECounter_V1_DirectorBP::K2Node_CustomEvent_NotifyName' has a wrong offset!");
static_assert(offsetof(Skill_AOECounter_V1_DirectorBP_C_ExecuteUbergraph_Skill_AOECounter_V1_DirectorBP, K2Node_CreateDelegate_OutputDelegate_2) == 0x00004C, "Member 'Skill_AOECounter_V1_DirectorBP_C_ExecuteUbergraph_Skill_AOECounter_V1_DirectorBP::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(Skill_AOECounter_V1_DirectorBP_C_ExecuteUbergraph_Skill_AOECounter_V1_DirectorBP, Temp_name_Variable) == 0x00005C, "Member 'Skill_AOECounter_V1_DirectorBP_C_ExecuteUbergraph_Skill_AOECounter_V1_DirectorBP::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(Skill_AOECounter_V1_DirectorBP_C_ExecuteUbergraph_Skill_AOECounter_V1_DirectorBP, Temp_int_Loop_Counter_Variable_1) == 0x000064, "Member 'Skill_AOECounter_V1_DirectorBP_C_ExecuteUbergraph_Skill_AOECounter_V1_DirectorBP::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(Skill_AOECounter_V1_DirectorBP_C_ExecuteUbergraph_Skill_AOECounter_V1_DirectorBP, CallFunc_Add_IntInt_ReturnValue_1) == 0x000068, "Member 'Skill_AOECounter_V1_DirectorBP_C_ExecuteUbergraph_Skill_AOECounter_V1_DirectorBP::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Skill_AOECounter_V1_DirectorBP_C_ExecuteUbergraph_Skill_AOECounter_V1_DirectorBP, Temp_int_Array_Index_Variable) == 0x00006C, "Member 'Skill_AOECounter_V1_DirectorBP_C_ExecuteUbergraph_Skill_AOECounter_V1_DirectorBP::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Skill_AOECounter_V1_DirectorBP_C_ExecuteUbergraph_Skill_AOECounter_V1_DirectorBP, K2Node_CreateDelegate_OutputDelegate_3) == 0x000070, "Member 'Skill_AOECounter_V1_DirectorBP_C_ExecuteUbergraph_Skill_AOECounter_V1_DirectorBP::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(Skill_AOECounter_V1_DirectorBP_C_ExecuteUbergraph_Skill_AOECounter_V1_DirectorBP, CallFunc_GetBattleManager_ReturnValue) == 0x000080, "Member 'Skill_AOECounter_V1_DirectorBP_C_ExecuteUbergraph_Skill_AOECounter_V1_DirectorBP::CallFunc_GetBattleManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(Skill_AOECounter_V1_DirectorBP_C_ExecuteUbergraph_Skill_AOECounter_V1_DirectorBP, CallFunc_GetCurrentlyCounteringCharacters_ReturnValue) == 0x000088, "Member 'Skill_AOECounter_V1_DirectorBP_C_ExecuteUbergraph_Skill_AOECounter_V1_DirectorBP::CallFunc_GetCurrentlyCounteringCharacters_ReturnValue' has a wrong offset!");
static_assert(offsetof(Skill_AOECounter_V1_DirectorBP_C_ExecuteUbergraph_Skill_AOECounter_V1_DirectorBP, CallFunc_Array_Length_ReturnValue) == 0x000098, "Member 'Skill_AOECounter_V1_DirectorBP_C_ExecuteUbergraph_Skill_AOECounter_V1_DirectorBP::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Skill_AOECounter_V1_DirectorBP_C_ExecuteUbergraph_Skill_AOECounter_V1_DirectorBP, CallFunc_Less_IntInt_ReturnValue) == 0x00009C, "Member 'Skill_AOECounter_V1_DirectorBP_C_ExecuteUbergraph_Skill_AOECounter_V1_DirectorBP::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Skill_AOECounter_V1_DirectorBP_C_ExecuteUbergraph_Skill_AOECounter_V1_DirectorBP, Temp_int_Variable) == 0x0000A0, "Member 'Skill_AOECounter_V1_DirectorBP_C_ExecuteUbergraph_Skill_AOECounter_V1_DirectorBP::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Skill_AOECounter_V1_DirectorBP_C_ExecuteUbergraph_Skill_AOECounter_V1_DirectorBP, Temp_int_Array_Index_Variable_1) == 0x0000A4, "Member 'Skill_AOECounter_V1_DirectorBP_C_ExecuteUbergraph_Skill_AOECounter_V1_DirectorBP::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(Skill_AOECounter_V1_DirectorBP_C_ExecuteUbergraph_Skill_AOECounter_V1_DirectorBP, CallFunc_GetBattleManager_ReturnValue_1) == 0x0000A8, "Member 'Skill_AOECounter_V1_DirectorBP_C_ExecuteUbergraph_Skill_AOECounter_V1_DirectorBP::CallFunc_GetBattleManager_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Skill_AOECounter_V1_DirectorBP_C_ExecuteUbergraph_Skill_AOECounter_V1_DirectorBP, CallFunc_GetCurrentlyCounteringCharacters_ReturnValue_1) == 0x0000B0, "Member 'Skill_AOECounter_V1_DirectorBP_C_ExecuteUbergraph_Skill_AOECounter_V1_DirectorBP::CallFunc_GetCurrentlyCounteringCharacters_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Skill_AOECounter_V1_DirectorBP_C_ExecuteUbergraph_Skill_AOECounter_V1_DirectorBP, K2Node_Select_Default) == 0x0000C0, "Member 'Skill_AOECounter_V1_DirectorBP_C_ExecuteUbergraph_Skill_AOECounter_V1_DirectorBP::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Skill_AOECounter_V1_DirectorBP_C_ExecuteUbergraph_Skill_AOECounter_V1_DirectorBP, CallFunc_Array_Get_Item) == 0x0000D8, "Member 'Skill_AOECounter_V1_DirectorBP_C_ExecuteUbergraph_Skill_AOECounter_V1_DirectorBP::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Skill_AOECounter_V1_DirectorBP_C_ExecuteUbergraph_Skill_AOECounter_V1_DirectorBP, CallFunc_GetBoundActor_ReturnValue) == 0x0000E0, "Member 'Skill_AOECounter_V1_DirectorBP_C_ExecuteUbergraph_Skill_AOECounter_V1_DirectorBP::CallFunc_GetBoundActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Skill_AOECounter_V1_DirectorBP_C_ExecuteUbergraph_Skill_AOECounter_V1_DirectorBP, CallFunc_GetCharacterBattleBase_jRPG_CharacterBattleBase) == 0x0000E8, "Member 'Skill_AOECounter_V1_DirectorBP_C_ExecuteUbergraph_Skill_AOECounter_V1_DirectorBP::CallFunc_GetCharacterBattleBase_jRPG_CharacterBattleBase' has a wrong offset!");
static_assert(offsetof(Skill_AOECounter_V1_DirectorBP_C_ExecuteUbergraph_Skill_AOECounter_V1_DirectorBP, CallFunc_GetCharacterBattleBase_IsValid) == 0x0000F0, "Member 'Skill_AOECounter_V1_DirectorBP_C_ExecuteUbergraph_Skill_AOECounter_V1_DirectorBP::CallFunc_GetCharacterBattleBase_IsValid' has a wrong offset!");
static_assert(offsetof(Skill_AOECounter_V1_DirectorBP_C_ExecuteUbergraph_Skill_AOECounter_V1_DirectorBP, CallFunc_Array_IsNotEmpty_ReturnValue) == 0x0000F1, "Member 'Skill_AOECounter_V1_DirectorBP_C_ExecuteUbergraph_Skill_AOECounter_V1_DirectorBP::CallFunc_Array_IsNotEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(Skill_AOECounter_V1_DirectorBP_C_ExecuteUbergraph_Skill_AOECounter_V1_DirectorBP, CallFunc_Array_Length_ReturnValue_1) == 0x0000F4, "Member 'Skill_AOECounter_V1_DirectorBP_C_ExecuteUbergraph_Skill_AOECounter_V1_DirectorBP::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Skill_AOECounter_V1_DirectorBP_C_ExecuteUbergraph_Skill_AOECounter_V1_DirectorBP, CallFunc_Array_Get_Item_1) == 0x0000F8, "Member 'Skill_AOECounter_V1_DirectorBP_C_ExecuteUbergraph_Skill_AOECounter_V1_DirectorBP::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(Skill_AOECounter_V1_DirectorBP_C_ExecuteUbergraph_Skill_AOECounter_V1_DirectorBP, CallFunc_Less_IntInt_ReturnValue_1) == 0x000100, "Member 'Skill_AOECounter_V1_DirectorBP_C_ExecuteUbergraph_Skill_AOECounter_V1_DirectorBP::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Skill_AOECounter_V1_DirectorBP_C_ExecuteUbergraph_Skill_AOECounter_V1_DirectorBP, CallFunc_GetCharacterBattleBase_jRPG_CharacterBattleBase_1) == 0x000108, "Member 'Skill_AOECounter_V1_DirectorBP_C_ExecuteUbergraph_Skill_AOECounter_V1_DirectorBP::CallFunc_GetCharacterBattleBase_jRPG_CharacterBattleBase_1' has a wrong offset!");
static_assert(offsetof(Skill_AOECounter_V1_DirectorBP_C_ExecuteUbergraph_Skill_AOECounter_V1_DirectorBP, CallFunc_GetCharacterBattleBase_IsValid_1) == 0x000110, "Member 'Skill_AOECounter_V1_DirectorBP_C_ExecuteUbergraph_Skill_AOECounter_V1_DirectorBP::CallFunc_GetCharacterBattleBase_IsValid_1' has a wrong offset!");
static_assert(offsetof(Skill_AOECounter_V1_DirectorBP_C_ExecuteUbergraph_Skill_AOECounter_V1_DirectorBP, CallFunc_K2_AttachToActor_ReturnValue) == 0x000111, "Member 'Skill_AOECounter_V1_DirectorBP_C_ExecuteUbergraph_Skill_AOECounter_V1_DirectorBP::CallFunc_K2_AttachToActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Skill_AOECounter_V1_DirectorBP_C_ExecuteUbergraph_Skill_AOECounter_V1_DirectorBP, CallFunc_Array_Random_OutItem) == 0x000118, "Member 'Skill_AOECounter_V1_DirectorBP_C_ExecuteUbergraph_Skill_AOECounter_V1_DirectorBP::CallFunc_Array_Random_OutItem' has a wrong offset!");
static_assert(offsetof(Skill_AOECounter_V1_DirectorBP_C_ExecuteUbergraph_Skill_AOECounter_V1_DirectorBP, CallFunc_Array_Random_OutIndex) == 0x000120, "Member 'Skill_AOECounter_V1_DirectorBP_C_ExecuteUbergraph_Skill_AOECounter_V1_DirectorBP::CallFunc_Array_Random_OutIndex' has a wrong offset!");
static_assert(offsetof(Skill_AOECounter_V1_DirectorBP_C_ExecuteUbergraph_Skill_AOECounter_V1_DirectorBP, CallFunc_CreateProxyObjectForPlayMontage_ReturnValue) == 0x000128, "Member 'Skill_AOECounter_V1_DirectorBP_C_ExecuteUbergraph_Skill_AOECounter_V1_DirectorBP::CallFunc_CreateProxyObjectForPlayMontage_ReturnValue' has a wrong offset!");
static_assert(offsetof(Skill_AOECounter_V1_DirectorBP_C_ExecuteUbergraph_Skill_AOECounter_V1_DirectorBP, CallFunc_IsValid_ReturnValue) == 0x000130, "Member 'Skill_AOECounter_V1_DirectorBP_C_ExecuteUbergraph_Skill_AOECounter_V1_DirectorBP::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Skill_AOECounter_V1_DirectorBP_C_ExecuteUbergraph_Skill_AOECounter_V1_DirectorBP, K2Node_CustomEvent_NotifyName_4) == 0x000134, "Member 'Skill_AOECounter_V1_DirectorBP_C_ExecuteUbergraph_Skill_AOECounter_V1_DirectorBP::K2Node_CustomEvent_NotifyName_4' has a wrong offset!");
static_assert(offsetof(Skill_AOECounter_V1_DirectorBP_C_ExecuteUbergraph_Skill_AOECounter_V1_DirectorBP, K2Node_CreateDelegate_OutputDelegate_4) == 0x00013C, "Member 'Skill_AOECounter_V1_DirectorBP_C_ExecuteUbergraph_Skill_AOECounter_V1_DirectorBP::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");

// Function Skill_AOECounter_V1.Skill_AOECounter_V1_DirectorBP_C.OnBlendOut_DCFCFB1E42E4445FD7ABA285991A11C7
// 0x0008 (0x0008 - 0x0000)
struct Skill_AOECounter_V1_DirectorBP_C_OnBlendOut_DCFCFB1E42E4445FD7ABA285991A11C7 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Skill_AOECounter_V1_DirectorBP_C_OnBlendOut_DCFCFB1E42E4445FD7ABA285991A11C7) == 0x000004, "Wrong alignment on Skill_AOECounter_V1_DirectorBP_C_OnBlendOut_DCFCFB1E42E4445FD7ABA285991A11C7");
static_assert(sizeof(Skill_AOECounter_V1_DirectorBP_C_OnBlendOut_DCFCFB1E42E4445FD7ABA285991A11C7) == 0x000008, "Wrong size on Skill_AOECounter_V1_DirectorBP_C_OnBlendOut_DCFCFB1E42E4445FD7ABA285991A11C7");
static_assert(offsetof(Skill_AOECounter_V1_DirectorBP_C_OnBlendOut_DCFCFB1E42E4445FD7ABA285991A11C7, NotifyName) == 0x000000, "Member 'Skill_AOECounter_V1_DirectorBP_C_OnBlendOut_DCFCFB1E42E4445FD7ABA285991A11C7::NotifyName' has a wrong offset!");

// Function Skill_AOECounter_V1.Skill_AOECounter_V1_DirectorBP_C.OnCompleted_DCFCFB1E42E4445FD7ABA285991A11C7
// 0x0008 (0x0008 - 0x0000)
struct Skill_AOECounter_V1_DirectorBP_C_OnCompleted_DCFCFB1E42E4445FD7ABA285991A11C7 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Skill_AOECounter_V1_DirectorBP_C_OnCompleted_DCFCFB1E42E4445FD7ABA285991A11C7) == 0x000004, "Wrong alignment on Skill_AOECounter_V1_DirectorBP_C_OnCompleted_DCFCFB1E42E4445FD7ABA285991A11C7");
static_assert(sizeof(Skill_AOECounter_V1_DirectorBP_C_OnCompleted_DCFCFB1E42E4445FD7ABA285991A11C7) == 0x000008, "Wrong size on Skill_AOECounter_V1_DirectorBP_C_OnCompleted_DCFCFB1E42E4445FD7ABA285991A11C7");
static_assert(offsetof(Skill_AOECounter_V1_DirectorBP_C_OnCompleted_DCFCFB1E42E4445FD7ABA285991A11C7, NotifyName) == 0x000000, "Member 'Skill_AOECounter_V1_DirectorBP_C_OnCompleted_DCFCFB1E42E4445FD7ABA285991A11C7::NotifyName' has a wrong offset!");

// Function Skill_AOECounter_V1.Skill_AOECounter_V1_DirectorBP_C.OnInterrupted_DCFCFB1E42E4445FD7ABA285991A11C7
// 0x0008 (0x0008 - 0x0000)
struct Skill_AOECounter_V1_DirectorBP_C_OnInterrupted_DCFCFB1E42E4445FD7ABA285991A11C7 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Skill_AOECounter_V1_DirectorBP_C_OnInterrupted_DCFCFB1E42E4445FD7ABA285991A11C7) == 0x000004, "Wrong alignment on Skill_AOECounter_V1_DirectorBP_C_OnInterrupted_DCFCFB1E42E4445FD7ABA285991A11C7");
static_assert(sizeof(Skill_AOECounter_V1_DirectorBP_C_OnInterrupted_DCFCFB1E42E4445FD7ABA285991A11C7) == 0x000008, "Wrong size on Skill_AOECounter_V1_DirectorBP_C_OnInterrupted_DCFCFB1E42E4445FD7ABA285991A11C7");
static_assert(offsetof(Skill_AOECounter_V1_DirectorBP_C_OnInterrupted_DCFCFB1E42E4445FD7ABA285991A11C7, NotifyName) == 0x000000, "Member 'Skill_AOECounter_V1_DirectorBP_C_OnInterrupted_DCFCFB1E42E4445FD7ABA285991A11C7::NotifyName' has a wrong offset!");

// Function Skill_AOECounter_V1.Skill_AOECounter_V1_DirectorBP_C.OnNotifyBegin_DCFCFB1E42E4445FD7ABA285991A11C7
// 0x0008 (0x0008 - 0x0000)
struct Skill_AOECounter_V1_DirectorBP_C_OnNotifyBegin_DCFCFB1E42E4445FD7ABA285991A11C7 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Skill_AOECounter_V1_DirectorBP_C_OnNotifyBegin_DCFCFB1E42E4445FD7ABA285991A11C7) == 0x000004, "Wrong alignment on Skill_AOECounter_V1_DirectorBP_C_OnNotifyBegin_DCFCFB1E42E4445FD7ABA285991A11C7");
static_assert(sizeof(Skill_AOECounter_V1_DirectorBP_C_OnNotifyBegin_DCFCFB1E42E4445FD7ABA285991A11C7) == 0x000008, "Wrong size on Skill_AOECounter_V1_DirectorBP_C_OnNotifyBegin_DCFCFB1E42E4445FD7ABA285991A11C7");
static_assert(offsetof(Skill_AOECounter_V1_DirectorBP_C_OnNotifyBegin_DCFCFB1E42E4445FD7ABA285991A11C7, NotifyName) == 0x000000, "Member 'Skill_AOECounter_V1_DirectorBP_C_OnNotifyBegin_DCFCFB1E42E4445FD7ABA285991A11C7::NotifyName' has a wrong offset!");

// Function Skill_AOECounter_V1.Skill_AOECounter_V1_DirectorBP_C.OnNotifyEnd_DCFCFB1E42E4445FD7ABA285991A11C7
// 0x0008 (0x0008 - 0x0000)
struct Skill_AOECounter_V1_DirectorBP_C_OnNotifyEnd_DCFCFB1E42E4445FD7ABA285991A11C7 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Skill_AOECounter_V1_DirectorBP_C_OnNotifyEnd_DCFCFB1E42E4445FD7ABA285991A11C7) == 0x000004, "Wrong alignment on Skill_AOECounter_V1_DirectorBP_C_OnNotifyEnd_DCFCFB1E42E4445FD7ABA285991A11C7");
static_assert(sizeof(Skill_AOECounter_V1_DirectorBP_C_OnNotifyEnd_DCFCFB1E42E4445FD7ABA285991A11C7) == 0x000008, "Wrong size on Skill_AOECounter_V1_DirectorBP_C_OnNotifyEnd_DCFCFB1E42E4445FD7ABA285991A11C7");
static_assert(offsetof(Skill_AOECounter_V1_DirectorBP_C_OnNotifyEnd_DCFCFB1E42E4445FD7ABA285991A11C7, NotifyName) == 0x000000, "Member 'Skill_AOECounter_V1_DirectorBP_C_OnNotifyEnd_DCFCFB1E42E4445FD7ABA285991A11C7::NotifyName' has a wrong offset!");

}

