#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SMBP_PaintBunch_Rocks2

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass SMBP_PaintBunch_Rocks2.SMBP_PaintBunch_Rocks2_C
// 0x0040 (0x02D0 - 0x0290)
class ASMBP_PaintBunch_Rocks2_C final : public AActor
{
public:
	class UStaticMeshComponent*                   Icelandic_Boulder_LOD0_tbiu7;                      // 0x0290(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Icelandic_Boulder_LOD0_tbiu6;                      // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Icelandic_Boulder_LOD0_tbiu5;                      // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Icelandic_Boulder_LOD0_tbiu3;                      // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Icelandic_Boulder_LOD0_tbiu4;                      // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_PaintBunch13;                                   // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   tgziabifa_LOD0;                                    // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        SharedRoot;                                        // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SMBP_PaintBunch_Rocks2_C">();
	}
	static class ASMBP_PaintBunch_Rocks2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASMBP_PaintBunch_Rocks2_C>();
	}
};
static_assert(alignof(ASMBP_PaintBunch_Rocks2_C) == 0x000008, "Wrong alignment on ASMBP_PaintBunch_Rocks2_C");
static_assert(sizeof(ASMBP_PaintBunch_Rocks2_C) == 0x0002D0, "Wrong size on ASMBP_PaintBunch_Rocks2_C");
static_assert(offsetof(ASMBP_PaintBunch_Rocks2_C, Icelandic_Boulder_LOD0_tbiu7) == 0x000290, "Member 'ASMBP_PaintBunch_Rocks2_C::Icelandic_Boulder_LOD0_tbiu7' has a wrong offset!");
static_assert(offsetof(ASMBP_PaintBunch_Rocks2_C, Icelandic_Boulder_LOD0_tbiu6) == 0x000298, "Member 'ASMBP_PaintBunch_Rocks2_C::Icelandic_Boulder_LOD0_tbiu6' has a wrong offset!");
static_assert(offsetof(ASMBP_PaintBunch_Rocks2_C, Icelandic_Boulder_LOD0_tbiu5) == 0x0002A0, "Member 'ASMBP_PaintBunch_Rocks2_C::Icelandic_Boulder_LOD0_tbiu5' has a wrong offset!");
static_assert(offsetof(ASMBP_PaintBunch_Rocks2_C, Icelandic_Boulder_LOD0_tbiu3) == 0x0002A8, "Member 'ASMBP_PaintBunch_Rocks2_C::Icelandic_Boulder_LOD0_tbiu3' has a wrong offset!");
static_assert(offsetof(ASMBP_PaintBunch_Rocks2_C, Icelandic_Boulder_LOD0_tbiu4) == 0x0002B0, "Member 'ASMBP_PaintBunch_Rocks2_C::Icelandic_Boulder_LOD0_tbiu4' has a wrong offset!");
static_assert(offsetof(ASMBP_PaintBunch_Rocks2_C, SM_PaintBunch13) == 0x0002B8, "Member 'ASMBP_PaintBunch_Rocks2_C::SM_PaintBunch13' has a wrong offset!");
static_assert(offsetof(ASMBP_PaintBunch_Rocks2_C, tgziabifa_LOD0) == 0x0002C0, "Member 'ASMBP_PaintBunch_Rocks2_C::tgziabifa_LOD0' has a wrong offset!");
static_assert(offsetof(ASMBP_PaintBunch_Rocks2_C, SharedRoot) == 0x0002C8, "Member 'ASMBP_PaintBunch_Rocks2_C::SharedRoot' has a wrong offset!");

}

