#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ThirdPerson_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct ThirdPerson_AnimBP.ThirdPerson_AnimBP_C.AnimBlueprintGeneratedConstantData
// 0x03E7 (0x03E8 - 0x0001)
struct ThirdPerson_AnimBP::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_90;                                 // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_91;                                 // 0x000C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_92;                                  // 0x0014(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_93;                                // 0x0018(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_94;                                 // 0x001C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_95;                                  // 0x0024(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_96;                               // 0x0028(0x002C)(BlueprintVisible, NoDestructor)
	class FName                                   __NameProperty_97;                                 // 0x0054(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_98;                                  // 0x005C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_99;                                 // 0x0060(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_100;                               // 0x0064(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_101;                               // 0x0068(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_102;                                // 0x006C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_103;                                // 0x006D(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_104;                                // 0x006E(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6F[0x1];                                       // 0x006F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_105;                                // 0x0070(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_106;                                // 0x0078(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_107;                                // 0x0080(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_108;                                 // 0x0088(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_109;                              // 0x0090(0x0020)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x00B0(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0130(0x0018)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root;                           // 0x0148(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_3;             // 0x0178(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_2;             // 0x01A8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_1;             // 0x01D8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult;               // 0x0208(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_2;               // 0x0238(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_3;                  // 0x0268(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_1;               // 0x0298(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_2;                  // 0x02C8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer;                 // 0x02F8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_1;                  // 0x0328(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer;               // 0x0358(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult;                    // 0x0388(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine;                   // 0x03B8(0x0030)()
};
static_assert(alignof(ThirdPerson_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on ThirdPerson_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(ThirdPerson_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x0003E8, "Wrong size on ThirdPerson_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(ThirdPerson_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_90) == 0x000004, "Member 'ThirdPerson_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_90' has a wrong offset!");
static_assert(offsetof(ThirdPerson_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_91) == 0x00000C, "Member 'ThirdPerson_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_91' has a wrong offset!");
static_assert(offsetof(ThirdPerson_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_92) == 0x000014, "Member 'ThirdPerson_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_92' has a wrong offset!");
static_assert(offsetof(ThirdPerson_AnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_93) == 0x000018, "Member 'ThirdPerson_AnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_93' has a wrong offset!");
static_assert(offsetof(ThirdPerson_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_94) == 0x00001C, "Member 'ThirdPerson_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_94' has a wrong offset!");
static_assert(offsetof(ThirdPerson_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_95) == 0x000024, "Member 'ThirdPerson_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_95' has a wrong offset!");
static_assert(offsetof(ThirdPerson_AnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_96) == 0x000028, "Member 'ThirdPerson_AnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_96' has a wrong offset!");
static_assert(offsetof(ThirdPerson_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_97) == 0x000054, "Member 'ThirdPerson_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_97' has a wrong offset!");
static_assert(offsetof(ThirdPerson_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_98) == 0x00005C, "Member 'ThirdPerson_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_98' has a wrong offset!");
static_assert(offsetof(ThirdPerson_AnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_99) == 0x000060, "Member 'ThirdPerson_AnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_99' has a wrong offset!");
static_assert(offsetof(ThirdPerson_AnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_100) == 0x000064, "Member 'ThirdPerson_AnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_100' has a wrong offset!");
static_assert(offsetof(ThirdPerson_AnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_101) == 0x000068, "Member 'ThirdPerson_AnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_101' has a wrong offset!");
static_assert(offsetof(ThirdPerson_AnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_102) == 0x00006C, "Member 'ThirdPerson_AnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_102' has a wrong offset!");
static_assert(offsetof(ThirdPerson_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_103) == 0x00006D, "Member 'ThirdPerson_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_103' has a wrong offset!");
static_assert(offsetof(ThirdPerson_AnimBP::FAnimBlueprintGeneratedConstantData, __ByteProperty_104) == 0x00006E, "Member 'ThirdPerson_AnimBP::FAnimBlueprintGeneratedConstantData::__ByteProperty_104' has a wrong offset!");
static_assert(offsetof(ThirdPerson_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_105) == 0x000070, "Member 'ThirdPerson_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_105' has a wrong offset!");
static_assert(offsetof(ThirdPerson_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_106) == 0x000078, "Member 'ThirdPerson_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_106' has a wrong offset!");
static_assert(offsetof(ThirdPerson_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_107) == 0x000080, "Member 'ThirdPerson_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_107' has a wrong offset!");
static_assert(offsetof(ThirdPerson_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_108) == 0x000088, "Member 'ThirdPerson_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_108' has a wrong offset!");
static_assert(offsetof(ThirdPerson_AnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_109) == 0x000090, "Member 'ThirdPerson_AnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_109' has a wrong offset!");
static_assert(offsetof(ThirdPerson_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x0000B0, "Member 'ThirdPerson_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(ThirdPerson_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000130, "Member 'ThirdPerson_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(ThirdPerson_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root) == 0x000148, "Member 'ThirdPerson_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(ThirdPerson_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_3) == 0x000178, "Member 'ThirdPerson_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_3' has a wrong offset!");
static_assert(offsetof(ThirdPerson_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_2) == 0x0001A8, "Member 'ThirdPerson_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_2' has a wrong offset!");
static_assert(offsetof(ThirdPerson_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_1) == 0x0001D8, "Member 'ThirdPerson_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(ThirdPerson_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult) == 0x000208, "Member 'ThirdPerson_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(ThirdPerson_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_2) == 0x000238, "Member 'ThirdPerson_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(ThirdPerson_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult_3) == 0x000268, "Member 'ThirdPerson_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult_3' has a wrong offset!");
static_assert(offsetof(ThirdPerson_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_1) == 0x000298, "Member 'ThirdPerson_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(ThirdPerson_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult_2) == 0x0002C8, "Member 'ThirdPerson_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult_2' has a wrong offset!");
static_assert(offsetof(ThirdPerson_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer) == 0x0002F8, "Member 'ThirdPerson_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(ThirdPerson_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult_1) == 0x000328, "Member 'ThirdPerson_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(ThirdPerson_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendSpacePlayer) == 0x000358, "Member 'ThirdPerson_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendSpacePlayer' has a wrong offset!");
static_assert(offsetof(ThirdPerson_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult) == 0x000388, "Member 'ThirdPerson_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(ThirdPerson_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateMachine) == 0x0003B8, "Member 'ThirdPerson_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateMachine' has a wrong offset!");

// ScriptStruct ThirdPerson_AnimBP.ThirdPerson_AnimBP_C.AnimBlueprintGeneratedMutableData
// 0x0007 (0x0008 - 0x0001)
struct ThirdPerson_AnimBP::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty;                                   // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ThirdPerson_AnimBP::FAnimBlueprintGeneratedMutableData) == 0x000004, "Wrong alignment on ThirdPerson_AnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(ThirdPerson_AnimBP::FAnimBlueprintGeneratedMutableData) == 0x000008, "Wrong size on ThirdPerson_AnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(ThirdPerson_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty) == 0x000004, "Member 'ThirdPerson_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty' has a wrong offset!");

}

