#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Transient

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "ControlRig_structs.hpp"
#include "PBIK_structs.hpp"
#include "RigVM_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct Transient.ChaosDestructionEvent_SWC
// 0x0044 (0x0044 - 0x0000)
struct FChaosDestructionEvent_SWC final
{
public:
	struct FVector3f                              position;                                          // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector3f                              Normal;                                            // 0x000C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector3f                              Velocity;                                          // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector3f                              AngularVelocity;                                   // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ExtentMin;                                         // 0x0030(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ExtentMax;                                         // 0x0034(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ParticleID;                                        // 0x0038(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Time;                                              // 0x003C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Type;                                              // 0x0040(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FChaosDestructionEvent_SWC) == 0x000004, "Wrong alignment on FChaosDestructionEvent_SWC");
static_assert(sizeof(FChaosDestructionEvent_SWC) == 0x000044, "Wrong size on FChaosDestructionEvent_SWC");
static_assert(offsetof(FChaosDestructionEvent_SWC, position) == 0x000000, "Member 'FChaosDestructionEvent_SWC::position' has a wrong offset!");
static_assert(offsetof(FChaosDestructionEvent_SWC, Normal) == 0x00000C, "Member 'FChaosDestructionEvent_SWC::Normal' has a wrong offset!");
static_assert(offsetof(FChaosDestructionEvent_SWC, Velocity) == 0x000018, "Member 'FChaosDestructionEvent_SWC::Velocity' has a wrong offset!");
static_assert(offsetof(FChaosDestructionEvent_SWC, AngularVelocity) == 0x000024, "Member 'FChaosDestructionEvent_SWC::AngularVelocity' has a wrong offset!");
static_assert(offsetof(FChaosDestructionEvent_SWC, ExtentMin) == 0x000030, "Member 'FChaosDestructionEvent_SWC::ExtentMin' has a wrong offset!");
static_assert(offsetof(FChaosDestructionEvent_SWC, ExtentMax) == 0x000034, "Member 'FChaosDestructionEvent_SWC::ExtentMax' has a wrong offset!");
static_assert(offsetof(FChaosDestructionEvent_SWC, ParticleID) == 0x000038, "Member 'FChaosDestructionEvent_SWC::ParticleID' has a wrong offset!");
static_assert(offsetof(FChaosDestructionEvent_SWC, Time) == 0x00003C, "Member 'FChaosDestructionEvent_SWC::Time' has a wrong offset!");
static_assert(offsetof(FChaosDestructionEvent_SWC, Type) == 0x000040, "Member 'FChaosDestructionEvent_SWC::Type' has a wrong offset!");

// PropertyBag Transient.PropertyBag_b6db9592576a290f
// 0x0610 (0x0610 - 0x0000)
struct FPropertyBag_b6db9592576a290f final
{
public:
	struct FTransform                             RigVMModel___GetTransform_2_Transform;             // 0x0000(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___GetTransform_2_CachedIndex;           // 0x0060(0x0010)(Edit)
	TArray<struct FCachedRigElement>              RigVMModel___Set_Transform_CachedIndex;            // 0x0070(0x0010)(Edit)
	struct FTransform                             RigVMModel___GetTransform_2_1_Transform;           // 0x0080(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___GetTransform_2_1_CachedIndex;         // 0x00E0(0x0010)(Edit)
	TArray<struct FCachedRigElement>              RigVMModel___Set_Transform_1_CachedIndex;          // 0x00F0(0x0010)(Edit)
	struct FVector                                RigVMModel___FootTrace_Offset;                     // 0x0100(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                FootTrace___FootTrace_MathVectorAdd_Result;        // 0x0118(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             FootTrace___FootTrace_GetTransform_Transform;      // 0x0130(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              FootTrace___FootTrace_GetTransform_CachedIndex;    // 0x0190(0x0010)(Edit)
	float                                         FootTrace___FootTrace_MathFloatAdd_Result;         // 0x01A0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FootTrace___FootTrace_MathFloatAdd_A;              // 0x01A4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A8[0x8];                                      // 0x01A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             FootTrace___FootTrace_GetTransform_1_Transform;    // 0x01B0(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              FootTrace___FootTrace_GetTransform_1_CachedIndex;  // 0x0210(0x0010)(Edit)
	struct FVector                                FootTrace___FootTrace_MathVectorAdd_A__IO;         // 0x0220(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                FootTrace___FootTrace_MathVectorSub_Result;        // 0x0238(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                FootTrace___FootTrace_MathVectorSub_A__IO;         // 0x0250(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          FootTrace___FootTrace_SphereTraceByTraceChannel_bHit; // 0x0268(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_269[0x7];                                      // 0x0269(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                FootTrace___FootTrace_SphereTraceByTraceChannel_HitNormal; // 0x0270(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FRigUnit_SphereTrace_WorkData>  FootTrace___FootTrace_SphereTraceByTraceChannel_WorkData; // 0x0288(0x0010)(Edit)
	struct FVector                                RigVMModel___FootTrace_1_Offset;                   // 0x0298(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                FootTrace_1___FootTrace_MathVectorAdd_Result;      // 0x02B0(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C8[0x8];                                      // 0x02C8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             FootTrace_1___FootTrace_GetTransform_Transform;    // 0x02D0(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              FootTrace_1___FootTrace_GetTransform_CachedIndex;  // 0x0330(0x0010)(Edit)
	float                                         FootTrace_1___FootTrace_MathFloatAdd_Result;       // 0x0340(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FootTrace_1___FootTrace_MathFloatAdd_A;            // 0x0344(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_348[0x8];                                      // 0x0348(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             FootTrace_1___FootTrace_GetTransform_1_Transform;  // 0x0350(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              FootTrace_1___FootTrace_GetTransform_1_CachedIndex; // 0x03B0(0x0010)(Edit)
	struct FVector                                FootTrace_1___FootTrace_MathVectorAdd_A__IO;       // 0x03C0(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                FootTrace_1___FootTrace_MathVectorSub_Result;      // 0x03D8(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                FootTrace_1___FootTrace_MathVectorSub_A__IO;       // 0x03F0(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          FootTrace_1___FootTrace_SphereTraceByTraceChannel_bHit; // 0x0408(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_409[0x7];                                      // 0x0409(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                FootTrace_1___FootTrace_SphereTraceByTraceChannel_HitNormal; // 0x0410(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FRigUnit_SphereTrace_WorkData>  FootTrace_1___FootTrace_SphereTraceByTraceChannel_WorkData; // 0x0428(0x0010)(Edit)
	class FName                                   RigVMModel___Branch_BlockToRun;                    // 0x0438(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___AlphaInterp_Result;                   // 0x0440(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___AlphaInterp_Value;                    // 0x0444(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FInputScaleBiasClamp>           RigVMModel___AlphaInterp_ScaleBiasClamp;           // 0x0448(0x0010)(Edit)
	float                                         RigVMModel___AlphaInterp_1_Result;                 // 0x0458(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___AlphaInterp_1_Value;                  // 0x045C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FInputScaleBiasClamp>           RigVMModel___AlphaInterp_1_ScaleBiasClamp;         // 0x0460(0x0010)(Edit)
	float                                         RigVMModel___MathFloatLerp_Result;                 // 0x0470(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___MathFloatLerp_A;                      // 0x0474(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        RigVMModel___If_Result;                            // 0x0478(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RigVMModel___MathFloatLess_Result;                 // 0x0480(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_481[0x3];                                      // 0x0481(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RigVMModel___MathFloatLess_A;                      // 0x0484(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___MathFloatLess_B;                      // 0x0488(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RigVMModel___If_Condition;                         // 0x048C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_48D[0x3];                                      // 0x048D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RigVMModel___MathFloatLerp_B;                      // 0x0490(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_494[0x4];                                      // 0x0494(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FRigUnit_ModifyTransforms_PerItem> RigVMModel___ModifyTransforms_ItemToModify__IO; // 0x0498(0x0010)(Edit)
	TArray<struct FRigUnit_ModifyTransforms_WorkData> RigVMModel___ModifyTransforms_WorkData;        // 0x04A8(0x0010)(Edit)
	TArray<struct FRigUnit_ModifyTransforms_PerItem> RigVMModel___ModifyTransforms_1_ItemToModify__IO; // 0x04B8(0x0010)(Edit)
	TArray<struct FRigUnit_ModifyTransforms_WorkData> RigVMModel___ModifyTransforms_1_WorkData;      // 0x04C8(0x0010)(Edit)
	TArray<struct FRigUnit_ModifyTransforms_PerItem> RigVMModel___ModifyTransforms_1_1_ItemToModify__IO; // 0x04D8(0x0010)(Edit)
	TArray<struct FRigUnit_ModifyTransforms_WorkData> RigVMModel___ModifyTransforms_1_1_WorkData;    // 0x04E8(0x0010)(Edit)
	uint8                                         Pad_4F8[0x8];                                      // 0x04F8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             RigVMModel___GetTransform_Transform;               // 0x0500(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___GetTransform_CachedIndex;             // 0x0560(0x0010)(Edit)
	struct FTransform                             RigVMModel___GetTransform_1_Transform;             // 0x0570(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___GetTransform_1_CachedIndex;           // 0x05D0(0x0010)(Edit)
	TArray<struct FPBIKEffector>                  RigVMModel___PBIK_Effectors__IO;                   // 0x05E0(0x0010)(Edit)
	TArray<TArray<int32>>                         RigVMModel___PBIK_EffectorSolverIndices;           // 0x05F0(0x0010)(Edit)
	TArray<struct FPBIKWorkData>                  RigVMModel___PBIK_WorkData;                        // 0x0600(0x0010)(Edit)
};
static_assert(alignof(FPropertyBag_b6db9592576a290f) == 0x000010, "Wrong alignment on FPropertyBag_b6db9592576a290f");
static_assert(sizeof(FPropertyBag_b6db9592576a290f) == 0x000610, "Wrong size on FPropertyBag_b6db9592576a290f");
static_assert(offsetof(FPropertyBag_b6db9592576a290f, RigVMModel___GetTransform_2_Transform) == 0x000000, "Member 'FPropertyBag_b6db9592576a290f::RigVMModel___GetTransform_2_Transform' has a wrong offset!");
static_assert(offsetof(FPropertyBag_b6db9592576a290f, RigVMModel___GetTransform_2_CachedIndex) == 0x000060, "Member 'FPropertyBag_b6db9592576a290f::RigVMModel___GetTransform_2_CachedIndex' has a wrong offset!");
static_assert(offsetof(FPropertyBag_b6db9592576a290f, RigVMModel___Set_Transform_CachedIndex) == 0x000070, "Member 'FPropertyBag_b6db9592576a290f::RigVMModel___Set_Transform_CachedIndex' has a wrong offset!");
static_assert(offsetof(FPropertyBag_b6db9592576a290f, RigVMModel___GetTransform_2_1_Transform) == 0x000080, "Member 'FPropertyBag_b6db9592576a290f::RigVMModel___GetTransform_2_1_Transform' has a wrong offset!");
static_assert(offsetof(FPropertyBag_b6db9592576a290f, RigVMModel___GetTransform_2_1_CachedIndex) == 0x0000E0, "Member 'FPropertyBag_b6db9592576a290f::RigVMModel___GetTransform_2_1_CachedIndex' has a wrong offset!");
static_assert(offsetof(FPropertyBag_b6db9592576a290f, RigVMModel___Set_Transform_1_CachedIndex) == 0x0000F0, "Member 'FPropertyBag_b6db9592576a290f::RigVMModel___Set_Transform_1_CachedIndex' has a wrong offset!");
static_assert(offsetof(FPropertyBag_b6db9592576a290f, RigVMModel___FootTrace_Offset) == 0x000100, "Member 'FPropertyBag_b6db9592576a290f::RigVMModel___FootTrace_Offset' has a wrong offset!");
static_assert(offsetof(FPropertyBag_b6db9592576a290f, FootTrace___FootTrace_MathVectorAdd_Result) == 0x000118, "Member 'FPropertyBag_b6db9592576a290f::FootTrace___FootTrace_MathVectorAdd_Result' has a wrong offset!");
static_assert(offsetof(FPropertyBag_b6db9592576a290f, FootTrace___FootTrace_GetTransform_Transform) == 0x000130, "Member 'FPropertyBag_b6db9592576a290f::FootTrace___FootTrace_GetTransform_Transform' has a wrong offset!");
static_assert(offsetof(FPropertyBag_b6db9592576a290f, FootTrace___FootTrace_GetTransform_CachedIndex) == 0x000190, "Member 'FPropertyBag_b6db9592576a290f::FootTrace___FootTrace_GetTransform_CachedIndex' has a wrong offset!");
static_assert(offsetof(FPropertyBag_b6db9592576a290f, FootTrace___FootTrace_MathFloatAdd_Result) == 0x0001A0, "Member 'FPropertyBag_b6db9592576a290f::FootTrace___FootTrace_MathFloatAdd_Result' has a wrong offset!");
static_assert(offsetof(FPropertyBag_b6db9592576a290f, FootTrace___FootTrace_MathFloatAdd_A) == 0x0001A4, "Member 'FPropertyBag_b6db9592576a290f::FootTrace___FootTrace_MathFloatAdd_A' has a wrong offset!");
static_assert(offsetof(FPropertyBag_b6db9592576a290f, FootTrace___FootTrace_GetTransform_1_Transform) == 0x0001B0, "Member 'FPropertyBag_b6db9592576a290f::FootTrace___FootTrace_GetTransform_1_Transform' has a wrong offset!");
static_assert(offsetof(FPropertyBag_b6db9592576a290f, FootTrace___FootTrace_GetTransform_1_CachedIndex) == 0x000210, "Member 'FPropertyBag_b6db9592576a290f::FootTrace___FootTrace_GetTransform_1_CachedIndex' has a wrong offset!");
static_assert(offsetof(FPropertyBag_b6db9592576a290f, FootTrace___FootTrace_MathVectorAdd_A__IO) == 0x000220, "Member 'FPropertyBag_b6db9592576a290f::FootTrace___FootTrace_MathVectorAdd_A__IO' has a wrong offset!");
static_assert(offsetof(FPropertyBag_b6db9592576a290f, FootTrace___FootTrace_MathVectorSub_Result) == 0x000238, "Member 'FPropertyBag_b6db9592576a290f::FootTrace___FootTrace_MathVectorSub_Result' has a wrong offset!");
static_assert(offsetof(FPropertyBag_b6db9592576a290f, FootTrace___FootTrace_MathVectorSub_A__IO) == 0x000250, "Member 'FPropertyBag_b6db9592576a290f::FootTrace___FootTrace_MathVectorSub_A__IO' has a wrong offset!");
static_assert(offsetof(FPropertyBag_b6db9592576a290f, FootTrace___FootTrace_SphereTraceByTraceChannel_bHit) == 0x000268, "Member 'FPropertyBag_b6db9592576a290f::FootTrace___FootTrace_SphereTraceByTraceChannel_bHit' has a wrong offset!");
static_assert(offsetof(FPropertyBag_b6db9592576a290f, FootTrace___FootTrace_SphereTraceByTraceChannel_HitNormal) == 0x000270, "Member 'FPropertyBag_b6db9592576a290f::FootTrace___FootTrace_SphereTraceByTraceChannel_HitNormal' has a wrong offset!");
static_assert(offsetof(FPropertyBag_b6db9592576a290f, FootTrace___FootTrace_SphereTraceByTraceChannel_WorkData) == 0x000288, "Member 'FPropertyBag_b6db9592576a290f::FootTrace___FootTrace_SphereTraceByTraceChannel_WorkData' has a wrong offset!");
static_assert(offsetof(FPropertyBag_b6db9592576a290f, RigVMModel___FootTrace_1_Offset) == 0x000298, "Member 'FPropertyBag_b6db9592576a290f::RigVMModel___FootTrace_1_Offset' has a wrong offset!");
static_assert(offsetof(FPropertyBag_b6db9592576a290f, FootTrace_1___FootTrace_MathVectorAdd_Result) == 0x0002B0, "Member 'FPropertyBag_b6db9592576a290f::FootTrace_1___FootTrace_MathVectorAdd_Result' has a wrong offset!");
static_assert(offsetof(FPropertyBag_b6db9592576a290f, FootTrace_1___FootTrace_GetTransform_Transform) == 0x0002D0, "Member 'FPropertyBag_b6db9592576a290f::FootTrace_1___FootTrace_GetTransform_Transform' has a wrong offset!");
static_assert(offsetof(FPropertyBag_b6db9592576a290f, FootTrace_1___FootTrace_GetTransform_CachedIndex) == 0x000330, "Member 'FPropertyBag_b6db9592576a290f::FootTrace_1___FootTrace_GetTransform_CachedIndex' has a wrong offset!");
static_assert(offsetof(FPropertyBag_b6db9592576a290f, FootTrace_1___FootTrace_MathFloatAdd_Result) == 0x000340, "Member 'FPropertyBag_b6db9592576a290f::FootTrace_1___FootTrace_MathFloatAdd_Result' has a wrong offset!");
static_assert(offsetof(FPropertyBag_b6db9592576a290f, FootTrace_1___FootTrace_MathFloatAdd_A) == 0x000344, "Member 'FPropertyBag_b6db9592576a290f::FootTrace_1___FootTrace_MathFloatAdd_A' has a wrong offset!");
static_assert(offsetof(FPropertyBag_b6db9592576a290f, FootTrace_1___FootTrace_GetTransform_1_Transform) == 0x000350, "Member 'FPropertyBag_b6db9592576a290f::FootTrace_1___FootTrace_GetTransform_1_Transform' has a wrong offset!");
static_assert(offsetof(FPropertyBag_b6db9592576a290f, FootTrace_1___FootTrace_GetTransform_1_CachedIndex) == 0x0003B0, "Member 'FPropertyBag_b6db9592576a290f::FootTrace_1___FootTrace_GetTransform_1_CachedIndex' has a wrong offset!");
static_assert(offsetof(FPropertyBag_b6db9592576a290f, FootTrace_1___FootTrace_MathVectorAdd_A__IO) == 0x0003C0, "Member 'FPropertyBag_b6db9592576a290f::FootTrace_1___FootTrace_MathVectorAdd_A__IO' has a wrong offset!");
static_assert(offsetof(FPropertyBag_b6db9592576a290f, FootTrace_1___FootTrace_MathVectorSub_Result) == 0x0003D8, "Member 'FPropertyBag_b6db9592576a290f::FootTrace_1___FootTrace_MathVectorSub_Result' has a wrong offset!");
static_assert(offsetof(FPropertyBag_b6db9592576a290f, FootTrace_1___FootTrace_MathVectorSub_A__IO) == 0x0003F0, "Member 'FPropertyBag_b6db9592576a290f::FootTrace_1___FootTrace_MathVectorSub_A__IO' has a wrong offset!");
static_assert(offsetof(FPropertyBag_b6db9592576a290f, FootTrace_1___FootTrace_SphereTraceByTraceChannel_bHit) == 0x000408, "Member 'FPropertyBag_b6db9592576a290f::FootTrace_1___FootTrace_SphereTraceByTraceChannel_bHit' has a wrong offset!");
static_assert(offsetof(FPropertyBag_b6db9592576a290f, FootTrace_1___FootTrace_SphereTraceByTraceChannel_HitNormal) == 0x000410, "Member 'FPropertyBag_b6db9592576a290f::FootTrace_1___FootTrace_SphereTraceByTraceChannel_HitNormal' has a wrong offset!");
static_assert(offsetof(FPropertyBag_b6db9592576a290f, FootTrace_1___FootTrace_SphereTraceByTraceChannel_WorkData) == 0x000428, "Member 'FPropertyBag_b6db9592576a290f::FootTrace_1___FootTrace_SphereTraceByTraceChannel_WorkData' has a wrong offset!");
static_assert(offsetof(FPropertyBag_b6db9592576a290f, RigVMModel___Branch_BlockToRun) == 0x000438, "Member 'FPropertyBag_b6db9592576a290f::RigVMModel___Branch_BlockToRun' has a wrong offset!");
static_assert(offsetof(FPropertyBag_b6db9592576a290f, RigVMModel___AlphaInterp_Result) == 0x000440, "Member 'FPropertyBag_b6db9592576a290f::RigVMModel___AlphaInterp_Result' has a wrong offset!");
static_assert(offsetof(FPropertyBag_b6db9592576a290f, RigVMModel___AlphaInterp_Value) == 0x000444, "Member 'FPropertyBag_b6db9592576a290f::RigVMModel___AlphaInterp_Value' has a wrong offset!");
static_assert(offsetof(FPropertyBag_b6db9592576a290f, RigVMModel___AlphaInterp_ScaleBiasClamp) == 0x000448, "Member 'FPropertyBag_b6db9592576a290f::RigVMModel___AlphaInterp_ScaleBiasClamp' has a wrong offset!");
static_assert(offsetof(FPropertyBag_b6db9592576a290f, RigVMModel___AlphaInterp_1_Result) == 0x000458, "Member 'FPropertyBag_b6db9592576a290f::RigVMModel___AlphaInterp_1_Result' has a wrong offset!");
static_assert(offsetof(FPropertyBag_b6db9592576a290f, RigVMModel___AlphaInterp_1_Value) == 0x00045C, "Member 'FPropertyBag_b6db9592576a290f::RigVMModel___AlphaInterp_1_Value' has a wrong offset!");
static_assert(offsetof(FPropertyBag_b6db9592576a290f, RigVMModel___AlphaInterp_1_ScaleBiasClamp) == 0x000460, "Member 'FPropertyBag_b6db9592576a290f::RigVMModel___AlphaInterp_1_ScaleBiasClamp' has a wrong offset!");
static_assert(offsetof(FPropertyBag_b6db9592576a290f, RigVMModel___MathFloatLerp_Result) == 0x000470, "Member 'FPropertyBag_b6db9592576a290f::RigVMModel___MathFloatLerp_Result' has a wrong offset!");
static_assert(offsetof(FPropertyBag_b6db9592576a290f, RigVMModel___MathFloatLerp_A) == 0x000474, "Member 'FPropertyBag_b6db9592576a290f::RigVMModel___MathFloatLerp_A' has a wrong offset!");
static_assert(offsetof(FPropertyBag_b6db9592576a290f, RigVMModel___If_Result) == 0x000478, "Member 'FPropertyBag_b6db9592576a290f::RigVMModel___If_Result' has a wrong offset!");
static_assert(offsetof(FPropertyBag_b6db9592576a290f, RigVMModel___MathFloatLess_Result) == 0x000480, "Member 'FPropertyBag_b6db9592576a290f::RigVMModel___MathFloatLess_Result' has a wrong offset!");
static_assert(offsetof(FPropertyBag_b6db9592576a290f, RigVMModel___MathFloatLess_A) == 0x000484, "Member 'FPropertyBag_b6db9592576a290f::RigVMModel___MathFloatLess_A' has a wrong offset!");
static_assert(offsetof(FPropertyBag_b6db9592576a290f, RigVMModel___MathFloatLess_B) == 0x000488, "Member 'FPropertyBag_b6db9592576a290f::RigVMModel___MathFloatLess_B' has a wrong offset!");
static_assert(offsetof(FPropertyBag_b6db9592576a290f, RigVMModel___If_Condition) == 0x00048C, "Member 'FPropertyBag_b6db9592576a290f::RigVMModel___If_Condition' has a wrong offset!");
static_assert(offsetof(FPropertyBag_b6db9592576a290f, RigVMModel___MathFloatLerp_B) == 0x000490, "Member 'FPropertyBag_b6db9592576a290f::RigVMModel___MathFloatLerp_B' has a wrong offset!");
static_assert(offsetof(FPropertyBag_b6db9592576a290f, RigVMModel___ModifyTransforms_ItemToModify__IO) == 0x000498, "Member 'FPropertyBag_b6db9592576a290f::RigVMModel___ModifyTransforms_ItemToModify__IO' has a wrong offset!");
static_assert(offsetof(FPropertyBag_b6db9592576a290f, RigVMModel___ModifyTransforms_WorkData) == 0x0004A8, "Member 'FPropertyBag_b6db9592576a290f::RigVMModel___ModifyTransforms_WorkData' has a wrong offset!");
static_assert(offsetof(FPropertyBag_b6db9592576a290f, RigVMModel___ModifyTransforms_1_ItemToModify__IO) == 0x0004B8, "Member 'FPropertyBag_b6db9592576a290f::RigVMModel___ModifyTransforms_1_ItemToModify__IO' has a wrong offset!");
static_assert(offsetof(FPropertyBag_b6db9592576a290f, RigVMModel___ModifyTransforms_1_WorkData) == 0x0004C8, "Member 'FPropertyBag_b6db9592576a290f::RigVMModel___ModifyTransforms_1_WorkData' has a wrong offset!");
static_assert(offsetof(FPropertyBag_b6db9592576a290f, RigVMModel___ModifyTransforms_1_1_ItemToModify__IO) == 0x0004D8, "Member 'FPropertyBag_b6db9592576a290f::RigVMModel___ModifyTransforms_1_1_ItemToModify__IO' has a wrong offset!");
static_assert(offsetof(FPropertyBag_b6db9592576a290f, RigVMModel___ModifyTransforms_1_1_WorkData) == 0x0004E8, "Member 'FPropertyBag_b6db9592576a290f::RigVMModel___ModifyTransforms_1_1_WorkData' has a wrong offset!");
static_assert(offsetof(FPropertyBag_b6db9592576a290f, RigVMModel___GetTransform_Transform) == 0x000500, "Member 'FPropertyBag_b6db9592576a290f::RigVMModel___GetTransform_Transform' has a wrong offset!");
static_assert(offsetof(FPropertyBag_b6db9592576a290f, RigVMModel___GetTransform_CachedIndex) == 0x000560, "Member 'FPropertyBag_b6db9592576a290f::RigVMModel___GetTransform_CachedIndex' has a wrong offset!");
static_assert(offsetof(FPropertyBag_b6db9592576a290f, RigVMModel___GetTransform_1_Transform) == 0x000570, "Member 'FPropertyBag_b6db9592576a290f::RigVMModel___GetTransform_1_Transform' has a wrong offset!");
static_assert(offsetof(FPropertyBag_b6db9592576a290f, RigVMModel___GetTransform_1_CachedIndex) == 0x0005D0, "Member 'FPropertyBag_b6db9592576a290f::RigVMModel___GetTransform_1_CachedIndex' has a wrong offset!");
static_assert(offsetof(FPropertyBag_b6db9592576a290f, RigVMModel___PBIK_Effectors__IO) == 0x0005E0, "Member 'FPropertyBag_b6db9592576a290f::RigVMModel___PBIK_Effectors__IO' has a wrong offset!");
static_assert(offsetof(FPropertyBag_b6db9592576a290f, RigVMModel___PBIK_EffectorSolverIndices) == 0x0005F0, "Member 'FPropertyBag_b6db9592576a290f::RigVMModel___PBIK_EffectorSolverIndices' has a wrong offset!");
static_assert(offsetof(FPropertyBag_b6db9592576a290f, RigVMModel___PBIK_WorkData) == 0x000600, "Member 'FPropertyBag_b6db9592576a290f::RigVMModel___PBIK_WorkData' has a wrong offset!");

// PropertyBag Transient.PropertyBag_1960383695e3676a
// 0x0500 (0x0500 - 0x0000)
struct FPropertyBag_1960383695e3676a final
{
public:
	struct FVector                                RigVMModel___FootTrace_Offset;                     // 0x0000(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                FootTrace___FootTrace_MathVectorAdd_Result;        // 0x0018(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             FootTrace___FootTrace_GetTransform_Transform;      // 0x0030(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              FootTrace___FootTrace_GetTransform_CachedIndex;    // 0x0090(0x0010)(Edit)
	float                                         FootTrace___FootTrace_MathFloatAdd_Result;         // 0x00A0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FootTrace___FootTrace_MathFloatAdd_A;              // 0x00A4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A8[0x8];                                       // 0x00A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             FootTrace___FootTrace_GetTransform_1_Transform;    // 0x00B0(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              FootTrace___FootTrace_GetTransform_1_CachedIndex;  // 0x0110(0x0010)(Edit)
	struct FVector                                FootTrace___FootTrace_MathVectorAdd_A__IO;         // 0x0120(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                FootTrace___FootTrace_MathVectorSub_Result;        // 0x0138(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                FootTrace___FootTrace_MathVectorSub_A__IO;         // 0x0150(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          FootTrace___FootTrace_SphereTraceByTraceChannel_bHit; // 0x0168(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                FootTrace___FootTrace_SphereTraceByTraceChannel_HitNormal; // 0x0170(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FRigUnit_SphereTrace_WorkData>  FootTrace___FootTrace_SphereTraceByTraceChannel_WorkData; // 0x0188(0x0010)(Edit)
	struct FVector                                RigVMModel___FootTrace_1_Offset;                   // 0x0198(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                FootTrace_1___FootTrace_MathVectorAdd_Result;      // 0x01B0(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C8[0x8];                                      // 0x01C8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             FootTrace_1___FootTrace_GetTransform_Transform;    // 0x01D0(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              FootTrace_1___FootTrace_GetTransform_CachedIndex;  // 0x0230(0x0010)(Edit)
	float                                         FootTrace_1___FootTrace_MathFloatAdd_Result;       // 0x0240(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FootTrace_1___FootTrace_MathFloatAdd_A;            // 0x0244(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_248[0x8];                                      // 0x0248(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             FootTrace_1___FootTrace_GetTransform_1_Transform;  // 0x0250(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              FootTrace_1___FootTrace_GetTransform_1_CachedIndex; // 0x02B0(0x0010)(Edit)
	struct FVector                                FootTrace_1___FootTrace_MathVectorAdd_A__IO;       // 0x02C0(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                FootTrace_1___FootTrace_MathVectorSub_Result;      // 0x02D8(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                FootTrace_1___FootTrace_MathVectorSub_A__IO;       // 0x02F0(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          FootTrace_1___FootTrace_SphereTraceByTraceChannel_bHit; // 0x0308(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_309[0x7];                                      // 0x0309(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                FootTrace_1___FootTrace_SphereTraceByTraceChannel_HitNormal; // 0x0310(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FRigUnit_SphereTrace_WorkData>  FootTrace_1___FootTrace_SphereTraceByTraceChannel_WorkData; // 0x0328(0x0010)(Edit)
	class FName                                   RigVMModel___Branch_RigVMUnitNode_BlockToRun;      // 0x0338(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___AlphaInterp_Result;                   // 0x0340(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___AlphaInterp_Value;                    // 0x0344(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FInputScaleBiasClamp>           RigVMModel___AlphaInterp_ScaleBiasClamp;           // 0x0348(0x0010)(Edit)
	float                                         RigVMModel___AlphaInterp_1_Result;                 // 0x0358(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___AlphaInterp_1_Value;                  // 0x035C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FInputScaleBiasClamp>           RigVMModel___AlphaInterp_1_ScaleBiasClamp;         // 0x0360(0x0010)(Edit)
	float                                         RigVMModel___If_Result;                            // 0x0370(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RigVMModel___MathFloatLess_Result;                 // 0x0374(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_375[0x3];                                      // 0x0375(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RigVMModel___MathFloatLess_A;                      // 0x0378(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___MathFloatLess_B;                      // 0x037C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RigVMModel___If_Condition;                         // 0x0380(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_381[0x3];                                      // 0x0381(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RigVMModel___If_True;                              // 0x0384(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___If_False;                             // 0x0388(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_38C[0x4];                                      // 0x038C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FRigUnit_ModifyTransforms_PerItem> RigVMModel___ModifyTransforms_ItemToModify__IO; // 0x0390(0x0010)(Edit)
	TArray<struct FRigUnit_ModifyTransforms_WorkData> RigVMModel___ModifyTransforms_WorkData;        // 0x03A0(0x0010)(Edit)
	TArray<struct FRigUnit_ModifyTransforms_PerItem> RigVMModel___ModifyTransforms_1_ItemToModify__IO; // 0x03B0(0x0010)(Edit)
	TArray<struct FRigUnit_ModifyTransforms_WorkData> RigVMModel___ModifyTransforms_1_WorkData;      // 0x03C0(0x0010)(Edit)
	TArray<struct FRigUnit_ModifyTransforms_PerItem> RigVMModel___ModifyTransforms_1_1_ItemToModify__IO; // 0x03D0(0x0010)(Edit)
	TArray<struct FRigUnit_ModifyTransforms_WorkData> RigVMModel___ModifyTransforms_1_1_WorkData;    // 0x03E0(0x0010)(Edit)
	struct FTransform                             RigVMModel___GetTransform_Transform;               // 0x03F0(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___GetTransform_CachedIndex;             // 0x0450(0x0010)(Edit)
	struct FTransform                             RigVMModel___GetTransform_1_Transform;             // 0x0460(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___GetTransform_1_CachedIndex;           // 0x04C0(0x0010)(Edit)
	TArray<struct FPBIKEffector>                  RigVMModel___PBIK_Effectors__IO;                   // 0x04D0(0x0010)(Edit)
	TArray<TArray<int32>>                         RigVMModel___PBIK_EffectorSolverIndices;           // 0x04E0(0x0010)(Edit)
	TArray<struct FPBIKWorkData>                  RigVMModel___PBIK_WorkData;                        // 0x04F0(0x0010)(Edit)
};
static_assert(alignof(FPropertyBag_1960383695e3676a) == 0x000010, "Wrong alignment on FPropertyBag_1960383695e3676a");
static_assert(sizeof(FPropertyBag_1960383695e3676a) == 0x000500, "Wrong size on FPropertyBag_1960383695e3676a");
static_assert(offsetof(FPropertyBag_1960383695e3676a, RigVMModel___FootTrace_Offset) == 0x000000, "Member 'FPropertyBag_1960383695e3676a::RigVMModel___FootTrace_Offset' has a wrong offset!");
static_assert(offsetof(FPropertyBag_1960383695e3676a, FootTrace___FootTrace_MathVectorAdd_Result) == 0x000018, "Member 'FPropertyBag_1960383695e3676a::FootTrace___FootTrace_MathVectorAdd_Result' has a wrong offset!");
static_assert(offsetof(FPropertyBag_1960383695e3676a, FootTrace___FootTrace_GetTransform_Transform) == 0x000030, "Member 'FPropertyBag_1960383695e3676a::FootTrace___FootTrace_GetTransform_Transform' has a wrong offset!");
static_assert(offsetof(FPropertyBag_1960383695e3676a, FootTrace___FootTrace_GetTransform_CachedIndex) == 0x000090, "Member 'FPropertyBag_1960383695e3676a::FootTrace___FootTrace_GetTransform_CachedIndex' has a wrong offset!");
static_assert(offsetof(FPropertyBag_1960383695e3676a, FootTrace___FootTrace_MathFloatAdd_Result) == 0x0000A0, "Member 'FPropertyBag_1960383695e3676a::FootTrace___FootTrace_MathFloatAdd_Result' has a wrong offset!");
static_assert(offsetof(FPropertyBag_1960383695e3676a, FootTrace___FootTrace_MathFloatAdd_A) == 0x0000A4, "Member 'FPropertyBag_1960383695e3676a::FootTrace___FootTrace_MathFloatAdd_A' has a wrong offset!");
static_assert(offsetof(FPropertyBag_1960383695e3676a, FootTrace___FootTrace_GetTransform_1_Transform) == 0x0000B0, "Member 'FPropertyBag_1960383695e3676a::FootTrace___FootTrace_GetTransform_1_Transform' has a wrong offset!");
static_assert(offsetof(FPropertyBag_1960383695e3676a, FootTrace___FootTrace_GetTransform_1_CachedIndex) == 0x000110, "Member 'FPropertyBag_1960383695e3676a::FootTrace___FootTrace_GetTransform_1_CachedIndex' has a wrong offset!");
static_assert(offsetof(FPropertyBag_1960383695e3676a, FootTrace___FootTrace_MathVectorAdd_A__IO) == 0x000120, "Member 'FPropertyBag_1960383695e3676a::FootTrace___FootTrace_MathVectorAdd_A__IO' has a wrong offset!");
static_assert(offsetof(FPropertyBag_1960383695e3676a, FootTrace___FootTrace_MathVectorSub_Result) == 0x000138, "Member 'FPropertyBag_1960383695e3676a::FootTrace___FootTrace_MathVectorSub_Result' has a wrong offset!");
static_assert(offsetof(FPropertyBag_1960383695e3676a, FootTrace___FootTrace_MathVectorSub_A__IO) == 0x000150, "Member 'FPropertyBag_1960383695e3676a::FootTrace___FootTrace_MathVectorSub_A__IO' has a wrong offset!");
static_assert(offsetof(FPropertyBag_1960383695e3676a, FootTrace___FootTrace_SphereTraceByTraceChannel_bHit) == 0x000168, "Member 'FPropertyBag_1960383695e3676a::FootTrace___FootTrace_SphereTraceByTraceChannel_bHit' has a wrong offset!");
static_assert(offsetof(FPropertyBag_1960383695e3676a, FootTrace___FootTrace_SphereTraceByTraceChannel_HitNormal) == 0x000170, "Member 'FPropertyBag_1960383695e3676a::FootTrace___FootTrace_SphereTraceByTraceChannel_HitNormal' has a wrong offset!");
static_assert(offsetof(FPropertyBag_1960383695e3676a, FootTrace___FootTrace_SphereTraceByTraceChannel_WorkData) == 0x000188, "Member 'FPropertyBag_1960383695e3676a::FootTrace___FootTrace_SphereTraceByTraceChannel_WorkData' has a wrong offset!");
static_assert(offsetof(FPropertyBag_1960383695e3676a, RigVMModel___FootTrace_1_Offset) == 0x000198, "Member 'FPropertyBag_1960383695e3676a::RigVMModel___FootTrace_1_Offset' has a wrong offset!");
static_assert(offsetof(FPropertyBag_1960383695e3676a, FootTrace_1___FootTrace_MathVectorAdd_Result) == 0x0001B0, "Member 'FPropertyBag_1960383695e3676a::FootTrace_1___FootTrace_MathVectorAdd_Result' has a wrong offset!");
static_assert(offsetof(FPropertyBag_1960383695e3676a, FootTrace_1___FootTrace_GetTransform_Transform) == 0x0001D0, "Member 'FPropertyBag_1960383695e3676a::FootTrace_1___FootTrace_GetTransform_Transform' has a wrong offset!");
static_assert(offsetof(FPropertyBag_1960383695e3676a, FootTrace_1___FootTrace_GetTransform_CachedIndex) == 0x000230, "Member 'FPropertyBag_1960383695e3676a::FootTrace_1___FootTrace_GetTransform_CachedIndex' has a wrong offset!");
static_assert(offsetof(FPropertyBag_1960383695e3676a, FootTrace_1___FootTrace_MathFloatAdd_Result) == 0x000240, "Member 'FPropertyBag_1960383695e3676a::FootTrace_1___FootTrace_MathFloatAdd_Result' has a wrong offset!");
static_assert(offsetof(FPropertyBag_1960383695e3676a, FootTrace_1___FootTrace_MathFloatAdd_A) == 0x000244, "Member 'FPropertyBag_1960383695e3676a::FootTrace_1___FootTrace_MathFloatAdd_A' has a wrong offset!");
static_assert(offsetof(FPropertyBag_1960383695e3676a, FootTrace_1___FootTrace_GetTransform_1_Transform) == 0x000250, "Member 'FPropertyBag_1960383695e3676a::FootTrace_1___FootTrace_GetTransform_1_Transform' has a wrong offset!");
static_assert(offsetof(FPropertyBag_1960383695e3676a, FootTrace_1___FootTrace_GetTransform_1_CachedIndex) == 0x0002B0, "Member 'FPropertyBag_1960383695e3676a::FootTrace_1___FootTrace_GetTransform_1_CachedIndex' has a wrong offset!");
static_assert(offsetof(FPropertyBag_1960383695e3676a, FootTrace_1___FootTrace_MathVectorAdd_A__IO) == 0x0002C0, "Member 'FPropertyBag_1960383695e3676a::FootTrace_1___FootTrace_MathVectorAdd_A__IO' has a wrong offset!");
static_assert(offsetof(FPropertyBag_1960383695e3676a, FootTrace_1___FootTrace_MathVectorSub_Result) == 0x0002D8, "Member 'FPropertyBag_1960383695e3676a::FootTrace_1___FootTrace_MathVectorSub_Result' has a wrong offset!");
static_assert(offsetof(FPropertyBag_1960383695e3676a, FootTrace_1___FootTrace_MathVectorSub_A__IO) == 0x0002F0, "Member 'FPropertyBag_1960383695e3676a::FootTrace_1___FootTrace_MathVectorSub_A__IO' has a wrong offset!");
static_assert(offsetof(FPropertyBag_1960383695e3676a, FootTrace_1___FootTrace_SphereTraceByTraceChannel_bHit) == 0x000308, "Member 'FPropertyBag_1960383695e3676a::FootTrace_1___FootTrace_SphereTraceByTraceChannel_bHit' has a wrong offset!");
static_assert(offsetof(FPropertyBag_1960383695e3676a, FootTrace_1___FootTrace_SphereTraceByTraceChannel_HitNormal) == 0x000310, "Member 'FPropertyBag_1960383695e3676a::FootTrace_1___FootTrace_SphereTraceByTraceChannel_HitNormal' has a wrong offset!");
static_assert(offsetof(FPropertyBag_1960383695e3676a, FootTrace_1___FootTrace_SphereTraceByTraceChannel_WorkData) == 0x000328, "Member 'FPropertyBag_1960383695e3676a::FootTrace_1___FootTrace_SphereTraceByTraceChannel_WorkData' has a wrong offset!");
static_assert(offsetof(FPropertyBag_1960383695e3676a, RigVMModel___Branch_RigVMUnitNode_BlockToRun) == 0x000338, "Member 'FPropertyBag_1960383695e3676a::RigVMModel___Branch_RigVMUnitNode_BlockToRun' has a wrong offset!");
static_assert(offsetof(FPropertyBag_1960383695e3676a, RigVMModel___AlphaInterp_Result) == 0x000340, "Member 'FPropertyBag_1960383695e3676a::RigVMModel___AlphaInterp_Result' has a wrong offset!");
static_assert(offsetof(FPropertyBag_1960383695e3676a, RigVMModel___AlphaInterp_Value) == 0x000344, "Member 'FPropertyBag_1960383695e3676a::RigVMModel___AlphaInterp_Value' has a wrong offset!");
static_assert(offsetof(FPropertyBag_1960383695e3676a, RigVMModel___AlphaInterp_ScaleBiasClamp) == 0x000348, "Member 'FPropertyBag_1960383695e3676a::RigVMModel___AlphaInterp_ScaleBiasClamp' has a wrong offset!");
static_assert(offsetof(FPropertyBag_1960383695e3676a, RigVMModel___AlphaInterp_1_Result) == 0x000358, "Member 'FPropertyBag_1960383695e3676a::RigVMModel___AlphaInterp_1_Result' has a wrong offset!");
static_assert(offsetof(FPropertyBag_1960383695e3676a, RigVMModel___AlphaInterp_1_Value) == 0x00035C, "Member 'FPropertyBag_1960383695e3676a::RigVMModel___AlphaInterp_1_Value' has a wrong offset!");
static_assert(offsetof(FPropertyBag_1960383695e3676a, RigVMModel___AlphaInterp_1_ScaleBiasClamp) == 0x000360, "Member 'FPropertyBag_1960383695e3676a::RigVMModel___AlphaInterp_1_ScaleBiasClamp' has a wrong offset!");
static_assert(offsetof(FPropertyBag_1960383695e3676a, RigVMModel___If_Result) == 0x000370, "Member 'FPropertyBag_1960383695e3676a::RigVMModel___If_Result' has a wrong offset!");
static_assert(offsetof(FPropertyBag_1960383695e3676a, RigVMModel___MathFloatLess_Result) == 0x000374, "Member 'FPropertyBag_1960383695e3676a::RigVMModel___MathFloatLess_Result' has a wrong offset!");
static_assert(offsetof(FPropertyBag_1960383695e3676a, RigVMModel___MathFloatLess_A) == 0x000378, "Member 'FPropertyBag_1960383695e3676a::RigVMModel___MathFloatLess_A' has a wrong offset!");
static_assert(offsetof(FPropertyBag_1960383695e3676a, RigVMModel___MathFloatLess_B) == 0x00037C, "Member 'FPropertyBag_1960383695e3676a::RigVMModel___MathFloatLess_B' has a wrong offset!");
static_assert(offsetof(FPropertyBag_1960383695e3676a, RigVMModel___If_Condition) == 0x000380, "Member 'FPropertyBag_1960383695e3676a::RigVMModel___If_Condition' has a wrong offset!");
static_assert(offsetof(FPropertyBag_1960383695e3676a, RigVMModel___If_True) == 0x000384, "Member 'FPropertyBag_1960383695e3676a::RigVMModel___If_True' has a wrong offset!");
static_assert(offsetof(FPropertyBag_1960383695e3676a, RigVMModel___If_False) == 0x000388, "Member 'FPropertyBag_1960383695e3676a::RigVMModel___If_False' has a wrong offset!");
static_assert(offsetof(FPropertyBag_1960383695e3676a, RigVMModel___ModifyTransforms_ItemToModify__IO) == 0x000390, "Member 'FPropertyBag_1960383695e3676a::RigVMModel___ModifyTransforms_ItemToModify__IO' has a wrong offset!");
static_assert(offsetof(FPropertyBag_1960383695e3676a, RigVMModel___ModifyTransforms_WorkData) == 0x0003A0, "Member 'FPropertyBag_1960383695e3676a::RigVMModel___ModifyTransforms_WorkData' has a wrong offset!");
static_assert(offsetof(FPropertyBag_1960383695e3676a, RigVMModel___ModifyTransforms_1_ItemToModify__IO) == 0x0003B0, "Member 'FPropertyBag_1960383695e3676a::RigVMModel___ModifyTransforms_1_ItemToModify__IO' has a wrong offset!");
static_assert(offsetof(FPropertyBag_1960383695e3676a, RigVMModel___ModifyTransforms_1_WorkData) == 0x0003C0, "Member 'FPropertyBag_1960383695e3676a::RigVMModel___ModifyTransforms_1_WorkData' has a wrong offset!");
static_assert(offsetof(FPropertyBag_1960383695e3676a, RigVMModel___ModifyTransforms_1_1_ItemToModify__IO) == 0x0003D0, "Member 'FPropertyBag_1960383695e3676a::RigVMModel___ModifyTransforms_1_1_ItemToModify__IO' has a wrong offset!");
static_assert(offsetof(FPropertyBag_1960383695e3676a, RigVMModel___ModifyTransforms_1_1_WorkData) == 0x0003E0, "Member 'FPropertyBag_1960383695e3676a::RigVMModel___ModifyTransforms_1_1_WorkData' has a wrong offset!");
static_assert(offsetof(FPropertyBag_1960383695e3676a, RigVMModel___GetTransform_Transform) == 0x0003F0, "Member 'FPropertyBag_1960383695e3676a::RigVMModel___GetTransform_Transform' has a wrong offset!");
static_assert(offsetof(FPropertyBag_1960383695e3676a, RigVMModel___GetTransform_CachedIndex) == 0x000450, "Member 'FPropertyBag_1960383695e3676a::RigVMModel___GetTransform_CachedIndex' has a wrong offset!");
static_assert(offsetof(FPropertyBag_1960383695e3676a, RigVMModel___GetTransform_1_Transform) == 0x000460, "Member 'FPropertyBag_1960383695e3676a::RigVMModel___GetTransform_1_Transform' has a wrong offset!");
static_assert(offsetof(FPropertyBag_1960383695e3676a, RigVMModel___GetTransform_1_CachedIndex) == 0x0004C0, "Member 'FPropertyBag_1960383695e3676a::RigVMModel___GetTransform_1_CachedIndex' has a wrong offset!");
static_assert(offsetof(FPropertyBag_1960383695e3676a, RigVMModel___PBIK_Effectors__IO) == 0x0004D0, "Member 'FPropertyBag_1960383695e3676a::RigVMModel___PBIK_Effectors__IO' has a wrong offset!");
static_assert(offsetof(FPropertyBag_1960383695e3676a, RigVMModel___PBIK_EffectorSolverIndices) == 0x0004E0, "Member 'FPropertyBag_1960383695e3676a::RigVMModel___PBIK_EffectorSolverIndices' has a wrong offset!");
static_assert(offsetof(FPropertyBag_1960383695e3676a, RigVMModel___PBIK_WorkData) == 0x0004F0, "Member 'FPropertyBag_1960383695e3676a::RigVMModel___PBIK_WorkData' has a wrong offset!");

// PropertyBag Transient.PropertyBag_a49ae7717404b877
// 0x0230 (0x0230 - 0x0000)
struct FPropertyBag_a49ae7717404b877 final
{
public:
	struct FRigElementKey                         RigVMModel___SetRotation_2_Item__Const;            // 0x0000(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	ERigVMTransformSpace                          RigVMModel___SetRotation_2_Space__Const;           // 0x000C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RigVMModel___SetRotation_2_bInitial__Const;        // 0x000D(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigElementKey                         RigVMModel___GetTransform_6_Item__Const;           // 0x0010(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	bool                                          RigVMModel___GetTransform_6_1_bInitial__Const;     // 0x001C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                RigVMModel___MathQuaternionSwingTwist_TwistAxis__Const; // 0x0020(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuat                                  RigVMModel___MathQuaternionSlerp_2_B__Const;       // 0x0040(0x0020)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___MathQuaternionSlerp_2_T__Const;       // 0x0060(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___SetRotation_2_Weight__Const;          // 0x0064(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetRotation_2_1_Item__Const;          // 0x0068(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___MathQuaternionSlerp_T__Const;         // 0x0074(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERigVMTransformSpace                          RigVMModel___SetTranslation_Space__Const;          // 0x0078(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigElementKey                         RigVMModel___GetTransform_1_Item__Const;           // 0x007C(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___MathTransformLerp_T__Const;           // 0x0088(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetRotation_2_1_1_Item__Const;        // 0x008C(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___MathQuaternionSlerp_1_T__Const;       // 0x0098(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___MathTransformLerp_1_T__Const;         // 0x009C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetRotation_2_1_2_Item__Const;        // 0x00A0(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___MathQuaternionSlerp_2_3_T__Const;     // 0x00AC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetRotation_1_Item__Const;            // 0x00B0(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___GetTransform_5_1_Item__Const;         // 0x00BC(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___MathQuaternionSlerp_4_T__Const;       // 0x00C8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetRotation_Item__Const;              // 0x00CC(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetRotation_2_2_Item__Const;          // 0x00D8(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___GetTransform_6_3_Item__Const;         // 0x00E4(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetRotation_2_1_3_Item__Const;        // 0x00F0(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___GetTransform_1_1_Item__Const;         // 0x00FC(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetRotation_2_1_3_1_Item__Const;      // 0x0108(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetRotation_2_1_3_1_1_Item__Const;    // 0x0114(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetRotation_2_1_3_1_1_1_Item__Const;  // 0x0120(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___GetTransform_6_5_Item__Const;         // 0x012C(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetRotation_2_1_3_1_1_1_1_Item__Const; // 0x0138(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetRotation_2_2_1_Item__Const;        // 0x0144(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___GetTransform_6_3_1_Item__Const;       // 0x0150(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___MathQuaternionSlerp_2_2_T__Const;     // 0x015C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetRotation_2_1_3_2_Item__Const;      // 0x0160(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___GetTransform_1_2_Item__Const;         // 0x016C(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetRotation_3_Item__Const;            // 0x0178(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetRotation_2_1_3_2_1_Item__Const;    // 0x0184(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetRotation_2_1_3_2_1_1_Item__Const;  // 0x0190(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___GetTransform_6_3_1_2_Item__Const;     // 0x019C(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetRotation_2_1_3_2_1_1_1_Item__Const; // 0x01A8(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetRotation_2_2_1_1_Item__Const;      // 0x01B4(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___GetTransform_6_3_1_3_Item__Const;     // 0x01C0(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetRotation_2_1_3_2_2_Item__Const;    // 0x01CC(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
