#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_UseWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_UseWidget.W_UseWidget_C
// 0x0020 (0x0300 - 0x02E0)
class UW_UseWidget_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             UseText;                                           // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FString                                 UseTextLabel;                                      // 0x02F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_W_UseWidget(int32 EntryPoint);
	class FText Get_UseText_Text_0();
	void Remove();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_UseWidget_C">();
	}
	static class UW_UseWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_UseWidget_C>();
	}
};
static_assert(alignof(UW_UseWidget_C) == 0x000008, "Wrong alignment on UW_UseWidget_C");
static_assert(sizeof(UW_UseWidget_C) == 0x000300, "Wrong size on UW_UseWidget_C");
static_assert(offsetof(UW_UseWidget_C, UberGraphFrame) == 0x0002E0, "Member 'UW_UseWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_UseWidget_C, UseText) == 0x0002E8, "Member 'UW_UseWidget_C::UseText' has a wrong offset!");
static_assert(offsetof(UW_UseWidget_C, UseTextLabel) == 0x0002F0, "Member 'UW_UseWidget_C::UseTextLabel' has a wrong offset!");

}

