#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_HUD_QTE

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "EButton_Control_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FSoundEvent_structs.hpp"


namespace SDK::Params
{

// Function WBP_HUD_QTE.WBP_HUD_QTE_C.GetProgressAnimPlaybackSpeed
// 0x0010 (0x0010 - 0x0000)
struct WBP_HUD_QTE_C_GetProgressAnimPlaybackSpeed final
{
public:
	double                                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_QTE_C_GetProgressAnimPlaybackSpeed) == 0x000008, "Wrong alignment on WBP_HUD_QTE_C_GetProgressAnimPlaybackSpeed");
static_assert(sizeof(WBP_HUD_QTE_C_GetProgressAnimPlaybackSpeed) == 0x000010, "Wrong size on WBP_HUD_QTE_C_GetProgressAnimPlaybackSpeed");
static_assert(offsetof(WBP_HUD_QTE_C_GetProgressAnimPlaybackSpeed, ReturnValue) == 0x000000, "Member 'WBP_HUD_QTE_C_GetProgressAnimPlaybackSpeed::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_QTE_C_GetProgressAnimPlaybackSpeed, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000008, "Member 'WBP_HUD_QTE_C_GetProgressAnimPlaybackSpeed::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");

// Function WBP_HUD_QTE.WBP_HUD_QTE_C.GetDebugString
// 0x0248 (0x0248 - 0x0000)
struct WBP_HUD_QTE_C_GetDebugString final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable;                              // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         Temp_wildcard_Temp_buffer_array_Variable;          // 0x0028(0x0010)(ConstParm, ReferenceParm)
	TArray<class FString>                         Temp_wildcard_We_need_a_second_array_to_store_the_result_and_be_able_to_wipe_the_first__buffer__array_Variable; // 0x0038(0x0010)(ConstParm, ReferenceParm)
	class FString                                 Temp_string_Variable_1;                            // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_JoinStringArray_ReturnValue;              // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidgetAnimation*>               K2Node_MakeArray_Array;                            // 0x0070(0x0010)(ReferenceParm)
	class UWidgetAnimation*                       CallFunc_Array_Get_Item;                           // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetStartTime_ReturnValue;                 // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetAnimationCurrentTime_ReturnValue;      // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0098(0x0048)(HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetObjectName_ReturnValue;                // 0x00E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0100(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0110(0x0048)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0158(0x0048)(HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A1[0x3];                                      // 0x01A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_Select_Default;                             // 0x01A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x01B8(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x01C8(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0210(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Format_ReturnValue;                       // 0x0220(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_234[0x4];                                      // 0x0234(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_B_ImplicitCast;     // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_A_ImplicitCast;     // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_QTE_C_GetDebugString) == 0x000008, "Wrong alignment on WBP_HUD_QTE_C_GetDebugString");
static_assert(sizeof(WBP_HUD_QTE_C_GetDebugString) == 0x000248, "Wrong size on WBP_HUD_QTE_C_GetDebugString");
static_assert(offsetof(WBP_HUD_QTE_C_GetDebugString, ReturnValue) == 0x000000, "Member 'WBP_HUD_QTE_C_GetDebugString::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_QTE_C_GetDebugString, Temp_string_Variable) == 0x000010, "Member 'WBP_HUD_QTE_C_GetDebugString::Temp_string_Variable' has a wrong offset!");
static_assert(offsetof(WBP_HUD_QTE_C_GetDebugString, Temp_int_Array_Index_Variable) == 0x000020, "Member 'WBP_HUD_QTE_C_GetDebugString::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_HUD_QTE_C_GetDebugString, Temp_wildcard_Temp_buffer_array_Variable) == 0x000028, "Member 'WBP_HUD_QTE_C_GetDebugString::Temp_wildcard_Temp_buffer_array_Variable' has a wrong offset!");
static_assert(offsetof(WBP_HUD_QTE_C_GetDebugString, Temp_wildcard_We_need_a_second_array_to_store_the_result_and_be_able_to_wipe_the_first__buffer__array_Variable) == 0x000038, "Member 'WBP_HUD_QTE_C_GetDebugString::Temp_wildcard_We_need_a_second_array_to_store_the_result_and_be_able_to_wipe_the_first__buffer__array_Variable' has a wrong offset!");
static_assert(offsetof(WBP_HUD_QTE_C_GetDebugString, Temp_string_Variable_1) == 0x000048, "Member 'WBP_HUD_QTE_C_GetDebugString::Temp_string_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_HUD_QTE_C_GetDebugString, CallFunc_JoinStringArray_ReturnValue) == 0x000058, "Member 'WBP_HUD_QTE_C_GetDebugString::CallFunc_JoinStringArray_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_QTE_C_GetDebugString, Temp_bool_Variable) == 0x000068, "Member 'WBP_HUD_QTE_C_GetDebugString::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_HUD_QTE_C_GetDebugString, Temp_int_Loop_Counter_Variable) == 0x00006C, "Member 'WBP_HUD_QTE_C_GetDebugString::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_HUD_QTE_C_GetDebugString, K2Node_MakeArray_Array) == 0x000070, "Member 'WBP_HUD_QTE_C_GetDebugString::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_HUD_QTE_C_GetDebugString, CallFunc_Array_Get_Item) == 0x000080, "Member 'WBP_HUD_QTE_C_GetDebugString::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_HUD_QTE_C_GetDebugString, CallFunc_Array_Length_ReturnValue) == 0x000088, "Member 'WBP_HUD_QTE_C_GetDebugString::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_QTE_C_GetDebugString, CallFunc_GetStartTime_ReturnValue) == 0x00008C, "Member 'WBP_HUD_QTE_C_GetDebugString::CallFunc_GetStartTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_QTE_C_GetDebugString, CallFunc_Less_IntInt_ReturnValue) == 0x000090, "Member 'WBP_HUD_QTE_C_GetDebugString::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_QTE_C_GetDebugString, CallFunc_GetAnimationCurrentTime_ReturnValue) == 0x000094, "Member 'WBP_HUD_QTE_C_GetDebugString::CallFunc_GetAnimationCurrentTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_QTE_C_GetDebugString, K2Node_MakeStruct_FormatArgumentData) == 0x000098, "Member 'WBP_HUD_QTE_C_GetDebugString::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_HUD_QTE_C_GetDebugString, CallFunc_GetEndTime_ReturnValue) == 0x0000E0, "Member 'WBP_HUD_QTE_C_GetDebugString::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_QTE_C_GetDebugString, CallFunc_GetObjectName_ReturnValue) == 0x0000E8, "Member 'WBP_HUD_QTE_C_GetDebugString::CallFunc_GetObjectName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_QTE_C_GetDebugString, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x0000F8, "Member 'WBP_HUD_QTE_C_GetDebugString::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_QTE_C_GetDebugString, CallFunc_Conv_StringToText_ReturnValue) == 0x000100, "Member 'WBP_HUD_QTE_C_GetDebugString::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_QTE_C_GetDebugString, K2Node_MakeStruct_FormatArgumentData_1) == 0x000110, "Member 'WBP_HUD_QTE_C_GetDebugString::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WBP_HUD_QTE_C_GetDebugString, K2Node_MakeStruct_FormatArgumentData_2) == 0x000158, "Member 'WBP_HUD_QTE_C_GetDebugString::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(WBP_HUD_QTE_C_GetDebugString, CallFunc_IsAnimationPlaying_ReturnValue) == 0x0001A0, "Member 'WBP_HUD_QTE_C_GetDebugString::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_QTE_C_GetDebugString, CallFunc_Add_IntInt_ReturnValue) == 0x0001A4, "Member 'WBP_HUD_QTE_C_GetDebugString::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_QTE_C_GetDebugString, K2Node_Select_Default) == 0x0001A8, "Member 'WBP_HUD_QTE_C_GetDebugString::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_HUD_QTE_C_GetDebugString, CallFunc_Conv_StringToText_ReturnValue_1) == 0x0001B8, "Member 'WBP_HUD_QTE_C_GetDebugString::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_HUD_QTE_C_GetDebugString, K2Node_MakeStruct_FormatArgumentData_3) == 0x0001C8, "Member 'WBP_HUD_QTE_C_GetDebugString::K2Node_MakeStruct_FormatArgumentData_3' has a wrong offset!");
static_assert(offsetof(WBP_HUD_QTE_C_GetDebugString, K2Node_MakeArray_Array_1) == 0x000210, "Member 'WBP_HUD_QTE_C_GetDebugString::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(WBP_HUD_QTE_C_GetDebugString, CallFunc_Format_ReturnValue) == 0x000220, "Member 'WBP_HUD_QTE_C_GetDebugString::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_QTE_C_GetDebugString, CallFunc_Array_Add_ReturnValue) == 0x000230, "Member 'WBP_HUD_QTE_C_GetDebugString::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_QTE_C_GetDebugString, CallFunc_Subtract_DoubleDouble_B_ImplicitCast) == 0x000238, "Member 'WBP_HUD_QTE_C_GetDebugString::CallFunc_Subtract_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_HUD_QTE_C_GetDebugString, CallFunc_Subtract_DoubleDouble_A_ImplicitCast) == 0x000240, "Member 'WBP_HUD_QTE_C_GetDebugString::CallFunc_Subtract_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function WBP_HUD_QTE.WBP_HUD_QTE_C.GetProgressAnimPlaybackSpeedOld
// 0x0030 (0x0030 - 0x0000)
struct WBP_HUD_QTE_C_GetProgressAnimPlaybackSpeedOld final
{
public:
	double                                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRealTimeDilation_ReturnValue;          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_B_ImplicitCast;     // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_QTE_C_GetProgressAnimPlaybackSpeedOld) == 0x000008, "Wrong alignment on WBP_HUD_QTE_C_GetProgressAnimPlaybackSpeedOld");
static_assert(sizeof(WBP_HUD_QTE_C_GetProgressAnimPlaybackSpeedOld) == 0x000030, "Wrong size on WBP_HUD_QTE_C_GetProgressAnimPlaybackSpeedOld");
static_assert(offsetof(WBP_HUD_QTE_C_GetProgressAnimPlaybackSpeedOld, ReturnValue) == 0x000000, "Member 'WBP_HUD_QTE_C_GetProgressAnimPlaybackSpeedOld::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_QTE_C_GetProgressAnimPlaybackSpeedOld, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000008, "Member 'WBP_HUD_QTE_C_GetProgressAnimPlaybackSpeedOld::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_QTE_C_GetProgressAnimPlaybackSpeedOld, CallFunc_GetRealTimeDilation_ReturnValue) == 0x000010, "Member 'WBP_HUD_QTE_C_GetProgressAnimPlaybackSpeedOld::CallFunc_GetRealTimeDilation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_QTE_C_GetProgressAnimPlaybackSpeedOld, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000018, "Member 'WBP_HUD_QTE_C_GetProgressAnimPlaybackSpeedOld::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_QTE_C_GetProgressAnimPlaybackSpeedOld, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000020, "Member 'WBP_HUD_QTE_C_GetProgressAnimPlaybackSpeedOld::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_QTE_C_GetProgressAnimPlaybackSpeedOld, CallFunc_Multiply_DoubleDouble_B_ImplicitCast) == 0x000028, "Member 'WBP_HUD_QTE_C_GetProgressAnimPlaybackSpeedOld::CallFunc_Multiply_DoubleDouble_B_ImplicitCast' has a wrong offset!");

// Function WBP_HUD_QTE.WBP_HUD_QTE_C.GetAppearAnimPlaybackSpeed
// 0x0058 (0x0058 - 0x0000)
struct WBP_HUD_QTE_C_GetAppearAnimPlaybackSpeed final
{
public:
	double                                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetStartTime_ReturnValue;                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_1;      // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRealTimeDilation_ReturnValue;          // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_A_ImplicitCast;     // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_B_ImplicitCast;     // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_B_ImplicitCast;     // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_QTE_C_GetAppearAnimPlaybackSpeed) == 0x000008, "Wrong alignment on WBP_HUD_QTE_C_GetAppearAnimPlaybackSpeed");
static_assert(sizeof(WBP_HUD_QTE_C_GetAppearAnimPlaybackSpeed) == 0x000058, "Wrong size on WBP_HUD_QTE_C_GetAppearAnimPlaybackSpeed");
static_assert(offsetof(WBP_HUD_QTE_C_GetAppearAnimPlaybackSpeed, ReturnValue) == 0x000000, "Member 'WBP_HUD_QTE_C_GetAppearAnimPlaybackSpeed::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_QTE_C_GetAppearAnimPlaybackSpeed, CallFunc_GetEndTime_ReturnValue) == 0x000008, "Member 'WBP_HUD_QTE_C_GetAppearAnimPlaybackSpeed::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_QTE_C_GetAppearAnimPlaybackSpeed, CallFunc_GetStartTime_ReturnValue) == 0x00000C, "Member 'WBP_HUD_QTE_C_GetAppearAnimPlaybackSpeed::CallFunc_GetStartTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_QTE_C_GetAppearAnimPlaybackSpeed, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000010, "Member 'WBP_HUD_QTE_C_GetAppearAnimPlaybackSpeed::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_QTE_C_GetAppearAnimPlaybackSpeed, CallFunc_Subtract_DoubleDouble_ReturnValue_1) == 0x000018, "Member 'WBP_HUD_QTE_C_GetAppearAnimPlaybackSpeed::CallFunc_Subtract_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_HUD_QTE_C_GetAppearAnimPlaybackSpeed, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000020, "Member 'WBP_HUD_QTE_C_GetAppearAnimPlaybackSpeed::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_QTE_C_GetAppearAnimPlaybackSpeed, CallFunc_GetRealTimeDilation_ReturnValue) == 0x000028, "Member 'WBP_HUD_QTE_C_GetAppearAnimPlaybackSpeed::CallFunc_GetRealTimeDilation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_QTE_C_GetAppearAnimPlaybackSpeed, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000030, "Member 'WBP_HUD_QTE_C_GetAppearAnimPlaybackSpeed::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_QTE_C_GetAppearAnimPlaybackSpeed, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000038, "Member 'WBP_HUD_QTE_C_GetAppearAnimPlaybackSpeed::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_HUD_QTE_C_GetAppearAnimPlaybackSpeed, CallFunc_Subtract_DoubleDouble_A_ImplicitCast) == 0x000040, "Member 'WBP_HUD_QTE_C_GetAppearAnimPlaybackSpeed::CallFunc_Subtract_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_HUD_QTE_C_GetAppearAnimPlaybackSpeed, CallFunc_Subtract_DoubleDouble_B_ImplicitCast) == 0x000048, "Member 'WBP_HUD_QTE_C_GetAppearAnimPlaybackSpeed::CallFunc_Subtract_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_HUD_QTE_C_GetAppearAnimPlaybackSpeed, CallFunc_Multiply_DoubleDouble_B_ImplicitCast) == 0x000050, "Member 'WBP_HUD_QTE_C_GetAppearAnimPlaybackSpeed::CallFunc_Multiply_DoubleDouble_B_ImplicitCast' has a wrong offset!");

// Function WBP_HUD_QTE.WBP_HUD_QTE_C.PlayFinalAnimation
// 0x0010 (0x0010 - 0x0000)
struct WBP_HUD_QTE_C_PlayFinalAnimation final
{
public:
	bool                                          IsSuccess;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          isPerfect_0;                                       // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldDoAutoQTE_ReturnValue;              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_QTE_C_PlayFinalAnimation) == 0x000008, "Wrong alignment on WBP_HUD_QTE_C_PlayFinalAnimation");
static_assert(sizeof(WBP_HUD_QTE_C_PlayFinalAnimation) == 0x000010, "Wrong size on WBP_HUD_QTE_C_PlayFinalAnimation");
static_assert(offsetof(WBP_HUD_QTE_C_PlayFinalAnimation, IsSuccess) == 0x000000, "Member 'WBP_HUD_QTE_C_PlayFinalAnimation::IsSuccess' has a wrong offset!");
static_assert(offsetof(WBP_HUD_QTE_C_PlayFinalAnimation, isPerfect_0) == 0x000001, "Member 'WBP_HUD_QTE_C_PlayFinalAnimation::isPerfect_0' has a wrong offset!");
static_assert(offsetof(WBP_HUD_QTE_C_PlayFinalAnimation, CallFunc_Not_PreBool_ReturnValue) == 0x000002, "Member 'WBP_HUD_QTE_C_PlayFinalAnimation::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_QTE_C_PlayFinalAnimation, CallFunc_ShouldDoAutoQTE_ReturnValue) == 0x000003, "Member 'WBP_HUD_QTE_C_PlayFinalAnimation::CallFunc_ShouldDoAutoQTE_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_QTE_C_PlayFinalAnimation, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'WBP_HUD_QTE_C_PlayFinalAnimation::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function WBP_HUD_QTE.WBP_HUD_QTE_C.GetBasePlaybackSpeed
// 0x0018 (0x0018 - 0x0000)
struct WBP_HUD_QTE_C_GetBasePlaybackSpeed final
{
public:
	double                                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_QTE_C_GetBasePlaybackSpeed) == 0x000008, "Wrong alignment on WBP_HUD_QTE_C_GetBasePlaybackSpeed");
static_assert(sizeof(WBP_HUD_QTE_C_GetBasePlaybackSpeed) == 0x000018, "Wrong size on WBP_HUD_QTE_C_GetBasePlaybackSpeed");
static_assert(offsetof(WBP_HUD_QTE_C_GetBasePlaybackSpeed, ReturnValue) == 0x000000, "Member 'WBP_HUD_QTE_C_GetBasePlaybackSpeed::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_QTE_C_GetBasePlaybackSpeed, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000008, "Member 'WBP_HUD_QTE_C_GetBasePlaybackSpeed::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_QTE_C_GetBasePlaybackSpeed, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000010, "Member 'WBP_HUD_QTE_C_GetBasePlaybackSpeed::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");

// Function WBP_HUD_QTE.WBP_HUD_QTE_C.GetAnim_PerfectNotification
// 0x0008 (0x0008 - 0x0000)
struct WBP_HUD_QTE_C_GetAnim_PerfectNotification final
{
public:
	class UWidgetAnimation*                       Animation;                                         // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_QTE_C_GetAnim_PerfectNotification) == 0x000008, "Wrong alignment on WBP_HUD_QTE_C_GetAnim_PerfectNotification");
static_assert(sizeof(WBP_HUD_QTE_C_GetAnim_PerfectNotification) == 0x000008, "Wrong size on WBP_HUD_QTE_C_GetAnim_PerfectNotification");
static_assert(offsetof(WBP_HUD_QTE_C_GetAnim_PerfectNotification, Animation) == 0x000000, "Member 'WBP_HUD_QTE_C_GetAnim_PerfectNotification::Animation' has a wrong offset!");

// Function WBP_HUD_QTE.WBP_HUD_QTE_C.GetAnim_AnticipationFlash
// 0x0008 (0x0008 - 0x0000)
struct WBP_HUD_QTE_C_GetAnim_AnticipationFlash final
{
public:
	class UWidgetAnimation*                       Animation;                                         // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_QTE_C_GetAnim_AnticipationFlash) == 0x000008, "Wrong alignment on WBP_HUD_QTE_C_GetAnim_AnticipationFlash");
static_assert(sizeof(WBP_HUD_QTE_C_GetAnim_AnticipationFlash) == 0x000008, "Wrong size on WBP_HUD_QTE_C_GetAnim_AnticipationFlash");
static_assert(offsetof(WBP_HUD_QTE_C_GetAnim_AnticipationFlash, Animation) == 0x000000, "Member 'WBP_HUD_QTE_C_GetAnim_AnticipationFlash::Animation' has a wrong offset!");

// Function WBP_HUD_QTE.WBP_HUD_QTE_C.GetAnim_Success
// 0x0008 (0x0008 - 0x0000)
struct WBP_HUD_QTE_C_GetAnim_Success final
{
public:
	class UWidgetAnimation*                       Anim_Success_0;                                    // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_QTE_C_GetAnim_Success) == 0x000008, "Wrong alignment on WBP_HUD_QTE_C_GetAnim_Success");
static_assert(sizeof(WBP_HUD_QTE_C_GetAnim_Success) == 0x000008, "Wrong size on WBP_HUD_QTE_C_GetAnim_Success");
static_assert(offsetof(WBP_HUD_QTE_C_GetAnim_Success, Anim_Success_0) == 0x000000, "Member 'WBP_HUD_QTE_C_GetAnim_Success::Anim_Success_0' has a wrong offset!");

// Function WBP_HUD_QTE.WBP_HUD_QTE_C.GetAnim_Success_Perfect
// 0x0008 (0x0008 - 0x0000)
struct WBP_HUD_QTE_C_GetAnim_Success_Perfect final
{
public:
	class UWidgetAnimation*                       Anim_Success_Perfect_0;                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_QTE_C_GetAnim_Success_Perfect) == 0x000008, "Wrong alignment on WBP_HUD_QTE_C_GetAnim_Success_Perfect");
static_assert(sizeof(WBP_HUD_QTE_C_GetAnim_Success_Perfect) == 0x000008, "Wrong size on WBP_HUD_QTE_C_GetAnim_Success_Perfect");
static_assert(offsetof(WBP_HUD_QTE_C_GetAnim_Success_Perfect, Anim_Success_Perfect_0) == 0x000000, "Member 'WBP_HUD_QTE_C_GetAnim_Success_Perfect::Anim_Success_Perfect_0' has a wrong offset!");

// Function WBP_HUD_QTE.WBP_HUD_QTE_C.GetAnim_Fail
// 0x0008 (0x0008 - 0x0000)
struct WBP_HUD_QTE_C_GetAnim_Fail final
{
public:
	class UWidgetAnimation*                       Anim_Fail_0;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_QTE_C_GetAnim_Fail) == 0x000008, "Wrong alignment on WBP_HUD_QTE_C_GetAnim_Fail");
static_assert(sizeof(WBP_HUD_QTE_C_GetAnim_Fail) == 0x000008, "Wrong size on WBP_HUD_QTE_C_GetAnim_Fail");
static_assert(offsetof(WBP_HUD_QTE_C_GetAnim_Fail, Anim_Fail_0) == 0x000000, "Member 'WBP_HUD_QTE_C_GetAnim_Fail::Anim_Fail_0' has a wrong offset!");

// Function WBP_HUD_QTE.WBP_HUD_QTE_C.GetAnim_Progress
// 0x0008 (0x0008 - 0x0000)
struct WBP_HUD_QTE_C_GetAnim_Progress final
{
public:
	class UWidgetAnimation*                       Animation;                                         // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_QTE_C_GetAnim_Progress) == 0x000008, "Wrong alignment on WBP_HUD_QTE_C_GetAnim_Progress");
static_assert(sizeof(WBP_HUD_QTE_C_GetAnim_Progress) == 0x000008, "Wrong size on WBP_HUD_QTE_C_GetAnim_Progress");
static_assert(offsetof(WBP_HUD_QTE_C_GetAnim_Progress, Animation) == 0x000000, "Member 'WBP_HUD_QTE_C_GetAnim_Progress::Animation' has a wrong offset!");

// Function WBP_HUD_QTE.WBP_HUD_QTE_C.Tick
// 0x003C (0x003C - 0x0000)
struct WBP_HUD_QTE_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_QTE_C_Tick) == 0x000004, "Wrong alignment on WBP_HUD_QTE_C_Tick");
static_assert(sizeof(WBP_HUD_QTE_C_Tick) == 0x00003C, "Wrong size on WBP_HUD_QTE_C_Tick");
static_assert(offsetof(WBP_HUD_QTE_C_Tick, MyGeometry) == 0x000000, "Member 'WBP_HUD_QTE_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_HUD_QTE_C_Tick, InDeltaTime) == 0x000038, "Member 'WBP_HUD_QTE_C_Tick::InDeltaTime' has a wrong offset!");

// Function WBP_HUD_QTE.WBP_HUD_QTE_C.StartQTE
// 0x0020 (0x0020 - 0x0000)
struct WBP_HUD_QTE_C_StartQTE final
{
public:
	double                                        NowTime;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        PreDuration;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ValidityDuration;                                  // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULevelSequencePlayer*                   TimeSource;                                        // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_QTE_C_StartQTE) == 0x000008, "Wrong alignment on WBP_HUD_QTE_C_StartQTE");
static_assert(sizeof(WBP_HUD_QTE_C_StartQTE) == 0x000020, "Wrong size on WBP_HUD_QTE_C_StartQTE");
static_assert(offsetof(WBP_HUD_QTE_C_StartQTE, NowTime) == 0x000000, "Member 'WBP_HUD_QTE_C_StartQTE::NowTime' has a wrong offset!");
static_assert(offsetof(WBP_HUD_QTE_C_StartQTE, PreDuration) == 0x000008, "Member 'WBP_HUD_QTE_C_StartQTE::PreDuration' has a wrong offset!");
static_assert(offsetof(WBP_HUD_QTE_C_StartQTE, ValidityDuration) == 0x000010, "Member 'WBP_HUD_QTE_C_StartQTE::ValidityDuration' has a wrong offset!");
static_assert(offsetof(WBP_HUD_QTE_C_StartQTE, TimeSource) == 0x000018, "Member 'WBP_HUD_QTE_C_StartQTE::TimeSource' has a wrong offset!");

// Function WBP_HUD_QTE.WBP_HUD_QTE_C.ExecuteUbergraph_WBP_HUD_QTE
// 0x03D0 (0x03D0 - 0x0000)
struct WBP_HUD_QTE_C_ExecuteUbergraph_WBP_HUD_QTE final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EButton_Control                               Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_2;                            // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_3;                            // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_4;                            // 0x0048(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_5;                            // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_6;                            // 0x0068(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_7;                            // 0x0078(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_8;                            // 0x0088(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFSoundEvent                           CallFunc_GetDataTableRowFromName_OutRow;           // 0x0098(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x00A4(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFSoundEvent                           CallFunc_GetDataTableRowFromName_OutRow_1;         // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_1;    // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       CallFunc_GetAnim_Progress_Animation;               // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFSoundEvent                           CallFunc_GetDataTableRowFromName_OutRow_2;         // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_2;    // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x3];                                      // 0x0101(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Select_Default;                             // 0x0104(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetUndilatedTimeSeconds_UndilatedTime;    // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0128(0x0048)(HasGetValueTypeHash)
	double                                        CallFunc_GetUndilatedTimeSeconds_UndilatedTime_1;  // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0178(0x0010)(ReferenceParm)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0188(0x0048)(HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x01D0(0x0010)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x01E0(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Format_ReturnValue_1;                     // 0x01F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0200(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_211[0x7];                                      // 0x0211(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_CreateSound2D_ReturnValue;                // 0x0218(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetProgressAnimPlaybackSpeed_ReturnValue; // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0228(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetStartTime_ReturnValue;                 // 0x0234(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Event_NowTime;                              // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Event_PreDuration;                          // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Event_ValidityDuration;                     // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULevelSequencePlayer*                   K2Node_Event_TimeSource;                           // 0x0260(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0268(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0280(0x0048)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x02C8(0x0048)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_4;            // 0x0310(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_2;                          // 0x0358(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_2;                     // 0x0368(0x0010)()
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0378(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_3;              // 0x0380(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_4;              // 0x0388(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_5;              // 0x0390(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0398(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_6;              // 0x03A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PlayAnimation_PlaybackSpeed_ImplicitCast; // 0x03B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B4[0x4];                                      // 0x03B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_A_ImplicitCast;     // 0x03B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_B_ImplicitCast;     // 0x03C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PlayAnimation_PlaybackSpeed_ImplicitCast_1; // 0x03C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_QTE_C_ExecuteUbergraph_WBP_HUD_QTE) == 0x000008, "Wrong alignment on WBP_HUD_QTE_C_ExecuteUbergraph_WBP_HUD_QTE");
static_assert(sizeof(WBP_HUD_QTE_C_ExecuteUbergraph_WBP_HUD_QTE) == 0x0003D0, "Wrong size on WBP_HUD_QTE_C_ExecuteUbergraph_WBP_HUD_QTE");
static_assert(offsetof(WBP_HUD_QTE_C_ExecuteUbergraph_WBP_HUD_QTE, EntryPoint) == 0x000000, "Member 'WBP_HUD_QTE_C_ExecuteUbergraph_WBP_HUD_QTE::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_HUD_QTE_C_ExecuteUbergraph_WBP_HUD_QTE, Temp_byte_Variable) == 0x000004, "Member 'WBP_HUD_QTE_C_ExecuteUbergraph_WBP_HUD_QTE::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_HUD_QTE_C_ExecuteUbergraph_WBP_HUD_QTE, Temp_struct_Variable) == 0x000008, "Member 'WBP_HUD_QTE_C_ExecuteUbergraph_WBP_HUD_QTE::Temp_struct_Variable' has a wrong offset!");
