#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GM_ConsumablesOverview

#include "Basic.hpp"

#include "S_jRPG_Item_DynamicData_structs.hpp"
#include "S_jRPG_Item_StaticData_structs.hpp"


namespace SDK::Params
{

// Function WBP_GM_ConsumablesOverview.WBP_GM_ConsumablesOverview_C.LoadState
// 0x0430 (0x0430 - 0x0000)
struct WBP_GM_ConsumablesOverview_C_LoadState final
{
public:
	bool                                          HasContent;                                        // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FS_jRPG_Item_DynamicData>       Temp_wildcard_Variable;                            // 0x0008(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsNotEmpty_ReturnValue;             // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26[0x2];                                       // 0x0026(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_jRPG_Item_DynamicData               CallFunc_Array_Get_Item;                           // 0x0030(0x0138)(ContainsInstancedReference, HasGetValueTypeHash)
	class FName                                   CallFunc_GetConsumableItemFromShard_ItemID;        // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAC_jRPG_InventoryManager_C*            CallFunc_GetInventoryManager_ReturnValue;          // 0x0170(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetItemStaticDefinitionFromID_Found;      // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_179[0x7];                                      // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_jRPG_Item_StaticData                CallFunc_GetItemStaticDefinitionFromID_ReturnValue; // 0x0180(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         CallFunc_FindItemCountFromInventory_Quantity;      // 0x02B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x02B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_ConsumableItem_C*                  CallFunc_BP_CreateEntryOfClass_ReturnValue;        // 0x02B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x02C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C4[0x4];                                      // 0x02C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAC_jRPG_InventoryManager_C*            CallFunc_GetInventoryManager_ReturnValue_1;        // 0x02C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<struct FS_jRPG_Item_DynamicData>       CallFunc_GetConsumablesShards_FilteredArray;       // 0x02D0(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x02E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E4[0x4];                                      // 0x02E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_jRPG_Item_DynamicData               CallFunc_Array_Get_Item_1;                         // 0x02E8(0x0138)(ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         CallFunc_Min_ReturnValue;                          // 0x0420(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0424(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0428(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0429(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GM_ConsumablesOverview_C_LoadState) == 0x000008, "Wrong alignment on WBP_GM_ConsumablesOverview_C_LoadState");
static_assert(sizeof(WBP_GM_ConsumablesOverview_C_LoadState) == 0x000430, "Wrong size on WBP_GM_ConsumablesOverview_C_LoadState");
static_assert(offsetof(WBP_GM_ConsumablesOverview_C_LoadState, HasContent) == 0x000000, "Member 'WBP_GM_ConsumablesOverview_C_LoadState::HasContent' has a wrong offset!");
static_assert(offsetof(WBP_GM_ConsumablesOverview_C_LoadState, Temp_wildcard_Variable) == 0x000008, "Member 'WBP_GM_ConsumablesOverview_C_LoadState::Temp_wildcard_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GM_ConsumablesOverview_C_LoadState, Temp_int_Loop_Counter_Variable) == 0x000018, "Member 'WBP_GM_ConsumablesOverview_C_LoadState::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GM_ConsumablesOverview_C_LoadState, CallFunc_Array_Length_ReturnValue) == 0x00001C, "Member 'WBP_GM_ConsumablesOverview_C_LoadState::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GM_ConsumablesOverview_C_LoadState, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'WBP_GM_ConsumablesOverview_C_LoadState::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GM_ConsumablesOverview_C_LoadState, CallFunc_Less_IntInt_ReturnValue) == 0x000024, "Member 'WBP_GM_ConsumablesOverview_C_LoadState::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GM_ConsumablesOverview_C_LoadState, CallFunc_Array_IsNotEmpty_ReturnValue) == 0x000025, "Member 'WBP_GM_ConsumablesOverview_C_LoadState::CallFunc_Array_IsNotEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GM_ConsumablesOverview_C_LoadState, Temp_int_Array_Index_Variable) == 0x000028, "Member 'WBP_GM_ConsumablesOverview_C_LoadState::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GM_ConsumablesOverview_C_LoadState, CallFunc_Array_Get_Item) == 0x000030, "Member 'WBP_GM_ConsumablesOverview_C_LoadState::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_GM_ConsumablesOverview_C_LoadState, CallFunc_GetConsumableItemFromShard_ItemID) == 0x000168, "Member 'WBP_GM_ConsumablesOverview_C_LoadState::CallFunc_GetConsumableItemFromShard_ItemID' has a wrong offset!");
static_assert(offsetof(WBP_GM_ConsumablesOverview_C_LoadState, CallFunc_GetInventoryManager_ReturnValue) == 0x000170, "Member 'WBP_GM_ConsumablesOverview_C_LoadState::CallFunc_GetInventoryManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GM_ConsumablesOverview_C_LoadState, CallFunc_GetItemStaticDefinitionFromID_Found) == 0x000178, "Member 'WBP_GM_ConsumablesOverview_C_LoadState::CallFunc_GetItemStaticDefinitionFromID_Found' has a wrong offset!");
static_assert(offsetof(WBP_GM_ConsumablesOverview_C_LoadState, CallFunc_GetItemStaticDefinitionFromID_ReturnValue) == 0x000180, "Member 'WBP_GM_ConsumablesOverview_C_LoadState::CallFunc_GetItemStaticDefinitionFromID_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GM_ConsumablesOverview_C_LoadState, CallFunc_FindItemCountFromInventory_Quantity) == 0x0002B0, "Member 'WBP_GM_ConsumablesOverview_C_LoadState::CallFunc_FindItemCountFromInventory_Quantity' has a wrong offset!");
static_assert(offsetof(WBP_GM_ConsumablesOverview_C_LoadState, Temp_int_Variable) == 0x0002B4, "Member 'WBP_GM_ConsumablesOverview_C_LoadState::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GM_ConsumablesOverview_C_LoadState, CallFunc_BP_CreateEntryOfClass_ReturnValue) == 0x0002B8, "Member 'WBP_GM_ConsumablesOverview_C_LoadState::CallFunc_BP_CreateEntryOfClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GM_ConsumablesOverview_C_LoadState, CallFunc_Add_IntInt_ReturnValue_1) == 0x0002C0, "Member 'WBP_GM_ConsumablesOverview_C_LoadState::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_GM_ConsumablesOverview_C_LoadState, CallFunc_GetInventoryManager_ReturnValue_1) == 0x0002C8, "Member 'WBP_GM_ConsumablesOverview_C_LoadState::CallFunc_GetInventoryManager_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_GM_ConsumablesOverview_C_LoadState, CallFunc_GetConsumablesShards_FilteredArray) == 0x0002D0, "Member 'WBP_GM_ConsumablesOverview_C_LoadState::CallFunc_GetConsumablesShards_FilteredArray' has a wrong offset!");
static_assert(offsetof(WBP_GM_ConsumablesOverview_C_LoadState, CallFunc_Array_LastIndex_ReturnValue) == 0x0002E0, "Member 'WBP_GM_ConsumablesOverview_C_LoadState::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GM_ConsumablesOverview_C_LoadState, CallFunc_Array_Get_Item_1) == 0x0002E8, "Member 'WBP_GM_ConsumablesOverview_C_LoadState::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_GM_ConsumablesOverview_C_LoadState, CallFunc_Min_ReturnValue) == 0x000420, "Member 'WBP_GM_ConsumablesOverview_C_LoadState::CallFunc_Min_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GM_ConsumablesOverview_C_LoadState, CallFunc_Array_Add_ReturnValue) == 0x000424, "Member 'WBP_GM_ConsumablesOverview_C_LoadState::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GM_ConsumablesOverview_C_LoadState, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000428, "Member 'WBP_GM_ConsumablesOverview_C_LoadState::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GM_ConsumablesOverview_C_LoadState, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000429, "Member 'WBP_GM_ConsumablesOverview_C_LoadState::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");

}

