#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_QTEContainer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_QTEContainer.WBP_QTEContainer_C
// 0x0028 (0x0458 - 0x0430)
class UWBP_QTEContainer_C final : public UCommonActivatableWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0430(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHorizontalBox*                         HorizontalBox_45;                                  // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_HUD_QTE_C*                         WBP_HUD_QTE_0;                                     // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_HUD_QTE_C*                         WBP_HUD_QTE_1;                                     // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_HUD_QTE_C*                         WBP_HUD_QTE_2;                                     // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct();
	void Destruct();
	void ExecuteUbergraph_WBP_QTEContainer(int32 EntryPoint);
	void GetQTEWidgets(TArray<class UWBP_HUD_QTE_C*>* QTEWidgets);
	void OnTurnStart(class ABP_jRPG_Character_Battle_Base_C* Character);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_QTEContainer_C">();
	}
	static class UWBP_QTEContainer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_QTEContainer_C>();
	}
};
static_assert(alignof(UWBP_QTEContainer_C) == 0x000008, "Wrong alignment on UWBP_QTEContainer_C");
static_assert(sizeof(UWBP_QTEContainer_C) == 0x000458, "Wrong size on UWBP_QTEContainer_C");
static_assert(offsetof(UWBP_QTEContainer_C, UberGraphFrame) == 0x000430, "Member 'UWBP_QTEContainer_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_QTEContainer_C, HorizontalBox_45) == 0x000438, "Member 'UWBP_QTEContainer_C::HorizontalBox_45' has a wrong offset!");
static_assert(offsetof(UWBP_QTEContainer_C, WBP_HUD_QTE_0) == 0x000440, "Member 'UWBP_QTEContainer_C::WBP_HUD_QTE_0' has a wrong offset!");
static_assert(offsetof(UWBP_QTEContainer_C, WBP_HUD_QTE_1) == 0x000448, "Member 'UWBP_QTEContainer_C::WBP_HUD_QTE_1' has a wrong offset!");
static_assert(offsetof(UWBP_QTEContainer_C, WBP_HUD_QTE_2) == 0x000450, "Member 'UWBP_QTEContainer_C::WBP_HUD_QTE_2' has a wrong offset!");

}

