#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CommonVirtualButton

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_CommonVirtualButton.WBP_CommonVirtualButton_C.ExecuteUbergraph_WBP_CommonVirtualButton
// 0x0014 (0x0014 - 0x0000)
struct WBP_CommonVirtualButton_C_ExecuteUbergraph_WBP_CommonVirtualButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFocusEvent                            K2Node_Event_InFocusEvent_1;                       // 0x0004(0x0008)(NoDestructor)
	struct FFocusEvent                            K2Node_Event_InFocusEvent;                         // 0x000C(0x0008)(NoDestructor)
};
static_assert(alignof(WBP_CommonVirtualButton_C_ExecuteUbergraph_WBP_CommonVirtualButton) == 0x000004, "Wrong alignment on WBP_CommonVirtualButton_C_ExecuteUbergraph_WBP_CommonVirtualButton");
static_assert(sizeof(WBP_CommonVirtualButton_C_ExecuteUbergraph_WBP_CommonVirtualButton) == 0x000014, "Wrong size on WBP_CommonVirtualButton_C_ExecuteUbergraph_WBP_CommonVirtualButton");
static_assert(offsetof(WBP_CommonVirtualButton_C_ExecuteUbergraph_WBP_CommonVirtualButton, EntryPoint) == 0x000000, "Member 'WBP_CommonVirtualButton_C_ExecuteUbergraph_WBP_CommonVirtualButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_CommonVirtualButton_C_ExecuteUbergraph_WBP_CommonVirtualButton, K2Node_Event_InFocusEvent_1) == 0x000004, "Member 'WBP_CommonVirtualButton_C_ExecuteUbergraph_WBP_CommonVirtualButton::K2Node_Event_InFocusEvent_1' has a wrong offset!");
static_assert(offsetof(WBP_CommonVirtualButton_C_ExecuteUbergraph_WBP_CommonVirtualButton, K2Node_Event_InFocusEvent) == 0x00000C, "Member 'WBP_CommonVirtualButton_C_ExecuteUbergraph_WBP_CommonVirtualButton::K2Node_Event_InFocusEvent' has a wrong offset!");

// Function WBP_CommonVirtualButton.WBP_CommonVirtualButton_C.OnAddedToFocusPath
// 0x0008 (0x0008 - 0x0000)
struct WBP_CommonVirtualButton_C_OnAddedToFocusPath final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(WBP_CommonVirtualButton_C_OnAddedToFocusPath) == 0x000004, "Wrong alignment on WBP_CommonVirtualButton_C_OnAddedToFocusPath");
static_assert(sizeof(WBP_CommonVirtualButton_C_OnAddedToFocusPath) == 0x000008, "Wrong size on WBP_CommonVirtualButton_C_OnAddedToFocusPath");
static_assert(offsetof(WBP_CommonVirtualButton_C_OnAddedToFocusPath, InFocusEvent) == 0x000000, "Member 'WBP_CommonVirtualButton_C_OnAddedToFocusPath::InFocusEvent' has a wrong offset!");

// Function WBP_CommonVirtualButton.WBP_CommonVirtualButton_C.OnRemovedFromFocusPath
// 0x0008 (0x0008 - 0x0000)
struct WBP_CommonVirtualButton_C_OnRemovedFromFocusPath final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(WBP_CommonVirtualButton_C_OnRemovedFromFocusPath) == 0x000004, "Wrong alignment on WBP_CommonVirtualButton_C_OnRemovedFromFocusPath");
static_assert(sizeof(WBP_CommonVirtualButton_C_OnRemovedFromFocusPath) == 0x000008, "Wrong size on WBP_CommonVirtualButton_C_OnRemovedFromFocusPath");
static_assert(offsetof(WBP_CommonVirtualButton_C_OnRemovedFromFocusPath, InFocusEvent) == 0x000000, "Member 'WBP_CommonVirtualButton_C_OnRemovedFromFocusPath::InFocusEvent' has a wrong offset!");

}

