#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Debug_UMG_AnimationDebugger_WidgetAnimationEntry

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Debug_UMG_AnimationDebugger_WidgetAnimationEntry.WBP_Debug_UMG_AnimationDebugger_WidgetAnimationEntry_C
// 0x0020 (0x0300 - 0x02E0)
class UWBP_Debug_UMG_AnimationDebugger_WidgetAnimationEntry_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_PlayState;                                   // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_55;                                      // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_CurrentTime;                             // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_Debug_UMG_AnimationDebugger_WidgetAnimationEntry(int32 EntryPoint);
	void LoadAnimation(class UUserWidget* Widget, class UWidgetAnimation* Animation);
	void ProcessOnFinished();
	void ProcessOnStarted();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Debug_UMG_AnimationDebugger_WidgetAnimationEntry_C">();
	}
	static class UWBP_Debug_UMG_AnimationDebugger_WidgetAnimationEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Debug_UMG_AnimationDebugger_WidgetAnimationEntry_C>();
	}
};
static_assert(alignof(UWBP_Debug_UMG_AnimationDebugger_WidgetAnimationEntry_C) == 0x000008, "Wrong alignment on UWBP_Debug_UMG_AnimationDebugger_WidgetAnimationEntry_C");
static_assert(sizeof(UWBP_Debug_UMG_AnimationDebugger_WidgetAnimationEntry_C) == 0x000300, "Wrong size on UWBP_Debug_UMG_AnimationDebugger_WidgetAnimationEntry_C");
static_assert(offsetof(UWBP_Debug_UMG_AnimationDebugger_WidgetAnimationEntry_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_Debug_UMG_AnimationDebugger_WidgetAnimationEntry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Debug_UMG_AnimationDebugger_WidgetAnimationEntry_C, Image_PlayState) == 0x0002E8, "Member 'UWBP_Debug_UMG_AnimationDebugger_WidgetAnimationEntry_C::Image_PlayState' has a wrong offset!");
static_assert(offsetof(UWBP_Debug_UMG_AnimationDebugger_WidgetAnimationEntry_C, TextBlock_55) == 0x0002F0, "Member 'UWBP_Debug_UMG_AnimationDebugger_WidgetAnimationEntry_C::TextBlock_55' has a wrong offset!");
static_assert(offsetof(UWBP_Debug_UMG_AnimationDebugger_WidgetAnimationEntry_C, TextBlock_CurrentTime) == 0x0002F8, "Member 'UWBP_Debug_UMG_AnimationDebugger_WidgetAnimationEntry_C::TextBlock_CurrentTime' has a wrong offset!");

}

