#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_jRPG_InteractionPopUp

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_jRPG_InteractionPopUp.WBP_jRPG_InteractionPopUp_C
// 0x0028 (0x0308 - 0x02E0)
class UWBP_jRPG_InteractionPopUp_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                Button_Proceed;                                    // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_GamepadOkButton;                             // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Info;                                    // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ABP_jRPG_Controller_World_C*            WorldController;                                   // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void BndEvt__Button_Proceed_K2Node_ComponentBoundEvent_41_OnButtonPressedEvent__DelegateSignature();
	void Construct();
	void ExecuteUbergraph_WBP_jRPG_InteractionPopUp(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_jRPG_InteractionPopUp_C">();
	}
	static class UWBP_jRPG_InteractionPopUp_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_jRPG_InteractionPopUp_C>();
	}
};
static_assert(alignof(UWBP_jRPG_InteractionPopUp_C) == 0x000008, "Wrong alignment on UWBP_jRPG_InteractionPopUp_C");
static_assert(sizeof(UWBP_jRPG_InteractionPopUp_C) == 0x000308, "Wrong size on UWBP_jRPG_InteractionPopUp_C");
static_assert(offsetof(UWBP_jRPG_InteractionPopUp_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_jRPG_InteractionPopUp_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_jRPG_InteractionPopUp_C, Button_Proceed) == 0x0002E8, "Member 'UWBP_jRPG_InteractionPopUp_C::Button_Proceed' has a wrong offset!");
static_assert(offsetof(UWBP_jRPG_InteractionPopUp_C, Image_GamepadOkButton) == 0x0002F0, "Member 'UWBP_jRPG_InteractionPopUp_C::Image_GamepadOkButton' has a wrong offset!");
static_assert(offsetof(UWBP_jRPG_InteractionPopUp_C, TextBlock_Info) == 0x0002F8, "Member 'UWBP_jRPG_InteractionPopUp_C::TextBlock_Info' has a wrong offset!");
static_assert(offsetof(UWBP_jRPG_InteractionPopUp_C, WorldController) == 0x000300, "Member 'UWBP_jRPG_InteractionPopUp_C::WorldController' has a wrong offset!");

}

