#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CharacterStatusPanel

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_CharacterStatusPanel.WBP_CharacterStatusPanel_C.ExecuteUbergraph_WBP_CharacterStatusPanel
// 0x0050 (0x0050 - 0x0000)
struct WBP_CharacterStatusPanel_C_ExecuteUbergraph_WBP_CharacterStatusPanel final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              Temp_struct_Variable;                              // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              Temp_struct_Variable_1;                            // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_BattleBuffInstance_C*               K2Node_CustomEvent_BuffInstance;                   // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              K2Node_Select_Default;                             // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterStatusPanel_C_ExecuteUbergraph_WBP_CharacterStatusPanel) == 0x000008, "Wrong alignment on WBP_CharacterStatusPanel_C_ExecuteUbergraph_WBP_CharacterStatusPanel");
static_assert(sizeof(WBP_CharacterStatusPanel_C_ExecuteUbergraph_WBP_CharacterStatusPanel) == 0x000050, "Wrong size on WBP_CharacterStatusPanel_C_ExecuteUbergraph_WBP_CharacterStatusPanel");
static_assert(offsetof(WBP_CharacterStatusPanel_C_ExecuteUbergraph_WBP_CharacterStatusPanel, EntryPoint) == 0x000000, "Member 'WBP_CharacterStatusPanel_C_ExecuteUbergraph_WBP_CharacterStatusPanel::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_CharacterStatusPanel_C_ExecuteUbergraph_WBP_CharacterStatusPanel, Temp_struct_Variable) == 0x000008, "Member 'WBP_CharacterStatusPanel_C_ExecuteUbergraph_WBP_CharacterStatusPanel::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CharacterStatusPanel_C_ExecuteUbergraph_WBP_CharacterStatusPanel, Temp_bool_Variable) == 0x000018, "Member 'WBP_CharacterStatusPanel_C_ExecuteUbergraph_WBP_CharacterStatusPanel::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CharacterStatusPanel_C_ExecuteUbergraph_WBP_CharacterStatusPanel, Temp_struct_Variable_1) == 0x000020, "Member 'WBP_CharacterStatusPanel_C_ExecuteUbergraph_WBP_CharacterStatusPanel::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CharacterStatusPanel_C_ExecuteUbergraph_WBP_CharacterStatusPanel, K2Node_CustomEvent_BuffInstance) == 0x000030, "Member 'WBP_CharacterStatusPanel_C_ExecuteUbergraph_WBP_CharacterStatusPanel::K2Node_CustomEvent_BuffInstance' has a wrong offset!");
static_assert(offsetof(WBP_CharacterStatusPanel_C_ExecuteUbergraph_WBP_CharacterStatusPanel, CallFunc_IsValid_ReturnValue) == 0x000038, "Member 'WBP_CharacterStatusPanel_C_ExecuteUbergraph_WBP_CharacterStatusPanel::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterStatusPanel_C_ExecuteUbergraph_WBP_CharacterStatusPanel, K2Node_Event_IsDesignTime) == 0x000039, "Member 'WBP_CharacterStatusPanel_C_ExecuteUbergraph_WBP_CharacterStatusPanel::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_CharacterStatusPanel_C_ExecuteUbergraph_WBP_CharacterStatusPanel, K2Node_Select_Default) == 0x000040, "Member 'WBP_CharacterStatusPanel_C_ExecuteUbergraph_WBP_CharacterStatusPanel::K2Node_Select_Default' has a wrong offset!");

// Function WBP_CharacterStatusPanel.WBP_CharacterStatusPanel_C.LoadCharacterStats
// 0x0070 (0x0070 - 0x0000)
struct WBP_CharacterStatusPanel_C_LoadCharacterStats final
{
public:
	class UAC_jRPG_CharacterBattleStats_C*        CharacterBattleStats;                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UBP_BattleBuffInstance_C* BuffInstance)> K2Node_CreateDelegate_OutputDelegate_1; // 0x0028(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UBP_BattleBuffInstance_C* BuffInstance)> K2Node_CreateDelegate_OutputDelegate_2; // 0x003C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_BattleBuffInstanceWrapper_C*        CallFunc_Array_Get_Item;                           // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_BattleBuffInstance_AggregatorBase_C* K2Node_DynamicCast_AsBP_Battle_Buff_Instance_Aggregator_Base; // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterStatusPanel_C_LoadCharacterStats) == 0x000008, "Wrong alignment on WBP_CharacterStatusPanel_C_LoadCharacterStats");
static_assert(sizeof(WBP_CharacterStatusPanel_C_LoadCharacterStats) == 0x000070, "Wrong size on WBP_CharacterStatusPanel_C_LoadCharacterStats");
static_assert(offsetof(WBP_CharacterStatusPanel_C_LoadCharacterStats, CharacterBattleStats) == 0x000000, "Member 'WBP_CharacterStatusPanel_C_LoadCharacterStats::CharacterBattleStats' has a wrong offset!");
static_assert(offsetof(WBP_CharacterStatusPanel_C_LoadCharacterStats, Temp_int_Array_Index_Variable) == 0x000008, "Member 'WBP_CharacterStatusPanel_C_LoadCharacterStats::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CharacterStatusPanel_C_LoadCharacterStats, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'WBP_CharacterStatusPanel_C_LoadCharacterStats::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CharacterStatusPanel_C_LoadCharacterStats, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'WBP_CharacterStatusPanel_C_LoadCharacterStats::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterStatusPanel_C_LoadCharacterStats, CallFunc_IsValid_ReturnValue) == 0x000014, "Member 'WBP_CharacterStatusPanel_C_LoadCharacterStats::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterStatusPanel_C_LoadCharacterStats, CallFunc_IsValid_ReturnValue_1) == 0x000015, "Member 'WBP_CharacterStatusPanel_C_LoadCharacterStats::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CharacterStatusPanel_C_LoadCharacterStats, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'WBP_CharacterStatusPanel_C_LoadCharacterStats::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_CharacterStatusPanel_C_LoadCharacterStats, K2Node_CreateDelegate_OutputDelegate_1) == 0x000028, "Member 'WBP_CharacterStatusPanel_C_LoadCharacterStats::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_CharacterStatusPanel_C_LoadCharacterStats, CallFunc_IsValid_ReturnValue_2) == 0x000038, "Member 'WBP_CharacterStatusPanel_C_LoadCharacterStats::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_CharacterStatusPanel_C_LoadCharacterStats, K2Node_CreateDelegate_OutputDelegate_2) == 0x00003C, "Member 'WBP_CharacterStatusPanel_C_LoadCharacterStats::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_CharacterStatusPanel_C_LoadCharacterStats, CallFunc_Array_Get_Item) == 0x000050, "Member 'WBP_CharacterStatusPanel_C_LoadCharacterStats::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_CharacterStatusPanel_C_LoadCharacterStats, CallFunc_Array_Length_ReturnValue) == 0x000058, "Member 'WBP_CharacterStatusPanel_C_LoadCharacterStats::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterStatusPanel_C_LoadCharacterStats, CallFunc_Less_IntInt_ReturnValue) == 0x00005C, "Member 'WBP_CharacterStatusPanel_C_LoadCharacterStats::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterStatusPanel_C_LoadCharacterStats, K2Node_DynamicCast_AsBP_Battle_Buff_Instance_Aggregator_Base) == 0x000060, "Member 'WBP_CharacterStatusPanel_C_LoadCharacterStats::K2Node_DynamicCast_AsBP_Battle_Buff_Instance_Aggregator_Base' has a wrong offset!");
static_assert(offsetof(WBP_CharacterStatusPanel_C_LoadCharacterStats, K2Node_DynamicCast_bSuccess) == 0x000068, "Member 'WBP_CharacterStatusPanel_C_LoadCharacterStats::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WBP_CharacterStatusPanel.WBP_CharacterStatusPanel_C.OnBuffChanged
// 0x0008 (0x0008 - 0x0000)
struct WBP_CharacterStatusPanel_C_OnBuffChanged final
{
public:
	class UBP_BattleBuffInstance_C*               BuffInstance;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterStatusPanel_C_OnBuffChanged) == 0x000008, "Wrong alignment on WBP_CharacterStatusPanel_C_OnBuffChanged");
static_assert(sizeof(WBP_CharacterStatusPanel_C_OnBuffChanged) == 0x000008, "Wrong size on WBP_CharacterStatusPanel_C_OnBuffChanged");
static_assert(offsetof(WBP_CharacterStatusPanel_C_OnBuffChanged, BuffInstance) == 0x000000, "Member 'WBP_CharacterStatusPanel_C_OnBuffChanged::BuffInstance' has a wrong offset!");

// Function WBP_CharacterStatusPanel.WBP_CharacterStatusPanel_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_CharacterStatusPanel_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterStatusPanel_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_CharacterStatusPanel_C_PreConstruct");
static_assert(sizeof(WBP_CharacterStatusPanel_C_PreConstruct) == 0x000001, "Wrong size on WBP_CharacterStatusPanel_C_PreConstruct");
static_assert(offsetof(WBP_CharacterStatusPanel_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_CharacterStatusPanel_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_CharacterStatusPanel.WBP_CharacterStatusPanel_C.RefreshBuffs
// 0x00A8 (0x00A8 - 0x0000)
struct WBP_CharacterStatusPanel_C_RefreshBuffs final
{
public:
	class UAC_jRPG_CharacterBattleStats_C*        CharacterBattleStats;                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          local_hasWidgets;                                  // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UBP_BattleBuffInstanceWrapper_C*> Temp_wildcard_We_need_a_second_array_to_store_the_result_and_be_able_to_wipe_the_first__buffer__array_Variable; // 0x0028(0x0010)(ConstParm, ReferenceParm)
	class UBP_BattleBuffInstanceWrapper_C*        CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_BattleBuffInstanceWrapper_C*        CallFunc_Array_Get_Item_1;                         // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_BattleBuffInstance_AggregatorBase_C* K2Node_DynamicCast_AsBP_Battle_Buff_Instance_Aggregator_Base; // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsChildOfClass_ReturnValue;               // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsEmpty_ReturnValue;                // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0053(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0055(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_56[0x2];                                       // 0x0056(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x005D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x005E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x005F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_BuffInfoPanel_C*                   CallFunc_BP_CreateEntryOfClass_ReturnValue;        // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UBP_BattleBuffInstanceWrapper_C*> Temp_wildcard_Temp_buffer_array_Variable;         // 0x0070(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0088(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9D[0x3];                                       // 0x009D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterStatusPanel_C_RefreshBuffs) == 0x000008, "Wrong alignment on WBP_CharacterStatusPanel_C_RefreshBuffs");
static_assert(sizeof(WBP_CharacterStatusPanel_C_RefreshBuffs) == 0x0000A8, "Wrong size on WBP_CharacterStatusPanel_C_RefreshBuffs");
static_assert(offsetof(WBP_CharacterStatusPanel_C_RefreshBuffs, CharacterBattleStats) == 0x000000, "Member 'WBP_CharacterStatusPanel_C_RefreshBuffs::CharacterBattleStats' has a wrong offset!");
static_assert(offsetof(WBP_CharacterStatusPanel_C_RefreshBuffs, local_hasWidgets) == 0x000008, "Member 'WBP_CharacterStatusPanel_C_RefreshBuffs::local_hasWidgets' has a wrong offset!");
static_assert(offsetof(WBP_CharacterStatusPanel_C_RefreshBuffs, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'WBP_CharacterStatusPanel_C_RefreshBuffs::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CharacterStatusPanel_C_RefreshBuffs, CallFunc_Array_Length_ReturnValue) == 0x000010, "Member 'WBP_CharacterStatusPanel_C_RefreshBuffs::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterStatusPanel_C_RefreshBuffs, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'WBP_CharacterStatusPanel_C_RefreshBuffs::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CharacterStatusPanel_C_RefreshBuffs, CallFunc_Less_IntInt_ReturnValue) == 0x000018, "Member 'WBP_CharacterStatusPanel_C_RefreshBuffs::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterStatusPanel_C_RefreshBuffs, CallFunc_Add_IntInt_ReturnValue) == 0x00001C, "Member 'WBP_CharacterStatusPanel_C_RefreshBuffs::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterStatusPanel_C_RefreshBuffs, Temp_int_Array_Index_Variable_1) == 0x000020, "Member 'WBP_CharacterStatusPanel_C_RefreshBuffs::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CharacterStatusPanel_C_RefreshBuffs, Temp_wildcard_We_need_a_second_array_to_store_the_result_and_be_able_to_wipe_the_first__buffer__array_Variable) == 0x000028, "Member 'WBP_CharacterStatusPanel_C_RefreshBuffs::Temp_wildcard_We_need_a_second_array_to_store_the_result_and_be_able_to_wipe_the_first__buffer__array_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CharacterStatusPanel_C_RefreshBuffs, CallFunc_Array_Get_Item) == 0x000038, "Member 'WBP_CharacterStatusPanel_C_RefreshBuffs::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_CharacterStatusPanel_C_RefreshBuffs, CallFunc_Array_Get_Item_1) == 0x000040, "Member 'WBP_CharacterStatusPanel_C_RefreshBuffs::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_CharacterStatusPanel_C_RefreshBuffs, K2Node_DynamicCast_AsBP_Battle_Buff_Instance_Aggregator_Base) == 0x000048, "Member 'WBP_CharacterStatusPanel_C_RefreshBuffs::K2Node_DynamicCast_AsBP_Battle_Buff_Instance_Aggregator_Base' has a wrong offset!");
static_assert(offsetof(WBP_CharacterStatusPanel_C_RefreshBuffs, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'WBP_CharacterStatusPanel_C_RefreshBuffs::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_CharacterStatusPanel_C_RefreshBuffs, CallFunc_IsChildOfClass_ReturnValue) == 0x000051, "Member 'WBP_CharacterStatusPanel_C_RefreshBuffs::CallFunc_IsChildOfClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterStatusPanel_C_RefreshBuffs, CallFunc_Array_IsEmpty_ReturnValue) == 0x000052, "Member 'WBP_CharacterStatusPanel_C_RefreshBuffs::CallFunc_Array_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterStatusPanel_C_RefreshBuffs, CallFunc_IsValid_ReturnValue) == 0x000053, "Member 'WBP_CharacterStatusPanel_C_RefreshBuffs::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterStatusPanel_C_RefreshBuffs, CallFunc_Not_PreBool_ReturnValue) == 0x000054, "Member 'WBP_CharacterStatusPanel_C_RefreshBuffs::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterStatusPanel_C_RefreshBuffs, CallFunc_Not_PreBool_ReturnValue_1) == 0x000055, "Member 'WBP_CharacterStatusPanel_C_RefreshBuffs::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CharacterStatusPanel_C_RefreshBuffs, CallFunc_Array_Length_ReturnValue_1) == 0x000058, "Member 'WBP_CharacterStatusPanel_C_RefreshBuffs::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CharacterStatusPanel_C_RefreshBuffs, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00005C, "Member 'WBP_CharacterStatusPanel_C_RefreshBuffs::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterStatusPanel_C_RefreshBuffs, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x00005D, "Member 'WBP_CharacterStatusPanel_C_RefreshBuffs::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CharacterStatusPanel_C_RefreshBuffs, CallFunc_BooleanAND_ReturnValue) == 0x00005E, "Member 'WBP_CharacterStatusPanel_C_RefreshBuffs::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterStatusPanel_C_RefreshBuffs, CallFunc_BooleanOR_ReturnValue) == 0x00005F, "Member 'WBP_CharacterStatusPanel_C_RefreshBuffs::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterStatusPanel_C_RefreshBuffs, CallFunc_BooleanAND_ReturnValue_1) == 0x000060, "Member 'WBP_CharacterStatusPanel_C_RefreshBuffs::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CharacterStatusPanel_C_RefreshBuffs, CallFunc_BP_CreateEntryOfClass_ReturnValue) == 0x000068, "Member 'WBP_CharacterStatusPanel_C_RefreshBuffs::CallFunc_BP_CreateEntryOfClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterStatusPanel_C_RefreshBuffs, Temp_wildcard_Temp_buffer_array_Variable) == 0x000070, "Member 'WBP_CharacterStatusPanel_C_RefreshBuffs::Temp_wildcard_Temp_buffer_array_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CharacterStatusPanel_C_RefreshBuffs, CallFunc_Not_PreBool_ReturnValue_2) == 0x000080, "Member 'WBP_CharacterStatusPanel_C_RefreshBuffs::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_CharacterStatusPanel_C_RefreshBuffs, CallFunc_Array_Add_ReturnValue) == 0x000084, "Member 'WBP_CharacterStatusPanel_C_RefreshBuffs::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterStatusPanel_C_RefreshBuffs, K2Node_CreateDelegate_OutputDelegate) == 0x000088, "Member 'WBP_CharacterStatusPanel_C_RefreshBuffs::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_CharacterStatusPanel_C_RefreshBuffs, Temp_int_Loop_Counter_Variable_1) == 0x000098, "Member 'WBP_CharacterStatusPanel_C_RefreshBuffs::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CharacterStatusPanel_C_RefreshBuffs, CallFunc_Less_IntInt_ReturnValue_1) == 0x00009C, "Member 'WBP_CharacterStatusPanel_C_RefreshBuffs::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CharacterStatusPanel_C_RefreshBuffs, CallFunc_Add_IntInt_ReturnValue_1) == 0x0000A0, "Member 'WBP_CharacterStatusPanel_C_RefreshBuffs::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");

// Function WBP_CharacterStatusPanel.WBP_CharacterStatusPanel_C.SetIsEmpty
// 0x0005 (0x0005 - 0x0000)
struct WBP_CharacterStatusPanel_C_SetIsEmpty final
{
public:
	bool                                          IsEmpty;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterStatusPanel_C_SetIsEmpty) == 0x000001, "Wrong alignment on WBP_CharacterStatusPanel_C_SetIsEmpty");
static_assert(sizeof(WBP_CharacterStatusPanel_C_SetIsEmpty) == 0x000005, "Wrong size on WBP_CharacterStatusPanel_C_SetIsEmpty");
static_assert(offsetof(WBP_CharacterStatusPanel_C_SetIsEmpty, IsEmpty) == 0x000000, "Member 'WBP_CharacterStatusPanel_C_SetIsEmpty::IsEmpty' has a wrong offset!");
static_assert(offsetof(WBP_CharacterStatusPanel_C_SetIsEmpty, Temp_bool_Variable) == 0x000001, "Member 'WBP_CharacterStatusPanel_C_SetIsEmpty::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CharacterStatusPanel_C_SetIsEmpty, Temp_byte_Variable) == 0x000002, "Member 'WBP_CharacterStatusPanel_C_SetIsEmpty::Temp_byte_Variable' has a wrong offset!");
