#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_LuminaConsumableEntry

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_LuminaConsumableEntry.WBP_LuminaConsumableEntry_C
// 0x0090 (0x0398 - 0x0308)
class UWBP_LuminaConsumableEntry_C final : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0308(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonLazyImage*                       BackgroundImage;                                   // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_BaseButton_C*                      BaseButton;                                        // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonLazyImage*                       CharacterImage;                                    // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_HeadingText_C*                     CharacterNameText;                                 // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonLazyImage*                       Image_IconLumina;                                  // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNiagaraSystemWidget*                   NiagaraSystemWidget_Explosion;                     // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNiagaraSystemWidget*                   NiagaraSystemWidget_Loop;                          // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonLazyImage*                       PromptBackground;                                  // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               PromptBox;                                         // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextBlock_LuminaPoints;                            // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextBlock_LuminaPointsFromLevel;                   // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_TextualInputActionBinding_C*       UpgradeBinding;                                    // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnClicked;                                         // 0x0370(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UBP_CharacterData_C*                    CharacterData;                                     // 0x0380(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FDataTableRowHandle                    SD_OnLuminaAdded;                                  // 0x0388(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)

public:
	void BndEvt__WBP_CharacterCardButton_BaseButton_K2Node_ComponentBoundEvent_0_OnButtonBaseActionProgress__DelegateSignature(double Progress);
	void BndEvt__WBP_CharacterCardButton_BaseButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_CharacterCardButton_BaseButton_K2Node_ComponentBoundEvent_2_OnButtonBaseFocused__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_CharacterCardButton_BaseButton_K2Node_ComponentBoundEvent_3_OnButtonBaseUnfocused__DelegateSignature(class UCommonButtonBase* Button);
	void ExecuteUbergraph_WBP_LuminaConsumableEntry(int32 EntryPoint);
	void GetCharacterData(class UBP_CharacterData_C** CharacterData_0);
	void LoadCharacterState(class UBP_CharacterData_C* Character);
	void PreConstruct(bool IsDesignTime);
	void UpdatePromptState();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_LuminaConsumableEntry_C">();
	}
	static class UWBP_LuminaConsumableEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_LuminaConsumableEntry_C>();
	}
};
static_assert(alignof(UWBP_LuminaConsumableEntry_C) == 0x000008, "Wrong alignment on UWBP_LuminaConsumableEntry_C");
static_assert(sizeof(UWBP_LuminaConsumableEntry_C) == 0x000398, "Wrong size on UWBP_LuminaConsumableEntry_C");
static_assert(offsetof(UWBP_LuminaConsumableEntry_C, UberGraphFrame) == 0x000308, "Member 'UWBP_LuminaConsumableEntry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_LuminaConsumableEntry_C, BackgroundImage) == 0x000310, "Member 'UWBP_LuminaConsumableEntry_C::BackgroundImage' has a wrong offset!");
static_assert(offsetof(UWBP_LuminaConsumableEntry_C, BaseButton) == 0x000318, "Member 'UWBP_LuminaConsumableEntry_C::BaseButton' has a wrong offset!");
static_assert(offsetof(UWBP_LuminaConsumableEntry_C, CharacterImage) == 0x000320, "Member 'UWBP_LuminaConsumableEntry_C::CharacterImage' has a wrong offset!");
static_assert(offsetof(UWBP_LuminaConsumableEntry_C, CharacterNameText) == 0x000328, "Member 'UWBP_LuminaConsumableEntry_C::CharacterNameText' has a wrong offset!");
static_assert(offsetof(UWBP_LuminaConsumableEntry_C, Image_IconLumina) == 0x000330, "Member 'UWBP_LuminaConsumableEntry_C::Image_IconLumina' has a wrong offset!");
static_assert(offsetof(UWBP_LuminaConsumableEntry_C, NiagaraSystemWidget_Explosion) == 0x000338, "Member 'UWBP_LuminaConsumableEntry_C::NiagaraSystemWidget_Explosion' has a wrong offset!");
static_assert(offsetof(UWBP_LuminaConsumableEntry_C, NiagaraSystemWidget_Loop) == 0x000340, "Member 'UWBP_LuminaConsumableEntry_C::NiagaraSystemWidget_Loop' has a wrong offset!");
static_assert(offsetof(UWBP_LuminaConsumableEntry_C, PromptBackground) == 0x000348, "Member 'UWBP_LuminaConsumableEntry_C::PromptBackground' has a wrong offset!");
static_assert(offsetof(UWBP_LuminaConsumableEntry_C, PromptBox) == 0x000350, "Member 'UWBP_LuminaConsumableEntry_C::PromptBox' has a wrong offset!");
static_assert(offsetof(UWBP_LuminaConsumableEntry_C, TextBlock_LuminaPoints) == 0x000358, "Member 'UWBP_LuminaConsumableEntry_C::TextBlock_LuminaPoints' has a wrong offset!");
static_assert(offsetof(UWBP_LuminaConsumableEntry_C, TextBlock_LuminaPointsFromLevel) == 0x000360, "Member 'UWBP_LuminaConsumableEntry_C::TextBlock_LuminaPointsFromLevel' has a wrong offset!");
static_assert(offsetof(UWBP_LuminaConsumableEntry_C, UpgradeBinding) == 0x000368, "Member 'UWBP_LuminaConsumableEntry_C::UpgradeBinding' has a wrong offset!");
static_assert(offsetof(UWBP_LuminaConsumableEntry_C, OnClicked) == 0x000370, "Member 'UWBP_LuminaConsumableEntry_C::OnClicked' has a wrong offset!");
static_assert(offsetof(UWBP_LuminaConsumableEntry_C, CharacterData) == 0x000380, "Member 'UWBP_LuminaConsumableEntry_C::CharacterData' has a wrong offset!");
static_assert(offsetof(UWBP_LuminaConsumableEntry_C, SD_OnLuminaAdded) == 0x000388, "Member 'UWBP_LuminaConsumableEntry_C::SD_OnLuminaAdded' has a wrong offset!");

}

