#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_LevelNameWidget

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_LevelNameWidget.WBP_LevelNameWidget_C.ExecuteUbergraph_WBP_LevelNameWidget
// 0x0028 (0x0028 - 0x0000)
struct WBP_LevelNameWidget_C_ExecuteUbergraph_WBP_LevelNameWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0018(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LevelNameWidget_C_ExecuteUbergraph_WBP_LevelNameWidget) == 0x000004, "Wrong alignment on WBP_LevelNameWidget_C_ExecuteUbergraph_WBP_LevelNameWidget");
static_assert(sizeof(WBP_LevelNameWidget_C_ExecuteUbergraph_WBP_LevelNameWidget) == 0x000028, "Wrong size on WBP_LevelNameWidget_C_ExecuteUbergraph_WBP_LevelNameWidget");
static_assert(offsetof(WBP_LevelNameWidget_C_ExecuteUbergraph_WBP_LevelNameWidget, EntryPoint) == 0x000000, "Member 'WBP_LevelNameWidget_C_ExecuteUbergraph_WBP_LevelNameWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_LevelNameWidget_C_ExecuteUbergraph_WBP_LevelNameWidget, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WBP_LevelNameWidget_C_ExecuteUbergraph_WBP_LevelNameWidget::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_LevelNameWidget_C_ExecuteUbergraph_WBP_LevelNameWidget, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WBP_LevelNameWidget_C_ExecuteUbergraph_WBP_LevelNameWidget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_LevelNameWidget_C_ExecuteUbergraph_WBP_LevelNameWidget, K2Node_CreateDelegate_OutputDelegate_1) == 0x000018, "Member 'WBP_LevelNameWidget_C_ExecuteUbergraph_WBP_LevelNameWidget::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");

// Function WBP_LevelNameWidget.WBP_LevelNameWidget_C.PlayAppearAnimation
// 0x0008 (0x0008 - 0x0000)
struct WBP_LevelNameWidget_C_PlayAppearAnimation final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LevelNameWidget_C_PlayAppearAnimation) == 0x000008, "Wrong alignment on WBP_LevelNameWidget_C_PlayAppearAnimation");
static_assert(sizeof(WBP_LevelNameWidget_C_PlayAppearAnimation) == 0x000008, "Wrong size on WBP_LevelNameWidget_C_PlayAppearAnimation");
static_assert(offsetof(WBP_LevelNameWidget_C_PlayAppearAnimation, CallFunc_PlayAnimation_ReturnValue) == 0x000000, "Member 'WBP_LevelNameWidget_C_PlayAppearAnimation::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function WBP_LevelNameWidget.WBP_LevelNameWidget_C.PlayDisappearAnimation
// 0x0008 (0x0008 - 0x0000)
struct WBP_LevelNameWidget_C_PlayDisappearAnimation final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LevelNameWidget_C_PlayDisappearAnimation) == 0x000008, "Wrong alignment on WBP_LevelNameWidget_C_PlayDisappearAnimation");
static_assert(sizeof(WBP_LevelNameWidget_C_PlayDisappearAnimation) == 0x000008, "Wrong size on WBP_LevelNameWidget_C_PlayDisappearAnimation");
static_assert(offsetof(WBP_LevelNameWidget_C_PlayDisappearAnimation, CallFunc_PlayAnimation_ReturnValue) == 0x000000, "Member 'WBP_LevelNameWidget_C_PlayDisappearAnimation::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function WBP_LevelNameWidget.WBP_LevelNameWidget_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_LevelNameWidget_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LevelNameWidget_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_LevelNameWidget_C_PreConstruct");
static_assert(sizeof(WBP_LevelNameWidget_C_PreConstruct) == 0x000001, "Wrong size on WBP_LevelNameWidget_C_PreConstruct");
static_assert(offsetof(WBP_LevelNameWidget_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_LevelNameWidget_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_LevelNameWidget.WBP_LevelNameWidget_C.SetDangerTextVisbility
// 0x0001 (0x0001 - 0x0000)
struct WBP_LevelNameWidget_C_SetDangerTextVisbility final
{
public:
	ESlateVisibility                              InVisibility;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LevelNameWidget_C_SetDangerTextVisbility) == 0x000001, "Wrong alignment on WBP_LevelNameWidget_C_SetDangerTextVisbility");
static_assert(sizeof(WBP_LevelNameWidget_C_SetDangerTextVisbility) == 0x000001, "Wrong size on WBP_LevelNameWidget_C_SetDangerTextVisbility");
static_assert(offsetof(WBP_LevelNameWidget_C_SetDangerTextVisbility, InVisibility) == 0x000000, "Member 'WBP_LevelNameWidget_C_SetDangerTextVisbility::InVisibility' has a wrong offset!");

// Function WBP_LevelNameWidget.WBP_LevelNameWidget_C.SetLevelNameText
// 0x0010 (0x0010 - 0x0000)
struct WBP_LevelNameWidget_C_SetLevelNameText final
{
public:
	class FText                                   LevelNameText;                                     // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_LevelNameWidget_C_SetLevelNameText) == 0x000008, "Wrong alignment on WBP_LevelNameWidget_C_SetLevelNameText");
static_assert(sizeof(WBP_LevelNameWidget_C_SetLevelNameText) == 0x000010, "Wrong size on WBP_LevelNameWidget_C_SetLevelNameText");
static_assert(offsetof(WBP_LevelNameWidget_C_SetLevelNameText, LevelNameText) == 0x000000, "Member 'WBP_LevelNameWidget_C_SetLevelNameText::LevelNameText' has a wrong offset!");

}

