#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Settings_ControllerLayout

#include "Basic.hpp"

#include "CommonInput_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function WBP_Settings_ControllerLayout.WBP_Settings_ControllerLayout_C.RefreshLayout
// 0x0020 (0x0020 - 0x0000)
struct WBP_Settings_ControllerLayout_C_RefreshLayout final
{
public:
	ECommonInputType                              CurrentInputType;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetCurrentGamepadName_ReturnValue;        // 0x0014(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x001F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_ControllerLayout_C_RefreshLayout) == 0x000008, "Wrong alignment on WBP_Settings_ControllerLayout_C_RefreshLayout");
static_assert(sizeof(WBP_Settings_ControllerLayout_C_RefreshLayout) == 0x000020, "Wrong size on WBP_Settings_ControllerLayout_C_RefreshLayout");
static_assert(offsetof(WBP_Settings_ControllerLayout_C_RefreshLayout, CurrentInputType) == 0x000000, "Member 'WBP_Settings_ControllerLayout_C_RefreshLayout::CurrentInputType' has a wrong offset!");
static_assert(offsetof(WBP_Settings_ControllerLayout_C_RefreshLayout, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000008, "Member 'WBP_Settings_ControllerLayout_C_RefreshLayout::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_ControllerLayout_C_RefreshLayout, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000010, "Member 'WBP_Settings_ControllerLayout_C_RefreshLayout::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_ControllerLayout_C_RefreshLayout, CallFunc_GetCurrentGamepadName_ReturnValue) == 0x000014, "Member 'WBP_Settings_ControllerLayout_C_RefreshLayout::CallFunc_GetCurrentGamepadName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_ControllerLayout_C_RefreshLayout, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x00001C, "Member 'WBP_Settings_ControllerLayout_C_RefreshLayout::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Settings_ControllerLayout_C_RefreshLayout, K2Node_SwitchName_CmpSuccess) == 0x00001D, "Member 'WBP_Settings_ControllerLayout_C_RefreshLayout::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Settings_ControllerLayout_C_RefreshLayout, CallFunc_BooleanOR_ReturnValue) == 0x00001E, "Member 'WBP_Settings_ControllerLayout_C_RefreshLayout::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_ControllerLayout_C_RefreshLayout, CallFunc_NotEqual_NameName_ReturnValue) == 0x00001F, "Member 'WBP_Settings_ControllerLayout_C_RefreshLayout::CallFunc_NotEqual_NameName_ReturnValue' has a wrong offset!");

// Function WBP_Settings_ControllerLayout.WBP_Settings_ControllerLayout_C.BndEvt__WBP_Settings_ControllerLayout_WBP_CommonBoundActionButton_Back_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Settings_ControllerLayout_C_BndEvt__WBP_Settings_ControllerLayout_WBP_CommonBoundActionButton_Back_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_ControllerLayout_C_BndEvt__WBP_Settings_ControllerLayout_WBP_CommonBoundActionButton_Back_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Settings_ControllerLayout_C_BndEvt__WBP_Settings_ControllerLayout_WBP_CommonBoundActionButton_Back_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_Settings_ControllerLayout_C_BndEvt__WBP_Settings_ControllerLayout_WBP_CommonBoundActionButton_Back_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_Settings_ControllerLayout_C_BndEvt__WBP_Settings_ControllerLayout_WBP_CommonBoundActionButton_Back_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_Settings_ControllerLayout_C_BndEvt__WBP_Settings_ControllerLayout_WBP_CommonBoundActionButton_Back_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_Settings_ControllerLayout_C_BndEvt__WBP_Settings_ControllerLayout_WBP_CommonBoundActionButton_Back_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_Settings_ControllerLayout.WBP_Settings_ControllerLayout_C.ExecuteUbergraph_WBP_Settings_ControllerLayout
// 0x0060 (0x0060 - 0x0000)
struct WBP_Settings_ControllerLayout_C_ExecuteUbergraph_WBP_Settings_ControllerLayout final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(ECommonInputType bNewInputType)> K2Node_CreateDelegate_OutputDelegate;            // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_GetPlatformNameAsTag_ReturnValue;         // 0x0020(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess;   // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(ECommonInputType bNewInputType)> K2Node_CreateDelegate_OutputDelegate_1;          // 0x0038(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue_1;    // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              CallFunc_GetCurrentInputType_ReturnValue;          // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue_2;    // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_ControllerLayout_C_ExecuteUbergraph_WBP_Settings_ControllerLayout) == 0x000008, "Wrong alignment on WBP_Settings_ControllerLayout_C_ExecuteUbergraph_WBP_Settings_ControllerLayout");
static_assert(sizeof(WBP_Settings_ControllerLayout_C_ExecuteUbergraph_WBP_Settings_ControllerLayout) == 0x000060, "Wrong size on WBP_Settings_ControllerLayout_C_ExecuteUbergraph_WBP_Settings_ControllerLayout");
static_assert(offsetof(WBP_Settings_ControllerLayout_C_ExecuteUbergraph_WBP_Settings_ControllerLayout, EntryPoint) == 0x000000, "Member 'WBP_Settings_ControllerLayout_C_ExecuteUbergraph_WBP_Settings_ControllerLayout::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Settings_ControllerLayout_C_ExecuteUbergraph_WBP_Settings_ControllerLayout, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_Settings_ControllerLayout_C_ExecuteUbergraph_WBP_Settings_ControllerLayout::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Settings_ControllerLayout_C_ExecuteUbergraph_WBP_Settings_ControllerLayout, K2Node_ComponentBoundEvent_Button) == 0x000018, "Member 'WBP_Settings_ControllerLayout_C_ExecuteUbergraph_WBP_Settings_ControllerLayout::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(WBP_Settings_ControllerLayout_C_ExecuteUbergraph_WBP_Settings_ControllerLayout, CallFunc_GetPlatformNameAsTag_ReturnValue) == 0x000020, "Member 'WBP_Settings_ControllerLayout_C_ExecuteUbergraph_WBP_Settings_ControllerLayout::CallFunc_GetPlatformNameAsTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_ControllerLayout_C_ExecuteUbergraph_WBP_Settings_ControllerLayout, GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess) == 0x000028, "Member 'WBP_Settings_ControllerLayout_C_ExecuteUbergraph_WBP_Settings_ControllerLayout::GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Settings_ControllerLayout_C_ExecuteUbergraph_WBP_Settings_ControllerLayout, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000030, "Member 'WBP_Settings_ControllerLayout_C_ExecuteUbergraph_WBP_Settings_ControllerLayout::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_ControllerLayout_C_ExecuteUbergraph_WBP_Settings_ControllerLayout, K2Node_CreateDelegate_OutputDelegate_1) == 0x000038, "Member 'WBP_Settings_ControllerLayout_C_ExecuteUbergraph_WBP_Settings_ControllerLayout::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_Settings_ControllerLayout_C_ExecuteUbergraph_WBP_Settings_ControllerLayout, CallFunc_GetLocalPlayerSubsystem_ReturnValue_1) == 0x000048, "Member 'WBP_Settings_ControllerLayout_C_ExecuteUbergraph_WBP_Settings_ControllerLayout::CallFunc_GetLocalPlayerSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Settings_ControllerLayout_C_ExecuteUbergraph_WBP_Settings_ControllerLayout, CallFunc_GetCurrentInputType_ReturnValue) == 0x000050, "Member 'WBP_Settings_ControllerLayout_C_ExecuteUbergraph_WBP_Settings_ControllerLayout::CallFunc_GetCurrentInputType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_ControllerLayout_C_ExecuteUbergraph_WBP_Settings_ControllerLayout, CallFunc_GetLocalPlayerSubsystem_ReturnValue_2) == 0x000058, "Member 'WBP_Settings_ControllerLayout_C_ExecuteUbergraph_WBP_Settings_ControllerLayout::CallFunc_GetLocalPlayerSubsystem_ReturnValue_2' has a wrong offset!");

}

