#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_RelationshipNumber

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_RelationshipNumber.WBP_RelationshipNumber_C.ExecuteUbergraph_WBP_RelationshipNumber
// 0x0058 (0x0058 - 0x0000)
struct WBP_RelationshipNumber_C_ExecuteUbergraph_WBP_RelationshipNumber final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 Temp_class_Variable;                               // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable_1;                             // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_CustomEvent_InText_1;                       // 0x0018(0x0010)()
	class FText                                   K2Node_CustomEvent_InText;                         // 0x0028(0x0010)()
	bool                                          K2Node_CustomEvent_IsMax;                          // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 K2Node_Select_Default;                             // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0048(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_RelationshipNumber_C_ExecuteUbergraph_WBP_RelationshipNumber) == 0x000008, "Wrong alignment on WBP_RelationshipNumber_C_ExecuteUbergraph_WBP_RelationshipNumber");
static_assert(sizeof(WBP_RelationshipNumber_C_ExecuteUbergraph_WBP_RelationshipNumber) == 0x000058, "Wrong size on WBP_RelationshipNumber_C_ExecuteUbergraph_WBP_RelationshipNumber");
static_assert(offsetof(WBP_RelationshipNumber_C_ExecuteUbergraph_WBP_RelationshipNumber, EntryPoint) == 0x000000, "Member 'WBP_RelationshipNumber_C_ExecuteUbergraph_WBP_RelationshipNumber::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_RelationshipNumber_C_ExecuteUbergraph_WBP_RelationshipNumber, Temp_bool_Variable) == 0x000004, "Member 'WBP_RelationshipNumber_C_ExecuteUbergraph_WBP_RelationshipNumber::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_RelationshipNumber_C_ExecuteUbergraph_WBP_RelationshipNumber, Temp_class_Variable) == 0x000008, "Member 'WBP_RelationshipNumber_C_ExecuteUbergraph_WBP_RelationshipNumber::Temp_class_Variable' has a wrong offset!");
static_assert(offsetof(WBP_RelationshipNumber_C_ExecuteUbergraph_WBP_RelationshipNumber, Temp_class_Variable_1) == 0x000010, "Member 'WBP_RelationshipNumber_C_ExecuteUbergraph_WBP_RelationshipNumber::Temp_class_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_RelationshipNumber_C_ExecuteUbergraph_WBP_RelationshipNumber, K2Node_CustomEvent_InText_1) == 0x000018, "Member 'WBP_RelationshipNumber_C_ExecuteUbergraph_WBP_RelationshipNumber::K2Node_CustomEvent_InText_1' has a wrong offset!");
static_assert(offsetof(WBP_RelationshipNumber_C_ExecuteUbergraph_WBP_RelationshipNumber, K2Node_CustomEvent_InText) == 0x000028, "Member 'WBP_RelationshipNumber_C_ExecuteUbergraph_WBP_RelationshipNumber::K2Node_CustomEvent_InText' has a wrong offset!");
static_assert(offsetof(WBP_RelationshipNumber_C_ExecuteUbergraph_WBP_RelationshipNumber, K2Node_CustomEvent_IsMax) == 0x000038, "Member 'WBP_RelationshipNumber_C_ExecuteUbergraph_WBP_RelationshipNumber::K2Node_CustomEvent_IsMax' has a wrong offset!");
static_assert(offsetof(WBP_RelationshipNumber_C_ExecuteUbergraph_WBP_RelationshipNumber, K2Node_Select_Default) == 0x000040, "Member 'WBP_RelationshipNumber_C_ExecuteUbergraph_WBP_RelationshipNumber::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_RelationshipNumber_C_ExecuteUbergraph_WBP_RelationshipNumber, K2Node_CreateDelegate_OutputDelegate) == 0x000048, "Member 'WBP_RelationshipNumber_C_ExecuteUbergraph_WBP_RelationshipNumber::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function WBP_RelationshipNumber.WBP_RelationshipNumber_C.PlayNextTextAnimation
// 0x0008 (0x0008 - 0x0000)
struct WBP_RelationshipNumber_C_PlayNextTextAnimation final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_RelationshipNumber_C_PlayNextTextAnimation) == 0x000008, "Wrong alignment on WBP_RelationshipNumber_C_PlayNextTextAnimation");
static_assert(sizeof(WBP_RelationshipNumber_C_PlayNextTextAnimation) == 0x000008, "Wrong size on WBP_RelationshipNumber_C_PlayNextTextAnimation");
static_assert(offsetof(WBP_RelationshipNumber_C_PlayNextTextAnimation, CallFunc_PlayAnimation_ReturnValue) == 0x000000, "Member 'WBP_RelationshipNumber_C_PlayNextTextAnimation::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function WBP_RelationshipNumber.WBP_RelationshipNumber_C.SetNextText
// 0x0018 (0x0018 - 0x0000)
struct WBP_RelationshipNumber_C_SetNextText final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          IsMax;                                             // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_RelationshipNumber_C_SetNextText) == 0x000008, "Wrong alignment on WBP_RelationshipNumber_C_SetNextText");
static_assert(sizeof(WBP_RelationshipNumber_C_SetNextText) == 0x000018, "Wrong size on WBP_RelationshipNumber_C_SetNextText");
static_assert(offsetof(WBP_RelationshipNumber_C_SetNextText, InText) == 0x000000, "Member 'WBP_RelationshipNumber_C_SetNextText::InText' has a wrong offset!");
static_assert(offsetof(WBP_RelationshipNumber_C_SetNextText, IsMax) == 0x000010, "Member 'WBP_RelationshipNumber_C_SetNextText::IsMax' has a wrong offset!");

// Function WBP_RelationshipNumber.WBP_RelationshipNumber_C.SetText
// 0x0010 (0x0010 - 0x0000)
struct WBP_RelationshipNumber_C_SetText final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_RelationshipNumber_C_SetText) == 0x000008, "Wrong alignment on WBP_RelationshipNumber_C_SetText");
static_assert(sizeof(WBP_RelationshipNumber_C_SetText) == 0x000010, "Wrong size on WBP_RelationshipNumber_C_SetText");
static_assert(offsetof(WBP_RelationshipNumber_C_SetText, InText) == 0x000000, "Member 'WBP_RelationshipNumber_C_SetText::InText' has a wrong offset!");

}

