#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GM_AssignedSkills

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_GM_AssignedSkills.WBP_GM_AssignedSkills_C.BndEvt__WBP_GM_AssignedSkills_Skill0_K2Node_ComponentBoundEvent_12_OnSkillElementShortClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_GM_AssignedSkills_C_BndEvt__WBP_GM_AssignedSkills_Skill0_K2Node_ComponentBoundEvent_12_OnSkillElementShortClicked__DelegateSignature final
{
public:
	class UBP_DataAsset_Skill_C*                  SkillData;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GM_AssignedSkills_C_BndEvt__WBP_GM_AssignedSkills_Skill0_K2Node_ComponentBoundEvent_12_OnSkillElementShortClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_GM_AssignedSkills_C_BndEvt__WBP_GM_AssignedSkills_Skill0_K2Node_ComponentBoundEvent_12_OnSkillElementShortClicked__DelegateSignature");
static_assert(sizeof(WBP_GM_AssignedSkills_C_BndEvt__WBP_GM_AssignedSkills_Skill0_K2Node_ComponentBoundEvent_12_OnSkillElementShortClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_GM_AssignedSkills_C_BndEvt__WBP_GM_AssignedSkills_Skill0_K2Node_ComponentBoundEvent_12_OnSkillElementShortClicked__DelegateSignature");
static_assert(offsetof(WBP_GM_AssignedSkills_C_BndEvt__WBP_GM_AssignedSkills_Skill0_K2Node_ComponentBoundEvent_12_OnSkillElementShortClicked__DelegateSignature, SkillData) == 0x000000, "Member 'WBP_GM_AssignedSkills_C_BndEvt__WBP_GM_AssignedSkills_Skill0_K2Node_ComponentBoundEvent_12_OnSkillElementShortClicked__DelegateSignature::SkillData' has a wrong offset!");

// Function WBP_GM_AssignedSkills.WBP_GM_AssignedSkills_C.BndEvt__WBP_GM_AssignedSkills_Skill0_K2Node_ComponentBoundEvent_13_OnSkillElementShortFocused__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct WBP_GM_AssignedSkills_C_BndEvt__WBP_GM_AssignedSkills_Skill0_K2Node_ComponentBoundEvent_13_OnSkillElementShortFocused__DelegateSignature final
{
public:
	class UBP_DataAsset_Skill_C*                  SkillData;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              AbsolutePos;                                       // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GM_AssignedSkills_C_BndEvt__WBP_GM_AssignedSkills_Skill0_K2Node_ComponentBoundEvent_13_OnSkillElementShortFocused__DelegateSignature) == 0x000008, "Wrong alignment on WBP_GM_AssignedSkills_C_BndEvt__WBP_GM_AssignedSkills_Skill0_K2Node_ComponentBoundEvent_13_OnSkillElementShortFocused__DelegateSignature");
static_assert(sizeof(WBP_GM_AssignedSkills_C_BndEvt__WBP_GM_AssignedSkills_Skill0_K2Node_ComponentBoundEvent_13_OnSkillElementShortFocused__DelegateSignature) == 0x000018, "Wrong size on WBP_GM_AssignedSkills_C_BndEvt__WBP_GM_AssignedSkills_Skill0_K2Node_ComponentBoundEvent_13_OnSkillElementShortFocused__DelegateSignature");
static_assert(offsetof(WBP_GM_AssignedSkills_C_BndEvt__WBP_GM_AssignedSkills_Skill0_K2Node_ComponentBoundEvent_13_OnSkillElementShortFocused__DelegateSignature, SkillData) == 0x000000, "Member 'WBP_GM_AssignedSkills_C_BndEvt__WBP_GM_AssignedSkills_Skill0_K2Node_ComponentBoundEvent_13_OnSkillElementShortFocused__DelegateSignature::SkillData' has a wrong offset!");
static_assert(offsetof(WBP_GM_AssignedSkills_C_BndEvt__WBP_GM_AssignedSkills_Skill0_K2Node_ComponentBoundEvent_13_OnSkillElementShortFocused__DelegateSignature, AbsolutePos) == 0x000008, "Member 'WBP_GM_AssignedSkills_C_BndEvt__WBP_GM_AssignedSkills_Skill0_K2Node_ComponentBoundEvent_13_OnSkillElementShortFocused__DelegateSignature::AbsolutePos' has a wrong offset!");

// Function WBP_GM_AssignedSkills.WBP_GM_AssignedSkills_C.BndEvt__WBP_GM_AssignedSkills_Skill1_K2Node_ComponentBoundEvent_14_OnSkillElementShortClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_GM_AssignedSkills_C_BndEvt__WBP_GM_AssignedSkills_Skill1_K2Node_ComponentBoundEvent_14_OnSkillElementShortClicked__DelegateSignature final
{
public:
	class UBP_DataAsset_Skill_C*                  SkillData;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GM_AssignedSkills_C_BndEvt__WBP_GM_AssignedSkills_Skill1_K2Node_ComponentBoundEvent_14_OnSkillElementShortClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_GM_AssignedSkills_C_BndEvt__WBP_GM_AssignedSkills_Skill1_K2Node_ComponentBoundEvent_14_OnSkillElementShortClicked__DelegateSignature");
static_assert(sizeof(WBP_GM_AssignedSkills_C_BndEvt__WBP_GM_AssignedSkills_Skill1_K2Node_ComponentBoundEvent_14_OnSkillElementShortClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_GM_AssignedSkills_C_BndEvt__WBP_GM_AssignedSkills_Skill1_K2Node_ComponentBoundEvent_14_OnSkillElementShortClicked__DelegateSignature");
static_assert(offsetof(WBP_GM_AssignedSkills_C_BndEvt__WBP_GM_AssignedSkills_Skill1_K2Node_ComponentBoundEvent_14_OnSkillElementShortClicked__DelegateSignature, SkillData) == 0x000000, "Member 'WBP_GM_AssignedSkills_C_BndEvt__WBP_GM_AssignedSkills_Skill1_K2Node_ComponentBoundEvent_14_OnSkillElementShortClicked__DelegateSignature::SkillData' has a wrong offset!");

// Function WBP_GM_AssignedSkills.WBP_GM_AssignedSkills_C.BndEvt__WBP_GM_AssignedSkills_Skill1_K2Node_ComponentBoundEvent_15_OnSkillElementShortFocused__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct WBP_GM_AssignedSkills_C_BndEvt__WBP_GM_AssignedSkills_Skill1_K2Node_ComponentBoundEvent_15_OnSkillElementShortFocused__DelegateSignature final
{
public:
	class UBP_DataAsset_Skill_C*                  SkillData;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              AbsolutePos;                                       // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GM_AssignedSkills_C_BndEvt__WBP_GM_AssignedSkills_Skill1_K2Node_ComponentBoundEvent_15_OnSkillElementShortFocused__DelegateSignature) == 0x000008, "Wrong alignment on WBP_GM_AssignedSkills_C_BndEvt__WBP_GM_AssignedSkills_Skill1_K2Node_ComponentBoundEvent_15_OnSkillElementShortFocused__DelegateSignature");
static_assert(sizeof(WBP_GM_AssignedSkills_C_BndEvt__WBP_GM_AssignedSkills_Skill1_K2Node_ComponentBoundEvent_15_OnSkillElementShortFocused__DelegateSignature) == 0x000018, "Wrong size on WBP_GM_AssignedSkills_C_BndEvt__WBP_GM_AssignedSkills_Skill1_K2Node_ComponentBoundEvent_15_OnSkillElementShortFocused__DelegateSignature");
static_assert(offsetof(WBP_GM_AssignedSkills_C_BndEvt__WBP_GM_AssignedSkills_Skill1_K2Node_ComponentBoundEvent_15_OnSkillElementShortFocused__DelegateSignature, SkillData) == 0x000000, "Member 'WBP_GM_AssignedSkills_C_BndEvt__WBP_GM_AssignedSkills_Skill1_K2Node_ComponentBoundEvent_15_OnSkillElementShortFocused__DelegateSignature::SkillData' has a wrong offset!");
static_assert(offsetof(WBP_GM_AssignedSkills_C_BndEvt__WBP_GM_AssignedSkills_Skill1_K2Node_ComponentBoundEvent_15_OnSkillElementShortFocused__DelegateSignature, AbsolutePos) == 0x000008, "Member 'WBP_GM_AssignedSkills_C_BndEvt__WBP_GM_AssignedSkills_Skill1_K2Node_ComponentBoundEvent_15_OnSkillElementShortFocused__DelegateSignature::AbsolutePos' has a wrong offset!");

// Function WBP_GM_AssignedSkills.WBP_GM_AssignedSkills_C.BndEvt__WBP_GM_AssignedSkills_Skill2_K2Node_ComponentBoundEvent_16_OnSkillElementShortClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_GM_AssignedSkills_C_BndEvt__WBP_GM_AssignedSkills_Skill2_K2Node_ComponentBoundEvent_16_OnSkillElementShortClicked__DelegateSignature final
{
public:
	class UBP_DataAsset_Skill_C*                  SkillData;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GM_AssignedSkills_C_BndEvt__WBP_GM_AssignedSkills_Skill2_K2Node_ComponentBoundEvent_16_OnSkillElementShortClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_GM_AssignedSkills_C_BndEvt__WBP_GM_AssignedSkills_Skill2_K2Node_ComponentBoundEvent_16_OnSkillElementShortClicked__DelegateSignature");
static_assert(sizeof(WBP_GM_AssignedSkills_C_BndEvt__WBP_GM_AssignedSkills_Skill2_K2Node_ComponentBoundEvent_16_OnSkillElementShortClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_GM_AssignedSkills_C_BndEvt__WBP_GM_AssignedSkills_Skill2_K2Node_ComponentBoundEvent_16_OnSkillElementShortClicked__DelegateSignature");
static_assert(offsetof(WBP_GM_AssignedSkills_C_BndEvt__WBP_GM_AssignedSkills_Skill2_K2Node_ComponentBoundEvent_16_OnSkillElementShortClicked__DelegateSignature, SkillData) == 0x000000, "Member 'WBP_GM_AssignedSkills_C_BndEvt__WBP_GM_AssignedSkills_Skill2_K2Node_ComponentBoundEvent_16_OnSkillElementShortClicked__DelegateSignature::SkillData' has a wrong offset!");

// Function WBP_GM_AssignedSkills.WBP_GM_AssignedSkills_C.BndEvt__WBP_GM_AssignedSkills_Skill2_K2Node_ComponentBoundEvent_17_OnSkillElementShortFocused__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct WBP_GM_AssignedSkills_C_BndEvt__WBP_GM_AssignedSkills_Skill2_K2Node_ComponentBoundEvent_17_OnSkillElementShortFocused__DelegateSignature final
{
public:
	class UBP_DataAsset_Skill_C*                  SkillData;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              AbsolutePos;                                       // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GM_AssignedSkills_C_BndEvt__WBP_GM_AssignedSkills_Skill2_K2Node_ComponentBoundEvent_17_OnSkillElementShortFocused__DelegateSignature) == 0x000008, "Wrong alignment on WBP_GM_AssignedSkills_C_BndEvt__WBP_GM_AssignedSkills_Skill2_K2Node_ComponentBoundEvent_17_OnSkillElementShortFocused__DelegateSignature");
static_assert(sizeof(WBP_GM_AssignedSkills_C_BndEvt__WBP_GM_AssignedSkills_Skill2_K2Node_ComponentBoundEvent_17_OnSkillElementShortFocused__DelegateSignature) == 0x000018, "Wrong size on WBP_GM_AssignedSkills_C_BndEvt__WBP_GM_AssignedSkills_Skill2_K2Node_ComponentBoundEvent_17_OnSkillElementShortFocused__DelegateSignature");
static_assert(offsetof(WBP_GM_AssignedSkills_C_BndEvt__WBP_GM_AssignedSkills_Skill2_K2Node_ComponentBoundEvent_17_OnSkillElementShortFocused__DelegateSignature, SkillData) == 0x000000, "Member 'WBP_GM_AssignedSkills_C_BndEvt__WBP_GM_AssignedSkills_Skill2_K2Node_ComponentBoundEvent_17_OnSkillElementShortFocused__DelegateSignature::SkillData' has a wrong offset!");
static_assert(offsetof(WBP_GM_AssignedSkills_C_BndEvt__WBP_GM_AssignedSkills_Skill2_K2Node_ComponentBoundEvent_17_OnSkillElementShortFocused__DelegateSignature, AbsolutePos) == 0x000008, "Member 'WBP_GM_AssignedSkills_C_BndEvt__WBP_GM_AssignedSkills_Skill2_K2Node_ComponentBoundEvent_17_OnSkillElementShortFocused__DelegateSignature::AbsolutePos' has a wrong offset!");

// Function WBP_GM_AssignedSkills.WBP_GM_AssignedSkills_C.BndEvt__WBP_GM_AssignedSkills_Skill3_K2Node_ComponentBoundEvent_18_OnSkillElementShortClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_GM_AssignedSkills_C_BndEvt__WBP_GM_AssignedSkills_Skill3_K2Node_ComponentBoundEvent_18_OnSkillElementShortClicked__DelegateSignature final
{
public:
	class UBP_DataAsset_Skill_C*                  SkillData;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GM_AssignedSkills_C_BndEvt__WBP_GM_AssignedSkills_Skill3_K2Node_ComponentBoundEvent_18_OnSkillElementShortClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_GM_AssignedSkills_C_BndEvt__WBP_GM_AssignedSkills_Skill3_K2Node_ComponentBoundEvent_18_OnSkillElementShortClicked__DelegateSignature");
static_assert(sizeof(WBP_GM_AssignedSkills_C_BndEvt__WBP_GM_AssignedSkills_Skill3_K2Node_ComponentBoundEvent_18_OnSkillElementShortClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_GM_AssignedSkills_C_BndEvt__WBP_GM_AssignedSkills_Skill3_K2Node_ComponentBoundEvent_18_OnSkillElementShortClicked__DelegateSignature");
static_assert(offsetof(WBP_GM_AssignedSkills_C_BndEvt__WBP_GM_AssignedSkills_Skill3_K2Node_ComponentBoundEvent_18_OnSkillElementShortClicked__DelegateSignature, SkillData) == 0x000000, "Member 'WBP_GM_AssignedSkills_C_BndEvt__WBP_GM_AssignedSkills_Skill3_K2Node_ComponentBoundEvent_18_OnSkillElementShortClicked__DelegateSignature::SkillData' has a wrong offset!");

// Function WBP_GM_AssignedSkills.WBP_GM_AssignedSkills_C.BndEvt__WBP_GM_AssignedSkills_Skill3_K2Node_ComponentBoundEvent_19_OnSkillElementShortFocused__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct WBP_GM_AssignedSkills_C_BndEvt__WBP_GM_AssignedSkills_Skill3_K2Node_ComponentBoundEvent_19_OnSkillElementShortFocused__DelegateSignature final
{
public:
	class UBP_DataAsset_Skill_C*                  SkillData;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              AbsolutePos;                                       // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GM_AssignedSkills_C_BndEvt__WBP_GM_AssignedSkills_Skill3_K2Node_ComponentBoundEvent_19_OnSkillElementShortFocused__DelegateSignature) == 0x000008, "Wrong alignment on WBP_GM_AssignedSkills_C_BndEvt__WBP_GM_AssignedSkills_Skill3_K2Node_ComponentBoundEvent_19_OnSkillElementShortFocused__DelegateSignature");
static_assert(sizeof(WBP_GM_AssignedSkills_C_BndEvt__WBP_GM_AssignedSkills_Skill3_K2Node_ComponentBoundEvent_19_OnSkillElementShortFocused__DelegateSignature) == 0x000018, "Wrong size on WBP_GM_AssignedSkills_C_BndEvt__WBP_GM_AssignedSkills_Skill3_K2Node_ComponentBoundEvent_19_OnSkillElementShortFocused__DelegateSignature");
static_assert(offsetof(WBP_GM_AssignedSkills_C_BndEvt__WBP_GM_AssignedSkills_Skill3_K2Node_ComponentBoundEvent_19_OnSkillElementShortFocused__DelegateSignature, SkillData) == 0x000000, "Member 'WBP_GM_AssignedSkills_C_BndEvt__WBP_GM_AssignedSkills_Skill3_K2Node_ComponentBoundEvent_19_OnSkillElementShortFocused__DelegateSignature::SkillData' has a wrong offset!");
static_assert(offsetof(WBP_GM_AssignedSkills_C_BndEvt__WBP_GM_AssignedSkills_Skill3_K2Node_ComponentBoundEvent_19_OnSkillElementShortFocused__DelegateSignature, AbsolutePos) == 0x000008, "Member 'WBP_GM_AssignedSkills_C_BndEvt__WBP_GM_AssignedSkills_Skill3_K2Node_ComponentBoundEvent_19_OnSkillElementShortFocused__DelegateSignature::AbsolutePos' has a wrong offset!");

// Function WBP_GM_AssignedSkills.WBP_GM_AssignedSkills_C.BndEvt__WBP_GM_AssignedSkills_Skill4_K2Node_ComponentBoundEvent_20_OnSkillElementShortClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_GM_AssignedSkills_C_BndEvt__WBP_GM_AssignedSkills_Skill4_K2Node_ComponentBoundEvent_20_OnSkillElementShortClicked__DelegateSignature final
{
public:
	class UBP_DataAsset_Skill_C*                  SkillData;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GM_AssignedSkills_C_BndEvt__WBP_GM_AssignedSkills_Skill4_K2Node_ComponentBoundEvent_20_OnSkillElementShortClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_GM_AssignedSkills_C_BndEvt__WBP_GM_AssignedSkills_Skill4_K2Node_ComponentBoundEvent_20_OnSkillElementShortClicked__DelegateSignature");
static_assert(sizeof(WBP_GM_AssignedSkills_C_BndEvt__WBP_GM_AssignedSkills_Skill4_K2Node_ComponentBoundEvent_20_OnSkillElementShortClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_GM_AssignedSkills_C_BndEvt__WBP_GM_AssignedSkills_Skill4_K2Node_ComponentBoundEvent_20_OnSkillElementShortClicked__DelegateSignature");
static_assert(offsetof(WBP_GM_AssignedSkills_C_BndEvt__WBP_GM_AssignedSkills_Skill4_K2Node_ComponentBoundEvent_20_OnSkillElementShortClicked__DelegateSignature, SkillData) == 0x000000, "Member 'WBP_GM_AssignedSkills_C_BndEvt__WBP_GM_AssignedSkills_Skill4_K2Node_ComponentBoundEvent_20_OnSkillElementShortClicked__DelegateSignature::SkillData' has a wrong offset!");

// Function WBP_GM_AssignedSkills.WBP_GM_AssignedSkills_C.BndEvt__WBP_GM_AssignedSkills_Skill4_K2Node_ComponentBoundEvent_21_OnSkillElementShortFocused__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct WBP_GM_AssignedSkills_C_BndEvt__WBP_GM_AssignedSkills_Skill4_K2Node_ComponentBoundEvent_21_OnSkillElementShortFocused__DelegateSignature final
{
public:
	class UBP_DataAsset_Skill_C*                  SkillData;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              AbsolutePos;                                       // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GM_AssignedSkills_C_BndEvt__WBP_GM_AssignedSkills_Skill4_K2Node_ComponentBoundEvent_21_OnSkillElementShortFocused__DelegateSignature) == 0x000008, "Wrong alignment on WBP_GM_AssignedSkills_C_BndEvt__WBP_GM_AssignedSkills_Skill4_K2Node_ComponentBoundEvent_21_OnSkillElementShortFocused__DelegateSignature");
static_assert(sizeof(WBP_GM_AssignedSkills_C_BndEvt__WBP_GM_AssignedSkills_Skill4_K2Node_ComponentBoundEvent_21_OnSkillElementShortFocused__DelegateSignature) == 0x000018, "Wrong size on WBP_GM_AssignedSkills_C_BndEvt__WBP_GM_AssignedSkills_Skill4_K2Node_ComponentBoundEvent_21_OnSkillElementShortFocused__DelegateSignature");
static_assert(offsetof(WBP_GM_AssignedSkills_C_BndEvt__WBP_GM_AssignedSkills_Skill4_K2Node_ComponentBoundEvent_21_OnSkillElementShortFocused__DelegateSignature, SkillData) == 0x000000, "Member 'WBP_GM_AssignedSkills_C_BndEvt__WBP_GM_AssignedSkills_Skill4_K2Node_ComponentBoundEvent_21_OnSkillElementShortFocused__DelegateSignature::SkillData' has a wrong offset!");
static_assert(offsetof(WBP_GM_AssignedSkills_C_BndEvt__WBP_GM_AssignedSkills_Skill4_K2Node_ComponentBoundEvent_21_OnSkillElementShortFocused__DelegateSignature, AbsolutePos) == 0x000008, "Member 'WBP_GM_AssignedSkills_C_BndEvt__WBP_GM_AssignedSkills_Skill4_K2Node_ComponentBoundEvent_21_OnSkillElementShortFocused__DelegateSignature::AbsolutePos' has a wrong offset!");

// Function WBP_GM_AssignedSkills.WBP_GM_AssignedSkills_C.BndEvt__WBP_GM_AssignedSkills_Skill5_K2Node_ComponentBoundEvent_22_OnSkillElementShortClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_GM_AssignedSkills_C_BndEvt__WBP_GM_AssignedSkills_Skill5_K2Node_ComponentBoundEvent_22_OnSkillElementShortClicked__DelegateSignature final
{
public:
	class UBP_DataAsset_Skill_C*                  SkillData;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GM_AssignedSkills_C_BndEvt__WBP_GM_AssignedSkills_Skill5_K2Node_ComponentBoundEvent_22_OnSkillElementShortClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_GM_AssignedSkills_C_BndEvt__WBP_GM_AssignedSkills_Skill5_K2Node_ComponentBoundEvent_22_OnSkillElementShortClicked__DelegateSignature");
static_assert(sizeof(WBP_GM_AssignedSkills_C_BndEvt__WBP_GM_AssignedSkills_Skill5_K2Node_ComponentBoundEvent_22_OnSkillElementShortClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_GM_AssignedSkills_C_BndEvt__WBP_GM_AssignedSkills_Skill5_K2Node_ComponentBoundEvent_22_OnSkillElementShortClicked__DelegateSignature");
static_assert(offsetof(WBP_GM_AssignedSkills_C_BndEvt__WBP_GM_AssignedSkills_Skill5_K2Node_ComponentBoundEvent_22_OnSkillElementShortClicked__DelegateSignature, SkillData) == 0x000000, "Member 'WBP_GM_AssignedSkills_C_BndEvt__WBP_GM_AssignedSkills_Skill5_K2Node_ComponentBoundEvent_22_OnSkillElementShortClicked__DelegateSignature::SkillData' has a wrong offset!");

// Function WBP_GM_AssignedSkills.WBP_GM_AssignedSkills_C.BndEvt__WBP_GM_AssignedSkills_Skill5_K2Node_ComponentBoundEvent_23_OnSkillElementShortFocused__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct WBP_GM_AssignedSkills_C_BndEvt__WBP_GM_AssignedSkills_Skill5_K2Node_ComponentBoundEvent_23_OnSkillElementShortFocused__DelegateSignature final
{
public:
	class UBP_DataAsset_Skill_C*                  SkillData;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              AbsolutePos;                                       // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GM_AssignedSkills_C_BndEvt__WBP_GM_AssignedSkills_Skill5_K2Node_ComponentBoundEvent_23_OnSkillElementShortFocused__DelegateSignature) == 0x000008, "Wrong alignment on WBP_GM_AssignedSkills_C_BndEvt__WBP_GM_AssignedSkills_Skill5_K2Node_ComponentBoundEvent_23_OnSkillElementShortFocused__DelegateSignature");
static_assert(sizeof(WBP_GM_AssignedSkills_C_BndEvt__WBP_GM_AssignedSkills_Skill5_K2Node_ComponentBoundEvent_23_OnSkillElementShortFocused__DelegateSignature) == 0x000018, "Wrong size on WBP_GM_AssignedSkills_C_BndEvt__WBP_GM_AssignedSkills_Skill5_K2Node_ComponentBoundEvent_23_OnSkillElementShortFocused__DelegateSignature");
static_assert(offsetof(WBP_GM_AssignedSkills_C_BndEvt__WBP_GM_AssignedSkills_Skill5_K2Node_ComponentBoundEvent_23_OnSkillElementShortFocused__DelegateSignature, SkillData) == 0x000000, "Member 'WBP_GM_AssignedSkills_C_BndEvt__WBP_GM_AssignedSkills_Skill5_K2Node_ComponentBoundEvent_23_OnSkillElementShortFocused__DelegateSignature::SkillData' has a wrong offset!");
static_assert(offsetof(WBP_GM_AssignedSkills_C_BndEvt__WBP_GM_AssignedSkills_Skill5_K2Node_ComponentBoundEvent_23_OnSkillElementShortFocused__DelegateSignature, AbsolutePos) == 0x000008, "Member 'WBP_GM_AssignedSkills_C_BndEvt__WBP_GM_AssignedSkills_Skill5_K2Node_ComponentBoundEvent_23_OnSkillElementShortFocused__DelegateSignature::AbsolutePos' has a wrong offset!");

// Function WBP_GM_AssignedSkills.WBP_GM_AssignedSkills_C.ExecuteUbergraph_WBP_GM_AssignedSkills
// 0x0158 (0x0158 - 0x0000)
struct WBP_GM_AssignedSkills_C_ExecuteUbergraph_WBP_GM_AssignedSkills final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_DataAsset_Skill_C*                  K2Node_ComponentBoundEvent_SkillData;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_ComponentBoundEvent_AbsolutePos;            // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWBP_GM_SkillElementShort_C*>    K2Node_MakeArray_Array;                            // 0x0038(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWBP_GM_SkillElementShort_C*            CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSlotIndex_SlotIndex;                   // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_DataAsset_Skill_C*                  K2Node_ComponentBoundEvent_SkillData_11;           // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UWBP_GM_SkillElementShort_C*>    K2Node_MakeArray_Array_1;                          // 0x0070(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UBP_DataAsset_Skill_C*                  K2Node_ComponentBoundEvent_SkillData_10;           // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_ComponentBoundEvent_AbsolutePos_5;          // 0x0088(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_GM_SkillElementShort_C*            CallFunc_Array_Get_Item_1;                         // 0x0098(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_DataAsset_Skill_C*                  K2Node_ComponentBoundEvent_SkillData_9;            // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_DataAsset_Skill_C*                  K2Node_ComponentBoundEvent_SkillData_8;            // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_ComponentBoundEvent_AbsolutePos_4;          // 0x00C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_DataAsset_Skill_C*                  K2Node_ComponentBoundEvent_SkillData_7;            // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_DataAsset_Skill_C*                  K2Node_ComponentBoundEvent_SkillData_6;            // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_ComponentBoundEvent_AbsolutePos_3;          // 0x00E8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_DataAsset_Skill_C*                  K2Node_ComponentBoundEvent_SkillData_5;            // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_DataAsset_Skill_C*                  K2Node_ComponentBoundEvent_SkillData_4;            // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_ComponentBoundEvent_AbsolutePos_2;          // 0x0110(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_DataAsset_Skill_C*                  K2Node_ComponentBoundEvent_SkillData_3;            // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_DataAsset_Skill_C*                  K2Node_ComponentBoundEvent_SkillData_2;            // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_ComponentBoundEvent_AbsolutePos_1;          // 0x0138(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_DataAsset_Skill_C*                  K2Node_ComponentBoundEvent_SkillData_1;            // 0x0148(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GM_AssignedSkills_C_ExecuteUbergraph_WBP_GM_AssignedSkills) == 0x000008, "Wrong alignment on WBP_GM_AssignedSkills_C_ExecuteUbergraph_WBP_GM_AssignedSkills");
static_assert(sizeof(WBP_GM_AssignedSkills_C_ExecuteUbergraph_WBP_GM_AssignedSkills) == 0x000158, "Wrong size on WBP_GM_AssignedSkills_C_ExecuteUbergraph_WBP_GM_AssignedSkills");
static_assert(offsetof(WBP_GM_AssignedSkills_C_ExecuteUbergraph_WBP_GM_AssignedSkills, EntryPoint) == 0x000000, "Member 'WBP_GM_AssignedSkills_C_ExecuteUbergraph_WBP_GM_AssignedSkills::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_GM_AssignedSkills_C_ExecuteUbergraph_WBP_GM_AssignedSkills, K2Node_ComponentBoundEvent_SkillData) == 0x000008, "Member 'WBP_GM_AssignedSkills_C_ExecuteUbergraph_WBP_GM_AssignedSkills::K2Node_ComponentBoundEvent_SkillData' has a wrong offset!");
static_assert(offsetof(WBP_GM_AssignedSkills_C_ExecuteUbergraph_WBP_GM_AssignedSkills, K2Node_ComponentBoundEvent_AbsolutePos) == 0x000010, "Member 'WBP_GM_AssignedSkills_C_ExecuteUbergraph_WBP_GM_AssignedSkills::K2Node_ComponentBoundEvent_AbsolutePos' has a wrong offset!");
static_assert(offsetof(WBP_GM_AssignedSkills_C_ExecuteUbergraph_WBP_GM_AssignedSkills, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'WBP_GM_AssignedSkills_C_ExecuteUbergraph_WBP_GM_AssignedSkills::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GM_AssignedSkills_C_ExecuteUbergraph_WBP_GM_AssignedSkills, Temp_int_Loop_Counter_Variable) == 0x000024, "Member 'WBP_GM_AssignedSkills_C_ExecuteUbergraph_WBP_GM_AssignedSkills::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GM_AssignedSkills_C_ExecuteUbergraph_WBP_GM_AssignedSkills, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'WBP_GM_AssignedSkills_C_ExecuteUbergraph_WBP_GM_AssignedSkills::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GM_AssignedSkills_C_ExecuteUbergraph_WBP_GM_AssignedSkills, Temp_int_Array_Index_Variable) == 0x00002C, "Member 'WBP_GM_AssignedSkills_C_ExecuteUbergraph_WBP_GM_AssignedSkills::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GM_AssignedSkills_C_ExecuteUbergraph_WBP_GM_AssignedSkills, Temp_int_Array_Index_Variable_1) == 0x000030, "Member 'WBP_GM_AssignedSkills_C_ExecuteUbergraph_WBP_GM_AssignedSkills::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_GM_AssignedSkills_C_ExecuteUbergraph_WBP_GM_AssignedSkills, Temp_int_Loop_Counter_Variable_1) == 0x000034, "Member 'WBP_GM_AssignedSkills_C_ExecuteUbergraph_WBP_GM_AssignedSkills::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_GM_AssignedSkills_C_ExecuteUbergraph_WBP_GM_AssignedSkills, K2Node_MakeArray_Array) == 0x000038, "Member 'WBP_GM_AssignedSkills_C_ExecuteUbergraph_WBP_GM_AssignedSkills::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_GM_AssignedSkills_C_ExecuteUbergraph_WBP_GM_AssignedSkills, CallFunc_Array_Get_Item) == 0x000048, "Member 'WBP_GM_AssignedSkills_C_ExecuteUbergraph_WBP_GM_AssignedSkills::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_GM_AssignedSkills_C_ExecuteUbergraph_WBP_GM_AssignedSkills, CallFunc_Array_Length_ReturnValue) == 0x000050, "Member 'WBP_GM_AssignedSkills_C_ExecuteUbergraph_WBP_GM_AssignedSkills::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GM_AssignedSkills_C_ExecuteUbergraph_WBP_GM_AssignedSkills, CallFunc_GetSlotIndex_SlotIndex) == 0x000054, "Member 'WBP_GM_AssignedSkills_C_ExecuteUbergraph_WBP_GM_AssignedSkills::CallFunc_GetSlotIndex_SlotIndex' has a wrong offset!");
static_assert(offsetof(WBP_GM_AssignedSkills_C_ExecuteUbergraph_WBP_GM_AssignedSkills, CallFunc_Less_IntInt_ReturnValue) == 0x000058, "Member 'WBP_GM_AssignedSkills_C_ExecuteUbergraph_WBP_GM_AssignedSkills::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GM_AssignedSkills_C_ExecuteUbergraph_WBP_GM_AssignedSkills, CallFunc_Add_IntInt_ReturnValue_1) == 0x00005C, "Member 'WBP_GM_AssignedSkills_C_ExecuteUbergraph_WBP_GM_AssignedSkills::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_GM_AssignedSkills_C_ExecuteUbergraph_WBP_GM_AssignedSkills, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000060, "Member 'WBP_GM_AssignedSkills_C_ExecuteUbergraph_WBP_GM_AssignedSkills::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GM_AssignedSkills_C_ExecuteUbergraph_WBP_GM_AssignedSkills, K2Node_ComponentBoundEvent_SkillData_11) == 0x000068, "Member 'WBP_GM_AssignedSkills_C_ExecuteUbergraph_WBP_GM_AssignedSkills::K2Node_ComponentBoundEvent_SkillData_11' has a wrong offset!");
static_assert(offsetof(WBP_GM_AssignedSkills_C_ExecuteUbergraph_WBP_GM_AssignedSkills, K2Node_MakeArray_Array_1) == 0x000070, "Member 'WBP_GM_AssignedSkills_C_ExecuteUbergraph_WBP_GM_AssignedSkills::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(WBP_GM_AssignedSkills_C_ExecuteUbergraph_WBP_GM_AssignedSkills, K2Node_ComponentBoundEvent_SkillData_10) == 0x000080, "Member 'WBP_GM_AssignedSkills_C_ExecuteUbergraph_WBP_GM_AssignedSkills::K2Node_ComponentBoundEvent_SkillData_10' has a wrong offset!");
static_assert(offsetof(WBP_GM_AssignedSkills_C_ExecuteUbergraph_WBP_GM_AssignedSkills, K2Node_ComponentBoundEvent_AbsolutePos_5) == 0x000088, "Member 'WBP_GM_AssignedSkills_C_ExecuteUbergraph_WBP_GM_AssignedSkills::K2Node_ComponentBoundEvent_AbsolutePos_5' has a wrong offset!");
static_assert(offsetof(WBP_GM_AssignedSkills_C_ExecuteUbergraph_WBP_GM_AssignedSkills, CallFunc_Array_Get_Item_1) == 0x000098, "Member 'WBP_GM_AssignedSkills_C_ExecuteUbergraph_WBP_GM_AssignedSkills::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_GM_AssignedSkills_C_ExecuteUbergraph_WBP_GM_AssignedSkills, CallFunc_IsValid_ReturnValue_1) == 0x0000A0, "Member 'WBP_GM_AssignedSkills_C_ExecuteUbergraph_WBP_GM_AssignedSkills::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_GM_AssignedSkills_C_ExecuteUbergraph_WBP_GM_AssignedSkills, CallFunc_Array_Length_ReturnValue_1) == 0x0000A4, "Member 'WBP_GM_AssignedSkills_C_ExecuteUbergraph_WBP_GM_AssignedSkills::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_GM_AssignedSkills_C_ExecuteUbergraph_WBP_GM_AssignedSkills, K2Node_ComponentBoundEvent_SkillData_9) == 0x0000A8, "Member 'WBP_GM_AssignedSkills_C_ExecuteUbergraph_WBP_GM_AssignedSkills::K2Node_ComponentBoundEvent_SkillData_9' has a wrong offset!");
static_assert(offsetof(WBP_GM_AssignedSkills_C_ExecuteUbergraph_WBP_GM_AssignedSkills, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000B0, "Member 'WBP_GM_AssignedSkills_C_ExecuteUbergraph_WBP_GM_AssignedSkills::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_GM_AssignedSkills_C_ExecuteUbergraph_WBP_GM_AssignedSkills, K2Node_ComponentBoundEvent_SkillData_8) == 0x0000B8, "Member 'WBP_GM_AssignedSkills_C_ExecuteUbergraph_WBP_GM_AssignedSkills::K2Node_ComponentBoundEvent_SkillData_8' has a wrong offset!");
static_assert(offsetof(WBP_GM_AssignedSkills_C_ExecuteUbergraph_WBP_GM_AssignedSkills, K2Node_ComponentBoundEvent_AbsolutePos_4) == 0x0000C0, "Member 'WBP_GM_AssignedSkills_C_ExecuteUbergraph_WBP_GM_AssignedSkills::K2Node_ComponentBoundEvent_AbsolutePos_4' has a wrong offset!");
static_assert(offsetof(WBP_GM_AssignedSkills_C_ExecuteUbergraph_WBP_GM_AssignedSkills, CallFunc_IsValid_ReturnValue_2) == 0x0000D0, "Member 'WBP_GM_AssignedSkills_C_ExecuteUbergraph_WBP_GM_AssignedSkills::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_GM_AssignedSkills_C_ExecuteUbergraph_WBP_GM_AssignedSkills, K2Node_ComponentBoundEvent_SkillData_7) == 0x0000D8, "Member 'WBP_GM_AssignedSkills_C_ExecuteUbergraph_WBP_GM_AssignedSkills::K2Node_ComponentBoundEvent_SkillData_7' has a wrong offset!");
static_assert(offsetof(WBP_GM_AssignedSkills_C_ExecuteUbergraph_WBP_GM_AssignedSkills, K2Node_ComponentBoundEvent_SkillData_6) == 0x0000E0, "Member 'WBP_GM_AssignedSkills_C_ExecuteUbergraph_WBP_GM_AssignedSkills::K2Node_ComponentBoundEvent_SkillData_6' has a wrong offset!");
static_assert(offsetof(WBP_GM_AssignedSkills_C_ExecuteUbergraph_WBP_GM_AssignedSkills, K2Node_ComponentBoundEvent_AbsolutePos_3) == 0x0000E8, "Member 'WBP_GM_AssignedSkills_C_ExecuteUbergraph_WBP_GM_AssignedSkills::K2Node_ComponentBoundEvent_AbsolutePos_3' has a wrong offset!");
static_assert(offsetof(WBP_GM_AssignedSkills_C_ExecuteUbergraph_WBP_GM_AssignedSkills, K2Node_ComponentBoundEvent_SkillData_5) == 0x0000F8, "Member 'WBP_GM_AssignedSkills_C_ExecuteUbergraph_WBP_GM_AssignedSkills::K2Node_ComponentBoundEvent_SkillData_5' has a wrong offset!");
static_assert(offsetof(WBP_GM_AssignedSkills_C_ExecuteUbergraph_WBP_GM_AssignedSkills, CallFunc_IsValid_ReturnValue_3) == 0x000100, "Member 'WBP_GM_AssignedSkills_C_ExecuteUbergraph_WBP_GM_AssignedSkills::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_GM_AssignedSkills_C_ExecuteUbergraph_WBP_GM_AssignedSkills, K2Node_ComponentBoundEvent_SkillData_4) == 0x000108, "Member 'WBP_GM_AssignedSkills_C_ExecuteUbergraph_WBP_GM_AssignedSkills::K2Node_ComponentBoundEvent_SkillData_4' has a wrong offset!");
static_assert(offsetof(WBP_GM_AssignedSkills_C_ExecuteUbergraph_WBP_GM_AssignedSkills, K2Node_ComponentBoundEvent_AbsolutePos_2) == 0x000110, "Member 'WBP_GM_AssignedSkills_C_ExecuteUbergraph_WBP_GM_AssignedSkills::K2Node_ComponentBoundEvent_AbsolutePos_2' has a wrong offset!");
static_assert(offsetof(WBP_GM_AssignedSkills_C_ExecuteUbergraph_WBP_GM_AssignedSkills, CallFunc_IsValid_ReturnValue_4) == 0x000120, "Member 'WBP_GM_AssignedSkills_C_ExecuteUbergraph_WBP_GM_AssignedSkills::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_GM_AssignedSkills_C_ExecuteUbergraph_WBP_GM_AssignedSkills, K2Node_ComponentBoundEvent_SkillData_3) == 0x000128, "Member 'WBP_GM_AssignedSkills_C_ExecuteUbergraph_WBP_GM_AssignedSkills::K2Node_ComponentBoundEvent_SkillData_3' has a wrong offset!");
static_assert(offsetof(WBP_GM_AssignedSkills_C_ExecuteUbergraph_WBP_GM_AssignedSkills, K2Node_ComponentBoundEvent_SkillData_2) == 0x000130, "Member 'WBP_GM_AssignedSkills_C_ExecuteUbergraph_WBP_GM_AssignedSkills::K2Node_ComponentBoundEvent_SkillData_2' has a wrong offset!");
static_assert(offsetof(WBP_GM_AssignedSkills_C_ExecuteUbergraph_WBP_GM_AssignedSkills, K2Node_ComponentBoundEvent_AbsolutePos_1) == 0x000138, "Member 'WBP_GM_AssignedSkills_C_ExecuteUbergraph_WBP_GM_AssignedSkills::K2Node_ComponentBoundEvent_AbsolutePos_1' has a wrong offset!");
static_assert(offsetof(WBP_GM_AssignedSkills_C_ExecuteUbergraph_WBP_GM_AssignedSkills, K2Node_ComponentBoundEvent_SkillData_1) == 0x000148, "Member 'WBP_GM_AssignedSkills_C_ExecuteUbergraph_WBP_GM_AssignedSkills::K2Node_ComponentBoundEvent_SkillData_1' has a wrong offset!");
static_assert(offsetof(WBP_GM_AssignedSkills_C_ExecuteUbergraph_WBP_GM_AssignedSkills, CallFunc_IsValid_ReturnValue_5) == 0x000150, "Member 'WBP_GM_AssignedSkills_C_ExecuteUbergraph_WBP_GM_AssignedSkills::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");

// Function WBP_GM_AssignedSkills.WBP_GM_AssignedSkills_C.InitializeSlotsData
// 0x0058 (0x0058 - 0x0000)
struct WBP_GM_AssignedSkills_C_InitializeSlotsData final
{
public:
	TArray<class UBP_DataAsset_Skill_C*>          InSkillsData;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_DataAsset_Skill_C*                  CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23[0x1];                                       // 0x0023(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWBP_GM_SkillElementShort_C*>    K2Node_MakeArray_Array;                            // 0x0030(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_GM_SkillElementShort_C*            CallFunc_Array_Get_Item_1;                         // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GM_AssignedSkills_C_InitializeSlotsData) == 0x000008, "Wrong alignment on WBP_GM_AssignedSkills_C_InitializeSlotsData");
static_assert(sizeof(WBP_GM_AssignedSkills_C_InitializeSlotsData) == 0x000058, "Wrong size on WBP_GM_AssignedSkills_C_InitializeSlotsData");
static_assert(offsetof(WBP_GM_AssignedSkills_C_InitializeSlotsData, InSkillsData) == 0x000000, "Member 'WBP_GM_AssignedSkills_C_InitializeSlotsData::InSkillsData' has a wrong offset!");
static_assert(offsetof(WBP_GM_AssignedSkills_C_InitializeSlotsData, Temp_int_Array_Index_Variable) == 0x000010, "Member 'WBP_GM_AssignedSkills_C_InitializeSlotsData::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GM_AssignedSkills_C_InitializeSlotsData, CallFunc_Array_Get_Item) == 0x000018, "Member 'WBP_GM_AssignedSkills_C_InitializeSlotsData::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_GM_AssignedSkills_C_InitializeSlotsData, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000020, "Member 'WBP_GM_AssignedSkills_C_InitializeSlotsData::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GM_AssignedSkills_C_InitializeSlotsData, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000021, "Member 'WBP_GM_AssignedSkills_C_InitializeSlotsData::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GM_AssignedSkills_C_InitializeSlotsData, CallFunc_IsValid_ReturnValue) == 0x000022, "Member 'WBP_GM_AssignedSkills_C_InitializeSlotsData::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GM_AssignedSkills_C_InitializeSlotsData, Temp_int_Loop_Counter_Variable) == 0x000024, "Member 'WBP_GM_AssignedSkills_C_InitializeSlotsData::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GM_AssignedSkills_C_InitializeSlotsData, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'WBP_GM_AssignedSkills_C_InitializeSlotsData::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GM_AssignedSkills_C_InitializeSlotsData, K2Node_MakeArray_Array) == 0x000030, "Member 'WBP_GM_AssignedSkills_C_InitializeSlotsData::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_GM_AssignedSkills_C_InitializeSlotsData, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'WBP_GM_AssignedSkills_C_InitializeSlotsData::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GM_AssignedSkills_C_InitializeSlotsData, CallFunc_Array_Get_Item_1) == 0x000048, "Member 'WBP_GM_AssignedSkills_C_InitializeSlotsData::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_GM_AssignedSkills_C_InitializeSlotsData, CallFunc_Less_IntInt_ReturnValue) == 0x000050, "Member 'WBP_GM_AssignedSkills_C_InitializeSlotsData::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_GM_AssignedSkills.WBP_GM_AssignedSkills_C.InstantReset
// 0x0038 (0x0038 - 0x0000)
struct WBP_GM_AssignedSkills_C_InstantReset final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWBP_GM_SkillElementShort_C*>    K2Node_MakeArray_Array;                            // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_GM_SkillElementShort_C*            CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GM_AssignedSkills_C_InstantReset) == 0x000008, "Wrong alignment on WBP_GM_AssignedSkills_C_InstantReset");
static_assert(sizeof(WBP_GM_AssignedSkills_C_InstantReset) == 0x000038, "Wrong size on WBP_GM_AssignedSkills_C_InstantReset");
static_assert(offsetof(WBP_GM_AssignedSkills_C_InstantReset, Temp_int_Array_Index_Variable) == 0x000000, "Member 'WBP_GM_AssignedSkills_C_InstantReset::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GM_AssignedSkills_C_InstantReset, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'WBP_GM_AssignedSkills_C_InstantReset::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GM_AssignedSkills_C_InstantReset, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'WBP_GM_AssignedSkills_C_InstantReset::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GM_AssignedSkills_C_InstantReset, K2Node_MakeArray_Array) == 0x000010, "Member 'WBP_GM_AssignedSkills_C_InstantReset::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_GM_AssignedSkills_C_InstantReset, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'WBP_GM_AssignedSkills_C_InstantReset::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GM_AssignedSkills_C_InstantReset, CallFunc_Array_Get_Item) == 0x000028, "Member 'WBP_GM_AssignedSkills_C_InstantReset::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_GM_AssignedSkills_C_InstantReset, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'WBP_GM_AssignedSkills_C_InstantReset::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_GM_AssignedSkills.WBP_GM_AssignedSkills_C.RefreshSlotData
// 0x0050 (0x0050 - 0x0000)
struct WBP_GM_AssignedSkills_C_RefreshSlotData final
{
public:
	class UBP_DataAsset_Skill_C*                  SkillData;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         SlotIndex;                                         // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWBP_GM_SkillElementShort_C*>    K2Node_MakeArray_Array;                            // 0x0020(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_GM_SkillElementShort_C*            CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetSlotIndex_SlotIndex;                   // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GM_AssignedSkills_C_RefreshSlotData) == 0x000008, "Wrong alignment on WBP_GM_AssignedSkills_C_RefreshSlotData");
static_assert(sizeof(WBP_GM_AssignedSkills_C_RefreshSlotData) == 0x000050, "Wrong size on WBP_GM_AssignedSkills_C_RefreshSlotData");
static_assert(offsetof(WBP_GM_AssignedSkills_C_RefreshSlotData, SkillData) == 0x000000, "Member 'WBP_GM_AssignedSkills_C_RefreshSlotData::SkillData' has a wrong offset!");
static_assert(offsetof(WBP_GM_AssignedSkills_C_RefreshSlotData, SlotIndex) == 0x000008, "Member 'WBP_GM_AssignedSkills_C_RefreshSlotData::SlotIndex' has a wrong offset!");
static_assert(offsetof(WBP_GM_AssignedSkills_C_RefreshSlotData, Temp_bool_True_if_break_was_hit_Variable) == 0x00000C, "Member 'WBP_GM_AssignedSkills_C_RefreshSlotData::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GM_AssignedSkills_C_RefreshSlotData, Temp_int_Array_Index_Variable) == 0x000010, "Member 'WBP_GM_AssignedSkills_C_RefreshSlotData::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GM_AssignedSkills_C_RefreshSlotData, CallFunc_Not_PreBool_ReturnValue) == 0x000014, "Member 'WBP_GM_AssignedSkills_C_RefreshSlotData::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GM_AssignedSkills_C_RefreshSlotData, Temp_int_Loop_Counter_Variable) == 0x000018, "Member 'WBP_GM_AssignedSkills_C_RefreshSlotData::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GM_AssignedSkills_C_RefreshSlotData, CallFunc_Add_IntInt_ReturnValue) == 0x00001C, "Member 'WBP_GM_AssignedSkills_C_RefreshSlotData::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GM_AssignedSkills_C_RefreshSlotData, K2Node_MakeArray_Array) == 0x000020, "Member 'WBP_GM_AssignedSkills_C_RefreshSlotData::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_GM_AssignedSkills_C_RefreshSlotData, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'WBP_GM_AssignedSkills_C_RefreshSlotData::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GM_AssignedSkills_C_RefreshSlotData, CallFunc_Array_Get_Item) == 0x000038, "Member 'WBP_GM_AssignedSkills_C_RefreshSlotData::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_GM_AssignedSkills_C_RefreshSlotData, CallFunc_Less_IntInt_ReturnValue) == 0x000040, "Member 'WBP_GM_AssignedSkills_C_RefreshSlotData::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GM_AssignedSkills_C_RefreshSlotData, CallFunc_GetSlotIndex_SlotIndex) == 0x000044, "Member 'WBP_GM_AssignedSkills_C_RefreshSlotData::CallFunc_GetSlotIndex_SlotIndex' has a wrong offset!");
static_assert(offsetof(WBP_GM_AssignedSkills_C_RefreshSlotData, CallFunc_BooleanAND_ReturnValue) == 0x000048, "Member 'WBP_GM_AssignedSkills_C_RefreshSlotData::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GM_AssignedSkills_C_RefreshSlotData, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000049, "Member 'WBP_GM_AssignedSkills_C_RefreshSlotData::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_GM_AssignedSkills.WBP_GM_AssignedSkills_C.SetFocusedSlot
// 0x0008 (0x0008 - 0x0000)
struct WBP_GM_AssignedSkills_C_SetFocusedSlot final
{
public:
	class UWBP_GM_SkillElementShort_C*            FocusedSlot_0;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GM_AssignedSkills_C_SetFocusedSlot) == 0x000008, "Wrong alignment on WBP_GM_AssignedSkills_C_SetFocusedSlot");
static_assert(sizeof(WBP_GM_AssignedSkills_C_SetFocusedSlot) == 0x000008, "Wrong size on WBP_GM_AssignedSkills_C_SetFocusedSlot");
