#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Settings_OptionEntriesHeader

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function WBP_Settings_OptionEntriesHeader.WBP_Settings_OptionEntriesHeader_C.UpdateSettingsContext
// 0x0028 (0x0028 - 0x0000)
struct WBP_Settings_OptionEntriesHeader_C_UpdateSettingsContext final
{
public:
	struct FGameplayTag                           NewContext;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Settings_OptionEntry_C*            CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_OptionEntriesHeader_C_UpdateSettingsContext) == 0x000008, "Wrong alignment on WBP_Settings_OptionEntriesHeader_C_UpdateSettingsContext");
static_assert(sizeof(WBP_Settings_OptionEntriesHeader_C_UpdateSettingsContext) == 0x000028, "Wrong size on WBP_Settings_OptionEntriesHeader_C_UpdateSettingsContext");
static_assert(offsetof(WBP_Settings_OptionEntriesHeader_C_UpdateSettingsContext, NewContext) == 0x000000, "Member 'WBP_Settings_OptionEntriesHeader_C_UpdateSettingsContext::NewContext' has a wrong offset!");
static_assert(offsetof(WBP_Settings_OptionEntriesHeader_C_UpdateSettingsContext, Temp_int_Array_Index_Variable) == 0x000008, "Member 'WBP_Settings_OptionEntriesHeader_C_UpdateSettingsContext::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Settings_OptionEntriesHeader_C_UpdateSettingsContext, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'WBP_Settings_OptionEntriesHeader_C_UpdateSettingsContext::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Settings_OptionEntriesHeader_C_UpdateSettingsContext, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'WBP_Settings_OptionEntriesHeader_C_UpdateSettingsContext::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_OptionEntriesHeader_C_UpdateSettingsContext, CallFunc_Array_Length_ReturnValue) == 0x000014, "Member 'WBP_Settings_OptionEntriesHeader_C_UpdateSettingsContext::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_OptionEntriesHeader_C_UpdateSettingsContext, CallFunc_Array_Get_Item) == 0x000018, "Member 'WBP_Settings_OptionEntriesHeader_C_UpdateSettingsContext::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Settings_OptionEntriesHeader_C_UpdateSettingsContext, CallFunc_Less_IntInt_ReturnValue) == 0x000020, "Member 'WBP_Settings_OptionEntriesHeader_C_UpdateSettingsContext::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_Settings_OptionEntriesHeader.WBP_Settings_OptionEntriesHeader_C.SetHeaderName
// 0x0010 (0x0010 - 0x0000)
struct WBP_Settings_OptionEntriesHeader_C_SetHeaderName final
{
public:
	class FText                                   HeaderName_0;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_Settings_OptionEntriesHeader_C_SetHeaderName) == 0x000008, "Wrong alignment on WBP_Settings_OptionEntriesHeader_C_SetHeaderName");
static_assert(sizeof(WBP_Settings_OptionEntriesHeader_C_SetHeaderName) == 0x000010, "Wrong size on WBP_Settings_OptionEntriesHeader_C_SetHeaderName");
static_assert(offsetof(WBP_Settings_OptionEntriesHeader_C_SetHeaderName, HeaderName_0) == 0x000000, "Member 'WBP_Settings_OptionEntriesHeader_C_SetHeaderName::HeaderName_0' has a wrong offset!");

// Function WBP_Settings_OptionEntriesHeader.WBP_Settings_OptionEntriesHeader_C.InitHeaderAndChildEntries
// 0x0068 (0x0068 - 0x0000)
struct WBP_Settings_OptionEntriesHeader_C_InitHeaderAndChildEntries final
{
public:
	bool                                          IsAvailable;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           PlatformNameAsTag;                                 // 0x0004(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	bool                                          HasEntries;                                        // 0x000C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_jRPG_GI_Custom_C*                   CallFunc_GetCustomGI_ReturnValue;                  // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTag& NewContext)> K2Node_CreateDelegate_OutputDelegate;     // 0x0028(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_jRPG_GI_Custom_C*                   CallFunc_GetCustomGI_ReturnValue_1;                // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_GetSettingsPageContext_CurrentContext;    // 0x0040(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_GetPlatformNameAsTag_ReturnValue;         // 0x0048(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Settings_OptionEntry_C*            CallFunc_Array_Get_Item;                           // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAvailableOnCurrentPlatform_IsAvailable; // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_OptionEntriesHeader_C_InitHeaderAndChildEntries) == 0x000008, "Wrong alignment on WBP_Settings_OptionEntriesHeader_C_InitHeaderAndChildEntries");
static_assert(sizeof(WBP_Settings_OptionEntriesHeader_C_InitHeaderAndChildEntries) == 0x000068, "Wrong size on WBP_Settings_OptionEntriesHeader_C_InitHeaderAndChildEntries");
static_assert(offsetof(WBP_Settings_OptionEntriesHeader_C_InitHeaderAndChildEntries, IsAvailable) == 0x000000, "Member 'WBP_Settings_OptionEntriesHeader_C_InitHeaderAndChildEntries::IsAvailable' has a wrong offset!");
static_assert(offsetof(WBP_Settings_OptionEntriesHeader_C_InitHeaderAndChildEntries, PlatformNameAsTag) == 0x000004, "Member 'WBP_Settings_OptionEntriesHeader_C_InitHeaderAndChildEntries::PlatformNameAsTag' has a wrong offset!");
static_assert(offsetof(WBP_Settings_OptionEntriesHeader_C_InitHeaderAndChildEntries, HasEntries) == 0x00000C, "Member 'WBP_Settings_OptionEntriesHeader_C_InitHeaderAndChildEntries::HasEntries' has a wrong offset!");
static_assert(offsetof(WBP_Settings_OptionEntriesHeader_C_InitHeaderAndChildEntries, Temp_int_Array_Index_Variable) == 0x000010, "Member 'WBP_Settings_OptionEntriesHeader_C_InitHeaderAndChildEntries::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Settings_OptionEntriesHeader_C_InitHeaderAndChildEntries, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'WBP_Settings_OptionEntriesHeader_C_InitHeaderAndChildEntries::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Settings_OptionEntriesHeader_C_InitHeaderAndChildEntries, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'WBP_Settings_OptionEntriesHeader_C_InitHeaderAndChildEntries::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_OptionEntriesHeader_C_InitHeaderAndChildEntries, CallFunc_GetCustomGI_ReturnValue) == 0x000020, "Member 'WBP_Settings_OptionEntriesHeader_C_InitHeaderAndChildEntries::CallFunc_GetCustomGI_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_OptionEntriesHeader_C_InitHeaderAndChildEntries, K2Node_CreateDelegate_OutputDelegate) == 0x000028, "Member 'WBP_Settings_OptionEntriesHeader_C_InitHeaderAndChildEntries::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Settings_OptionEntriesHeader_C_InitHeaderAndChildEntries, CallFunc_GetCustomGI_ReturnValue_1) == 0x000038, "Member 'WBP_Settings_OptionEntriesHeader_C_InitHeaderAndChildEntries::CallFunc_GetCustomGI_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Settings_OptionEntriesHeader_C_InitHeaderAndChildEntries, CallFunc_GetSettingsPageContext_CurrentContext) == 0x000040, "Member 'WBP_Settings_OptionEntriesHeader_C_InitHeaderAndChildEntries::CallFunc_GetSettingsPageContext_CurrentContext' has a wrong offset!");
static_assert(offsetof(WBP_Settings_OptionEntriesHeader_C_InitHeaderAndChildEntries, CallFunc_GetPlatformNameAsTag_ReturnValue) == 0x000048, "Member 'WBP_Settings_OptionEntriesHeader_C_InitHeaderAndChildEntries::CallFunc_GetPlatformNameAsTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_OptionEntriesHeader_C_InitHeaderAndChildEntries, CallFunc_Not_PreBool_ReturnValue) == 0x000050, "Member 'WBP_Settings_OptionEntriesHeader_C_InitHeaderAndChildEntries::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_OptionEntriesHeader_C_InitHeaderAndChildEntries, CallFunc_Array_Length_ReturnValue) == 0x000054, "Member 'WBP_Settings_OptionEntriesHeader_C_InitHeaderAndChildEntries::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_OptionEntriesHeader_C_InitHeaderAndChildEntries, CallFunc_Array_Get_Item) == 0x000058, "Member 'WBP_Settings_OptionEntriesHeader_C_InitHeaderAndChildEntries::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Settings_OptionEntriesHeader_C_InitHeaderAndChildEntries, CallFunc_Less_IntInt_ReturnValue) == 0x000060, "Member 'WBP_Settings_OptionEntriesHeader_C_InitHeaderAndChildEntries::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_OptionEntriesHeader_C_InitHeaderAndChildEntries, CallFunc_IsAvailableOnCurrentPlatform_IsAvailable) == 0x000061, "Member 'WBP_Settings_OptionEntriesHeader_C_InitHeaderAndChildEntries::CallFunc_IsAvailableOnCurrentPlatform_IsAvailable' has a wrong offset!");

// Function WBP_Settings_OptionEntriesHeader.WBP_Settings_OptionEntriesHeader_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_Settings_OptionEntriesHeader_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_OptionEntriesHeader_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_Settings_OptionEntriesHeader_C_PreConstruct");
static_assert(sizeof(WBP_Settings_OptionEntriesHeader_C_PreConstruct) == 0x000001, "Wrong size on WBP_Settings_OptionEntriesHeader_C_PreConstruct");
static_assert(offsetof(WBP_Settings_OptionEntriesHeader_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_Settings_OptionEntriesHeader_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_Settings_OptionEntriesHeader.WBP_Settings_OptionEntriesHeader_C.ExecuteUbergraph_WBP_Settings_OptionEntriesHeader
// 0x0008 (0x0008 - 0x0000)
struct WBP_Settings_OptionEntriesHeader_C_ExecuteUbergraph_WBP_Settings_OptionEntriesHeader final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_InitHeaderAndChildEntries_IsAvailable;    // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_OptionEntriesHeader_C_ExecuteUbergraph_WBP_Settings_OptionEntriesHeader) == 0x000004, "Wrong alignment on WBP_Settings_OptionEntriesHeader_C_ExecuteUbergraph_WBP_Settings_OptionEntriesHeader");
static_assert(sizeof(WBP_Settings_OptionEntriesHeader_C_ExecuteUbergraph_WBP_Settings_OptionEntriesHeader) == 0x000008, "Wrong size on WBP_Settings_OptionEntriesHeader_C_ExecuteUbergraph_WBP_Settings_OptionEntriesHeader");
static_assert(offsetof(WBP_Settings_OptionEntriesHeader_C_ExecuteUbergraph_WBP_Settings_OptionEntriesHeader, EntryPoint) == 0x000000, "Member 'WBP_Settings_OptionEntriesHeader_C_ExecuteUbergraph_WBP_Settings_OptionEntriesHeader::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Settings_OptionEntriesHeader_C_ExecuteUbergraph_WBP_Settings_OptionEntriesHeader, CallFunc_InitHeaderAndChildEntries_IsAvailable) == 0x000004, "Member 'WBP_Settings_OptionEntriesHeader_C_ExecuteUbergraph_WBP_Settings_OptionEntriesHeader::CallFunc_InitHeaderAndChildEntries_IsAvailable' has a wrong offset!");
static_assert(offsetof(WBP_Settings_OptionEntriesHeader_C_ExecuteUbergraph_WBP_Settings_OptionEntriesHeader, K2Node_Event_IsDesignTime) == 0x000005, "Member 'WBP_Settings_OptionEntriesHeader_C_ExecuteUbergraph_WBP_Settings_OptionEntriesHeader::K2Node_Event_IsDesignTime' has a wrong offset!");

}

