#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Settings_GameplayOptionsList

#include "Basic.hpp"

#include "WBP_Settings_OptionsList_Abstract_classes.hpp"
#include "Engine_structs.hpp"
#include "E_GameDifficulty_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Settings_GameplayOptionsList.WBP_Settings_GameplayOptionsList_C
// 0x00C8 (0x0500 - 0x0438)
class UWBP_Settings_GameplayOptionsList_C final : public UWBP_Settings_OptionsList_Abstract_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_WBP_Settings_GameplayOptionsList_C; // 0x0438(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_NamedBoolSelector_C*               WBP_NamedBoolSelector_AimInputChoice;              // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_NamedBoolSelector_C*               WBP_NamedBoolSelector_CustomizationInCinematics;   // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_NamedBoolSelector_C*               WBP_NamedBoolSelector_ForceFeedback;               // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_NamedBoolSelector_C*               WBP_NamedBoolSelector_InvertCameraPitch;           // 0x0458(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_NamedBoolSelector_C*               WBP_NamedBoolSelector_InvertCameraYaw;             // 0x0460(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_NamedBoolSelector_C*               WBP_NamedBoolSelector_SprintInputChoice;           // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_NamedBoolSelector_C*               WBP_NamedBoolSelector_Tutorials;                   // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_NamedIntegerSelector_C*            WBP_NamedIntegerSelector_GameDifficulty;           // 0x0478(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Settings_OptionEntriesHeader_C*    WBP_Settings_OptionEntriesHeader_Camera;           // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Settings_OptionEntriesHeader_C*    WBP_Settings_OptionEntriesHeader_Controller;       // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Settings_OptionEntriesHeader_C*    WBP_Settings_OptionEntriesHeader_Game;             // 0x0490(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Settings_OptionEntry_C*            WBP_Settings_OptionEntry_AimInputChoice;           // 0x0498(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Settings_OptionEntry_C*            WBP_Settings_OptionEntry_CameraPitchInputMultiplier; // 0x04A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Settings_OptionEntry_C*            WBP_Settings_OptionEntry_CameraYawInputMultiplier; // 0x04A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Settings_OptionEntry_C*            WBP_Settings_OptionEntry_CustomizationInCinematics; // 0x04B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Settings_OptionEntry_C*            WBP_Settings_OptionEntry_ForceFeedback;            // 0x04B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Settings_OptionEntry_C*            WBP_Settings_OptionEntry_GameDifficulty;           // 0x04C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Settings_OptionEntry_C*            WBP_Settings_OptionEntry_InvertCameraPitch;        // 0x04C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Settings_OptionEntry_C*            WBP_Settings_OptionEntry_InvertCameraYaw;          // 0x04D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Settings_OptionEntry_C*            WBP_Settings_OptionEntry_SprintInputChoice;        // 0x04D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Settings_OptionEntry_C*            WBP_Settings_OptionEntry_Tutorials;                // 0x04E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SliderSelector_C*                  WBP_SliderSelector_CameraPitchInputMultiplier;     // 0x04E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SliderSelector_C*                  WBP_SliderSelectorCameraYawInputMultiplier;        // 0x04F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UConfigurableGameUserSettings*          GameUserSettings;                                  // 0x04F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BindOnOptionEntryFocused(const TDelegate<void(class UWBP_Settings_OptionEntry_C* Widget)>& Event);
	void BndEvt__WBP_Settings_ControllerOptionsList_WBP_NamedBoolSelector_InvertCameraPitch_K2Node_ComponentBoundEvent_0_OnValueChanged__DelegateSignature(bool Value, const class FText& Name_0, class UUserWidget* Widget);
	void BndEvt__WBP_Settings_ControllerOptionsList_WBP_NamedBoolSelector_InvertCameraYaw_K2Node_ComponentBoundEvent_1_OnValueChanged__DelegateSignature(bool Value, const class FText& Name_0, class UUserWidget* Widget);
	void BndEvt__WBP_Settings_ControllerOptionsList_WBP_NamedBoolSelector_Rumble_K2Node_ComponentBoundEvent_10_OnValueChanged__DelegateSignature(bool Value, const class FText& Name_0, class UUserWidget* Widget);
	void BndEvt__WBP_Settings_ControllerOptionsList_WBP_SliderSelector_CameraPitchInputMultiplier_K2Node_ComponentBoundEvent_2_OnValueChanged__DelegateSignature(double Value, class UUserWidget* Widget);
	void BndEvt__WBP_Settings_ControllerOptionsList_WBP_SliderSelectorCameraYawInputMultiplier_K2Node_ComponentBoundEvent_3_OnValueChanged__DelegateSignature(double Value, class UUserWidget* Widget);
	void BndEvt__WBP_Settings_GameplayOptionsList_WBP_NamedBoolSelector_AimInputChoice_K2Node_ComponentBoundEvent_8_OnValueChanged__DelegateSignature(bool Value, const class FText& Name_0, class UUserWidget* Widget);
	void BndEvt__WBP_Settings_GameplayOptionsList_WBP_NamedBoolSelector_CustomizationInCinematics_K2Node_ComponentBoundEvent_7_OnValueChanged__DelegateSignature(bool Value, const class FText& Name_0, class UUserWidget* Widget);
	void BndEvt__WBP_Settings_GameplayOptionsList_WBP_NamedBoolSelector_RunInputChoice_K2Node_ComponentBoundEvent_4_OnValueChanged__DelegateSignature(bool Value, const class FText& Name_0, class UUserWidget* Widget);
	void BndEvt__WBP_Settings_GameplayOptionsList_WBP_NamedBoolSelector_Tutorials_K2Node_ComponentBoundEvent_5_OnValueChanged__DelegateSignature(bool Value, const class FText& Name_0, class UUserWidget* Widget);
	void BndEvt__WBP_Settings_GameplayOptionsList_WBP_NamedIntegerSelector_K2Node_ComponentBoundEvent_6_OnValueChanged__DelegateSignature(int32 Value, const class FText& Name_0, class UUserWidget* Widget);
	void ExecuteUbergraph_WBP_Settings_GameplayOptionsList(int32 EntryPoint);
	void LoadUserSettings();
	void SetupAvailableOptions();
	void UnbindOnOptionEntryFocused(const TDelegate<void(class UWBP_Settings_OptionEntry_C* Widget)>& Event);

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Settings_GameplayOptionsList_C">();
	}
	static class UWBP_Settings_GameplayOptionsList_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Settings_GameplayOptionsList_C>();
	}
};
static_assert(alignof(UWBP_Settings_GameplayOptionsList_C) == 0x000008, "Wrong alignment on UWBP_Settings_GameplayOptionsList_C");
static_assert(sizeof(UWBP_Settings_GameplayOptionsList_C) == 0x000500, "Wrong size on UWBP_Settings_GameplayOptionsList_C");
static_assert(offsetof(UWBP_Settings_GameplayOptionsList_C, UberGraphFrame_WBP_Settings_GameplayOptionsList_C) == 0x000438, "Member 'UWBP_Settings_GameplayOptionsList_C::UberGraphFrame_WBP_Settings_GameplayOptionsList_C' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_GameplayOptionsList_C, WBP_NamedBoolSelector_AimInputChoice) == 0x000440, "Member 'UWBP_Settings_GameplayOptionsList_C::WBP_NamedBoolSelector_AimInputChoice' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_GameplayOptionsList_C, WBP_NamedBoolSelector_CustomizationInCinematics) == 0x000448, "Member 'UWBP_Settings_GameplayOptionsList_C::WBP_NamedBoolSelector_CustomizationInCinematics' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_GameplayOptionsList_C, WBP_NamedBoolSelector_ForceFeedback) == 0x000450, "Member 'UWBP_Settings_GameplayOptionsList_C::WBP_NamedBoolSelector_ForceFeedback' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_GameplayOptionsList_C, WBP_NamedBoolSelector_InvertCameraPitch) == 0x000458, "Member 'UWBP_Settings_GameplayOptionsList_C::WBP_NamedBoolSelector_InvertCameraPitch' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_GameplayOptionsList_C, WBP_NamedBoolSelector_InvertCameraYaw) == 0x000460, "Member 'UWBP_Settings_GameplayOptionsList_C::WBP_NamedBoolSelector_InvertCameraYaw' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_GameplayOptionsList_C, WBP_NamedBoolSelector_SprintInputChoice) == 0x000468, "Member 'UWBP_Settings_GameplayOptionsList_C::WBP_NamedBoolSelector_SprintInputChoice' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_GameplayOptionsList_C, WBP_NamedBoolSelector_Tutorials) == 0x000470, "Member 'UWBP_Settings_GameplayOptionsList_C::WBP_NamedBoolSelector_Tutorials' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_GameplayOptionsList_C, WBP_NamedIntegerSelector_GameDifficulty) == 0x000478, "Member 'UWBP_Settings_GameplayOptionsList_C::WBP_NamedIntegerSelector_GameDifficulty' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_GameplayOptionsList_C, WBP_Settings_OptionEntriesHeader_Camera) == 0x000480, "Member 'UWBP_Settings_GameplayOptionsList_C::WBP_Settings_OptionEntriesHeader_Camera' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_GameplayOptionsList_C, WBP_Settings_OptionEntriesHeader_Controller) == 0x000488, "Member 'UWBP_Settings_GameplayOptionsList_C::WBP_Settings_OptionEntriesHeader_Controller' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_GameplayOptionsList_C, WBP_Settings_OptionEntriesHeader_Game) == 0x000490, "Member 'UWBP_Settings_GameplayOptionsList_C::WBP_Settings_OptionEntriesHeader_Game' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_GameplayOptionsList_C, WBP_Settings_OptionEntry_AimInputChoice) == 0x000498, "Member 'UWBP_Settings_GameplayOptionsList_C::WBP_Settings_OptionEntry_AimInputChoice' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_GameplayOptionsList_C, WBP_Settings_OptionEntry_CameraPitchInputMultiplier) == 0x0004A0, "Member 'UWBP_Settings_GameplayOptionsList_C::WBP_Settings_OptionEntry_CameraPitchInputMultiplier' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_GameplayOptionsList_C, WBP_Settings_OptionEntry_CameraYawInputMultiplier) == 0x0004A8, "Member 'UWBP_Settings_GameplayOptionsList_C::WBP_Settings_OptionEntry_CameraYawInputMultiplier' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_GameplayOptionsList_C, WBP_Settings_OptionEntry_CustomizationInCinematics) == 0x0004B0, "Member 'UWBP_Settings_GameplayOptionsList_C::WBP_Settings_OptionEntry_CustomizationInCinematics' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_GameplayOptionsList_C, WBP_Settings_OptionEntry_ForceFeedback) == 0x0004B8, "Member 'UWBP_Settings_GameplayOptionsList_C::WBP_Settings_OptionEntry_ForceFeedback' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_GameplayOptionsList_C, WBP_Settings_OptionEntry_GameDifficulty) == 0x0004C0, "Member 'UWBP_Settings_GameplayOptionsList_C::WBP_Settings_OptionEntry_GameDifficulty' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_GameplayOptionsList_C, WBP_Settings_OptionEntry_InvertCameraPitch) == 0x0004C8, "Member 'UWBP_Settings_GameplayOptionsList_C::WBP_Settings_OptionEntry_InvertCameraPitch' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_GameplayOptionsList_C, WBP_Settings_OptionEntry_InvertCameraYaw) == 0x0004D0, "Member 'UWBP_Settings_GameplayOptionsList_C::WBP_Settings_OptionEntry_InvertCameraYaw' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_GameplayOptionsList_C, WBP_Settings_OptionEntry_SprintInputChoice) == 0x0004D8, "Member 'UWBP_Settings_GameplayOptionsList_C::WBP_Settings_OptionEntry_SprintInputChoice' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_GameplayOptionsList_C, WBP_Settings_OptionEntry_Tutorials) == 0x0004E0, "Member 'UWBP_Settings_GameplayOptionsList_C::WBP_Settings_OptionEntry_Tutorials' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_GameplayOptionsList_C, WBP_SliderSelector_CameraPitchInputMultiplier) == 0x0004E8, "Member 'UWBP_Settings_GameplayOptionsList_C::WBP_SliderSelector_CameraPitchInputMultiplier' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_GameplayOptionsList_C, WBP_SliderSelectorCameraYawInputMultiplier) == 0x0004F0, "Member 'UWBP_Settings_GameplayOptionsList_C::WBP_SliderSelectorCameraYawInputMultiplier' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_GameplayOptionsList_C, GameUserSettings) == 0x0004F8, "Member 'UWBP_Settings_GameplayOptionsList_C::GameUserSettings' has a wrong offset!");

}

