#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Cursor_BreakBar

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Cursor_BreakBar.WBP_Cursor_BreakBar_C
// 0x0030 (0x0310 - 0x02E0)
class UWBP_Cursor_BreakBar_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anim_Active;                                       // 0x02E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_Fill;                                        // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Glow;                                        // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Line;                                        // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Square;                                      // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void CursorActive();
	void ExecuteUbergraph_WBP_Cursor_BreakBar(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Cursor_BreakBar_C">();
	}
	static class UWBP_Cursor_BreakBar_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Cursor_BreakBar_C>();
	}
};
static_assert(alignof(UWBP_Cursor_BreakBar_C) == 0x000008, "Wrong alignment on UWBP_Cursor_BreakBar_C");
static_assert(sizeof(UWBP_Cursor_BreakBar_C) == 0x000310, "Wrong size on UWBP_Cursor_BreakBar_C");
static_assert(offsetof(UWBP_Cursor_BreakBar_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_Cursor_BreakBar_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Cursor_BreakBar_C, Anim_Active) == 0x0002E8, "Member 'UWBP_Cursor_BreakBar_C::Anim_Active' has a wrong offset!");
static_assert(offsetof(UWBP_Cursor_BreakBar_C, Image_Fill) == 0x0002F0, "Member 'UWBP_Cursor_BreakBar_C::Image_Fill' has a wrong offset!");
static_assert(offsetof(UWBP_Cursor_BreakBar_C, Image_Glow) == 0x0002F8, "Member 'UWBP_Cursor_BreakBar_C::Image_Glow' has a wrong offset!");
static_assert(offsetof(UWBP_Cursor_BreakBar_C, Image_Line) == 0x000300, "Member 'UWBP_Cursor_BreakBar_C::Image_Line' has a wrong offset!");
static_assert(offsetof(UWBP_Cursor_BreakBar_C, Image_Square) == 0x000308, "Member 'UWBP_Cursor_BreakBar_C::Image_Square' has a wrong offset!");

}

