#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_BuffInfoPanel

#include "Basic.hpp"

#include "FStatMultiplierData_structs.hpp"
#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_BuffInfoPanel.WBP_BuffInfoPanel_C.ExecuteUbergraph_WBP_BuffInfoPanel
// 0x0208 (0x0208 - 0x0000)
struct WBP_BuffInfoPanel_C_ExecuteUbergraph_WBP_BuffInfoPanel final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              Temp_struct_Variable;                              // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Temp_struct_Variable_1;                            // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              K2Node_Select_Default;                             // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0050(0x0048)(HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9A[0x6];                                       // 0x009A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetBuffDisplayName_ReturnValue;           // 0x00A0(0x0010)()
	struct FFStatMultiplierData                   CallFunc_Array_Get_Item;                           // 0x00B0(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00C8(0x0048)(HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_111[0x3];                                      // 0x0111(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_RemapStatMultiplierToIntensity_FeedbackIntensity; // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0118(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0128(0x0010)()
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0140(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0188(0x0010)(ReferenceParm)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_199[0x7];                                      // 0x0199(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x01A0(0x0010)()
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x01B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x01B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B3[0x5];                                      // 0x01B3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x01B8(0x0010)()
	class FText                                   K2Node_Select_Default_3;                           // 0x01C8(0x0010)(ConstParm)
	class UWBP_StatModifier_C*                    CallFunc_SpawnObject_ReturnValue;                  // 0x01D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBoxSlot*                     CallFunc_AddChildToHorizontalBox_ReturnValue;      // 0x01E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1ED[0x3];                                      // 0x01ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x01F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F5[0x3];                                      // 0x01F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_BattleBuffInstanceWrapper_C*        K2Node_CustomEvent_BattleBuffWrapper;              // 0x01F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanXOR_ReturnValue;                   // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BuffInfoPanel_C_ExecuteUbergraph_WBP_BuffInfoPanel) == 0x000008, "Wrong alignment on WBP_BuffInfoPanel_C_ExecuteUbergraph_WBP_BuffInfoPanel");
static_assert(sizeof(WBP_BuffInfoPanel_C_ExecuteUbergraph_WBP_BuffInfoPanel) == 0x000208, "Wrong size on WBP_BuffInfoPanel_C_ExecuteUbergraph_WBP_BuffInfoPanel");
static_assert(offsetof(WBP_BuffInfoPanel_C_ExecuteUbergraph_WBP_BuffInfoPanel, EntryPoint) == 0x000000, "Member 'WBP_BuffInfoPanel_C_ExecuteUbergraph_WBP_BuffInfoPanel::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_BuffInfoPanel_C_ExecuteUbergraph_WBP_BuffInfoPanel, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WBP_BuffInfoPanel_C_ExecuteUbergraph_WBP_BuffInfoPanel::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_BuffInfoPanel_C_ExecuteUbergraph_WBP_BuffInfoPanel, Temp_bool_Variable) == 0x000005, "Member 'WBP_BuffInfoPanel_C_ExecuteUbergraph_WBP_BuffInfoPanel::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_BuffInfoPanel_C_ExecuteUbergraph_WBP_BuffInfoPanel, Temp_byte_Variable) == 0x000006, "Member 'WBP_BuffInfoPanel_C_ExecuteUbergraph_WBP_BuffInfoPanel::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_BuffInfoPanel_C_ExecuteUbergraph_WBP_BuffInfoPanel, Temp_byte_Variable_1) == 0x000007, "Member 'WBP_BuffInfoPanel_C_ExecuteUbergraph_WBP_BuffInfoPanel::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_BuffInfoPanel_C_ExecuteUbergraph_WBP_BuffInfoPanel, Temp_bool_Variable_1) == 0x000008, "Member 'WBP_BuffInfoPanel_C_ExecuteUbergraph_WBP_BuffInfoPanel::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_BuffInfoPanel_C_ExecuteUbergraph_WBP_BuffInfoPanel, Temp_byte_Variable_2) == 0x000009, "Member 'WBP_BuffInfoPanel_C_ExecuteUbergraph_WBP_BuffInfoPanel::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_BuffInfoPanel_C_ExecuteUbergraph_WBP_BuffInfoPanel, Temp_byte_Variable_3) == 0x00000A, "Member 'WBP_BuffInfoPanel_C_ExecuteUbergraph_WBP_BuffInfoPanel::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_BuffInfoPanel_C_ExecuteUbergraph_WBP_BuffInfoPanel, Temp_bool_Variable_2) == 0x00000B, "Member 'WBP_BuffInfoPanel_C_ExecuteUbergraph_WBP_BuffInfoPanel::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_BuffInfoPanel_C_ExecuteUbergraph_WBP_BuffInfoPanel, Temp_struct_Variable) == 0x000010, "Member 'WBP_BuffInfoPanel_C_ExecuteUbergraph_WBP_BuffInfoPanel::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_BuffInfoPanel_C_ExecuteUbergraph_WBP_BuffInfoPanel, Temp_struct_Variable_1) == 0x000020, "Member 'WBP_BuffInfoPanel_C_ExecuteUbergraph_WBP_BuffInfoPanel::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_BuffInfoPanel_C_ExecuteUbergraph_WBP_BuffInfoPanel, Temp_int_Array_Index_Variable) == 0x000030, "Member 'WBP_BuffInfoPanel_C_ExecuteUbergraph_WBP_BuffInfoPanel::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_BuffInfoPanel_C_ExecuteUbergraph_WBP_BuffInfoPanel, K2Node_Select_Default) == 0x000038, "Member 'WBP_BuffInfoPanel_C_ExecuteUbergraph_WBP_BuffInfoPanel::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_BuffInfoPanel_C_ExecuteUbergraph_WBP_BuffInfoPanel, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000048, "Member 'WBP_BuffInfoPanel_C_ExecuteUbergraph_WBP_BuffInfoPanel::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BuffInfoPanel_C_ExecuteUbergraph_WBP_BuffInfoPanel, K2Node_MakeStruct_FormatArgumentData) == 0x000050, "Member 'WBP_BuffInfoPanel_C_ExecuteUbergraph_WBP_BuffInfoPanel::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_BuffInfoPanel_C_ExecuteUbergraph_WBP_BuffInfoPanel, Temp_bool_Variable_3) == 0x000098, "Member 'WBP_BuffInfoPanel_C_ExecuteUbergraph_WBP_BuffInfoPanel::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_BuffInfoPanel_C_ExecuteUbergraph_WBP_BuffInfoPanel, CallFunc_IsValid_ReturnValue) == 0x000099, "Member 'WBP_BuffInfoPanel_C_ExecuteUbergraph_WBP_BuffInfoPanel::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BuffInfoPanel_C_ExecuteUbergraph_WBP_BuffInfoPanel, CallFunc_GetBuffDisplayName_ReturnValue) == 0x0000A0, "Member 'WBP_BuffInfoPanel_C_ExecuteUbergraph_WBP_BuffInfoPanel::CallFunc_GetBuffDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BuffInfoPanel_C_ExecuteUbergraph_WBP_BuffInfoPanel, CallFunc_Array_Get_Item) == 0x0000B0, "Member 'WBP_BuffInfoPanel_C_ExecuteUbergraph_WBP_BuffInfoPanel::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_BuffInfoPanel_C_ExecuteUbergraph_WBP_BuffInfoPanel, CallFunc_Array_Length_ReturnValue) == 0x0000C0, "Member 'WBP_BuffInfoPanel_C_ExecuteUbergraph_WBP_BuffInfoPanel::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BuffInfoPanel_C_ExecuteUbergraph_WBP_BuffInfoPanel, CallFunc_Array_Length_ReturnValue_1) == 0x0000C4, "Member 'WBP_BuffInfoPanel_C_ExecuteUbergraph_WBP_BuffInfoPanel::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_BuffInfoPanel_C_ExecuteUbergraph_WBP_BuffInfoPanel, K2Node_MakeStruct_FormatArgumentData_1) == 0x0000C8, "Member 'WBP_BuffInfoPanel_C_ExecuteUbergraph_WBP_BuffInfoPanel::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WBP_BuffInfoPanel_C_ExecuteUbergraph_WBP_BuffInfoPanel, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000110, "Member 'WBP_BuffInfoPanel_C_ExecuteUbergraph_WBP_BuffInfoPanel::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BuffInfoPanel_C_ExecuteUbergraph_WBP_BuffInfoPanel, CallFunc_RemapStatMultiplierToIntensity_FeedbackIntensity) == 0x000114, "Member 'WBP_BuffInfoPanel_C_ExecuteUbergraph_WBP_BuffInfoPanel::CallFunc_RemapStatMultiplierToIntensity_FeedbackIntensity' has a wrong offset!");
static_assert(offsetof(WBP_BuffInfoPanel_C_ExecuteUbergraph_WBP_BuffInfoPanel, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x000118, "Member 'WBP_BuffInfoPanel_C_ExecuteUbergraph_WBP_BuffInfoPanel::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BuffInfoPanel_C_ExecuteUbergraph_WBP_BuffInfoPanel, CallFunc_Conv_StringToText_ReturnValue) == 0x000128, "Member 'WBP_BuffInfoPanel_C_ExecuteUbergraph_WBP_BuffInfoPanel::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BuffInfoPanel_C_ExecuteUbergraph_WBP_BuffInfoPanel, CallFunc_IsValid_ReturnValue_1) == 0x000138, "Member 'WBP_BuffInfoPanel_C_ExecuteUbergraph_WBP_BuffInfoPanel::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_BuffInfoPanel_C_ExecuteUbergraph_WBP_BuffInfoPanel, K2Node_MakeStruct_FormatArgumentData_2) == 0x000140, "Member 'WBP_BuffInfoPanel_C_ExecuteUbergraph_WBP_BuffInfoPanel::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(WBP_BuffInfoPanel_C_ExecuteUbergraph_WBP_BuffInfoPanel, K2Node_MakeArray_Array) == 0x000188, "Member 'WBP_BuffInfoPanel_C_ExecuteUbergraph_WBP_BuffInfoPanel::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_BuffInfoPanel_C_ExecuteUbergraph_WBP_BuffInfoPanel, K2Node_Select_Default_1) == 0x000198, "Member 'WBP_BuffInfoPanel_C_ExecuteUbergraph_WBP_BuffInfoPanel::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_BuffInfoPanel_C_ExecuteUbergraph_WBP_BuffInfoPanel, CallFunc_Format_ReturnValue) == 0x0001A0, "Member 'WBP_BuffInfoPanel_C_ExecuteUbergraph_WBP_BuffInfoPanel::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BuffInfoPanel_C_ExecuteUbergraph_WBP_BuffInfoPanel, CallFunc_TextIsEmpty_ReturnValue) == 0x0001B0, "Member 'WBP_BuffInfoPanel_C_ExecuteUbergraph_WBP_BuffInfoPanel::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BuffInfoPanel_C_ExecuteUbergraph_WBP_BuffInfoPanel, CallFunc_BooleanAND_ReturnValue) == 0x0001B1, "Member 'WBP_BuffInfoPanel_C_ExecuteUbergraph_WBP_BuffInfoPanel::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BuffInfoPanel_C_ExecuteUbergraph_WBP_BuffInfoPanel, K2Node_Select_Default_2) == 0x0001B2, "Member 'WBP_BuffInfoPanel_C_ExecuteUbergraph_WBP_BuffInfoPanel::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(WBP_BuffInfoPanel_C_ExecuteUbergraph_WBP_BuffInfoPanel, CallFunc_MakeLiteralText_ReturnValue) == 0x0001B8, "Member 'WBP_BuffInfoPanel_C_ExecuteUbergraph_WBP_BuffInfoPanel::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BuffInfoPanel_C_ExecuteUbergraph_WBP_BuffInfoPanel, K2Node_Select_Default_3) == 0x0001C8, "Member 'WBP_BuffInfoPanel_C_ExecuteUbergraph_WBP_BuffInfoPanel::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(WBP_BuffInfoPanel_C_ExecuteUbergraph_WBP_BuffInfoPanel, CallFunc_SpawnObject_ReturnValue) == 0x0001D8, "Member 'WBP_BuffInfoPanel_C_ExecuteUbergraph_WBP_BuffInfoPanel::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BuffInfoPanel_C_ExecuteUbergraph_WBP_BuffInfoPanel, CallFunc_AddChildToHorizontalBox_ReturnValue) == 0x0001E0, "Member 'WBP_BuffInfoPanel_C_ExecuteUbergraph_WBP_BuffInfoPanel::CallFunc_AddChildToHorizontalBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BuffInfoPanel_C_ExecuteUbergraph_WBP_BuffInfoPanel, Temp_int_Loop_Counter_Variable) == 0x0001E8, "Member 'WBP_BuffInfoPanel_C_ExecuteUbergraph_WBP_BuffInfoPanel::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_BuffInfoPanel_C_ExecuteUbergraph_WBP_BuffInfoPanel, CallFunc_Less_IntInt_ReturnValue) == 0x0001EC, "Member 'WBP_BuffInfoPanel_C_ExecuteUbergraph_WBP_BuffInfoPanel::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BuffInfoPanel_C_ExecuteUbergraph_WBP_BuffInfoPanel, CallFunc_Add_IntInt_ReturnValue) == 0x0001F0, "Member 'WBP_BuffInfoPanel_C_ExecuteUbergraph_WBP_BuffInfoPanel::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BuffInfoPanel_C_ExecuteUbergraph_WBP_BuffInfoPanel, CallFunc_IsValid_ReturnValue_2) == 0x0001F4, "Member 'WBP_BuffInfoPanel_C_ExecuteUbergraph_WBP_BuffInfoPanel::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_BuffInfoPanel_C_ExecuteUbergraph_WBP_BuffInfoPanel, K2Node_CustomEvent_BattleBuffWrapper) == 0x0001F8, "Member 'WBP_BuffInfoPanel_C_ExecuteUbergraph_WBP_BuffInfoPanel::K2Node_CustomEvent_BattleBuffWrapper' has a wrong offset!");
static_assert(offsetof(WBP_BuffInfoPanel_C_ExecuteUbergraph_WBP_BuffInfoPanel, CallFunc_BooleanXOR_ReturnValue) == 0x000200, "Member 'WBP_BuffInfoPanel_C_ExecuteUbergraph_WBP_BuffInfoPanel::CallFunc_BooleanXOR_ReturnValue' has a wrong offset!");

// Function WBP_BuffInfoPanel.WBP_BuffInfoPanel_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_BuffInfoPanel_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BuffInfoPanel_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_BuffInfoPanel_C_PreConstruct");
static_assert(sizeof(WBP_BuffInfoPanel_C_PreConstruct) == 0x000001, "Wrong size on WBP_BuffInfoPanel_C_PreConstruct");
static_assert(offsetof(WBP_BuffInfoPanel_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_BuffInfoPanel_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_BuffInfoPanel.WBP_BuffInfoPanel_C.SetBattleBuffWrapper
// 0x0008 (0x0008 - 0x0000)
struct WBP_BuffInfoPanel_C_SetBattleBuffWrapper final
{
public:
	class UBP_BattleBuffInstanceWrapper_C*        BattleBuffWrapper_0;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BuffInfoPanel_C_SetBattleBuffWrapper) == 0x000008, "Wrong alignment on WBP_BuffInfoPanel_C_SetBattleBuffWrapper");
static_assert(sizeof(WBP_BuffInfoPanel_C_SetBattleBuffWrapper) == 0x000008, "Wrong size on WBP_BuffInfoPanel_C_SetBattleBuffWrapper");
static_assert(offsetof(WBP_BuffInfoPanel_C_SetBattleBuffWrapper, BattleBuffWrapper_0) == 0x000000, "Member 'WBP_BuffInfoPanel_C_SetBattleBuffWrapper::BattleBuffWrapper_0' has a wrong offset!");

}

