#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MM_BackupSaveEntry

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_MM_BackupSaveEntry.WBP_MM_BackupSaveEntry_C.BndEvt__WBP_MM_BackupSaveEntry_WBP_BaseButton_K2Node_ComponentBoundEvent_0_OnButtonBaseFocused__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_MM_BackupSaveEntry_C_BndEvt__WBP_MM_BackupSaveEntry_WBP_BaseButton_K2Node_ComponentBoundEvent_0_OnButtonBaseFocused__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MM_BackupSaveEntry_C_BndEvt__WBP_MM_BackupSaveEntry_WBP_BaseButton_K2Node_ComponentBoundEvent_0_OnButtonBaseFocused__DelegateSignature) == 0x000008, "Wrong alignment on WBP_MM_BackupSaveEntry_C_BndEvt__WBP_MM_BackupSaveEntry_WBP_BaseButton_K2Node_ComponentBoundEvent_0_OnButtonBaseFocused__DelegateSignature");
static_assert(sizeof(WBP_MM_BackupSaveEntry_C_BndEvt__WBP_MM_BackupSaveEntry_WBP_BaseButton_K2Node_ComponentBoundEvent_0_OnButtonBaseFocused__DelegateSignature) == 0x000008, "Wrong size on WBP_MM_BackupSaveEntry_C_BndEvt__WBP_MM_BackupSaveEntry_WBP_BaseButton_K2Node_ComponentBoundEvent_0_OnButtonBaseFocused__DelegateSignature");
static_assert(offsetof(WBP_MM_BackupSaveEntry_C_BndEvt__WBP_MM_BackupSaveEntry_WBP_BaseButton_K2Node_ComponentBoundEvent_0_OnButtonBaseFocused__DelegateSignature, Button) == 0x000000, "Member 'WBP_MM_BackupSaveEntry_C_BndEvt__WBP_MM_BackupSaveEntry_WBP_BaseButton_K2Node_ComponentBoundEvent_0_OnButtonBaseFocused__DelegateSignature::Button' has a wrong offset!");

// Function WBP_MM_BackupSaveEntry.WBP_MM_BackupSaveEntry_C.BndEvt__WBP_MM_BackupSaveEntry_WBP_BaseButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_MM_BackupSaveEntry_C_BndEvt__WBP_MM_BackupSaveEntry_WBP_BaseButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MM_BackupSaveEntry_C_BndEvt__WBP_MM_BackupSaveEntry_WBP_BaseButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_MM_BackupSaveEntry_C_BndEvt__WBP_MM_BackupSaveEntry_WBP_BaseButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_MM_BackupSaveEntry_C_BndEvt__WBP_MM_BackupSaveEntry_WBP_BaseButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_MM_BackupSaveEntry_C_BndEvt__WBP_MM_BackupSaveEntry_WBP_BaseButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_MM_BackupSaveEntry_C_BndEvt__WBP_MM_BackupSaveEntry_WBP_BaseButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_MM_BackupSaveEntry_C_BndEvt__WBP_MM_BackupSaveEntry_WBP_BaseButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_MM_BackupSaveEntry.WBP_MM_BackupSaveEntry_C.ExecuteUbergraph_WBP_MM_BackupSaveEntry
// 0x0018 (0x0018 - 0x0000)
struct WBP_MM_BackupSaveEntry_C_ExecuteUbergraph_WBP_MM_BackupSaveEntry final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_1;               // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MM_BackupSaveEntry_C_ExecuteUbergraph_WBP_MM_BackupSaveEntry) == 0x000008, "Wrong alignment on WBP_MM_BackupSaveEntry_C_ExecuteUbergraph_WBP_MM_BackupSaveEntry");
static_assert(sizeof(WBP_MM_BackupSaveEntry_C_ExecuteUbergraph_WBP_MM_BackupSaveEntry) == 0x000018, "Wrong size on WBP_MM_BackupSaveEntry_C_ExecuteUbergraph_WBP_MM_BackupSaveEntry");
static_assert(offsetof(WBP_MM_BackupSaveEntry_C_ExecuteUbergraph_WBP_MM_BackupSaveEntry, EntryPoint) == 0x000000, "Member 'WBP_MM_BackupSaveEntry_C_ExecuteUbergraph_WBP_MM_BackupSaveEntry::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_MM_BackupSaveEntry_C_ExecuteUbergraph_WBP_MM_BackupSaveEntry, K2Node_ComponentBoundEvent_Button_1) == 0x000008, "Member 'WBP_MM_BackupSaveEntry_C_ExecuteUbergraph_WBP_MM_BackupSaveEntry::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(WBP_MM_BackupSaveEntry_C_ExecuteUbergraph_WBP_MM_BackupSaveEntry, K2Node_ComponentBoundEvent_Button) == 0x000010, "Member 'WBP_MM_BackupSaveEntry_C_ExecuteUbergraph_WBP_MM_BackupSaveEntry::K2Node_ComponentBoundEvent_Button' has a wrong offset!");

// Function WBP_MM_BackupSaveEntry.WBP_MM_BackupSaveEntry_C.GetBackUpSave
// 0x0010 (0x0010 - 0x0000)
struct WBP_MM_BackupSaveEntry_C_GetBackUpSave final
{
public:
	class FString                                 BackUpSave_0;                                      // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MM_BackupSaveEntry_C_GetBackUpSave) == 0x000008, "Wrong alignment on WBP_MM_BackupSaveEntry_C_GetBackUpSave");
static_assert(sizeof(WBP_MM_BackupSaveEntry_C_GetBackUpSave) == 0x000010, "Wrong size on WBP_MM_BackupSaveEntry_C_GetBackUpSave");
static_assert(offsetof(WBP_MM_BackupSaveEntry_C_GetBackUpSave, BackUpSave_0) == 0x000000, "Member 'WBP_MM_BackupSaveEntry_C_GetBackUpSave::BackUpSave_0' has a wrong offset!");

// Function WBP_MM_BackupSaveEntry.WBP_MM_BackupSaveEntry_C.LoadBackupSaveData
// 0x0038 (0x0038 - 0x0000)
struct WBP_MM_BackupSaveEntry_C_LoadBackupSaveData final
{
public:
	class FString                                 SaveString;                                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class UBP_SaveGameData_C*                     SaveData;                                          // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_AsDateTime_DateTime_ReturnValue;          // 0x0018(0x0010)()
	class FText                                   CallFunc_Get_Elapsed_Time_As_Text_Text;            // 0x0028(0x0010)()
};
static_assert(alignof(WBP_MM_BackupSaveEntry_C_LoadBackupSaveData) == 0x000008, "Wrong alignment on WBP_MM_BackupSaveEntry_C_LoadBackupSaveData");
static_assert(sizeof(WBP_MM_BackupSaveEntry_C_LoadBackupSaveData) == 0x000038, "Wrong size on WBP_MM_BackupSaveEntry_C_LoadBackupSaveData");
static_assert(offsetof(WBP_MM_BackupSaveEntry_C_LoadBackupSaveData, SaveString) == 0x000000, "Member 'WBP_MM_BackupSaveEntry_C_LoadBackupSaveData::SaveString' has a wrong offset!");
static_assert(offsetof(WBP_MM_BackupSaveEntry_C_LoadBackupSaveData, SaveData) == 0x000010, "Member 'WBP_MM_BackupSaveEntry_C_LoadBackupSaveData::SaveData' has a wrong offset!");
static_assert(offsetof(WBP_MM_BackupSaveEntry_C_LoadBackupSaveData, CallFunc_AsDateTime_DateTime_ReturnValue) == 0x000018, "Member 'WBP_MM_BackupSaveEntry_C_LoadBackupSaveData::CallFunc_AsDateTime_DateTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MM_BackupSaveEntry_C_LoadBackupSaveData, CallFunc_Get_Elapsed_Time_As_Text_Text) == 0x000028, "Member 'WBP_MM_BackupSaveEntry_C_LoadBackupSaveData::CallFunc_Get_Elapsed_Time_As_Text_Text' has a wrong offset!");

}

