#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_OverlayQuestObjective

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_OverlayQuestObjective.WBP_OverlayQuestObjective_C
// 0x0028 (0x0330 - 0x0308)
class UWBP_OverlayQuestObjective_C final : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0308(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_WrappingText_C*                    LevelName;                                         // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonLazyImage*                       LevelNameLine;                                     // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         ObjectiveBox;                                      // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_WrappingText_C*                    ObjectiveText;                                     // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_OverlayQuestObjective(int32 EntryPoint);
	void OnShow();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_OverlayQuestObjective_C">();
	}
	static class UWBP_OverlayQuestObjective_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_OverlayQuestObjective_C>();
	}
};
static_assert(alignof(UWBP_OverlayQuestObjective_C) == 0x000008, "Wrong alignment on UWBP_OverlayQuestObjective_C");
static_assert(sizeof(UWBP_OverlayQuestObjective_C) == 0x000330, "Wrong size on UWBP_OverlayQuestObjective_C");
static_assert(offsetof(UWBP_OverlayQuestObjective_C, UberGraphFrame) == 0x000308, "Member 'UWBP_OverlayQuestObjective_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_OverlayQuestObjective_C, LevelName) == 0x000310, "Member 'UWBP_OverlayQuestObjective_C::LevelName' has a wrong offset!");
static_assert(offsetof(UWBP_OverlayQuestObjective_C, LevelNameLine) == 0x000318, "Member 'UWBP_OverlayQuestObjective_C::LevelNameLine' has a wrong offset!");
static_assert(offsetof(UWBP_OverlayQuestObjective_C, ObjectiveBox) == 0x000320, "Member 'UWBP_OverlayQuestObjective_C::ObjectiveBox' has a wrong offset!");
static_assert(offsetof(UWBP_OverlayQuestObjective_C, ObjectiveText) == 0x000328, "Member 'UWBP_OverlayQuestObjective_C::ObjectiveText' has a wrong offset!");

}

