#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Inventory_Item_Row

#include "Basic.hpp"

#include "EWeaponQuality_structs.hpp"
#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Inventory_Item_Row.WBP_Inventory_Item_Row_C
// 0x0068 (0x0370 - 0x0308)
class UWBP_Inventory_Item_Row_C final : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0308(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_BaseButton_C*                      BaseButton;                                        // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ItemIcon_C*                        ItemIcon;                                          // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PictoLevel_C*                      ItemLevel;                                         // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_WrappingText_C*                    ItemName;                                          // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_NotificationBullet_C*              NotificationBullet;                                // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       QuantityText;                                      // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(class UWBP_Inventory_Item_Row_C* Widget)> OnInventoryItemWidgetFocused; // 0x0340(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(class UWBP_Inventory_Item_Row_C* Widget)> OnInventoryItemWidgetUnfocused; // 0x0350(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(class UWBP_Inventory_Item_Row_C* Widget)> OnInventoryItemWidgetClicked; // 0x0360(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void BndEvt__WBP_Inventory_Item_Row_BaseButton_K2Node_ComponentBoundEvent_0_OnButtonBaseFocused__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_Inventory_Item_Row_BaseButton_K2Node_ComponentBoundEvent_1_OnButtonBaseUnfocused__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_Inventory_Item_Row_BaseButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_Inventory_Item_Row_BaseButton_K2Node_ComponentBoundEvent_3_OnButtonBaseFocusedHold__DelegateSignature();
	void BP_OnEntryReleased();
	void BP_OnItemExpansionChanged(bool bIsExpanded);
	void BP_OnItemSelectionChanged(bool bIsSelected);
	void ExecuteUbergraph_WBP_Inventory_Item_Row(int32 EntryPoint);
	void OnListItemObjectSet(class UObject* ListItemObject);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Inventory_Item_Row_C">();
	}
	static class UWBP_Inventory_Item_Row_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Inventory_Item_Row_C>();
	}
};
static_assert(alignof(UWBP_Inventory_Item_Row_C) == 0x000008, "Wrong alignment on UWBP_Inventory_Item_Row_C");
static_assert(sizeof(UWBP_Inventory_Item_Row_C) == 0x000370, "Wrong size on UWBP_Inventory_Item_Row_C");
static_assert(offsetof(UWBP_Inventory_Item_Row_C, UberGraphFrame) == 0x000308, "Member 'UWBP_Inventory_Item_Row_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Inventory_Item_Row_C, BaseButton) == 0x000310, "Member 'UWBP_Inventory_Item_Row_C::BaseButton' has a wrong offset!");
static_assert(offsetof(UWBP_Inventory_Item_Row_C, ItemIcon) == 0x000318, "Member 'UWBP_Inventory_Item_Row_C::ItemIcon' has a wrong offset!");
static_assert(offsetof(UWBP_Inventory_Item_Row_C, ItemLevel) == 0x000320, "Member 'UWBP_Inventory_Item_Row_C::ItemLevel' has a wrong offset!");
static_assert(offsetof(UWBP_Inventory_Item_Row_C, ItemName) == 0x000328, "Member 'UWBP_Inventory_Item_Row_C::ItemName' has a wrong offset!");
static_assert(offsetof(UWBP_Inventory_Item_Row_C, NotificationBullet) == 0x000330, "Member 'UWBP_Inventory_Item_Row_C::NotificationBullet' has a wrong offset!");
static_assert(offsetof(UWBP_Inventory_Item_Row_C, QuantityText) == 0x000338, "Member 'UWBP_Inventory_Item_Row_C::QuantityText' has a wrong offset!");
static_assert(offsetof(UWBP_Inventory_Item_Row_C, OnInventoryItemWidgetFocused) == 0x000340, "Member 'UWBP_Inventory_Item_Row_C::OnInventoryItemWidgetFocused' has a wrong offset!");
static_assert(offsetof(UWBP_Inventory_Item_Row_C, OnInventoryItemWidgetUnfocused) == 0x000350, "Member 'UWBP_Inventory_Item_Row_C::OnInventoryItemWidgetUnfocused' has a wrong offset!");
static_assert(offsetof(UWBP_Inventory_Item_Row_C, OnInventoryItemWidgetClicked) == 0x000360, "Member 'UWBP_Inventory_Item_Row_C::OnInventoryItemWidgetClicked' has a wrong offset!");

}

