#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SpawnPointEntry

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_SpawnPointEntry.WBP_SpawnPointEntry_C.BndEvt__WBP_SpawnPointEntry_SpawnEntryButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_SpawnPointEntry_C_BndEvt__WBP_SpawnPointEntry_SpawnEntryButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SpawnPointEntry_C_BndEvt__WBP_SpawnPointEntry_SpawnEntryButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_SpawnPointEntry_C_BndEvt__WBP_SpawnPointEntry_SpawnEntryButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_SpawnPointEntry_C_BndEvt__WBP_SpawnPointEntry_SpawnEntryButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_SpawnPointEntry_C_BndEvt__WBP_SpawnPointEntry_SpawnEntryButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_SpawnPointEntry_C_BndEvt__WBP_SpawnPointEntry_SpawnEntryButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_SpawnPointEntry_C_BndEvt__WBP_SpawnPointEntry_SpawnEntryButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_SpawnPointEntry.WBP_SpawnPointEntry_C.ExecuteUbergraph_WBP_SpawnPointEntry
// 0x0010 (0x0010 - 0x0000)
struct WBP_SpawnPointEntry_C_ExecuteUbergraph_WBP_SpawnPointEntry final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SpawnPointEntry_C_ExecuteUbergraph_WBP_SpawnPointEntry) == 0x000008, "Wrong alignment on WBP_SpawnPointEntry_C_ExecuteUbergraph_WBP_SpawnPointEntry");
static_assert(sizeof(WBP_SpawnPointEntry_C_ExecuteUbergraph_WBP_SpawnPointEntry) == 0x000010, "Wrong size on WBP_SpawnPointEntry_C_ExecuteUbergraph_WBP_SpawnPointEntry");
static_assert(offsetof(WBP_SpawnPointEntry_C_ExecuteUbergraph_WBP_SpawnPointEntry, EntryPoint) == 0x000000, "Member 'WBP_SpawnPointEntry_C_ExecuteUbergraph_WBP_SpawnPointEntry::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_SpawnPointEntry_C_ExecuteUbergraph_WBP_SpawnPointEntry, K2Node_ComponentBoundEvent_Button) == 0x000008, "Member 'WBP_SpawnPointEntry_C_ExecuteUbergraph_WBP_SpawnPointEntry::K2Node_ComponentBoundEvent_Button' has a wrong offset!");

// Function WBP_SpawnPointEntry.WBP_SpawnPointEntry_C.SetSpawnPointText
// 0x0010 (0x0010 - 0x0000)
struct WBP_SpawnPointEntry_C_SetSpawnPointText final
{
public:
	class FText                                   InSpawnPointText;                                  // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_SpawnPointEntry_C_SetSpawnPointText) == 0x000008, "Wrong alignment on WBP_SpawnPointEntry_C_SetSpawnPointText");
static_assert(sizeof(WBP_SpawnPointEntry_C_SetSpawnPointText) == 0x000010, "Wrong size on WBP_SpawnPointEntry_C_SetSpawnPointText");
static_assert(offsetof(WBP_SpawnPointEntry_C_SetSpawnPointText, InSpawnPointText) == 0x000000, "Member 'WBP_SpawnPointEntry_C_SetSpawnPointText::InSpawnPointText' has a wrong offset!");

}

