#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Raw_Attributes_Display

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EAttributeScalingGrade_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_Raw_Attributes_Display.WBP_Raw_Attributes_Display_C.BndEvt__WBP_Raw_Attributes_Display_WBP_ArrowButton_Downgrade_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Raw_Attributes_Display_C_BndEvt__WBP_Raw_Attributes_Display_WBP_ArrowButton_Downgrade_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Raw_Attributes_Display_C_BndEvt__WBP_Raw_Attributes_Display_WBP_ArrowButton_Downgrade_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Raw_Attributes_Display_C_BndEvt__WBP_Raw_Attributes_Display_WBP_ArrowButton_Downgrade_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_Raw_Attributes_Display_C_BndEvt__WBP_Raw_Attributes_Display_WBP_ArrowButton_Downgrade_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_Raw_Attributes_Display_C_BndEvt__WBP_Raw_Attributes_Display_WBP_ArrowButton_Downgrade_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_Raw_Attributes_Display_C_BndEvt__WBP_Raw_Attributes_Display_WBP_ArrowButton_Downgrade_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_Raw_Attributes_Display_C_BndEvt__WBP_Raw_Attributes_Display_WBP_ArrowButton_Downgrade_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_Raw_Attributes_Display.WBP_Raw_Attributes_Display_C.BndEvt__WBP_Raw_Attributes_Display_WBP_ArrowButton_Upgrade_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Raw_Attributes_Display_C_BndEvt__WBP_Raw_Attributes_Display_WBP_ArrowButton_Upgrade_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Raw_Attributes_Display_C_BndEvt__WBP_Raw_Attributes_Display_WBP_ArrowButton_Upgrade_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Raw_Attributes_Display_C_BndEvt__WBP_Raw_Attributes_Display_WBP_ArrowButton_Upgrade_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_Raw_Attributes_Display_C_BndEvt__WBP_Raw_Attributes_Display_WBP_ArrowButton_Upgrade_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_Raw_Attributes_Display_C_BndEvt__WBP_Raw_Attributes_Display_WBP_ArrowButton_Upgrade_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_Raw_Attributes_Display_C_BndEvt__WBP_Raw_Attributes_Display_WBP_ArrowButton_Upgrade_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_Raw_Attributes_Display_C_BndEvt__WBP_Raw_Attributes_Display_WBP_ArrowButton_Upgrade_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_Raw_Attributes_Display.WBP_Raw_Attributes_Display_C.BndEvt__WBP_Raw_Attributes_Display_WBP_BaseButton_K2Node_ComponentBoundEvent_2_OnButtonBaseFocused__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Raw_Attributes_Display_C_BndEvt__WBP_Raw_Attributes_Display_WBP_BaseButton_K2Node_ComponentBoundEvent_2_OnButtonBaseFocused__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Raw_Attributes_Display_C_BndEvt__WBP_Raw_Attributes_Display_WBP_BaseButton_K2Node_ComponentBoundEvent_2_OnButtonBaseFocused__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Raw_Attributes_Display_C_BndEvt__WBP_Raw_Attributes_Display_WBP_BaseButton_K2Node_ComponentBoundEvent_2_OnButtonBaseFocused__DelegateSignature");
static_assert(sizeof(WBP_Raw_Attributes_Display_C_BndEvt__WBP_Raw_Attributes_Display_WBP_BaseButton_K2Node_ComponentBoundEvent_2_OnButtonBaseFocused__DelegateSignature) == 0x000008, "Wrong size on WBP_Raw_Attributes_Display_C_BndEvt__WBP_Raw_Attributes_Display_WBP_BaseButton_K2Node_ComponentBoundEvent_2_OnButtonBaseFocused__DelegateSignature");
static_assert(offsetof(WBP_Raw_Attributes_Display_C_BndEvt__WBP_Raw_Attributes_Display_WBP_BaseButton_K2Node_ComponentBoundEvent_2_OnButtonBaseFocused__DelegateSignature, Button) == 0x000000, "Member 'WBP_Raw_Attributes_Display_C_BndEvt__WBP_Raw_Attributes_Display_WBP_BaseButton_K2Node_ComponentBoundEvent_2_OnButtonBaseFocused__DelegateSignature::Button' has a wrong offset!");

// Function WBP_Raw_Attributes_Display.WBP_Raw_Attributes_Display_C.BndEvt__WBP_Raw_Attributes_Display_WBP_BaseButton_K2Node_ComponentBoundEvent_3_OnButtonBaseUnfocused__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Raw_Attributes_Display_C_BndEvt__WBP_Raw_Attributes_Display_WBP_BaseButton_K2Node_ComponentBoundEvent_3_OnButtonBaseUnfocused__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Raw_Attributes_Display_C_BndEvt__WBP_Raw_Attributes_Display_WBP_BaseButton_K2Node_ComponentBoundEvent_3_OnButtonBaseUnfocused__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Raw_Attributes_Display_C_BndEvt__WBP_Raw_Attributes_Display_WBP_BaseButton_K2Node_ComponentBoundEvent_3_OnButtonBaseUnfocused__DelegateSignature");
static_assert(sizeof(WBP_Raw_Attributes_Display_C_BndEvt__WBP_Raw_Attributes_Display_WBP_BaseButton_K2Node_ComponentBoundEvent_3_OnButtonBaseUnfocused__DelegateSignature) == 0x000008, "Wrong size on WBP_Raw_Attributes_Display_C_BndEvt__WBP_Raw_Attributes_Display_WBP_BaseButton_K2Node_ComponentBoundEvent_3_OnButtonBaseUnfocused__DelegateSignature");
static_assert(offsetof(WBP_Raw_Attributes_Display_C_BndEvt__WBP_Raw_Attributes_Display_WBP_BaseButton_K2Node_ComponentBoundEvent_3_OnButtonBaseUnfocused__DelegateSignature, Button) == 0x000000, "Member 'WBP_Raw_Attributes_Display_C_BndEvt__WBP_Raw_Attributes_Display_WBP_BaseButton_K2Node_ComponentBoundEvent_3_OnButtonBaseUnfocused__DelegateSignature::Button' has a wrong offset!");

// Function WBP_Raw_Attributes_Display.WBP_Raw_Attributes_Display_C.ExecuteUbergraph_WBP_Raw_Attributes_Display
// 0x01F8 (0x01F8 - 0x0000)
struct WBP_Raw_Attributes_Display_C_ExecuteUbergraph_WBP_Raw_Attributes_Display final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0008(0x0010)()
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F[0x1];                                       // 0x001F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_Value_1;                        // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetAttributeDisplayName_ReturnValue;      // 0x0028(0x0010)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x0038(0x0010)()
	bool                                          K2Node_CustomEvent_Enabled;                        // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_3;               // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_2;               // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_1; // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0080(0x0010)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0090(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x00A0(0x0048)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00E8(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0130(0x0010)(ReferenceParm)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0140(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Format_ReturnValue;                       // 0x0150(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Format_ReturnValue_1;                     // 0x0160(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_171[0x3];                                      // 0x0171(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_Value;                          // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_UpgradeAllowed;                 // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_179[0x3];                                      // 0x0179(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_181[0x3];                                      // 0x0181(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_DowngradeAllowed;               // 0x0189(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x018A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_SetActive;                      // 0x018B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x018C(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x01A0(0x0014)()
	struct FSlateColor                            K2Node_Select_Default_2;                           // 0x01B4(0x0014)()
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x01C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x01CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1CB[0x5];                                      // 0x01CB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_1;               // 0x01D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x01D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E1[0x3];                                      // 0x01E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Wrap_ReturnValue;                         // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_3;                           // 0x01EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1ED[0x3];                                      // 0x01ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Wrap_ReturnValue_1;                       // 0x01F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Raw_Attributes_Display_C_ExecuteUbergraph_WBP_Raw_Attributes_Display) == 0x000008, "Wrong alignment on WBP_Raw_Attributes_Display_C_ExecuteUbergraph_WBP_Raw_Attributes_Display");
static_assert(sizeof(WBP_Raw_Attributes_Display_C_ExecuteUbergraph_WBP_Raw_Attributes_Display) == 0x0001F8, "Wrong size on WBP_Raw_Attributes_Display_C_ExecuteUbergraph_WBP_Raw_Attributes_Display");
static_assert(offsetof(WBP_Raw_Attributes_Display_C_ExecuteUbergraph_WBP_Raw_Attributes_Display, EntryPoint) == 0x000000, "Member 'WBP_Raw_Attributes_Display_C_ExecuteUbergraph_WBP_Raw_Attributes_Display::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Raw_Attributes_Display_C_ExecuteUbergraph_WBP_Raw_Attributes_Display, Temp_bool_Variable) == 0x000004, "Member 'WBP_Raw_Attributes_Display_C_ExecuteUbergraph_WBP_Raw_Attributes_Display::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Raw_Attributes_Display_C_ExecuteUbergraph_WBP_Raw_Attributes_Display, CallFunc_Conv_IntToText_ReturnValue) == 0x000008, "Member 'WBP_Raw_Attributes_Display_C_ExecuteUbergraph_WBP_Raw_Attributes_Display::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Raw_Attributes_Display_C_ExecuteUbergraph_WBP_Raw_Attributes_Display, Temp_byte_Variable) == 0x000018, "Member 'WBP_Raw_Attributes_Display_C_ExecuteUbergraph_WBP_Raw_Attributes_Display::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Raw_Attributes_Display_C_ExecuteUbergraph_WBP_Raw_Attributes_Display, Temp_byte_Variable_1) == 0x000019, "Member 'WBP_Raw_Attributes_Display_C_ExecuteUbergraph_WBP_Raw_Attributes_Display::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Raw_Attributes_Display_C_ExecuteUbergraph_WBP_Raw_Attributes_Display, Temp_bool_Variable_1) == 0x00001A, "Member 'WBP_Raw_Attributes_Display_C_ExecuteUbergraph_WBP_Raw_Attributes_Display::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Raw_Attributes_Display_C_ExecuteUbergraph_WBP_Raw_Attributes_Display, Temp_byte_Variable_2) == 0x00001B, "Member 'WBP_Raw_Attributes_Display_C_ExecuteUbergraph_WBP_Raw_Attributes_Display::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_Raw_Attributes_Display_C_ExecuteUbergraph_WBP_Raw_Attributes_Display, Temp_byte_Variable_3) == 0x00001C, "Member 'WBP_Raw_Attributes_Display_C_ExecuteUbergraph_WBP_Raw_Attributes_Display::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_Raw_Attributes_Display_C_ExecuteUbergraph_WBP_Raw_Attributes_Display, Temp_bool_Variable_2) == 0x00001D, "Member 'WBP_Raw_Attributes_Display_C_ExecuteUbergraph_WBP_Raw_Attributes_Display::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_Raw_Attributes_Display_C_ExecuteUbergraph_WBP_Raw_Attributes_Display, K2Node_Event_IsDesignTime) == 0x00001E, "Member 'WBP_Raw_Attributes_Display_C_ExecuteUbergraph_WBP_Raw_Attributes_Display::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_Raw_Attributes_Display_C_ExecuteUbergraph_WBP_Raw_Attributes_Display, K2Node_CustomEvent_Value_1) == 0x000020, "Member 'WBP_Raw_Attributes_Display_C_ExecuteUbergraph_WBP_Raw_Attributes_Display::K2Node_CustomEvent_Value_1' has a wrong offset!");
static_assert(offsetof(WBP_Raw_Attributes_Display_C_ExecuteUbergraph_WBP_Raw_Attributes_Display, CallFunc_GetAttributeDisplayName_ReturnValue) == 0x000028, "Member 'WBP_Raw_Attributes_Display_C_ExecuteUbergraph_WBP_Raw_Attributes_Display::CallFunc_GetAttributeDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Raw_Attributes_Display_C_ExecuteUbergraph_WBP_Raw_Attributes_Display, CallFunc_Conv_IntToText_ReturnValue_1) == 0x000038, "Member 'WBP_Raw_Attributes_Display_C_ExecuteUbergraph_WBP_Raw_Attributes_Display::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Raw_Attributes_Display_C_ExecuteUbergraph_WBP_Raw_Attributes_Display, K2Node_CustomEvent_Enabled) == 0x000048, "Member 'WBP_Raw_Attributes_Display_C_ExecuteUbergraph_WBP_Raw_Attributes_Display::K2Node_CustomEvent_Enabled' has a wrong offset!");
static_assert(offsetof(WBP_Raw_Attributes_Display_C_ExecuteUbergraph_WBP_Raw_Attributes_Display, CallFunc_Not_PreBool_ReturnValue) == 0x000049, "Member 'WBP_Raw_Attributes_Display_C_ExecuteUbergraph_WBP_Raw_Attributes_Display::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Raw_Attributes_Display_C_ExecuteUbergraph_WBP_Raw_Attributes_Display, K2Node_ComponentBoundEvent_Button_3) == 0x000050, "Member 'WBP_Raw_Attributes_Display_C_ExecuteUbergraph_WBP_Raw_Attributes_Display::K2Node_ComponentBoundEvent_Button_3' has a wrong offset!");
static_assert(offsetof(WBP_Raw_Attributes_Display_C_ExecuteUbergraph_WBP_Raw_Attributes_Display, K2Node_ComponentBoundEvent_Button_2) == 0x000058, "Member 'WBP_Raw_Attributes_Display_C_ExecuteUbergraph_WBP_Raw_Attributes_Display::K2Node_ComponentBoundEvent_Button_2' has a wrong offset!");
static_assert(offsetof(WBP_Raw_Attributes_Display_C_ExecuteUbergraph_WBP_Raw_Attributes_Display, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x000060, "Member 'WBP_Raw_Attributes_Display_C_ExecuteUbergraph_WBP_Raw_Attributes_Display::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Raw_Attributes_Display_C_ExecuteUbergraph_WBP_Raw_Attributes_Display, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_1) == 0x000070, "Member 'WBP_Raw_Attributes_Display_C_ExecuteUbergraph_WBP_Raw_Attributes_Display::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Raw_Attributes_Display_C_ExecuteUbergraph_WBP_Raw_Attributes_Display, CallFunc_Conv_StringToText_ReturnValue) == 0x000080, "Member 'WBP_Raw_Attributes_Display_C_ExecuteUbergraph_WBP_Raw_Attributes_Display::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Raw_Attributes_Display_C_ExecuteUbergraph_WBP_Raw_Attributes_Display, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000090, "Member 'WBP_Raw_Attributes_Display_C_ExecuteUbergraph_WBP_Raw_Attributes_Display::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Raw_Attributes_Display_C_ExecuteUbergraph_WBP_Raw_Attributes_Display, K2Node_MakeStruct_FormatArgumentData) == 0x0000A0, "Member 'WBP_Raw_Attributes_Display_C_ExecuteUbergraph_WBP_Raw_Attributes_Display::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_Raw_Attributes_Display_C_ExecuteUbergraph_WBP_Raw_Attributes_Display, K2Node_MakeStruct_FormatArgumentData_1) == 0x0000E8, "Member 'WBP_Raw_Attributes_Display_C_ExecuteUbergraph_WBP_Raw_Attributes_Display::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WBP_Raw_Attributes_Display_C_ExecuteUbergraph_WBP_Raw_Attributes_Display, K2Node_MakeArray_Array) == 0x000130, "Member 'WBP_Raw_Attributes_Display_C_ExecuteUbergraph_WBP_Raw_Attributes_Display::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_Raw_Attributes_Display_C_ExecuteUbergraph_WBP_Raw_Attributes_Display, K2Node_MakeArray_Array_1) == 0x000140, "Member 'WBP_Raw_Attributes_Display_C_ExecuteUbergraph_WBP_Raw_Attributes_Display::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(WBP_Raw_Attributes_Display_C_ExecuteUbergraph_WBP_Raw_Attributes_Display, CallFunc_Format_ReturnValue) == 0x000150, "Member 'WBP_Raw_Attributes_Display_C_ExecuteUbergraph_WBP_Raw_Attributes_Display::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Raw_Attributes_Display_C_ExecuteUbergraph_WBP_Raw_Attributes_Display, CallFunc_Format_ReturnValue_1) == 0x000160, "Member 'WBP_Raw_Attributes_Display_C_ExecuteUbergraph_WBP_Raw_Attributes_Display::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Raw_Attributes_Display_C_ExecuteUbergraph_WBP_Raw_Attributes_Display, Temp_byte_Variable_4) == 0x000170, "Member 'WBP_Raw_Attributes_Display_C_ExecuteUbergraph_WBP_Raw_Attributes_Display::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_Raw_Attributes_Display_C_ExecuteUbergraph_WBP_Raw_Attributes_Display, K2Node_CustomEvent_Value) == 0x000174, "Member 'WBP_Raw_Attributes_Display_C_ExecuteUbergraph_WBP_Raw_Attributes_Display::K2Node_CustomEvent_Value' has a wrong offset!");
static_assert(offsetof(WBP_Raw_Attributes_Display_C_ExecuteUbergraph_WBP_Raw_Attributes_Display, K2Node_CustomEvent_UpgradeAllowed) == 0x000178, "Member 'WBP_Raw_Attributes_Display_C_ExecuteUbergraph_WBP_Raw_Attributes_Display::K2Node_CustomEvent_UpgradeAllowed' has a wrong offset!");
static_assert(offsetof(WBP_Raw_Attributes_Display_C_ExecuteUbergraph_WBP_Raw_Attributes_Display, CallFunc_Subtract_IntInt_ReturnValue) == 0x00017C, "Member 'WBP_Raw_Attributes_Display_C_ExecuteUbergraph_WBP_Raw_Attributes_Display::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Raw_Attributes_Display_C_ExecuteUbergraph_WBP_Raw_Attributes_Display, K2Node_Select_Default) == 0x000180, "Member 'WBP_Raw_Attributes_Display_C_ExecuteUbergraph_WBP_Raw_Attributes_Display::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Raw_Attributes_Display_C_ExecuteUbergraph_WBP_Raw_Attributes_Display, CallFunc_Add_IntInt_ReturnValue) == 0x000184, "Member 'WBP_Raw_Attributes_Display_C_ExecuteUbergraph_WBP_Raw_Attributes_Display::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Raw_Attributes_Display_C_ExecuteUbergraph_WBP_Raw_Attributes_Display, Temp_byte_Variable_5) == 0x000188, "Member 'WBP_Raw_Attributes_Display_C_ExecuteUbergraph_WBP_Raw_Attributes_Display::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_Raw_Attributes_Display_C_ExecuteUbergraph_WBP_Raw_Attributes_Display, K2Node_CustomEvent_DowngradeAllowed) == 0x000189, "Member 'WBP_Raw_Attributes_Display_C_ExecuteUbergraph_WBP_Raw_Attributes_Display::K2Node_CustomEvent_DowngradeAllowed' has a wrong offset!");
static_assert(offsetof(WBP_Raw_Attributes_Display_C_ExecuteUbergraph_WBP_Raw_Attributes_Display, K2Node_Select_Default_1) == 0x00018A, "Member 'WBP_Raw_Attributes_Display_C_ExecuteUbergraph_WBP_Raw_Attributes_Display::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_Raw_Attributes_Display_C_ExecuteUbergraph_WBP_Raw_Attributes_Display, K2Node_CustomEvent_SetActive) == 0x00018B, "Member 'WBP_Raw_Attributes_Display_C_ExecuteUbergraph_WBP_Raw_Attributes_Display::K2Node_CustomEvent_SetActive' has a wrong offset!");
static_assert(offsetof(WBP_Raw_Attributes_Display_C_ExecuteUbergraph_WBP_Raw_Attributes_Display, K2Node_MakeStruct_SlateColor) == 0x00018C, "Member 'WBP_Raw_Attributes_Display_C_ExecuteUbergraph_WBP_Raw_Attributes_Display::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(WBP_Raw_Attributes_Display_C_ExecuteUbergraph_WBP_Raw_Attributes_Display, K2Node_MakeStruct_SlateColor_1) == 0x0001A0, "Member 'WBP_Raw_Attributes_Display_C_ExecuteUbergraph_WBP_Raw_Attributes_Display::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(WBP_Raw_Attributes_Display_C_ExecuteUbergraph_WBP_Raw_Attributes_Display, K2Node_Select_Default_2) == 0x0001B4, "Member 'WBP_Raw_Attributes_Display_C_ExecuteUbergraph_WBP_Raw_Attributes_Display::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(WBP_Raw_Attributes_Display_C_ExecuteUbergraph_WBP_Raw_Attributes_Display, CallFunc_Greater_IntInt_ReturnValue) == 0x0001C8, "Member 'WBP_Raw_Attributes_Display_C_ExecuteUbergraph_WBP_Raw_Attributes_Display::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Raw_Attributes_Display_C_ExecuteUbergraph_WBP_Raw_Attributes_Display, CallFunc_Not_PreBool_ReturnValue_1) == 0x0001C9, "Member 'WBP_Raw_Attributes_Display_C_ExecuteUbergraph_WBP_Raw_Attributes_Display::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Raw_Attributes_Display_C_ExecuteUbergraph_WBP_Raw_Attributes_Display, CallFunc_Not_PreBool_ReturnValue_2) == 0x0001CA, "Member 'WBP_Raw_Attributes_Display_C_ExecuteUbergraph_WBP_Raw_Attributes_Display::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Raw_Attributes_Display_C_ExecuteUbergraph_WBP_Raw_Attributes_Display, K2Node_ComponentBoundEvent_Button_1) == 0x0001D0, "Member 'WBP_Raw_Attributes_Display_C_ExecuteUbergraph_WBP_Raw_Attributes_Display::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(WBP_Raw_Attributes_Display_C_ExecuteUbergraph_WBP_Raw_Attributes_Display, K2Node_ComponentBoundEvent_Button) == 0x0001D8, "Member 'WBP_Raw_Attributes_Display_C_ExecuteUbergraph_WBP_Raw_Attributes_Display::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(WBP_Raw_Attributes_Display_C_ExecuteUbergraph_WBP_Raw_Attributes_Display, Temp_bool_Variable_3) == 0x0001E0, "Member 'WBP_Raw_Attributes_Display_C_ExecuteUbergraph_WBP_Raw_Attributes_Display::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_Raw_Attributes_Display_C_ExecuteUbergraph_WBP_Raw_Attributes_Display, CallFunc_Add_IntInt_ReturnValue_1) == 0x0001E4, "Member 'WBP_Raw_Attributes_Display_C_ExecuteUbergraph_WBP_Raw_Attributes_Display::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Raw_Attributes_Display_C_ExecuteUbergraph_WBP_Raw_Attributes_Display, CallFunc_Wrap_ReturnValue) == 0x0001E8, "Member 'WBP_Raw_Attributes_Display_C_ExecuteUbergraph_WBP_Raw_Attributes_Display::CallFunc_Wrap_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Raw_Attributes_Display_C_ExecuteUbergraph_WBP_Raw_Attributes_Display, K2Node_Select_Default_3) == 0x0001EC, "Member 'WBP_Raw_Attributes_Display_C_ExecuteUbergraph_WBP_Raw_Attributes_Display::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(WBP_Raw_Attributes_Display_C_ExecuteUbergraph_WBP_Raw_Attributes_Display, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x0001F0, "Member 'WBP_Raw_Attributes_Display_C_ExecuteUbergraph_WBP_Raw_Attributes_Display::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Raw_Attributes_Display_C_ExecuteUbergraph_WBP_Raw_Attributes_Display, CallFunc_Wrap_ReturnValue_1) == 0x0001F4, "Member 'WBP_Raw_Attributes_Display_C_ExecuteUbergraph_WBP_Raw_Attributes_Display::CallFunc_Wrap_ReturnValue_1' has a wrong offset!");

// Function WBP_Raw_Attributes_Display.WBP_Raw_Attributes_Display_C.OnFocusReceived
// 0x01B0 (0x01B0 - 0x0000)
struct WBP_Raw_Attributes_Display_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Unhandled_ReturnValue;                    // 0x00F8(0x00B8)()
};
static_assert(alignof(WBP_Raw_Attributes_Display_C_OnFocusReceived) == 0x000008, "Wrong alignment on WBP_Raw_Attributes_Display_C_OnFocusReceived");
static_assert(sizeof(WBP_Raw_Attributes_Display_C_OnFocusReceived) == 0x0001B0, "Wrong size on WBP_Raw_Attributes_Display_C_OnFocusReceived");
static_assert(offsetof(WBP_Raw_Attributes_Display_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'WBP_Raw_Attributes_Display_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Raw_Attributes_Display_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'WBP_Raw_Attributes_Display_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(WBP_Raw_Attributes_Display_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'WBP_Raw_Attributes_Display_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Raw_Attributes_Display_C_OnFocusReceived, CallFunc_Unhandled_ReturnValue) == 0x0000F8, "Member 'WBP_Raw_Attributes_Display_C_OnFocusReceived::CallFunc_Unhandled_ReturnValue' has a wrong offset!");

// Function WBP_Raw_Attributes_Display.WBP_Raw_Attributes_Display_C.OnNavigation
// 0x0002 (0x0002 - 0x0000)
struct WBP_Raw_Attributes_Display_C_OnNavigation final
{
public:
	EUINavigation                                 NavigationType;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Raw_Attributes_Display_C_OnNavigation) == 0x000001, "Wrong alignment on WBP_Raw_Attributes_Display_C_OnNavigation");
static_assert(sizeof(WBP_Raw_Attributes_Display_C_OnNavigation) == 0x000002, "Wrong size on WBP_Raw_Attributes_Display_C_OnNavigation");
static_assert(offsetof(WBP_Raw_Attributes_Display_C_OnNavigation, NavigationType) == 0x000000, "Member 'WBP_Raw_Attributes_Display_C_OnNavigation::NavigationType' has a wrong offset!");
static_assert(offsetof(WBP_Raw_Attributes_Display_C_OnNavigation, ReturnValue) == 0x000001, "Member 'WBP_Raw_Attributes_Display_C_OnNavigation::ReturnValue' has a wrong offset!");

// Function WBP_Raw_Attributes_Display.WBP_Raw_Attributes_Display_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_Raw_Attributes_Display_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Raw_Attributes_Display_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_Raw_Attributes_Display_C_PreConstruct");
static_assert(sizeof(WBP_Raw_Attributes_Display_C_PreConstruct) == 0x000001, "Wrong size on WBP_Raw_Attributes_Display_C_PreConstruct");
static_assert(offsetof(WBP_Raw_Attributes_Display_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_Raw_Attributes_Display_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_Raw_Attributes_Display.WBP_Raw_Attributes_Display_C.SetAllowedMaxValue
// 0x0008 (0x0008 - 0x0000)
struct WBP_Raw_Attributes_Display_C_SetAllowedMaxValue final
{
public:
	int32                                         AllowedMaxValue_0;                                 // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue;                        // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Raw_Attributes_Display_C_SetAllowedMaxValue) == 0x000004, "Wrong alignment on WBP_Raw_Attributes_Display_C_SetAllowedMaxValue");
static_assert(sizeof(WBP_Raw_Attributes_Display_C_SetAllowedMaxValue) == 0x000008, "Wrong size on WBP_Raw_Attributes_Display_C_SetAllowedMaxValue");
static_assert(offsetof(WBP_Raw_Attributes_Display_C_SetAllowedMaxValue, AllowedMaxValue_0) == 0x000000, "Member 'WBP_Raw_Attributes_Display_C_SetAllowedMaxValue::AllowedMaxValue_0' has a wrong offset!");
static_assert(offsetof(WBP_Raw_Attributes_Display_C_SetAllowedMaxValue, CallFunc_Clamp_ReturnValue) == 0x000004, "Member 'WBP_Raw_Attributes_Display_C_SetAllowedMaxValue::CallFunc_Clamp_ReturnValue' has a wrong offset!");

// Function WBP_Raw_Attributes_Display.WBP_Raw_Attributes_Display_C.SetAllowedMinValue
// 0x0008 (0x0008 - 0x0000)
struct WBP_Raw_Attributes_Display_C_SetAllowedMinValue final
{
public:
	int32                                         AllowedMinValue_0;                                 // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue;                        // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Raw_Attributes_Display_C_SetAllowedMinValue) == 0x000004, "Wrong alignment on WBP_Raw_Attributes_Display_C_SetAllowedMinValue");
static_assert(sizeof(WBP_Raw_Attributes_Display_C_SetAllowedMinValue) == 0x000008, "Wrong size on WBP_Raw_Attributes_Display_C_SetAllowedMinValue");
static_assert(offsetof(WBP_Raw_Attributes_Display_C_SetAllowedMinValue, AllowedMinValue_0) == 0x000000, "Member 'WBP_Raw_Attributes_Display_C_SetAllowedMinValue::AllowedMinValue_0' has a wrong offset!");
static_assert(offsetof(WBP_Raw_Attributes_Display_C_SetAllowedMinValue, CallFunc_Clamp_ReturnValue) == 0x000004, "Member 'WBP_Raw_Attributes_Display_C_SetAllowedMinValue::CallFunc_Clamp_ReturnValue' has a wrong offset!");

// Function WBP_Raw_Attributes_Display.WBP_Raw_Attributes_Display_C.SetAttributeScaling
// 0x0028 (0x0028 - 0x0000)
struct WBP_Raw_Attributes_Display_C_SetAttributeScaling final
{
public:
	EAttributeScalingGrade                        InAttributeScaling;                                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetAttributeScalingGradeDisplayName_ReturnValue; // 0x0008(0x0010)()
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x001F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Raw_Attributes_Display_C_SetAttributeScaling) == 0x000008, "Wrong alignment on WBP_Raw_Attributes_Display_C_SetAttributeScaling");
static_assert(sizeof(WBP_Raw_Attributes_Display_C_SetAttributeScaling) == 0x000028, "Wrong size on WBP_Raw_Attributes_Display_C_SetAttributeScaling");
static_assert(offsetof(WBP_Raw_Attributes_Display_C_SetAttributeScaling, InAttributeScaling) == 0x000000, "Member 'WBP_Raw_Attributes_Display_C_SetAttributeScaling::InAttributeScaling' has a wrong offset!");
static_assert(offsetof(WBP_Raw_Attributes_Display_C_SetAttributeScaling, Temp_byte_Variable) == 0x000001, "Member 'WBP_Raw_Attributes_Display_C_SetAttributeScaling::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Raw_Attributes_Display_C_SetAttributeScaling, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000002, "Member 'WBP_Raw_Attributes_Display_C_SetAttributeScaling::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Raw_Attributes_Display_C_SetAttributeScaling, CallFunc_GetAttributeScalingGradeDisplayName_ReturnValue) == 0x000008, "Member 'WBP_Raw_Attributes_Display_C_SetAttributeScaling::CallFunc_GetAttributeScalingGradeDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Raw_Attributes_Display_C_SetAttributeScaling, Temp_byte_Variable_1) == 0x000018, "Member 'WBP_Raw_Attributes_Display_C_SetAttributeScaling::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Raw_Attributes_Display_C_SetAttributeScaling, Temp_bool_Variable) == 0x000019, "Member 'WBP_Raw_Attributes_Display_C_SetAttributeScaling::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Raw_Attributes_Display_C_SetAttributeScaling, Temp_byte_Variable_2) == 0x00001A, "Member 'WBP_Raw_Attributes_Display_C_SetAttributeScaling::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_Raw_Attributes_Display_C_SetAttributeScaling, Temp_byte_Variable_3) == 0x00001B, "Member 'WBP_Raw_Attributes_Display_C_SetAttributeScaling::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_Raw_Attributes_Display_C_SetAttributeScaling, Temp_bool_Variable_1) == 0x00001C, "Member 'WBP_Raw_Attributes_Display_C_SetAttributeScaling::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Raw_Attributes_Display_C_SetAttributeScaling, K2Node_Select_Default) == 0x00001D, "Member 'WBP_Raw_Attributes_Display_C_SetAttributeScaling::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Raw_Attributes_Display_C_SetAttributeScaling, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x00001E, "Member 'WBP_Raw_Attributes_Display_C_SetAttributeScaling::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Raw_Attributes_Display_C_SetAttributeScaling, CallFunc_BooleanAND_ReturnValue) == 0x00001F, "Member 'WBP_Raw_Attributes_Display_C_SetAttributeScaling::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Raw_Attributes_Display_C_SetAttributeScaling, K2Node_Select_Default_1) == 0x000020, "Member 'WBP_Raw_Attributes_Display_C_SetAttributeScaling::K2Node_Select_Default_1' has a wrong offset!");

// Function WBP_Raw_Attributes_Display.WBP_Raw_Attributes_Display_C.SetAttributeValue
// 0x0004 (0x0004 - 0x0000)
struct WBP_Raw_Attributes_Display_C_SetAttributeValue final
{
public:
	int32                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Raw_Attributes_Display_C_SetAttributeValue) == 0x000004, "Wrong alignment on WBP_Raw_Attributes_Display_C_SetAttributeValue");
static_assert(sizeof(WBP_Raw_Attributes_Display_C_SetAttributeValue) == 0x000004, "Wrong size on WBP_Raw_Attributes_Display_C_SetAttributeValue");
static_assert(offsetof(WBP_Raw_Attributes_Display_C_SetAttributeValue, Value) == 0x000000, "Member 'WBP_Raw_Attributes_Display_C_SetAttributeValue::Value' has a wrong offset!");

// Function WBP_Raw_Attributes_Display.WBP_Raw_Attributes_Display_C.SetColorPreviewAttributeValue
// 0x0001 (0x0001 - 0x0000)
struct WBP_Raw_Attributes_Display_C_SetColorPreviewAttributeValue final
{
public:
	bool                                          SetActive;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Raw_Attributes_Display_C_SetColorPreviewAttributeValue) == 0x000001, "Wrong alignment on WBP_Raw_Attributes_Display_C_SetColorPreviewAttributeValue");
static_assert(sizeof(WBP_Raw_Attributes_Display_C_SetColorPreviewAttributeValue) == 0x000001, "Wrong size on WBP_Raw_Attributes_Display_C_SetColorPreviewAttributeValue");
static_assert(offsetof(WBP_Raw_Attributes_Display_C_SetColorPreviewAttributeValue, SetActive) == 0x000000, "Member 'WBP_Raw_Attributes_Display_C_SetColorPreviewAttributeValue::SetActive' has a wrong offset!");

// Function WBP_Raw_Attributes_Display.WBP_Raw_Attributes_Display_C.SetDowngradeAllowed
// 0x0001 (0x0001 - 0x0000)
struct WBP_Raw_Attributes_Display_C_SetDowngradeAllowed final
{
public:
	bool                                          DowngradeAllowed;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Raw_Attributes_Display_C_SetDowngradeAllowed) == 0x000001, "Wrong alignment on WBP_Raw_Attributes_Display_C_SetDowngradeAllowed");
static_assert(sizeof(WBP_Raw_Attributes_Display_C_SetDowngradeAllowed) == 0x000001, "Wrong size on WBP_Raw_Attributes_Display_C_SetDowngradeAllowed");
static_assert(offsetof(WBP_Raw_Attributes_Display_C_SetDowngradeAllowed, DowngradeAllowed) == 0x000000, "Member 'WBP_Raw_Attributes_Display_C_SetDowngradeAllowed::DowngradeAllowed' has a wrong offset!");

// Function WBP_Raw_Attributes_Display.WBP_Raw_Attributes_Display_C.SetModificationEnabled
// 0x0001 (0x0001 - 0x0000)
struct WBP_Raw_Attributes_Display_C_SetModificationEnabled final
{
public:
	bool                                          Enabled;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Raw_Attributes_Display_C_SetModificationEnabled) == 0x000001, "Wrong alignment on WBP_Raw_Attributes_Display_C_SetModificationEnabled");
static_assert(sizeof(WBP_Raw_Attributes_Display_C_SetModificationEnabled) == 0x000001, "Wrong size on WBP_Raw_Attributes_Display_C_SetModificationEnabled");
static_assert(offsetof(WBP_Raw_Attributes_Display_C_SetModificationEnabled, Enabled) == 0x000000, "Member 'WBP_Raw_Attributes_Display_C_SetModificationEnabled::Enabled' has a wrong offset!");

// Function WBP_Raw_Attributes_Display.WBP_Raw_Attributes_Display_C.SetPreviewAttributeValue
// 0x0004 (0x0004 - 0x0000)
struct WBP_Raw_Attributes_Display_C_SetPreviewAttributeValue final
{
public:
	int32                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Raw_Attributes_Display_C_SetPreviewAttributeValue) == 0x000004, "Wrong alignment on WBP_Raw_Attributes_Display_C_SetPreviewAttributeValue");
static_assert(sizeof(WBP_Raw_Attributes_Display_C_SetPreviewAttributeValue) == 0x000004, "Wrong size on WBP_Raw_Attributes_Display_C_SetPreviewAttributeValue");
static_assert(offsetof(WBP_Raw_Attributes_Display_C_SetPreviewAttributeValue, Value) == 0x000000, "Member 'WBP_Raw_Attributes_Display_C_SetPreviewAttributeValue::Value' has a wrong offset!");

// Function WBP_Raw_Attributes_Display.WBP_Raw_Attributes_Display_C.SetUpgradeAllowed
// 0x0001 (0x0001 - 0x0000)
struct WBP_Raw_Attributes_Display_C_SetUpgradeAllowed final
{
public:
	bool                                          UpgradeAllowed;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Raw_Attributes_Display_C_SetUpgradeAllowed) == 0x000001, "Wrong alignment on WBP_Raw_Attributes_Display_C_SetUpgradeAllowed");
static_assert(sizeof(WBP_Raw_Attributes_Display_C_SetUpgradeAllowed) == 0x000001, "Wrong size on WBP_Raw_Attributes_Display_C_SetUpgradeAllowed");
static_assert(offsetof(WBP_Raw_Attributes_Display_C_SetUpgradeAllowed, UpgradeAllowed) == 0x000000, "Member 'WBP_Raw_Attributes_Display_C_SetUpgradeAllowed::UpgradeAllowed' has a wrong offset!");

}

