#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_jRPG_StatSlot

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_jRPG_StatSlot.WBP_jRPG_StatSlot_C.ExecuteUbergraph_WBP_jRPG_StatSlot
// 0x0028 (0x0028 - 0x0000)
struct WBP_jRPG_StatSlot_C_ExecuteUbergraph_WBP_jRPG_StatSlot final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_StatTypeToText_Text;                      // 0x0008(0x0010)()
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_SetFieldsInStruct_Size_ImplicitCast;        // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_jRPG_StatSlot_C_ExecuteUbergraph_WBP_jRPG_StatSlot) == 0x000008, "Wrong alignment on WBP_jRPG_StatSlot_C_ExecuteUbergraph_WBP_jRPG_StatSlot");
static_assert(sizeof(WBP_jRPG_StatSlot_C_ExecuteUbergraph_WBP_jRPG_StatSlot) == 0x000028, "Wrong size on WBP_jRPG_StatSlot_C_ExecuteUbergraph_WBP_jRPG_StatSlot");
static_assert(offsetof(WBP_jRPG_StatSlot_C_ExecuteUbergraph_WBP_jRPG_StatSlot, EntryPoint) == 0x000000, "Member 'WBP_jRPG_StatSlot_C_ExecuteUbergraph_WBP_jRPG_StatSlot::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_jRPG_StatSlot_C_ExecuteUbergraph_WBP_jRPG_StatSlot, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WBP_jRPG_StatSlot_C_ExecuteUbergraph_WBP_jRPG_StatSlot::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_jRPG_StatSlot_C_ExecuteUbergraph_WBP_jRPG_StatSlot, CallFunc_StatTypeToText_Text) == 0x000008, "Member 'WBP_jRPG_StatSlot_C_ExecuteUbergraph_WBP_jRPG_StatSlot::CallFunc_StatTypeToText_Text' has a wrong offset!");
static_assert(offsetof(WBP_jRPG_StatSlot_C_ExecuteUbergraph_WBP_jRPG_StatSlot, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000018, "Member 'WBP_jRPG_StatSlot_C_ExecuteUbergraph_WBP_jRPG_StatSlot::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_jRPG_StatSlot_C_ExecuteUbergraph_WBP_jRPG_StatSlot, CallFunc_Not_PreBool_ReturnValue) == 0x000020, "Member 'WBP_jRPG_StatSlot_C_ExecuteUbergraph_WBP_jRPG_StatSlot::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_jRPG_StatSlot_C_ExecuteUbergraph_WBP_jRPG_StatSlot, K2Node_SetFieldsInStruct_Size_ImplicitCast) == 0x000024, "Member 'WBP_jRPG_StatSlot_C_ExecuteUbergraph_WBP_jRPG_StatSlot::K2Node_SetFieldsInStruct_Size_ImplicitCast' has a wrong offset!");

// Function WBP_jRPG_StatSlot.WBP_jRPG_StatSlot_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_jRPG_StatSlot_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_jRPG_StatSlot_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_jRPG_StatSlot_C_PreConstruct");
static_assert(sizeof(WBP_jRPG_StatSlot_C_PreConstruct) == 0x000001, "Wrong size on WBP_jRPG_StatSlot_C_PreConstruct");
static_assert(offsetof(WBP_jRPG_StatSlot_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_jRPG_StatSlot_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_jRPG_StatSlot.WBP_jRPG_StatSlot_C.SetComparisonPartToHigher
// 0x0030 (0x0030 - 0x0000)
struct WBP_jRPG_StatSlot_C_SetComparisonPartToHigher final
{
public:
	double                                        NewValue;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0008(0x0014)()
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue;            // 0x0020(0x0010)()
};
static_assert(alignof(WBP_jRPG_StatSlot_C_SetComparisonPartToHigher) == 0x000008, "Wrong alignment on WBP_jRPG_StatSlot_C_SetComparisonPartToHigher");
static_assert(sizeof(WBP_jRPG_StatSlot_C_SetComparisonPartToHigher) == 0x000030, "Wrong size on WBP_jRPG_StatSlot_C_SetComparisonPartToHigher");
static_assert(offsetof(WBP_jRPG_StatSlot_C_SetComparisonPartToHigher, NewValue) == 0x000000, "Member 'WBP_jRPG_StatSlot_C_SetComparisonPartToHigher::NewValue' has a wrong offset!");
static_assert(offsetof(WBP_jRPG_StatSlot_C_SetComparisonPartToHigher, K2Node_MakeStruct_SlateColor) == 0x000008, "Member 'WBP_jRPG_StatSlot_C_SetComparisonPartToHigher::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(WBP_jRPG_StatSlot_C_SetComparisonPartToHigher, CallFunc_Conv_DoubleToText_ReturnValue) == 0x000020, "Member 'WBP_jRPG_StatSlot_C_SetComparisonPartToHigher::CallFunc_Conv_DoubleToText_ReturnValue' has a wrong offset!");

// Function WBP_jRPG_StatSlot.WBP_jRPG_StatSlot_C.SetComparisonPartToLower
// 0x0030 (0x0030 - 0x0000)
struct WBP_jRPG_StatSlot_C_SetComparisonPartToLower final
{
public:
	double                                        NewValue;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0008(0x0014)()
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue;            // 0x0020(0x0010)()
};
static_assert(alignof(WBP_jRPG_StatSlot_C_SetComparisonPartToLower) == 0x000008, "Wrong alignment on WBP_jRPG_StatSlot_C_SetComparisonPartToLower");
static_assert(sizeof(WBP_jRPG_StatSlot_C_SetComparisonPartToLower) == 0x000030, "Wrong size on WBP_jRPG_StatSlot_C_SetComparisonPartToLower");
static_assert(offsetof(WBP_jRPG_StatSlot_C_SetComparisonPartToLower, NewValue) == 0x000000, "Member 'WBP_jRPG_StatSlot_C_SetComparisonPartToLower::NewValue' has a wrong offset!");
static_assert(offsetof(WBP_jRPG_StatSlot_C_SetComparisonPartToLower, K2Node_MakeStruct_SlateColor) == 0x000008, "Member 'WBP_jRPG_StatSlot_C_SetComparisonPartToLower::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(WBP_jRPG_StatSlot_C_SetComparisonPartToLower, CallFunc_Conv_DoubleToText_ReturnValue) == 0x000020, "Member 'WBP_jRPG_StatSlot_C_SetComparisonPartToLower::CallFunc_Conv_DoubleToText_ReturnValue' has a wrong offset!");

// Function WBP_jRPG_StatSlot.WBP_jRPG_StatSlot_C.SetComparisonPartToTheSame
// 0x0030 (0x0030 - 0x0000)
struct WBP_jRPG_StatSlot_C_SetComparisonPartToTheSame final
{
public:
	double                                        Value;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0008(0x0014)()
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue;            // 0x0020(0x0010)()
};
static_assert(alignof(WBP_jRPG_StatSlot_C_SetComparisonPartToTheSame) == 0x000008, "Wrong alignment on WBP_jRPG_StatSlot_C_SetComparisonPartToTheSame");
static_assert(sizeof(WBP_jRPG_StatSlot_C_SetComparisonPartToTheSame) == 0x000030, "Wrong size on WBP_jRPG_StatSlot_C_SetComparisonPartToTheSame");
static_assert(offsetof(WBP_jRPG_StatSlot_C_SetComparisonPartToTheSame, Value) == 0x000000, "Member 'WBP_jRPG_StatSlot_C_SetComparisonPartToTheSame::Value' has a wrong offset!");
static_assert(offsetof(WBP_jRPG_StatSlot_C_SetComparisonPartToTheSame, K2Node_MakeStruct_SlateColor) == 0x000008, "Member 'WBP_jRPG_StatSlot_C_SetComparisonPartToTheSame::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(WBP_jRPG_StatSlot_C_SetComparisonPartToTheSame, CallFunc_Conv_DoubleToText_ReturnValue) == 0x000020, "Member 'WBP_jRPG_StatSlot_C_SetComparisonPartToTheSame::CallFunc_Conv_DoubleToText_ReturnValue' has a wrong offset!");

}

