#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Merchant_Item_Row

#include "Basic.hpp"

#include "EWeaponQuality_structs.hpp"
#include "Engine_structs.hpp"
#include "S_MerchantItemSellData_structs.hpp"
#include "CommonUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Merchant_Item_Row.WBP_Merchant_Item_Row_C
// 0x01F8 (0x0500 - 0x0308)
class UWBP_Merchant_Item_Row_C final : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0308(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonLazyImage*                       CurrencyIcon;                                      // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonLazyImage*                       FightIcon;                                         // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ItemIcon_C*                        ItemIcon;                                          // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_WeaponLevel_C*                     ItemLevel;                                         // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_WrappingText_C*                    ItemName;                                          // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           OwnedBox;                                          // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_WeaponLevel_C*                     OwnedLevel;                                        // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextBlock_AvailableQuantity;                       // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextBlock_OwnedQuantity;                           // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextBlock_Price;                                   // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_BaseButton_C*                      WBP_BaseButton;                                    // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FS_MerchantItemSellData                MerchantItem;                                      // 0x0368(0x0170)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(class UWBP_Merchant_Item_Row_C* Widget)> OnMerchantItemFocused;    // 0x04D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnMerchantItemUnfocused;                           // 0x04E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UBP_ItemInstance_Gear_C*                OwnedGearItem;                                     // 0x04F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_Merchant_Item_Row_WBP_BaseButton_K2Node_ComponentBoundEvent_0_OnButtonBaseFocused__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_Merchant_Item_Row_WBP_BaseButton_K2Node_ComponentBoundEvent_1_OnButtonBaseUnfocused__DelegateSignature(class UCommonButtonBase* Button);
	bool CanBuyItem();
	void Construct();
	void ExecuteUbergraph_WBP_Merchant_Item_Row(int32 EntryPoint);
	void GetMerchantItem(struct FS_MerchantItemSellData* MerchantItem_0);
	bool IsItemVisible();
	void IsMerchantItemBetterThanOwnedItem(bool* Return_Value);
	bool IsPicto();
	bool IsWeapon();
	void LoadMerchantItem(const struct FS_MerchantItemSellData& MerchantSellItem);
	void Update_Owned_Widgets();
	void Update_Price_Widget();
	void UpdateContent();
	void UpdateItemIcon();
	void UpdateItemLevel();
	void UpdateItemWidget();
	void UpdateOwnedItemInstanceFromInventory();
	void UpdateRemainingQuantityWidget();
	void UpdateWidgetColor();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Merchant_Item_Row_C">();
	}
	static class UWBP_Merchant_Item_Row_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Merchant_Item_Row_C>();
	}
};
static_assert(alignof(UWBP_Merchant_Item_Row_C) == 0x000008, "Wrong alignment on UWBP_Merchant_Item_Row_C");
static_assert(sizeof(UWBP_Merchant_Item_Row_C) == 0x000500, "Wrong size on UWBP_Merchant_Item_Row_C");
static_assert(offsetof(UWBP_Merchant_Item_Row_C, UberGraphFrame) == 0x000308, "Member 'UWBP_Merchant_Item_Row_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Merchant_Item_Row_C, CurrencyIcon) == 0x000310, "Member 'UWBP_Merchant_Item_Row_C::CurrencyIcon' has a wrong offset!");
static_assert(offsetof(UWBP_Merchant_Item_Row_C, FightIcon) == 0x000318, "Member 'UWBP_Merchant_Item_Row_C::FightIcon' has a wrong offset!");
static_assert(offsetof(UWBP_Merchant_Item_Row_C, ItemIcon) == 0x000320, "Member 'UWBP_Merchant_Item_Row_C::ItemIcon' has a wrong offset!");
static_assert(offsetof(UWBP_Merchant_Item_Row_C, ItemLevel) == 0x000328, "Member 'UWBP_Merchant_Item_Row_C::ItemLevel' has a wrong offset!");
static_assert(offsetof(UWBP_Merchant_Item_Row_C, ItemName) == 0x000330, "Member 'UWBP_Merchant_Item_Row_C::ItemName' has a wrong offset!");
static_assert(offsetof(UWBP_Merchant_Item_Row_C, OwnedBox) == 0x000338, "Member 'UWBP_Merchant_Item_Row_C::OwnedBox' has a wrong offset!");
static_assert(offsetof(UWBP_Merchant_Item_Row_C, OwnedLevel) == 0x000340, "Member 'UWBP_Merchant_Item_Row_C::OwnedLevel' has a wrong offset!");
static_assert(offsetof(UWBP_Merchant_Item_Row_C, TextBlock_AvailableQuantity) == 0x000348, "Member 'UWBP_Merchant_Item_Row_C::TextBlock_AvailableQuantity' has a wrong offset!");
static_assert(offsetof(UWBP_Merchant_Item_Row_C, TextBlock_OwnedQuantity) == 0x000350, "Member 'UWBP_Merchant_Item_Row_C::TextBlock_OwnedQuantity' has a wrong offset!");
static_assert(offsetof(UWBP_Merchant_Item_Row_C, TextBlock_Price) == 0x000358, "Member 'UWBP_Merchant_Item_Row_C::TextBlock_Price' has a wrong offset!");
static_assert(offsetof(UWBP_Merchant_Item_Row_C, WBP_BaseButton) == 0x000360, "Member 'UWBP_Merchant_Item_Row_C::WBP_BaseButton' has a wrong offset!");
static_assert(offsetof(UWBP_Merchant_Item_Row_C, MerchantItem) == 0x000368, "Member 'UWBP_Merchant_Item_Row_C::MerchantItem' has a wrong offset!");
static_assert(offsetof(UWBP_Merchant_Item_Row_C, OnMerchantItemFocused) == 0x0004D8, "Member 'UWBP_Merchant_Item_Row_C::OnMerchantItemFocused' has a wrong offset!");
static_assert(offsetof(UWBP_Merchant_Item_Row_C, OnMerchantItemUnfocused) == 0x0004E8, "Member 'UWBP_Merchant_Item_Row_C::OnMerchantItemUnfocused' has a wrong offset!");
static_assert(offsetof(UWBP_Merchant_Item_Row_C, OwnedGearItem) == 0x0004F8, "Member 'UWBP_Merchant_Item_Row_C::OwnedGearItem' has a wrong offset!");

}

