#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_WatermarkElement

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_WatermarkElement.WBP_WatermarkElement_C
// 0x0038 (0x0318 - 0x02E0)
class UWBP_WatermarkElement_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anim_FadeOUT;                                      // 0x02E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_FadeIN;                                       // 0x02F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock;                                         // 0x02F8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   BuildID;                                           // 0x0300(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)
	double                                        Playback_Speed;                                    // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Appear();
	void Disappear();
	void ExecuteUbergraph_WBP_WatermarkElement(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_WatermarkElement_C">();
	}
	static class UWBP_WatermarkElement_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_WatermarkElement_C>();
	}
};
static_assert(alignof(UWBP_WatermarkElement_C) == 0x000008, "Wrong alignment on UWBP_WatermarkElement_C");
static_assert(sizeof(UWBP_WatermarkElement_C) == 0x000318, "Wrong size on UWBP_WatermarkElement_C");
static_assert(offsetof(UWBP_WatermarkElement_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_WatermarkElement_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_WatermarkElement_C, Anim_FadeOUT) == 0x0002E8, "Member 'UWBP_WatermarkElement_C::Anim_FadeOUT' has a wrong offset!");
static_assert(offsetof(UWBP_WatermarkElement_C, Anim_FadeIN) == 0x0002F0, "Member 'UWBP_WatermarkElement_C::Anim_FadeIN' has a wrong offset!");
static_assert(offsetof(UWBP_WatermarkElement_C, TextBlock) == 0x0002F8, "Member 'UWBP_WatermarkElement_C::TextBlock' has a wrong offset!");
static_assert(offsetof(UWBP_WatermarkElement_C, BuildID) == 0x000300, "Member 'UWBP_WatermarkElement_C::BuildID' has a wrong offset!");
static_assert(offsetof(UWBP_WatermarkElement_C, Playback_Speed) == 0x000310, "Member 'UWBP_WatermarkElement_C::Playback_Speed' has a wrong offset!");

}

