#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Battle_CharacterOverheadState_Base

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_Battle_CharacterOverheadState_Base.WBP_Battle_CharacterOverheadState_Base_C.ComputeDesiredVisibility
// 0x0002 (0x0002 - 0x0000)
struct WBP_Battle_CharacterOverheadState_Base_C_ComputeDesiredVisibility final
{
public:
	bool                                          DesiredVisibility;                                 // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Battle_CharacterOverheadState_Base_C_ComputeDesiredVisibility) == 0x000001, "Wrong alignment on WBP_Battle_CharacterOverheadState_Base_C_ComputeDesiredVisibility");
static_assert(sizeof(WBP_Battle_CharacterOverheadState_Base_C_ComputeDesiredVisibility) == 0x000002, "Wrong size on WBP_Battle_CharacterOverheadState_Base_C_ComputeDesiredVisibility");
static_assert(offsetof(WBP_Battle_CharacterOverheadState_Base_C_ComputeDesiredVisibility, DesiredVisibility) == 0x000000, "Member 'WBP_Battle_CharacterOverheadState_Base_C_ComputeDesiredVisibility::DesiredVisibility' has a wrong offset!");
static_assert(offsetof(WBP_Battle_CharacterOverheadState_Base_C_ComputeDesiredVisibility, CallFunc_BooleanOR_ReturnValue) == 0x000001, "Member 'WBP_Battle_CharacterOverheadState_Base_C_ComputeDesiredVisibility::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function WBP_Battle_CharacterOverheadState_Base.WBP_Battle_CharacterOverheadState_Base_C.GetBattleBuffContainer
// 0x0008 (0x0008 - 0x0000)
struct WBP_Battle_CharacterOverheadState_Base_C_GetBattleBuffContainer final
{
public:
	class UWBP_BattleEffectsBox_C*                BattleEffectBox;                                   // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Battle_CharacterOverheadState_Base_C_GetBattleBuffContainer) == 0x000008, "Wrong alignment on WBP_Battle_CharacterOverheadState_Base_C_GetBattleBuffContainer");
static_assert(sizeof(WBP_Battle_CharacterOverheadState_Base_C_GetBattleBuffContainer) == 0x000008, "Wrong size on WBP_Battle_CharacterOverheadState_Base_C_GetBattleBuffContainer");
static_assert(offsetof(WBP_Battle_CharacterOverheadState_Base_C_GetBattleBuffContainer, BattleEffectBox) == 0x000000, "Member 'WBP_Battle_CharacterOverheadState_Base_C_GetBattleBuffContainer::BattleEffectBox' has a wrong offset!");

// Function WBP_Battle_CharacterOverheadState_Base.WBP_Battle_CharacterOverheadState_Base_C.GetCharacterHealthBar
// 0x0008 (0x0008 - 0x0000)
struct WBP_Battle_CharacterOverheadState_Base_C_GetCharacterHealthBar final
{
public:
	class UWBP_CharacterHealthBar_C*              HealthBar;                                         // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Battle_CharacterOverheadState_Base_C_GetCharacterHealthBar) == 0x000008, "Wrong alignment on WBP_Battle_CharacterOverheadState_Base_C_GetCharacterHealthBar");
static_assert(sizeof(WBP_Battle_CharacterOverheadState_Base_C_GetCharacterHealthBar) == 0x000008, "Wrong size on WBP_Battle_CharacterOverheadState_Base_C_GetCharacterHealthBar");
static_assert(offsetof(WBP_Battle_CharacterOverheadState_Base_C_GetCharacterHealthBar, HealthBar) == 0x000000, "Member 'WBP_Battle_CharacterOverheadState_Base_C_GetCharacterHealthBar::HealthBar' has a wrong offset!");

// Function WBP_Battle_CharacterOverheadState_Base.WBP_Battle_CharacterOverheadState_Base_C.GetExtraIconsContainer
// 0x0008 (0x0008 - 0x0000)
struct WBP_Battle_CharacterOverheadState_Base_C_GetExtraIconsContainer final
{
public:
	class UPanelWidget*                           Panel;                                             // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Battle_CharacterOverheadState_Base_C_GetExtraIconsContainer) == 0x000008, "Wrong alignment on WBP_Battle_CharacterOverheadState_Base_C_GetExtraIconsContainer");
static_assert(sizeof(WBP_Battle_CharacterOverheadState_Base_C_GetExtraIconsContainer) == 0x000008, "Wrong size on WBP_Battle_CharacterOverheadState_Base_C_GetExtraIconsContainer");
static_assert(offsetof(WBP_Battle_CharacterOverheadState_Base_C_GetExtraIconsContainer, Panel) == 0x000000, "Member 'WBP_Battle_CharacterOverheadState_Base_C_GetExtraIconsContainer::Panel' has a wrong offset!");

// Function WBP_Battle_CharacterOverheadState_Base.WBP_Battle_CharacterOverheadState_Base_C.GetStatusEffectContainer
// 0x0008 (0x0008 - 0x0000)
struct WBP_Battle_CharacterOverheadState_Base_C_GetStatusEffectContainer final
{
public:
	class UWBP_BattleEffectsBox_C*                BattleEffectBox;                                   // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Battle_CharacterOverheadState_Base_C_GetStatusEffectContainer) == 0x000008, "Wrong alignment on WBP_Battle_CharacterOverheadState_Base_C_GetStatusEffectContainer");
static_assert(sizeof(WBP_Battle_CharacterOverheadState_Base_C_GetStatusEffectContainer) == 0x000008, "Wrong size on WBP_Battle_CharacterOverheadState_Base_C_GetStatusEffectContainer");
static_assert(offsetof(WBP_Battle_CharacterOverheadState_Base_C_GetStatusEffectContainer, BattleEffectBox) == 0x000000, "Member 'WBP_Battle_CharacterOverheadState_Base_C_GetStatusEffectContainer::BattleEffectBox' has a wrong offset!");

// Function WBP_Battle_CharacterOverheadState_Base.WBP_Battle_CharacterOverheadState_Base_C.ExecuteUbergraph_WBP_Battle_CharacterOverheadState_Base
// 0x00B0 (0x00B0 - 0x0000)
struct WBP_Battle_CharacterOverheadState_Base_C_ExecuteUbergraph_WBP_Battle_CharacterOverheadState_Base final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable;                                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool NewValue)>                K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPackagedForDistribution_ReturnValue;    // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x001C(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetConsoleVariableBoolValue_ReturnValue;  // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAC_jRPG_CharacterBattleStats_C*        K2Node_CustomEvent_BattleStats;                    // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_CharacterHealthBar_C*              CallFunc_GetCharacterHealthBar_HealthBar;          // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCVarRegistered_ReturnValue;             // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetBoolCVar_ReturnValue;                  // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_NewValue;                       // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x007B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelWidget*                           CallFunc_GetExtraIconsContainer_Panel;             // 0x0080(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_BattleEffectsBox_C*                CallFunc_GetStatusEffectContainer_BattleEffectBox; // 0x0090(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_BattleEffectsBox_C*                CallFunc_GetBattleBuffContainer_BattleEffectBox;   // 0x0098(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_1;                              // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A5[0x3];                                       // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Battle_CharacterOverheadState_Base_C_ExecuteUbergraph_WBP_Battle_CharacterOverheadState_Base) == 0x000008, "Wrong alignment on WBP_Battle_CharacterOverheadState_Base_C_ExecuteUbergraph_WBP_Battle_CharacterOverheadState_Base");
static_assert(sizeof(WBP_Battle_CharacterOverheadState_Base_C_ExecuteUbergraph_WBP_Battle_CharacterOverheadState_Base) == 0x0000B0, "Wrong size on WBP_Battle_CharacterOverheadState_Base_C_ExecuteUbergraph_WBP_Battle_CharacterOverheadState_Base");
static_assert(offsetof(WBP_Battle_CharacterOverheadState_Base_C_ExecuteUbergraph_WBP_Battle_CharacterOverheadState_Base, EntryPoint) == 0x000000, "Member 'WBP_Battle_CharacterOverheadState_Base_C_ExecuteUbergraph_WBP_Battle_CharacterOverheadState_Base::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Battle_CharacterOverheadState_Base_C_ExecuteUbergraph_WBP_Battle_CharacterOverheadState_Base, Temp_real_Variable) == 0x000004, "Member 'WBP_Battle_CharacterOverheadState_Base_C_ExecuteUbergraph_WBP_Battle_CharacterOverheadState_Base::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Battle_CharacterOverheadState_Base_C_ExecuteUbergraph_WBP_Battle_CharacterOverheadState_Base, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WBP_Battle_CharacterOverheadState_Base_C_ExecuteUbergraph_WBP_Battle_CharacterOverheadState_Base::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Battle_CharacterOverheadState_Base_C_ExecuteUbergraph_WBP_Battle_CharacterOverheadState_Base, CallFunc_IsPackagedForDistribution_ReturnValue) == 0x000018, "Member 'WBP_Battle_CharacterOverheadState_Base_C_ExecuteUbergraph_WBP_Battle_CharacterOverheadState_Base::CallFunc_IsPackagedForDistribution_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Battle_CharacterOverheadState_Base_C_ExecuteUbergraph_WBP_Battle_CharacterOverheadState_Base, CallFunc_Not_PreBool_ReturnValue) == 0x000019, "Member 'WBP_Battle_CharacterOverheadState_Base_C_ExecuteUbergraph_WBP_Battle_CharacterOverheadState_Base::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Battle_CharacterOverheadState_Base_C_ExecuteUbergraph_WBP_Battle_CharacterOverheadState_Base, K2Node_Event_IsDesignTime) == 0x00001A, "Member 'WBP_Battle_CharacterOverheadState_Base_C_ExecuteUbergraph_WBP_Battle_CharacterOverheadState_Base::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_Battle_CharacterOverheadState_Base_C_ExecuteUbergraph_WBP_Battle_CharacterOverheadState_Base, CallFunc_Not_PreBool_ReturnValue_1) == 0x00001B, "Member 'WBP_Battle_CharacterOverheadState_Base_C_ExecuteUbergraph_WBP_Battle_CharacterOverheadState_Base::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Battle_CharacterOverheadState_Base_C_ExecuteUbergraph_WBP_Battle_CharacterOverheadState_Base, K2Node_Event_MyGeometry) == 0x00001C, "Member 'WBP_Battle_CharacterOverheadState_Base_C_ExecuteUbergraph_WBP_Battle_CharacterOverheadState_Base::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Battle_CharacterOverheadState_Base_C_ExecuteUbergraph_WBP_Battle_CharacterOverheadState_Base, K2Node_Event_InDeltaTime) == 0x000054, "Member 'WBP_Battle_CharacterOverheadState_Base_C_ExecuteUbergraph_WBP_Battle_CharacterOverheadState_Base::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WBP_Battle_CharacterOverheadState_Base_C_ExecuteUbergraph_WBP_Battle_CharacterOverheadState_Base, CallFunc_GetConsoleVariableBoolValue_ReturnValue) == 0x000058, "Member 'WBP_Battle_CharacterOverheadState_Base_C_ExecuteUbergraph_WBP_Battle_CharacterOverheadState_Base::CallFunc_GetConsoleVariableBoolValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Battle_CharacterOverheadState_Base_C_ExecuteUbergraph_WBP_Battle_CharacterOverheadState_Base, K2Node_CustomEvent_BattleStats) == 0x000060, "Member 'WBP_Battle_CharacterOverheadState_Base_C_ExecuteUbergraph_WBP_Battle_CharacterOverheadState_Base::K2Node_CustomEvent_BattleStats' has a wrong offset!");
static_assert(offsetof(WBP_Battle_CharacterOverheadState_Base_C_ExecuteUbergraph_WBP_Battle_CharacterOverheadState_Base, CallFunc_GetCharacterHealthBar_HealthBar) == 0x000068, "Member 'WBP_Battle_CharacterOverheadState_Base_C_ExecuteUbergraph_WBP_Battle_CharacterOverheadState_Base::CallFunc_GetCharacterHealthBar_HealthBar' has a wrong offset!");
static_assert(offsetof(WBP_Battle_CharacterOverheadState_Base_C_ExecuteUbergraph_WBP_Battle_CharacterOverheadState_Base, CallFunc_MakeLiteralName_ReturnValue) == 0x000070, "Member 'WBP_Battle_CharacterOverheadState_Base_C_ExecuteUbergraph_WBP_Battle_CharacterOverheadState_Base::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Battle_CharacterOverheadState_Base_C_ExecuteUbergraph_WBP_Battle_CharacterOverheadState_Base, CallFunc_IsCVarRegistered_ReturnValue) == 0x000078, "Member 'WBP_Battle_CharacterOverheadState_Base_C_ExecuteUbergraph_WBP_Battle_CharacterOverheadState_Base::CallFunc_IsCVarRegistered_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Battle_CharacterOverheadState_Base_C_ExecuteUbergraph_WBP_Battle_CharacterOverheadState_Base, CallFunc_GetBoolCVar_ReturnValue) == 0x000079, "Member 'WBP_Battle_CharacterOverheadState_Base_C_ExecuteUbergraph_WBP_Battle_CharacterOverheadState_Base::CallFunc_GetBoolCVar_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Battle_CharacterOverheadState_Base_C_ExecuteUbergraph_WBP_Battle_CharacterOverheadState_Base, K2Node_CustomEvent_NewValue) == 0x00007A, "Member 'WBP_Battle_CharacterOverheadState_Base_C_ExecuteUbergraph_WBP_Battle_CharacterOverheadState_Base::K2Node_CustomEvent_NewValue' has a wrong offset!");
static_assert(offsetof(WBP_Battle_CharacterOverheadState_Base_C_ExecuteUbergraph_WBP_Battle_CharacterOverheadState_Base, CallFunc_Not_PreBool_ReturnValue_2) == 0x00007B, "Member 'WBP_Battle_CharacterOverheadState_Base_C_ExecuteUbergraph_WBP_Battle_CharacterOverheadState_Base::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Battle_CharacterOverheadState_Base_C_ExecuteUbergraph_WBP_Battle_CharacterOverheadState_Base, CallFunc_GetExtraIconsContainer_Panel) == 0x000080, "Member 'WBP_Battle_CharacterOverheadState_Base_C_ExecuteUbergraph_WBP_Battle_CharacterOverheadState_Base::CallFunc_GetExtraIconsContainer_Panel' has a wrong offset!");
static_assert(offsetof(WBP_Battle_CharacterOverheadState_Base_C_ExecuteUbergraph_WBP_Battle_CharacterOverheadState_Base, CallFunc_BooleanAND_ReturnValue) == 0x000088, "Member 'WBP_Battle_CharacterOverheadState_Base_C_ExecuteUbergraph_WBP_Battle_CharacterOverheadState_Base::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Battle_CharacterOverheadState_Base_C_ExecuteUbergraph_WBP_Battle_CharacterOverheadState_Base, CallFunc_GetStatusEffectContainer_BattleEffectBox) == 0x000090, "Member 'WBP_Battle_CharacterOverheadState_Base_C_ExecuteUbergraph_WBP_Battle_CharacterOverheadState_Base::CallFunc_GetStatusEffectContainer_BattleEffectBox' has a wrong offset!");
static_assert(offsetof(WBP_Battle_CharacterOverheadState_Base_C_ExecuteUbergraph_WBP_Battle_CharacterOverheadState_Base, CallFunc_GetBattleBuffContainer_BattleEffectBox) == 0x000098, "Member 'WBP_Battle_CharacterOverheadState_Base_C_ExecuteUbergraph_WBP_Battle_CharacterOverheadState_Base::CallFunc_GetBattleBuffContainer_BattleEffectBox' has a wrong offset!");
static_assert(offsetof(WBP_Battle_CharacterOverheadState_Base_C_ExecuteUbergraph_WBP_Battle_CharacterOverheadState_Base, Temp_real_Variable_1) == 0x0000A0, "Member 'WBP_Battle_CharacterOverheadState_Base_C_ExecuteUbergraph_WBP_Battle_CharacterOverheadState_Base::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Battle_CharacterOverheadState_Base_C_ExecuteUbergraph_WBP_Battle_CharacterOverheadState_Base, Temp_bool_Variable) == 0x0000A4, "Member 'WBP_Battle_CharacterOverheadState_Base_C_ExecuteUbergraph_WBP_Battle_CharacterOverheadState_Base::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Battle_CharacterOverheadState_Base_C_ExecuteUbergraph_WBP_Battle_CharacterOverheadState_Base, K2Node_Select_Default) == 0x0000A8, "Member 'WBP_Battle_CharacterOverheadState_Base_C_ExecuteUbergraph_WBP_Battle_CharacterOverheadState_Base::K2Node_Select_Default' has a wrong offset!");

// Function WBP_Battle_CharacterOverheadState_Base.WBP_Battle_CharacterOverheadState_Base_C.AddExtraIconElement
// 0x0020 (0x0020 - 0x0000)
struct WBP_Battle_CharacterOverheadState_Base_C_AddExtraIconElement final
{
public:
	class UWidget*                                Content;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPanelWidget*                           CallFunc_GetExtraIconsContainer_Panel;             // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Battle_CharacterOverheadState_Base_C_AddExtraIconElement) == 0x000008, "Wrong alignment on WBP_Battle_CharacterOverheadState_Base_C_AddExtraIconElement");
static_assert(sizeof(WBP_Battle_CharacterOverheadState_Base_C_AddExtraIconElement) == 0x000020, "Wrong size on WBP_Battle_CharacterOverheadState_Base_C_AddExtraIconElement");
static_assert(offsetof(WBP_Battle_CharacterOverheadState_Base_C_AddExtraIconElement, Content) == 0x000000, "Member 'WBP_Battle_CharacterOverheadState_Base_C_AddExtraIconElement::Content' has a wrong offset!");
static_assert(offsetof(WBP_Battle_CharacterOverheadState_Base_C_AddExtraIconElement, ReturnValue) == 0x000008, "Member 'WBP_Battle_CharacterOverheadState_Base_C_AddExtraIconElement::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Battle_CharacterOverheadState_Base_C_AddExtraIconElement, CallFunc_GetExtraIconsContainer_Panel) == 0x000010, "Member 'WBP_Battle_CharacterOverheadState_Base_C_AddExtraIconElement::CallFunc_GetExtraIconsContainer_Panel' has a wrong offset!");
static_assert(offsetof(WBP_Battle_CharacterOverheadState_Base_C_AddExtraIconElement, CallFunc_AddChild_ReturnValue) == 0x000018, "Member 'WBP_Battle_CharacterOverheadState_Base_C_AddExtraIconElement::CallFunc_AddChild_ReturnValue' has a wrong offset!");

// Function WBP_Battle_CharacterOverheadState_Base.WBP_Battle_CharacterOverheadState_Base_C.UpdateVisibility
// 0x0003 (0x0003 - 0x0000)
struct WBP_Battle_CharacterOverheadState_Base_C_UpdateVisibility final
{
public:
	bool                                          local_desiredVisibility;                           // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ComputeDesiredVisibility_DesiredVisibility; // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Battle_CharacterOverheadState_Base_C_UpdateVisibility) == 0x000001, "Wrong alignment on WBP_Battle_CharacterOverheadState_Base_C_UpdateVisibility");
static_assert(sizeof(WBP_Battle_CharacterOverheadState_Base_C_UpdateVisibility) == 0x000003, "Wrong size on WBP_Battle_CharacterOverheadState_Base_C_UpdateVisibility");
static_assert(offsetof(WBP_Battle_CharacterOverheadState_Base_C_UpdateVisibility, local_desiredVisibility) == 0x000000, "Member 'WBP_Battle_CharacterOverheadState_Base_C_UpdateVisibility::local_desiredVisibility' has a wrong offset!");
static_assert(offsetof(WBP_Battle_CharacterOverheadState_Base_C_UpdateVisibility, CallFunc_ComputeDesiredVisibility_DesiredVisibility) == 0x000001, "Member 'WBP_Battle_CharacterOverheadState_Base_C_UpdateVisibility::CallFunc_ComputeDesiredVisibility_DesiredVisibility' has a wrong offset!");
static_assert(offsetof(WBP_Battle_CharacterOverheadState_Base_C_UpdateVisibility, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000002, "Member 'WBP_Battle_CharacterOverheadState_Base_C_UpdateVisibility::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");

// Function WBP_Battle_CharacterOverheadState_Base.WBP_Battle_CharacterOverheadState_Base_C.CanHide
// 0x0002 (0x0002 - 0x0000)
struct WBP_Battle_CharacterOverheadState_Base_C_CanHide final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Battle_CharacterOverheadState_Base_C_CanHide) == 0x000001, "Wrong alignment on WBP_Battle_CharacterOverheadState_Base_C_CanHide");
static_assert(sizeof(WBP_Battle_CharacterOverheadState_Base_C_CanHide) == 0x000002, "Wrong size on WBP_Battle_CharacterOverheadState_Base_C_CanHide");
static_assert(offsetof(WBP_Battle_CharacterOverheadState_Base_C_CanHide, ReturnValue) == 0x000000, "Member 'WBP_Battle_CharacterOverheadState_Base_C_CanHide::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Battle_CharacterOverheadState_Base_C_CanHide, CallFunc_Not_PreBool_ReturnValue) == 0x000001, "Member 'WBP_Battle_CharacterOverheadState_Base_C_CanHide::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function WBP_Battle_CharacterOverheadState_Base.WBP_Battle_CharacterOverheadState_Base_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_Battle_CharacterOverheadState_Base_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Battle_CharacterOverheadState_Base_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_Battle_CharacterOverheadState_Base_C_PreConstruct");
static_assert(sizeof(WBP_Battle_CharacterOverheadState_Base_C_PreConstruct) == 0x000001, "Wrong size on WBP_Battle_CharacterOverheadState_Base_C_PreConstruct");
static_assert(offsetof(WBP_Battle_CharacterOverheadState_Base_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_Battle_CharacterOverheadState_Base_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_Battle_CharacterOverheadState_Base.WBP_Battle_CharacterOverheadState_Base_C.Tick
// 0x003C (0x003C - 0x0000)
struct WBP_Battle_CharacterOverheadState_Base_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Battle_CharacterOverheadState_Base_C_Tick) == 0x000004, "Wrong alignment on WBP_Battle_CharacterOverheadState_Base_C_Tick");
static_assert(sizeof(WBP_Battle_CharacterOverheadState_Base_C_Tick) == 0x00003C, "Wrong size on WBP_Battle_CharacterOverheadState_Base_C_Tick");
static_assert(offsetof(WBP_Battle_CharacterOverheadState_Base_C_Tick, MyGeometry) == 0x000000, "Member 'WBP_Battle_CharacterOverheadState_Base_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Battle_CharacterOverheadState_Base_C_Tick, InDeltaTime) == 0x000038, "Member 'WBP_Battle_CharacterOverheadState_Base_C_Tick::InDeltaTime' has a wrong offset!");

// Function WBP_Battle_CharacterOverheadState_Base.WBP_Battle_CharacterOverheadState_Base_C.SetCharacterBattleStats
// 0x0008 (0x0008 - 0x0000)
struct WBP_Battle_CharacterOverheadState_Base_C_SetCharacterBattleStats final
{
public:
	class UAC_jRPG_CharacterBattleStats_C*        BattleStats;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Battle_CharacterOverheadState_Base_C_SetCharacterBattleStats) == 0x000008, "Wrong alignment on WBP_Battle_CharacterOverheadState_Base_C_SetCharacterBattleStats");
static_assert(sizeof(WBP_Battle_CharacterOverheadState_Base_C_SetCharacterBattleStats) == 0x000008, "Wrong size on WBP_Battle_CharacterOverheadState_Base_C_SetCharacterBattleStats");
static_assert(offsetof(WBP_Battle_CharacterOverheadState_Base_C_SetCharacterBattleStats, BattleStats) == 0x000000, "Member 'WBP_Battle_CharacterOverheadState_Base_C_SetCharacterBattleStats::BattleStats' has a wrong offset!");

// Function WBP_Battle_CharacterOverheadState_Base.WBP_Battle_CharacterOverheadState_Base_C.DEBUG_OnCvarChanged_HideUI
// 0x0001 (0x0001 - 0x0000)
struct WBP_Battle_CharacterOverheadState_Base_C_DEBUG_OnCvarChanged_HideUI final
{
public:
	bool                                          NewValue;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Battle_CharacterOverheadState_Base_C_DEBUG_OnCvarChanged_HideUI) == 0x000001, "Wrong alignment on WBP_Battle_CharacterOverheadState_Base_C_DEBUG_OnCvarChanged_HideUI");
static_assert(sizeof(WBP_Battle_CharacterOverheadState_Base_C_DEBUG_OnCvarChanged_HideUI) == 0x000001, "Wrong size on WBP_Battle_CharacterOverheadState_Base_C_DEBUG_OnCvarChanged_HideUI");
static_assert(offsetof(WBP_Battle_CharacterOverheadState_Base_C_DEBUG_OnCvarChanged_HideUI, NewValue) == 0x000000, "Member 'WBP_Battle_CharacterOverheadState_Base_C_DEBUG_OnCvarChanged_HideUI::NewValue' has a wrong offset!");

}

