#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_jRPG_GameOverScreen

#include "Basic.hpp"

#include "S_InteractiveMusicParameters_structs.hpp"
#include "EModalUIResponse_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayCameras_structs.hpp"


namespace SDK::Params
{

// Function WBP_jRPG_GameOverScreen.WBP_jRPG_GameOverScreen_C.Disappear
// 0x0001 (0x0001 - 0x0000)
struct WBP_jRPG_GameOverScreen_C_Disappear final
{
public:
	bool                                          AutoDisappear;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_jRPG_GameOverScreen_C_Disappear) == 0x000001, "Wrong alignment on WBP_jRPG_GameOverScreen_C_Disappear");
static_assert(sizeof(WBP_jRPG_GameOverScreen_C_Disappear) == 0x000001, "Wrong size on WBP_jRPG_GameOverScreen_C_Disappear");
static_assert(offsetof(WBP_jRPG_GameOverScreen_C_Disappear, AutoDisappear) == 0x000000, "Member 'WBP_jRPG_GameOverScreen_C_Disappear::AutoDisappear' has a wrong offset!");

// Function WBP_jRPG_GameOverScreen.WBP_jRPG_GameOverScreen_C.ExecuteUbergraph_WBP_jRPG_GameOverScreen
// 0x02B8 (0x02B8 - 0x0000)
struct WBP_jRPG_GameOverScreen_C_ExecuteUbergraph_WBP_jRPG_GameOverScreen final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0018(0x0010)()
	class FText                                   Temp_text_Variable_1;                              // 0x0028(0x0010)()
	bool                                          Temp_bool_Variable_1;                              // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UCommonTextStyle>           Temp_class_Variable;                               // 0x0040(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TSubclassOf<class UCommonTextStyle>           Temp_class_Variable_1;                             // 0x0048(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0054(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x0064(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameplayCamerasSubsystem*              CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FCameraAnimationHandle                 CallFunc_PlayCameraAnimation_ReturnValue;          // 0x0080(0x0004)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UBP_UINavigationFocusEvent_C*     K2Node_Event_FocusEventBP;                         // 0x0088(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystemWidget*                   K2Node_CustomEvent_FX_PetalExplosion;              // 0x0090(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0098(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_ModalPopup_C*                      CallFunc_CreateModalWindow_OutputPin;              // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EModalUIResponse                              K2Node_CustomEvent_InUserResponse;                 // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x00B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x00D0(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x00E0(0x0048)(HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0130(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0140(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_AutoDisappear;                  // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_149[0x7];                                      // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0150(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x0158(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Select_Default;                             // 0x0160(0x0010)()
	TSubclassOf<class UCommonTextStyle>           K2Node_Select_Default_1;                           // 0x0170(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default_2;                           // 0x0178(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0188(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0198(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x01A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_jRPG_Controller_World_C*            K2Node_DynamicCast_AsBP_J_RPG_Controller_World;    // 0x01A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B1[0x7];                                      // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_jRPG_Controller_World_C*            K2Node_DynamicCast_AsBP_J_RPG_Controller_World_1;  // 0x01B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C1[0x3];                                      // 0x01C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x01C4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D4[0x4];                                      // 0x01D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       K2Node_Select_Default_3;                           // 0x01D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x01E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E9[0x7];                                      // 0x01E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_2;       // 0x01F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UNiagaraUIComponent*                    CallFunc_GetNiagaraComponent_ReturnValue;          // 0x01F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x0200(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0210(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x0218(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_wildcard_Variable;                            // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_229[0x7];                                      // 0x0229(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_BoolToText_ReturnValue;              // 0x0230(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0240(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0288(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Format_ReturnValue;                       // 0x0298(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void(EModalUIResponse InUserResponse)> K2Node_CreateDelegate_OutputDelegate_6;         // 0x02A8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_jRPG_GameOverScreen_C_ExecuteUbergraph_WBP_jRPG_GameOverScreen) == 0x000008, "Wrong alignment on WBP_jRPG_GameOverScreen_C_ExecuteUbergraph_WBP_jRPG_GameOverScreen");
static_assert(sizeof(WBP_jRPG_GameOverScreen_C_ExecuteUbergraph_WBP_jRPG_GameOverScreen) == 0x0002B8, "Wrong size on WBP_jRPG_GameOverScreen_C_ExecuteUbergraph_WBP_jRPG_GameOverScreen");
static_assert(offsetof(WBP_jRPG_GameOverScreen_C_ExecuteUbergraph_WBP_jRPG_GameOverScreen, EntryPoint) == 0x000000, "Member 'WBP_jRPG_GameOverScreen_C_ExecuteUbergraph_WBP_jRPG_GameOverScreen::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_jRPG_GameOverScreen_C_ExecuteUbergraph_WBP_jRPG_GameOverScreen, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'WBP_jRPG_GameOverScreen_C_ExecuteUbergraph_WBP_jRPG_GameOverScreen::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_jRPG_GameOverScreen_C_ExecuteUbergraph_WBP_jRPG_GameOverScreen, Temp_bool_Variable) == 0x000010, "Member 'WBP_jRPG_GameOverScreen_C_ExecuteUbergraph_WBP_jRPG_GameOverScreen::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_jRPG_GameOverScreen_C_ExecuteUbergraph_WBP_jRPG_GameOverScreen, Temp_text_Variable) == 0x000018, "Member 'WBP_jRPG_GameOverScreen_C_ExecuteUbergraph_WBP_jRPG_GameOverScreen::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(WBP_jRPG_GameOverScreen_C_ExecuteUbergraph_WBP_jRPG_GameOverScreen, Temp_text_Variable_1) == 0x000028, "Member 'WBP_jRPG_GameOverScreen_C_ExecuteUbergraph_WBP_jRPG_GameOverScreen::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_jRPG_GameOverScreen_C_ExecuteUbergraph_WBP_jRPG_GameOverScreen, Temp_bool_Variable_1) == 0x000038, "Member 'WBP_jRPG_GameOverScreen_C_ExecuteUbergraph_WBP_jRPG_GameOverScreen::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_jRPG_GameOverScreen_C_ExecuteUbergraph_WBP_jRPG_GameOverScreen, Temp_class_Variable) == 0x000040, "Member 'WBP_jRPG_GameOverScreen_C_ExecuteUbergraph_WBP_jRPG_GameOverScreen::Temp_class_Variable' has a wrong offset!");
static_assert(offsetof(WBP_jRPG_GameOverScreen_C_ExecuteUbergraph_WBP_jRPG_GameOverScreen, Temp_class_Variable_1) == 0x000048, "Member 'WBP_jRPG_GameOverScreen_C_ExecuteUbergraph_WBP_jRPG_GameOverScreen::Temp_class_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_jRPG_GameOverScreen_C_ExecuteUbergraph_WBP_jRPG_GameOverScreen, Temp_bool_Variable_2) == 0x000050, "Member 'WBP_jRPG_GameOverScreen_C_ExecuteUbergraph_WBP_jRPG_GameOverScreen::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_jRPG_GameOverScreen_C_ExecuteUbergraph_WBP_jRPG_GameOverScreen, Temp_struct_Variable) == 0x000054, "Member 'WBP_jRPG_GameOverScreen_C_ExecuteUbergraph_WBP_jRPG_GameOverScreen::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_jRPG_GameOverScreen_C_ExecuteUbergraph_WBP_jRPG_GameOverScreen, Temp_struct_Variable_1) == 0x000064, "Member 'WBP_jRPG_GameOverScreen_C_ExecuteUbergraph_WBP_jRPG_GameOverScreen::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_jRPG_GameOverScreen_C_ExecuteUbergraph_WBP_jRPG_GameOverScreen, Temp_bool_Variable_3) == 0x000074, "Member 'WBP_jRPG_GameOverScreen_C_ExecuteUbergraph_WBP_jRPG_GameOverScreen::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_jRPG_GameOverScreen_C_ExecuteUbergraph_WBP_jRPG_GameOverScreen, CallFunc_GetWorldSubsystem_ReturnValue) == 0x000078, "Member 'WBP_jRPG_GameOverScreen_C_ExecuteUbergraph_WBP_jRPG_GameOverScreen::CallFunc_GetWorldSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_jRPG_GameOverScreen_C_ExecuteUbergraph_WBP_jRPG_GameOverScreen, CallFunc_PlayCameraAnimation_ReturnValue) == 0x000080, "Member 'WBP_jRPG_GameOverScreen_C_ExecuteUbergraph_WBP_jRPG_GameOverScreen::CallFunc_PlayCameraAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_jRPG_GameOverScreen_C_ExecuteUbergraph_WBP_jRPG_GameOverScreen, K2Node_Event_FocusEventBP) == 0x000088, "Member 'WBP_jRPG_GameOverScreen_C_ExecuteUbergraph_WBP_jRPG_GameOverScreen::K2Node_Event_FocusEventBP' has a wrong offset!");
static_assert(offsetof(WBP_jRPG_GameOverScreen_C_ExecuteUbergraph_WBP_jRPG_GameOverScreen, K2Node_CustomEvent_FX_PetalExplosion) == 0x000090, "Member 'WBP_jRPG_GameOverScreen_C_ExecuteUbergraph_WBP_jRPG_GameOverScreen::K2Node_CustomEvent_FX_PetalExplosion' has a wrong offset!");
static_assert(offsetof(WBP_jRPG_GameOverScreen_C_ExecuteUbergraph_WBP_jRPG_GameOverScreen, K2Node_CreateDelegate_OutputDelegate) == 0x000098, "Member 'WBP_jRPG_GameOverScreen_C_ExecuteUbergraph_WBP_jRPG_GameOverScreen::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_jRPG_GameOverScreen_C_ExecuteUbergraph_WBP_jRPG_GameOverScreen, CallFunc_CreateModalWindow_OutputPin) == 0x0000A8, "Member 'WBP_jRPG_GameOverScreen_C_ExecuteUbergraph_WBP_jRPG_GameOverScreen::CallFunc_CreateModalWindow_OutputPin' has a wrong offset!");
static_assert(offsetof(WBP_jRPG_GameOverScreen_C_ExecuteUbergraph_WBP_jRPG_GameOverScreen, K2Node_CustomEvent_InUserResponse) == 0x0000B0, "Member 'WBP_jRPG_GameOverScreen_C_ExecuteUbergraph_WBP_jRPG_GameOverScreen::K2Node_CustomEvent_InUserResponse' has a wrong offset!");
static_assert(offsetof(WBP_jRPG_GameOverScreen_C_ExecuteUbergraph_WBP_jRPG_GameOverScreen, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x0000B8, "Member 'WBP_jRPG_GameOverScreen_C_ExecuteUbergraph_WBP_jRPG_GameOverScreen::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_jRPG_GameOverScreen_C_ExecuteUbergraph_WBP_jRPG_GameOverScreen, K2Node_SwitchEnum_CmpSuccess) == 0x0000C8, "Member 'WBP_jRPG_GameOverScreen_C_ExecuteUbergraph_WBP_jRPG_GameOverScreen::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_jRPG_GameOverScreen_C_ExecuteUbergraph_WBP_jRPG_GameOverScreen, CallFunc_Conv_StringToText_ReturnValue) == 0x0000D0, "Member 'WBP_jRPG_GameOverScreen_C_ExecuteUbergraph_WBP_jRPG_GameOverScreen::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_jRPG_GameOverScreen_C_ExecuteUbergraph_WBP_jRPG_GameOverScreen, K2Node_MakeStruct_FormatArgumentData) == 0x0000E0, "Member 'WBP_jRPG_GameOverScreen_C_ExecuteUbergraph_WBP_jRPG_GameOverScreen::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_jRPG_GameOverScreen_C_ExecuteUbergraph_WBP_jRPG_GameOverScreen, CallFunc_PlayAnimation_ReturnValue) == 0x000128, "Member 'WBP_jRPG_GameOverScreen_C_ExecuteUbergraph_WBP_jRPG_GameOverScreen::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_jRPG_GameOverScreen_C_ExecuteUbergraph_WBP_jRPG_GameOverScreen, K2Node_CreateDelegate_OutputDelegate_1) == 0x000130, "Member 'WBP_jRPG_GameOverScreen_C_ExecuteUbergraph_WBP_jRPG_GameOverScreen::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_jRPG_GameOverScreen_C_ExecuteUbergraph_WBP_jRPG_GameOverScreen, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000140, "Member 'WBP_jRPG_GameOverScreen_C_ExecuteUbergraph_WBP_jRPG_GameOverScreen::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_jRPG_GameOverScreen_C_ExecuteUbergraph_WBP_jRPG_GameOverScreen, K2Node_CustomEvent_AutoDisappear) == 0x000148, "Member 'WBP_jRPG_GameOverScreen_C_ExecuteUbergraph_WBP_jRPG_GameOverScreen::K2Node_CustomEvent_AutoDisappear' has a wrong offset!");
static_assert(offsetof(WBP_jRPG_GameOverScreen_C_ExecuteUbergraph_WBP_jRPG_GameOverScreen, CallFunc_PlayAnimationForward_ReturnValue) == 0x000150, "Member 'WBP_jRPG_GameOverScreen_C_ExecuteUbergraph_WBP_jRPG_GameOverScreen::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_jRPG_GameOverScreen_C_ExecuteUbergraph_WBP_jRPG_GameOverScreen, CallFunc_PlayAnimationForward_ReturnValue_1) == 0x000158, "Member 'WBP_jRPG_GameOverScreen_C_ExecuteUbergraph_WBP_jRPG_GameOverScreen::CallFunc_PlayAnimationForward_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_jRPG_GameOverScreen_C_ExecuteUbergraph_WBP_jRPG_GameOverScreen, K2Node_Select_Default) == 0x000160, "Member 'WBP_jRPG_GameOverScreen_C_ExecuteUbergraph_WBP_jRPG_GameOverScreen::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_jRPG_GameOverScreen_C_ExecuteUbergraph_WBP_jRPG_GameOverScreen, K2Node_Select_Default_1) == 0x000170, "Member 'WBP_jRPG_GameOverScreen_C_ExecuteUbergraph_WBP_jRPG_GameOverScreen::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_jRPG_GameOverScreen_C_ExecuteUbergraph_WBP_jRPG_GameOverScreen, K2Node_Select_Default_2) == 0x000178, "Member 'WBP_jRPG_GameOverScreen_C_ExecuteUbergraph_WBP_jRPG_GameOverScreen::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(WBP_jRPG_GameOverScreen_C_ExecuteUbergraph_WBP_jRPG_GameOverScreen, K2Node_CreateDelegate_OutputDelegate_2) == 0x000188, "Member 'WBP_jRPG_GameOverScreen_C_ExecuteUbergraph_WBP_jRPG_GameOverScreen::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_jRPG_GameOverScreen_C_ExecuteUbergraph_WBP_jRPG_GameOverScreen, CallFunc_GetPlayerController_ReturnValue_1) == 0x000198, "Member 'WBP_jRPG_GameOverScreen_C_ExecuteUbergraph_WBP_jRPG_GameOverScreen::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_jRPG_GameOverScreen_C_ExecuteUbergraph_WBP_jRPG_GameOverScreen, CallFunc_GetPlayerController_ReturnValue_2) == 0x0001A0, "Member 'WBP_jRPG_GameOverScreen_C_ExecuteUbergraph_WBP_jRPG_GameOverScreen::CallFunc_GetPlayerController_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_jRPG_GameOverScreen_C_ExecuteUbergraph_WBP_jRPG_GameOverScreen, K2Node_DynamicCast_AsBP_J_RPG_Controller_World) == 0x0001A8, "Member 'WBP_jRPG_GameOverScreen_C_ExecuteUbergraph_WBP_jRPG_GameOverScreen::K2Node_DynamicCast_AsBP_J_RPG_Controller_World' has a wrong offset!");
static_assert(offsetof(WBP_jRPG_GameOverScreen_C_ExecuteUbergraph_WBP_jRPG_GameOverScreen, K2Node_DynamicCast_bSuccess) == 0x0001B0, "Member 'WBP_jRPG_GameOverScreen_C_ExecuteUbergraph_WBP_jRPG_GameOverScreen::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_jRPG_GameOverScreen_C_ExecuteUbergraph_WBP_jRPG_GameOverScreen, K2Node_DynamicCast_AsBP_J_RPG_Controller_World_1) == 0x0001B8, "Member 'WBP_jRPG_GameOverScreen_C_ExecuteUbergraph_WBP_jRPG_GameOverScreen::K2Node_DynamicCast_AsBP_J_RPG_Controller_World_1' has a wrong offset!");
static_assert(offsetof(WBP_jRPG_GameOverScreen_C_ExecuteUbergraph_WBP_jRPG_GameOverScreen, K2Node_DynamicCast_bSuccess_1) == 0x0001C0, "Member 'WBP_jRPG_GameOverScreen_C_ExecuteUbergraph_WBP_jRPG_GameOverScreen::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_jRPG_GameOverScreen_C_ExecuteUbergraph_WBP_jRPG_GameOverScreen, K2Node_CreateDelegate_OutputDelegate_3) == 0x0001C4, "Member 'WBP_jRPG_GameOverScreen_C_ExecuteUbergraph_WBP_jRPG_GameOverScreen::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_jRPG_GameOverScreen_C_ExecuteUbergraph_WBP_jRPG_GameOverScreen, K2Node_Select_Default_3) == 0x0001D8, "Member 'WBP_jRPG_GameOverScreen_C_ExecuteUbergraph_WBP_jRPG_GameOverScreen::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(WBP_jRPG_GameOverScreen_C_ExecuteUbergraph_WBP_jRPG_GameOverScreen, CallFunc_PlayAnimation_ReturnValue_1) == 0x0001E0, "Member 'WBP_jRPG_GameOverScreen_C_ExecuteUbergraph_WBP_jRPG_GameOverScreen::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_jRPG_GameOverScreen_C_ExecuteUbergraph_WBP_jRPG_GameOverScreen, K2Node_Event_IsDesignTime) == 0x0001E8, "Member 'WBP_jRPG_GameOverScreen_C_ExecuteUbergraph_WBP_jRPG_GameOverScreen::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_jRPG_GameOverScreen_C_ExecuteUbergraph_WBP_jRPG_GameOverScreen, CallFunc_PlayAnimationForward_ReturnValue_2) == 0x0001F0, "Member 'WBP_jRPG_GameOverScreen_C_ExecuteUbergraph_WBP_jRPG_GameOverScreen::CallFunc_PlayAnimationForward_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_jRPG_GameOverScreen_C_ExecuteUbergraph_WBP_jRPG_GameOverScreen, CallFunc_GetNiagaraComponent_ReturnValue) == 0x0001F8, "Member 'WBP_jRPG_GameOverScreen_C_ExecuteUbergraph_WBP_jRPG_GameOverScreen::CallFunc_GetNiagaraComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_jRPG_GameOverScreen_C_ExecuteUbergraph_WBP_jRPG_GameOverScreen, K2Node_CreateDelegate_OutputDelegate_4) == 0x000200, "Member 'WBP_jRPG_GameOverScreen_C_ExecuteUbergraph_WBP_jRPG_GameOverScreen::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(WBP_jRPG_GameOverScreen_C_ExecuteUbergraph_WBP_jRPG_GameOverScreen, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000210, "Member 'WBP_jRPG_GameOverScreen_C_ExecuteUbergraph_WBP_jRPG_GameOverScreen::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_jRPG_GameOverScreen_C_ExecuteUbergraph_WBP_jRPG_GameOverScreen, K2Node_CreateDelegate_OutputDelegate_5) == 0x000218, "Member 'WBP_jRPG_GameOverScreen_C_ExecuteUbergraph_WBP_jRPG_GameOverScreen::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(WBP_jRPG_GameOverScreen_C_ExecuteUbergraph_WBP_jRPG_GameOverScreen, Temp_wildcard_Variable) == 0x000228, "Member 'WBP_jRPG_GameOverScreen_C_ExecuteUbergraph_WBP_jRPG_GameOverScreen::Temp_wildcard_Variable' has a wrong offset!");
static_assert(offsetof(WBP_jRPG_GameOverScreen_C_ExecuteUbergraph_WBP_jRPG_GameOverScreen, CallFunc_Conv_BoolToText_ReturnValue) == 0x000230, "Member 'WBP_jRPG_GameOverScreen_C_ExecuteUbergraph_WBP_jRPG_GameOverScreen::CallFunc_Conv_BoolToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_jRPG_GameOverScreen_C_ExecuteUbergraph_WBP_jRPG_GameOverScreen, K2Node_MakeStruct_FormatArgumentData_1) == 0x000240, "Member 'WBP_jRPG_GameOverScreen_C_ExecuteUbergraph_WBP_jRPG_GameOverScreen::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WBP_jRPG_GameOverScreen_C_ExecuteUbergraph_WBP_jRPG_GameOverScreen, K2Node_MakeArray_Array) == 0x000288, "Member 'WBP_jRPG_GameOverScreen_C_ExecuteUbergraph_WBP_jRPG_GameOverScreen::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_jRPG_GameOverScreen_C_ExecuteUbergraph_WBP_jRPG_GameOverScreen, CallFunc_Format_ReturnValue) == 0x000298, "Member 'WBP_jRPG_GameOverScreen_C_ExecuteUbergraph_WBP_jRPG_GameOverScreen::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_jRPG_GameOverScreen_C_ExecuteUbergraph_WBP_jRPG_GameOverScreen, K2Node_CreateDelegate_OutputDelegate_6) == 0x0002A8, "Member 'WBP_jRPG_GameOverScreen_C_ExecuteUbergraph_WBP_jRPG_GameOverScreen::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");

// Function WBP_jRPG_GameOverScreen.WBP_jRPG_GameOverScreen_C.FX_PetalExplosion_Event
// 0x0008 (0x0008 - 0x0000)
struct WBP_jRPG_GameOverScreen_C_FX_PetalExplosion_Event final
{
public:
	class UNiagaraSystemWidget*                   FX_PetalExplosion_0;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_jRPG_GameOverScreen_C_FX_PetalExplosion_Event) == 0x000008, "Wrong alignment on WBP_jRPG_GameOverScreen_C_FX_PetalExplosion_Event");
static_assert(sizeof(WBP_jRPG_GameOverScreen_C_FX_PetalExplosion_Event) == 0x000008, "Wrong size on WBP_jRPG_GameOverScreen_C_FX_PetalExplosion_Event");
static_assert(offsetof(WBP_jRPG_GameOverScreen_C_FX_PetalExplosion_Event, FX_PetalExplosion_0) == 0x000000, "Member 'WBP_jRPG_GameOverScreen_C_FX_PetalExplosion_Event::FX_PetalExplosion_0' has a wrong offset!");

// Function WBP_jRPG_GameOverScreen.WBP_jRPG_GameOverScreen_C.GetTiedObject
// 0x0008 (0x0008 - 0x0000)
struct WBP_jRPG_GameOverScreen_C_GetTiedObject final
{
public:
	class UObject*                                Object;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_jRPG_GameOverScreen_C_GetTiedObject) == 0x000008, "Wrong alignment on WBP_jRPG_GameOverScreen_C_GetTiedObject");
static_assert(sizeof(WBP_jRPG_GameOverScreen_C_GetTiedObject) == 0x000008, "Wrong size on WBP_jRPG_GameOverScreen_C_GetTiedObject");
static_assert(offsetof(WBP_jRPG_GameOverScreen_C_GetTiedObject, Object) == 0x000000, "Member 'WBP_jRPG_GameOverScreen_C_GetTiedObject::Object' has a wrong offset!");

// Function WBP_jRPG_GameOverScreen.WBP_jRPG_GameOverScreen_C.OnModalResponse
// 0x0001 (0x0001 - 0x0000)
struct WBP_jRPG_GameOverScreen_C_OnModalResponse final
{
public:
	EModalUIResponse                              InUserResponse;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_jRPG_GameOverScreen_C_OnModalResponse) == 0x000001, "Wrong alignment on WBP_jRPG_GameOverScreen_C_OnModalResponse");
static_assert(sizeof(WBP_jRPG_GameOverScreen_C_OnModalResponse) == 0x000001, "Wrong size on WBP_jRPG_GameOverScreen_C_OnModalResponse");
static_assert(offsetof(WBP_jRPG_GameOverScreen_C_OnModalResponse, InUserResponse) == 0x000000, "Member 'WBP_jRPG_GameOverScreen_C_OnModalResponse::InUserResponse' has a wrong offset!");

// Function WBP_jRPG_GameOverScreen.WBP_jRPG_GameOverScreen_C.OnUINavigationFocus
// 0x0008 (0x0008 - 0x0000)
struct WBP_jRPG_GameOverScreen_C_OnUINavigationFocus final
{
public:
	const class UBP_UINavigationFocusEvent_C*     FocusEventBP;                                      // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_jRPG_GameOverScreen_C_OnUINavigationFocus) == 0x000008, "Wrong alignment on WBP_jRPG_GameOverScreen_C_OnUINavigationFocus");
static_assert(sizeof(WBP_jRPG_GameOverScreen_C_OnUINavigationFocus) == 0x000008, "Wrong size on WBP_jRPG_GameOverScreen_C_OnUINavigationFocus");
static_assert(offsetof(WBP_jRPG_GameOverScreen_C_OnUINavigationFocus, FocusEventBP) == 0x000000, "Member 'WBP_jRPG_GameOverScreen_C_OnUINavigationFocus::FocusEventBP' has a wrong offset!");

// Function WBP_jRPG_GameOverScreen.WBP_jRPG_GameOverScreen_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_jRPG_GameOverScreen_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_jRPG_GameOverScreen_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_jRPG_GameOverScreen_C_PreConstruct");
static_assert(sizeof(WBP_jRPG_GameOverScreen_C_PreConstruct) == 0x000001, "Wrong size on WBP_jRPG_GameOverScreen_C_PreConstruct");
static_assert(offsetof(WBP_jRPG_GameOverScreen_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_jRPG_GameOverScreen_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_jRPG_GameOverScreen.WBP_jRPG_GameOverScreen_C.SequenceEvent__ENTRYPOINTWBP_jRPG_GameOverScreen
// 0x0008 (0x0008 - 0x0000)
struct WBP_jRPG_GameOverScreen_C_SequenceEvent__ENTRYPOINTWBP_jRPG_GameOverScreen final
{
public:
	class UNiagaraSystemWidget*                   FX_PetalExplosion_0;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_jRPG_GameOverScreen_C_SequenceEvent__ENTRYPOINTWBP_jRPG_GameOverScreen) == 0x000008, "Wrong alignment on WBP_jRPG_GameOverScreen_C_SequenceEvent__ENTRYPOINTWBP_jRPG_GameOverScreen");
static_assert(sizeof(WBP_jRPG_GameOverScreen_C_SequenceEvent__ENTRYPOINTWBP_jRPG_GameOverScreen) == 0x000008, "Wrong size on WBP_jRPG_GameOverScreen_C_SequenceEvent__ENTRYPOINTWBP_jRPG_GameOverScreen");
static_assert(offsetof(WBP_jRPG_GameOverScreen_C_SequenceEvent__ENTRYPOINTWBP_jRPG_GameOverScreen, FX_PetalExplosion_0) == 0x000000, "Member 'WBP_jRPG_GameOverScreen_C_SequenceEvent__ENTRYPOINTWBP_jRPG_GameOverScreen::FX_PetalExplosion_0' has a wrong offset!");

// Function WBP_jRPG_GameOverScreen.WBP_jRPG_GameOverScreen_C.StopMusic
// 0x0020 (0x0020 - 0x0000)
struct WBP_jRPG_GameOverScreen_C_StopMusic final
{
public:
	class UBP_jRPG_GI_Custom_C*                   CallFunc_GetCustomGI_ReturnValue;                  // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FS_InteractiveMusicParameters          K2Node_MakeStruct_S_InteractiveMusicParameters;    // 0x0008(0x0018)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_jRPG_GameOverScreen_C_StopMusic) == 0x000008, "Wrong alignment on WBP_jRPG_GameOverScreen_C_StopMusic");
static_assert(sizeof(WBP_jRPG_GameOverScreen_C_StopMusic) == 0x000020, "Wrong size on WBP_jRPG_GameOverScreen_C_StopMusic");
static_assert(offsetof(WBP_jRPG_GameOverScreen_C_StopMusic, CallFunc_GetCustomGI_ReturnValue) == 0x000000, "Member 'WBP_jRPG_GameOverScreen_C_StopMusic::CallFunc_GetCustomGI_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_jRPG_GameOverScreen_C_StopMusic, K2Node_MakeStruct_S_InteractiveMusicParameters) == 0x000008, "Member 'WBP_jRPG_GameOverScreen_C_StopMusic::K2Node_MakeStruct_S_InteractiveMusicParameters' has a wrong offset!");

}

